{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Warcraft\nReview Date: 2016/06/26\nStore: Travis Fimmel  (Actor),     Paula Patton  (Actor),     Duncan Jones  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product description', 'WARCRAFT DESCRIPTION', 'BONUS FEATURES', '-', 'Deleted/Extended scenes', '-', 'Gag reel', '-', 'Origin story', '-', 'The fandom of Warcraft', '-', 'ILM: Behind the magic of Warcraft', 'BLU-RAY EXCLUSIVES', '-', 'Warcraft: Bonds of brotherhood motion comic', '-', 'The World of Warcraft on film: Talent, VFX, Stunts and more', '-', 'Warcraft: The Madame Tussauds experience', '-', 'Warcraft teaser 2013', \"When the world of the Orcs of Draenor is being destroyed by the evil fel magic that uses life-force, the powerful warlock Gul'dan creates a portal to the world of Azeroth and forms the Horde with members of the Orc clans. He also captures many prisoners to keep the portal open. The king of Azeroth, Llane Wrynn and his brother-in-law, Anduin Lothar are informed by the apprentice of magician Khadgar that he has found fel magic in dead bodies and the king decides to summon the Guardian of Tirisfal, Medivh, to protect his kingdom. Lothar and Khadgar head to Kharazhan to meet Medivh and an ominous shadow points a book out to Khadgar, who takes it and hides. Anduin, Khadgar and Medivh and a group of soldiers are attacked by Orcs and they capture the slave Garona, who is released by King Llane, and she shows them the location of the portal. Garona is contacted by the Orc chief of a clan Durotan that wants to meet King Llane to stop the fel magic\", 'Additional Features', 'Includes Dolby Atmos \\uf02d Dolby Atmos is a revolutionary new audio technology that transports you into extraordinary entertainment experience. With Dolby Atmos enabled receivers and speaker configurations, sound comes from all directions, including overhead, to create an immersive experience with clarity, richness, details, and depth. With existing home theater systems, you will get a great surround sound experience.']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 4 Ounces', 'Item model number': '42927659', 'Director': 'Duncan Jones', 'Media Format': 'Blu-ray, Digital_copy, DVD-ROM', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 27, 2016', 'Actors': 'Travis Fimmel, Paula Patton, Ben Foster, Dominic Cooper, Toby Kebbell', 'Subtitles': 'French, Spanish', 'Producers': 'Charles Roven, Thomas Tull, Jon Jashni, Alex Gartner, Stuart Fenegan', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Charles Leavitt, Duncan Jones', 'Number of discs': '2'}\nReview Text: I went to see the movie twice in theaters already, and plan to purchase the Blu-ray, once it's released.  The movie did a great job keeping the spirit of the lore from the game series and (from what I can tell) the novelizations.  Sure, there are some departures from &#34;the way it really happened,&#34; but that was expected, and quite frankly, pretty well done.  The movie itself was fairly grim - some of your favorite characters might suffer (or die?)  I expected the special effects to be on the lame side, but on the contrary, they were very well done (provided you ignore the Kirin Tor members' eyes.)<br /><br />Overall, the movie had enough hat tips to the game series (complete with pop-culure references!) to keep me happy, but did a fine enough job presenting itself to someone who has never played any of the games (one person being my wife, who also thoroughly enjoyed it!)\nReview Title: Thumbs up from a long-time fan of the game\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Antichrist [Blu-ray]\nWillem Dafoe  (Actor),     Charlotte Gainsbourg  (Actor),     Lars von Trier  (Director)    &                   0                  more   Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n{'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Lars von Trier', 'Media Format': 'Blu-ray', 'Actors': 'Willem Dafoe, Charlotte Gainsbourg', 'Studio': 'Zentropa Entertainment'}\nI streamed this one off Netflix.  I've enjoyed von Trier's wor in the past, and Willem Dafoe usually provides a wonderful performance (which could be taken in other ways in this context.)  The movie was amazing in the sense of being a work of art, but I don't think I could watch it a second time (though I'm tempted to buy it just to support von Trier's work.)  It contains intense violence, sex and a rather bizarre story.  I highly recommend it to those who enjoy a smart, artsy film and have strong stomachs.\nIncredibly well done, but extremely morbid.\nLady in the Water [Blu-ray]\nPaul Giamatti  (Actor),     Bryce Dallas Howard  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Lady In The Water (BD)', ']]>']\n{'Genre': 'Fantasy, Suspense, Science Fiction', 'Format': 'AC-3, Blu-ray, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Freddy Rodriguez, Jared Harris, Jeffrey Wright, Bob Balaban, M. Night Shyamalan, Paul Giamatti, Sam Mercer, Sarita Choudhury, Bill Irwin, Bryce Dallas HowardFreddy Rodriguez, Jared Harris, Jeffrey Wright, Bob Balaban, M. Night Shyamalan, Paul Giamatti, Sam Mercer, Sarita Choudhury, Bill Irwin, Bryce Dallas Howard  See more', 'Initial release date': '2006-12-19', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 1.76 Ounces', 'Item model number': '82969', 'Director': 'M. Night Shyamalan', 'Media Format': 'AC-3, Blu-ray, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 19, 2006', 'Actors': 'Paul Giamatti, Bryce Dallas Howard, Bob Balaban, Jeffrey Wright, Sarita Choudhury', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'M. Night Shyamalan, Sam Mercer', 'Studio': 'Studio Distribution Services', 'Writers': 'M. Night Shyamalan', 'Country of Origin': 'USA', 'Number of discs': '1'}\nM Knight Shamalayan made a name for himself with the movie The Sixth Sense, and for good reason.  It was a great movie with a great story and a not entirely predictable \"surprise\" ending.  I also enjoyed his follow-up film, Unbreakable (yet it wasn't too well received.)  Each of his later films, however, have left me disappointed.  Lady in the Water is no different.  He keep trying to  string insane story ideas together, only to cap them off with a \"surprise\" ending.  A surprise ending is only a surprise if you're not expecting it!  Another problem I have is how his characters always seem to just accept whatever's going on in the movie.<br /><br />This film is about a water nymph that's trying to save the world from humanity.  Or maybe it's to save humanity from themselves...  Anyway.  She shows up in the swimming pool of an apartment complex filled with very eccentric tenants.  The landlord of the complex is the man who finds her, and immediately clings to this nymph.  He's not quite too sure what to do with her, but conveniently there's an Asian family (Japanese, I think) that just happens to know the legend.  So, to appease the elder lady of the household (who is the expert of the legend,) he goes through some rather silly exercises.  Once he knows this legend, he goes to all the other tenants for help.  They all immediately buy into his tale and pitch in right away.  As the movie progresses, things become more and more convoluted.  Eventually everyone figures out what to do, and the \"surprise\" happens.  Seriously...  I wasn't surprised in any fashion.  In fact, I predicted what'd happen.<br /><br />Here are the stats:<br /><br />Violence/Blood/Gore:  Almost none.<br />Boobs:  None.<br />Likable characters:  Maybe the landlord?<br />Plot devices that made sense:  None.<br />People in this film that look like Jeff Goldbloom:  M Knight Shamalayan.<br /><br />Over all verdict:  Maybe watch it on cable if you're having a hard time sleeping.  Otherwise skip.\nReally?\nTrue Blood: Season 1\nAnna Paquin  (Actor),     Stephen Moyer  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'True Blood: The Complete First Season (DVD)', 'TRUE BLOOD chronicles the backwoods Louisiana town of Bon Temps... where vampires have emerged from the coffin, and no longer need humans for their fix. Sookie Stackhouse (Anna Paquin, Golden Globe(R)-winner for \"True Blood\", Academy Award®-winner for “The Piano”) works as a waitress at the rural bar Merlotte\\'s. Though outwardly a typical young woman, she keeps a dangerous secret: she has the ability to hear the thoughts of others. Her situation is further complicated when the bar gets its first vampire patron - 173-year old Bill Compton (Steven Moyer, \"Quills\") - and the two outsiders are immediately drawn to each other. Delivering the best of what audiences have come to expect from Creator and Executive Producer Alan Ball (writer of Oscar®-winning Best Picture “American Beauty”, creator of the Emmy® Award-winning HBO® series “Six Feet Under”), TRUE BLOOD is a dark and sexy tale that boldly delves into the heart - and the neck - of the Deep South.', ']]>', 'Amazon.com', 'Alan Ball’s', 'True Blood', 'series works well for television, as it has enough sensationalism to tantalize and enough story girth to make the viewer care about the characters. That one can finally invest emotion into monsters, including an undead Civil War victim, a transformer who can shapeshift into various animals, and a female mind reader, speaks volumes about America’s willingness to accept fantasy. Of course, television has always produced good fantasy shows (', 'I Dream of Jeannie', '), but', 'True Blood’s', 'Southern Goth brand of fun horror is more macabre and more perverse, not to mention gorier, than most shows of its kind to date. Adapted from Charlaine Harris’ Sookie Stackhouse novels,', 'True Blood', 'thrills because of its equal blend in each episode of erotica, humor, tragedy, mystery, and fantasy.', 'Set in a rural, swampy Louisiana parrish, the show centers around Sookie Stackhouse (Anna Paquin) and her clan, sweet grandmother Adele (Lois Smith) and air-headed brother Jason (Ryan Kwanten). Illicit love is spawned early on, when Sookie saves vampire Bill Compton (Stephen Moyer) from having his blood stolen in the parking lot of Merlotte’s diner, owned by Sam Merlotte (Sam Trammell) who completes what will form a complex love triangle. As tensions between Sookie’s suitors loosen or tighten, many side plots, such as her African American best friend Tara’s (Rutina Wesley) struggle with an alcoholic, Bible-thumping mother and her brother’s dangerous crush on drug addicted hippie, Amy Burley (Lizzy Caplan), keep one wondering who will succeed in this podunk place. The main tension throughout, however, is a race war waged between vampires and humans. As murders of “fang bangers” occur (human girls who let vampires bite them) and dumb policeman Andy Bellefleur (Chris Bauer) fails to find clues, one sees the metaphorical implications of vampirism and feels deeper resonance with what can be a downright trashy show. Gossip galore, especially about what kinds of babies interbreeding will produce, is rampant. One of the funniest characters is Tara’s flamboyant cousin, Lafayette (Nelsan Ellis), who deals drugs, works as a fry cook, and services the local white politicians, while making sure he’s always up in everyone’s business.', 'What makes', 'True Blood', 'smarter than pure soap opera is the parallels it draws between its monster mash and actual, familiar societal problems. Sookie and her friends watch the news, where Evangelicals bash vampires and prohibit mixed marriage, and everyone is addicted to V, a.k.a vampire blood, that effects like psychedelic heroin. Even its gore reflects a mix of serious and silly, as vampires explode into red, sticky goop. Though it may not be attempting to qualify for the best vampire footage ever shot,', 'True Blood', 'is as addictive as that substance the town’s youth obsesses over, which is a metaphor in itself. --', 'Trinie Dalton', 'Stills from', 'True Blood', '(Click for larger image)']\n{'Genre': 'Drama, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Box set, Color, Dolby, Widescreen, Subtitled, NTSC, Closed-captioned', 'Contributor': 'William Sanderson, Lois Smith, Rutina Wesley, Nelsan Ellis, Sam Trammell, Ryan Kwanten, Lizzy Caplan, Chris Bauer, Anna Paquin, Stephen MoyerWilliam Sanderson, Lois Smith, Rutina Wesley, Nelsan Ellis, Sam Trammell, Ryan Kwanten, Lizzy Caplan, Chris Bauer, Anna Paquin, Stephen Moyer  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 1.5 inches; 14.4 Ounces', 'Item model number': '5069617', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Widescreen, Subtitled, NTSC, Closed-captioned', 'Run time': '12 hours', 'Release date': 'October 21, 2014', 'Actors': 'Anna Paquin, Stephen Moyer, Sam Trammell, Rutina Wesley, Ryan Kwanten', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'HBO Studios', 'Number of discs': '5'}\nI checked this out to see what all the hype was about.  Horror movies and even vampire stories have always been my favorites.  Campy TV shows like Buffy are right up my ally.  This show, however, reached a level of absurdity that I cannot tolerate.  I begrudgingly made it half way through the third episode before I had to turn it off.  My initial reaction to the first episode stuck through out.  I didn't really care for any of the characters, the dialog was awful and the whole \"forbidden romance between a girl and a vampire\" idea has been played out, beaten up and burned down to the ground already.  To be open minded, I did try to stick this out.  I made it to the third episode hoping that the negative vibe I got would grow a bit.  That didn't happen for me, however.<br /><br />Over all, this show feels like it's made for teenagers with a vampire fetish.\nRidiculous\nDexter: Season 1\nMichael C. Hall  (Actor),     Erik King  (Actor),     Michael Cuesta  (Director),     Tony Goldwyn  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', \"The first season of this creepy dramedy series, originally aired on Showtime, follows Dexter Morgan, a forensics expert who spends his free time as a serial killer, eradicating some of the city's most notorious criminals one by one. Star Michael C. Hall, Jennifer Carpenter, Julie Benz Special Features: Widescreen - 2.40 Audio: Stereo - English Additional Release Material: Audio Commentary - 1. The Cast Featurette - 1. The Academy of Blood - a Killer Course Free Episodes - Showtime's hit show - THE BROTHERHOOD DVD-ROM: Free Showtime Series Episodic Consumer Sweepstakes for a Sony HD Television Runtime: 655 minutes Year of Release: 2007.\", 'Amazon.com', \"An interesting and original idea that's very skillfully executed, Showtime's\", 'Dexter', 'is never less than watchable, often quite compelling, and sometimes thoroughly riveting. As the 12 episodes from the show\\'s first season (packaged here in a four disc set) reveal, it\\'s also the epitome of \"high concept,\" a kind of', 'Silence of the Lambs', 'for the', 'C.S.I.', \"generation. Creator-executive producer James Manos Jr.'s title character, one Dexter Morgan (played by Michael C. Hall of\", 'Six Feet Under', 'renown), works for the Miami Police Department as an blood spatter analyst, visiting crime scenes and helping figure out what happened. He has an avocation, too: during his off hours, he tracks down some very, very bad people who for various reasons have eluded the proper authorities. Seems his adoptive father, a cop himself, taught the kid how to channel his dark side in a \"positive\" direction; and so, having captured these evildoers (including a child molester-murderer and a recidivist drunk driver with a trail of bodies in his wake), Dex dispatches them with clinical precision, thus making him a serial killer who snuffs serial killers. But there\\'s more--', 'much', 'more, as it turns out. By his own description, Dexter is \"a monster,\" an empty shell who fakes all human interactions and admits to no real feelings for anything or anyone, including his foster sister (Jennifer Carter) and his nominal girlfriend (Julie Benz), a former crack addict and battered spouse who\\'s as uninterested in sex as he is. There\\'s an explanation for Dexter\\'s weirdness, of course, one so deep and traumatic that even he isn\\'t aware of it. It\\'s gradually revealed over the course of the season as he and the cops (who include Erik King, Lauren Velez, and David Zayas, all first-rate) track down the so-called \"Ice Truck Killer,\" a fellow monster whose grisly m.o. both fascinates and taunts our hero, leading to a genuinely shocking and squirm-inducing finale.', 'Dexter', \"can be a bit arch, with an ironic, too-hip-for-the-room tone that get a little old. Still, it's a safe bet that anyone who views this first season will be salivating for the second. Extras include audio commentary on two episodes, a featurette about real-life blood spatter analysis, and a variety of DVD-ROM items. --\", 'Sam Graham', 'Beyond', 'Dexter', 'More TV Head-cases on DVD', 'The Book that Started It All', 'More from Showtime', 'Stills from', 'Dexter: The First Season', '(click for larger image)']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Jennifer Carpenter, Tony Goldwyn, Julie Benz, Erik King, James Remar, Michael Cuesta, C. S. Lee, Lauren Vélez, Michael C. Hall, David ZayasJennifer Carpenter, Tony Goldwyn, Julie Benz, Erik King, James Remar, Michael Cuesta, C. S. Lee, Lauren Vélez, Michael C. Hall, David Zayas   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.66 x 5.42 x 7.65 inches; 7.76 Ounces', 'Item model number': '6428098221', 'Director': 'Michael Cuesta, Tony Goldwyn', 'Media Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '10 hours and 50 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Michael C. Hall, Erik King, James Remar, Julie Benz, Jennifer Carpenter', 'Studio': 'Showtime Ent. / Paramount', 'Number of discs': '4'}\nI finally got around to watching this show, and loved it!  The idea of a serial killer who only kills other killers is rather intriguing, and this show presents it in such a fun way.  The characters are all great and the dialog is brilliantly witty.  The first season had a slight flaw of being rather predictable, but that really doesn't detract from my over all rating.  This show is also strangely  addictive!  The only way to really watch it is by DVD or somehow streaming it from the internet (I watched it on Netflix, but I enjoyed it enough to buy on DVD once I get some extra cash!) so you can watch the episodes back-to-back, as most every one ends as a cliff hanger.\nLoved it!\nNight of the Demons\nEdward Furlong  (Actor),     Shannon Elizabeth  (Actor),     Adam Gierasch  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n[\"Angela (Shannon Elizabeth) is throwing a decadent Halloween part at New Orleans' infamous Broussard Mansion. But after the police break up the festivities, Maddie (Monica Keena) and a few friends stay behind. Trapped inside the locked mansion gates, the remaining guests uncover a horrifying secret and soon fall victim to seven vicious, blood-thirsty demons.\"]\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Edward Furlong, Adam Gierasch, Shannon Elizabeth, Michael Copon, John F. Beach, Monica Keena', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.55 x 5.38 x 7.52 inches; 0.01 Ounces', 'Item model number': '7986139', 'Director': 'Adam Gierasch', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Edward Furlong, Shannon Elizabeth, Monica Keena, John F. Beach, Michael Copon', 'Studio': 'Entertainment One', 'Number of discs': '1'}\nI am a fan of the original.  I decided to give this  a shot, as it was streaming on Netflix and had a decent rating (3.8 stars at the time of my viewing.)  Up until the end, it was just mediocre.  The end killed it.  Granted it had a few decent scenes in it, the little enjoyment I got from them didn't make up for the rest of the movie.<br /><br />I cannot recommend this one.\nNot worthy!\nThe Walking Dead: Season 1 [Blu-ray]\nAndrew Lincoln  (Actor),     Jon Bernthal  (Actor),     Frank Darabont  (Director, Producer, Writer)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n[\"After waking from a coma in an abandoned hospital, police officer Rick Grimes finds the world he knew gone - ravaged by a zombie epidemic of apocalyptic proportions. Nearby, on the outskirts of Atlanta, a small encampment struggles to survive as 'the dead' stalk them at every turn. Can Rick and the others hold onto their humanity as they fight to live in this terrifying new world? And, amidst dire conditions and personal rivalries, will they ultimately survive one another? AMC’s The Walking Dead is an epic, survival adventure series from the director of The Shawshank Redemption and the producer of The Terminator and Aliens.\"]\n{'Genre': 'Horror', 'Format': 'Blu-ray, Widescreen, Subtitled', 'Contributor': 'Sarah Wayne Callies, Laurie Holden, Frank Darabont, Jeffrey DeMunn, Emma Bell, Gale Ann Hurd, Andrew Lincoln, Jon BernthalSarah Wayne Callies, Laurie Holden, Frank Darabont, Jeffrey DeMunn, Emma Bell, Gale Ann Hurd, Andrew Lincoln, Jon Bernthal  See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '000102423', 'Director': 'Frank Darabont', 'Media Format': 'Blu-ray, Widescreen, Subtitled', 'Run time': '4 hours and 52 minutes', 'Release date': 'March 8, 2011', 'Actors': 'Andrew Lincoln, Jon Bernthal, Laurie Holden, Sarah Wayne Callies, Emma Bell', 'Subtitles': 'English, Spanish', 'Producers': 'Frank Darabont, Gale Ann Hurd', 'Studio': 'AMC and Anchor Bay Entertainment', 'Writers': 'Frank Darabont', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI realize that I'm going against the grain here, but I couldn't stand this show.  As another reviewer said, the first episode was quite good.  It sucked after that!  I had to quit in the middle of the series.  The characters are extremely one-dimensional, and everything that happened was incredibly predictable.  All of this is coming from a huge, life-long fan of horror films and books.  I spent much of my time watching this show thinking \"yep...  I've seen that before.\"  Or \"I bet this'll happen next!\"  Sure enough, my predictions usually transpired.<br /><br />The Good:  Nice visuals and beautiful cinematography.  Even though I didn't like the show, it looks great in HD!<br />The Bad:  One-dimensional characters, highly-predictable story line and the audio effects were way too over-the-top.<br /><br />My recommendation:  If you're gonna watch this, try not to spend too much money!\nReally?\nSplice [Blu-ray]\nAdrien Brody  (Actor),     Sarah Polley  (Actor),     Vincenzo Natali  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Superstar genetic engineers Clive (Adrien Brody) and Elsa (Sarah Polley) specialize in splicing DNA from different animals to create incredible new hybrids. Now they want to use human DNA in a hybrid that could revolutionize science and medicine. But when the pharmaceutical company that funds their research forbids it, they secretly take their experiment underground--risking their careers to push the boundaries of science and serve their own curiosity and ambition. The result is Dren, an amazing, strangely beautiful creature of uncommon intelligence and unexpected physical developments. At first, Dren exceeds their wildest dreams. But as she grows and learns at an accelerated rate, her existence threatens to become their worst nightmare.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '6.7 x 5.3 x 0.5 inches; 2.4 Ounces', 'Item model number': '7982681', 'Director': 'Vincenzo Natali', 'Media Format': 'Multiple Formats, Blu-ray, Dolby, AC-3, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Adrien Brody, Sarah Polley, Delphine Chaneac', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nThis was on sale at Best Buy for $5.99 (Halloween special,) so I picked it up.  Man, it wasn't even worth the price I paid!  In fact, I couldn't finish it!  There was absolutely nothing scary about this movie.  Splice plays out more like a poorly-written science fiction drama.  The acting was only average at best.  Some of the cinematography was fairly well done, but the over all plot killed it.<br /><br />I cannot recommend this movie to anyone that I like.\nBoring, boring, boring!\nThe Road [Blu-ray]\nViggo Mortensen  (Actor),     Charlize Theron  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Product Description', 'From Cormac McCarthy, author of “No Country For Old Men,” comes the highly anticipated big screen adaptation of the beloved, best-selling and Pulitzer Prize-winning novel, The Road. Academy Award®-nominee Viggo Mortensen (Best Actor, Eastern Promises, 2007) leads an all-star cast featuring Academy Award® winners Charlize Theron (Best Actress, Monster, 2003) and Robert Duvall (Best Actor, Tender Mercies, 1983), Guy Pearce and young newcomer Kodi Smit-McPhee in this epic post-apocalyptic tale of the survival of a father (Mortensen) and his young son (Smit-McPhee) as they journey across a barren America that was destroyed by a mysterious cataclysm. A masterpiece adventure, The Road boldly imagines a future in which men are pushed to the worst and the best that they are capable of – a future in which a father and his son are sustained by love.', 'Amazon.com', \"In many ways a close adaptation of Cormac McCarthy's grim novel,\", 'The Road', \"dutifully plods through the basics of McCarthy's nightmarish post-apocalyptic landscape: a father (Viggo Mortensen) and his young son (Kodi Smit-McPhee) try to survive as they trek along through the sodden, sunless remnants of some awful disaster. Scrounging for food and huddling together to stay warm, they spend most of their time trying to avoid the cannibalistic marauders who roam the highways. The film strikingly demonstrates that McCarthy's book was almost entirely dependent on his extraordinary language for its literary life; the story, such as it is, is so skeletal and spare it doesn't translate well into movie terms.\", 'The Proposition', 'director John Hillcoat brings his grungy physicality to the material, so in the matters of the damp clothes and starved bodies and cheerless forests, the movie rings true. But the longer it trudges on, the more it seems a thoroughly conventional conclusion is at the end of this dystopian tale.', 'The Road', \"has one notable selling point: the performance of Viggo Mortensen. In his character's fierce determination to live--but also the gentle sighs he lets forth when confronted with, say, his first sip of whisky in years--Mortensen is completely in the moment, and all too human in the post-human world.\", '--Robert Horton', 'Stills from', 'The Road', '(Click for larger image)']\n{'Genre': 'Drama, Thriller', 'Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Viggo Mortensen, Charlize Theron', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 119min', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 51 minutes', 'Release date': 'May 25, 2010', 'Actors': 'Viggo Mortensen, Charlize Theron', 'Subtitles': 'English', 'Studio': 'Sony', 'Number of discs': '1'}\nI've long been a fan of the post-apocalyptic genre when it comes to fiction and games.  The Road definitely fits that category!  The story, as the description indicates, is largely based on the journey that a father and his son take after the world ends.  All the vegetation has been decimated, and the animals are long gone.  The only life that remains are a few packs of mostly unsavory (which is probably why they kept trying to eat newly-found people) humans trying to get by.  The cast and crew did an amazing job:  This film was uncomfortable to watch most of the time!  As the story kept unfolding, I kept wondering what'd happen next.  The final events leading up to the end weren't a huge surprise, but the very end had a subtle twist that I thought was quite well done!  My response was simply: \"Wow?!\"\nDesperate, hopeless, and amazing!\nBattlestar Galactica: The Complete Series [Blu-ray]\nEdward James Olmos  (Actor),     Mary McDonnell  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Product Description', 'Now you can relive every action-packed moment of the epic story that Entertainment Weekly proclaims \"Riveting!\" Rejoin the fight to save the human race as a small but determined fleet quests for the fabled planet Earth while being hunted by their nemeses, the robot cylons. Presented uninterrupted and in Dolby Digital 5.1 Surround Sound, experience the phenomenon from beginning to end!', 'Bonus Content:', 'Battlestar Galactica (2004): Season One:', 'U-Control - The Oracle', 'U-Control - The Oracle', 'U-Control - Picture in Picture Behind the Scenes of the Mini Series - Part 1', 'U-Control - Picture in Picture Behind the Scenes of the Mini Series - Part 1', 'U-Control - Picture in Picture Behind the Scenes of the Mini Series - Part 2', 'U-Control - Picture in Picture Behind the Scenes of the Mini Series - Part 2', 'My Scenes', 'My Scenes', 'Deleted Scenes', 'Deleted Scenes', 'Sketches and Art', 'Sketches and Art', 'Behind-the-Scenes Featurettes', 'Behind-the-Scenes Featurettes', 'Miniseries Part 1 Commentary with Director Michael Rymer and Executive Producers David Eick and Ronald D. Moore', 'Miniseries Part 1 Commentary with Director Michael Rymer and Executive Producers David Eick and Ronald D. Moore', 'Miniseries Part 2 Commentary with Director Michael Rymer and Executive Producers David Eick and Ronald D. Moore', 'Miniseries Part 2 Commentary with Director Michael Rymer and Executive Producers David Eick and Ronald D. Moore', 'BD-Live - Download Center', 'BD-Live - Download Center', '33 Commentary with Executive Producers Ronald D. Moore and David Eick and Director Michael Rymer', '33 Commentary with Executive Producers Ronald D. Moore and David Eick and Director Michael Rymer', 'Bastille Day Commentary with Executive Producers Ronald D. Moore and David Eick', 'Bastille Day Commentary with Executive Producers Ronald D. Moore and David Eick', 'Act of Contrition Commentary with Executive Producers Ronald D. Moore and David Eick', 'Act of Contrition Commentary with Executive Producers Ronald D. Moore and David Eick', \"You Can't Go Home Again Commentary with Executive Producers Ronald D. Moore and David Eick\", \"You Can't Go Home Again Commentary with Executive Producers Ronald D. Moore and David Eick\", 'Tigh Me Up, Tigh Me Down Commentary with Executive Producer Ronald D. Moore', 'Tigh Me Up, Tigh Me Down Commentary with Executive Producer Ronald D. Moore', 'The Hand of God Commentary with Executive Producer Ronald D. Moore', 'The Hand of God Commentary with Executive Producer Ronald D. Moore', 'Are You a Cylon? Personality Quiz', 'Are You a Cylon? Personality Quiz', 'Colonial Day Commentary with Executive Producer Ronald D. Moore', 'Colonial Day Commentary with Executive Producer Ronald D. Moore', \"Kobol's Last Gleaming, Part 1 Commentary with Executive Producer Ronald D. Moore\", \"Kobol's Last Gleaming, Part 1 Commentary with Executive Producer Ronald D. Moore\", \"Kobol's Last Gleaming, Part 2 Commentary with Executive Producer Ronald D. Moore\", \"Kobol's Last Gleaming, Part 2 Commentary with Executive Producer Ronald D. Moore\", 'Battlestar Galactica (2004): Season Two:', 'U-Control - The Oracle', 'U-Control - The Oracle', 'Deleted Scenes', 'Deleted Scenes', 'Ronald D. Moore Podcast Commentaries', 'Ronald D. Moore Podcast Commentaries', 'BD-Live - Download Center', 'BD-Live - Download Center', 'Sizzle Reel', 'Sizzle Reel', 'Pegasus Extended Episode Commentary with Executive Producers Ronald D. Moore and David Eick', 'Pegasus Extended Episode Commentary with Executive Producers Ronald D. Moore and David Eick', 'Battlestar Galactica Career Assignment Quiz', 'Battlestar Galactica Career Assignment Quiz', \"David Eick's Video Blogs\", \"David Eick's Video Blogs\", 'RND Logos', 'RND Logos', 'Battlestar Galactica (2004): Season Three:', 'U-Control - The Oracle', 'U-Control - The Oracle', 'U-Control - Battlestar Blips', 'U-Control - Battlestar Blips', 'Deleted Scenes', 'Deleted Scenes', \"Ronald D. Moore's Podcast Commentaries\", \"Ronald D. Moore's Podcast Commentaries\", 'BD-Live - Download Center', 'BD-Live - Download Center', 'Battlestar Galactica: The Resistance Webisodes', 'Battlestar Galactica: The Resistance Webisodes', \"David Eick's Video Blogs\", \"David Eick's Video Blogs\", 'Hero Commentary with Executive Producer David Eick', 'Hero Commentary with Executive Producer David Eick', 'Unfinished Business Unaired, Extended Cut Commentary with Executive Producer Ronald D. Moore', 'Unfinished Business Unaired, Extended Cut Commentary with Executive Producer Ronald D. Moore', 'Colonial Military Assessment Quiz', 'Colonial Military Assessment Quiz', 'Battlestar Galactica (2004): Season Four:', 'U-Control - The Oracle', 'U-Control - The Oracle', 'U-Control - Battlestar Actual', 'U-Control - Battlestar Actual', 'Deleted Scenes', 'Deleted Scenes', 'The Look of Battlestar Galactica', 'The Look of Battlestar Galactica', 'My Favorite Episode So Far', 'My Favorite Episode So Far', 'Season 4 Sneak Peek', 'Season 4 Sneak Peek', 'Season 4 Trailer', 'Season 4 Trailer', 'Minisodes', 'Minisodes', 'Commentary to the Unrated Extended Edition with Executive Producer Ronald D. Moore and Writer Michael Taylor', 'Commentary to the Unrated Extended Edition with Executive Producer Ronald D. Moore and Writer Michael Taylor', 'BD-Live Download Center', 'BD-Live Download Center', 'BD-Live - Battlestar Galactica Card Game', 'BD-Live - Battlestar Galactica Card Game', \"David Eick's Video Blogs\", \"David Eick's Video Blogs\", \"Ronald D. Moore's Podcast Commentaries\", \"Ronald D. Moore's Podcast Commentaries\", 'The Journey', 'The Journey', 'Cylons: The Twelve', 'Cylons: The Twelve', 'Season 4.5: The Untold Story - Untold', 'Season 4.5: The Untold Story - Untold', 'The Music of Battlestar Galactica', 'The Music of Battlestar Galactica', 'Caprica Sneak Peek', 'Caprica Sneak Peek', 'Faith Commentary with Executive Producer Ronald D. Moore and Supervising Producers Bradley Thompson and David Weddle', 'Faith Commentary with Executive Producer Ronald D. Moore and Supervising Producers Bradley Thompson and David Weddle', \"Guess What's Coming to Dinner with Executive Producer Ronald D. Moore and Writer Michael Angeli\", \"Guess What's Coming to Dinner with Executive Producer Ronald D. Moore and Writer Michael Angeli\", 'Sine Qua Non Commentary with Executive Producer Ronald D. Moore and Writer Michael Taylor', 'Sine Qua Non Commentary with Executive Producer Ronald D. Moore and Writer Michael Taylor', 'The Journey Ends: The Arrival', 'The Journey Ends: The Arrival', 'Evolution of a Cue', 'Evolution of a Cue', 'What the Frak Is Going on with Battlestar Galactica?', 'What the Frak Is Going on with Battlestar Galactica?', 'A Disquiet Follows My Soul Unaired Extended Episode Commentary with Executive Producer and Episode Director Ronald D. Moore', 'A Disquiet Follows My Soul Unaired Extended Episode Commentary with Executive Producer and Episode Director Ronald D. Moore', 'Islanded in a Stream of Stars Unaired Extended Episode Commentary with Series Star and Episode Director Edward James Olmos', 'Islanded in a Stream of Stars Unaired Extended Episode Commentary with Series Star and Episode Director Edward James Olmos', 'U-Control - What the Frak Happened to You? (Available for the Unaired, Extended Episode of Daybreak Only)', 'U-Control - What the Frak Happened to You? (Available for the Unaired, Extended Episode of Daybreak Only)', 'A Look Back', 'A Look Back', '...And They Have a Plan', '...And They Have a Plan', 'The Musicians Behind Daybreak', 'The Musicians Behind Daybreak', 'Daybreak Unaired Extended Episode Commentary with Executive Producers David Eick and Ronald D. Moore', 'Daybreak Unaired Extended Episode Commentary with Executive Producers David Eick and Ronald D. Moore', 'Battlestar Galactica: The Plan:', 'Deleted Scenes', 'Deleted Scenes', 'From Admiral to Director: Edward James Olmos & The Plan', 'From Admiral to Director: Edward James Olmos & The Plan', 'The Cylons of The Plan', 'The Cylons of The Plan', 'The Cylon Attack', 'The Cylon Attack', 'Visual Effects: The Magic Behind The Plan', 'Visual Effects: The Magic Behind The Plan', 'Feature Commentary with Director/Star Edward James Olmos and Executive Producer/Writer Jane Espenson', 'Feature Commentary with Director/Star Edward James Olmos and Executive Producer/Writer Jane Espenson', 'D-BOX', 'D-BOX', 'BD-Live - Battlestar Galactica Trivia', 'BD-Live - Battlestar Galactica Trivia', ']]>', 'Amazon.com', 'Battlestar Galactica: Season One', 'Battlestar Galactica', '\\'s Edward James Olmos wasn\\'t kidding when he said \"the series is even better than the miniseries.\" As developed by sci-fi TV veteran Ronald D. Moore, the \"reimagined\"', 'BG', 'is exactly what it claims to be: a drama for grown-ups in a science-fiction setting. The mature intelligence of the series is its greatest asset, from the tenuous respect between Galactica\\'s militarily principled commander Adama (Olmos) and politically astute President Roslin (Mary McDonnell) to the barely suppressed passion between ace Viper pilot \"Apollo\" (a.k.a. Adama\\'s son Lee, played by Jamie Bamber) and the brashly insubordinate Starbuck (Katee Sackhoff), whose multifaceted character is just one of many first-season highlights. Picking up where the miniseries ended (it\\'s included here, sparing the need for separate purchase), season 1 opens with the riveting, Hugo Award-winning episode \"33,\" in which Galactica and the \"ragtag fleet\" of colonial survivors begin their quest for the legendary 13th colony planet Earth, while being pursued with clockwork regularity by the Cylons, who\\'ve now occupied the colonial planet of Caprica. The fleet\\'s hard-fought survival forms (1) the primary side of the series\\' three-part structure, shared with (2) the apparent psychosis of Dr. Gaius Baltar (James Callis) whose every thought and move are monitored by various incarnations of Number Six (Tricia Helfer), the seemingly omniscient Cylon ultravixen who follows a master plan somehow connected to (3) the Caprican survival ordeal of crash-landed pilots \"Helo\" (Tahmoh Penikett) and \"Boomer\" (Grace Park), whose simultaneous presence on Galactica is further evidence that 12 multicopied models of Cylons, in human form, are gathering their forces.', 'With remarkably consistent quality, each of these 13 episodes deepens the dynamics of these fascinating characters and suspenseful situations. While', 'BG', 'relies on finely nuanced performances, solid direction, and satisfying personal and political drama to build its strong emotional foundation, the action/adventure elements are equally impressive, especially in \"The Hand of God,\" a pivotal episode in which the show\\'s dazzling visual effects get a particularly impressive showcase. Original', 'BG', \"series star Richard Hatch appears in two politically charged episodes (he's a better actor now, too), and with the threat of civil war among the fleet, season 1 ends with an exceptional cliffhanger that's totally unexpected while connecting the plot threads of all preceding episodes. To the credit of everyone involved, this is frackin' good television.\", 'DVD features', 'The fifth disc in', 'Battlestar Galactica', \"'s season 1 set is highlighted by eight comprehensive featurettes covering all aspects of the series, from its miniseries origins to standard surveys of production design, visual effects, and particulars of plot and character. For hardcore fans and anyone interested in TV production, nine out of 13 episodes, plus the disc 1 miniseries, are accompanied by intelligent and informative commentary originally provided as\", 'BG', 'website podcasts, mostly by series developer and writer Ronald D. Moore, who provides tantalizing clues about developments in season 2. The \"Series Lowdown\" is a cast-and-crew promotional program originally broadcast to attract SciFi Channel viewers who were initially reluctant to embrace a \"reimagined\"', 'Battlestar Galactica', '. The strategy worked: First-season ratings left no doubt that the new', 'BG', 'was as good as--and in many ways better than--the original.', '--Jeff Shannon', 'Battlestar', 'Galactica - Season 2.0', 'The first half of', 'Battlestar Galactica', '\\'s second season left no doubts about the continuing excellence of the best science fiction TV series of 2005. Beginning with the Colonial Fleet separated, Col. Tigh (Michael Hogan) botching his temporary command, and Capt. Adama (Edward James Olmos) near death after a Cylon assassination attempt, series producer/developer Ronald D. Moore and his gifted writing staff packed more into these 10 episodes than most series manage in a full season. Maintaining its reputation as an adult drama, the series is compellingly anchored by the gravitas of Olmos and Mary McDonnell, whose role as Fleet President Laura Roslin grows more complex as she reveals her diagnosis of breast cancer and defies Adama, playing the \"religious card\" with her conviction that prophetic visions will lead the embattled fleet toward its legendary home planet Earth. As Adama\\'s son Apollo (Jamie Bamber) wrestles with his role in Roslin\\'s mutinous agenda, paranoia runs high as Cylon copies (or \"avatars\") of Boomer (Grace Park) complicate matters aboard Galactica and on Kobol, where a lost Raptor crew struggles to survive and Dr. Baltar (James Callis) endures the increasingly haunting and manipulative intrusions into his tormented psyche by Number Six (Tricia Helfer), the seductive Cylon who holds the secret to the Cylon master plan to destroy humankind.', \"Further action takes place on Cylon-occupied Caprica, where Starbuck (Katee Sackhoff) and Helo (Tamoh Penikett) discover a group of human resistance fighters who survived the Cylons' nuclear attack in season 1. As all of these plot threads are expertly interwoven, the high-stakes conflict of\", 'BG 2.0', 'culminates in a suspenseful mid-season cliffhanger. Through all of this,', 'Battlestar Galactica', 'maintains consistently high standards of intelligent drama and well-justified, story-based use of spectacular special effects, while developing rich relationships across a broad spectrum of interesting supporting characters. The series\\' large and likable cast is well-used throughout (even smaller roles are given adequate dimension), and Moore\\'s \"podcast\" commentaries provide a smart, thorough analysis of the show\\'s writing process and conceptual evolution. Yes, it\\'s undeniably true that this half-season DVD set is a blatantly commercial ploy to lure more and more viewers into the ongoing season (which resumed in January 2006), but you can hardly blame Universal for capitalizing on a high-quality series. With solid ratings, good scripts, and a devoted cast and crew,', 'Battlestar Galactica', 'showed every indication of thriving toward a third season and beyond.', '--Jeff Shannon', 'Battlestar', 'Galactica - Season 2.5', 'Battlestar Galactica', \"'s season 2.5 (i.e., the final 10 episodes of the second season, plus an extended version of episode 10) picks up where season 2.0 (the first 10 episodes) left off:\", 'Galactica', \"'s giddy reunion with the\", 'Pegasus', 'had taken a sour turn when Admiral Cain (Michelle Forbes) went back on her word to Commander Adama (Edward James Olmos) and decided to integrate the crews, moving Apollo (Jamie Bamber) and Starbuck (Katee Sackhoff) to', 'Pegasus', \". The animosity, combined with an attack on Sharon (Grace Park), threatens to derail a golden opportunity for the fleet to strike the Cylons where they'll hurt, and stay hurt--their resurrection ship.\", 'In many ways, Sharon is the central character. The attack lands Helo (Tahmoh Penikett) and the Chief (Aaron Douglas) in hot water; her impending baby remains the subject of heated debate among president Laura Roslin (Mary McDonnell), Commander Adama, and others; and a rebellious movement determined to force', 'Galactica', 'to give up the Cylon ends up threatening both Apollo and Starbuck and putting further strain on their already-shaky relationship. Dr. Baltar (James Callis) becomes even more intertwined with the Cylons when he discovers another version of Number Six (Tricia Helfer) on the', 'Pegasus', \", but is also in line to take over the presidency as Roslin's cancer reaches a critical stage.\", 'Battlestar Galactica', \"'s inexorable dramatic arc sagged in a couple episodes during this run, but the terrific two-part season finale involving a presidential election, a glimmer of hope for humanity, and some unexpected turns of events makes for a thrilling springboard to season 3.\", 'Battlestar', \"is often called the best sci-fi show on television, but that seems like damning it with faint praise; it's the best\", 'drama', 'on television.', 'In addition to the 10 episodes, the three-DVD set has an extended version of the last episode of season 2.0, \"Pegasus\"; the extra 15 minutes include a longer conversation in which Cain reveals her plans to Adama. That episode has a commentary track by executive producers Ronald D. Moore and David Eick, Moore\\'s podcast commentaries are on every other episode, Eick\\'s \"video blogs\" serve as casual featurettes on series production, and there are numerous deleted scenes.', '--David Horiuchi', 'Battlestar Galactica: Season 3', 'The third season of', 'Battlestar Galactica', \"got off to a rip-roaring start on New Caprica, where the settlers had found themselves under Cylon occupation at the end of the previous season. Dr. Baltar (James Callis) had been elected President based on his intention to stop looking for Earth and settle on New Caprica, but is now a puppet of the Cylons, forced to sign execution orders for numerous humans, including former President Roslin (Mary McDonnell). A resistance movement is building, however, led by Col. Tigh (Michael Hogan), and assisted by Chief Tyrol (Aaron Douglas) and Samuel Anders (Michael Trucco). Tigh's desperate tactics--including suicide bombers--raise interesting parallels to the U.S. war in Iraq, and he finds he has to make an even tougher choice. Thanks to Admiral Adama's (Edwards James Olmos) return and the unexpected help of Boomer (Grace Park), the colonists escape, then begin a series of trials in order to convict all of the Cylon collaborators, culminating in the explosive trial of Baltar himself. In a boxing-metaphor episode, Apollo (Jamie Bamber) and Starbuck (Katee Sackhoff) resume their mutual attraction with a surprising outcome. After the exciting beginning,\", 'Battlestar Galactica', 'sagged a little in the middle of the third season (as it did in the second season) with its ship-bound episodes, but caught speed again at the end. The quest to find Earth, the unexpected loss of a major character, and the revealing of four of the final five Cylons kept viewers coming back to a series that blends action, drama, and universal questions of loyalty, faith, and justice in a way that transcends the science-fiction setting. With Dean Stockwell, Lucy Lawless, and Tricia Helfer as Cylons 1, 3, and 6, Mark Sheppard as defense attorney Romo Lampkin, Alessandro Juliani as Lt. Gaeta, Kandyse McClure as Petty Officer \"Dee\" Dualla, Nicki Clyne as Crewman Specialist Cally, Kate Vernon as Ellen Tigh, and Rekha Sharma as presidential aide Tory Foster.', \"Every episode on the DVD set has executive producer Ronald Moore's podcast commentaries (occasionally joined by others) and almost every episode has deleted scenes, including a different (and less effective) version of the season's final surprise. Also included are bonus commentaries, the\", 'Resistance', 'webisodes (10 episodes, 26 minutes total) that provide more of life on occupied New Caprica, executive producer David Eicks\\' \"video blog\" featurettes, and an extended version of \"Unfinished Business\" (mostly adding non-Starbuck-Apollo material).', '--David Horiuchi', 'Battlestar Galactica: Season 4.5', 'Battlestar Galactica: Season 4.5', \"is the final 10 episodes of the Sci-Fi Channel's highly acclaimed reimagining of the 1970s show, including one of the more stirring and satisfying series finales in television history. Aired in January 2009 after a six-month hiatus, the half-season opens following the devastating revelation about Earth and with four of the final five Cylons revealed, including Tigh (Michael Hogan), Anders (Michael Trucco), Foster (Rekha Sharma), and Tyrol (Aaron Douglas). The uneasy alliance between humans and a pack of rebel Cylons, including Caprica 6 (Tricia Helfer) takes a quizzical turn when the former residents of Earth appear to be Cylon rather than human, and some of the final five begin to recall their past lives on Earth. Kara (Katee Sackhoff) has to call her own human status into question when she discovers a crashed Viper occupied by a corpse wearing her dog tags, and President Roslin (Mary McDonnell) and Admiral Adama (Edward James Olmos) battle their own despair and struggle to lead an emotionally devastated fleet. Capitalizing on the turmoil, Vice President Tom Zarek (Richard Hatch) and Felix Gaeta (Alessandro Juliani) organize a mutiny aboard the\", 'Galactica', 'and Zarek makes an unbelievable power move against the Quorum of Twelve. But before they can carry out their plans for execution, a commando raid led by Kara and Lee Adama (Jamie Bamber) fighting side by side strikes back against the mutineers. That\\'s the action high point of the half-season, as the show then seems to mark some time with such issues as babies and structural integrities until the three-part finale, which, despite a head-scratcher or two, manages to resolve its issues tidily. That viewers even get a rare glimpse of sunlight is kind of a reward for fans of this outstanding but relentlessly dark series. DVD features include extended versions of three episodes (\"A Disquiet Follows My Soul,\" \"Islanded in a Stream of Stars,\" and \"Daybreak\\'), Ronald D. Moore\\'s podcast commentaries for each episode, deleted scenes, David Eick\\'s video blogs, and five behind-the-scenes featurettes.', '--David Horiuchi']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Widescreen, Blu-ray, Anamorphic, DTS Surround Sound, Box set, Color', 'Contributor': 'Edward James Olmos, Michael Rymer, Mary McDonnell, James Callis, Katee Sackhoff, Jamie Bamber', 'Language': 'English (DTS-HD Master Audio 5.1), Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '21', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.54 Pounds', 'Item model number': '8270869-11', 'Media Format': 'Blu-ray, Widescreen, Anamorphic, DTS Surround Sound, Box set, Color', 'Run time': '69 hours and 39 minutes', 'Release date': 'April 6, 2010', 'Actors': 'Edward James Olmos, Mary McDonnell, James Callis, Katee Sackhoff, Michael Rymer', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '21'}\nSomeone I know suggested that I watch this show.  He's a huge Star Trek fan, and while I don't mind the show, I never really followed.  This gave me some preconceived notions of what Battlestar Galactica might be like.  I'm glad I got over those notions!  Battlestar is a gritty, intense character and story driven series.  All the main characters and even some of the more important minor characters well be fleshed out and in great detail.  I also thought that the characters were very deep and multidimensional, so it added a fair amount of realism (on the personal level.)  The story will keep you on the edge of your seat while you watch the fleet suffer through its journey (some good times will be had, but there is a lot of crazy things that happen to everyone involved!)  I really like how most of the questions one might ask are answered (or resolved) by the time the show ends.<br /><br />When watching this show, one might find him/herself  questioning ideas about politics, religion and social/ethical values.  I certainly did, and for me, this was a very attractive aspect of watching Battlestar.<br /><br />At any rate, experiencing Battlestar Galactica for the first time should be about surprises.  They do a great job playing their hand close to their chest, and you definitely are made to wait to find a lot of things out.  You might be curious to read up on it on Wiki or hit the forums for more information, but chances are you'll ruin some surprises.  Also, the \"webisodes\" are quite boring.  Save'em for after the show, if you're interested in watching.  (they might be a little less annoying if they stitched them all together so you didn't have to load a 4 minute clip 10 times over to complete them.)\nOne of the best shows I've ever seen\nCalifornication: Seasons 1-4\nRated:    Unrated    Format: DVD\nMovies & TV, Showtime, All Showtime Titles\n{'Format': 'Widescreen, NTSC', 'Language': 'English', 'Publication Date': 'November 1, 2011', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.8 x 5.51 x 2.52 inches; 1.55 Pounds', 'Media Format': 'Widescreen, NTSC', 'Release date': 'November 1, 2011', 'Dubbed': 'English, Spanish', 'Studio': 'Showtime Ent.'}\nDavid Duchovny's character is wonderfully flawed; He's intelligent, extremely funny and has a big heart, but for some reason, can't say no to drugs, alcohol or women.  He was also unable to commit to the love of his life/mother of his child, so she left him.  The show starts out with Hank Moody (David Duchovny)trying desparatly to win her back.  He sill has a grip on her heart, but his flaws keep pushing her away.  This is one of the central themes to the show, through every season thus far.<br /><br />One of Moody's other traits, which I can very much relate to, is that he doesn't have patients for public displays of rudeness/ignorance.  He'll often react in the best way possible (some of these reactions might have gone through my head had I witnessed such displays, but I don't think I'd carry them out!)  Such situations often end in my laughter and his imprisonment.<br /><br />Californication isn't necessarily for children.  There is frequent foul language, drug/alcohol use, and nudity/sex.  Anyone watching it, however, will probably see past that and find something very human in this show.  Watching Hank Moody try and try again is sometimes painful, and sometimes very inspiring. Some things I take from this show is that maybe we as people need to be a little more thoughtful of others, and at the same time, maybe embrace a little more \"political incorrectness.\"<br /><br />I could probably expand on all that quite a bit, but I'm sure everyone would just rather watch the show than read my ramblings!\nOne of my favorite shows\nCabin In The Woods [Blu-ray + Digital Copy]\nJenkins, Richard  (Actor),     Williams, Jesse  (Actor),     Drew Goddard  (Director, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Horror\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Ultraviolet, AC-3, Blu-ray, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copyMultiple Formats, Ultraviolet, AC-3, Blu-ray, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copy   See more', 'Contributor': 'Drew Goddard, Joss Whedon, Hemsworth, Chris, Williams, Jesse, Hutchison, Anna Marie, Connolly, Kristen, Jenkins, RichardDrew Goddard, Joss Whedon, Hemsworth, Chris, Williams, Jesse, Hutchison, Anna Marie, Connolly, Kristen, Jenkins, Richard   See more', 'Language': 'English', 'Runtime': '1 hour and 35 minutes'}\nI haven't seen any previews for this (or any movie, for that matter...) so it was all a pretty big surprise to me.  I knew Joss Whedon made it, which is why I wanted to watch it.  It pretty much surprised the hell out of me, as I thought it was pretty much another movie like Evil Dead or Cabin Fever.  But then again, it was Joss Whedon that made it, which makes me embarrassed to be surprised!<br /><br />Anyway, I thought this was a neat twist to the typical classic horror fare.  I highy recommend this to anyone who's a horor movie buff that's willing to watch something a little different.\nBest horror movie made in a long time\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Johan Renck'], 'Producers': ['Michael Hirst', \"Morgan O'Sullivan\", 'John Weber', 'James Flynn', 'Sherry Marsh', 'Alan Gasmer', 'Shelia Hockin', 'Steve Wakefield', 'Keith Thompson'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Gabriel Byrne', 'Clive Standen', 'Gustaf Skarsgard', 'George Blagden'], 'Studio': ['History']}\nI was leery of this, as most of the programming on The History Channel doesn't really appeal to me.  Fortunately, I gave this show a shot!  Over all, I found it to be a lot of fun to watch.  The show is inspired by historical and mythological figures and events.  I am sure history buffs can find flaws with it, but I sat back and enjoyed it, and let the story unfold.  The characters were well-written, scripts were good, and I really liked the cinematography.  I am very much looking forward to season 2!\nVery Entertaining\nThe Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\n{'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nI was a huge fan of the LotR movies, and I have read all of the books multiple times.  The Hobbit series was horrid for me.  They added way too much bloat, and the action sequences were ridiculous, over-the-top and cartoony.  The Hobbit movies are to Lord of the Rings as Star Wars episodes 1-3 are to the original trilogy.\nLord of the Rings - Episode 1\nThe Witch\nKate Dickie  (Actor),     Julian Richings  (Actor),     Robert Eggers  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['A devoutly Christian family in 1630s New England, struggles to survive living along the edge of a vast wilderness. When one of their five children goes missing and their life-sustaining crops fail, they fall victim to paranoia and fear as they begin to turn on one another.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Audio Description': 'English', 'Item model number': '47610', 'Director': 'Robert Eggers', 'Media Format': 'AC-3, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 17, 2016', 'Actors': 'Kate Dickie, Julian Richings, Anya Taylor-Joy, Ralph Ineson', 'Subtitles': 'English, Spanish', 'Producers': 'Jodi Redmond, Rodrigo Teixeira, Daniel Bekerman, Lars Knudsen, Jay Van Hoy', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis movie really didn't live up to the hype.  It's 96 minutes long, but felt like 196 minutes.  I must say, it was extremely anticlimactic and not scary at all.  If I could return it, I would.  Wait for it to be streaming on one of the standard streaming services instead of wasting money on it.\nNot scary.  Not worth purchasing.\nWarcraft\nTravis Fimmel  (Actor),     Paula Patton  (Actor),     Duncan Jones  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product description', 'WARCRAFT DESCRIPTION', 'BONUS FEATURES', '-', 'Deleted/Extended scenes', '-', 'Gag reel', '-', 'Origin story', '-', 'The fandom of Warcraft', '-', 'ILM: Behind the magic of Warcraft', 'BLU-RAY EXCLUSIVES', '-', 'Warcraft: Bonds of brotherhood motion comic', '-', 'The World of Warcraft on film: Talent, VFX, Stunts and more', '-', 'Warcraft: The Madame Tussauds experience', '-', 'Warcraft teaser 2013', \"When the world of the Orcs of Draenor is being destroyed by the evil fel magic that uses life-force, the powerful warlock Gul'dan creates a portal to the world of Azeroth and forms the Horde with members of the Orc clans. He also captures many prisoners to keep the portal open. The king of Azeroth, Llane Wrynn and his brother-in-law, Anduin Lothar are informed by the apprentice of magician Khadgar that he has found fel magic in dead bodies and the king decides to summon the Guardian of Tirisfal, Medivh, to protect his kingdom. Lothar and Khadgar head to Kharazhan to meet Medivh and an ominous shadow points a book out to Khadgar, who takes it and hides. Anduin, Khadgar and Medivh and a group of soldiers are attacked by Orcs and they capture the slave Garona, who is released by King Llane, and she shows them the location of the portal. Garona is contacted by the Orc chief of a clan Durotan that wants to meet King Llane to stop the fel magic\", 'Additional Features', 'Includes Dolby Atmos \\uf02d Dolby Atmos is a revolutionary new audio technology that transports you into extraordinary entertainment experience. With Dolby Atmos enabled receivers and speaker configurations, sound comes from all directions, including overhead, to create an immersive experience with clarity, richness, details, and depth. With existing home theater systems, you will get a great surround sound experience.']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 4 Ounces', 'Item model number': '42927659', 'Director': 'Duncan Jones', 'Media Format': 'Blu-ray, Digital_copy, DVD-ROM', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 27, 2016', 'Actors': 'Travis Fimmel, Paula Patton, Ben Foster, Dominic Cooper, Toby Kebbell', 'Subtitles': 'French, Spanish', 'Producers': 'Charles Roven, Thomas Tull, Jon Jashni, Alex Gartner, Stuart Fenegan', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Charles Leavitt, Duncan Jones', 'Number of discs': '2'}\nI went to see the movie twice in theaters already, and plan to purchase the Blu-ray, once it's released.  The movie did a great job keeping the spirit of the lore from the game series and (from what I can tell) the novelizations.  Sure, there are some departures from &#34;the way it really happened,&#34; but that was expected, and quite frankly, pretty well done.  The movie itself was fairly grim - some of your favorite characters might suffer (or die?)  I expected the special effects to be on the lame side, but on the contrary, they were very well done (provided you ignore the Kirin Tor members' eyes.)<br /><br />Overall, the movie had enough hat tips to the game series (complete with pop-culure references!) to keep me happy, but did a fine enough job presenting itself to someone who has never played any of the games (one person being my wife, who also thoroughly enjoyed it!)\nThumbs up from a long-time fan of the game",
  "profile": "**Updated User Profile Summary:**\n\n- **Film and Series Preferences:** The user demonstrates a clear preference for intelligent, character-driven narratives, while increasingly expressing impatience with films that lack suspense and emotional payoff. Their recent engagement highlights a contrasting enjoyment for adaptations that respect their source material, particularly when they manage to attract both fans and newcomers.\n\n- **Director and Actor Affinity:** The user remains attentive to exceptional creators and performances but is critical of films that fail to deliver engagement, especially regarding pacing. They appreciate works that balance fidelity to material while still offering a compelling cinematic experience.\n\n- **Content Tolerance:** Maintaining their openness to complex narratives, the user increasingly seeks coherence and satisfaction within the story structure. Their recent review indicates a value for films that appeal to dedicated fanbases while being accessible to wider audiences.\n\n- **Viewing Habits:** Deliberate in their choices, the user aims for thought-provoking content, expressing joy when adaptations cater to established lore without sacrificing narrative integrity. They continue to reject works that prioritize superficial style over substantial storytelling.\n\n- **Critique Style:** The user emphasizes narrative authenticity and emotional depth in their assessments. Their recent critique reflects a positive reception of films that engage them both as fans of original material and as discerning viewers.\n\nOverall, the user appreciates narratives that fulfill their dramatic potential while engaging with beloved source materials in meaningful ways.",
  "metrics": {
    "rouge1_f": 0.029145332808192204,
    "rouge2_f": 0.0031514674020090604,
    "rougeL_f": 0.016345017723513194,
    "meteor": 0.008061349795751292,
    "bleu1": 2.3042783718904204e-21,
    "bleu2": 8.215830257602267e-22,
    "bleu3": 2.1859047068238437e-22,
    "bleu4": 6.346242184886323e-23,
    "bertscore_precision": 0.34100136160850525,
    "bertscore_recall": 0.5418246388435364,
    "bertscore_f1": 0.4185715913772583
  }
}