{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Splice [Blu-ray]\nReview Date: 2011/10/29\nStore: Adrien Brody  (Actor),     Sarah Polley  (Actor),     Vincenzo Natali  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: ['Superstar genetic engineers Clive (Adrien Brody) and Elsa (Sarah Polley) specialize in splicing DNA from different animals to create incredible new hybrids. Now they want to use human DNA in a hybrid that could revolutionize science and medicine. But when the pharmaceutical company that funds their research forbids it, they secretly take their experiment underground--risking their careers to push the boundaries of science and serve their own curiosity and ambition. The result is Dren, an amazing, strangely beautiful creature of uncommon intelligence and unexpected physical developments. At first, Dren exceeds their wildest dreams. But as she grows and learns at an accelerated rate, her existence threatens to become their worst nightmare.']\nAverage Rating: 4.1\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '6.7 x 5.3 x 0.5 inches; 2.4 Ounces', 'Item model number': '7982681', 'Director': 'Vincenzo Natali', 'Media Format': 'Multiple Formats, Blu-ray, Dolby, AC-3, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Adrien Brody, Sarah Polley, Delphine Chaneac', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nReview Text: This was on sale at Best Buy for $5.99 (Halloween special,) so I picked it up.  Man, it wasn't even worth the price I paid!  In fact, I couldn't finish it!  There was absolutely nothing scary about this movie.  Splice plays out more like a poorly-written science fiction drama.  The acting was only average at best.  Some of the cinematography was fairly well done, but the over all plot killed it.<br /><br />I cannot recommend this movie to anyone that I like.\nReview Title: Boring, boring, boring!\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Antichrist [Blu-ray]\nWillem Dafoe  (Actor),     Charlotte Gainsbourg  (Actor),     Lars von Trier  (Director)    &                   0                  more   Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n{'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Lars von Trier', 'Media Format': 'Blu-ray', 'Actors': 'Willem Dafoe, Charlotte Gainsbourg', 'Studio': 'Zentropa Entertainment'}\nI streamed this one off Netflix.  I've enjoyed von Trier's wor in the past, and Willem Dafoe usually provides a wonderful performance (which could be taken in other ways in this context.)  The movie was amazing in the sense of being a work of art, but I don't think I could watch it a second time (though I'm tempted to buy it just to support von Trier's work.)  It contains intense violence, sex and a rather bizarre story.  I highly recommend it to those who enjoy a smart, artsy film and have strong stomachs.\nIncredibly well done, but extremely morbid.\nLady in the Water [Blu-ray]\nPaul Giamatti  (Actor),     Bryce Dallas Howard  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Lady In The Water (BD)', ']]>']\n{'Genre': 'Fantasy, Suspense, Science Fiction', 'Format': 'AC-3, Blu-ray, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Freddy Rodriguez, Jared Harris, Jeffrey Wright, Bob Balaban, M. Night Shyamalan, Paul Giamatti, Sam Mercer, Sarita Choudhury, Bill Irwin, Bryce Dallas HowardFreddy Rodriguez, Jared Harris, Jeffrey Wright, Bob Balaban, M. Night Shyamalan, Paul Giamatti, Sam Mercer, Sarita Choudhury, Bill Irwin, Bryce Dallas Howard  See more', 'Initial release date': '2006-12-19', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 1.76 Ounces', 'Item model number': '82969', 'Director': 'M. Night Shyamalan', 'Media Format': 'AC-3, Blu-ray, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 19, 2006', 'Actors': 'Paul Giamatti, Bryce Dallas Howard, Bob Balaban, Jeffrey Wright, Sarita Choudhury', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'M. Night Shyamalan, Sam Mercer', 'Studio': 'Studio Distribution Services', 'Writers': 'M. Night Shyamalan', 'Country of Origin': 'USA', 'Number of discs': '1'}\nM Knight Shamalayan made a name for himself with the movie The Sixth Sense, and for good reason.  It was a great movie with a great story and a not entirely predictable \"surprise\" ending.  I also enjoyed his follow-up film, Unbreakable (yet it wasn't too well received.)  Each of his later films, however, have left me disappointed.  Lady in the Water is no different.  He keep trying to  string insane story ideas together, only to cap them off with a \"surprise\" ending.  A surprise ending is only a surprise if you're not expecting it!  Another problem I have is how his characters always seem to just accept whatever's going on in the movie.<br /><br />This film is about a water nymph that's trying to save the world from humanity.  Or maybe it's to save humanity from themselves...  Anyway.  She shows up in the swimming pool of an apartment complex filled with very eccentric tenants.  The landlord of the complex is the man who finds her, and immediately clings to this nymph.  He's not quite too sure what to do with her, but conveniently there's an Asian family (Japanese, I think) that just happens to know the legend.  So, to appease the elder lady of the household (who is the expert of the legend,) he goes through some rather silly exercises.  Once he knows this legend, he goes to all the other tenants for help.  They all immediately buy into his tale and pitch in right away.  As the movie progresses, things become more and more convoluted.  Eventually everyone figures out what to do, and the \"surprise\" happens.  Seriously...  I wasn't surprised in any fashion.  In fact, I predicted what'd happen.<br /><br />Here are the stats:<br /><br />Violence/Blood/Gore:  Almost none.<br />Boobs:  None.<br />Likable characters:  Maybe the landlord?<br />Plot devices that made sense:  None.<br />People in this film that look like Jeff Goldbloom:  M Knight Shamalayan.<br /><br />Over all verdict:  Maybe watch it on cable if you're having a hard time sleeping.  Otherwise skip.\nReally?\nTrue Blood: Season 1\nAnna Paquin  (Actor),     Stephen Moyer  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'True Blood: The Complete First Season (DVD)', 'TRUE BLOOD chronicles the backwoods Louisiana town of Bon Temps... where vampires have emerged from the coffin, and no longer need humans for their fix. Sookie Stackhouse (Anna Paquin, Golden Globe(R)-winner for \"True Blood\", Academy Award®-winner for “The Piano”) works as a waitress at the rural bar Merlotte\\'s. Though outwardly a typical young woman, she keeps a dangerous secret: she has the ability to hear the thoughts of others. Her situation is further complicated when the bar gets its first vampire patron - 173-year old Bill Compton (Steven Moyer, \"Quills\") - and the two outsiders are immediately drawn to each other. Delivering the best of what audiences have come to expect from Creator and Executive Producer Alan Ball (writer of Oscar®-winning Best Picture “American Beauty”, creator of the Emmy® Award-winning HBO® series “Six Feet Under”), TRUE BLOOD is a dark and sexy tale that boldly delves into the heart - and the neck - of the Deep South.', ']]>', 'Amazon.com', 'Alan Ball’s', 'True Blood', 'series works well for television, as it has enough sensationalism to tantalize and enough story girth to make the viewer care about the characters. That one can finally invest emotion into monsters, including an undead Civil War victim, a transformer who can shapeshift into various animals, and a female mind reader, speaks volumes about America’s willingness to accept fantasy. Of course, television has always produced good fantasy shows (', 'I Dream of Jeannie', '), but', 'True Blood’s', 'Southern Goth brand of fun horror is more macabre and more perverse, not to mention gorier, than most shows of its kind to date. Adapted from Charlaine Harris’ Sookie Stackhouse novels,', 'True Blood', 'thrills because of its equal blend in each episode of erotica, humor, tragedy, mystery, and fantasy.', 'Set in a rural, swampy Louisiana parrish, the show centers around Sookie Stackhouse (Anna Paquin) and her clan, sweet grandmother Adele (Lois Smith) and air-headed brother Jason (Ryan Kwanten). Illicit love is spawned early on, when Sookie saves vampire Bill Compton (Stephen Moyer) from having his blood stolen in the parking lot of Merlotte’s diner, owned by Sam Merlotte (Sam Trammell) who completes what will form a complex love triangle. As tensions between Sookie’s suitors loosen or tighten, many side plots, such as her African American best friend Tara’s (Rutina Wesley) struggle with an alcoholic, Bible-thumping mother and her brother’s dangerous crush on drug addicted hippie, Amy Burley (Lizzy Caplan), keep one wondering who will succeed in this podunk place. The main tension throughout, however, is a race war waged between vampires and humans. As murders of “fang bangers” occur (human girls who let vampires bite them) and dumb policeman Andy Bellefleur (Chris Bauer) fails to find clues, one sees the metaphorical implications of vampirism and feels deeper resonance with what can be a downright trashy show. Gossip galore, especially about what kinds of babies interbreeding will produce, is rampant. One of the funniest characters is Tara’s flamboyant cousin, Lafayette (Nelsan Ellis), who deals drugs, works as a fry cook, and services the local white politicians, while making sure he’s always up in everyone’s business.', 'What makes', 'True Blood', 'smarter than pure soap opera is the parallels it draws between its monster mash and actual, familiar societal problems. Sookie and her friends watch the news, where Evangelicals bash vampires and prohibit mixed marriage, and everyone is addicted to V, a.k.a vampire blood, that effects like psychedelic heroin. Even its gore reflects a mix of serious and silly, as vampires explode into red, sticky goop. Though it may not be attempting to qualify for the best vampire footage ever shot,', 'True Blood', 'is as addictive as that substance the town’s youth obsesses over, which is a metaphor in itself. --', 'Trinie Dalton', 'Stills from', 'True Blood', '(Click for larger image)']\n{'Genre': 'Drama, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Box set, Color, Dolby, Widescreen, Subtitled, NTSC, Closed-captioned', 'Contributor': 'William Sanderson, Lois Smith, Rutina Wesley, Nelsan Ellis, Sam Trammell, Ryan Kwanten, Lizzy Caplan, Chris Bauer, Anna Paquin, Stephen MoyerWilliam Sanderson, Lois Smith, Rutina Wesley, Nelsan Ellis, Sam Trammell, Ryan Kwanten, Lizzy Caplan, Chris Bauer, Anna Paquin, Stephen Moyer  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 1.5 inches; 14.4 Ounces', 'Item model number': '5069617', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Widescreen, Subtitled, NTSC, Closed-captioned', 'Run time': '12 hours', 'Release date': 'October 21, 2014', 'Actors': 'Anna Paquin, Stephen Moyer, Sam Trammell, Rutina Wesley, Ryan Kwanten', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'HBO Studios', 'Number of discs': '5'}\nI checked this out to see what all the hype was about.  Horror movies and even vampire stories have always been my favorites.  Campy TV shows like Buffy are right up my ally.  This show, however, reached a level of absurdity that I cannot tolerate.  I begrudgingly made it half way through the third episode before I had to turn it off.  My initial reaction to the first episode stuck through out.  I didn't really care for any of the characters, the dialog was awful and the whole \"forbidden romance between a girl and a vampire\" idea has been played out, beaten up and burned down to the ground already.  To be open minded, I did try to stick this out.  I made it to the third episode hoping that the negative vibe I got would grow a bit.  That didn't happen for me, however.<br /><br />Over all, this show feels like it's made for teenagers with a vampire fetish.\nRidiculous\nDexter: Season 1\nMichael C. Hall  (Actor),     Erik King  (Actor),     Michael Cuesta  (Director),     Tony Goldwyn  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', \"The first season of this creepy dramedy series, originally aired on Showtime, follows Dexter Morgan, a forensics expert who spends his free time as a serial killer, eradicating some of the city's most notorious criminals one by one. Star Michael C. Hall, Jennifer Carpenter, Julie Benz Special Features: Widescreen - 2.40 Audio: Stereo - English Additional Release Material: Audio Commentary - 1. The Cast Featurette - 1. The Academy of Blood - a Killer Course Free Episodes - Showtime's hit show - THE BROTHERHOOD DVD-ROM: Free Showtime Series Episodic Consumer Sweepstakes for a Sony HD Television Runtime: 655 minutes Year of Release: 2007.\", 'Amazon.com', \"An interesting and original idea that's very skillfully executed, Showtime's\", 'Dexter', 'is never less than watchable, often quite compelling, and sometimes thoroughly riveting. As the 12 episodes from the show\\'s first season (packaged here in a four disc set) reveal, it\\'s also the epitome of \"high concept,\" a kind of', 'Silence of the Lambs', 'for the', 'C.S.I.', \"generation. Creator-executive producer James Manos Jr.'s title character, one Dexter Morgan (played by Michael C. Hall of\", 'Six Feet Under', 'renown), works for the Miami Police Department as an blood spatter analyst, visiting crime scenes and helping figure out what happened. He has an avocation, too: during his off hours, he tracks down some very, very bad people who for various reasons have eluded the proper authorities. Seems his adoptive father, a cop himself, taught the kid how to channel his dark side in a \"positive\" direction; and so, having captured these evildoers (including a child molester-murderer and a recidivist drunk driver with a trail of bodies in his wake), Dex dispatches them with clinical precision, thus making him a serial killer who snuffs serial killers. But there\\'s more--', 'much', 'more, as it turns out. By his own description, Dexter is \"a monster,\" an empty shell who fakes all human interactions and admits to no real feelings for anything or anyone, including his foster sister (Jennifer Carter) and his nominal girlfriend (Julie Benz), a former crack addict and battered spouse who\\'s as uninterested in sex as he is. There\\'s an explanation for Dexter\\'s weirdness, of course, one so deep and traumatic that even he isn\\'t aware of it. It\\'s gradually revealed over the course of the season as he and the cops (who include Erik King, Lauren Velez, and David Zayas, all first-rate) track down the so-called \"Ice Truck Killer,\" a fellow monster whose grisly m.o. both fascinates and taunts our hero, leading to a genuinely shocking and squirm-inducing finale.', 'Dexter', \"can be a bit arch, with an ironic, too-hip-for-the-room tone that get a little old. Still, it's a safe bet that anyone who views this first season will be salivating for the second. Extras include audio commentary on two episodes, a featurette about real-life blood spatter analysis, and a variety of DVD-ROM items. --\", 'Sam Graham', 'Beyond', 'Dexter', 'More TV Head-cases on DVD', 'The Book that Started It All', 'More from Showtime', 'Stills from', 'Dexter: The First Season', '(click for larger image)']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Jennifer Carpenter, Tony Goldwyn, Julie Benz, Erik King, James Remar, Michael Cuesta, C. S. Lee, Lauren Vélez, Michael C. Hall, David ZayasJennifer Carpenter, Tony Goldwyn, Julie Benz, Erik King, James Remar, Michael Cuesta, C. S. Lee, Lauren Vélez, Michael C. Hall, David Zayas   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.66 x 5.42 x 7.65 inches; 7.76 Ounces', 'Item model number': '6428098221', 'Director': 'Michael Cuesta, Tony Goldwyn', 'Media Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '10 hours and 50 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Michael C. Hall, Erik King, James Remar, Julie Benz, Jennifer Carpenter', 'Studio': 'Showtime Ent. / Paramount', 'Number of discs': '4'}\nI finally got around to watching this show, and loved it!  The idea of a serial killer who only kills other killers is rather intriguing, and this show presents it in such a fun way.  The characters are all great and the dialog is brilliantly witty.  The first season had a slight flaw of being rather predictable, but that really doesn't detract from my over all rating.  This show is also strangely  addictive!  The only way to really watch it is by DVD or somehow streaming it from the internet (I watched it on Netflix, but I enjoyed it enough to buy on DVD once I get some extra cash!) so you can watch the episodes back-to-back, as most every one ends as a cliff hanger.\nLoved it!\nNight of the Demons\nEdward Furlong  (Actor),     Shannon Elizabeth  (Actor),     Adam Gierasch  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n[\"Angela (Shannon Elizabeth) is throwing a decadent Halloween part at New Orleans' infamous Broussard Mansion. But after the police break up the festivities, Maddie (Monica Keena) and a few friends stay behind. Trapped inside the locked mansion gates, the remaining guests uncover a horrifying secret and soon fall victim to seven vicious, blood-thirsty demons.\"]\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Edward Furlong, Adam Gierasch, Shannon Elizabeth, Michael Copon, John F. Beach, Monica Keena', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.55 x 5.38 x 7.52 inches; 0.01 Ounces', 'Item model number': '7986139', 'Director': 'Adam Gierasch', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Edward Furlong, Shannon Elizabeth, Monica Keena, John F. Beach, Michael Copon', 'Studio': 'Entertainment One', 'Number of discs': '1'}\nI am a fan of the original.  I decided to give this  a shot, as it was streaming on Netflix and had a decent rating (3.8 stars at the time of my viewing.)  Up until the end, it was just mediocre.  The end killed it.  Granted it had a few decent scenes in it, the little enjoyment I got from them didn't make up for the rest of the movie.<br /><br />I cannot recommend this one.\nNot worthy!\nThe Walking Dead: Season 1 [Blu-ray]\nAndrew Lincoln  (Actor),     Jon Bernthal  (Actor),     Frank Darabont  (Director, Producer, Writer)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n[\"After waking from a coma in an abandoned hospital, police officer Rick Grimes finds the world he knew gone - ravaged by a zombie epidemic of apocalyptic proportions. Nearby, on the outskirts of Atlanta, a small encampment struggles to survive as 'the dead' stalk them at every turn. Can Rick and the others hold onto their humanity as they fight to live in this terrifying new world? And, amidst dire conditions and personal rivalries, will they ultimately survive one another? AMC’s The Walking Dead is an epic, survival adventure series from the director of The Shawshank Redemption and the producer of The Terminator and Aliens.\"]\n{'Genre': 'Horror', 'Format': 'Blu-ray, Widescreen, Subtitled', 'Contributor': 'Sarah Wayne Callies, Laurie Holden, Frank Darabont, Jeffrey DeMunn, Emma Bell, Gale Ann Hurd, Andrew Lincoln, Jon BernthalSarah Wayne Callies, Laurie Holden, Frank Darabont, Jeffrey DeMunn, Emma Bell, Gale Ann Hurd, Andrew Lincoln, Jon Bernthal  See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '000102423', 'Director': 'Frank Darabont', 'Media Format': 'Blu-ray, Widescreen, Subtitled', 'Run time': '4 hours and 52 minutes', 'Release date': 'March 8, 2011', 'Actors': 'Andrew Lincoln, Jon Bernthal, Laurie Holden, Sarah Wayne Callies, Emma Bell', 'Subtitles': 'English, Spanish', 'Producers': 'Frank Darabont, Gale Ann Hurd', 'Studio': 'AMC and Anchor Bay Entertainment', 'Writers': 'Frank Darabont', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI realize that I'm going against the grain here, but I couldn't stand this show.  As another reviewer said, the first episode was quite good.  It sucked after that!  I had to quit in the middle of the series.  The characters are extremely one-dimensional, and everything that happened was incredibly predictable.  All of this is coming from a huge, life-long fan of horror films and books.  I spent much of my time watching this show thinking \"yep...  I've seen that before.\"  Or \"I bet this'll happen next!\"  Sure enough, my predictions usually transpired.<br /><br />The Good:  Nice visuals and beautiful cinematography.  Even though I didn't like the show, it looks great in HD!<br />The Bad:  One-dimensional characters, highly-predictable story line and the audio effects were way too over-the-top.<br /><br />My recommendation:  If you're gonna watch this, try not to spend too much money!\nReally?\nSplice [Blu-ray]\nAdrien Brody  (Actor),     Sarah Polley  (Actor),     Vincenzo Natali  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Superstar genetic engineers Clive (Adrien Brody) and Elsa (Sarah Polley) specialize in splicing DNA from different animals to create incredible new hybrids. Now they want to use human DNA in a hybrid that could revolutionize science and medicine. But when the pharmaceutical company that funds their research forbids it, they secretly take their experiment underground--risking their careers to push the boundaries of science and serve their own curiosity and ambition. The result is Dren, an amazing, strangely beautiful creature of uncommon intelligence and unexpected physical developments. At first, Dren exceeds their wildest dreams. But as she grows and learns at an accelerated rate, her existence threatens to become their worst nightmare.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '6.7 x 5.3 x 0.5 inches; 2.4 Ounces', 'Item model number': '7982681', 'Director': 'Vincenzo Natali', 'Media Format': 'Multiple Formats, Blu-ray, Dolby, AC-3, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Adrien Brody, Sarah Polley, Delphine Chaneac', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nThis was on sale at Best Buy for $5.99 (Halloween special,) so I picked it up.  Man, it wasn't even worth the price I paid!  In fact, I couldn't finish it!  There was absolutely nothing scary about this movie.  Splice plays out more like a poorly-written science fiction drama.  The acting was only average at best.  Some of the cinematography was fairly well done, but the over all plot killed it.<br /><br />I cannot recommend this movie to anyone that I like.\nBoring, boring, boring!",
  "profile": "**User Profile Summary:**\n\n- **Film and Series Preferences:** The user continues to favor intelligent, artsy films and series with strong thematic depth. Their recent purchase and critique of a science fiction film highlight a growing impatience with formulaic narratives and emphasize their critical stance toward predictable plots and one-dimensional characters.\n\n- **Director and Actor Affinity:** They appreciate the works of acclaimed directors and actors but increasingly seek more complex characterizations and innovative storytelling, as evidenced by their latest review of a film that failed to meet these expectations.\n\n- **Content Tolerance:** While open to violence and explicit content, the user insists on thoughtful integration, prioritizing engaging dialogue and character dynamics over conventional genre tropes.\n\n- **Viewing Habits:** Despite previously leaning towards purchasing DVDs, this latest experience suggests a decrease in enthusiasm for certain genres, especially those that do not offer depth or engagement. They remain discriminating, suggesting that visual appeal alone is insufficient.\n\n- **Critique Style:** Their nuanced reviews focus on artistic merit and coherence. The recent negative feedback demonstrates a commitment to challenging mediocrity in mainstream media, indicating a demand for high-art storytelling that meets their established standards.\n\nOverall, the user seeks cohesive narratives and artistic integrity, emphasizing the necessity for depth and originality, particularly in genres that have become entrenched in clichés.",
  "metrics": {
    "rouge1_f": 0.061442332725852644,
    "rouge2_f": 0.0057306590257879654,
    "rougeL_f": 0.03332465503775059,
    "meteor": 0.018394799873192445,
    "bleu1": 7.897859252565313e-09,
    "bleu2": 2.6153611883591554e-09,
    "bleu3": 3.5763729745976193e-10,
    "bleu4": 1.3237731416063183e-10,
    "bertscore_precision": 0.3377690315246582,
    "bertscore_recall": 0.5090237259864807,
    "bertscore_f1": 0.40607914328575134
  }
}