{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: LUMINESS Aeroscalp Scalp Massaging Brush - Air Powered Sonic Hair Massager & Cleansing Device Tool Increases Lather of Shampoos to Clean the Scalp - Water-Resistant & Gentle for Sensitive Skin\nReview Date: 2023/01/18\nStore: LUMINESS\nAverage Rating: 4.2\nProduct Details: {'Brand': 'LUMINESS', 'Skin Type': 'All', 'Item Form': 'Oil', 'Finish Type': 'Metallic', 'Product Benefits': 'Designed with soft, flexible silicone bristles enhance cleansing action helping to gently remove excess oil and buildup from the scalp.Designed with soft, flexible silicone bristles enhance cleansing action helping to gently remove excess oil and buildup from the scalp.  See more', 'Package Dimensions': '10 x 6.5 x 5 inches; 11.99 Ounces', 'UPC': '841249121169', 'Manufacturer': 'LUMINESS'}\nReview Text: Good quality and works well for applying oil to the scalp. The color is nice too. My only complaint is I wish it was rechargeable but it takes batteries that are not included.\nReview Title: Feels good and good for applying oils.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "PRETTISEST Long Curly Wavy Wig Ombre 28 Inches Body Wave Wigs for Black White Women Replacement Synthetic Body Wave Wig (Color:#1B)\nPRETTIEST\n{'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'PRETTIEST', 'Package Dimensions': '11.5 x 8.54 x 2.05 inches; 7.44 Ounces', 'UPC': '778862790109'}\nHonestly I love this wig &lt;3 shes pretty thick for the price. If you ever see this wig on sale, get it !! I literally took it out of the bag and started using it. Imagine when I style it. I have brushed it and it does shed but not as much as other cheap wigs. Overall this wig is amazing. I wish bought multiple now\nAmazing &lt;3\nBeauty Bakerie Lip Whip Liquid Metallic Lipstick, Long Lasting Lip Color, Smudge Proof Makeup, Berried, 3.5 mL\nBeauty Bakerie\n['Beauty Bakerie Berried metallic Lip whip is a metallic red liquid lipstick with hints of deep purple. It is long-lasting, smudge-proof and waterproof. Glides smoothly over lips, It is a weightless and non-sticky texture.']\n{'Brand': 'Beauty Bakerie', 'Color': 'Berried', 'Skin Type': 'All', 'Item Form': 'Liquid', 'Finish Type': 'Metallic', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.59 x 0.59 x 3.54 inches; 0.71 Ounces', 'Item model number': '754680458186', 'UPC': '754680458186', 'Manufacturer': 'Beauty Bakerie Cosmetics Brand'}\nSuper pigmented, when dried. It stays put and will go no where. It comes off with regular methods, just alot harder then a oil based remover. I highly recommend for the staying power !!\nWill stay put after drying!\nVANALIA Gel Nail Polish Remover Kit - 2pcs of Gel Polish Remover & 1pc of Liquid Latex Tape Peel Off Cuticle Guard Skin Barrier Protector, 3-5 Minutes Easily & Quickly & Healthy Method, 45 ml\nVANALIA\n{'Package Dimensions': '4.9 x 4.1 x 1.3 inches; 7.2 Ounces', 'UPC': '717666053690'}\nWorks well for gel polish removal and this kit comes with two and liquid latex to protect your fingers. I love this kit. I do recommend it.\nWork well.\nSOTICA Rotary Machine Pen Kit, Complete Makeup Pen Kit Professional Machine Pen Kit with 2Pcs Power Supply Machine Pen 40Pcs Cartridges Ink Caps Practice Skin and Machine Parts for Artist\nSotica\n{'Package Dimensions': '10.04 x 9.84 x 3.86 inches; 3.23 Pounds', 'Manufacturer': 'SOTICA'}\nThis kit has everything to get you started tattooing. It even comes with fake skin to practice on. Everything looks professional.\nNice starter kit!\nVelma Wig Short Brown Bob Wig with Bangs Velma Scooby Doo Costume Wig for Women Velma Wig and Glasses for Party Halloween CJ006BR\nCJK\n{'Color': 'Brown', 'Material': 'Synthetic', 'Hair Type': 'Cute, Natural, Short hair, Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant'}\nNeeds some love with some restyling but still good costume wig with glasses to match. The wig is super shiny. It's not bad for a Velma look.\nNeeds some love but still a good costume wig.\nPhilip Kingsley Body-Building Volumizing Hair Products Set - Shampoo, Conditioner, Root Boosting Volumizer Spray and Hair Plumping Volume Cream for Lifting Fine, Limp, Flat, Flyaway Hair\nPHILIP KINGSLEY\n{'Brand': 'PHILIP KINGSLEY', 'Hair Type': 'Fine', 'Age Range (Description)': 'Adult', 'Unit Count': '2.0 Ounce', 'Number of Items': '5', 'Package Dimensions': '7.87 x 5.51 x 1.81 inches; 11.43 Ounces'}\nWorks good but not my go too for fullness and texture. It did bring out my natural curls but I didnt like how the spray felt in my hair but I like the shampoo and conditioner.\nWorks good.\nDisposable Face Towel Extra Thick Lint-Free Disposable Face Cloths, Without Peculiar Smell, Cotton Tissue Dry Wipes for Sensitive Skin Face Cleansing, Surface Cleansing ,Baby Care, Travel,Outdoor Activities (70 Count (Pack of 1))\nXBSLPNCED\n{'Brand': 'XBSLPNCED', 'Skin Type': 'Dry,Sensitive', 'Material Feature': 'Disposable', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '9.76 x 8.43 x 4.06 inches; 1.07 Pounds', 'UPC': '727881143274'}\nI love how these are lint free. So use these to wipe my nail brushes as I do acrylic or poly gel nails. I absolutely love them.\nAmazing quality!\n14pcs Nail Drill Bits Set,3/32 Inch Acrylic Nail Drill Bits with Case,Quartz Pointed Nail Bits for Nails,Cuticle Remover Bits, Manicure Tools\nBouttarro\n{'Package Dimensions': '3.82 x 2.48 x 0.47 inches; 1.45 Ounces', 'Item model number': 'YSDMT014', 'UPC': '759060964790'}\nI'm super happy about these drill bits for electric nail file. They all fit in both my e files. I'm glad I got these.\nI'm super happy about these drill bits for electric nail file.\nPENEBELLA Retinol Eye Cream, Eye Cream for Dark Circles & Puffiness, hydrating, daily wrinkle Cream\nPENEBELLA\n{'Brand': 'PENEBELLA', 'Number of Items': '1', 'Product Benefits': 'Hydrating', 'Age Range (Description)': 'Adult', 'Material Feature': 'Natural'}\nI love this eye cream. It feels gentle around my eyes. It has been working well for making my dark circles lighter. I fit this into my nightly skin care routine now.\nWorks very well.\nPENEBELLA Eye Cream, Natural and Organic Anti Aging Under Eye Cream to Reduce Puffiness, Wrinkles, and Under Eye Bags, Dark Circle Under Eye Treatment\nPENEBELLA\n{'Brand': 'PENEBELLA', 'Number of Items': '1', 'Product Benefits': 'Anti-Aging', 'Age Range (Description)': 'Adult', 'Special Feature': 'Anti Aging'}\nI love this eye cream. It feels gentle around my eyes. It has been working well for making my dark circles lighter. I fit this into my nightly skin care routine now.\nWorks well and I'm happy with this eye cream.\nPENEBELLA Eye Cream - Under Eye Cream for Dark Circles and Puffiness - Hyaluronic Acid Hydrating Eye Cream\nPENEBELLA\n{'Brand': 'PENEBELLA', 'Active Ingredients': 'avocado,peptides,retinol', 'Number of Items': '1', 'Product Benefits': 'Hydrating', 'Age Range (Description)': 'Adult'}\nI love this eye cream. It feels gentle around my eyes. It has been working well for making my dark circles lighter. I fit this into my nightly skin care routine now.\nAwesome eye cream.\nPENEBELLA Hyaluronic Acid Eye Cream, Anti-Aging Treatment for Under Eyes with Vitamin C and Avocado oil, Best for Dark Circles and Wrinkles\nPENEBELLA\n{'Brand': 'PENEBELLA', 'Active Ingredients': 'avocado,vitamin c', 'Number of Items': '1', 'Skin Type': 'All', 'Item Volume': '4 Fluid Ounces'}\nI love this eye cream. It feels gentle around my eyes. It has been working well for making my dark circles lighter. I fit this into my nightly skin care routine now.\nGood eye cream\nLUMINESS Aeroscalp Scalp Massaging Brush - Air Powered Sonic Hair Massager & Cleansing Device Tool Increases Lather of Shampoos to Clean the Scalp - Water-Resistant & Gentle for Sensitive Skin\nLUMINESS\n{'Brand': 'LUMINESS', 'Skin Type': 'All', 'Item Form': 'Oil', 'Finish Type': 'Metallic', 'Product Benefits': 'Designed with soft, flexible silicone bristles enhance cleansing action helping to gently remove excess oil and buildup from the scalp.Designed with soft, flexible silicone bristles enhance cleansing action helping to gently remove excess oil and buildup from the scalp.  See more', 'Package Dimensions': '10 x 6.5 x 5 inches; 11.99 Ounces', 'UPC': '841249121169', 'Manufacturer': 'LUMINESS'}\nGood quality and works well for applying oil to the scalp. The color is nice too. My only complaint is I wish it was rechargeable but it takes batteries that are not included.\nFeels good and good for applying oils.",
  "profile": "**User Summary:**\n\n- **Product Preference:** The user enjoys long, wavy, and curly synthetic wigs in modern styles with vibrant colors and has developed an interest in themed costume wigs for events like Halloween. Their hair care regimen now includes tools that enhance scalp health alongside products focused on curl and volume. They prioritize skincare essentials for sensitive skin, particularly eye creams to address dark circles and puffiness. Additionally, they are attracted to high-quality cosmetics, nail care items, and professional beauty tools, especially in manicure accessories.\n\n- **Quality Expectations:** The user seeks good value for price, emphasizing product thickness, durability, and effectiveness, especially in skincare and hair care tools. They desire long-lasting results that are easy to achieve, maintaining high standards for all beauty products.\n\n- **Purchase Behavior:** Positive past experiences guide their purchasing decisions, while they remain cautious with new items. They balance everyday essentials with themed products while integrating practical skincare and hair care into their routine.\n\n- **Reviewing Style:** Their reviews demonstrate enthusiasm balanced with constructive criticism, expressing appreciation for products while noting any shortcomings, such as the need for rechargeable features in devices.\n\n- **Trend Awareness:** The user actively engages with beauty and skincare trends, staying informed about new product launches and deals, reinforcing their commitment to quality, value, and effectiveness in beauty products.",
  "metrics": {
    "rouge1_f": 0.15200562983814217,
    "rouge2_f": 0.016913319238900635,
    "rougeL_f": 0.06615059817030261,
    "meteor": 0.05542844928009016,
    "bleu1": 0.0029761128323123887,
    "bleu2": 0.0005764686490315963,
    "bleu3": 9.764691048642453e-05,
    "bleu4": 4.022507778934276e-05,
    "bertscore_precision": 0.3562236726284027,
    "bertscore_recall": 0.47132790088653564,
    "bertscore_f1": 0.405770868062973
  }
}