{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Velma Wig Short Brown Bob Wig with Bangs Velma Scooby Doo Costume Wig for Women Velma Wig and Glasses for Party Halloween CJ006BR\nReview Date: 2022/09/13\nStore: CJK\nAverage Rating: 4.5\nProduct Details: {'Color': 'Brown', 'Material': 'Synthetic', 'Hair Type': 'Cute, Natural, Short hair, Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant'}\nReview Text: Needs some love with some restyling but still good costume wig with glasses to match. The wig is super shiny. It's not bad for a Velma look.\nReview Title: Needs some love but still a good costume wig.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "PRETTISEST Long Curly Wavy Wig Ombre 28 Inches Body Wave Wigs for Black White Women Replacement Synthetic Body Wave Wig (Color:#1B)\nPRETTIEST\n{'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'PRETTIEST', 'Package Dimensions': '11.5 x 8.54 x 2.05 inches; 7.44 Ounces', 'UPC': '778862790109'}\nHonestly I love this wig &lt;3 shes pretty thick for the price. If you ever see this wig on sale, get it !! I literally took it out of the bag and started using it. Imagine when I style it. I have brushed it and it does shed but not as much as other cheap wigs. Overall this wig is amazing. I wish bought multiple now\nAmazing &lt;3\nBeauty Bakerie Lip Whip Liquid Metallic Lipstick, Long Lasting Lip Color, Smudge Proof Makeup, Berried, 3.5 mL\nBeauty Bakerie\n['Beauty Bakerie Berried metallic Lip whip is a metallic red liquid lipstick with hints of deep purple. It is long-lasting, smudge-proof and waterproof. Glides smoothly over lips, It is a weightless and non-sticky texture.']\n{'Brand': 'Beauty Bakerie', 'Color': 'Berried', 'Skin Type': 'All', 'Item Form': 'Liquid', 'Finish Type': 'Metallic', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.59 x 0.59 x 3.54 inches; 0.71 Ounces', 'Item model number': '754680458186', 'UPC': '754680458186', 'Manufacturer': 'Beauty Bakerie Cosmetics Brand'}\nSuper pigmented, when dried. It stays put and will go no where. It comes off with regular methods, just alot harder then a oil based remover. I highly recommend for the staying power !!\nWill stay put after drying!\nVANALIA Gel Nail Polish Remover Kit - 2pcs of Gel Polish Remover & 1pc of Liquid Latex Tape Peel Off Cuticle Guard Skin Barrier Protector, 3-5 Minutes Easily & Quickly & Healthy Method, 45 ml\nVANALIA\n{'Package Dimensions': '4.9 x 4.1 x 1.3 inches; 7.2 Ounces', 'UPC': '717666053690'}\nWorks well for gel polish removal and this kit comes with two and liquid latex to protect your fingers. I love this kit. I do recommend it.\nWork well.\nSOTICA Rotary Machine Pen Kit, Complete Makeup Pen Kit Professional Machine Pen Kit with 2Pcs Power Supply Machine Pen 40Pcs Cartridges Ink Caps Practice Skin and Machine Parts for Artist\nSotica\n{'Package Dimensions': '10.04 x 9.84 x 3.86 inches; 3.23 Pounds', 'Manufacturer': 'SOTICA'}\nThis kit has everything to get you started tattooing. It even comes with fake skin to practice on. Everything looks professional.\nNice starter kit!\nVelma Wig Short Brown Bob Wig with Bangs Velma Scooby Doo Costume Wig for Women Velma Wig and Glasses for Party Halloween CJ006BR\nCJK\n{'Color': 'Brown', 'Material': 'Synthetic', 'Hair Type': 'Cute, Natural, Short hair, Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant'}\nNeeds some love with some restyling but still good costume wig with glasses to match. The wig is super shiny. It's not bad for a Velma look.\nNeeds some love but still a good costume wig.",
  "profile": "**User Summary:**\n\n- **Product Preference:** Enjoys long, wavy, and curly synthetic wigs in modern styles with vibrant colors, while expanding their interests to include costume wigs. Recent purchases indicate a growing interest in styles that enhance thematic looks, particularly for events like Halloween. Additionally, they continue to seek high-quality cosmetic products, nail care essentials, and professional beauty tools that enhance their appearance.\n- **Quality Expectations:** Seeks good value for price with a focus on thickness and durability in wigs and products. Values longevity and ease of use, favoring items that are long-lasting and effective. This includes a preference for wigs that may require some restyling but still serve well for themed occasions.\n- **Purchase Behavior:** Tends to buy products based on positive initial experiences. Shows strong satisfaction and a willingness to purchase multiples, while also exploring new related beauty items and tools. Recent interactions reflect a mix of casual and functional beauty purchases that cater to both everyday and thematic needs.\n- **Reviewing Style:** Expresses genuine affection for products in reviews, using enthusiastic language. Offers constructive feedback, indicating an appreciation for effectiveness and ease of use, while maintaining an optimistic tone about the products.\n- **Trend Awareness:** Actively engages with beauty trends and thematic stylings, staying proactive about product releases and sales across various beauty categories.\n\nOverall, the user prioritizes quality, value, aesthetic appeal, and versatility in their beauty regimen, now featuring both everyday and creative styling needs.",
  "metrics": {
    "rouge1_f": 0.22683264177040113,
    "rouge2_f": 0.019417475728155338,
    "rougeL_f": 0.08575380359612725,
    "meteor": 0.10704000172858832,
    "bleu1": 0.0969658159086373,
    "bleu2": 0.02494026405675423,
    "bleu3": 0.01100968003664769,
    "bleu4": 0.006156306144235767,
    "bertscore_precision": 0.3640388250350952,
    "bertscore_recall": 0.432367205619812,
    "bertscore_f1": 0.3952718675136566
  }
}