{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Philip Kingsley Body-Building Volumizing Hair Products Set - Shampoo, Conditioner, Root Boosting Volumizer Spray and Hair Plumping Volume Cream for Lifting Fine, Limp, Flat, Flyaway Hair\nReview Date: 2022/11/06\nStore: PHILIP KINGSLEY\nAverage Rating: 3.8\nProduct Details: {'Brand': 'PHILIP KINGSLEY', 'Hair Type': 'Fine', 'Age Range (Description)': 'Adult', 'Unit Count': '2.0 Ounce', 'Number of Items': '5', 'Package Dimensions': '7.87 x 5.51 x 1.81 inches; 11.43 Ounces'}\nReview Text: Works good but not my go too for fullness and texture. It did bring out my natural curls but I didnt like how the spray felt in my hair but I like the shampoo and conditioner.\nReview Title: Works good.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "PRETTISEST Long Curly Wavy Wig Ombre 28 Inches Body Wave Wigs for Black White Women Replacement Synthetic Body Wave Wig (Color:#1B)\nPRETTIEST\n{'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'PRETTIEST', 'Package Dimensions': '11.5 x 8.54 x 2.05 inches; 7.44 Ounces', 'UPC': '778862790109'}\nHonestly I love this wig &lt;3 shes pretty thick for the price. If you ever see this wig on sale, get it !! I literally took it out of the bag and started using it. Imagine when I style it. I have brushed it and it does shed but not as much as other cheap wigs. Overall this wig is amazing. I wish bought multiple now\nAmazing &lt;3\nBeauty Bakerie Lip Whip Liquid Metallic Lipstick, Long Lasting Lip Color, Smudge Proof Makeup, Berried, 3.5 mL\nBeauty Bakerie\n['Beauty Bakerie Berried metallic Lip whip is a metallic red liquid lipstick with hints of deep purple. It is long-lasting, smudge-proof and waterproof. Glides smoothly over lips, It is a weightless and non-sticky texture.']\n{'Brand': 'Beauty Bakerie', 'Color': 'Berried', 'Skin Type': 'All', 'Item Form': 'Liquid', 'Finish Type': 'Metallic', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.59 x 0.59 x 3.54 inches; 0.71 Ounces', 'Item model number': '754680458186', 'UPC': '754680458186', 'Manufacturer': 'Beauty Bakerie Cosmetics Brand'}\nSuper pigmented, when dried. It stays put and will go no where. It comes off with regular methods, just alot harder then a oil based remover. I highly recommend for the staying power !!\nWill stay put after drying!\nVANALIA Gel Nail Polish Remover Kit - 2pcs of Gel Polish Remover & 1pc of Liquid Latex Tape Peel Off Cuticle Guard Skin Barrier Protector, 3-5 Minutes Easily & Quickly & Healthy Method, 45 ml\nVANALIA\n{'Package Dimensions': '4.9 x 4.1 x 1.3 inches; 7.2 Ounces', 'UPC': '717666053690'}\nWorks well for gel polish removal and this kit comes with two and liquid latex to protect your fingers. I love this kit. I do recommend it.\nWork well.\nSOTICA Rotary Machine Pen Kit, Complete Makeup Pen Kit Professional Machine Pen Kit with 2Pcs Power Supply Machine Pen 40Pcs Cartridges Ink Caps Practice Skin and Machine Parts for Artist\nSotica\n{'Package Dimensions': '10.04 x 9.84 x 3.86 inches; 3.23 Pounds', 'Manufacturer': 'SOTICA'}\nThis kit has everything to get you started tattooing. It even comes with fake skin to practice on. Everything looks professional.\nNice starter kit!\nVelma Wig Short Brown Bob Wig with Bangs Velma Scooby Doo Costume Wig for Women Velma Wig and Glasses for Party Halloween CJ006BR\nCJK\n{'Color': 'Brown', 'Material': 'Synthetic', 'Hair Type': 'Cute, Natural, Short hair, Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant'}\nNeeds some love with some restyling but still good costume wig with glasses to match. The wig is super shiny. It's not bad for a Velma look.\nNeeds some love but still a good costume wig.\nPhilip Kingsley Body-Building Volumizing Hair Products Set - Shampoo, Conditioner, Root Boosting Volumizer Spray and Hair Plumping Volume Cream for Lifting Fine, Limp, Flat, Flyaway Hair\nPHILIP KINGSLEY\n{'Brand': 'PHILIP KINGSLEY', 'Hair Type': 'Fine', 'Age Range (Description)': 'Adult', 'Unit Count': '2.0 Ounce', 'Number of Items': '5', 'Package Dimensions': '7.87 x 5.51 x 1.81 inches; 11.43 Ounces'}\nWorks good but not my go too for fullness and texture. It did bring out my natural curls but I didnt like how the spray felt in my hair but I like the shampoo and conditioner.\nWorks good.",
  "profile": "**User Summary:**\n\n- **Product Preference:** Enjoys long, wavy, and curly synthetic wigs in modern styles with vibrant colors, with an increasing interest in costume wigs for thematic events like Halloween. Recently expanded focus to hair care with a particular interest in products that enhance curl and volume, while also continuing to seek high-quality cosmetic products, nail care essentials, and professional beauty tools.\n  \n- **Quality Expectations:** Values good value for price, emphasizing thickness, durability, and effectiveness. Prefers items that provide long-lasting results with ease of use. While the user appreciates products that enhance styling versatility for themed occasions, they are discerning about performance, especially regarding hair care products.\n\n- **Purchase Behavior:** Makes purchases based on positive past experiences but has shown some hesitation with new hair care items that do not fully meet their expectations. Displays a tendency to explore a variety of beauty products, with recent purchases reflecting a blend of everyday essentials and thematic styling needs.\n\n- **Reviewing Style:** Utilizes enthusiastic language in reviews, balanced with constructive feedback. While expressing affection for products, they are candid about any shortcomings and provide an optimistic outlook.\n\n- **Trend Awareness:** Actively engages with beauty trends and thematic styling, remaining proactive about new product launches and promotional opportunities across different beauty categories.\n\nOverall, the user prioritizes quality, value, aesthetic appeal, and versatility in their beauty regimen, now incorporating both everyday hair care and creative styling elements.",
  "metrics": {
    "rouge1_f": 0.20318237454100369,
    "rouge2_f": 0.007361963190184048,
    "rougeL_f": 0.07833537331701346,
    "meteor": 0.0909090909090909,
    "bleu1": 0.061813509665321544,
    "bleu2": 0.0064206912044844225,
    "bleu3": 0.0014025214114595991,
    "bleu4": 0.0006560634206440842,
    "bertscore_precision": 0.3527737259864807,
    "bertscore_recall": 0.4291852116584778,
    "bertscore_f1": 0.3872460722923279
  }
}