{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: O.M.CHIC Mannequin Head with shoulders for wig, Display wigs Eyeglasses Necklaces and Earrings\nReview Date: 2021/09/25\nStore: O.M.CHIC\nAverage Rating: 4.8\nProduct Details: {'Package Dimensions': '18.3 x 15.7 x 9 inches; 5.1 Pounds', 'UPC': '714676502699 714676502675'}\nReview Text: I probably use this for a different purpose than those who typically order, but I needed something to display my fiber arts on and this was the perfect size for what I need. The mannequin comes without a wig, but I had one on hand to make my art more realistic. It's very proportional to a normal head circumference. I like that it has the shoulders so I can use a scarf and hat to show off.<br /><br />For $65 at the time of review, I really can't complain. It's so realistic, that you can use it as a display or you can use it to train yourself I'm hair. It even has a spot for earrings too. Overall, I have zero complaints. It stands perfectly because of the size and shape. It has a good base. Whether it is for hair design or a display, this will work well!\nReview Title: Works For My Crocheting\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Bath Bombs, SAZEN Bath Bomb with Natural & Organic Essential Oils, Shea Coconut Butter for Skin Moisturize, Bubble Spa Bath, Birthday Mothers Day Christmas Handmade Gift Set for Women Kids Her Him\nSAZEN\n{'Brand': 'SAZEN', 'Scent': 'Coconut', 'Material Feature': 'Organic Ingredients', 'Unit Count': '24.00 Count', 'Number of Items': '24', 'Package Dimensions': '12.17 x 6.26 x 2.24 inches; 2.65 Pounds', 'Item model number': 'SAZEN 01', 'UPC': '745103723622', 'Manufacturer': 'SAZEN'}\n[[VIDEOID:73b249dcdf678ad402a99764551a434d]] When you open the box, you see 18 magical pieces and think this is excellent. Unfortunately, they are super perfume scented, but the perfume goes away in just a moment of two in the bath. I used 2 in one bath and was disappointed that the scent didn't linger for much longer than it did. Especially since the description specifies that it would be great for sinuses! These are more for children who don't enjoy the spa setting as much and just want colorful tubs.\nNot Much Scent...\nQiray Hair Ties For Women Coil Hair Ties,Large Lace Phnom Penh,5 Colors 10 Pieces.\nQiray\n{'Material': 'Rubber', 'Item Form': 'elastic', 'Brand': 'Qiray', 'Item Dimensions LxWxH': '3.15 x 3.15 x 2.36 inches', 'Number of Pieces': '10', 'Product Dimensions': '3.15 x 3.15 x 2.36 inches; 2.82 Ounces', 'UPC': '655160582486'}\nThe concept behind these hair ties  are great but they are itchy if you wear them on your wrist. As far as stretch goes though they do well for a couple of wears. I found them to be a lot looser after a week. Cute but not the best.\nA Little Itchy\nMaya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nMAYA MARI\n{'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nI'm slightly indifferent to this shampoo. We use argan oil shampoo often but this one is hit or miss. It makes my hair more greasy than shiny while it works great for my husbands. It does lather pretty well and the bottle is large, but it just didn't cut it for mine. I have thick hair and what we thought was the extra shine left a layer of grease on my brush the next day. Not typical for my hair and my wash schedule.\nShine or Grease?\nFacial Kit For Women - Includes Facial Mask, Facial Makeup Wipes, Nose Strips, Facial Cleansers, Facial- Self Care Package For Women (Multivitamin Facial Kit)\nGolden Gift Box\n{'Brand': 'Golden Gift Box', 'Item Form': 'Wipes', 'Skin Type': 'All', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.00 Count', 'Product Dimensions': '9 x 9 x 3 inches; 2.47 Pounds', 'UPC': '758176585684'}\n[[VIDEOID:f054bc1ef56dd4b625a57cf8672d7c56]] This has EVERYTHING I need to clean up in the evening or have a spa day at home. Plenty of face masks, plenty of eye masks and it even comes with a cute lip collagen mask. The face scrubber is soft and I love freezing the eye mask and wearing it in the tub. You can wear it warm or cold. The whole kit would be great for a birthday gift or wedding shower gift since it is neatly packaged.\nSpa Day!!!\n2 Pack Hair Towel Wrap Turban Microfiber Drying Shower and Bath, Twist Head Towels with Button, Magic Quick Dryer, Hair Care for Women and Girls, One Wrap Plus One Cap and Two Velvet Hair Bands\nMEETWIN\n{}\nI'm such a lazy beauty enthusiast. I soak in the tub using luxurious bath bombs, spend hours playing with hair products, yet still wrap my hair up every night even though I have two blow dryers and a hand full of hair dryer brushes. I still just prefer to leave my hair wrapped up until bed and deal with the messy curly consequences the next morning. This is by far the BEST hair wraps I've ever used. It is made if microfiber and is soft as blankets. The turban is great for just throwing your hair in there, while the hair towel wraps up nicely and has a good button and band on it to hold it in place. The two hair ties are nice, but not needed. Still useful though! The towels themselves absorb all of the water and hold it in place. So, once you take the towels off, they are soaked for hours, unlike your hair. These are by far the best hair towels I've ever left in my hair for hours at a time.\nLove the Turban\nPanama Jack Sunscreen Lip Balm - SPF 45, Tropical & Mango 6 Pack Plus, Broad Spectrum UVA-UVB Sunscreen Protection, Prevents & Soothes Dry, Chapped Lips\nPanama Jack\n{'Scent': 'Mango', 'Product Benefits': 'Soothing', 'Item Weight': '4.25 Grams', 'Number of Items': '6', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 4.72 x 1.34 inches; 0.15 Ounces'}\nMoisturizing and flavorful at the same time! I swear we go through chapstick like no tomorrow here. The tubes are the usual size and with a large pack, come in handy for keeping around the house and cars. These would also be great for stocking stuffers for the holidays! The flavors are strongly scented, but mild enough to not pick away if the taste were stronger. Overall, these are a great pick for an affordable yet well protected chapstick.\nNo more chapped lips!\nOukzon 40 Pcs Art and Crafts Supplies Kit for Kids, Dinosaur Toys Painting Set with Foldable Storage Carpet, Party Favors and Creativity DIY Painting Gift Easter for 4 5 6 7 8 Year Old Boys and Girls\nOukzon\n{'Brand': 'Oukzon', 'Age Range (Description)': 'Kid', 'Color': 'Clear', 'Theme': 'Easter,Dinosaur', 'Material': 'Plastic', 'Package Dimensions': '10.16 x 10.12 x 2.99 inches; 2.6 Pounds'}\nThis is one of the best gifts you could get for young ones who are in the dinosaur phase. Not only does it come with everything you need to play, you get to paint the dinosaurs too! This will keep the kids busy for a while, but they will love it.<br /><br />The dinosaurs are not too small and can be easily painted by 4 year olds. May not be the prettiest, but its about being creative. The mat is the perfect size and the paints are easy to clean up. They are washable so the hands can be cleaned up after. It comes with the paints and brushes, so no need to buy some. It also folds into a storage box, which is excellent for keeping the mess contained. You want to fold the velcro in, not out. But it works both ways. One way just wouldn't have handles.<br /><br />Both educational and creative, the kiddos will go crazy for this.\nMess Contained in a Nifty Storage Box\nMKBOO Hair Curler,3 in 1 Curling Iron Wand Set Automatic Hair Curling Iron Wand 3 Barrels,Hair Curlers Rollers Hair Styling Kit with Different Wands Quick Heat Interchangeable Ceramic\nMKBOO\n{'Product Benefits': 'Curling', 'Shape': 'Round', 'Brand': 'MKBOO', 'Hair Type': 'All', 'Material': 'metal', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '11.69 x 9.4 x 2.7 inches; 14.11 Ounces', 'Batteries': '1 Lithium Ion batteries required. (included)', 'UPC': '882593140406', 'Manufacturer': 'MKBOO'}\nI was a bit nervous to use this at first because something that automatically twists hair makes me think it will twist my hair and get knotted and then I will have to cut off my hair.<br /><br />I was pleasantly surprised.<br /><br />Its really easy to use after a bit of trial and error. Once you understand the twirling left and right (depending in which direction you want your curls), you'll be on your way to curls that look right out of a beauty pageant. I don't say that in a negative way. They are very beautifully curled. Little girls would love having these curls.<br /><br />You can curl them and then brush them out a bit to give them a more natural look. The two barrels are easily interchangeable so you can do large curls and small curls. I have very thick hair and found these to be fun to wear without needing that hair cut. I'll be keeping this one around for date nights.\nBeauty Pageant Curls\nMagnetic Eyelashes with Eyeliner, Invisible Magnetic Mink Magnetic Lashes Kits with 2 Liquid Eyeliner 6 Reusable Waterproof False Eyelashes, Eyelash Tweezers, Best Magnetic Eyeliner for Daily, Party\nSISILILY\n{'Color': 'Black', 'Brand': 'SISILILY', 'Material': 'Mink Fur', 'Item Dimensions LxWxH': '6.61 x 0.98 x 7.4 inches', 'Material Feature': 'Gluten Free', 'Product Dimensions': '6.61 x 0.98 x 7.4 inches; 5.61 Ounces', 'Item model number': 'Magnetic Eyelashes-01', 'UPC': '763043958041', 'Manufacturer': 'Viciley Cosmetic'}\nAt the price of $20 (at the time of review), these lashes get a 4/5 stars for the quality, quantity, and price.<br /><br />Pros<br />-Cute carrying case for travel.<br />-Good variety and style of lashes<br />-Strong grip<br />-Strong black color<br />-Short and small styles<br />-Stay on until makeup remover is used<br /><br />Cons<br />-If you like thick lashes, these are not for you.<br />-Smudges a bit<br />-\nGreat Quality for a Cheaper Price\nDisney Frozen - Townley Girl Mega Nail Set with Nail Dryer Foldable Gift Set for Parties, Sleepovers and Makeovers\nTownley Girl\n{'Package Dimensions': '11.18 x 11.06 x 2.8 inches; 1.87 Pounds', 'Item model number': 'FZ2169GA', 'UPC': '719565451850'}\nThis is a favorite for the little girls. They think that they are one of us adults because they get to paint their nails and stick them under the dryer just like us. This actually gets a 5/5 for me given that it comes with a lot of stuff, easy to open packaging, and is a good price.<br /><br />The nail polish wins for the adults because it is non-toxic and easy to remove. It comes with so many options for nail colors, stickers, and the dryer. You definitely want 2AA batteries handy for the dryer. It doesn't come with them. For the price though, this really will be a hit for your kids!\nNon-Toxic and Fun for Hours!\nNu-Pore Facial Sheet Mask Packaged Holiday Shippable Gift Set Aloe Vera Pomegranate Hibiscus Green Tea Lavender Cucumber 12 K-Beauty Sheets Perfect for Home Spa Treatment gifts Made in South Korea\nnu-pore\n{'Brand': 'nu-pore', 'Item Form': 'Sheet', 'Product Benefits': 'Soothing,Anti-aging', 'Scent': 'Pomegranate,Lavender', 'Skin Type': 'All', 'Package Dimensions': '9.69 x 6.89 x 1.93 inches; 15.52 Ounces'}\nAt a little over $1 a pack, this is an excellent price for what you get. Just shy of $15 for 12 excellent masks is a steal. Most face masks that dry out your skin fall around the same price, but these actually restore and calm without drying. The masks fit nicely, not too small and not too large. They are unscented which is glorious because I can't stand a mask that smells like perfume while trying to relax. The aloe is really calming and you feel well hydrated overnight. There are multiple styles with two of each and they each have different effects. They don't leave behind a greasy residue at all either. The packaging is also nice, so you can gift these to someone as is or open them and have a spa day at home. I would 100% buy these if you need a new face mask routine.\nA little over $1 a pack\ngo1go Bath Bombs Gift Set, 6 Pack Natural Rich in Essential Oils Spa Bath Fizzies for Moisturizing Dry Skin, Gift Ideas for Girlfriends, Women, Moms, Men and Kids, Birthday, Valentine, Mothers Day\ngo1go\n{'Brand': 'go1go', 'Scent': 'Lavender, Rose', 'Recommended Uses For Product': 'Moisturizing', 'Product Benefits': 'Soothing,Stress Relief,Moisturizing,Relaxing,Aromatherapy', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.95 x 5.71 x 2.6 inches; 1.45 Pounds', 'Manufacturer': 'go1go'}\nThese bombs are not terribly fancy for what you get. Very little scent, however they don't stain the tub. It's difficult to say these are worth anything more than 3 stars though because the scents just isn't there. What scent there is doesn't match what they are. You also don't know what kind they are because there is no scent listed on the label or box. Too plain to get excited about.\nNothing fancy...\nScrunchie Holder Stands with 8 Pack Large Size Scrunchies - Acrylic Hair Ties Organizer for Teenage Girls and VSCO Girls Gift Stuff\nBeeager\n{'Color': 'Yellow,Gray,White', 'Material': 'Acrylic', 'Item Form': 'Scrunchie', 'Brand': 'Beeager', 'Hair Type': 'Straight', 'Package Dimensions': '10.55 x 3.98 x 3.7 inches; 10.86 Ounces'}\nFor once, this comes with everything already assembled AND comes with scrunchies!  Depending on what kind of hair ties you are using, this could hold anywhere from 8 scrunchies to 50 hair ties. It literally comes fully assembled, ready to be used right out of the box. The scrunchies are cute and functional! All the rage these days with youth. The only thing I notice that is different about this one than others is that it doesn't have the open cylinder at the top. Most of the others have an open top for bobbie pins and clips. However, that is not a negative as it literally is perfectly sized and comes with everything needed. And even better, it's the perfect less than $10 item for birthdays or gifts at $9.99 at the time of review.\nComes fully assembled!\nPursoma Beyond The Body After the Class Post Workout Soak, 9 oz\nPursoma\n{'Brand': 'Pursoma', 'Product Benefits': 'Hydrating,Stress Relief,Anti-inflammatory,Pain Relief,Cleansing,Pore', 'Material Feature': 'Natural', 'Unit Count': '1.0 Ounce', 'Number of Items': '1', 'Product Dimensions': '7.5 x 5 x 7.5 inches; 9.24 Ounces', 'UPC': '857525007096'}\nHere's the thing; This is a small bag at an extravagant price. When I write a review, it is based on everything including the price. There is no way you will catch me buying this at $34 for a ONE TIME USE bag. If this was less than $10, it would be great. You use the entire bag and try to relax. It's like a detox in a way. But, it's not worth the price point. It comes with a stone inside \"yay!\". Still not worth $34. It's epsom salts with some essential oils and moisturizing oils. That's great and all, but have we forgot that it is still a one time use bag that costs more than buying the ingredients and making them yourself? Especially since I didn't notice a difference compared to other similar packaged salts. Smells lovely, but not worth the price.\nNope, Nope, and Nope!\nO.M.CHIC Mannequin Head with shoulders for wig, Display wigs Eyeglasses Necklaces and Earrings\nO.M.CHIC\n{'Package Dimensions': '18.3 x 15.7 x 9 inches; 5.1 Pounds', 'UPC': '714676502699 714676502675'}\nI probably use this for a different purpose than those who typically order, but I needed something to display my fiber arts on and this was the perfect size for what I need. The mannequin comes without a wig, but I had one on hand to make my art more realistic. It's very proportional to a normal head circumference. I like that it has the shoulders so I can use a scarf and hat to show off.<br /><br />For $65 at the time of review, I really can't complain. It's so realistic, that you can use it as a display or you can use it to train yourself I'm hair. It even has a spot for earrings too. Overall, I have zero complaints. It stands perfectly because of the size and shape. It has a good base. Whether it is for hair design or a display, this will work well!\nWorks For My Crocheting",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** The user maintains a strong interest in bath products, particularly bath bombs, and is expanding into hair accessories, particularly display options for creative purposes. They continue exploring sun protection that encompasses lip care and children's beauty playsets, showing notable enthusiasm for skincare, especially facial masks.\n\n- **Scent Preference:** They prefer natural, organic scents in lip products and lean towards unscented or subtly fragrant options in facial care for enhanced relaxation, though they appreciate stronger scents in bath products.\n\n- **Usage Intent:** The user seeks spa-like experiences aimed at soothing and effective cleansing, emphasizing hydration and playful beauty elements suitable for children. They also utilize items for creative displays, highlighting their artistic interests.\n\n- **Quality Expectations:** They value high-quality, organic ingredients and durability, emphasizing comfort, functionality, and affordability. Their choices reflect a preference for non-toxic formulations and engaging products for children.\n\n- **Experience with Products:** The user has enjoyed moisture-restoring and effective facial treatments but remains critical of products that do not meet their quality-to-price expectations, especially for one-time use items. They have also found versatility in products for creative applications.\n\n- **Gift Consideration:** They focus on thoughtful, quality gifts catering to both adult and children’s beauty and wellness interests while valuing creativity and affordability.\n\nRecent interactions reflect a discerning approach to products, with a strong emphasis on pricing, versatility, and effectiveness across diverse age groups, showcasing their creative tendencies alongside their ongoing beauty interests.",
  "metrics": {
    "rouge1_f": 0.10197144799456154,
    "rouge2_f": 0.010884353741496598,
    "rougeL_f": 0.04962610469068661,
    "meteor": 0.03078917517420191,
    "bleu1": 2.0457129175346537e-05,
    "bleu2": 6.780065897275526e-06,
    "bleu3": 2.399646946917182e-06,
    "bleu4": 6.75617368586945e-07,
    "bertscore_precision": 0.3813208043575287,
    "bertscore_recall": 0.5218108296394348,
    "bertscore_f1": 0.44063860177993774
  }
}