{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Maya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nReview Date: 2020/09/14\nStore: MAYA MARI\nAverage Rating: 4.3\nProduct Details: {'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nReview Text: I'm slightly indifferent to this shampoo. We use argan oil shampoo often but this one is hit or miss. It makes my hair more greasy than shiny while it works great for my husbands. It does lather pretty well and the bottle is large, but it just didn't cut it for mine. I have thick hair and what we thought was the extra shine left a layer of grease on my brush the next day. Not typical for my hair and my wash schedule.\nReview Title: Shine or Grease?\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Bath Bombs, SAZEN Bath Bomb with Natural & Organic Essential Oils, Shea Coconut Butter for Skin Moisturize, Bubble Spa Bath, Birthday Mothers Day Christmas Handmade Gift Set for Women Kids Her Him\nSAZEN\n{'Brand': 'SAZEN', 'Scent': 'Coconut', 'Material Feature': 'Organic Ingredients', 'Unit Count': '24.00 Count', 'Number of Items': '24', 'Package Dimensions': '12.17 x 6.26 x 2.24 inches; 2.65 Pounds', 'Item model number': 'SAZEN 01', 'UPC': '745103723622', 'Manufacturer': 'SAZEN'}\n[[VIDEOID:73b249dcdf678ad402a99764551a434d]] When you open the box, you see 18 magical pieces and think this is excellent. Unfortunately, they are super perfume scented, but the perfume goes away in just a moment of two in the bath. I used 2 in one bath and was disappointed that the scent didn't linger for much longer than it did. Especially since the description specifies that it would be great for sinuses! These are more for children who don't enjoy the spa setting as much and just want colorful tubs.\nNot Much Scent...\nQiray Hair Ties For Women Coil Hair Ties,Large Lace Phnom Penh,5 Colors 10 Pieces.\nQiray\n{'Material': 'Rubber', 'Item Form': 'elastic', 'Brand': 'Qiray', 'Item Dimensions LxWxH': '3.15 x 3.15 x 2.36 inches', 'Number of Pieces': '10', 'Product Dimensions': '3.15 x 3.15 x 2.36 inches; 2.82 Ounces', 'UPC': '655160582486'}\nThe concept behind these hair ties  are great but they are itchy if you wear them on your wrist. As far as stretch goes though they do well for a couple of wears. I found them to be a lot looser after a week. Cute but not the best.\nA Little Itchy\nMaya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nMAYA MARI\n{'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nI'm slightly indifferent to this shampoo. We use argan oil shampoo often but this one is hit or miss. It makes my hair more greasy than shiny while it works great for my husbands. It does lather pretty well and the bottle is large, but it just didn't cut it for mine. I have thick hair and what we thought was the extra shine left a layer of grease on my brush the next day. Not typical for my hair and my wash schedule.\nShine or Grease?",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** Enjoys bath products, particularly bath bombs, and has expanded interest to hair accessories. Recently explored shampoo options, particularly those with hydrating and nourishing properties.\n- **Scent Preference:** Prefers natural and organic scents for bath products, with a notable disappointment in scent longevity. Scent preferences for hair care products remain undefined, focusing more on performance.\n- **Usage Intent:** Seeks products that provide a soothing or spa-like experience. In hair products, emphasizes functionality and effect on hair condition, particularly seeking hydration without compromising on shine.\n- **Quality Expectations:** Values high-quality ingredients, notably organic materials. This extends to hair accessories and hair care products, prioritizing comfort, durability, and effectiveness in enhancing hair texture without leaving unwanted residue.\n- **Experience with Products:** Experiences mixed results across product categories. For bath products, critiques include scent longevity and relaxation effectiveness. Recent shampoo experience highlighted issues with greasiness despite claims of enhancing shine, particularly for thicker hair types.\n- **Gift Consideration:** Considers bath products and hair accessories as thoughtful gifts, especially those that align with quality expectations and personal care efficacy tailored to specific needs.\n\nOverall, the user remains discerning about personal care items, placing a strong emphasis on quality, performance, and comfort while navigating various product offerings for both adults and children.",
  "metrics": {
    "rouge1_f": 0.2368,
    "rouge2_f": 0.006420545746388444,
    "rougeL_f": 0.10879999999999998,
    "meteor": 0.11031073764538939,
    "bleu1": 0.11131161079978433,
    "bleu2": 0.0039425315522345124,
    "bleu3": 0.001296308663047122,
    "bleu4": 0.0007439910616824889,
    "bertscore_precision": 0.36446115374565125,
    "bertscore_recall": 0.4355788230895996,
    "bertscore_f1": 0.3968590497970581
  }
}