{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/12/28\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Studio': ['CBS']}\nReview Text: love the show\nReview Title: love it\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Amazing Race\nUnscripted, Drama, Sports, Adventure\n['Eleven teams will embark on the adventure of a lifetime on the new season of The Amazing Race. Phil Keoghan is the host. This season, the multi-Emmy Award-winning series sends 11 new Teams on a Race around the globe, making first time visits to exotic locations such as Indonesia, Malawi, Belgium and Denmark.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bertram van Munster', 'Phil Keoghan'], 'Producers': ['Bertram van Munster', 'Phil Keoghan', 'Jerry Bruckheimer', 'Elise Doganieri', 'Jonathan Littman', 'Patrick Cariaga', 'Matthew R. Schmidt', 'Mark A. Vertullo', 'Michael Norton', 'Mark Islam']}\nlove this show\nFive Stars\nGotham Season 4 [Blu-ray]\nBenjamin McKenzie  (Actor),     Donal Logue  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['After completing his training with the Temple Shaman (guest star Raymond J. Barry) and Ra’s al Ghul (new series regular Alexander Siddig), Bruce Wayne steps into the role of the protector of Gotham City with the help of his ever-faithful butler Alfred Pennyworth (Pertwee) and quiet support of Lucius Fox (Chalk), while building up his public persona of carefree socialite to avoid any suspicion among Gotham’s citizens. As the city sinks deeper into chaos, GOTHAM continues to follow the evolving stories of the city’s most malevolent villains: The Penguin (Taylor), Edward Nygma/The Riddler (Smith), Selina Kyle/the future Catwoman (Bicondova), Barbara Kean (Richards), Tabitha Galavan (Lucas) and Butch Gilzean (Powell).']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '6.85 x 5.39 x 0.63 inches; 5.93 Ounces', 'Media Format': 'Blu-ray', 'Actors': 'Benjamin McKenzie, Donal Logue, Robin Lord Taylor, David Mazouz, Sean Pertwee'}\nThumbs up\nThumbs up\nChicago Fire: Season Six [DVD]\nJesse Spencer  (Actor),     Taylor Kinney  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['With the fate of several of the squad hanging in the balance, season six of Chicago Fire reignites in a blaze of uncertainty. As the brave firefighters, rescue squad and paramedics deal with the aftermath of each fire they face – more hot romances, pulse-pounding action and fiery drama unfold every step of the way. From Primetime Emmy Award-winning executive producer Dick Wolf (Law & Order) comes all 23 explosive episodes presented back-to-back for uninterrupted viewing.Bonus Content:', 'Disc 4 - Chicago Fire Season Six:', 'Cross Over Episode: Chicago PD 5x16 \"Profiles\"', 'Cross Over Episode: Chicago PD 5x16 \"Profiles\"']\n{'Genre': 'Drama', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Eamonn Walker, Monica Raymund, Kara Killmer, David Eigenberg, Jesse Spencer, Taylor Kinney, Lauren GermanEamonn Walker, Monica Raymund, Kara Killmer, David Eigenberg, Jesse Spencer, Taylor Kinney, Lauren German  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.4 Ounces', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '15 hours and 39 minutes', 'Release date': 'August 28, 2018', 'Actors': 'Jesse Spencer, Taylor Kinney, Lauren German, Eamonn Walker, Monica Raymund', 'Subtitles': 'French', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '6'}\nGreat\nLove this show\nChicago Med: Season Three [DVD]\nColin Donnell  (Actor),     Nick Gehlfuss  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n[\"As the courageous team of doctors, nurses and staff of Chicago Med deal with the pulse-pounding pandemonium of the emergency room, heart-wrenching drama impacts them both professionally and personally. With lives on the line every day, the ED team finds themselves on an emotional thrill ride through the day-to-day chaos of the hospital that gets Chicago's most difficult and challenging cases. From Primetime Emmy Award-winning executive producer Dick Wolf (Law & Order) come all 20 groundbreaking Season Three episodes to watch back-to-back and uninterrupted.\"]\n{'Genre': 'Drama', 'Format': 'Subtitled, DVD, NTSC', 'Contributor': 'Yaya DaCosta, Nick Gehlfuss, Rachel Katherine DiPillo, Colin Donnell, Torrey DeVitto, Oliver Platt, S. Epatha Merkerson, Brian TeeYaya DaCosta, Nick Gehlfuss, Rachel Katherine DiPillo, Colin Donnell, Torrey DeVitto, Oliver Platt, S. Epatha Merkerson, Brian Tee   See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Media Format': 'Subtitled, DVD, NTSC', 'Run time': '14 hours and 8 minutes', 'Release date': 'August 28, 2018', 'Actors': 'Colin Donnell, Nick Gehlfuss, Oliver Platt, S. Epatha Merkerson, Torrey DeVitto', 'Subtitles': 'French', 'Studio': 'Universal Studios Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '5'}\ngreat\nlove this show\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Studio': ['CBS']}\nlove the show\nlove it",
  "profile": "**Updated User Profile Summary:**\n\n- **Viewing Preferences:** Enjoys unscripted content, particularly reality and adventure genres, alongside scripted dramas characterized by strong storytelling and emotional depth. Recent engagement with a dramatic medical series demonstrates a continued appreciation for high-stakes narratives and compelling character arcs.\n- **Interest in Competition:** Shows a strong preference for competitive formats, such as races or challenges, reflecting a thrill-seeking aspect of their viewing choices.\n- **Travel Enthusiasm:** Values shows that feature diverse and exotic global locations, enhancing their viewing experiences and broadening their horizons.\n- **Positive Engagement:** Maintains a high level of enthusiasm and satisfaction, consistently giving five-star ratings. Recent interactions indicate ongoing dedication to engaging narratives, particularly in intense drama categories.\n- **Familiarity with Series:** Likely a dedicated viewer of long-running shows that emphasize consistent themes and character development, showcasing an investment in a mix of contemporary hits and established favorites.\n- **Genre Exploration:** Exhibits interest in a variety of genres, including drama and adventure, showcasing a broad taste that encompasses both reality-based shows and scripted narratives with emotional complexity.\n\nThe user's latest interaction reinforces their engagement with content featuring emotional depth and intensity, while maintaining their appreciation for adventurous and competitive storytelling themes. Their consistent positive feedback further highlights their ongoing satisfaction with diverse viewing experiences. \n\n**Keywords:** Unscripted, drama, adventure, competition, global travel, satisfaction, dedicated viewer, scripted narratives, intense storytelling.",
  "metrics": {
    "rouge1_f": 0.138671875,
    "rouge2_f": 0.007827788649706457,
    "rougeL_f": 0.06640625,
    "meteor": 0.050262633580873024,
    "bleu1": 0.013496800382786292,
    "bleu2": 0.002967950283506346,
    "bleu3": 0.000524408978642631,
    "bleu4": 0.00022062097263110428,
    "bertscore_precision": 0.36250168085098267,
    "bertscore_recall": 0.45667964220046997,
    "bertscore_f1": 0.4041770100593567
  }
}