{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/01/02\nAverage Rating: 4.0\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['David Nunn'], 'Producers': ['Ray Fardon'], 'Starring': ['David Nunn'], 'Studio': ['Vision Video']}\nReview Text: A good companion to the actual biblical story with some impressive footage.\nReview Title: A visual for the hardships of the trials of Moses\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Irving Rapper', 'Lionello De Felice'], 'Producers': ['Ferdinand Felicioni'], 'Starring': ['Cornel Wilde', 'Belinda Lee'], 'Studio': ['Zeta Four Films', 'LLC']}\nCornell Wilde a believable Constantine, but the film's dubbing detracts from its overall impact.  After a while, it's just too much to watch.\nDubbing dulls this film\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['José Delgado'], 'Producers': ['Pacific Media'], 'Studio': ['CLA GmbH']}\nThis series is excellent and provides information not available on other WWII figures in a clear and unbiased way.  Recommended for anyone interested in the major players and the details of their lives, involvement in the war and their contributions to history.\nGREAT AND INFORMATIVE SERIES\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Phillip Noyce'], 'Producers': ['Hilary Bevan Jones', 'Genevieve Hofmeyr', 'Tim Bevan', 'Eric Fellner', 'Juliette Howell', 'Liza Chasin'], 'Starring': ['Hilary Swank', 'Brenda Blethyn', 'Sam Claflin'], 'Studio': ['HBO']}\nStirring film with great performances.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['David Nunn'], 'Producers': ['Ray Fardon'], 'Starring': ['David Nunn'], 'Studio': ['Vision Video']}\nA good companion to the actual biblical story with some impressive footage.\nA visual for the hardships of the trials of Moses",
  "profile": "**User Profile Summary:**\n\n- **Viewing Preferences:** The user maintains a strong preference for English audio and subtitles, consistently favoring content in their primary language.\n\n- **Critical Evaluation:** The user exhibits a discerning taste in film and series quality, particularly regarding dubbing. They favor authentic performances, prefer original versions over dubbed content, and their overall ratings reflect a growing appreciation, now averaging 3.8, influenced by positive engagements. \n\n- **Content Engagement:** The user demonstrates a balanced and thoughtful approach in their evaluations, as seen in their latest rating of 4.0. They have shown a keen enjoyment for narratives that blend informative content with impressive visual storytelling.\n\n- **Actor and Director Appreciation:** There is a tradition of exploring works by established talent, showcasing a preference for projects featuring reputable actors and experienced directors.\n\n- **Content Interest:** Recently, the user has displayed a keen interest in historical narratives, particularly those centered around significant figures like Moses, highlighting an appreciation for storytelling that includes profound themes and experiences. Their preference leans toward content that presents in-depth insights into historical contexts while maintaining authenticity.\n\nIn summary, the user favors English-language films and series, values authentic performances, and continues to evolve in their critical stance toward content quality. They have a strong interest in historically significant narratives, particularly those with reputable talent, and appreciate well-crafted stories enhanced by impressive visuals.",
  "metrics": {
    "rouge1_f": 0.25,
    "rouge2_f": 0.009478672985781991,
    "rougeL_f": 0.12264150943396226,
    "meteor": 0.10292953285827394,
    "bleu1": 0.146872945830906,
    "bleu2": 0.018838945588599873,
    "bleu3": 0.004415194731050783,
    "bleu4": 0.0021393861012594015,
    "bertscore_precision": 0.38534271717071533,
    "bertscore_recall": 0.43776682019233704,
    "bertscore_f1": 0.40988531708717346
  }
}