{
  "user_id": "AG3HKK7MIKRQ7DOTNDOE63X2WJGQ",
  "summary": "=== Purchase Information ===\nProduct Title: Body Scrubs for Women Premium Organic Nimiah Exfoliating Body Scrub with Activated Bamboo Charcoal Natural Salt Exfoliator Scrubs for Body Foot Hand Skin Care\nReview Date: 2019/12/20\nStore: Nimiah\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Nimiah', 'Skin Type': 'Acne Prone', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Use for': 'Hands, Whole Body', 'Package Dimensions': '2.7 x 2.7 x 2.1 inches; 5.61 Ounces', 'UPC': '192242919810'}\nReview Text: Pros:<br /><br />*The scrub is really good at exfoliating skin;<br />*After a week of daily use of this scrub, my skin is noticeably softer and brighter;<br />*It is kind of fun to use because it feels/looks like you are rubbing dirt all over your body;<br />*The jar is small but a little goes a long way.<br /><br />Cons:<br />*The charcoal scrub is a bit messy if you are not careful.  I have to quickly rinse my shower after each use because the stuff has flicked everywhere.\nReview Title: Great scrub\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Way Of Will Sweet Orange Body Wash, Moisturizing Body Wash with Sweet Orange Essential Oil, Body Wash for Women and Men, Paraben and Sulfate Free, 120 mL\nReview Date: 2020/01/01\nStore: Way Of Will\nAverage Rating: 3.7\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Oily,All Skin Types', 'Brand': 'Way Of Will', 'Scent': 'Sweet Orange', 'Material Type Free': 'Paraben,Sulfate Free', 'Product Dimensions': '6 x 1.5 x 1.5 inches; 4 Ounces', 'UPC': '840652000191'}\nReview Text: (Reviewed by my wife): I did not expect to like this sweet orange essential oil body wash (It's orange!).  It smells heavenly.  The scent is a mood lifter as described.  The body wash leaves my skin soft and smooth.<br /><br />The bottle is surprisingly small, but a little goes a long way.\nReview Title: Orange scent is heavenly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Splendora Sugar Lip Scrub - Peach - (20g / 0.7oz.)\nReview Date: 2020/01/20\nStore: Splendora\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Splendora', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Dimensions': '1.73 x 1.73 x 1.34 inches; 0.7 Ounces', 'UPC': '736640550444'}\nReview Text: (Reviewed by my wife): This lip scrub smells great and tastes great.  You are supposed to rinse off the scrub after rubbing it in, but it tasted so good that I found myself licking the peachy sugar off.  The directions are very simple, just put a bit of scrub on your lips and rub them in for about 30 seconds, then rinse off.  My lips are visibly smoother after using this product.  The jar is small, but a little goes a long way so I'll be making this last.\nReview Title: Smells great, tastes great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lip MOISTURIZER by MERLOTSPF15 - Intense Therapy Lip Moisturizer - Grape Seed Infused - for Healing Dry, Chapped Lips. Made with Beeswax, Coconut Oil, Vitamin E - Color FreeSPF 15\nReview Date: 2020/02/12\nStore: Merlot\nAverage Rating: 3.4\nProduct Details: {'Package Dimensions': '2.71 x 1.57 x 0.59 inches; 0.32 Ounces'}\nReview Text: This is a very nice lip moisturizer.  It goes on clear and softens and moisturizes your lips.  There is no scent or flavoring.  The moisturizer provides sun protection.\nReview Title: Leaves lips soft and protected from the sun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Taya Beauty Inner Core Hair Strong Anti-Breakage Shampoo & Conditioner Duo - Strengthening and Repairing Formula - Free From Sulfates and Parabens - 8 fl oz Bottles\nReview Date: 2020/02/23\nStore: TAYA I AM.\nProduct Description: ['INNER CORE SHAMPOO: Ingredients: Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Sodium Methyl Cocoyl Taurate, Acrylates Copolymer, Glycerin, Glycol Distearate, Bambusa Vulgaris Extract, Helianthus Annuus (Sunflower) Seed Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Panthenol, Dimethicone, PEG-120 Methyl Glucose Dioleate, Cetrimonium Chloride, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Cetyl Alcohol, Bis-Cetearyl Amodimethicone, Polyquaternium-11, Laureth-4, Laureth-23, Decylene Glycol, Caprylyl Glycol, Disodium EDTA, Amodimethicone, Cocamide MIPA, Trideceth-12, Kaolin, Polysorbate 20, Fragrance/Parfum, Phenoxyethanol, Sodium Hydroxide, Sodium Sulfate, Sodium Chloride, Coconut Acid, Sodium Methyltaurate, Isopropanolamine, Tocopherol, Salicylic Acid, Cyclotetrasiloxane, Cyclopentasiloxane, Ethylhexylglycerin, Citric Acid, Amyl Cinnamal, Benzyl Salicylate, Linalool. INNER CORE CONDITIONER: Ingredients: Water/Aqua/Eau, Cetearyl Alcohol, Glycerin, Behentrimonium Methosulfate, Stearamidopropyl Dimethylamine, Polysorbate 60, Bambusa Vulgaris Extract, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Cetrimonium Chloride, Dimethicone, Divinyldimethicone/Dimethicone Copolymer, Polyquaternium-37, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Propylene Glycol Dicaprylate/Dicaprate, Dicetyldimonium Chloride, Amodimethicone, Polyquaternium-7, PPG-1 Trideceth-6, Cetyl Alcohol, Trideceth-12, C11-15 Pareth-7, C12-13 Pareth-23, C12-13 Pareth-3, Decylene Glycol, Caprylyl Glycol, PEG-90M, Tetrasodium EDTA, Buteth-3, C10-40 Isoalkylamidopropylethyldimonium Ethosulfate, Sodium Benzotriazolyl Butylphenol Sulfonate, Laureth-9, Tributyl Citrate, Citric Acid, Fragrance/Parfum, Kaolin, Yellow 6/CI 15985, Phenoxyethanol, Sorbitan Oleate, Acrylates/Stearyl Methacrylate Copolymer, C10-11 Isoparaffin, Isopropyl Alcohol, Trisodium HEDTA, Silica, BHT, Amyl Cinnamal, Benzyl Salicylate, Linalool.']\nAverage Rating: 4.0\nProduct Details: {'Product Benefits': 'Moisturizing,Repairing,Cleanses,Breakage', 'Item Form': 'Liquid', 'Brand': 'TAYA I AM.', 'Hair Type': 'Wavy, Color Treated, Curly, Damaged, Thin', 'Scent': 'Coconut', 'Package Dimensions': '7.99 x 4.53 x 2.09 inches; 1 Pounds', 'Item model number': '3.00', 'UPC': '858308002185'}\nReview Text: I was able to get the conditioner bottle open, but not the shampoo.  The bottles have an interesting opening mechanism.  You turn the top and squeeze the product out through a mesh hole on the top.  Unfortunately, the top on our shampoo bottle is defective and none of us can get it open.  The conditioner is very nice though.  It is thick and smooth and detangles well.  It also smells nice.\nReview Title: Shampoo bottle won't open\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pharmacopia Tangerine-Flavored Lip Balm - Set of 2, 0.25oz - Nourishing Herbal Lip Elixir with 100% Natural and Certified Organic Ingredients\nReview Date: 2020/02/23\nStore: Pharmacopia\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Pharmacopia', 'Item Form': 'Balm', 'Finish Type': 'Natural', 'Skin Type': 'Dry', 'Product Benefits': 'Hydrating,Soothing,Nourishing', 'Package Dimensions': '3.6 x 1.7 x 0.7 inches; 0.25 Ounces', 'UPC': '087819800366'}\nReview Text: This product is way better than traditional Chapstick. It is very moisturizing and non-waxy.  It leaves my lips soft and smooth.  The dry lip relief lasts longer than Chapstick.  The tangerine scent is heavenly.\nReview Title: Way better than Chapstick\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: C.O. Bigelow Shampoo, Lavender Peppermint Shampoo Cleanses & Soothes Hair & Scalp, Luxury Shampoo for Men & Women, 10.4 Fl Oz.\nReview Date: 2020/02/24\nStore: C. O. Bigelow\nAverage Rating: 4.4\nProduct Details: {'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion,Liquid,Gel', 'Scent': 'Fresh,Lavender,Peppermint', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Package Dimensions': '5.91 x 2.32 x 2.24 inches; 10.4 Ounces', 'UPC': '815691009023'}\nReview Text: What I like about this product:<br />*It smells fantastic with the perfect blend of peppermint and lavender.  The scent is not overpowering like some peppermint shampoos I've tried;<br />*It lathers really well.<br />*It leaves my hair feeling and looking shiny and clean.<br /><br />What I don't like about the product:<br />*The bottle is relatively small for the price ($18.00 for 10.14 ounces at the time of this review);<br />*The cap broke off after the first use.\nReview Title: Smells great and lathers well\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nReview Date: 2020/02/26\nStore: L&I Apothecary\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\nReview Text: (Reviewed by my wife): This is a very interesting cleanser - I've never tried anything like it.  It does not foam/lather at all.  Instead, it is so thick it has the consistency of lotion.  It is gentle but cleans effectively.  It leaves my skin feeling clean and soft.\nReview Title: Thick and gentle\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Workman's Friend Ultimate Hand Care Bundle\nReview Date: 2020/04/14\nStore: WORKMAN'S FRIEND\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '9 x 4.5 x 2.3 inches; 1.3 Pounds', 'UPC': '023857030709'}\nReview Text: This is a great, complete hand hair set for anyone with dry, cracked hands.  It would make a good gift.<br /><br />*The charcoal scrub is very gritty so it's good for getting dirt out of the cracks on your hands.<br />*The barrier cream is helpful for prevention of dry hands (stop it before it even starts).<br />*Both the barrier cream and the hand cream have the nice side effect of reducing the appearance of wrinkles/aging on your hands.<br />*The products are gentle and excellent quality.<br />*A little goes a long way.\nReview Title: Awesome products\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Iryasa Under Eye Oil - Dark Circles Under Eye Treatment - Natural Anti Aging Serum for Under Eye Bags Treatment, Puffy Eyes Treatment, Eye Lifting and Firming - Eye Serum for Men & Women - 0.27 fl oz\nReview Date: 2020/05/05\nStore: IRYASA\nAverage Rating: 3.6\nProduct Details: {'Skin Type': 'All', 'Product Benefits': 'Hydrating,Eye Treatment,Anti-aging', 'Use for': 'Eyes', 'Scent': 'Aloe', 'Brand': 'IRYASA', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.79 x 0.79 x 3.43 inches; 3.21 Ounces'}\nReview Text: (Reviewed by my wife): I love the roller applicator of this under eye treatment.  It makes applying the product very easy and helps avoid wasting product.  The eye treatment smells great and goes on smooth.  It moisturizes well and leaves a little shine, reducing the appearance of dark circles and lines.  It is not a miracle product, however, and it does not get rid of really dark circles like the ones I have around my eyes.\nReview Title: Love the roller applicator\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: QIC 4D Silk Fiber Lash Mascara, Fiber Mascara, Waterproof Mascara, Natural Thick Thickening and Lengthening Mascara Lasting All Day\nReview Date: 2020/05/06\nStore: Joruby\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Joruby', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '5.3 x 0.8 x 0.8 inches; 0.81 Ounces'}\nReview Text: (Reviewed by my wife): I was very disappointed in this mascara.  It is so messy and goopy.  Both steps went on goopy and the mascara kept going all over my face.  I do not recommend.\nReview Title: Too messy\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Foot Peel Mask For Cracked Heels, Dead Skin & Calluses - Make Your Feet Baby Soft & Get a Smooth Skin, Removes & Repairs Rough Heels\nReview Date: 2020/07/26\nStore: Monikahair\nAverage Rating: 2.9\nProduct Details: {'UPC': '739515020639'}\nReview Text: (Reviewed by my wife):<br />*Directions are easy-to-follow - just separate the two booties, open up, and place one on each foot.  Tape shut.  Leave on for 60-90 minutes then wash off.<br />*The box says that it should take 1-2 days for peeling to start but my personal experience was that it took 3-4 days for the peeling to start.<br />*At $11.99 for two pairs (you can use the product up to once a month) it's a good deal.<br />*The adhesive did not stick well for me so I put my own socks over the booties and they stayed on fine.<br />*Once the peeling is done my feet are significantly softer and smoother.\nReview Title: Works well\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lenghthening Mascara by Almay,Volume & Lift, Eye Makeup, Hypoallergenic and Fragrance Free, 010 Blackest Black, 0.24 Fl Oz\nReview Date: 2021/03/20\nStore: Almay\nProduct Description: ['Enjoy visibly longer, lifted lashes in one gentle swipe with Almay Length & Lift Mascara™. Our clean, flake-free formula is enriched with a lash-caring complex of plant-based waxes and hair conditioners that nourish for healthy looking eyelashes. Plus, the brush is made of 100% plant-derived bristles that are designed to evenly coat and separate lashes from root to tip. We also ensured that our newest mascara is smooth and buildable—no clumps or smudging—making it the perfect finishing touch to any look, be it everyday glam, a smoky eye, or cat eye. What’s more, we tested our product to ensure it is suitable for sensitive eyes and contact lens wearers, so go ahead and magnify lashes to your chosen intensity! And because we love the environment as much as we love your delicate eyes, part of the mascara packaging is made with post-consumer recycled materials. Formulated without added parabens, phthalates, SLS, mineral oil, DMDM Hydantoin, formaldehydes, and Triclosan. As always, hypoallergenic. Ophthalmologist tested. Clean. Cruelty free. Fragrance free.']\nAverage Rating: 4.2\nProduct Details: {'Color': '010 Blackest Black', 'Product Benefits': 'Conditioning', 'Special Feature': 'Not-Applicable', 'Material Type Free': 'Fragrance Free', 'Brand': 'Almay', 'Product Dimensions': '2.75 x 0.73 x 5.75 inches; 1.01 Ounces', 'Item model number': '7257548001', 'UPC': '309970143022', 'Manufacturer': 'AmazonUs/REVL7'}\nReview Text: (Reviewed by my wife): Wow, after using a tube of cheap mascara, I can really tell the difference.  This mascara is really great quality.  It goes on smoothly with no clumping.  It does not smudge or smear.  It separates the lashes beautifully.  It lives up to its name, \"length and lifted.\"  This mascara is worth paying a few dollars more for.\nReview Title: Great quality mascara\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: KISSIO Black Mascara,Double-ended Mascara,Mascara 2 in 1,Black Thick Mascara,Stereotype & Thick,Clear Roots,Effective for 12 hours,2 Step,1 Tube\nReview Date: 2021/04/11\nStore: KISSIO\nAverage Rating: 3.4\nProduct Details: {'Color': 'black', 'Brand': 'KISSIO', 'Unit Count': '1.00 Count', 'Package Information': 'Tube', 'Package Type': 'Tube', 'Is Discontinued By Manufacturer': 'No'}\nReview Text: This is a good mascara that does not smear/smudge.  I'm not sure how much the primer really helps because I also like the mascara on its own.  The mascara is long lasting and doesn't flake off.  I am a fan of pink so of course I like the pink wand.\nReview Title: Doesn't smear/smudge\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Movo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#2 Natural)\nReview Date: 2021/05/17\nStore: Movo\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 3.07 Ounces'}\nReview Text: (Reviewed by my wife): I love this makeup.  It has light-medium coverage.  It stays put, doesn't melt.  It goes on smoothly and doesn't settle in the cracks.  The sponge works great.\nReview Title: Love this makeup\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Glow Line Individual Hand Wipes - Hand Wipes Travel Size, Lavender Rose Travel Hand Wipes - Moist Towelettes Individually Wrapped, Wet Wipes Individually Wrapped w/Murumuru Seed & Peptides - 15 ct\nReview Date: 2021/05/23\nStore: BUSYCO\nAverage Rating: 3.3\nProduct Details: {'Brand': 'BUSYCO', 'Skin Type': 'All', 'Unit Count': '15.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '4.5 x 7.3 x 3.5 inches; 3.21 Ounces'}\nReview Text: These moisturizing hand wipes are convenient and good for keeping in the car, purse, or taking with you traveling.  The wipes pack a lot of moisturizing punch.  The scent is pleasant and very mild.\nReview Title: Convenient\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Asenlin Hair Ties Bands 4MM Durable Neutral Ouchless Accessories for Women Men Girls No Metal Elastics Thick Tie with Strong Ponytail Holder and for Medium Hair(24 Count of 3 Pack)-Black\nReview Date: 2021/07/24\nStore: Asenlin\nAverage Rating: 4.4\nProduct Details: {'Material': 'Metal, Cotton, Rubber', 'Item Form': 'elastic', 'Brand': 'Asenlin', 'Item Dimensions LxWxH': '0.2 x 0.09 x 0.02 inches', 'Hair Type': 'Curly', 'Product Dimensions': '0.2 x 0.09 x 0.02 inches; 4.23 Ounces', 'UPC': '779663992884'}\nReview Text: These are good hair ties.  They are strong and sturdy, great for a pony tail.  They are a good value for the price.  They are comparable to the leading brand.\nReview Title: Good hair ties\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara, 2pcs Waterproof Mascara & Fiber Set, Longer Thicker Voluminous Eyelashes, No Clumping, No Smudging Lasting All Day\nReview Date: 2021/10/17\nStore: Arlega+\nAverage Rating: 4.3\nProduct Details: {'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'Arlega+', 'Specialty': 'Waterproof', 'Number of Items': '1', 'Package Dimensions': '6.69 x 2.8 x 1.06 inches; 4.16 Ounces', 'UPC': '193995030692 193995032320'}\nReview Text: This is a good set of mascara.  I like having the variety of two different brush types.  The mascara is definitely waterproof - it's actually difficult to remove.\nReview Title: Good mascara\nRating: 4.0\n--------------------------------------------------",
  "reference": "Body Scrubs for Women Premium Organic Nimiah Exfoliating Body Scrub with Activated Bamboo Charcoal Natural Salt Exfoliator Scrubs for Body Foot Hand Skin Care\nNimiah\n{'Brand': 'Nimiah', 'Skin Type': 'Acne Prone', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Use for': 'Hands, Whole Body', 'Package Dimensions': '2.7 x 2.7 x 2.1 inches; 5.61 Ounces', 'UPC': '192242919810'}\nPros:<br /><br />*The scrub is really good at exfoliating skin;<br />*After a week of daily use of this scrub, my skin is noticeably softer and brighter;<br />*It is kind of fun to use because it feels/looks like you are rubbing dirt all over your body;<br />*The jar is small but a little goes a long way.<br /><br />Cons:<br />*The charcoal scrub is a bit messy if you are not careful.  I have to quickly rinse my shower after each use because the stuff has flicked everywhere.\nGreat scrub\nWay Of Will Sweet Orange Body Wash, Moisturizing Body Wash with Sweet Orange Essential Oil, Body Wash for Women and Men, Paraben and Sulfate Free, 120 mL\nWay Of Will\n{'Item Form': 'Oil', 'Skin Type': 'Oily,All Skin Types', 'Brand': 'Way Of Will', 'Scent': 'Sweet Orange', 'Material Type Free': 'Paraben,Sulfate Free', 'Product Dimensions': '6 x 1.5 x 1.5 inches; 4 Ounces', 'UPC': '840652000191'}\n(Reviewed by my wife): I did not expect to like this sweet orange essential oil body wash (It's orange!).  It smells heavenly.  The scent is a mood lifter as described.  The body wash leaves my skin soft and smooth.<br /><br />The bottle is surprisingly small, but a little goes a long way.\nOrange scent is heavenly\nSplendora Sugar Lip Scrub - Peach - (20g / 0.7oz.)\nSplendora\n{'Brand': 'Splendora', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Dimensions': '1.73 x 1.73 x 1.34 inches; 0.7 Ounces', 'UPC': '736640550444'}\n(Reviewed by my wife): This lip scrub smells great and tastes great.  You are supposed to rinse off the scrub after rubbing it in, but it tasted so good that I found myself licking the peachy sugar off.  The directions are very simple, just put a bit of scrub on your lips and rub them in for about 30 seconds, then rinse off.  My lips are visibly smoother after using this product.  The jar is small, but a little goes a long way so I'll be making this last.\nSmells great, tastes great\nLip MOISTURIZER by MERLOTSPF15 - Intense Therapy Lip Moisturizer - Grape Seed Infused - for Healing Dry, Chapped Lips. Made with Beeswax, Coconut Oil, Vitamin E - Color FreeSPF 15\nMerlot\n{'Package Dimensions': '2.71 x 1.57 x 0.59 inches; 0.32 Ounces'}\nThis is a very nice lip moisturizer.  It goes on clear and softens and moisturizes your lips.  There is no scent or flavoring.  The moisturizer provides sun protection.\nLeaves lips soft and protected from the sun\nTaya Beauty Inner Core Hair Strong Anti-Breakage Shampoo & Conditioner Duo - Strengthening and Repairing Formula - Free From Sulfates and Parabens - 8 fl oz Bottles\nTAYA I AM.\n['INNER CORE SHAMPOO: Ingredients: Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Sodium Methyl Cocoyl Taurate, Acrylates Copolymer, Glycerin, Glycol Distearate, Bambusa Vulgaris Extract, Helianthus Annuus (Sunflower) Seed Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Panthenol, Dimethicone, PEG-120 Methyl Glucose Dioleate, Cetrimonium Chloride, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Cetyl Alcohol, Bis-Cetearyl Amodimethicone, Polyquaternium-11, Laureth-4, Laureth-23, Decylene Glycol, Caprylyl Glycol, Disodium EDTA, Amodimethicone, Cocamide MIPA, Trideceth-12, Kaolin, Polysorbate 20, Fragrance/Parfum, Phenoxyethanol, Sodium Hydroxide, Sodium Sulfate, Sodium Chloride, Coconut Acid, Sodium Methyltaurate, Isopropanolamine, Tocopherol, Salicylic Acid, Cyclotetrasiloxane, Cyclopentasiloxane, Ethylhexylglycerin, Citric Acid, Amyl Cinnamal, Benzyl Salicylate, Linalool. INNER CORE CONDITIONER: Ingredients: Water/Aqua/Eau, Cetearyl Alcohol, Glycerin, Behentrimonium Methosulfate, Stearamidopropyl Dimethylamine, Polysorbate 60, Bambusa Vulgaris Extract, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Cetrimonium Chloride, Dimethicone, Divinyldimethicone/Dimethicone Copolymer, Polyquaternium-37, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Propylene Glycol Dicaprylate/Dicaprate, Dicetyldimonium Chloride, Amodimethicone, Polyquaternium-7, PPG-1 Trideceth-6, Cetyl Alcohol, Trideceth-12, C11-15 Pareth-7, C12-13 Pareth-23, C12-13 Pareth-3, Decylene Glycol, Caprylyl Glycol, PEG-90M, Tetrasodium EDTA, Buteth-3, C10-40 Isoalkylamidopropylethyldimonium Ethosulfate, Sodium Benzotriazolyl Butylphenol Sulfonate, Laureth-9, Tributyl Citrate, Citric Acid, Fragrance/Parfum, Kaolin, Yellow 6/CI 15985, Phenoxyethanol, Sorbitan Oleate, Acrylates/Stearyl Methacrylate Copolymer, C10-11 Isoparaffin, Isopropyl Alcohol, Trisodium HEDTA, Silica, BHT, Amyl Cinnamal, Benzyl Salicylate, Linalool.']\n{'Product Benefits': 'Moisturizing,Repairing,Cleanses,Breakage', 'Item Form': 'Liquid', 'Brand': 'TAYA I AM.', 'Hair Type': 'Wavy, Color Treated, Curly, Damaged, Thin', 'Scent': 'Coconut', 'Package Dimensions': '7.99 x 4.53 x 2.09 inches; 1 Pounds', 'Item model number': '3.00', 'UPC': '858308002185'}\nI was able to get the conditioner bottle open, but not the shampoo.  The bottles have an interesting opening mechanism.  You turn the top and squeeze the product out through a mesh hole on the top.  Unfortunately, the top on our shampoo bottle is defective and none of us can get it open.  The conditioner is very nice though.  It is thick and smooth and detangles well.  It also smells nice.\nShampoo bottle won't open\nPharmacopia Tangerine-Flavored Lip Balm - Set of 2, 0.25oz - Nourishing Herbal Lip Elixir with 100% Natural and Certified Organic Ingredients\nPharmacopia\n{'Brand': 'Pharmacopia', 'Item Form': 'Balm', 'Finish Type': 'Natural', 'Skin Type': 'Dry', 'Product Benefits': 'Hydrating,Soothing,Nourishing', 'Package Dimensions': '3.6 x 1.7 x 0.7 inches; 0.25 Ounces', 'UPC': '087819800366'}\nThis product is way better than traditional Chapstick. It is very moisturizing and non-waxy.  It leaves my lips soft and smooth.  The dry lip relief lasts longer than Chapstick.  The tangerine scent is heavenly.\nWay better than Chapstick\nC.O. Bigelow Shampoo, Lavender Peppermint Shampoo Cleanses & Soothes Hair & Scalp, Luxury Shampoo for Men & Women, 10.4 Fl Oz.\nC. O. Bigelow\n{'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion,Liquid,Gel', 'Scent': 'Fresh,Lavender,Peppermint', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Package Dimensions': '5.91 x 2.32 x 2.24 inches; 10.4 Ounces', 'UPC': '815691009023'}\nWhat I like about this product:<br />*It smells fantastic with the perfect blend of peppermint and lavender.  The scent is not overpowering like some peppermint shampoos I've tried;<br />*It lathers really well.<br />*It leaves my hair feeling and looking shiny and clean.<br /><br />What I don't like about the product:<br />*The bottle is relatively small for the price ($18.00 for 10.14 ounces at the time of this review);<br />*The cap broke off after the first use.\nSmells great and lathers well\n13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nL&I Apothecary\n{'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\n(Reviewed by my wife): This is a very interesting cleanser - I've never tried anything like it.  It does not foam/lather at all.  Instead, it is so thick it has the consistency of lotion.  It is gentle but cleans effectively.  It leaves my skin feeling clean and soft.\nThick and gentle\nWorkman's Friend Ultimate Hand Care Bundle\nWORKMAN'S FRIEND\n{'Package Dimensions': '9 x 4.5 x 2.3 inches; 1.3 Pounds', 'UPC': '023857030709'}\nThis is a great, complete hand hair set for anyone with dry, cracked hands.  It would make a good gift.<br /><br />*The charcoal scrub is very gritty so it's good for getting dirt out of the cracks on your hands.<br />*The barrier cream is helpful for prevention of dry hands (stop it before it even starts).<br />*Both the barrier cream and the hand cream have the nice side effect of reducing the appearance of wrinkles/aging on your hands.<br />*The products are gentle and excellent quality.<br />*A little goes a long way.\nAwesome products\nIryasa Under Eye Oil - Dark Circles Under Eye Treatment - Natural Anti Aging Serum for Under Eye Bags Treatment, Puffy Eyes Treatment, Eye Lifting and Firming - Eye Serum for Men & Women - 0.27 fl oz\nIRYASA\n{'Skin Type': 'All', 'Product Benefits': 'Hydrating,Eye Treatment,Anti-aging', 'Use for': 'Eyes', 'Scent': 'Aloe', 'Brand': 'IRYASA', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.79 x 0.79 x 3.43 inches; 3.21 Ounces'}\n(Reviewed by my wife): I love the roller applicator of this under eye treatment.  It makes applying the product very easy and helps avoid wasting product.  The eye treatment smells great and goes on smooth.  It moisturizes well and leaves a little shine, reducing the appearance of dark circles and lines.  It is not a miracle product, however, and it does not get rid of really dark circles like the ones I have around my eyes.\nLove the roller applicator\nQIC 4D Silk Fiber Lash Mascara, Fiber Mascara, Waterproof Mascara, Natural Thick Thickening and Lengthening Mascara Lasting All Day\nJoruby\n{'Brand': 'Joruby', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '5.3 x 0.8 x 0.8 inches; 0.81 Ounces'}\n(Reviewed by my wife): I was very disappointed in this mascara.  It is so messy and goopy.  Both steps went on goopy and the mascara kept going all over my face.  I do not recommend.\nToo messy\nFoot Peel Mask For Cracked Heels, Dead Skin & Calluses - Make Your Feet Baby Soft & Get a Smooth Skin, Removes & Repairs Rough Heels\nMonikahair\n{'UPC': '739515020639'}\n(Reviewed by my wife):<br />*Directions are easy-to-follow - just separate the two booties, open up, and place one on each foot.  Tape shut.  Leave on for 60-90 minutes then wash off.<br />*The box says that it should take 1-2 days for peeling to start but my personal experience was that it took 3-4 days for the peeling to start.<br />*At $11.99 for two pairs (you can use the product up to once a month) it's a good deal.<br />*The adhesive did not stick well for me so I put my own socks over the booties and they stayed on fine.<br />*Once the peeling is done my feet are significantly softer and smoother.\nWorks well\nLenghthening Mascara by Almay,Volume & Lift, Eye Makeup, Hypoallergenic and Fragrance Free, 010 Blackest Black, 0.24 Fl Oz\nAlmay\n['Enjoy visibly longer, lifted lashes in one gentle swipe with Almay Length & Lift Mascara™. Our clean, flake-free formula is enriched with a lash-caring complex of plant-based waxes and hair conditioners that nourish for healthy looking eyelashes. Plus, the brush is made of 100% plant-derived bristles that are designed to evenly coat and separate lashes from root to tip. We also ensured that our newest mascara is smooth and buildable—no clumps or smudging—making it the perfect finishing touch to any look, be it everyday glam, a smoky eye, or cat eye. What’s more, we tested our product to ensure it is suitable for sensitive eyes and contact lens wearers, so go ahead and magnify lashes to your chosen intensity! And because we love the environment as much as we love your delicate eyes, part of the mascara packaging is made with post-consumer recycled materials. Formulated without added parabens, phthalates, SLS, mineral oil, DMDM Hydantoin, formaldehydes, and Triclosan. As always, hypoallergenic. Ophthalmologist tested. Clean. Cruelty free. Fragrance free.']\n{'Color': '010 Blackest Black', 'Product Benefits': 'Conditioning', 'Special Feature': 'Not-Applicable', 'Material Type Free': 'Fragrance Free', 'Brand': 'Almay', 'Product Dimensions': '2.75 x 0.73 x 5.75 inches; 1.01 Ounces', 'Item model number': '7257548001', 'UPC': '309970143022', 'Manufacturer': 'AmazonUs/REVL7'}\n(Reviewed by my wife): Wow, after using a tube of cheap mascara, I can really tell the difference.  This mascara is really great quality.  It goes on smoothly with no clumping.  It does not smudge or smear.  It separates the lashes beautifully.  It lives up to its name, \"length and lifted.\"  This mascara is worth paying a few dollars more for.\nGreat quality mascara\nKISSIO Black Mascara,Double-ended Mascara,Mascara 2 in 1,Black Thick Mascara,Stereotype & Thick,Clear Roots,Effective for 12 hours,2 Step,1 Tube\nKISSIO\n{'Color': 'black', 'Brand': 'KISSIO', 'Unit Count': '1.00 Count', 'Package Information': 'Tube', 'Package Type': 'Tube', 'Is Discontinued By Manufacturer': 'No'}\nThis is a good mascara that does not smear/smudge.  I'm not sure how much the primer really helps because I also like the mascara on its own.  The mascara is long lasting and doesn't flake off.  I am a fan of pink so of course I like the pink wand.\nDoesn't smear/smudge\nMovo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#2 Natural)\nMovo\n{'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 3.07 Ounces'}\n(Reviewed by my wife): I love this makeup.  It has light-medium coverage.  It stays put, doesn't melt.  It goes on smoothly and doesn't settle in the cracks.  The sponge works great.\nLove this makeup\nGlow Line Individual Hand Wipes - Hand Wipes Travel Size, Lavender Rose Travel Hand Wipes - Moist Towelettes Individually Wrapped, Wet Wipes Individually Wrapped w/Murumuru Seed & Peptides - 15 ct\nBUSYCO\n{'Brand': 'BUSYCO', 'Skin Type': 'All', 'Unit Count': '15.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '4.5 x 7.3 x 3.5 inches; 3.21 Ounces'}\nThese moisturizing hand wipes are convenient and good for keeping in the car, purse, or taking with you traveling.  The wipes pack a lot of moisturizing punch.  The scent is pleasant and very mild.\nConvenient\nAsenlin Hair Ties Bands 4MM Durable Neutral Ouchless Accessories for Women Men Girls No Metal Elastics Thick Tie with Strong Ponytail Holder and for Medium Hair(24 Count of 3 Pack)-Black\nAsenlin\n{'Material': 'Metal, Cotton, Rubber', 'Item Form': 'elastic', 'Brand': 'Asenlin', 'Item Dimensions LxWxH': '0.2 x 0.09 x 0.02 inches', 'Hair Type': 'Curly', 'Product Dimensions': '0.2 x 0.09 x 0.02 inches; 4.23 Ounces', 'UPC': '779663992884'}\nThese are good hair ties.  They are strong and sturdy, great for a pony tail.  They are a good value for the price.  They are comparable to the leading brand.\nGood hair ties\n4D Silk Fiber Lash Mascara, 2pcs Waterproof Mascara & Fiber Set, Longer Thicker Voluminous Eyelashes, No Clumping, No Smudging Lasting All Day\nArlega+\n{'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'Arlega+', 'Specialty': 'Waterproof', 'Number of Items': '1', 'Package Dimensions': '6.69 x 2.8 x 1.06 inches; 4.16 Ounces', 'UPC': '193995030692 193995032320'}\nThis is a good set of mascara.  I like having the variety of two different brush types.  The mascara is definitely waterproof - it's actually difficult to remove.\nGood mascara",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Body Scrubs for Women Premium Organic Nimiah Exfoliating Body Scrub with Activated Bamboo Charcoal Natural Salt Exfoliator Scrubs for Body Foot Hand Skin Care\nReview Date: 2019/12/20\nStore: Nimiah\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Nimiah', 'Skin Type': 'Acne Prone', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Use for': 'Hands, Whole Body', 'Package Dimensions': '2.7 x 2.7 x 2.1 inches; 5.61 Ounces', 'UPC': '192242919810'}\nReview Text: Pros:<br /><br />*The scrub is really good at exfoliating skin;<br />*After a week of daily use of this scrub, my skin is noticeably softer and brighter;<br />*It is kind of fun to use because it feels/looks like you are rubbing dirt all over your body;<br />*The jar is small but a little goes a long way.<br /><br />Cons:<br />*The charcoal scrub is a bit messy if you are not careful.  I have to quickly rinse my shower after each use because the stuff has flicked everywhere.\nReview Title: Great scrub\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Way Of Will Sweet Orange Body Wash, Moisturizing Body Wash with Sweet Orange Essential Oil, Body Wash for Women and Men, Paraben and Sulfate Free, 120 mL\nReview Date: 2020/01/01\nStore: Way Of Will\nAverage Rating: 3.7\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Oily,All Skin Types', 'Brand': 'Way Of Will', 'Scent': 'Sweet Orange', 'Material Type Free': 'Paraben,Sulfate Free', 'Product Dimensions': '6 x 1.5 x 1.5 inches; 4 Ounces', 'UPC': '840652000191'}\nReview Text: (Reviewed by my wife): I did not expect to like this sweet orange essential oil body wash (It's orange!).  It smells heavenly.  The scent is a mood lifter as described.  The body wash leaves my skin soft and smooth.<br /><br />The bottle is surprisingly small, but a little goes a long way.\nReview Title: Orange scent is heavenly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Splendora Sugar Lip Scrub - Peach - (20g / 0.7oz.)\nReview Date: 2020/01/20\nStore: Splendora\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Splendora', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Dimensions': '1.73 x 1.73 x 1.34 inches; 0.7 Ounces', 'UPC': '736640550444'}\nReview Text: (Reviewed by my wife): This lip scrub smells great and tastes great.  You are supposed to rinse off the scrub after rubbing it in, but it tasted so good that I found myself licking the peachy sugar off.  The directions are very simple, just put a bit of scrub on your lips and rub them in for about 30 seconds, then rinse off.  My lips are visibly smoother after using this product.  The jar is small, but a little goes a long way so I'll be making this last.\nReview Title: Smells great, tastes great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lip MOISTURIZER by MERLOTSPF15 - Intense Therapy Lip Moisturizer - Grape Seed Infused - for Healing Dry, Chapped Lips. Made with Beeswax, Coconut Oil, Vitamin E - Color FreeSPF 15\nReview Date: 2020/02/12\nStore: Merlot\nAverage Rating: 3.4\nProduct Details: {'Package Dimensions': '2.71 x 1.57 x 0.59 inches; 0.32 Ounces'}\nReview Text: This is a very nice lip moisturizer.  It goes on clear and softens and moisturizes your lips.  There is no scent or flavoring.  The moisturizer provides sun protection.\nReview Title: Leaves lips soft and protected from the sun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Taya Beauty Inner Core Hair Strong Anti-Breakage Shampoo & Conditioner Duo - Strengthening and Repairing Formula - Free From Sulfates and Parabens - 8 fl oz Bottles\nReview Date: 2020/02/23\nStore: TAYA I AM.\nProduct Description: ['INNER CORE SHAMPOO: Ingredients: Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Sodium Methyl Cocoyl Taurate, Acrylates Copolymer, Glycerin, Glycol Distearate, Bambusa Vulgaris Extract, Helianthus Annuus (Sunflower) Seed Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Panthenol, Dimethicone, PEG-120 Methyl Glucose Dioleate, Cetrimonium Chloride, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Cetyl Alcohol, Bis-Cetearyl Amodimethicone, Polyquaternium-11, Laureth-4, Laureth-23, Decylene Glycol, Caprylyl Glycol, Disodium EDTA, Amodimethicone, Cocamide MIPA, Trideceth-12, Kaolin, Polysorbate 20, Fragrance/Parfum, Phenoxyethanol, Sodium Hydroxide, Sodium Sulfate, Sodium Chloride, Coconut Acid, Sodium Methyltaurate, Isopropanolamine, Tocopherol, Salicylic Acid, Cyclotetrasiloxane, Cyclopentasiloxane, Ethylhexylglycerin, Citric Acid, Amyl Cinnamal, Benzyl Salicylate, Linalool. INNER CORE CONDITIONER: Ingredients: Water/Aqua/Eau, Cetearyl Alcohol, Glycerin, Behentrimonium Methosulfate, Stearamidopropyl Dimethylamine, Polysorbate 60, Bambusa Vulgaris Extract, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Cetrimonium Chloride, Dimethicone, Divinyldimethicone/Dimethicone Copolymer, Polyquaternium-37, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Propylene Glycol Dicaprylate/Dicaprate, Dicetyldimonium Chloride, Amodimethicone, Polyquaternium-7, PPG-1 Trideceth-6, Cetyl Alcohol, Trideceth-12, C11-15 Pareth-7, C12-13 Pareth-23, C12-13 Pareth-3, Decylene Glycol, Caprylyl Glycol, PEG-90M, Tetrasodium EDTA, Buteth-3, C10-40 Isoalkylamidopropylethyldimonium Ethosulfate, Sodium Benzotriazolyl Butylphenol Sulfonate, Laureth-9, Tributyl Citrate, Citric Acid, Fragrance/Parfum, Kaolin, Yellow 6/CI 15985, Phenoxyethanol, Sorbitan Oleate, Acrylates/Stearyl Methacrylate Copolymer, C10-11 Isoparaffin, Isopropyl Alcohol, Trisodium HEDTA, Silica, BHT, Amyl Cinnamal, Benzyl Salicylate, Linalool.']\nAverage Rating: 4.0\nProduct Details: {'Product Benefits': 'Moisturizing,Repairing,Cleanses,Breakage', 'Item Form': 'Liquid', 'Brand': 'TAYA I AM.', 'Hair Type': 'Wavy, Color Treated, Curly, Damaged, Thin', 'Scent': 'Coconut', 'Package Dimensions': '7.99 x 4.53 x 2.09 inches; 1 Pounds', 'Item model number': '3.00', 'UPC': '858308002185'}\nReview Text: I was able to get the conditioner bottle open, but not the shampoo.  The bottles have an interesting opening mechanism.  You turn the top and squeeze the product out through a mesh hole on the top.  Unfortunately, the top on our shampoo bottle is defective and none of us can get it open.  The conditioner is very nice though.  It is thick and smooth and detangles well.  It also smells nice.\nReview Title: Shampoo bottle won't open\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pharmacopia Tangerine-Flavored Lip Balm - Set of 2, 0.25oz - Nourishing Herbal Lip Elixir with 100% Natural and Certified Organic Ingredients\nReview Date: 2020/02/23\nStore: Pharmacopia\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Pharmacopia', 'Item Form': 'Balm', 'Finish Type': 'Natural', 'Skin Type': 'Dry', 'Product Benefits': 'Hydrating,Soothing,Nourishing', 'Package Dimensions': '3.6 x 1.7 x 0.7 inches; 0.25 Ounces', 'UPC': '087819800366'}\nReview Text: This product is way better than traditional Chapstick. It is very moisturizing and non-waxy.  It leaves my lips soft and smooth.  The dry lip relief lasts longer than Chapstick.  The tangerine scent is heavenly.\nReview Title: Way better than Chapstick\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: C.O. Bigelow Shampoo, Lavender Peppermint Shampoo Cleanses & Soothes Hair & Scalp, Luxury Shampoo for Men & Women, 10.4 Fl Oz.\nReview Date: 2020/02/24\nStore: C. O. Bigelow\nAverage Rating: 4.4\nProduct Details: {'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion,Liquid,Gel', 'Scent': 'Fresh,Lavender,Peppermint', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Package Dimensions': '5.91 x 2.32 x 2.24 inches; 10.4 Ounces', 'UPC': '815691009023'}\nReview Text: What I like about this product:<br />*It smells fantastic with the perfect blend of peppermint and lavender.  The scent is not overpowering like some peppermint shampoos I've tried;<br />*It lathers really well.<br />*It leaves my hair feeling and looking shiny and clean.<br /><br />What I don't like about the product:<br />*The bottle is relatively small for the price ($18.00 for 10.14 ounces at the time of this review);<br />*The cap broke off after the first use.\nReview Title: Smells great and lathers well\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nReview Date: 2020/02/26\nStore: L&I Apothecary\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\nReview Text: (Reviewed by my wife): This is a very interesting cleanser - I've never tried anything like it.  It does not foam/lather at all.  Instead, it is so thick it has the consistency of lotion.  It is gentle but cleans effectively.  It leaves my skin feeling clean and soft.\nReview Title: Thick and gentle\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Workman's Friend Ultimate Hand Care Bundle\nReview Date: 2020/04/14\nStore: WORKMAN'S FRIEND\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '9 x 4.5 x 2.3 inches; 1.3 Pounds', 'UPC': '023857030709'}\nReview Text: This is a great, complete hand hair set for anyone with dry, cracked hands.  It would make a good gift.<br /><br />*The charcoal scrub is very gritty so it's good for getting dirt out of the cracks on your hands.<br />*The barrier cream is helpful for prevention of dry hands (stop it before it even starts).<br />*Both the barrier cream and the hand cream have the nice side effect of reducing the appearance of wrinkles/aging on your hands.<br />*The products are gentle and excellent quality.<br />*A little goes a long way.\nReview Title: Awesome products\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Iryasa Under Eye Oil - Dark Circles Under Eye Treatment - Natural Anti Aging Serum for Under Eye Bags Treatment, Puffy Eyes Treatment, Eye Lifting and Firming - Eye Serum for Men & Women - 0.27 fl oz\nReview Date: 2020/05/05\nStore: IRYASA\nAverage Rating: 3.6\nProduct Details: {'Skin Type': 'All', 'Product Benefits': 'Hydrating,Eye Treatment,Anti-aging', 'Use for': 'Eyes', 'Scent': 'Aloe', 'Brand': 'IRYASA', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.79 x 0.79 x 3.43 inches; 3.21 Ounces'}\nReview Text: (Reviewed by my wife): I love the roller applicator of this under eye treatment.  It makes applying the product very easy and helps avoid wasting product.  The eye treatment smells great and goes on smooth.  It moisturizes well and leaves a little shine, reducing the appearance of dark circles and lines.  It is not a miracle product, however, and it does not get rid of really dark circles like the ones I have around my eyes.\nReview Title: Love the roller applicator\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: QIC 4D Silk Fiber Lash Mascara, Fiber Mascara, Waterproof Mascara, Natural Thick Thickening and Lengthening Mascara Lasting All Day\nReview Date: 2020/05/06\nStore: Joruby\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Joruby', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '5.3 x 0.8 x 0.8 inches; 0.81 Ounces'}\nReview Text: (Reviewed by my wife): I was very disappointed in this mascara.  It is so messy and goopy.  Both steps went on goopy and the mascara kept going all over my face.  I do not recommend.\nReview Title: Too messy\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Foot Peel Mask For Cracked Heels, Dead Skin & Calluses - Make Your Feet Baby Soft & Get a Smooth Skin, Removes & Repairs Rough Heels\nReview Date: 2020/07/26\nStore: Monikahair\nAverage Rating: 2.9\nProduct Details: {'UPC': '739515020639'}\nReview Text: (Reviewed by my wife):<br />*Directions are easy-to-follow - just separate the two booties, open up, and place one on each foot.  Tape shut.  Leave on for 60-90 minutes then wash off.<br />*The box says that it should take 1-2 days for peeling to start but my personal experience was that it took 3-4 days for the peeling to start.<br />*At $11.99 for two pairs (you can use the product up to once a month) it's a good deal.<br />*The adhesive did not stick well for me so I put my own socks over the booties and they stayed on fine.<br />*Once the peeling is done my feet are significantly softer and smoother.\nReview Title: Works well\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lenghthening Mascara by Almay,Volume & Lift, Eye Makeup, Hypoallergenic and Fragrance Free, 010 Blackest Black, 0.24 Fl Oz\nReview Date: 2021/03/20\nStore: Almay\nProduct Description: ['Enjoy visibly longer, lifted lashes in one gentle swipe with Almay Length & Lift Mascara™. Our clean, flake-free formula is enriched with a lash-caring complex of plant-based waxes and hair conditioners that nourish for healthy looking eyelashes. Plus, the brush is made of 100% plant-derived bristles that are designed to evenly coat and separate lashes from root to tip. We also ensured that our newest mascara is smooth and buildable—no clumps or smudging—making it the perfect finishing touch to any look, be it everyday glam, a smoky eye, or cat eye. What’s more, we tested our product to ensure it is suitable for sensitive eyes and contact lens wearers, so go ahead and magnify lashes to your chosen intensity! And because we love the environment as much as we love your delicate eyes, part of the mascara packaging is made with post-consumer recycled materials. Formulated without added parabens, phthalates, SLS, mineral oil, DMDM Hydantoin, formaldehydes, and Triclosan. As always, hypoallergenic. Ophthalmologist tested. Clean. Cruelty free. Fragrance free.']\nAverage Rating: 4.2\nProduct Details: {'Color': '010 Blackest Black', 'Product Benefits': 'Conditioning', 'Special Feature': 'Not-Applicable', 'Material Type Free': 'Fragrance Free', 'Brand': 'Almay', 'Product Dimensions': '2.75 x 0.73 x 5.75 inches; 1.01 Ounces', 'Item model number': '7257548001', 'UPC': '309970143022', 'Manufacturer': 'AmazonUs/REVL7'}\nReview Text: (Reviewed by my wife): Wow, after using a tube of cheap mascara, I can really tell the difference.  This mascara is really great quality.  It goes on smoothly with no clumping.  It does not smudge or smear.  It separates the lashes beautifully.  It lives up to its name, \"length and lifted.\"  This mascara is worth paying a few dollars more for.\nReview Title: Great quality mascara\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: KISSIO Black Mascara,Double-ended Mascara,Mascara 2 in 1,Black Thick Mascara,Stereotype & Thick,Clear Roots,Effective for 12 hours,2 Step,1 Tube\nReview Date: 2021/04/11\nStore: KISSIO\nAverage Rating: 3.4\nProduct Details: {'Color': 'black', 'Brand': 'KISSIO', 'Unit Count': '1.00 Count', 'Package Information': 'Tube', 'Package Type': 'Tube', 'Is Discontinued By Manufacturer': 'No'}\nReview Text: This is a good mascara that does not smear/smudge.  I'm not sure how much the primer really helps because I also like the mascara on its own.  The mascara is long lasting and doesn't flake off.  I am a fan of pink so of course I like the pink wand.\nReview Title: Doesn't smear/smudge\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Movo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#2 Natural)\nReview Date: 2021/05/17\nStore: Movo\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 3.07 Ounces'}\nReview Text: (Reviewed by my wife): I love this makeup.  It has light-medium coverage.  It stays put, doesn't melt.  It goes on smoothly and doesn't settle in the cracks.  The sponge works great.\nReview Title: Love this makeup\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Glow Line Individual Hand Wipes - Hand Wipes Travel Size, Lavender Rose Travel Hand Wipes - Moist Towelettes Individually Wrapped, Wet Wipes Individually Wrapped w/Murumuru Seed & Peptides - 15 ct\nReview Date: 2021/05/23\nStore: BUSYCO\nAverage Rating: 3.3\nProduct Details: {'Brand': 'BUSYCO', 'Skin Type': 'All', 'Unit Count': '15.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '4.5 x 7.3 x 3.5 inches; 3.21 Ounces'}\nReview Text: These moisturizing hand wipes are convenient and good for keeping in the car, purse, or taking with you traveling.  The wipes pack a lot of moisturizing punch.  The scent is pleasant and very mild.\nReview Title: Convenient\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Asenlin Hair Ties Bands 4MM Durable Neutral Ouchless Accessories for Women Men Girls No Metal Elastics Thick Tie with Strong Ponytail Holder and for Medium Hair(24 Count of 3 Pack)-Black\nReview Date: 2021/07/24\nStore: Asenlin\nAverage Rating: 4.4\nProduct Details: {'Material': 'Metal, Cotton, Rubber', 'Item Form': 'elastic', 'Brand': 'Asenlin', 'Item Dimensions LxWxH': '0.2 x 0.09 x 0.02 inches', 'Hair Type': 'Curly', 'Product Dimensions': '0.2 x 0.09 x 0.02 inches; 4.23 Ounces', 'UPC': '779663992884'}\nReview Text: These are good hair ties.  They are strong and sturdy, great for a pony tail.  They are a good value for the price.  They are comparable to the leading brand.\nReview Title: Good hair ties\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara, 2pcs Waterproof Mascara & Fiber Set, Longer Thicker Voluminous Eyelashes, No Clumping, No Smudging Lasting All Day\nReview Date: 2021/10/17\nStore: Arlega+\nAverage Rating: 4.3\nProduct Details: {'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'Arlega+', 'Specialty': 'Waterproof', 'Number of Items': '1', 'Package Dimensions': '6.69 x 2.8 x 1.06 inches; 4.16 Ounces', 'UPC': '193995030692 193995032320'}\nReview Text: This is a good set of mascara.  I like having the variety of two different brush types.  The mascara is definitely waterproof - it's actually difficult to remove.\nReview Title: Good mascara\nRating: 4.0\n--------------------------------------------------",
  "raw_response": "The individual shows distinct preferences for skincare and beauty products, with a focus on natural, organic, and moisturizing options. Keywords reflecting their trends include:\n\n- **Exfoliating**: Frequently purchases scrubs for body and lip care; enjoys the benefit of smoother skin.\n- **Moisturizing**: Prioritizes hydration in lip products, hand creams, and facial cleansers, indicating a concern for dry skin.\n- **Natural ingredients**: Appears to favor products that are certified organic, cruelty-free, or contain essential oils, suggesting an inclination towards eco-friendly choices.\n- **Scent preferences**: Enjoys pleasant fragrances like sweet orange and lavender, signaling an appreciation for sensory experiences in skincare.\n- **Product sizes**: Often mentions that \"a little goes a long way,\" indicating a preference for small but effective products.\n- **Convenience**: Values travel-sized products or easily accessible items like hand wipes, reflecting a need for practicality.\n- **Mascara focus**: Multiple purchases highlight a pursuit of effective mascara, displaying a commitment to high-quality, non-smearing options.\n- **Physical results**: Consistently seeks products that offer visible outcomes, such as softer skin and improved appearance.\n\nOverall, this individual demonstrates a clear preference for gentle, effective beauty solutions that enhance well-being and appearance while emphasizing natural ingredients.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Good shampoo & conditioner set",
    "text": "*Smells good<br />*Lathers up well<br />*Leaves hair feeling soft<br />*Hair looks soft and shiny",
    "images": [],
    "asin": "B08RY6S25W",
    "parent_asin": "B08RY6S25W",
    "user_id": "AG3HKK7MIKRQ7DOTNDOE63X2WJGQ",
    "timestamp": "2021-10-27 14:37:29.171000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Purple Shampoo and Conditioner Set - No, Orange, Yellow or Brassy Tones - Best Toner Treatment for Brassiness - Blonde, Grey, Bleached or Silver Hair - Sulfate Free",
    "average_rating": 4.0,
    "rating_number": 876,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51W8yMkxGiS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51W8yMkxGiS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71ppDx21ACS._SL1350_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51I9O7eQn4L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51I9O7eQn4L.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/818lqrrRRnL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51oAcxfyJdL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51oAcxfyJdL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81876c9uIGL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51-++4auZ0L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-++4auZ0L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/81FpsqfteVL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51jByGBiw1L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51jByGBiw1L.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81xzwmTw-GL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Z-QMApOXL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Z-QMApOXL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81iQxnYvcHL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51dV9D-qWXL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51dV9D-qWXL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/811tb9ZZMWL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5159ufHZNtL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/5159ufHZNtL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71RtYMz8ZLL._SL1350_.jpg"
      }
    ],
    "videos": [],
    "store": "PURE NATURE LUX SPA",
    "categories": [],
    "details": {
      "Product Benefits": "Nourishing,Clean,Gentle",
      "Material Type Free": "Sulfate Free",
      "Item Form": "Gel",
      "Brand": "PURE NATURE LUX SPA",
      "Hair Type": "Color",
      "Package Dimensions": "7.68 x 6.06 x 3.19 inches; 2.68 Pounds",
      "Item model number": "PURE NATURE LUX SPA",
      "UPC": "765066671143"
    },
    "bought_together": null
  }
}