{
  "user_id": "AESCUI6VXJSHLUIO44Y5ERAHZE4A",
  "summary": "=== Purchase Information ===\nProduct Title: Growom Garden Hose Nozzle 4 Adjustable Spray Patterns Garden Sprayer Heavy Duty Metal Hose Nozzle with 3 Washers for Gardening, Car Washing, Pet Bathing and General Cleaning\nReview Date: 2019/09/13\nStore: Growom\nAverage Rating: 3.1\nProduct Details: {'Brand': 'Growom', 'Finish Type': 'Polished', 'Material': 'Heavy,Metal', 'Handle Type': 'Lever', 'Package Dimensions': '8.3 x 4.6 x 1.7 inches; 1.15 Pounds'}\nReview Text: This nozzle is super built to last. It’s rather heavy but I know it will withstand the much abuse. My only worry is we have hard water and sometimes that eats away at our nozzles over time. Great product that will last though!\nReview Title: Super heavy duty\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Beachwaver Co. Dual Voltage, S1, White\nReview Date: 2019/09/15\nAverage Rating: 4.5\nProduct Details: {'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nReview Text: First off, I know it pricey for a curling iron but it actually does the trick and is pretty cool. You clip your hair in the bottom little clipper and I prefer the low speed and it winds your hair for you up the wand! It gets nice and hot and curls did stay well after hrs or wear in semi humid weather. Definitely takes a little getting use to but it’s pretty cool. You do need to take slightly smaller sections of hair to curl so the clipper can hold it but I really enjoyed using this!\nReview Title: I was skeptical but this is super amazing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nReview Date: 2020/02/05\nStore: JPNK\nAverage Rating: 4.1\nProduct Details: {'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nReview Text: I love these combs not only for myself but for my daughters hair. They are perfect for any hair length or texture as you have a set of 4 from wide tooth to fine tooth. They feel nice on the scalp and glide through hair easily. These are a great deal for 4 of these!\nReview Title: Great detangler combs\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Magnesium Serum For Kids - All Natural Rub for Kids and Babies, Toxic Free + Free Magnesium Chart PDF\nReview Date: 2020/02/07\nStore: Raise Them Well\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Raise Them Well', 'Item Form': 'Liquid', 'Unit Count': '2 Fl. Oz', 'Flavor': 'Unflavored', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 1.5 x 1.5 inches; 3.2 Ounces', 'UPC': '853647007044', 'Manufacturer': 'Raise Them Well'}\nReview Text: Unfortunately I didn't notice much different with this spray. I think it smells nice and it a great idea to calm kiddos but I fine essential oil rollers on the bottom of the feet to have more contact with the skin making them more effective.\nReview Title: Didn't notice any difference\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pick & Pick (Gentle/metal allergy free material)\nReview Date: 2020/02/29\nStore: MIND UP\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '7 x 1.2 x 0.5 inches; 0.63 Ounces'}\nReview Text: I was hopeful for this pick but disappointed. First off, it's a super flimsy and you can't use much pressure when pressing against teeth. Also, the pointed end that is supposed to clear put any food from between the teeth isn't pointed enough so you can't really get in there all the way. Last, because you cannot put enough pressure to scrape off gunk, it becomes useless.\nReview Title: Way to flimsy\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Pack Soft Headband BEoffer Coral Fleece Women Makeup Spa Head Bands Turban Fashion Bow Bowknot Hairlace Headwear Wash Face Hair Holder Elastic Top Knot Bandage Girl Baby Hair Accessories 6 Colors\nReview Date: 2020/03/15\nStore: BEoffer\nAverage Rating: 4.6\nProduct Details: {'Age Range (Description)': 'Baby', 'Material': 'Elastic', 'Fabric Type': 'Fleece', 'Number of Items': '6', 'Recommended Uses For Product': 'Face Makeup', 'Product Dimensions': '7.28 x 1.97 x 0.67 inches; 1.16 Ounces', 'Item model number': 'BH-002', 'UPC': '799899729252'}\nReview Text: These super cute headbands are perfect for washing you face at the end of the night, making sure all the hair stays out for your face, and when I am applying my sunscreen in the morning so it doesn't get in my hair. They are super soft and come in a variety of colors!!!\nReview Title: Perfect for washing face\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hairdresser Scissors Set Hair Thinning Scissors Hairdressing Shears Set with Wipe Cloth,Grinding card, Hair Razor Comb, Clips, Upgraded Professional Haircut Set black\nReview Date: 2020/06/27\nStore: Lyeiaa\nProduct Description: ['All-in-One Hair Cutting Kit :1 x Hair Scissor,1 x Grinding card,1 x Hair Razor Comb, 1 x Cleaning Cloth, 1 x Comb, 2 x Hairpin clips , 1 x Neck Duster. The hair cutting kit meets all your hair cutting and styling needs.']\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Lyeiaa', 'Included Components': 'Scissors', 'Unit Count': '1 Count', 'Package Dimensions': '8.94 x 4.09 x 1.54 inches; 12.73 Ounces', 'UPC': '303276761980', 'Manufacturer': 'Lyeiaa'}\nReview Text: This kit is my favorite one I've purchased. I cut my kids and husband's hair and this is everything you will need! Comes in a nifty little case that holds it all together. The cape is perfect for minimizing hairs everywhere. The scissors and thinning sheers are super sharp and use with minimal effort. So far this is the best kit I am using and would recommend to anyone.\nReview Title: All in one kit\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Winky Lux Double Matte Whip 24-Hour Waterproof Lipstick, Liquid Wet Lipstick for Long-Lasting Matte Lip Color, Hydrating Makeup with Vanilla and Avocado Oil to Lock in Moisture, 0.14 Oz, Cookie\nReview Date: 2020/07/08\nStore: Winky Lux\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Winky Lux', 'Color': 'Cookie', 'Skin Type': 'All', 'Item Form': 'Liquid', 'Finish Type': 'Matte', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.65 x 0.65 x 4.28 inches; 0.14 Ounces', 'UPC': '859346006968'}\nReview Text: This pretty color goes on wet and dries down to a very pretty medium brown. I have light olive skin and found it very complementary to my skintone. Not too dark that it's a nighttime look but dark enough that it looks like I'm wearing something. Stays on pretty well and I will definitely be buying more\nReview Title: Pretty neutral shade\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Magnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nReview Date: 2020/07/10\nStore: Eyenjoy\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nReview Text: I had to keep reapplying the magnetic eyeliner especially in the corners of my eyes where it maybe got wet from blinking. I didn't feel like I could go out without the eyeliner in my purse to reapply everything I had a mirror. To me that just too much work then and you might as well use regular lashes.\nReview Title: Don't stay well\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nReview Date: 2020/07/14\nStore: CIMIY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nReview Text: We use aloe a lot in our house as my daughter is constantly scraping her knees. This aloe has a nice push too for easy use and it a pretty decent value size. No strong smell and dries fast. Great buy.\nReview Title: Nice bottle for easy use\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bloomy Essentials Organic Tea Tree Essential Oil 10 mL - USDA Certified Organic - Hair, Skin, Toenail Fungus, and Acne - 100% Pure\nReview Date: 2020/07/19\nStore: Bloomy Essentials\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Bloomy Essentials', 'Scent': 'Tea Tree', 'Special Feature': 'Pure', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Package Dimensions': '5 x 3 x 0.75 inches; 1.59 Ounces', 'UPC': '680912084581', 'Manufacturer': 'Bloomy Essentials'}\nReview Text: Fairly good sized bottle and price. Oil consistency was pretty good snd I found the scent to be right on. Smells great!\nReview Title: Smells great\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nReview Date: 2020/07/21\nStore: Sdara Skincare\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nReview Text: I like this aloe because it speaks easily and absorbs into the skin quickly. Its so hard to keep still letting it fully dry but this one doesn't take long at all. I like the lack for a strong scent and natural ingredients.\nReview Title: Spreads easily\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2oz / 60ml Glass Spray Bottles for DIY Refill, Essential Oils, Pillow Mists,Fine Mist Spray -3Packs Amber Color\nReview Date: 2020/09/06\nStore: EagleKing\nAverage Rating: 4.5\nProduct Details: {'Brand': 'EagleKing', 'Material': 'Glass', 'Capacity': '2 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray', 'Package Dimensions': '6.3 x 6.1 x 1.7 inches; 8.78 Ounces'}\nReview Text: I used these bottles to make my own essential oil room sprays for the bathroom. They are the perfect smaller size to fit on the back of the toilet and last forever as you only need one or two sprays. Sprayer lasts well in addition to the pump. Amber color is perfect for keeping essential oils good for a long time! Great purchase!\nReview Title: DIY essential oil spray\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Empty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nReview Date: 2020/09/06\nStore: Cherry\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nReview Text: I used these bottles to make my own essential oil room sprays for the bathroom. They are the perfect larger size to fit on the back of the toilet and last forever as you only need one or two sprays. Sprayer lasts well in addition to the pump. Amber color is perfect for keeping essential oils good for a long time! Great purchase!\nReview Title: Awesome room sprayer\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aloe Hand Sanitizer 24 Pack Dearskin Aloe Vera Moisturizing Alcohol 75% Gel 2 Fl Oz/60ml Skin Care Natural Advanced Formula Alcohol Refreshing Moisturizing with Argine.\nReview Date: 2020/11/18\nStore: Dearskin\nProduct Description: ['24 Pack Dearskin Hand Sanitizer 60ml, 2 Fl Oz', 'Dearskin Hand sanitizer Kills 99.9% of the most common germs!', '- Clean and Refreshing Moisturizing;', '- Long-Lasting Antibacterial;', '- Easy to use, hard to waste; -', '75% Alcohol;', 'Drug Facts: Active ingredients: - Alcohol 75% v/v. Antiseptic. Use: Hand sanitizer to help reduce bacteria that potentially can cause disease. For use when soap and water are not available. For external use only. Flammable. Keep away from or flame. Do not use: - In children less than 2 months of age. - On open skin wounds. When using this product keep out of eyes, and mouth. In case of contact with eyes, rinse eyes thoroughly with water. Stop use and ask a doctor if irritation or rash occurs. These may be sings of a serious condition. Keep out of reach of children. If swallowed, get medical help or contact a Poison Control Center right away. Directions: - Place enough product on hands to cover all surfaces. Rub hands together until dry. - Supervise children under 6 years of age when use this product to avoid swallowing. Other information: Store between 15-30C (59-86F). Avoid freezing and excessive heat above 40C (104F). Inactive ingredients: Deionized Water, Aloe Barbadensis Extract, Carbomer, Arginine. Distributed by: Dearskin LLC, FL.']\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Dearskin', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '24', 'Special Feature': 'Not Tested On Animals, Travel Size, Moisturizer', 'Scent': 'Aloe Vera', 'Product Dimensions': '5 x 4 x 4 inches; 2.36 Ounces', 'UPC': '850005863359', 'Manufacturer': 'Dearskin'}\nReview Text: This hand sanitizer works great. It isn't too sticky and a little goes a long way. Great value for the price. So easy to use and love the high alcohol continent to keep germs away for myself and my family! Perfect for each family member to keep in their pocket!\nReview Title: Love these little bottles\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gel Nail Polish Set, Holiday Red Black 6 Colors Gel Polish Kit Popular Nail Art Design Soak Off LED Lamp Nail Polish Gel Manicure Kit Gifts Set for Girls Women Professional DIY Home Use\nReview Date: 2020/12/16\nStore: Anzuo\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Anzuo', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '6.00 Count', 'Number of Items': '6', 'Package Dimensions': '5.4 x 3.7 x 3.3 inches; 8.78 Ounces', 'Item model number': 'FZ', 'UPC': '738626208554'}\nReview Text: Easy to use and colors are super vibrant. Lasts about 2 weeks and comes off with nail drill. Love the variety of colors and highly recommend this for any at home nail diy!\nReview Title: Perfect for winter and holidays\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Portable Travel Bottles Keyring Fruit Holders 50ml Refillable Empty Containers Perfect for Kids to Carry Hand Sanitiser (4pcs)\nReview Date: 2020/12/16\nStore: PetSinc\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '7.4 x 5.47 x 1.81 inches; 3.53 Ounces', 'UPC': '782910026546'}\nReview Text: Super cute for kiddos! They're refillable so strap them onto their backpacks or lunch boxes so they use them often! Great for gifting as party favors or even stocking suffers.\nReview Title: Cute for kiddos\nRating: 5.0\n--------------------------------------------------",
  "reference": "Growom Garden Hose Nozzle 4 Adjustable Spray Patterns Garden Sprayer Heavy Duty Metal Hose Nozzle with 3 Washers for Gardening, Car Washing, Pet Bathing and General Cleaning\nGrowom\n{'Brand': 'Growom', 'Finish Type': 'Polished', 'Material': 'Heavy,Metal', 'Handle Type': 'Lever', 'Package Dimensions': '8.3 x 4.6 x 1.7 inches; 1.15 Pounds'}\nThis nozzle is super built to last. It’s rather heavy but I know it will withstand the much abuse. My only worry is we have hard water and sometimes that eats away at our nozzles over time. Great product that will last though!\nSuper heavy duty\nThe Beachwaver Co. Dual Voltage, S1, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nFirst off, I know it pricey for a curling iron but it actually does the trick and is pretty cool. You clip your hair in the bottom little clipper and I prefer the low speed and it winds your hair for you up the wand! It gets nice and hot and curls did stay well after hrs or wear in semi humid weather. Definitely takes a little getting use to but it’s pretty cool. You do need to take slightly smaller sections of hair to curl so the clipper can hold it but I really enjoyed using this!\nI was skeptical but this is super amazing\nJPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nJPNK\n{'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nI love these combs not only for myself but for my daughters hair. They are perfect for any hair length or texture as you have a set of 4 from wide tooth to fine tooth. They feel nice on the scalp and glide through hair easily. These are a great deal for 4 of these!\nGreat detangler combs\nMagnesium Serum For Kids - All Natural Rub for Kids and Babies, Toxic Free + Free Magnesium Chart PDF\nRaise Them Well\n{'Brand': 'Raise Them Well', 'Item Form': 'Liquid', 'Unit Count': '2 Fl. Oz', 'Flavor': 'Unflavored', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 1.5 x 1.5 inches; 3.2 Ounces', 'UPC': '853647007044', 'Manufacturer': 'Raise Them Well'}\nUnfortunately I didn't notice much different with this spray. I think it smells nice and it a great idea to calm kiddos but I fine essential oil rollers on the bottom of the feet to have more contact with the skin making them more effective.\nDidn't notice any difference\nPick & Pick (Gentle/metal allergy free material)\nMIND UP\n{'Package Dimensions': '7 x 1.2 x 0.5 inches; 0.63 Ounces'}\nI was hopeful for this pick but disappointed. First off, it's a super flimsy and you can't use much pressure when pressing against teeth. Also, the pointed end that is supposed to clear put any food from between the teeth isn't pointed enough so you can't really get in there all the way. Last, because you cannot put enough pressure to scrape off gunk, it becomes useless.\nWay to flimsy\n6 Pack Soft Headband BEoffer Coral Fleece Women Makeup Spa Head Bands Turban Fashion Bow Bowknot Hairlace Headwear Wash Face Hair Holder Elastic Top Knot Bandage Girl Baby Hair Accessories 6 Colors\nBEoffer\n{'Age Range (Description)': 'Baby', 'Material': 'Elastic', 'Fabric Type': 'Fleece', 'Number of Items': '6', 'Recommended Uses For Product': 'Face Makeup', 'Product Dimensions': '7.28 x 1.97 x 0.67 inches; 1.16 Ounces', 'Item model number': 'BH-002', 'UPC': '799899729252'}\nThese super cute headbands are perfect for washing you face at the end of the night, making sure all the hair stays out for your face, and when I am applying my sunscreen in the morning so it doesn't get in my hair. They are super soft and come in a variety of colors!!!\nPerfect for washing face\nHairdresser Scissors Set Hair Thinning Scissors Hairdressing Shears Set with Wipe Cloth,Grinding card, Hair Razor Comb, Clips, Upgraded Professional Haircut Set black\nLyeiaa\n['All-in-One Hair Cutting Kit :1 x Hair Scissor,1 x Grinding card,1 x Hair Razor Comb, 1 x Cleaning Cloth, 1 x Comb, 2 x Hairpin clips , 1 x Neck Duster. The hair cutting kit meets all your hair cutting and styling needs.']\n{'Brand': 'Lyeiaa', 'Included Components': 'Scissors', 'Unit Count': '1 Count', 'Package Dimensions': '8.94 x 4.09 x 1.54 inches; 12.73 Ounces', 'UPC': '303276761980', 'Manufacturer': 'Lyeiaa'}\nThis kit is my favorite one I've purchased. I cut my kids and husband's hair and this is everything you will need! Comes in a nifty little case that holds it all together. The cape is perfect for minimizing hairs everywhere. The scissors and thinning sheers are super sharp and use with minimal effort. So far this is the best kit I am using and would recommend to anyone.\nAll in one kit\nWinky Lux Double Matte Whip 24-Hour Waterproof Lipstick, Liquid Wet Lipstick for Long-Lasting Matte Lip Color, Hydrating Makeup with Vanilla and Avocado Oil to Lock in Moisture, 0.14 Oz, Cookie\nWinky Lux\n{'Brand': 'Winky Lux', 'Color': 'Cookie', 'Skin Type': 'All', 'Item Form': 'Liquid', 'Finish Type': 'Matte', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.65 x 0.65 x 4.28 inches; 0.14 Ounces', 'UPC': '859346006968'}\nThis pretty color goes on wet and dries down to a very pretty medium brown. I have light olive skin and found it very complementary to my skintone. Not too dark that it's a nighttime look but dark enough that it looks like I'm wearing something. Stays on pretty well and I will definitely be buying more\nPretty neutral shade\nMagnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nEyenjoy\n{'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nI had to keep reapplying the magnetic eyeliner especially in the corners of my eyes where it maybe got wet from blinking. I didn't feel like I could go out without the eyeliner in my purse to reapply everything I had a mirror. To me that just too much work then and you might as well use regular lashes.\nDon't stay well\nAloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nCIMIY\n{'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nWe use aloe a lot in our house as my daughter is constantly scraping her knees. This aloe has a nice push too for easy use and it a pretty decent value size. No strong smell and dries fast. Great buy.\nNice bottle for easy use\nBloomy Essentials Organic Tea Tree Essential Oil 10 mL - USDA Certified Organic - Hair, Skin, Toenail Fungus, and Acne - 100% Pure\nBloomy Essentials\n{'Brand': 'Bloomy Essentials', 'Scent': 'Tea Tree', 'Special Feature': 'Pure', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Package Dimensions': '5 x 3 x 0.75 inches; 1.59 Ounces', 'UPC': '680912084581', 'Manufacturer': 'Bloomy Essentials'}\nFairly good sized bottle and price. Oil consistency was pretty good snd I found the scent to be right on. Smells great!\nSmells great\nSdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nSdara Skincare\n{'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nI like this aloe because it speaks easily and absorbs into the skin quickly. Its so hard to keep still letting it fully dry but this one doesn't take long at all. I like the lack for a strong scent and natural ingredients.\nSpreads easily\n2oz / 60ml Glass Spray Bottles for DIY Refill, Essential Oils, Pillow Mists,Fine Mist Spray -3Packs Amber Color\nEagleKing\n{'Brand': 'EagleKing', 'Material': 'Glass', 'Capacity': '2 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray', 'Package Dimensions': '6.3 x 6.1 x 1.7 inches; 8.78 Ounces'}\nI used these bottles to make my own essential oil room sprays for the bathroom. They are the perfect smaller size to fit on the back of the toilet and last forever as you only need one or two sprays. Sprayer lasts well in addition to the pump. Amber color is perfect for keeping essential oils good for a long time! Great purchase!\nDIY essential oil spray\nEmpty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nI used these bottles to make my own essential oil room sprays for the bathroom. They are the perfect larger size to fit on the back of the toilet and last forever as you only need one or two sprays. Sprayer lasts well in addition to the pump. Amber color is perfect for keeping essential oils good for a long time! Great purchase!\nAwesome room sprayer\nAloe Hand Sanitizer 24 Pack Dearskin Aloe Vera Moisturizing Alcohol 75% Gel 2 Fl Oz/60ml Skin Care Natural Advanced Formula Alcohol Refreshing Moisturizing with Argine.\nDearskin\n['24 Pack Dearskin Hand Sanitizer 60ml, 2 Fl Oz', 'Dearskin Hand sanitizer Kills 99.9% of the most common germs!', '- Clean and Refreshing Moisturizing;', '- Long-Lasting Antibacterial;', '- Easy to use, hard to waste; -', '75% Alcohol;', 'Drug Facts: Active ingredients: - Alcohol 75% v/v. Antiseptic. Use: Hand sanitizer to help reduce bacteria that potentially can cause disease. For use when soap and water are not available. For external use only. Flammable. Keep away from or flame. Do not use: - In children less than 2 months of age. - On open skin wounds. When using this product keep out of eyes, and mouth. In case of contact with eyes, rinse eyes thoroughly with water. Stop use and ask a doctor if irritation or rash occurs. These may be sings of a serious condition. Keep out of reach of children. If swallowed, get medical help or contact a Poison Control Center right away. Directions: - Place enough product on hands to cover all surfaces. Rub hands together until dry. - Supervise children under 6 years of age when use this product to avoid swallowing. Other information: Store between 15-30C (59-86F). Avoid freezing and excessive heat above 40C (104F). Inactive ingredients: Deionized Water, Aloe Barbadensis Extract, Carbomer, Arginine. Distributed by: Dearskin LLC, FL.']\n{'Brand': 'Dearskin', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '24', 'Special Feature': 'Not Tested On Animals, Travel Size, Moisturizer', 'Scent': 'Aloe Vera', 'Product Dimensions': '5 x 4 x 4 inches; 2.36 Ounces', 'UPC': '850005863359', 'Manufacturer': 'Dearskin'}\nThis hand sanitizer works great. It isn't too sticky and a little goes a long way. Great value for the price. So easy to use and love the high alcohol continent to keep germs away for myself and my family! Perfect for each family member to keep in their pocket!\nLove these little bottles\nGel Nail Polish Set, Holiday Red Black 6 Colors Gel Polish Kit Popular Nail Art Design Soak Off LED Lamp Nail Polish Gel Manicure Kit Gifts Set for Girls Women Professional DIY Home Use\nAnzuo\n{'Brand': 'Anzuo', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '6.00 Count', 'Number of Items': '6', 'Package Dimensions': '5.4 x 3.7 x 3.3 inches; 8.78 Ounces', 'Item model number': 'FZ', 'UPC': '738626208554'}\nEasy to use and colors are super vibrant. Lasts about 2 weeks and comes off with nail drill. Love the variety of colors and highly recommend this for any at home nail diy!\nPerfect for winter and holidays\nPortable Travel Bottles Keyring Fruit Holders 50ml Refillable Empty Containers Perfect for Kids to Carry Hand Sanitiser (4pcs)\nPetSinc\n{'Package Dimensions': '7.4 x 5.47 x 1.81 inches; 3.53 Ounces', 'UPC': '782910026546'}\nSuper cute for kiddos! They're refillable so strap them onto their backpacks or lunch boxes so they use them often! Great for gifting as party favors or even stocking suffers.\nCute for kiddos",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Growom Garden Hose Nozzle 4 Adjustable Spray Patterns Garden Sprayer Heavy Duty Metal Hose Nozzle with 3 Washers for Gardening, Car Washing, Pet Bathing and General Cleaning\nReview Date: 2019/09/13\nStore: Growom\nAverage Rating: 3.1\nProduct Details: {'Brand': 'Growom', 'Finish Type': 'Polished', 'Material': 'Heavy,Metal', 'Handle Type': 'Lever', 'Package Dimensions': '8.3 x 4.6 x 1.7 inches; 1.15 Pounds'}\nReview Text: This nozzle is super built to last. It’s rather heavy but I know it will withstand the much abuse. My only worry is we have hard water and sometimes that eats away at our nozzles over time. Great product that will last though!\nReview Title: Super heavy duty\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Beachwaver Co. Dual Voltage, S1, White\nReview Date: 2019/09/15\nAverage Rating: 4.5\nProduct Details: {'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nReview Text: First off, I know it pricey for a curling iron but it actually does the trick and is pretty cool. You clip your hair in the bottom little clipper and I prefer the low speed and it winds your hair for you up the wand! It gets nice and hot and curls did stay well after hrs or wear in semi humid weather. Definitely takes a little getting use to but it’s pretty cool. You do need to take slightly smaller sections of hair to curl so the clipper can hold it but I really enjoyed using this!\nReview Title: I was skeptical but this is super amazing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nReview Date: 2020/02/05\nStore: JPNK\nAverage Rating: 4.1\nProduct Details: {'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nReview Text: I love these combs not only for myself but for my daughters hair. They are perfect for any hair length or texture as you have a set of 4 from wide tooth to fine tooth. They feel nice on the scalp and glide through hair easily. These are a great deal for 4 of these!\nReview Title: Great detangler combs\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Magnesium Serum For Kids - All Natural Rub for Kids and Babies, Toxic Free + Free Magnesium Chart PDF\nReview Date: 2020/02/07\nStore: Raise Them Well\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Raise Them Well', 'Item Form': 'Liquid', 'Unit Count': '2 Fl. Oz', 'Flavor': 'Unflavored', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 1.5 x 1.5 inches; 3.2 Ounces', 'UPC': '853647007044', 'Manufacturer': 'Raise Them Well'}\nReview Text: Unfortunately I didn't notice much different with this spray. I think it smells nice and it a great idea to calm kiddos but I fine essential oil rollers on the bottom of the feet to have more contact with the skin making them more effective.\nReview Title: Didn't notice any difference\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pick & Pick (Gentle/metal allergy free material)\nReview Date: 2020/02/29\nStore: MIND UP\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '7 x 1.2 x 0.5 inches; 0.63 Ounces'}\nReview Text: I was hopeful for this pick but disappointed. First off, it's a super flimsy and you can't use much pressure when pressing against teeth. Also, the pointed end that is supposed to clear put any food from between the teeth isn't pointed enough so you can't really get in there all the way. Last, because you cannot put enough pressure to scrape off gunk, it becomes useless.\nReview Title: Way to flimsy\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Pack Soft Headband BEoffer Coral Fleece Women Makeup Spa Head Bands Turban Fashion Bow Bowknot Hairlace Headwear Wash Face Hair Holder Elastic Top Knot Bandage Girl Baby Hair Accessories 6 Colors\nReview Date: 2020/03/15\nStore: BEoffer\nAverage Rating: 4.6\nProduct Details: {'Age Range (Description)': 'Baby', 'Material': 'Elastic', 'Fabric Type': 'Fleece', 'Number of Items': '6', 'Recommended Uses For Product': 'Face Makeup', 'Product Dimensions': '7.28 x 1.97 x 0.67 inches; 1.16 Ounces', 'Item model number': 'BH-002', 'UPC': '799899729252'}\nReview Text: These super cute headbands are perfect for washing you face at the end of the night, making sure all the hair stays out for your face, and when I am applying my sunscreen in the morning so it doesn't get in my hair. They are super soft and come in a variety of colors!!!\nReview Title: Perfect for washing face\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hairdresser Scissors Set Hair Thinning Scissors Hairdressing Shears Set with Wipe Cloth,Grinding card, Hair Razor Comb, Clips, Upgraded Professional Haircut Set black\nReview Date: 2020/06/27\nStore: Lyeiaa\nProduct Description: ['All-in-One Hair Cutting Kit :1 x Hair Scissor,1 x Grinding card,1 x Hair Razor Comb, 1 x Cleaning Cloth, 1 x Comb, 2 x Hairpin clips , 1 x Neck Duster. The hair cutting kit meets all your hair cutting and styling needs.']\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Lyeiaa', 'Included Components': 'Scissors', 'Unit Count': '1 Count', 'Package Dimensions': '8.94 x 4.09 x 1.54 inches; 12.73 Ounces', 'UPC': '303276761980', 'Manufacturer': 'Lyeiaa'}\nReview Text: This kit is my favorite one I've purchased. I cut my kids and husband's hair and this is everything you will need! Comes in a nifty little case that holds it all together. The cape is perfect for minimizing hairs everywhere. The scissors and thinning sheers are super sharp and use with minimal effort. So far this is the best kit I am using and would recommend to anyone.\nReview Title: All in one kit\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Winky Lux Double Matte Whip 24-Hour Waterproof Lipstick, Liquid Wet Lipstick for Long-Lasting Matte Lip Color, Hydrating Makeup with Vanilla and Avocado Oil to Lock in Moisture, 0.14 Oz, Cookie\nReview Date: 2020/07/08\nStore: Winky Lux\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Winky Lux', 'Color': 'Cookie', 'Skin Type': 'All', 'Item Form': 'Liquid', 'Finish Type': 'Matte', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.65 x 0.65 x 4.28 inches; 0.14 Ounces', 'UPC': '859346006968'}\nReview Text: This pretty color goes on wet and dries down to a very pretty medium brown. I have light olive skin and found it very complementary to my skintone. Not too dark that it's a nighttime look but dark enough that it looks like I'm wearing something. Stays on pretty well and I will definitely be buying more\nReview Title: Pretty neutral shade\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Magnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nReview Date: 2020/07/10\nStore: Eyenjoy\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nReview Text: I had to keep reapplying the magnetic eyeliner especially in the corners of my eyes where it maybe got wet from blinking. I didn't feel like I could go out without the eyeliner in my purse to reapply everything I had a mirror. To me that just too much work then and you might as well use regular lashes.\nReview Title: Don't stay well\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nReview Date: 2020/07/14\nStore: CIMIY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nReview Text: We use aloe a lot in our house as my daughter is constantly scraping her knees. This aloe has a nice push too for easy use and it a pretty decent value size. No strong smell and dries fast. Great buy.\nReview Title: Nice bottle for easy use\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bloomy Essentials Organic Tea Tree Essential Oil 10 mL - USDA Certified Organic - Hair, Skin, Toenail Fungus, and Acne - 100% Pure\nReview Date: 2020/07/19\nStore: Bloomy Essentials\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Bloomy Essentials', 'Scent': 'Tea Tree', 'Special Feature': 'Pure', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Package Dimensions': '5 x 3 x 0.75 inches; 1.59 Ounces', 'UPC': '680912084581', 'Manufacturer': 'Bloomy Essentials'}\nReview Text: Fairly good sized bottle and price. Oil consistency was pretty good snd I found the scent to be right on. Smells great!\nReview Title: Smells great\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nReview Date: 2020/07/21\nStore: Sdara Skincare\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nReview Text: I like this aloe because it speaks easily and absorbs into the skin quickly. Its so hard to keep still letting it fully dry but this one doesn't take long at all. I like the lack for a strong scent and natural ingredients.\nReview Title: Spreads easily\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2oz / 60ml Glass Spray Bottles for DIY Refill, Essential Oils, Pillow Mists,Fine Mist Spray -3Packs Amber Color\nReview Date: 2020/09/06\nStore: EagleKing\nAverage Rating: 4.5\nProduct Details: {'Brand': 'EagleKing', 'Material': 'Glass', 'Capacity': '2 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray', 'Package Dimensions': '6.3 x 6.1 x 1.7 inches; 8.78 Ounces'}\nReview Text: I used these bottles to make my own essential oil room sprays for the bathroom. They are the perfect smaller size to fit on the back of the toilet and last forever as you only need one or two sprays. Sprayer lasts well in addition to the pump. Amber color is perfect for keeping essential oils good for a long time! Great purchase!\nReview Title: DIY essential oil spray\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Empty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nReview Date: 2020/09/06\nStore: Cherry\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nReview Text: I used these bottles to make my own essential oil room sprays for the bathroom. They are the perfect larger size to fit on the back of the toilet and last forever as you only need one or two sprays. Sprayer lasts well in addition to the pump. Amber color is perfect for keeping essential oils good for a long time! Great purchase!\nReview Title: Awesome room sprayer\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aloe Hand Sanitizer 24 Pack Dearskin Aloe Vera Moisturizing Alcohol 75% Gel 2 Fl Oz/60ml Skin Care Natural Advanced Formula Alcohol Refreshing Moisturizing with Argine.\nReview Date: 2020/11/18\nStore: Dearskin\nProduct Description: ['24 Pack Dearskin Hand Sanitizer 60ml, 2 Fl Oz', 'Dearskin Hand sanitizer Kills 99.9% of the most common germs!', '- Clean and Refreshing Moisturizing;', '- Long-Lasting Antibacterial;', '- Easy to use, hard to waste; -', '75% Alcohol;', 'Drug Facts: Active ingredients: - Alcohol 75% v/v. Antiseptic. Use: Hand sanitizer to help reduce bacteria that potentially can cause disease. For use when soap and water are not available. For external use only. Flammable. Keep away from or flame. Do not use: - In children less than 2 months of age. - On open skin wounds. When using this product keep out of eyes, and mouth. In case of contact with eyes, rinse eyes thoroughly with water. Stop use and ask a doctor if irritation or rash occurs. These may be sings of a serious condition. Keep out of reach of children. If swallowed, get medical help or contact a Poison Control Center right away. Directions: - Place enough product on hands to cover all surfaces. Rub hands together until dry. - Supervise children under 6 years of age when use this product to avoid swallowing. Other information: Store between 15-30C (59-86F). Avoid freezing and excessive heat above 40C (104F). Inactive ingredients: Deionized Water, Aloe Barbadensis Extract, Carbomer, Arginine. Distributed by: Dearskin LLC, FL.']\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Dearskin', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '24', 'Special Feature': 'Not Tested On Animals, Travel Size, Moisturizer', 'Scent': 'Aloe Vera', 'Product Dimensions': '5 x 4 x 4 inches; 2.36 Ounces', 'UPC': '850005863359', 'Manufacturer': 'Dearskin'}\nReview Text: This hand sanitizer works great. It isn't too sticky and a little goes a long way. Great value for the price. So easy to use and love the high alcohol continent to keep germs away for myself and my family! Perfect for each family member to keep in their pocket!\nReview Title: Love these little bottles\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gel Nail Polish Set, Holiday Red Black 6 Colors Gel Polish Kit Popular Nail Art Design Soak Off LED Lamp Nail Polish Gel Manicure Kit Gifts Set for Girls Women Professional DIY Home Use\nReview Date: 2020/12/16\nStore: Anzuo\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Anzuo', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '6.00 Count', 'Number of Items': '6', 'Package Dimensions': '5.4 x 3.7 x 3.3 inches; 8.78 Ounces', 'Item model number': 'FZ', 'UPC': '738626208554'}\nReview Text: Easy to use and colors are super vibrant. Lasts about 2 weeks and comes off with nail drill. Love the variety of colors and highly recommend this for any at home nail diy!\nReview Title: Perfect for winter and holidays\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Portable Travel Bottles Keyring Fruit Holders 50ml Refillable Empty Containers Perfect for Kids to Carry Hand Sanitiser (4pcs)\nReview Date: 2020/12/16\nStore: PetSinc\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '7.4 x 5.47 x 1.81 inches; 3.53 Ounces', 'UPC': '782910026546'}\nReview Text: Super cute for kiddos! They're refillable so strap them onto their backpacks or lunch boxes so they use them often! Great for gifting as party favors or even stocking suffers.\nReview Title: Cute for kiddos\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n1. **Gardening and Home Outdoors**: Strong interest in durable, heavy-duty tools designed for gardening and cleaning, indicating a focus on quality and longevity in outdoor products.\n\n2. **Hair Care and Styling**: Frequent purchases of hair styling tools and accessories, demonstrating a preference for innovative products that ease hair management, as well as a willingness to invest in quality items for family hair care.\n\n3. **Skincare and Natural Products**: Regular selection of skin-friendly and organic skincare items, particularly those incorporating natural ingredients like aloe vera and essential oils, suggesting a focus on health and wellness.\n\n4. **DIY and Customization**: Engagement in DIY practices, especially with essential oils and personal care products, implying a creative approach to self-care and a desire for personalized solutions.\n\n5. **Family-oriented Purchases**: Multiple family-focused items, such as children's hair tools and protective skincare, highlighting a commitment to family well-being and multi-user products.\n\n6. **Fashion and Aesthetics**: Interest in cosmetic products, including makeup and accessories, indicating a trend towards maintaining a polished appearance through vibrant colors and unique styles.\n\n7. **Value-driven Choices**: Consistent preference for products that offer good value for money, demonstrating a balancing act between quality and affordability across various categories.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Not a winner",
    "text": "Had high hopes for this but it didn't work for me. I think the barrel itself it too big to really get good results. It was rather uncomfortable and honestly for the time it took to do it I could have just curled my hair.",
    "images": [],
    "asin": "B09FQC3MD2",
    "parent_asin": "B09FQC3MD2",
    "user_id": "AESCUI6VXJSHLUIO44Y5ERAHZE4A",
    "timestamp": "2022-05-25 19:42:42.734000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Tik Tok Women Heatless Curling Rod Headband For Natural Wave and Large Curls,Sleeping Curls Silk Ribbon Hair Rollers, DIY Hair Styling Tools Kit For Long Medium Hair,Contains two different No Heat Curl Ribbon with Hair Clips and Scrunchie",
    "average_rating": 3.7,
    "rating_number": 82,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51KIOeStwpL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51KIOeStwpL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81Bc08n4kjL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/416e7UumiWL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/416e7UumiWL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61L-cKlG2oL._SL1311_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41DcvA1jR-L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41DcvA1jR-L.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/51ffawJf4yL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51SIhrHqGtL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51SIhrHqGtL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/811ehcXRnSL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/517Bzp4dJ1L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/517Bzp4dJ1L.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71HpSxtRsVL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5121pGyXZ1L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/5121pGyXZ1L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/814euO1I0-L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51l9cE8U+UL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51l9cE8U+UL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71UlERmUK1L._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "No Heat Curl Ribbon",
        "url": "https://www.amazon.com/vdp/0624093d0746430688e8efa4c15d75b1?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Sleeping Hair Curls",
        "url": "https://www.amazon.com/vdp/04775b54a8f240fe8a876c9fa2d36697?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": " Heatless Curling Rod",
        "url": "https://www.amazon.com/vdp/0c242bd7265a4a16a885d6e011d71b1d?ref=dp_vse_rvc_2",
        "user_id": ""
      },
      {
        "title": "Heatless Hair Curler",
        "url": "https://www.amazon.com/vdp/01f0bc73c12344c8a3678ea677246b36?ref=dp_vse_rvc_3",
        "user_id": ""
      },
      {
        "title": "The effect of curling iron for 4 hours",
        "url": "https://www.amazon.com/vdp/02896a7eeb3e49a3ae967a90c3ac2606?ref=dp_vse_rvc_4",
        "user_id": ""
      },
      {
        "title": "Heatless Curling Headband",
        "url": "https://www.amazon.com/vdp/0c02e65a796d48d795773e080ee55492?ref=dp_vse_rvc_5",
        "user_id": "/shop/influencer-48205302"
      }
    ],
    "store": "EMOET",
    "categories": [],
    "details": {
      "Item Form": "Clip",
      "Hair Type": "Natural Wave,Curls,Natural Curls",
      "Number of Items": "1",
      "Material": "Silk",
      "Size": "1 Count (Pack of 1)",
      "Package Dimensions": "10.79 x 6.06 x 3.66 inches; 5.93 Ounces",
      "UPC": "747165736596"
    },
    "bought_together": null
  }
}