{
  "user_id": "AECTRGMRKOGAYIV3YXX73CQEQCSQ",
  "summary": "=== Purchase Information ===\nProduct Title: Degree Male Adrenaline Series Anti-Perspirant and Deodorant Invisible Solid for Men, Overtime, 2.7 Ounce\nReview Date: 2014/04/24\nStore: DEGREE MENS DEO\nAverage Rating: 3.2\nProduct Details: {'Brand': 'DEGREE MENS DEO', 'Item Form': 'Solid', 'Scent': 'Cool Rush', 'Unit Count': '2.7 Ounce', 'Product Dimensions': '2.72 x 1.2 x 5.74 inches; 4.48 Ounces', 'Manufacturer': 'Unilever'}\nReview Text: Exactly as advertised.  Lasted all day with great odor and wetness protection.  I also appreciated that the scent was subtle enough not to compete with my cologne.  I'll be buying this again.\nReview Title: Great, all day protection with a pleasantly subtle scent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: essie Nail Polish, Glossy Shine Finish, Let It Glow, 0.46 fl. oz.\nReview Date: 2017/10/10\nStore: essie\nProduct Description: ['Product Description', 'get deserted in a fiery coral glistening with copper shimmer. DBP, Toluene, and Formaldehyde free provides flawless coverage along with outstanding durability inspired by the natural earth tone hues found in the desert America’s nail salon expert. since 1981become captivated by the desert’s optical illusions and transport yourself with our Essie desert mirage collection. From the warm morning sunrise to the hot sunsets, this collection brings to life the natural earth tone hues found in the desert. But regardless of temperature, these shades are guaranteed to keep you hot all season long!use apricot cuticle oil, Essie base coat, 2 coats of Essie polish, and seal with Essie top coat.Caution: keep from heat or flame.', 'Brand Story', 'For more than 30 years, essie has been an industry icon, trusted by beauty professionals, celebrities and even royalty – an American classic that allows women all over the world to express themselves and have fun with color.']\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Essie', 'Item Form': 'Liquid', 'Color': 'Let It Glow', 'Finish Type': 'Glossy', 'Special Feature': 'On-trend color with flawless coverage and outstanding durability. DBP, Toluene and Formaldehyde free', 'Material Feature': 'Formaldehyde free, Cruelty Free', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Number of Pieces': '1', 'Liquid Volume': '14 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.14 x 1.14 x 2.7 inches; 1.59 Ounces', 'Item model number': 'ES2787', 'UPC': '095008027876', 'Manufacturer': 'essie'}\nReview Text: The color shift isn't quite as pronounced in person, but it's still super pretty. In good light, the pink color flashes copper. The wear time is good too. The picture is after three days of wear and it still looks excellent.\nReview Title: Pink shifts to copper!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: BeautyBio GloPRO Regeneration Tools\nReview Date: 2018/12/07\nAverage Rating: 4.3\nProduct Details: {'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nReview Text: I've been in the market for a microneedling device for a while now, but I wasn't sure if I needed something super expensive or if I could get away with a more budget-friendly option. I decided to try two super inexpensive versions , both costing around $20 and see if this significantly more expensive option from GloPRO was really worth it. In short, yes. Both of the cheaper options were incredibly painful and flimsy feeling. One of them even felt kind of like getting a face tattoo. It was awful. The GloPRO option actually feels nice on the skin because of the vibration feature and the red light therapy is a huge benefit for those monthly breakouts. I do feel like my skin care is absorbing more effectively since I've been using this, but it's still an extremely expensive tool. If you really want a microneedling device, in my opinion this is worth the investment, however, I don't think it's a necessary item.\nReview Title: Super pricey, but much better than the budget-friendly alternatives\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Makeup Blender Sponge Set - 4 Pack Latex Free Q-Soft Makeup Beauty Foundation Blending Sponge Flawless Smooth Brush for Liquid Foundation BB Creams Powders Concealer (4 Pack)\nReview Date: 2019/02/11\nStore: FRESHME\nAverage Rating: 3.9\nProduct Details: {'Brand': 'FRESHME', 'Color': 'Ivory', 'Material': 'Rubber', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.6 x 3.6 x 1.4 inches; 1.59 Ounces', 'UPC': '681413196902', 'Manufacturer': 'FRESHME'}\nReview Text: I'm not a complete beauty sponge snob and I've tried lots of different brands, both high-end and budget friendly, and I found sponges I liked at both price points. These sponges are definitely on the farmer side, so for that reason they aren't my favorite. They do expand when wet and I really do like the shape of the larger ones in this set--they are very similar to the Real Techniques sponges--but they're just not as soft and bouncy as some of the others that I prefer. If you're looking for a good drugstore-priced sponge I recommend the Loreal ones.\nReview Title: Kind of firm but good shapes\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2019 Newest Nose Hair Trimmer for Men Women MASWATER Professional Electric Nose Ear Hair Trimmer Clipper Painless Wet/Dry Trimming Premium Quality Stainless Steel Dual-Edge Blades Won't Break!\nReview Date: 2019/03/04\nStore: maswater\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Maswater', 'Recommended Uses For Product': 'Nose,Facial Hair,Beards,Grooming,Trimmer,Professional', 'Power Source': 'Battery Powered', 'Included Components': 'Clipper, Battery', 'Color': 'Silver', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 5 inches; 2.4 Ounces', 'Batteries': '1 AA batteries required.', 'UPC': '699949549697', 'Manufacturer': 'MASWATER'}\nReview Text: I didn't have great success with his nose hair trimmer. First off it does pull despite claiming not to. It's not incredibly painful but every now and then it would snag and Pull and I did enjoy that. Also it didn't seem to do the best job getting all the hairs. I had one here that I was trying to get and I had to go over it several times and it just wouldn't seem to trim it. It's not super expensive so it's not a complete fail for me but I'm not going to be using this a lot unless I really need to. It also heats up relatively quickly.\nReview Title: It does pull and it doesn't get every hair.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TOUCH IN SOL No Pore Blem Priming Eraser - Face Makeup Easy Grip Stick Primer with Smudging Cushion Tip, Concealing Pores and Fine Lines, Sebum Control and Skin Smooth & Velvety Finish\nReview Date: 2020/01/19\nStore: Touch in Sol\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Touch in Sol', 'Skin Type': 'All', 'Package Information': 'Tube', 'Item Volume': '1 Milliliters', 'Specialty': 'Moisturizing, Cruelty Free, Vegan', 'Item model number': 'P813614'}\nReview Text: I tried a few other products and they no poreblem line and overall I'm pretty impressed. It swipes on and does a decent job of minimizing pores. It's not as effective as my cover FX pore filling primer or my tarte pore filling primer but I do like the convenience of having this in a pen.\nReview Title: Pretty decent\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ionic Hair Dryers for Women 1800W Blow Dryer with Diffuser Hot and Cool Settings Speed Adjustable Negative Ion Hair Dryer with 2 Concentrators,1 Hair Scalp Massager Brush for Curly Hair(LTD Edition)\nReview Date: 2020/07/20\nStore: Lassie\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Lassie', 'Power Source': 'Corded Electric', 'Hair Type': 'Curly', 'Number of Speeds': '2', 'Product Dimensions': '11.4 x 9.4 x 3.7 inches; 2.43 Pounds', 'Manufacturer': 'Lassie'}\nReview Text: They're quite a few of these hair dryers popping up that are designed to look like the ridiculously expensive Dyson. While I've never tried the Dyson, I was excited by the design and so I picked this one up. On the plus side it does have an extremely long cord so if you can't stand right directly next to you anymore you'll be fine but it is not a swivel cord so it's not as maneuverable as others. It's not a huge deal for me but just something to be aware of. I love the hat and cold functions which makes it really nice to set your hair at the end and seal in the style. If you've only ever used regular hair dryers you'll really appreciate this added feature. It's a pretty substantial hair dryer. If you're used to really inexpensive lightweight ones you'll notice the additional weight however it's not so heavy that your arm will get tired even if you have a ton of hair like I do. And I just have to go back to the overall style and design again because this hair dryer looks so sleek and cool. I get a kick out of using it every time I see it.\nReview Title: Beautiful Dyson style design and pretty impressive hair dryer too\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Marshique Touch Fit Glitter Cream Shadow 0.2Oz (Gold Beige White Clear Skin Tone Shiny mood) - Champagne Gold Pearl, Sparkle Eyeshadow, Waterproof and Longlasting for Under fat eye\nReview Date: 2020/07/23\nStore: Marshique\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Marshique', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Luminous,Shiny,Sheer,Glitter,Shimmer', 'Number of Items': '1', 'Coverage': 'Light', 'Package Dimensions': '1.61 x 1.61 x 0.74 inches; 0.2 Ounces', 'Item model number': '0000'}\nReview Text: I'm not generally a huge fan of cream shadows but I wanted to give this one a try and I'm so happy I did. It is so glimmery and beautiful. My favorite way to wear this is just padded over a bear eyelid with some mascara and maybe a little bit of liner. It just adds a beautiful finished touch. It also looks really lovely tapped on top of eyeshadow. For that method I prefer my finger versus a brush. It's nice because it doesn't bunch up or overly crease. And I really like the airtight packaging as well.\nReview Title: Such a beautiful cream shadow\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nReview Date: 2020/08/30\nStore: RAREKIND\nAverage Rating: 3.8\nProduct Details: {'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nReview Text: This is so beautiful! I love the packaging and the color was really rich and a beautiful tone on my skin. Oftentimes reds can be too warm or too cool and this is just the right amount of warmth for me. It's very comfortable to wear and was nice and long wearing without being drying. and then I was really pleased with how beautifully it faded after a very long time. I'm excited to try different shades in this formula.\nReview Title: Super comfortable, long wearing, and fades beautifully\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nReview Date: 2020/09/24\nStore: AILIWEI\nAverage Rating: 3.7\nProduct Details: {'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nReview Text: This is a better than average costume wig. The hair does have that typical slight plastic sheen but it's not nearly as noticeable as others I've seen especially blonde wigs. There's a good amount of hair here as well so it's not one of those wigs that gets wispy towards the ends. The part hairline could look a little better but if you fiddle with it you can make it look pretty good. All in all this is going to be a great wig for my Hocus Pocus costume.\nReview Title: Pretty good blonde costume wig\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Claw Hair Clips, IKOCO 6 Pack Jaw Clips Stylish Matte Plastic Strong Hold Hair Clamps Box Packaged for Thin Fine Hair with 10Pcs Black Hair ties (2.4Inch)\nReview Date: 2020/12/19\nStore: IKOCO\nAverage Rating: 4.4\nProduct Details: {'Brand': 'IKOCO', 'Hair Type': 'Fine', 'Color': 'Green,Grey', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal, Acrylic', 'Product Dimensions': '6.25 x 4.25 x 2 inches; 5.89 Ounces'}\nReview Text: These are much larger in person than I was expecting but they're perfect if you have a lot of hair or long hair or you want to be able to clip a bun securely on your head. They feel like they are quite sturdy as well. I always break my clips and I think I'm going to have a hard time breaking these. I also appreciate the included hair ties!\nReview Title: Sturdy and great if you have a lot of hair\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, Milantia 3/4 Inch Mini Travel Curling Wand Hair for Small Curly, Dual Voltage Ceramic Tourmaline 19mm Crimper Hair Iron for Women - Fast Heating, Portable\nReview Date: 2020/12/27\nStore: Milantia\nAverage Rating: 3.8\nProduct Details: {'Shape': 'Barrel', 'Brand': 'Milantia', 'Hair Type': 'All,Thick,Thin', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Product Dimensions': '9.25 x 1.97 x 1.97 inches; 12.63 Ounces', 'Manufacturer': 'Milantia'}\nReview Text: The product images for this curling wand are deeply misleading. It shows the curling iron on a model's hair and it looks like an average sized curling wand with three barrels. No, in person this thing is so tiny. It honestly looks like a curling iron for dolls. As you can see in my photo I'm using a pencil for scale. Each of these barrels is about a pencil and a half to two pencils big. Meaning that the type of curls you get are more like 1920s finger waves than anything you would probably want to wear today. It's just ridiculous.\nReview Title: Is this a curling wand for dolls? So tiny!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 5-Pack Hair Scalp scrubber Massager Shampoo Brush for Straight Curly Long Short Thick Thin Wet Dry Hair, Men Women Kids Scalp Care Hair Cleaning Shower, Scalp Care Brush,100% comfortable\nReview Date: 2021/02/19\nStore: Teqifu\nAverage Rating: 4.3\nProduct Details: {'Material': 'Silicone', 'Brand': 'Teqifu', 'Color': 'Pink, Blue', 'Package Dimensions': '8.78 x 7.68 x 2.87 inches; 8.78 Ounces', 'UPC': '608571756465', 'Manufacturer': 'Teqifu'}\nReview Text: This is exactly what I was looking for in a scalp scrubber. It has a fairly comfortable to hold handle which makes this easy to hang on to and not slip out of your hands even if you have super slippery shampoo. The bristles are firm enough but very flexible so they're quite comfortable on the scalp. I also love that you get so many colors here! I was able to gift several to my family and still have one for myself.\nReview Title: Exactly what I wanted\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyebrow Pencil 3 Pcs Waterproof Dark Brown Long Lasting Eyebrow Makeup Pen with 4 Fork Tips Head Upgrade Design\nReview Date: 2021/05/13\nStore: Marine Forest\nAverage Rating: 3.3\nProduct Details: {'Brand': 'Marine Forest', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Long Lasting', 'Package Dimensions': '4.88 x 2.17 x 0.79 inches; 1.6 Ounces', 'UPC': '729843551950'}\nReview Text: I am shocked. I was kind of expecting this to be a mess but I was curious so I decided to try it. This works exceptionally well. I have tried some of these little three-pronged brow markers in the past and never been very impressed. These have enough stability to them that you really can flick and get straight little lines that look just like hairs. They are thin and you have actual control. This formula also lasts forever! I definitely have to use makeup remover to get it off, so it is for sure waterproof. I also like that this color isn't pulling red on me. So often browns do that but this is nice and dark and definitely neutral. The only complaint I have is that when I open these there was a little bit of ink that had leaked out around the applicator at the top so it looked a little messy, but I love the way this works so much I don't care One thing to note is that it's best to put this on before you use any other wax or gels to keep your brow hairs in place. This really doesn't work well on top of anything but dry plain skin.\nReview Title: This stuff looks great and it lasts forever on your eyebrows\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Oralphi Soft Tapered Toothbrush, with Super Tapered Bristles for Periodontal Pocket Care (4 Count, Full Head)\nReview Date: 2021/06/21\nStore: Oralphi\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Oralphi', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Material Feature': 'Reusable', 'Unit Count': '4.00 Count', 'Package Dimensions': '7.87 x 4.92 x 0.67 inches; 4.66 Ounces', 'Manufacturer': 'Oralphi'}\nReview Text: This is a decent set of toothbrushes. As advertised the bristles are soft though not as soft as some of the bamboo toothbrushes I've tried. I actually prefer this level of softness. The handles are ergonomic and easy to hold and I appreciate that they come and assortment of colors so if several of you are using this at once in the same bathroom it's easy to tell whose is whose\nReview Title: The right level of softness for me\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Besame Cosmetics | Forever Red Lipstick - 1925 | Classic Color Lipstick | Vintage Makeup | Long Lasting Lipstick | Semi Matte Lipstick for Women | Moisturizing Lipstick for Sensitive Skin\nReview Date: 2022/02/06\nStore: BESAME COSMETICS\nAverage Rating: 4.4\nProduct Details: {'Brand': 'BESAME COSMETICS', 'Skin Type': 'All', 'Item Form': 'Powder', 'Finish Type': 'Semi Matte', 'Product Benefits': 'Hydrating,Long Lasting,Nourishing,Clean,Moisturizing,Makeup', 'Package Dimensions': '4.45 x 1.14 x 1.06 inches; 0.74 Ounces'}\nReview Text: I'm a big fan of the style of this brand and have been for years. There's something about the vintage aesthetic that they capture so perfectly that always draws me in. I wasn't sure what I would think about their actual lipsticks however because of the bullet style is so unusual, but I really love this. The formula is creamy but long-lasting and even leaves a little bit of a stain, and the color is just the perfect red in my opinion it's a slightly deeper red so it feels a little more sophisticated and a little more wearable than a brighter red. It also has a slight blue base to it which makes your teeth look a little wider. The packaging is absolutely lovely and I actually find that I really enjoy the style of the lipstick bullet. I still always wear a lip liner of course but the angle of this makes it really easy to fully coat your lips. I will absolutely be buying more lipsticks from this brand.\nReview Title: Vintage style, timeless color\nRating: 5.0\n--------------------------------------------------",
  "reference": "Degree Male Adrenaline Series Anti-Perspirant and Deodorant Invisible Solid for Men, Overtime, 2.7 Ounce\nDEGREE MENS DEO\n{'Brand': 'DEGREE MENS DEO', 'Item Form': 'Solid', 'Scent': 'Cool Rush', 'Unit Count': '2.7 Ounce', 'Product Dimensions': '2.72 x 1.2 x 5.74 inches; 4.48 Ounces', 'Manufacturer': 'Unilever'}\nExactly as advertised.  Lasted all day with great odor and wetness protection.  I also appreciated that the scent was subtle enough not to compete with my cologne.  I'll be buying this again.\nGreat, all day protection with a pleasantly subtle scent\nessie Nail Polish, Glossy Shine Finish, Let It Glow, 0.46 fl. oz.\nessie\n['Product Description', 'get deserted in a fiery coral glistening with copper shimmer. DBP, Toluene, and Formaldehyde free provides flawless coverage along with outstanding durability inspired by the natural earth tone hues found in the desert America’s nail salon expert. since 1981become captivated by the desert’s optical illusions and transport yourself with our Essie desert mirage collection. From the warm morning sunrise to the hot sunsets, this collection brings to life the natural earth tone hues found in the desert. But regardless of temperature, these shades are guaranteed to keep you hot all season long!use apricot cuticle oil, Essie base coat, 2 coats of Essie polish, and seal with Essie top coat.Caution: keep from heat or flame.', 'Brand Story', 'For more than 30 years, essie has been an industry icon, trusted by beauty professionals, celebrities and even royalty – an American classic that allows women all over the world to express themselves and have fun with color.']\n{'Brand': 'Essie', 'Item Form': 'Liquid', 'Color': 'Let It Glow', 'Finish Type': 'Glossy', 'Special Feature': 'On-trend color with flawless coverage and outstanding durability. DBP, Toluene and Formaldehyde free', 'Material Feature': 'Formaldehyde free, Cruelty Free', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Number of Pieces': '1', 'Liquid Volume': '14 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.14 x 1.14 x 2.7 inches; 1.59 Ounces', 'Item model number': 'ES2787', 'UPC': '095008027876', 'Manufacturer': 'essie'}\nThe color shift isn't quite as pronounced in person, but it's still super pretty. In good light, the pink color flashes copper. The wear time is good too. The picture is after three days of wear and it still looks excellent.\nPink shifts to copper!\nBeautyBio GloPRO Regeneration Tools\n{'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nI've been in the market for a microneedling device for a while now, but I wasn't sure if I needed something super expensive or if I could get away with a more budget-friendly option. I decided to try two super inexpensive versions , both costing around $20 and see if this significantly more expensive option from GloPRO was really worth it. In short, yes. Both of the cheaper options were incredibly painful and flimsy feeling. One of them even felt kind of like getting a face tattoo. It was awful. The GloPRO option actually feels nice on the skin because of the vibration feature and the red light therapy is a huge benefit for those monthly breakouts. I do feel like my skin care is absorbing more effectively since I've been using this, but it's still an extremely expensive tool. If you really want a microneedling device, in my opinion this is worth the investment, however, I don't think it's a necessary item.\nSuper pricey, but much better than the budget-friendly alternatives\nMakeup Blender Sponge Set - 4 Pack Latex Free Q-Soft Makeup Beauty Foundation Blending Sponge Flawless Smooth Brush for Liquid Foundation BB Creams Powders Concealer (4 Pack)\nFRESHME\n{'Brand': 'FRESHME', 'Color': 'Ivory', 'Material': 'Rubber', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.6 x 3.6 x 1.4 inches; 1.59 Ounces', 'UPC': '681413196902', 'Manufacturer': 'FRESHME'}\nI'm not a complete beauty sponge snob and I've tried lots of different brands, both high-end and budget friendly, and I found sponges I liked at both price points. These sponges are definitely on the farmer side, so for that reason they aren't my favorite. They do expand when wet and I really do like the shape of the larger ones in this set--they are very similar to the Real Techniques sponges--but they're just not as soft and bouncy as some of the others that I prefer. If you're looking for a good drugstore-priced sponge I recommend the Loreal ones.\nKind of firm but good shapes\n2019 Newest Nose Hair Trimmer for Men Women MASWATER Professional Electric Nose Ear Hair Trimmer Clipper Painless Wet/Dry Trimming Premium Quality Stainless Steel Dual-Edge Blades Won't Break!\nmaswater\n{'Brand': 'Maswater', 'Recommended Uses For Product': 'Nose,Facial Hair,Beards,Grooming,Trimmer,Professional', 'Power Source': 'Battery Powered', 'Included Components': 'Clipper, Battery', 'Color': 'Silver', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 5 inches; 2.4 Ounces', 'Batteries': '1 AA batteries required.', 'UPC': '699949549697', 'Manufacturer': 'MASWATER'}\nI didn't have great success with his nose hair trimmer. First off it does pull despite claiming not to. It's not incredibly painful but every now and then it would snag and Pull and I did enjoy that. Also it didn't seem to do the best job getting all the hairs. I had one here that I was trying to get and I had to go over it several times and it just wouldn't seem to trim it. It's not super expensive so it's not a complete fail for me but I'm not going to be using this a lot unless I really need to. It also heats up relatively quickly.\nIt does pull and it doesn't get every hair.\nTOUCH IN SOL No Pore Blem Priming Eraser - Face Makeup Easy Grip Stick Primer with Smudging Cushion Tip, Concealing Pores and Fine Lines, Sebum Control and Skin Smooth & Velvety Finish\nTouch in Sol\n{'Brand': 'Touch in Sol', 'Skin Type': 'All', 'Package Information': 'Tube', 'Item Volume': '1 Milliliters', 'Specialty': 'Moisturizing, Cruelty Free, Vegan', 'Item model number': 'P813614'}\nI tried a few other products and they no poreblem line and overall I'm pretty impressed. It swipes on and does a decent job of minimizing pores. It's not as effective as my cover FX pore filling primer or my tarte pore filling primer but I do like the convenience of having this in a pen.\nPretty decent\nIonic Hair Dryers for Women 1800W Blow Dryer with Diffuser Hot and Cool Settings Speed Adjustable Negative Ion Hair Dryer with 2 Concentrators,1 Hair Scalp Massager Brush for Curly Hair(LTD Edition)\nLassie\n{'Brand': 'Lassie', 'Power Source': 'Corded Electric', 'Hair Type': 'Curly', 'Number of Speeds': '2', 'Product Dimensions': '11.4 x 9.4 x 3.7 inches; 2.43 Pounds', 'Manufacturer': 'Lassie'}\nThey're quite a few of these hair dryers popping up that are designed to look like the ridiculously expensive Dyson. While I've never tried the Dyson, I was excited by the design and so I picked this one up. On the plus side it does have an extremely long cord so if you can't stand right directly next to you anymore you'll be fine but it is not a swivel cord so it's not as maneuverable as others. It's not a huge deal for me but just something to be aware of. I love the hat and cold functions which makes it really nice to set your hair at the end and seal in the style. If you've only ever used regular hair dryers you'll really appreciate this added feature. It's a pretty substantial hair dryer. If you're used to really inexpensive lightweight ones you'll notice the additional weight however it's not so heavy that your arm will get tired even if you have a ton of hair like I do. And I just have to go back to the overall style and design again because this hair dryer looks so sleek and cool. I get a kick out of using it every time I see it.\nBeautiful Dyson style design and pretty impressive hair dryer too\nMarshique Touch Fit Glitter Cream Shadow 0.2Oz (Gold Beige White Clear Skin Tone Shiny mood) - Champagne Gold Pearl, Sparkle Eyeshadow, Waterproof and Longlasting for Under fat eye\nMarshique\n{'Brand': 'Marshique', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Luminous,Shiny,Sheer,Glitter,Shimmer', 'Number of Items': '1', 'Coverage': 'Light', 'Package Dimensions': '1.61 x 1.61 x 0.74 inches; 0.2 Ounces', 'Item model number': '0000'}\nI'm not generally a huge fan of cream shadows but I wanted to give this one a try and I'm so happy I did. It is so glimmery and beautiful. My favorite way to wear this is just padded over a bear eyelid with some mascara and maybe a little bit of liner. It just adds a beautiful finished touch. It also looks really lovely tapped on top of eyeshadow. For that method I prefer my finger versus a brush. It's nice because it doesn't bunch up or overly crease. And I really like the airtight packaging as well.\nSuch a beautiful cream shadow\nRAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nRAREKIND\n{'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nThis is so beautiful! I love the packaging and the color was really rich and a beautiful tone on my skin. Oftentimes reds can be too warm or too cool and this is just the right amount of warmth for me. It's very comfortable to wear and was nice and long wearing without being drying. and then I was really pleased with how beautifully it faded after a very long time. I'm excited to try different shades in this formula.\nSuper comfortable, long wearing, and fades beautifully\n24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nAILIWEI\n{'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nThis is a better than average costume wig. The hair does have that typical slight plastic sheen but it's not nearly as noticeable as others I've seen especially blonde wigs. There's a good amount of hair here as well so it's not one of those wigs that gets wispy towards the ends. The part hairline could look a little better but if you fiddle with it you can make it look pretty good. All in all this is going to be a great wig for my Hocus Pocus costume.\nPretty good blonde costume wig\nClaw Hair Clips, IKOCO 6 Pack Jaw Clips Stylish Matte Plastic Strong Hold Hair Clamps Box Packaged for Thin Fine Hair with 10Pcs Black Hair ties (2.4Inch)\nIKOCO\n{'Brand': 'IKOCO', 'Hair Type': 'Fine', 'Color': 'Green,Grey', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal, Acrylic', 'Product Dimensions': '6.25 x 4.25 x 2 inches; 5.89 Ounces'}\nThese are much larger in person than I was expecting but they're perfect if you have a lot of hair or long hair or you want to be able to clip a bun securely on your head. They feel like they are quite sturdy as well. I always break my clips and I think I'm going to have a hard time breaking these. I also appreciate the included hair ties!\nSturdy and great if you have a lot of hair\n3 Barrel Curling Iron, Milantia 3/4 Inch Mini Travel Curling Wand Hair for Small Curly, Dual Voltage Ceramic Tourmaline 19mm Crimper Hair Iron for Women - Fast Heating, Portable\nMilantia\n{'Shape': 'Barrel', 'Brand': 'Milantia', 'Hair Type': 'All,Thick,Thin', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Product Dimensions': '9.25 x 1.97 x 1.97 inches; 12.63 Ounces', 'Manufacturer': 'Milantia'}\nThe product images for this curling wand are deeply misleading. It shows the curling iron on a model's hair and it looks like an average sized curling wand with three barrels. No, in person this thing is so tiny. It honestly looks like a curling iron for dolls. As you can see in my photo I'm using a pencil for scale. Each of these barrels is about a pencil and a half to two pencils big. Meaning that the type of curls you get are more like 1920s finger waves than anything you would probably want to wear today. It's just ridiculous.\nIs this a curling wand for dolls? So tiny!\n5-Pack Hair Scalp scrubber Massager Shampoo Brush for Straight Curly Long Short Thick Thin Wet Dry Hair, Men Women Kids Scalp Care Hair Cleaning Shower, Scalp Care Brush,100% comfortable\nTeqifu\n{'Material': 'Silicone', 'Brand': 'Teqifu', 'Color': 'Pink, Blue', 'Package Dimensions': '8.78 x 7.68 x 2.87 inches; 8.78 Ounces', 'UPC': '608571756465', 'Manufacturer': 'Teqifu'}\nThis is exactly what I was looking for in a scalp scrubber. It has a fairly comfortable to hold handle which makes this easy to hang on to and not slip out of your hands even if you have super slippery shampoo. The bristles are firm enough but very flexible so they're quite comfortable on the scalp. I also love that you get so many colors here! I was able to gift several to my family and still have one for myself.\nExactly what I wanted\nEyebrow Pencil 3 Pcs Waterproof Dark Brown Long Lasting Eyebrow Makeup Pen with 4 Fork Tips Head Upgrade Design\nMarine Forest\n{'Brand': 'Marine Forest', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Long Lasting', 'Package Dimensions': '4.88 x 2.17 x 0.79 inches; 1.6 Ounces', 'UPC': '729843551950'}\nI am shocked. I was kind of expecting this to be a mess but I was curious so I decided to try it. This works exceptionally well. I have tried some of these little three-pronged brow markers in the past and never been very impressed. These have enough stability to them that you really can flick and get straight little lines that look just like hairs. They are thin and you have actual control. This formula also lasts forever! I definitely have to use makeup remover to get it off, so it is for sure waterproof. I also like that this color isn't pulling red on me. So often browns do that but this is nice and dark and definitely neutral. The only complaint I have is that when I open these there was a little bit of ink that had leaked out around the applicator at the top so it looked a little messy, but I love the way this works so much I don't care One thing to note is that it's best to put this on before you use any other wax or gels to keep your brow hairs in place. This really doesn't work well on top of anything but dry plain skin.\nThis stuff looks great and it lasts forever on your eyebrows\nOralphi Soft Tapered Toothbrush, with Super Tapered Bristles for Periodontal Pocket Care (4 Count, Full Head)\nOralphi\n{'Brand': 'Oralphi', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Material Feature': 'Reusable', 'Unit Count': '4.00 Count', 'Package Dimensions': '7.87 x 4.92 x 0.67 inches; 4.66 Ounces', 'Manufacturer': 'Oralphi'}\nThis is a decent set of toothbrushes. As advertised the bristles are soft though not as soft as some of the bamboo toothbrushes I've tried. I actually prefer this level of softness. The handles are ergonomic and easy to hold and I appreciate that they come and assortment of colors so if several of you are using this at once in the same bathroom it's easy to tell whose is whose\nThe right level of softness for me\nBesame Cosmetics | Forever Red Lipstick - 1925 | Classic Color Lipstick | Vintage Makeup | Long Lasting Lipstick | Semi Matte Lipstick for Women | Moisturizing Lipstick for Sensitive Skin\nBESAME COSMETICS\n{'Brand': 'BESAME COSMETICS', 'Skin Type': 'All', 'Item Form': 'Powder', 'Finish Type': 'Semi Matte', 'Product Benefits': 'Hydrating,Long Lasting,Nourishing,Clean,Moisturizing,Makeup', 'Package Dimensions': '4.45 x 1.14 x 1.06 inches; 0.74 Ounces'}\nI'm a big fan of the style of this brand and have been for years. There's something about the vintage aesthetic that they capture so perfectly that always draws me in. I wasn't sure what I would think about their actual lipsticks however because of the bullet style is so unusual, but I really love this. The formula is creamy but long-lasting and even leaves a little bit of a stain, and the color is just the perfect red in my opinion it's a slightly deeper red so it feels a little more sophisticated and a little more wearable than a brighter red. It also has a slight blue base to it which makes your teeth look a little wider. The packaging is absolutely lovely and I actually find that I really enjoy the style of the lipstick bullet. I still always wear a lip liner of course but the angle of this makes it really easy to fully coat your lips. I will absolutely be buying more lipsticks from this brand.\nVintage style, timeless color",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Degree Male Adrenaline Series Anti-Perspirant and Deodorant Invisible Solid for Men, Overtime, 2.7 Ounce\nReview Date: 2014/04/24\nStore: DEGREE MENS DEO\nAverage Rating: 3.2\nProduct Details: {'Brand': 'DEGREE MENS DEO', 'Item Form': 'Solid', 'Scent': 'Cool Rush', 'Unit Count': '2.7 Ounce', 'Product Dimensions': '2.72 x 1.2 x 5.74 inches; 4.48 Ounces', 'Manufacturer': 'Unilever'}\nReview Text: Exactly as advertised.  Lasted all day with great odor and wetness protection.  I also appreciated that the scent was subtle enough not to compete with my cologne.  I'll be buying this again.\nReview Title: Great, all day protection with a pleasantly subtle scent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: essie Nail Polish, Glossy Shine Finish, Let It Glow, 0.46 fl. oz.\nReview Date: 2017/10/10\nStore: essie\nProduct Description: ['Product Description', 'get deserted in a fiery coral glistening with copper shimmer. DBP, Toluene, and Formaldehyde free provides flawless coverage along with outstanding durability inspired by the natural earth tone hues found in the desert America’s nail salon expert. since 1981become captivated by the desert’s optical illusions and transport yourself with our Essie desert mirage collection. From the warm morning sunrise to the hot sunsets, this collection brings to life the natural earth tone hues found in the desert. But regardless of temperature, these shades are guaranteed to keep you hot all season long!use apricot cuticle oil, Essie base coat, 2 coats of Essie polish, and seal with Essie top coat.Caution: keep from heat or flame.', 'Brand Story', 'For more than 30 years, essie has been an industry icon, trusted by beauty professionals, celebrities and even royalty – an American classic that allows women all over the world to express themselves and have fun with color.']\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Essie', 'Item Form': 'Liquid', 'Color': 'Let It Glow', 'Finish Type': 'Glossy', 'Special Feature': 'On-trend color with flawless coverage and outstanding durability. DBP, Toluene and Formaldehyde free', 'Material Feature': 'Formaldehyde free, Cruelty Free', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Number of Pieces': '1', 'Liquid Volume': '14 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.14 x 1.14 x 2.7 inches; 1.59 Ounces', 'Item model number': 'ES2787', 'UPC': '095008027876', 'Manufacturer': 'essie'}\nReview Text: The color shift isn't quite as pronounced in person, but it's still super pretty. In good light, the pink color flashes copper. The wear time is good too. The picture is after three days of wear and it still looks excellent.\nReview Title: Pink shifts to copper!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: BeautyBio GloPRO Regeneration Tools\nReview Date: 2018/12/07\nAverage Rating: 4.3\nProduct Details: {'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nReview Text: I've been in the market for a microneedling device for a while now, but I wasn't sure if I needed something super expensive or if I could get away with a more budget-friendly option. I decided to try two super inexpensive versions , both costing around $20 and see if this significantly more expensive option from GloPRO was really worth it. In short, yes. Both of the cheaper options were incredibly painful and flimsy feeling. One of them even felt kind of like getting a face tattoo. It was awful. The GloPRO option actually feels nice on the skin because of the vibration feature and the red light therapy is a huge benefit for those monthly breakouts. I do feel like my skin care is absorbing more effectively since I've been using this, but it's still an extremely expensive tool. If you really want a microneedling device, in my opinion this is worth the investment, however, I don't think it's a necessary item.\nReview Title: Super pricey, but much better than the budget-friendly alternatives\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Makeup Blender Sponge Set - 4 Pack Latex Free Q-Soft Makeup Beauty Foundation Blending Sponge Flawless Smooth Brush for Liquid Foundation BB Creams Powders Concealer (4 Pack)\nReview Date: 2019/02/11\nStore: FRESHME\nAverage Rating: 3.9\nProduct Details: {'Brand': 'FRESHME', 'Color': 'Ivory', 'Material': 'Rubber', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.6 x 3.6 x 1.4 inches; 1.59 Ounces', 'UPC': '681413196902', 'Manufacturer': 'FRESHME'}\nReview Text: I'm not a complete beauty sponge snob and I've tried lots of different brands, both high-end and budget friendly, and I found sponges I liked at both price points. These sponges are definitely on the farmer side, so for that reason they aren't my favorite. They do expand when wet and I really do like the shape of the larger ones in this set--they are very similar to the Real Techniques sponges--but they're just not as soft and bouncy as some of the others that I prefer. If you're looking for a good drugstore-priced sponge I recommend the Loreal ones.\nReview Title: Kind of firm but good shapes\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2019 Newest Nose Hair Trimmer for Men Women MASWATER Professional Electric Nose Ear Hair Trimmer Clipper Painless Wet/Dry Trimming Premium Quality Stainless Steel Dual-Edge Blades Won't Break!\nReview Date: 2019/03/04\nStore: maswater\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Maswater', 'Recommended Uses For Product': 'Nose,Facial Hair,Beards,Grooming,Trimmer,Professional', 'Power Source': 'Battery Powered', 'Included Components': 'Clipper, Battery', 'Color': 'Silver', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 5 inches; 2.4 Ounces', 'Batteries': '1 AA batteries required.', 'UPC': '699949549697', 'Manufacturer': 'MASWATER'}\nReview Text: I didn't have great success with his nose hair trimmer. First off it does pull despite claiming not to. It's not incredibly painful but every now and then it would snag and Pull and I did enjoy that. Also it didn't seem to do the best job getting all the hairs. I had one here that I was trying to get and I had to go over it several times and it just wouldn't seem to trim it. It's not super expensive so it's not a complete fail for me but I'm not going to be using this a lot unless I really need to. It also heats up relatively quickly.\nReview Title: It does pull and it doesn't get every hair.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TOUCH IN SOL No Pore Blem Priming Eraser - Face Makeup Easy Grip Stick Primer with Smudging Cushion Tip, Concealing Pores and Fine Lines, Sebum Control and Skin Smooth & Velvety Finish\nReview Date: 2020/01/19\nStore: Touch in Sol\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Touch in Sol', 'Skin Type': 'All', 'Package Information': 'Tube', 'Item Volume': '1 Milliliters', 'Specialty': 'Moisturizing, Cruelty Free, Vegan', 'Item model number': 'P813614'}\nReview Text: I tried a few other products and they no poreblem line and overall I'm pretty impressed. It swipes on and does a decent job of minimizing pores. It's not as effective as my cover FX pore filling primer or my tarte pore filling primer but I do like the convenience of having this in a pen.\nReview Title: Pretty decent\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ionic Hair Dryers for Women 1800W Blow Dryer with Diffuser Hot and Cool Settings Speed Adjustable Negative Ion Hair Dryer with 2 Concentrators,1 Hair Scalp Massager Brush for Curly Hair(LTD Edition)\nReview Date: 2020/07/20\nStore: Lassie\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Lassie', 'Power Source': 'Corded Electric', 'Hair Type': 'Curly', 'Number of Speeds': '2', 'Product Dimensions': '11.4 x 9.4 x 3.7 inches; 2.43 Pounds', 'Manufacturer': 'Lassie'}\nReview Text: They're quite a few of these hair dryers popping up that are designed to look like the ridiculously expensive Dyson. While I've never tried the Dyson, I was excited by the design and so I picked this one up. On the plus side it does have an extremely long cord so if you can't stand right directly next to you anymore you'll be fine but it is not a swivel cord so it's not as maneuverable as others. It's not a huge deal for me but just something to be aware of. I love the hat and cold functions which makes it really nice to set your hair at the end and seal in the style. If you've only ever used regular hair dryers you'll really appreciate this added feature. It's a pretty substantial hair dryer. If you're used to really inexpensive lightweight ones you'll notice the additional weight however it's not so heavy that your arm will get tired even if you have a ton of hair like I do. And I just have to go back to the overall style and design again because this hair dryer looks so sleek and cool. I get a kick out of using it every time I see it.\nReview Title: Beautiful Dyson style design and pretty impressive hair dryer too\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Marshique Touch Fit Glitter Cream Shadow 0.2Oz (Gold Beige White Clear Skin Tone Shiny mood) - Champagne Gold Pearl, Sparkle Eyeshadow, Waterproof and Longlasting for Under fat eye\nReview Date: 2020/07/23\nStore: Marshique\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Marshique', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Luminous,Shiny,Sheer,Glitter,Shimmer', 'Number of Items': '1', 'Coverage': 'Light', 'Package Dimensions': '1.61 x 1.61 x 0.74 inches; 0.2 Ounces', 'Item model number': '0000'}\nReview Text: I'm not generally a huge fan of cream shadows but I wanted to give this one a try and I'm so happy I did. It is so glimmery and beautiful. My favorite way to wear this is just padded over a bear eyelid with some mascara and maybe a little bit of liner. It just adds a beautiful finished touch. It also looks really lovely tapped on top of eyeshadow. For that method I prefer my finger versus a brush. It's nice because it doesn't bunch up or overly crease. And I really like the airtight packaging as well.\nReview Title: Such a beautiful cream shadow\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nReview Date: 2020/08/30\nStore: RAREKIND\nAverage Rating: 3.8\nProduct Details: {'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nReview Text: This is so beautiful! I love the packaging and the color was really rich and a beautiful tone on my skin. Oftentimes reds can be too warm or too cool and this is just the right amount of warmth for me. It's very comfortable to wear and was nice and long wearing without being drying. and then I was really pleased with how beautifully it faded after a very long time. I'm excited to try different shades in this formula.\nReview Title: Super comfortable, long wearing, and fades beautifully\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nReview Date: 2020/09/24\nStore: AILIWEI\nAverage Rating: 3.7\nProduct Details: {'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nReview Text: This is a better than average costume wig. The hair does have that typical slight plastic sheen but it's not nearly as noticeable as others I've seen especially blonde wigs. There's a good amount of hair here as well so it's not one of those wigs that gets wispy towards the ends. The part hairline could look a little better but if you fiddle with it you can make it look pretty good. All in all this is going to be a great wig for my Hocus Pocus costume.\nReview Title: Pretty good blonde costume wig\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Claw Hair Clips, IKOCO 6 Pack Jaw Clips Stylish Matte Plastic Strong Hold Hair Clamps Box Packaged for Thin Fine Hair with 10Pcs Black Hair ties (2.4Inch)\nReview Date: 2020/12/19\nStore: IKOCO\nAverage Rating: 4.4\nProduct Details: {'Brand': 'IKOCO', 'Hair Type': 'Fine', 'Color': 'Green,Grey', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal, Acrylic', 'Product Dimensions': '6.25 x 4.25 x 2 inches; 5.89 Ounces'}\nReview Text: These are much larger in person than I was expecting but they're perfect if you have a lot of hair or long hair or you want to be able to clip a bun securely on your head. They feel like they are quite sturdy as well. I always break my clips and I think I'm going to have a hard time breaking these. I also appreciate the included hair ties!\nReview Title: Sturdy and great if you have a lot of hair\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, Milantia 3/4 Inch Mini Travel Curling Wand Hair for Small Curly, Dual Voltage Ceramic Tourmaline 19mm Crimper Hair Iron for Women - Fast Heating, Portable\nReview Date: 2020/12/27\nStore: Milantia\nAverage Rating: 3.8\nProduct Details: {'Shape': 'Barrel', 'Brand': 'Milantia', 'Hair Type': 'All,Thick,Thin', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Product Dimensions': '9.25 x 1.97 x 1.97 inches; 12.63 Ounces', 'Manufacturer': 'Milantia'}\nReview Text: The product images for this curling wand are deeply misleading. It shows the curling iron on a model's hair and it looks like an average sized curling wand with three barrels. No, in person this thing is so tiny. It honestly looks like a curling iron for dolls. As you can see in my photo I'm using a pencil for scale. Each of these barrels is about a pencil and a half to two pencils big. Meaning that the type of curls you get are more like 1920s finger waves than anything you would probably want to wear today. It's just ridiculous.\nReview Title: Is this a curling wand for dolls? So tiny!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 5-Pack Hair Scalp scrubber Massager Shampoo Brush for Straight Curly Long Short Thick Thin Wet Dry Hair, Men Women Kids Scalp Care Hair Cleaning Shower, Scalp Care Brush,100% comfortable\nReview Date: 2021/02/19\nStore: Teqifu\nAverage Rating: 4.3\nProduct Details: {'Material': 'Silicone', 'Brand': 'Teqifu', 'Color': 'Pink, Blue', 'Package Dimensions': '8.78 x 7.68 x 2.87 inches; 8.78 Ounces', 'UPC': '608571756465', 'Manufacturer': 'Teqifu'}\nReview Text: This is exactly what I was looking for in a scalp scrubber. It has a fairly comfortable to hold handle which makes this easy to hang on to and not slip out of your hands even if you have super slippery shampoo. The bristles are firm enough but very flexible so they're quite comfortable on the scalp. I also love that you get so many colors here! I was able to gift several to my family and still have one for myself.\nReview Title: Exactly what I wanted\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyebrow Pencil 3 Pcs Waterproof Dark Brown Long Lasting Eyebrow Makeup Pen with 4 Fork Tips Head Upgrade Design\nReview Date: 2021/05/13\nStore: Marine Forest\nAverage Rating: 3.3\nProduct Details: {'Brand': 'Marine Forest', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Long Lasting', 'Package Dimensions': '4.88 x 2.17 x 0.79 inches; 1.6 Ounces', 'UPC': '729843551950'}\nReview Text: I am shocked. I was kind of expecting this to be a mess but I was curious so I decided to try it. This works exceptionally well. I have tried some of these little three-pronged brow markers in the past and never been very impressed. These have enough stability to them that you really can flick and get straight little lines that look just like hairs. They are thin and you have actual control. This formula also lasts forever! I definitely have to use makeup remover to get it off, so it is for sure waterproof. I also like that this color isn't pulling red on me. So often browns do that but this is nice and dark and definitely neutral. The only complaint I have is that when I open these there was a little bit of ink that had leaked out around the applicator at the top so it looked a little messy, but I love the way this works so much I don't care One thing to note is that it's best to put this on before you use any other wax or gels to keep your brow hairs in place. This really doesn't work well on top of anything but dry plain skin.\nReview Title: This stuff looks great and it lasts forever on your eyebrows\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Oralphi Soft Tapered Toothbrush, with Super Tapered Bristles for Periodontal Pocket Care (4 Count, Full Head)\nReview Date: 2021/06/21\nStore: Oralphi\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Oralphi', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Material Feature': 'Reusable', 'Unit Count': '4.00 Count', 'Package Dimensions': '7.87 x 4.92 x 0.67 inches; 4.66 Ounces', 'Manufacturer': 'Oralphi'}\nReview Text: This is a decent set of toothbrushes. As advertised the bristles are soft though not as soft as some of the bamboo toothbrushes I've tried. I actually prefer this level of softness. The handles are ergonomic and easy to hold and I appreciate that they come and assortment of colors so if several of you are using this at once in the same bathroom it's easy to tell whose is whose\nReview Title: The right level of softness for me\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Besame Cosmetics | Forever Red Lipstick - 1925 | Classic Color Lipstick | Vintage Makeup | Long Lasting Lipstick | Semi Matte Lipstick for Women | Moisturizing Lipstick for Sensitive Skin\nReview Date: 2022/02/06\nStore: BESAME COSMETICS\nAverage Rating: 4.4\nProduct Details: {'Brand': 'BESAME COSMETICS', 'Skin Type': 'All', 'Item Form': 'Powder', 'Finish Type': 'Semi Matte', 'Product Benefits': 'Hydrating,Long Lasting,Nourishing,Clean,Moisturizing,Makeup', 'Package Dimensions': '4.45 x 1.14 x 1.06 inches; 0.74 Ounces'}\nReview Text: I'm a big fan of the style of this brand and have been for years. There's something about the vintage aesthetic that they capture so perfectly that always draws me in. I wasn't sure what I would think about their actual lipsticks however because of the bullet style is so unusual, but I really love this. The formula is creamy but long-lasting and even leaves a little bit of a stain, and the color is just the perfect red in my opinion it's a slightly deeper red so it feels a little more sophisticated and a little more wearable than a brighter red. It also has a slight blue base to it which makes your teeth look a little wider. The packaging is absolutely lovely and I actually find that I really enjoy the style of the lipstick bullet. I still always wear a lip liner of course but the angle of this makes it really easy to fully coat your lips. I will absolutely be buying more lipsticks from this brand.\nReview Title: Vintage style, timeless color\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Genuine Preferences and Patterns:**\n\n- **Personal Care**: Strong inclination towards effective personal hygiene products, specifically deodorants with lasting odor and wetness protection. Values subtle scents that do not clash with colognes.\n  \n- **Cosmetics**: Preference for beauty products that emphasize long-lasting wear and quality, including nail polishes, lipsticks, and make-up tools. Enjoys products with unique finishes (e.g., glossy, shimmering) and deep, sophisticated colors.\n\n- **Skincare and Tools**: Interested in skincare tools (e.g., microneedling devices, scalp massagers) that offer innovative features like red light therapy and ergonomic designs. Seeks quality despite a higher price point.\n\n- **Hair Care**: Tends to choose hair styling tools and products that promote effective styling features (e.g., varying heat settings) and appreciate stylish designs that provide additional functionality, such as powerful blow dryers.\n\n- **Product Reliability**: Values user-friendly and durable items, particularly with hair accessories like clips and sponges. Shows willingness to experiment with both high-end and budget-friendly items but leans towards quality experiences, favoring products that validate their price through performance.\n\n- **Appreciation for Packaging and Aesthetics**: Exhibits a liking for aesthetically pleasing and practical packaging, especially in lipstick where vintage design influences purchase decisions.\n\nOverall, the buyer demonstrates a consistent preference for quality, effectiveness, and aesthetics across personal care, cosmetics, and grooming products.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Not bad at all",
    "text": "I tried some of these contour sticks in the past and they don't always work super well but I quite like this one. The highlight is especially nice. I just wanted it for a little bit of inner corner highlight and this gives me a parallescent glow without any glitter. It looks really nice. The contour side is a little warmer than I would like and it's not the easiest to blend out but you can make it work. It's really more of a good color of a cream bronzer but because it's not the easiest to blend I don't prefer to use it that way. However it is nice to have that extra bit of color to throw on and there's a lot of convenience to having this dual-sided item. You can do a lot with them.",
    "images": [],
    "asin": "B0B5PC63L7",
    "parent_asin": "B0B9C3C8SS",
    "user_id": "AECTRGMRKOGAYIV3YXX73CQEQCSQ",
    "timestamp": "2022-09-20 11:30:03.815000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "KIMUSE 2Color Dual Cream Contour Stick, Multi Blush & Contour Bronzer Stick, Long Lasting & Waterproof Contour Sticks Kit for Light Skin Face Makeup",
    "average_rating": 3.8,
    "rating_number": 737,
    "features": [
      "Double Head Design - KIMUSE Contour Stick 2 in 1 Bronze Contour Stick, one side is a creamy blendable blush and the other side is a contour stick. Suit for any type of makeup sand skin tone.Easy to control & portable design with precise application!",
      "Creamy & Smooth Texture - Buildable highly pigmented, creamy smooth texture contouring stick that easy to apply and blend well into the skin.Easily create a healthy dewy perfect makeup.",
      "Long Lasting & Waterproof - Our long-wear formula ensures your makeup lasts all day, waterproof, sweat-proof and non-sticky. So your makeup, hold and coverage last longer.",
      "Easy to Use - First apply the contour stick to the position where you usually shape the contour, and then apply the cream blush to the top of the cheekbones to increase the color. Mix up upward to obtain a perfect natural dewy look.",
      "Cruelty-Free & Vegan - Cruelty-free & vegan formula blush & bronzer stick with beautifully packaged that perfect as a gift for family and friends.Never tested on animals."
    ],
    "description": [],
    "price": 9.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41PF98BXb8L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41PF98BXb8L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51JkuaLsJaL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51i0gqOlXDL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51i0gqOlXDL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61wlUemKoPL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51UEEExSfkL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51UEEExSfkL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61Hjn6DdVKL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41REkHw1RjL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41REkHw1RjL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61vPMSNM3DL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51TpyyPz6YL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51TpyyPz6YL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61ecajAZlBL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51brX8OEQpL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51brX8OEQpL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61SWZQdJBKL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41UqPAuPQ8L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41UqPAuPQ8L.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/51jMKkNSs6L._SL1000_.jpg"
      }
    ],
    "videos": [
      {
        "title": "nice natural makeup look",
        "url": "https://www.amazon.com/vdp/04be9291b6414d54a61dbf689e98e5ee?ref=dp_vse_rvc_0",
        "user_id": "/shop/influencer-cdb02a65"
      },
      {
        "title": "Easy to Control and Application - KIMUSE Contour Sticks",
        "url": "https://www.amazon.com/vdp/0b142cdf80d745bf89869860334926aa?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "Create 3D Makeup Effect-KIMUSE Contour Stick",
        "url": "https://www.amazon.com/vdp/0d9e066e0bd9496ca9dd16e4b514cbc5?ref=dp_vse_rvc_2",
        "user_id": ""
      },
      {
        "title": "Easily Enhance Your Features - KIMUSE Contour Stick",
        "url": "https://www.amazon.com/vdp/0666e8d212d843adb74a2c98093eafd4?ref=dp_vse_rvc_3",
        "user_id": ""
      },
      {
        "title": "Application Tutorials of KIMUSE 2Color Dual Contour Stick.",
        "url": "https://www.amazon.com/vdp/0f927ba08b5c49fbb0ac76126bcaca05?ref=dp_vse_rvc_4",
        "user_id": ""
      },
      {
        "title": "Contour Stick, Cream Contour Stick Makeup",
        "url": "https://www.amazon.com/vdp/088c45df5a9640bd95e75a5c00af549e?ref=dp_vse_rvc_5",
        "user_id": ""
      },
      {
        "title": "Important SHADE and FORMULA info!!!",
        "url": "https://www.amazon.com/vdp/03aaaa8d321948bd8353b0c665efb50a?ref=dp_vse_rvc_6",
        "user_id": "/shop/truly.milena"
      },
      {
        "title": "Fenty Beauty Match Stix Amber Review",
        "url": "https://www.amazon.com/vdp/04844b9574bb419b90364ddd33d70e18?ref=dp_vse_rvc_7",
        "user_id": "/shop/cutieincosplay"
      }
    ],
    "store": "KIMUSE",
    "categories": [],
    "details": {
      "Item Form": "Cream",
      "Finish Type": "Sheer",
      "Coverage": "Light",
      "Brand": "KIMUSE",
      "Color": "Diffused Brown & Peachy Pink",
      "Product Dimensions": "0.87 x 0.87 x 4.41 inches; 1.13 Ounces"
    },
    "bought_together": null
  }
}