{
  "user_id": "AGRX7ZI7LBRKIZEEVAJFE56T2UMA",
  "summary": "=== Purchase Information ===\nProduct Title: &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\nReview Date: 2019/07/06\nStore: YRMJK\nAverage Rating: 4.3\nProduct Details: {'Brand': 'YRMJK', 'Age Range (Description)': 'Adult', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 3.1 x 2.7 inches; 13.76 Ounces', 'UPC': '738426030676', 'Manufacturer': 'MUTTUS'}\nReview Text: [[VIDEOID:b2565b535e1d3f3297ca6703d7f26383]] A tip for those would never used an electric toothbrush: put the toothbrush into your mouth and then turn on (and off before removing from mouth). Lol, I got toothpaste everywhere and learned this the hard way. Functionally, the vibrations are powerful by default, so if you are sensitive like me, turn it down. I’ve used it 4 times now and the first time it was strange, but now I am use to it. There are 5 different pulsating settings (see video). The plus and minus icons allow for easy and quick adjustment of how hard/soft - fast/slow the vibrating brush-head will pulsate. The bristles on the brush attachment is firm, but soft on gums; so there is some bend to the bristles and was comfortable for me. It sits on a charger to power it up via usb cord that plugs into standard charger plug. The case is beyond awesome. I travel for conferences and this stores the brush and charger with the brush head in a beautiful pink bottom and clear top hard case. Easy to pack and go. My teeth feels very clean after using this electronic toothbrush. For my set, I have 5 extra brush head attachments for exchanging after wearing out. This set looks exactly like advertised. I love the pink design. It is long and slender with sliver trim. My video will show the different settings and I hope you can hear the slight vibration changes because you could easily tell from the sound of the pulse by which setting it is on through a couple of uses. My favorite thing about it is that the charger is small and doesn’t take up any room on the sink countertop. The travel case is sturdy. The quality of this brush is so great that I don’t want to ever go back to a standard manual toothbrush. I highly recommend if you need a travel brush that is electronic! Update: A week later and I still love it! Everything works very well!!\nReview Title: Great travel toothbrush!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Persephone Ombre Blonde Lace Front Wig Wavy Soft Brown Roots Ash Blonde Ombre Wigs for Women Glueless Long Wavy Synthetic Wig with Middle Parting Heat Resistant 22 Inches\nReview Date: 2020/06/15\nStore: Persephone\nAverage Rating: 4.1\nProduct Details: {'Color': 'Brown Roots Ash Blonde Ombre', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.7 x 6.2 x 2.3 inches; 14.39 Ounces', 'UPC': '708210345712'}\nReview Text: [[VIDEOID:e6486dec3002b28b72d65864eaf95d53]] Y’all!!! I can’t give this wig enough stars! For the price, this is an outstanding wig - Persephone Ombré Blonde! Now, I cut the pace all the way back and place it about 1-2” behind my hairline, so I’ve pulled out my front hair to blend with the wig. It does have wig combs to keep it secure and, although it comes with an awesome wig cap, I do NOT wear a cap. Stays on securely all day. Great wig cap construction with adjustable straps to help custom to head. Didn’t tangle. Soft! Huge fan!! This is an outstanding wig and the price is a great value!!! L O V E !!\nReview Title: LOVE!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Miss U Hair Long Wavy Dyeing Color Wig Burgundy Ombre Blonde Cosplay Costume Wig\nReview Date: 2020/06/15\nStore: M MISS U HAIR\nAverage Rating: 3.2\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'M MISS U HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.2 x 8 x 1.7 inches; 11.36 Ounces'}\nReview Text: [[VIDEOID:70e9f5c0d3612527c251dde5937efab3]] This Miss U Hair is just pass shoulder length with good curl. This is a good quality character, cosplay, or Halloween wig. Cap construction is good and comfy, but no combs to secure in place, so it did slide around on my head. It came with a wig cap. The part is fluffy and thick, as is the hair line, so I was unable to get a natural look from forehead to hairline, but for the function of Cosplay character, this is on the higher quality.\nReview Title: Nice for Cosplay purposes.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nReview Date: 2020/06/23\nStore: Sam&Helen\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nReview Text: [[VIDEOID:f429642b52f8b0f5ebb4606cb77edc77]] I love these magnetic eyelashes. It’s so much easier than applying glue, in my opinion. I did two thin layers of magnetic eyeliner and allowed to dry. It did stick to my upper lid when I moved my eyelids up as I waited for them to dry. Once dry, I used the tweezer to apply the magnet eyelash. Each eyelash has tiny magnetics that adhere to the liner. I was pleasantly surprised that it worked!! The tweezers was not helpful to me for applying, and the second lash I applied with my hands without a problem. Beautiful lashes!! Wore them all day yesterday and wasn’t uncomfortable at all. Didn’t come off in the wind going to dinner. I simply removed with my hands to replace on the storage palette and removed liner with coconut oil. Lashes are glamorous and reusable. LOVE THEM!!!\nReview Title: Works great for all day wear!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aokiya Short Blonde Bob Wig with Bangs Ombre Brown Wigs for Women Straight Synthetic Cosplay Wigs (14 Inch)\nReview Date: 2020/07/14\nStore: Aokiya\nAverage Rating: 3.5\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Aokiya', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.1 x 6.5 x 2.3 inches; 8.01 Ounces'}\nReview Text: [[VIDEOID:b006e218d4cd890bb0d873b2068e6133]] This is a very pretty light brown ombré to blonde, above the shoulders, bob-style wig. Better than I expected! I was expecting a cosplay type, but this is a very natural and great quality wig! It didn’t have combs in the cap construction, but the adjustment hook straps in the back nape is present for tightening. Feels silky soft. Hair moves beautifully! The part is not a free- part and it will show some wefts if altered. I wanted to see if I could create a side vs middle part and was not successful. Overall, I’m surprised at the quality and realness of the wig! I recommend!\nReview Title: Great natural looking wig!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SUIBOBO skincare pink rose quartz jade roller and Essential Oil bottle eye roller-real jade crystal gem stone marble cuarzo ice cold anti aging anti puff facial face roller eye roller massager\nReview Date: 2020/07/31\nStore: SUIBOBO\nProduct Description: ['√ In Time Service -there is instruction paper in the set to help you to use them.And as you know the squeak free jade quartz roller is fragile, easy to be damage in transit, though we pack it very carefully. If you receive the broken jade eye roller, please contact us for new one or full refund.this item is made from 100% natural quartz stone so each piece will little different on color']\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '7.1 x 3.5 x 1.7 inches; 8.01 Ounces', 'UPC': '619470980783', 'Manufacturer': 'HENNSERY CRAFT LIMITED'}\nReview Text: An adorable set: soft snap close holder, pink rose quartz facial roller, essential oil roller-ball bottle with rose quartz pieces, essential oil pour filter, and essential oil bottle opener. The essential oil bottle rolls a smooth amount of my favorite RoseHip Oil on my face to follow up with a relaxing rose quartz face roller. Beautiful set! Calms my sensitive skin.\nReview Title: Outstanding set!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EMMOR Long Ash Blonde Wig for Women - Natural Straight Hair With Air Bang Wigs, Party Cosplay Daily Use\nReview Date: 2020/08/03\nStore: EMMOR\nAverage Rating: 3.3\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.19 x 9.29 x 2.72 inches; 10.62 Ounces'}\nReview Text: I was surprised by the wig for a cosplay variety. It is very shiny and staticky, but a sprinkle of powder will tone that shine. I did it fast and it definitely needs a bit more powder, but it did reduce shine for a more realistic hair wig. The cap construction is very nice, but there are NO combs or clips, which is common for a banged wig. I’m a 21” wig wearer and this fit me comfortably with my long/thick hair in a bun at the nape of my neck. Long! I’m 5’2-ish and this hit me lower back. I brushed this wig several times and ran a dryer sheet over it for static. No loose hairs yet. Overall, this does look wiggy with shine and static, but for a cosplay wig, it lays very naturally and moves well. Decent wig for a natural wear and excellent wig for a cosplay wear!\nReview Title: Great Cosplay Wig!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Pieces Messy Donut Chignons Hair Piece Scrunchies Synthetic Extensions Updo Hair Bun for Women Scrunchies #12/24 Dark Blonde\nReview Date: 2020/08/15\nStore: SHINYSHOW\nAverage Rating: 3.9\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'SHINYSHOW', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.94 x 3.94 x 1.18 inches; 2.47 Ounces', 'UPC': '738630490303'}\nReview Text: Wow, I can’t love these enough!! 3 curly bun wraps to add so much volume to my bun!! I got compliments on my hair all day by so many people!! The dark blonde matched my hair perfectly. I’m sleepy surprised by the quality. These are thick and lays pretty! No hair fell out and it only took me 5mins to pull my hair up, make a fast bun, use this curly bun wrap, and pull out some of my front curls! Fast, easy, and professional polished look in an instant. HUGE FAN!! Love these!!!\nReview Title: Beautiful and Great Quality!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Marshique Touch Fit Glitter Cream Shadow 0.2Oz (Peach Warm Orange Tangerine Sorbet) - Warm Orange Base, Opal Pearl Gold Sparkle Eyeshadow, Waterproof and Longlasting for Under Fat Eye\nReview Date: 2021/06/27\nStore: Marshique\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Marshique', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Luminous,Sheer,Glitter,Shimmer', 'Special Feature': 'Waterproof', 'Number of Items': '1', 'Package Dimensions': '1.6 x 1.6 x 0.7 inches; 0.2 Ounces', 'Item model number': '0000'}\nReview Text: I love the color! So summery and lightweight. Goes on smooth. It’s a tiny container. Easy to slip into a purse.\nReview Title: Gorgeous Color!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Gold 5.9\")\nReview Date: 2021/07/17\nStore: JOMOQ\nAverage Rating: 4.2\nProduct Details: {'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Gold', 'Size': '1 Count (Pack of 1)', 'Power Source': 'Manual', 'Package Dimensions': '5 x 4.13 x 0.94 inches; 3.21 Ounces', 'UPC': '756588246469'}\nReview Text: This hair comb is stunning! Very beautiful. The delicate wires can be manipulated and slightly adjusted to show the comb better. It’s a medium weight and the combs won’t hold my thick hair; but if I style it in an updo, then I can put the combs into the updo to stay better. It won’t comb much hair into a style securely with thick hair like mine, so I definitely have to use other tasters and than place this for beauty over function. Delicate and lovely for an all out dress up day. Love it!\nReview Title: Beautifully crafted!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Silver 4.8\")\nReview Date: 2021/07/17\nStore: JOMOQ\nAverage Rating: 4.3\nProduct Details: {'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Silver', 'Power Source': 'Manual', 'Unit Count': '2.7161 Ounce', 'Package Dimensions': '4.96 x 4.17 x 0.75 inches; 2.4 Ounces', 'UPC': '756588246476'}\nReview Text: Beautiful hair comb that’s light-medium weight. Holds well in my hair, but I need other hair fasteners to keep my hairstyle and then I place this comb into my hair. Lovely!!\nReview Title: Stunning!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DARKLATER Butterfly Hair Clips for Girls,for Toddler Girls,Baby Girls and Women,Cute Hair Clips,Beautiful Hair Accessories,12 PCS\nReview Date: 2021/07/27\nStore: DARKLATER\nAverage Rating: 4.2\nProduct Details: {'Brand': 'DARKLATER', 'Hair Type': 'All', 'Age Range (Description)': 'Babies', 'Embellishment': 'Glitter', 'Theme': 'Butterfly', 'Package Dimensions': '5 x 3.35 x 0.67 inches; 1.13 Ounces', 'UPC': '750081432770'}\nReview Text: Omg, these are so cute that I’m wearing them in my hair almost daily even though I got them for my grand-daughters, lol! Great way to finish off a hairstyle and I get compliments on my butterfly clasps! Great value and so pretty!! My girls love to wear them in their fine/thin hair and they stay in well. My hair is corse/thick and they stay put all workday! Love them!\nReview Title: Beautiful Butterfly Barrettes!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vigorous Straight Highlights Wigs for Women Synthetic Long Highlight Lace Wigs Natural Looking Straight Wigs Middle Part\nReview Date: 2022/05/05\nStore: Vigorous\nAverage Rating: 3.9\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Vigorous', 'Package Dimensions': '12.48 x 9.37 x 2.87 inches; 9.59 Ounces'}\nReview Text: [[VIDEOID:2ed57e5b5a13fc41d14cf2ca6eb88928]] The Vigorous Highlighted wig is synthetic, but…. It makes for a great wig for good value. I save my human hair for certain occasions and this synthetic wig is ideal for when it is a grab and go situation. Does tangle a bit, but not terribly bad. A lot of hair so you feel the weight but I am use to that. Very long and lush. Nice hairline and part… not too very fake, but could use slight plucking. I use to feel weird wearing wigs out and thought people would tell… who cares if they do know? I have never encountered anyone saying I was wearing a wig… on the contrary- they compliment my hair. I do chose to tell them I have a wig on. It is fun and I wear it for me :) I like more clips to secure on my head, but good adjusting bra cap. I do not wear a wig cap. Great quality wig… I was surprised!!\nReview Title: Surprisingly good quality wig\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: L'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones\nReview Date: 2023/04/08\nStore: L'ANGE HAIR\nAverage Rating: 4.3\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Item Form': 'Cream', 'Skin Type': 'Dry', 'Product Benefits': 'Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more', 'Material Feature': 'Natural', 'Product Dimensions': '2.9 x 2.9 x 2.5 inches; 6.38 Ounces', 'UPC': '810108190721', 'Manufacturer': \"L'ANGE HAIR\"}\nReview Text: I am a fan of all things L’ange. It is a favorite brand of mine and I have a lot of their heat styling tools. This is a gentle salt scrub for my scalp. It felt amazing. It feels so clean now! The consistency is silky with bumps of salt. Smells pure and light - not overpowering aroma at all. A luxurious hair pampering scrub that keeps my dry scalp healthier. Huge fan!\nReview Title: Feels amazing!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Big Hair Claw Clips for Women and Girls - 4.3 Inch 8 Pcs Matte Claw Hair Clips for Thick Hair, Large Jaw Clips for Thin Hair, 2 Styles Strong Hold Hair Accessories for Girls\nReview Date: 2023/04/08\nStore: HH Fashion\nAverage Rating: 4.3\nProduct Details: {'Brand': 'HH Fashion', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Bow', 'Material': 'Plastic, Metal'}\nReview Text: I have to be selective in my hair claw clips because I have thick, textured hair that is to my mid-back. These Big hair claw clips does the trick. I was pleasantly surprised that they stayed in my hair so well and kept my hair securely up. I love the two different styles of rounded and squared. I actually prefer the squared. Nice and big for thick hair!\nReview Title: Secured my thick hair!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Silver 5.9\")\nReview Date: 2023/04/15\nStore: JOMOQ\nAverage Rating: 4.4\nProduct Details: {'Material': 'Pearl', 'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Silver', 'Size': '5.9 Inch (Pack of 1)', 'Package Dimensions': '5.67 x 3.98 x 1.46 inches; 2.82 Ounces', 'UPC': '756588246490'}\nReview Text: It is a very pretty hair comb that is securely fixed together on a thin comb. Placed in the hair with the comb teeth, it stayed in place for an updo. Has some bending capabilities to adjust to the curve of the head as needed. Stunning hair accessory!\nReview Title: Beautiful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: lorelo 20 pieces Hair Curlers, Hair Rollers Spiral Curls Styling Kit No Heat Hair Curlers with Styling Hooks for Girls Woman\nReview Date: 2023/04/29\nStore: lorelo\nAverage Rating: 4.0\nProduct Details: {'Number of Items': '20', 'Material': 'Silicone', 'Brand': 'Lorelo', 'Unit Count': '1.00 Count', 'Package Dimensions': '10.59 x 9.02 x 2.8 inches; 9.59 Ounces', 'UPC': '619156721396'}\nReview Text: The Lorelo 2-pc curlers did take me some time to figure out. I have long, thick hair so it takes my hair so long to dry that I was hoping the seemingly more airy design would give me heatless curls. It waved nicely.\nReview Title: Nice waves\nRating: 4.0\n--------------------------------------------------",
  "reference": "&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\nYRMJK\n{'Brand': 'YRMJK', 'Age Range (Description)': 'Adult', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 3.1 x 2.7 inches; 13.76 Ounces', 'UPC': '738426030676', 'Manufacturer': 'MUTTUS'}\n[[VIDEOID:b2565b535e1d3f3297ca6703d7f26383]] A tip for those would never used an electric toothbrush: put the toothbrush into your mouth and then turn on (and off before removing from mouth). Lol, I got toothpaste everywhere and learned this the hard way. Functionally, the vibrations are powerful by default, so if you are sensitive like me, turn it down. I’ve used it 4 times now and the first time it was strange, but now I am use to it. There are 5 different pulsating settings (see video). The plus and minus icons allow for easy and quick adjustment of how hard/soft - fast/slow the vibrating brush-head will pulsate. The bristles on the brush attachment is firm, but soft on gums; so there is some bend to the bristles and was comfortable for me. It sits on a charger to power it up via usb cord that plugs into standard charger plug. The case is beyond awesome. I travel for conferences and this stores the brush and charger with the brush head in a beautiful pink bottom and clear top hard case. Easy to pack and go. My teeth feels very clean after using this electronic toothbrush. For my set, I have 5 extra brush head attachments for exchanging after wearing out. This set looks exactly like advertised. I love the pink design. It is long and slender with sliver trim. My video will show the different settings and I hope you can hear the slight vibration changes because you could easily tell from the sound of the pulse by which setting it is on through a couple of uses. My favorite thing about it is that the charger is small and doesn’t take up any room on the sink countertop. The travel case is sturdy. The quality of this brush is so great that I don’t want to ever go back to a standard manual toothbrush. I highly recommend if you need a travel brush that is electronic! Update: A week later and I still love it! Everything works very well!!\nGreat travel toothbrush!\nPersephone Ombre Blonde Lace Front Wig Wavy Soft Brown Roots Ash Blonde Ombre Wigs for Women Glueless Long Wavy Synthetic Wig with Middle Parting Heat Resistant 22 Inches\nPersephone\n{'Color': 'Brown Roots Ash Blonde Ombre', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.7 x 6.2 x 2.3 inches; 14.39 Ounces', 'UPC': '708210345712'}\n[[VIDEOID:e6486dec3002b28b72d65864eaf95d53]] Y’all!!! I can’t give this wig enough stars! For the price, this is an outstanding wig - Persephone Ombré Blonde! Now, I cut the pace all the way back and place it about 1-2” behind my hairline, so I’ve pulled out my front hair to blend with the wig. It does have wig combs to keep it secure and, although it comes with an awesome wig cap, I do NOT wear a cap. Stays on securely all day. Great wig cap construction with adjustable straps to help custom to head. Didn’t tangle. Soft! Huge fan!! This is an outstanding wig and the price is a great value!!! L O V E !!\nLOVE!\nMiss U Hair Long Wavy Dyeing Color Wig Burgundy Ombre Blonde Cosplay Costume Wig\nM MISS U HAIR\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'M MISS U HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.2 x 8 x 1.7 inches; 11.36 Ounces'}\n[[VIDEOID:70e9f5c0d3612527c251dde5937efab3]] This Miss U Hair is just pass shoulder length with good curl. This is a good quality character, cosplay, or Halloween wig. Cap construction is good and comfy, but no combs to secure in place, so it did slide around on my head. It came with a wig cap. The part is fluffy and thick, as is the hair line, so I was unable to get a natural look from forehead to hairline, but for the function of Cosplay character, this is on the higher quality.\nNice for Cosplay purposes.\nSam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nSam&Helen\n{'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\n[[VIDEOID:f429642b52f8b0f5ebb4606cb77edc77]] I love these magnetic eyelashes. It’s so much easier than applying glue, in my opinion. I did two thin layers of magnetic eyeliner and allowed to dry. It did stick to my upper lid when I moved my eyelids up as I waited for them to dry. Once dry, I used the tweezer to apply the magnet eyelash. Each eyelash has tiny magnetics that adhere to the liner. I was pleasantly surprised that it worked!! The tweezers was not helpful to me for applying, and the second lash I applied with my hands without a problem. Beautiful lashes!! Wore them all day yesterday and wasn’t uncomfortable at all. Didn’t come off in the wind going to dinner. I simply removed with my hands to replace on the storage palette and removed liner with coconut oil. Lashes are glamorous and reusable. LOVE THEM!!!\nWorks great for all day wear!!!\nAokiya Short Blonde Bob Wig with Bangs Ombre Brown Wigs for Women Straight Synthetic Cosplay Wigs (14 Inch)\nAokiya\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Aokiya', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.1 x 6.5 x 2.3 inches; 8.01 Ounces'}\n[[VIDEOID:b006e218d4cd890bb0d873b2068e6133]] This is a very pretty light brown ombré to blonde, above the shoulders, bob-style wig. Better than I expected! I was expecting a cosplay type, but this is a very natural and great quality wig! It didn’t have combs in the cap construction, but the adjustment hook straps in the back nape is present for tightening. Feels silky soft. Hair moves beautifully! The part is not a free- part and it will show some wefts if altered. I wanted to see if I could create a side vs middle part and was not successful. Overall, I’m surprised at the quality and realness of the wig! I recommend!\nGreat natural looking wig!!\nSUIBOBO skincare pink rose quartz jade roller and Essential Oil bottle eye roller-real jade crystal gem stone marble cuarzo ice cold anti aging anti puff facial face roller eye roller massager\nSUIBOBO\n['√ In Time Service -there is instruction paper in the set to help you to use them.And as you know the squeak free jade quartz roller is fragile, easy to be damage in transit, though we pack it very carefully. If you receive the broken jade eye roller, please contact us for new one or full refund.this item is made from 100% natural quartz stone so each piece will little different on color']\n{'Package Dimensions': '7.1 x 3.5 x 1.7 inches; 8.01 Ounces', 'UPC': '619470980783', 'Manufacturer': 'HENNSERY CRAFT LIMITED'}\nAn adorable set: soft snap close holder, pink rose quartz facial roller, essential oil roller-ball bottle with rose quartz pieces, essential oil pour filter, and essential oil bottle opener. The essential oil bottle rolls a smooth amount of my favorite RoseHip Oil on my face to follow up with a relaxing rose quartz face roller. Beautiful set! Calms my sensitive skin.\nOutstanding set!!!\nEMMOR Long Ash Blonde Wig for Women - Natural Straight Hair With Air Bang Wigs, Party Cosplay Daily Use\nEMMOR\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.19 x 9.29 x 2.72 inches; 10.62 Ounces'}\nI was surprised by the wig for a cosplay variety. It is very shiny and staticky, but a sprinkle of powder will tone that shine. I did it fast and it definitely needs a bit more powder, but it did reduce shine for a more realistic hair wig. The cap construction is very nice, but there are NO combs or clips, which is common for a banged wig. I’m a 21” wig wearer and this fit me comfortably with my long/thick hair in a bun at the nape of my neck. Long! I’m 5’2-ish and this hit me lower back. I brushed this wig several times and ran a dryer sheet over it for static. No loose hairs yet. Overall, this does look wiggy with shine and static, but for a cosplay wig, it lays very naturally and moves well. Decent wig for a natural wear and excellent wig for a cosplay wear!\nGreat Cosplay Wig!\n3 Pieces Messy Donut Chignons Hair Piece Scrunchies Synthetic Extensions Updo Hair Bun for Women Scrunchies #12/24 Dark Blonde\nSHINYSHOW\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'SHINYSHOW', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.94 x 3.94 x 1.18 inches; 2.47 Ounces', 'UPC': '738630490303'}\nWow, I can’t love these enough!! 3 curly bun wraps to add so much volume to my bun!! I got compliments on my hair all day by so many people!! The dark blonde matched my hair perfectly. I’m sleepy surprised by the quality. These are thick and lays pretty! No hair fell out and it only took me 5mins to pull my hair up, make a fast bun, use this curly bun wrap, and pull out some of my front curls! Fast, easy, and professional polished look in an instant. HUGE FAN!! Love these!!!\nBeautiful and Great Quality!\nMarshique Touch Fit Glitter Cream Shadow 0.2Oz (Peach Warm Orange Tangerine Sorbet) - Warm Orange Base, Opal Pearl Gold Sparkle Eyeshadow, Waterproof and Longlasting for Under Fat Eye\nMarshique\n{'Brand': 'Marshique', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Luminous,Sheer,Glitter,Shimmer', 'Special Feature': 'Waterproof', 'Number of Items': '1', 'Package Dimensions': '1.6 x 1.6 x 0.7 inches; 0.2 Ounces', 'Item model number': '0000'}\nI love the color! So summery and lightweight. Goes on smooth. It’s a tiny container. Easy to slip into a purse.\nGorgeous Color!\nBridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Gold 5.9\")\nJOMOQ\n{'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Gold', 'Size': '1 Count (Pack of 1)', 'Power Source': 'Manual', 'Package Dimensions': '5 x 4.13 x 0.94 inches; 3.21 Ounces', 'UPC': '756588246469'}\nThis hair comb is stunning! Very beautiful. The delicate wires can be manipulated and slightly adjusted to show the comb better. It’s a medium weight and the combs won’t hold my thick hair; but if I style it in an updo, then I can put the combs into the updo to stay better. It won’t comb much hair into a style securely with thick hair like mine, so I definitely have to use other tasters and than place this for beauty over function. Delicate and lovely for an all out dress up day. Love it!\nBeautifully crafted!\nBridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Silver 4.8\")\nJOMOQ\n{'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Silver', 'Power Source': 'Manual', 'Unit Count': '2.7161 Ounce', 'Package Dimensions': '4.96 x 4.17 x 0.75 inches; 2.4 Ounces', 'UPC': '756588246476'}\nBeautiful hair comb that’s light-medium weight. Holds well in my hair, but I need other hair fasteners to keep my hairstyle and then I place this comb into my hair. Lovely!!\nStunning!\nDARKLATER Butterfly Hair Clips for Girls,for Toddler Girls,Baby Girls and Women,Cute Hair Clips,Beautiful Hair Accessories,12 PCS\nDARKLATER\n{'Brand': 'DARKLATER', 'Hair Type': 'All', 'Age Range (Description)': 'Babies', 'Embellishment': 'Glitter', 'Theme': 'Butterfly', 'Package Dimensions': '5 x 3.35 x 0.67 inches; 1.13 Ounces', 'UPC': '750081432770'}\nOmg, these are so cute that I’m wearing them in my hair almost daily even though I got them for my grand-daughters, lol! Great way to finish off a hairstyle and I get compliments on my butterfly clasps! Great value and so pretty!! My girls love to wear them in their fine/thin hair and they stay in well. My hair is corse/thick and they stay put all workday! Love them!\nBeautiful Butterfly Barrettes!!\nVigorous Straight Highlights Wigs for Women Synthetic Long Highlight Lace Wigs Natural Looking Straight Wigs Middle Part\nVigorous\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Vigorous', 'Package Dimensions': '12.48 x 9.37 x 2.87 inches; 9.59 Ounces'}\n[[VIDEOID:2ed57e5b5a13fc41d14cf2ca6eb88928]] The Vigorous Highlighted wig is synthetic, but…. It makes for a great wig for good value. I save my human hair for certain occasions and this synthetic wig is ideal for when it is a grab and go situation. Does tangle a bit, but not terribly bad. A lot of hair so you feel the weight but I am use to that. Very long and lush. Nice hairline and part… not too very fake, but could use slight plucking. I use to feel weird wearing wigs out and thought people would tell… who cares if they do know? I have never encountered anyone saying I was wearing a wig… on the contrary- they compliment my hair. I do chose to tell them I have a wig on. It is fun and I wear it for me :) I like more clips to secure on my head, but good adjusting bra cap. I do not wear a wig cap. Great quality wig… I was surprised!!\nSurprisingly good quality wig\nL'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Item Form': 'Cream', 'Skin Type': 'Dry', 'Product Benefits': 'Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more', 'Material Feature': 'Natural', 'Product Dimensions': '2.9 x 2.9 x 2.5 inches; 6.38 Ounces', 'UPC': '810108190721', 'Manufacturer': \"L'ANGE HAIR\"}\nI am a fan of all things L’ange. It is a favorite brand of mine and I have a lot of their heat styling tools. This is a gentle salt scrub for my scalp. It felt amazing. It feels so clean now! The consistency is silky with bumps of salt. Smells pure and light - not overpowering aroma at all. A luxurious hair pampering scrub that keeps my dry scalp healthier. Huge fan!\nFeels amazing!\nBig Hair Claw Clips for Women and Girls - 4.3 Inch 8 Pcs Matte Claw Hair Clips for Thick Hair, Large Jaw Clips for Thin Hair, 2 Styles Strong Hold Hair Accessories for Girls\nHH Fashion\n{'Brand': 'HH Fashion', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Bow', 'Material': 'Plastic, Metal'}\nI have to be selective in my hair claw clips because I have thick, textured hair that is to my mid-back. These Big hair claw clips does the trick. I was pleasantly surprised that they stayed in my hair so well and kept my hair securely up. I love the two different styles of rounded and squared. I actually prefer the squared. Nice and big for thick hair!\nSecured my thick hair!\nBridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Silver 5.9\")\nJOMOQ\n{'Material': 'Pearl', 'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Silver', 'Size': '5.9 Inch (Pack of 1)', 'Package Dimensions': '5.67 x 3.98 x 1.46 inches; 2.82 Ounces', 'UPC': '756588246490'}\nIt is a very pretty hair comb that is securely fixed together on a thin comb. Placed in the hair with the comb teeth, it stayed in place for an updo. Has some bending capabilities to adjust to the curve of the head as needed. Stunning hair accessory!\nBeautiful!\nlorelo 20 pieces Hair Curlers, Hair Rollers Spiral Curls Styling Kit No Heat Hair Curlers with Styling Hooks for Girls Woman\nlorelo\n{'Number of Items': '20', 'Material': 'Silicone', 'Brand': 'Lorelo', 'Unit Count': '1.00 Count', 'Package Dimensions': '10.59 x 9.02 x 2.8 inches; 9.59 Ounces', 'UPC': '619156721396'}\nThe Lorelo 2-pc curlers did take me some time to figure out. I have long, thick hair so it takes my hair so long to dry that I was hoping the seemingly more airy design would give me heatless curls. It waved nicely.\nNice waves",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\nReview Date: 2019/07/06\nStore: YRMJK\nAverage Rating: 4.3\nProduct Details: {'Brand': 'YRMJK', 'Age Range (Description)': 'Adult', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 3.1 x 2.7 inches; 13.76 Ounces', 'UPC': '738426030676', 'Manufacturer': 'MUTTUS'}\nReview Text: [[VIDEOID:b2565b535e1d3f3297ca6703d7f26383]] A tip for those would never used an electric toothbrush: put the toothbrush into your mouth and then turn on (and off before removing from mouth). Lol, I got toothpaste everywhere and learned this the hard way. Functionally, the vibrations are powerful by default, so if you are sensitive like me, turn it down. I’ve used it 4 times now and the first time it was strange, but now I am use to it. There are 5 different pulsating settings (see video). The plus and minus icons allow for easy and quick adjustment of how hard/soft - fast/slow the vibrating brush-head will pulsate. The bristles on the brush attachment is firm, but soft on gums; so there is some bend to the bristles and was comfortable for me. It sits on a charger to power it up via usb cord that plugs into standard charger plug. The case is beyond awesome. I travel for conferences and this stores the brush and charger with the brush head in a beautiful pink bottom and clear top hard case. Easy to pack and go. My teeth feels very clean after using this electronic toothbrush. For my set, I have 5 extra brush head attachments for exchanging after wearing out. This set looks exactly like advertised. I love the pink design. It is long and slender with sliver trim. My video will show the different settings and I hope you can hear the slight vibration changes because you could easily tell from the sound of the pulse by which setting it is on through a couple of uses. My favorite thing about it is that the charger is small and doesn’t take up any room on the sink countertop. The travel case is sturdy. The quality of this brush is so great that I don’t want to ever go back to a standard manual toothbrush. I highly recommend if you need a travel brush that is electronic! Update: A week later and I still love it! Everything works very well!!\nReview Title: Great travel toothbrush!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Persephone Ombre Blonde Lace Front Wig Wavy Soft Brown Roots Ash Blonde Ombre Wigs for Women Glueless Long Wavy Synthetic Wig with Middle Parting Heat Resistant 22 Inches\nReview Date: 2020/06/15\nStore: Persephone\nAverage Rating: 4.1\nProduct Details: {'Color': 'Brown Roots Ash Blonde Ombre', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.7 x 6.2 x 2.3 inches; 14.39 Ounces', 'UPC': '708210345712'}\nReview Text: [[VIDEOID:e6486dec3002b28b72d65864eaf95d53]] Y’all!!! I can’t give this wig enough stars! For the price, this is an outstanding wig - Persephone Ombré Blonde! Now, I cut the pace all the way back and place it about 1-2” behind my hairline, so I’ve pulled out my front hair to blend with the wig. It does have wig combs to keep it secure and, although it comes with an awesome wig cap, I do NOT wear a cap. Stays on securely all day. Great wig cap construction with adjustable straps to help custom to head. Didn’t tangle. Soft! Huge fan!! This is an outstanding wig and the price is a great value!!! L O V E !!\nReview Title: LOVE!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Miss U Hair Long Wavy Dyeing Color Wig Burgundy Ombre Blonde Cosplay Costume Wig\nReview Date: 2020/06/15\nStore: M MISS U HAIR\nAverage Rating: 3.2\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'M MISS U HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.2 x 8 x 1.7 inches; 11.36 Ounces'}\nReview Text: [[VIDEOID:70e9f5c0d3612527c251dde5937efab3]] This Miss U Hair is just pass shoulder length with good curl. This is a good quality character, cosplay, or Halloween wig. Cap construction is good and comfy, but no combs to secure in place, so it did slide around on my head. It came with a wig cap. The part is fluffy and thick, as is the hair line, so I was unable to get a natural look from forehead to hairline, but for the function of Cosplay character, this is on the higher quality.\nReview Title: Nice for Cosplay purposes.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nReview Date: 2020/06/23\nStore: Sam&Helen\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nReview Text: [[VIDEOID:f429642b52f8b0f5ebb4606cb77edc77]] I love these magnetic eyelashes. It’s so much easier than applying glue, in my opinion. I did two thin layers of magnetic eyeliner and allowed to dry. It did stick to my upper lid when I moved my eyelids up as I waited for them to dry. Once dry, I used the tweezer to apply the magnet eyelash. Each eyelash has tiny magnetics that adhere to the liner. I was pleasantly surprised that it worked!! The tweezers was not helpful to me for applying, and the second lash I applied with my hands without a problem. Beautiful lashes!! Wore them all day yesterday and wasn’t uncomfortable at all. Didn’t come off in the wind going to dinner. I simply removed with my hands to replace on the storage palette and removed liner with coconut oil. Lashes are glamorous and reusable. LOVE THEM!!!\nReview Title: Works great for all day wear!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aokiya Short Blonde Bob Wig with Bangs Ombre Brown Wigs for Women Straight Synthetic Cosplay Wigs (14 Inch)\nReview Date: 2020/07/14\nStore: Aokiya\nAverage Rating: 3.5\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Aokiya', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.1 x 6.5 x 2.3 inches; 8.01 Ounces'}\nReview Text: [[VIDEOID:b006e218d4cd890bb0d873b2068e6133]] This is a very pretty light brown ombré to blonde, above the shoulders, bob-style wig. Better than I expected! I was expecting a cosplay type, but this is a very natural and great quality wig! It didn’t have combs in the cap construction, but the adjustment hook straps in the back nape is present for tightening. Feels silky soft. Hair moves beautifully! The part is not a free- part and it will show some wefts if altered. I wanted to see if I could create a side vs middle part and was not successful. Overall, I’m surprised at the quality and realness of the wig! I recommend!\nReview Title: Great natural looking wig!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SUIBOBO skincare pink rose quartz jade roller and Essential Oil bottle eye roller-real jade crystal gem stone marble cuarzo ice cold anti aging anti puff facial face roller eye roller massager\nReview Date: 2020/07/31\nStore: SUIBOBO\nProduct Description: ['√ In Time Service -there is instruction paper in the set to help you to use them.And as you know the squeak free jade quartz roller is fragile, easy to be damage in transit, though we pack it very carefully. If you receive the broken jade eye roller, please contact us for new one or full refund.this item is made from 100% natural quartz stone so each piece will little different on color']\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '7.1 x 3.5 x 1.7 inches; 8.01 Ounces', 'UPC': '619470980783', 'Manufacturer': 'HENNSERY CRAFT LIMITED'}\nReview Text: An adorable set: soft snap close holder, pink rose quartz facial roller, essential oil roller-ball bottle with rose quartz pieces, essential oil pour filter, and essential oil bottle opener. The essential oil bottle rolls a smooth amount of my favorite RoseHip Oil on my face to follow up with a relaxing rose quartz face roller. Beautiful set! Calms my sensitive skin.\nReview Title: Outstanding set!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EMMOR Long Ash Blonde Wig for Women - Natural Straight Hair With Air Bang Wigs, Party Cosplay Daily Use\nReview Date: 2020/08/03\nStore: EMMOR\nAverage Rating: 3.3\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.19 x 9.29 x 2.72 inches; 10.62 Ounces'}\nReview Text: I was surprised by the wig for a cosplay variety. It is very shiny and staticky, but a sprinkle of powder will tone that shine. I did it fast and it definitely needs a bit more powder, but it did reduce shine for a more realistic hair wig. The cap construction is very nice, but there are NO combs or clips, which is common for a banged wig. I’m a 21” wig wearer and this fit me comfortably with my long/thick hair in a bun at the nape of my neck. Long! I’m 5’2-ish and this hit me lower back. I brushed this wig several times and ran a dryer sheet over it for static. No loose hairs yet. Overall, this does look wiggy with shine and static, but for a cosplay wig, it lays very naturally and moves well. Decent wig for a natural wear and excellent wig for a cosplay wear!\nReview Title: Great Cosplay Wig!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Pieces Messy Donut Chignons Hair Piece Scrunchies Synthetic Extensions Updo Hair Bun for Women Scrunchies #12/24 Dark Blonde\nReview Date: 2020/08/15\nStore: SHINYSHOW\nAverage Rating: 3.9\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'SHINYSHOW', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.94 x 3.94 x 1.18 inches; 2.47 Ounces', 'UPC': '738630490303'}\nReview Text: Wow, I can’t love these enough!! 3 curly bun wraps to add so much volume to my bun!! I got compliments on my hair all day by so many people!! The dark blonde matched my hair perfectly. I’m sleepy surprised by the quality. These are thick and lays pretty! No hair fell out and it only took me 5mins to pull my hair up, make a fast bun, use this curly bun wrap, and pull out some of my front curls! Fast, easy, and professional polished look in an instant. HUGE FAN!! Love these!!!\nReview Title: Beautiful and Great Quality!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Marshique Touch Fit Glitter Cream Shadow 0.2Oz (Peach Warm Orange Tangerine Sorbet) - Warm Orange Base, Opal Pearl Gold Sparkle Eyeshadow, Waterproof and Longlasting for Under Fat Eye\nReview Date: 2021/06/27\nStore: Marshique\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Marshique', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Luminous,Sheer,Glitter,Shimmer', 'Special Feature': 'Waterproof', 'Number of Items': '1', 'Package Dimensions': '1.6 x 1.6 x 0.7 inches; 0.2 Ounces', 'Item model number': '0000'}\nReview Text: I love the color! So summery and lightweight. Goes on smooth. It’s a tiny container. Easy to slip into a purse.\nReview Title: Gorgeous Color!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Gold 5.9\")\nReview Date: 2021/07/17\nStore: JOMOQ\nAverage Rating: 4.2\nProduct Details: {'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Gold', 'Size': '1 Count (Pack of 1)', 'Power Source': 'Manual', 'Package Dimensions': '5 x 4.13 x 0.94 inches; 3.21 Ounces', 'UPC': '756588246469'}\nReview Text: This hair comb is stunning! Very beautiful. The delicate wires can be manipulated and slightly adjusted to show the comb better. It’s a medium weight and the combs won’t hold my thick hair; but if I style it in an updo, then I can put the combs into the updo to stay better. It won’t comb much hair into a style securely with thick hair like mine, so I definitely have to use other tasters and than place this for beauty over function. Delicate and lovely for an all out dress up day. Love it!\nReview Title: Beautifully crafted!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Silver 4.8\")\nReview Date: 2021/07/17\nStore: JOMOQ\nAverage Rating: 4.3\nProduct Details: {'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Silver', 'Power Source': 'Manual', 'Unit Count': '2.7161 Ounce', 'Package Dimensions': '4.96 x 4.17 x 0.75 inches; 2.4 Ounces', 'UPC': '756588246476'}\nReview Text: Beautiful hair comb that’s light-medium weight. Holds well in my hair, but I need other hair fasteners to keep my hairstyle and then I place this comb into my hair. Lovely!!\nReview Title: Stunning!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DARKLATER Butterfly Hair Clips for Girls,for Toddler Girls,Baby Girls and Women,Cute Hair Clips,Beautiful Hair Accessories,12 PCS\nReview Date: 2021/07/27\nStore: DARKLATER\nAverage Rating: 4.2\nProduct Details: {'Brand': 'DARKLATER', 'Hair Type': 'All', 'Age Range (Description)': 'Babies', 'Embellishment': 'Glitter', 'Theme': 'Butterfly', 'Package Dimensions': '5 x 3.35 x 0.67 inches; 1.13 Ounces', 'UPC': '750081432770'}\nReview Text: Omg, these are so cute that I’m wearing them in my hair almost daily even though I got them for my grand-daughters, lol! Great way to finish off a hairstyle and I get compliments on my butterfly clasps! Great value and so pretty!! My girls love to wear them in their fine/thin hair and they stay in well. My hair is corse/thick and they stay put all workday! Love them!\nReview Title: Beautiful Butterfly Barrettes!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vigorous Straight Highlights Wigs for Women Synthetic Long Highlight Lace Wigs Natural Looking Straight Wigs Middle Part\nReview Date: 2022/05/05\nStore: Vigorous\nAverage Rating: 3.9\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Vigorous', 'Package Dimensions': '12.48 x 9.37 x 2.87 inches; 9.59 Ounces'}\nReview Text: [[VIDEOID:2ed57e5b5a13fc41d14cf2ca6eb88928]] The Vigorous Highlighted wig is synthetic, but…. It makes for a great wig for good value. I save my human hair for certain occasions and this synthetic wig is ideal for when it is a grab and go situation. Does tangle a bit, but not terribly bad. A lot of hair so you feel the weight but I am use to that. Very long and lush. Nice hairline and part… not too very fake, but could use slight plucking. I use to feel weird wearing wigs out and thought people would tell… who cares if they do know? I have never encountered anyone saying I was wearing a wig… on the contrary- they compliment my hair. I do chose to tell them I have a wig on. It is fun and I wear it for me :) I like more clips to secure on my head, but good adjusting bra cap. I do not wear a wig cap. Great quality wig… I was surprised!!\nReview Title: Surprisingly good quality wig\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: L'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones\nReview Date: 2023/04/08\nStore: L'ANGE HAIR\nAverage Rating: 4.3\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Item Form': 'Cream', 'Skin Type': 'Dry', 'Product Benefits': 'Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more', 'Material Feature': 'Natural', 'Product Dimensions': '2.9 x 2.9 x 2.5 inches; 6.38 Ounces', 'UPC': '810108190721', 'Manufacturer': \"L'ANGE HAIR\"}\nReview Text: I am a fan of all things L’ange. It is a favorite brand of mine and I have a lot of their heat styling tools. This is a gentle salt scrub for my scalp. It felt amazing. It feels so clean now! The consistency is silky with bumps of salt. Smells pure and light - not overpowering aroma at all. A luxurious hair pampering scrub that keeps my dry scalp healthier. Huge fan!\nReview Title: Feels amazing!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Big Hair Claw Clips for Women and Girls - 4.3 Inch 8 Pcs Matte Claw Hair Clips for Thick Hair, Large Jaw Clips for Thin Hair, 2 Styles Strong Hold Hair Accessories for Girls\nReview Date: 2023/04/08\nStore: HH Fashion\nAverage Rating: 4.3\nProduct Details: {'Brand': 'HH Fashion', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Bow', 'Material': 'Plastic, Metal'}\nReview Text: I have to be selective in my hair claw clips because I have thick, textured hair that is to my mid-back. These Big hair claw clips does the trick. I was pleasantly surprised that they stayed in my hair so well and kept my hair securely up. I love the two different styles of rounded and squared. I actually prefer the squared. Nice and big for thick hair!\nReview Title: Secured my thick hair!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bridal Hair Comb, Wekin Wedding Hair Comb Wedding Hair Accessories for Brides, Handmade Floral Hair Piece for Wedding(Silver 5.9\")\nReview Date: 2023/04/15\nStore: JOMOQ\nAverage Rating: 4.4\nProduct Details: {'Material': 'Pearl', 'Brand': 'JOMOQ', 'Hair Type': 'Damaged', 'Color': 'Silver', 'Size': '5.9 Inch (Pack of 1)', 'Package Dimensions': '5.67 x 3.98 x 1.46 inches; 2.82 Ounces', 'UPC': '756588246490'}\nReview Text: It is a very pretty hair comb that is securely fixed together on a thin comb. Placed in the hair with the comb teeth, it stayed in place for an updo. Has some bending capabilities to adjust to the curve of the head as needed. Stunning hair accessory!\nReview Title: Beautiful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: lorelo 20 pieces Hair Curlers, Hair Rollers Spiral Curls Styling Kit No Heat Hair Curlers with Styling Hooks for Girls Woman\nReview Date: 2023/04/29\nStore: lorelo\nAverage Rating: 4.0\nProduct Details: {'Number of Items': '20', 'Material': 'Silicone', 'Brand': 'Lorelo', 'Unit Count': '1.00 Count', 'Package Dimensions': '10.59 x 9.02 x 2.8 inches; 9.59 Ounces', 'UPC': '619156721396'}\nReview Text: The Lorelo 2-pc curlers did take me some time to figure out. I have long, thick hair so it takes my hair so long to dry that I was hoping the seemingly more airy design would give me heatless curls. It waved nicely.\nReview Title: Nice waves\nRating: 4.0\n--------------------------------------------------",
  "raw_response": "**Key Preferences and Trends:**\n\n1. **Hair Products**: Strong interest in wigs, hairpieces, and accessories, often prioritizing quality and natural appearance. Purchaser appreciates features like softness, secure fit, and ease of styling.\n\n2. **Beauty Tools**: Frequent selection of beauty tools, particularly magnetic eyelashes and facial rollers, indicating a preference for innovative and user-friendly cosmetic products.\n\n3. **Travel Convenience**: Consistent preference for travel-friendly designs in hair and grooming tools, as evidenced by purchases featuring compact cases and efficient charging solutions.\n\n4. **Value for Money**: User seeks high-quality items at good prices, as demonstrated by glowing reviews of budget-friendly wigs and beauty accessories, reflecting an appreciation of great value.\n\n5. **Aesthetic Appeal**: Strong inclination towards visually appealing products such as pastel colors in beauty tools and stylish designs in hair accessories, highlighting the importance of aesthetics in purchasing decisions.\n\n6. **Functionality and Comfort**: Positive feedback on product functionality and comfort, especially in hair accessories and grooming devices, indicating that ease of use is essential.\n\n7. **Routine Enhancement**: Interest in products that enhance daily beauty routines, such as scalp scrubs and eyelash kits, demonstrating a desire for pampering and self-care. \n\nOverall, this shopper shows a blend of practicality and aesthetic appreciation, predominantly focused on hair care and beauty products that offer convenience and quality.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Beautiful lashes!",
    "text": "I love these magnetic lashes. So easy to apply the magnetic liner and allow the lash to adhere to my eyelid. There are 5 sets of lashes. The magnet lashes are really pretty and stay secure. They blend with my eyelashes. I am able to reuse them. Comes with scissors to trim to fit the eye and lash grippers for easy application. This would make a great gift-set!  Too Beautiful! I love these!!!",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61aM-88ksuL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61aM-88ksuL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61aM-88ksuL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/717HzXT0c6L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/717HzXT0c6L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/717HzXT0c6L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71iZZHaOiJL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71iZZHaOiJL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71iZZHaOiJL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/81cCNK+8GdL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/81cCNK+8GdL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/81cCNK+8GdL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B097ZQQMLN",
    "parent_asin": "B097ZQQMLN",
    "user_id": "AGRX7ZI7LBRKIZEEVAJFE56T2UMA",
    "timestamp": "2023-05-11 17:51:09.982000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Magnetic Lashes - Magnetic Eyelashes with 5D Natural Look, 10 Magnets, Long Lasting, 5 Pairs Magnetic Eyelash Kit, Thick False Eyelashes, Easy to Apply & Remove, Easy Eyelashes for Beginners",
    "average_rating": 3.6,
    "rating_number": 33,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51jYcRdhemS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51jYcRdhemS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81XouE2OVyS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51I+zJC6RMS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51I+zJC6RMS.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71l7jKFTHZS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Fj8Wt7UGS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Fj8Wt7UGS.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81jaW-EMKdS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51RYVA6n6BS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51RYVA6n6BS.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/715EIHzgQmS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Xzfed+wPS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Xzfed+wPS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81+mywfdjzS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51CTNRRYYiS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51CTNRRYYiS.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71ZnUVXxtpS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61vwa540lbS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/61vwa540lbS.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/81VgJlPb6zS._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "MECAPO",
    "categories": [],
    "details": {
      "Product Dimensions": "9 x 7.6 x 0.6 inches; 3.84 Ounces",
      "Item model number": "MEL-10",
      "UPC": "732376671064"
    },
    "bought_together": null
  }
}