{
  "user_id": "AGTGHYRTZXKX4AIL42A3FKWR7SOQ",
  "summary": "=== Purchase Information ===\nProduct Title: C'est Moi Gentle Cleansing Water | Gentle, Fragrance-Free Cleanser Removes Makeup and Refreshes Skin, Made with Cornflower Water, Aloe Vera, and Strawberry, Kiwi, and Apple Extracts | 5.9 fl oz.\nReview Date: 2020/09/19\nStore: C'est Moi\nAverage Rating: 4.4\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'Acne Prone,Sensitive', 'Brand': \"C'est Moi\", 'Scent': 'Kiwi, Strawberry, Unscented, Aloe Vera', 'Age Range (Description)': 'Adult', 'Product Dimensions': '1.84 x 1.84 x 6.06 inches; 7.69 Ounces', 'UPC': '039897626055'}\nReview Text: This cleanser removed my waterproof mascara and eyeliner effortlessly without leaving any residue behind, but left my skin feeling dry and tight. Of course that went away as soon as I applied my moisturizer. If you want something that removes make up quick and effectively then get this cleanser but don't expect your skin to feel soft and hydrated after using this.\nReview Title: Removes waterproof makeup effectively\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MAD | Cosmetic's Makeup Remover Cleansing Towelettes, Daily cleansing face wipes to remove waterproof mascara, alcohol free , with Vitamin E 25 count\nReview Date: 2020/10/26\nStore: JUST FOR TOTS BY MAD\nAverage Rating: 3.3\nProduct Details: {'Brand': 'JUST FOR TOTS BY MAD', 'Skin Type': 'Oily', 'Unit Count': '25.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.3 x 7.87 x 1.97 inches; 7.16 Ounces', 'UPC': '685757511926'}\nReview Text: I was excited to get this product, but unfortunately it doesn't work at all. I don't put a lot of make up on. My make up routine is eyeliner, mascara and blush. This makeup remover towelettes doesn't have enough moisture to do the job right, and it dried out quickly as I was wiping my face with it. All it did was smudge the make up around my eyes leaving me with racoon eyes. Once my eyes started to feel irritated I stopped using it, and I used Garnier cleansing water with a cotton pad. I took a picture of the towelette and the cotton pad side by side to show how much make up this product left behind. Also, this cleanser smells so bad that I had to hold my breath when using it. I don't recommend this cleanser at all.\nReview Title: Smells terrible, dries out quickly, doesn't remove make up\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Follain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nReview Date: 2020/11/30\nStore: Follain\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nReview Text: This soap doesn't have the best scent, but it is very creamy and moisturizing. It is a big bar of soap too so it will last me a long time. Because of its creamy texture, I used this soap to shave instead of using my shaving cream and it did a wonderful job! It makes me feel clean and fresh after every shower.\nReview Title: Very creamy and big bar of soap\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Roller for Face & Eye by Charmlily, Puffiness, Migraine, Pain Relief - Cold Facial Massager Treatment to Reduce Puffy Face & Tighten Pores, Under Eye Wrinkles (Blue)\nReview Date: 2020/12/21\nStore: CHARMLILY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'CHARMLILY', 'Special Feature': 'Heat', 'Is Cordless?': 'Yes', 'Product Grade': 'Home', 'Style': 'Rustic', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 3.54 x 2.44 inches; 5.61 Ounces', 'UPC': '679360114261', 'Manufacturer': 'CHARMLILY'}\nReview Text: I've never heard an ice roller before and as soon as I saw this I knew exactly what I would use it for. I have headache and neck pain everyday. I normally use an ice pack for aches and pain but replaced it with this roller. It massages my tight neck muscles and numbs the pain quickly. This roller is way better and more comfortable than a regular ice pack.\nReview Title: Easy to use, helps with headache\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pet Tear Stain Remover Comb, 8 Pcs Double-Sided Dog Eye Comb Brush, Double Head Grooming Comb, Multipurpose Tool for Small Pet Cat Dogs Crust and Mucus Removal (Silver & Black)\nReview Date: 2021/03/10\nStore: LBSXQGS\nAverage Rating: 3.5\nProduct Details: {'Material': 'Stainless Steel', 'Brand': 'LBSXQGS', 'Hair Type': 'Thick', 'Color': 'Silver', 'Size': 'Small', 'Package Dimensions': '9.76 x 6.89 x 0.35 inches; 4.94 Ounces', 'UPC': '805110051801'}\nReview Text: This double sided brush cleans my dog's eye area effectively. The pin side is very pointy and sharp so be very careful when brushing. I use the soft brush side of it when I apply my dog's eye stain remover gel. It distributes the gel better than using my fingers. The only thing that concerns me is the pin side for wiggly dogs. If your dog moves around constantly during grooming then this brush is not for you. My Mal-Shi is very calm during grooming so he just stands still, but my Shih Tzu is very wiggly, so I can't use this brush on him. The pin side is like needles, if he moves his head slightly he would get injured. I can't risk it.\nReview Title: Effective, but not for wiggly dogs\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heyedrate Activated Charcoal Soap Bar and Face Wash | Organic, Vegan, Natural Soap made with Dead Sea Mud and Our Essential Oil Blend (1 Pack (5 Ounces))\nReview Date: 2021/03/22\nStore: Eye Love\nAverage Rating: 4.4\nProduct Details: {'Item Form': 'Bar', 'Brand': 'Eye Love', 'Scent': 'Eucalyptus, Coconut, Grapefruit, Rosemary', 'Material Feature': 'Organic, Natural, Vegan', 'Age Range (Description)': 'Adult', 'Product Dimensions': '4 x 1 x 1 inches; 4.97 Ounces', 'UPC': '850436007827'}\nReview Text: I am not stranger to charcoal facial soap. I used to use the liquid version of it and got great results in the past. Since spring is here, I wanted to get rid of dead skin and rejuvenate my skin. This charcoal soap doesn't lather a lot but it is as effective as the liquid one. I distributed it using my silicone brush cleaner and got an amazing result. My skin feels cleaner, brighter and smoother. All the combination of natural ingredients in it nourishes my skin. This soap bar is going to last me a long time. Great value for what you get.\nReview Title: Makes skin feel smoother and look radiant\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Polish Gel Remover Tools Kit for Women with Nail Clip Caps, Nail File, Nail Remover Cotton Pads,Brush, 2-in-1 Cuticle Scraper and Pusher, Nail Separator\nReview Date: 2021/04/01\nStore: Lahien\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Lahien', 'Item Form': 'Pad', 'Unit Count': '5.2911 Ounce', 'Package Dimensions': '7.99 x 5.82 x 1.69 inches; 4.16 Ounces', 'UPC': '782910194573'}\nReview Text: I recently got a gel nail polish starter kit for myself. It was my first time doing gel nail and I loved it, but I didn't realize gel polish needs to be removed using a special technique. That's how I came across with this remover kit and I am glad I ordered it. I guess some people wrap aluminum foil around their nails, but I don't know how efficient that is. After I dipped the cotton pads in nail polish remover, I wrapped them around my nails and put the nail clippers on for 15 minutes. When I took them off, the gel polish looked soft and some of them were already peeled, so I used the scrapper to get rid of the rest of the polish, and filed my nails to smooth them out. That's it! This kit is very easy to use and does the job.\nReview Title: Easy to use, does the job quickly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yayoge Gel Nail Polish Kit ，6 Colors Gel Nail Polish Base and Top Coat ，UV Gel Nail Polish Set ，Soak Off Gel Nail Art Manicure Kit, Ideal Gifts DIY Salon and Home\nReview Date: 2021/04/08\nStore: yayoge\nAverage Rating: 3.1\nProduct Details: {'Brand': 'Yayoge', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Special Feature': 'Long-lasting', 'Age Range (Description)': 'Adult', 'Liquid Volume': '0.33 Fluid Ounces', 'Item Dimensions LxWxH': '8.66 x 7.09 x 2.36 inches', 'Product Dimensions': '8.66 x 7.09 x 2.36 inches; 13.76 Ounces'}\nReview Text: Before I cured my nails with the UV light, I applied different colors on each nail to see which one would compliment my skin. Unfortunately, I didn't like any of the colors in this set. Two of the gel polish are the same exact color, so I received 5 different colors not 6. The title of this product claims that it comes with a UV lamp, but it doesn't. I am glad I tested the colors on my nails before going further. Otherwise removal process is another painful process.\nReview Title: UV lamp is not included, the colors didn't look good on my nails\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Plant Therapy Natural Acetone Free Nail Polish Remover 6 fl oz One Touch Dispensing Bottle with Flip Top Cap Tropical Flower Scent\nReview Date: 2021/04/23\nStore: Plant Therapy\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Plant Therapy', 'Item Form': 'Liquid', 'Item Weight': '6.24 Ounces', 'Number of Items': '1', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '5.1 x 2.2 x 2.2 inches; 6.24 Ounces', 'UPC': '680912056168'}\nReview Text: This is the most nourishing nail polish remover I've ever used. It hydrates my cuticles and makes my nails look shiny. The only bad thing is that it doesn't remove nail polish easily. I had to put a lot of pressure on and go over a nail multiple times to be able to remove the nail polish. Let's put it this way, if I was wiping my nails with a regular acetone it would have taken me couple swipes, but with this nail polish remover it took 15 swipes. I would still prefer this remover because it didn't dry my nails. My nails look like I just applied cuticle oil. It smell really good too.\nReview Title: Nourishing nail polish remover\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Got2b Glued Spray Wax with 2-in-1 Dual Nozzle, 8 oz\nReview Date: 2021/04/25\nStore: Got2B\nProduct Description: ['The first dual-finish spray wax has officially hit the shelves! The got2b glued Spray Wax provides two looks with one product. So whether you want flexible texture or structured hold, this product has you covered! Best of all, this lightweight formula doesn’t leave your hair feeling sticky or crunchy. Create your own look and style. Turn to position 1 for flexible texture, turn to position 2 for structured hold. Be whoever you want 2b with got2b glued Spray Wax!']\nAverage Rating: 4.2\nProduct Details: {'Product Benefits': 'Firm Hold', 'Hair Type': 'All', 'Scent': 'Unscented', 'Liquid Volume': '8 Fluid Ounces', 'Item Form': 'Wax', 'Product Dimensions': '2 x 2 x 8.38 inches; 9.87 Ounces', 'Item model number': '31307', 'UPC': '017000313078', 'Manufacturer': 'AmazonUs/DIAW7', 'Country of Origin': 'USA'}\nReview Text: This is the waxiest and the most stickiest hair spray I've ever used. I touched my hair by accident and had to wash my hand, because it made my hand sticky. If I use this hair spray everyday then I have to wash my hair everyday too. After spraying this on my hair, it made it look like I didn't wash my hair for two weeks. It doesn't smell good either. I don't like this spray at all.\nReview Title: Makes hair feel waxy and sticky\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CAXIRO IPL Hair Removal Device for Women and Man, Permanent Reduction in Hair Regrowth for Body, Face & Precision Areas (Bikini and Underarms)\nReview Date: 2021/09/19\nStore: CAXIRO\nAverage Rating: 2.8\nProduct Details: {'Package Dimensions': '7.76 x 7.68 x 2.32 inches; 1.48 Pounds', 'UPC': '791324774318'}\nReview Text: I have been using this hair removal device for 2 months now. I used it once every 2 weeks so I've used it 5 times so far. Now, the sessions will be only once a month until all the unwated hair is removed. The manufacturer recommends using it once every 2 weeks for the first 5 sessions and then once a month after that, so using it multiple times a week won't change the outcome. The areas I use this device are my legs, under arms, bikini area and upper lip. The only difference I've noticed so far is the upper lip hair. It is growing significantly less, like almost 90% is gone. The rest of the body hair still grows the same amount, but the hair started to grow softer. I assume the hair is finally becoming weaker. I am half Greek and half Italian, I have olive skin color with dark hair, so it might take over a year for me to see some results. Overall, the device is very easy to use and it is painless, but it gets super hot to the touch after about 5-10 minutes of continues usage. I use the device on my legs first and then take a break until it cools down, and then I continue using it on other parts of the body and stop to cool it down again. I have to admit it is frustrating to stop the session to cool down the device. I don't know if other hair removal devices get this hot. This is my first time using something like this so I can't compare.\nReview Title: Painless and easy to use, but the device gets super hot\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Women Ultra Smooth Razor Womens Razors for Shaving Comfortable handle 5-blade Razor + 2 Refill Blades for a Smooth and safety Shave Reusable Razors for Girls Women\nReview Date: 2021/09/23\nStore: RONGCHUANG\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '8 x 5 x 1 inches; 7.41 Ounces', 'UPC': '607816401771'}\nReview Text: [[VIDEOID:605657cac95f549a7d3c2e340303de40]] I love the sleek design of this razor and the ceramic base it comes with. The razor gives a super close shave and makes my skin feel soft and smooth. The only thing that makes me nervous is the handle. It becomes slippery in the shower so I can't get a good grip. It worries me that I will cut myself when I am shaving. I searched if the company sells refill blades for this but they don't have them. You will have to purchase the whole set again, so that is something to think about before purchasing.\nReview Title: The handle becomes slippery in the shower\nRating: 3.0\n--------------------------------------------------",
  "reference": "C'est Moi Gentle Cleansing Water | Gentle, Fragrance-Free Cleanser Removes Makeup and Refreshes Skin, Made with Cornflower Water, Aloe Vera, and Strawberry, Kiwi, and Apple Extracts | 5.9 fl oz.\nC'est Moi\n{'Item Form': 'Liquid', 'Skin Type': 'Acne Prone,Sensitive', 'Brand': \"C'est Moi\", 'Scent': 'Kiwi, Strawberry, Unscented, Aloe Vera', 'Age Range (Description)': 'Adult', 'Product Dimensions': '1.84 x 1.84 x 6.06 inches; 7.69 Ounces', 'UPC': '039897626055'}\nThis cleanser removed my waterproof mascara and eyeliner effortlessly without leaving any residue behind, but left my skin feeling dry and tight. Of course that went away as soon as I applied my moisturizer. If you want something that removes make up quick and effectively then get this cleanser but don't expect your skin to feel soft and hydrated after using this.\nRemoves waterproof makeup effectively\nMAD | Cosmetic's Makeup Remover Cleansing Towelettes, Daily cleansing face wipes to remove waterproof mascara, alcohol free , with Vitamin E 25 count\nJUST FOR TOTS BY MAD\n{'Brand': 'JUST FOR TOTS BY MAD', 'Skin Type': 'Oily', 'Unit Count': '25.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.3 x 7.87 x 1.97 inches; 7.16 Ounces', 'UPC': '685757511926'}\nI was excited to get this product, but unfortunately it doesn't work at all. I don't put a lot of make up on. My make up routine is eyeliner, mascara and blush. This makeup remover towelettes doesn't have enough moisture to do the job right, and it dried out quickly as I was wiping my face with it. All it did was smudge the make up around my eyes leaving me with racoon eyes. Once my eyes started to feel irritated I stopped using it, and I used Garnier cleansing water with a cotton pad. I took a picture of the towelette and the cotton pad side by side to show how much make up this product left behind. Also, this cleanser smells so bad that I had to hold my breath when using it. I don't recommend this cleanser at all.\nSmells terrible, dries out quickly, doesn't remove make up\nFollain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nFollain\n{'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nThis soap doesn't have the best scent, but it is very creamy and moisturizing. It is a big bar of soap too so it will last me a long time. Because of its creamy texture, I used this soap to shave instead of using my shaving cream and it did a wonderful job! It makes me feel clean and fresh after every shower.\nVery creamy and big bar of soap\nIce Roller for Face & Eye by Charmlily, Puffiness, Migraine, Pain Relief - Cold Facial Massager Treatment to Reduce Puffy Face & Tighten Pores, Under Eye Wrinkles (Blue)\nCHARMLILY\n{'Brand': 'CHARMLILY', 'Special Feature': 'Heat', 'Is Cordless?': 'Yes', 'Product Grade': 'Home', 'Style': 'Rustic', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 3.54 x 2.44 inches; 5.61 Ounces', 'UPC': '679360114261', 'Manufacturer': 'CHARMLILY'}\nI've never heard an ice roller before and as soon as I saw this I knew exactly what I would use it for. I have headache and neck pain everyday. I normally use an ice pack for aches and pain but replaced it with this roller. It massages my tight neck muscles and numbs the pain quickly. This roller is way better and more comfortable than a regular ice pack.\nEasy to use, helps with headache\nPet Tear Stain Remover Comb, 8 Pcs Double-Sided Dog Eye Comb Brush, Double Head Grooming Comb, Multipurpose Tool for Small Pet Cat Dogs Crust and Mucus Removal (Silver & Black)\nLBSXQGS\n{'Material': 'Stainless Steel', 'Brand': 'LBSXQGS', 'Hair Type': 'Thick', 'Color': 'Silver', 'Size': 'Small', 'Package Dimensions': '9.76 x 6.89 x 0.35 inches; 4.94 Ounces', 'UPC': '805110051801'}\nThis double sided brush cleans my dog's eye area effectively. The pin side is very pointy and sharp so be very careful when brushing. I use the soft brush side of it when I apply my dog's eye stain remover gel. It distributes the gel better than using my fingers. The only thing that concerns me is the pin side for wiggly dogs. If your dog moves around constantly during grooming then this brush is not for you. My Mal-Shi is very calm during grooming so he just stands still, but my Shih Tzu is very wiggly, so I can't use this brush on him. The pin side is like needles, if he moves his head slightly he would get injured. I can't risk it.\nEffective, but not for wiggly dogs\nHeyedrate Activated Charcoal Soap Bar and Face Wash | Organic, Vegan, Natural Soap made with Dead Sea Mud and Our Essential Oil Blend (1 Pack (5 Ounces))\nEye Love\n{'Item Form': 'Bar', 'Brand': 'Eye Love', 'Scent': 'Eucalyptus, Coconut, Grapefruit, Rosemary', 'Material Feature': 'Organic, Natural, Vegan', 'Age Range (Description)': 'Adult', 'Product Dimensions': '4 x 1 x 1 inches; 4.97 Ounces', 'UPC': '850436007827'}\nI am not stranger to charcoal facial soap. I used to use the liquid version of it and got great results in the past. Since spring is here, I wanted to get rid of dead skin and rejuvenate my skin. This charcoal soap doesn't lather a lot but it is as effective as the liquid one. I distributed it using my silicone brush cleaner and got an amazing result. My skin feels cleaner, brighter and smoother. All the combination of natural ingredients in it nourishes my skin. This soap bar is going to last me a long time. Great value for what you get.\nMakes skin feel smoother and look radiant\nNail Polish Gel Remover Tools Kit for Women with Nail Clip Caps, Nail File, Nail Remover Cotton Pads,Brush, 2-in-1 Cuticle Scraper and Pusher, Nail Separator\nLahien\n{'Brand': 'Lahien', 'Item Form': 'Pad', 'Unit Count': '5.2911 Ounce', 'Package Dimensions': '7.99 x 5.82 x 1.69 inches; 4.16 Ounces', 'UPC': '782910194573'}\nI recently got a gel nail polish starter kit for myself. It was my first time doing gel nail and I loved it, but I didn't realize gel polish needs to be removed using a special technique. That's how I came across with this remover kit and I am glad I ordered it. I guess some people wrap aluminum foil around their nails, but I don't know how efficient that is. After I dipped the cotton pads in nail polish remover, I wrapped them around my nails and put the nail clippers on for 15 minutes. When I took them off, the gel polish looked soft and some of them were already peeled, so I used the scrapper to get rid of the rest of the polish, and filed my nails to smooth them out. That's it! This kit is very easy to use and does the job.\nEasy to use, does the job quickly\nYayoge Gel Nail Polish Kit ，6 Colors Gel Nail Polish Base and Top Coat ，UV Gel Nail Polish Set ，Soak Off Gel Nail Art Manicure Kit, Ideal Gifts DIY Salon and Home\nyayoge\n{'Brand': 'Yayoge', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Special Feature': 'Long-lasting', 'Age Range (Description)': 'Adult', 'Liquid Volume': '0.33 Fluid Ounces', 'Item Dimensions LxWxH': '8.66 x 7.09 x 2.36 inches', 'Product Dimensions': '8.66 x 7.09 x 2.36 inches; 13.76 Ounces'}\nBefore I cured my nails with the UV light, I applied different colors on each nail to see which one would compliment my skin. Unfortunately, I didn't like any of the colors in this set. Two of the gel polish are the same exact color, so I received 5 different colors not 6. The title of this product claims that it comes with a UV lamp, but it doesn't. I am glad I tested the colors on my nails before going further. Otherwise removal process is another painful process.\nUV lamp is not included, the colors didn't look good on my nails\nPlant Therapy Natural Acetone Free Nail Polish Remover 6 fl oz One Touch Dispensing Bottle with Flip Top Cap Tropical Flower Scent\nPlant Therapy\n{'Brand': 'Plant Therapy', 'Item Form': 'Liquid', 'Item Weight': '6.24 Ounces', 'Number of Items': '1', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '5.1 x 2.2 x 2.2 inches; 6.24 Ounces', 'UPC': '680912056168'}\nThis is the most nourishing nail polish remover I've ever used. It hydrates my cuticles and makes my nails look shiny. The only bad thing is that it doesn't remove nail polish easily. I had to put a lot of pressure on and go over a nail multiple times to be able to remove the nail polish. Let's put it this way, if I was wiping my nails with a regular acetone it would have taken me couple swipes, but with this nail polish remover it took 15 swipes. I would still prefer this remover because it didn't dry my nails. My nails look like I just applied cuticle oil. It smell really good too.\nNourishing nail polish remover\nGot2b Glued Spray Wax with 2-in-1 Dual Nozzle, 8 oz\nGot2B\n['The first dual-finish spray wax has officially hit the shelves! The got2b glued Spray Wax provides two looks with one product. So whether you want flexible texture or structured hold, this product has you covered! Best of all, this lightweight formula doesn’t leave your hair feeling sticky or crunchy. Create your own look and style. Turn to position 1 for flexible texture, turn to position 2 for structured hold. Be whoever you want 2b with got2b glued Spray Wax!']\n{'Product Benefits': 'Firm Hold', 'Hair Type': 'All', 'Scent': 'Unscented', 'Liquid Volume': '8 Fluid Ounces', 'Item Form': 'Wax', 'Product Dimensions': '2 x 2 x 8.38 inches; 9.87 Ounces', 'Item model number': '31307', 'UPC': '017000313078', 'Manufacturer': 'AmazonUs/DIAW7', 'Country of Origin': 'USA'}\nThis is the waxiest and the most stickiest hair spray I've ever used. I touched my hair by accident and had to wash my hand, because it made my hand sticky. If I use this hair spray everyday then I have to wash my hair everyday too. After spraying this on my hair, it made it look like I didn't wash my hair for two weeks. It doesn't smell good either. I don't like this spray at all.\nMakes hair feel waxy and sticky\nCAXIRO IPL Hair Removal Device for Women and Man, Permanent Reduction in Hair Regrowth for Body, Face & Precision Areas (Bikini and Underarms)\nCAXIRO\n{'Package Dimensions': '7.76 x 7.68 x 2.32 inches; 1.48 Pounds', 'UPC': '791324774318'}\nI have been using this hair removal device for 2 months now. I used it once every 2 weeks so I've used it 5 times so far. Now, the sessions will be only once a month until all the unwated hair is removed. The manufacturer recommends using it once every 2 weeks for the first 5 sessions and then once a month after that, so using it multiple times a week won't change the outcome. The areas I use this device are my legs, under arms, bikini area and upper lip. The only difference I've noticed so far is the upper lip hair. It is growing significantly less, like almost 90% is gone. The rest of the body hair still grows the same amount, but the hair started to grow softer. I assume the hair is finally becoming weaker. I am half Greek and half Italian, I have olive skin color with dark hair, so it might take over a year for me to see some results. Overall, the device is very easy to use and it is painless, but it gets super hot to the touch after about 5-10 minutes of continues usage. I use the device on my legs first and then take a break until it cools down, and then I continue using it on other parts of the body and stop to cool it down again. I have to admit it is frustrating to stop the session to cool down the device. I don't know if other hair removal devices get this hot. This is my first time using something like this so I can't compare.\nPainless and easy to use, but the device gets super hot\nWomen Ultra Smooth Razor Womens Razors for Shaving Comfortable handle 5-blade Razor + 2 Refill Blades for a Smooth and safety Shave Reusable Razors for Girls Women\nRONGCHUANG\n{'Package Dimensions': '8 x 5 x 1 inches; 7.41 Ounces', 'UPC': '607816401771'}\n[[VIDEOID:605657cac95f549a7d3c2e340303de40]] I love the sleek design of this razor and the ceramic base it comes with. The razor gives a super close shave and makes my skin feel soft and smooth. The only thing that makes me nervous is the handle. It becomes slippery in the shower so I can't get a good grip. It worries me that I will cut myself when I am shaving. I searched if the company sells refill blades for this but they don't have them. You will have to purchase the whole set again, so that is something to think about before purchasing.\nThe handle becomes slippery in the shower",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: C'est Moi Gentle Cleansing Water | Gentle, Fragrance-Free Cleanser Removes Makeup and Refreshes Skin, Made with Cornflower Water, Aloe Vera, and Strawberry, Kiwi, and Apple Extracts | 5.9 fl oz.\nReview Date: 2020/09/19\nStore: C'est Moi\nAverage Rating: 4.4\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'Acne Prone,Sensitive', 'Brand': \"C'est Moi\", 'Scent': 'Kiwi, Strawberry, Unscented, Aloe Vera', 'Age Range (Description)': 'Adult', 'Product Dimensions': '1.84 x 1.84 x 6.06 inches; 7.69 Ounces', 'UPC': '039897626055'}\nReview Text: This cleanser removed my waterproof mascara and eyeliner effortlessly without leaving any residue behind, but left my skin feeling dry and tight. Of course that went away as soon as I applied my moisturizer. If you want something that removes make up quick and effectively then get this cleanser but don't expect your skin to feel soft and hydrated after using this.\nReview Title: Removes waterproof makeup effectively\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MAD | Cosmetic's Makeup Remover Cleansing Towelettes, Daily cleansing face wipes to remove waterproof mascara, alcohol free , with Vitamin E 25 count\nReview Date: 2020/10/26\nStore: JUST FOR TOTS BY MAD\nAverage Rating: 3.3\nProduct Details: {'Brand': 'JUST FOR TOTS BY MAD', 'Skin Type': 'Oily', 'Unit Count': '25.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.3 x 7.87 x 1.97 inches; 7.16 Ounces', 'UPC': '685757511926'}\nReview Text: I was excited to get this product, but unfortunately it doesn't work at all. I don't put a lot of make up on. My make up routine is eyeliner, mascara and blush. This makeup remover towelettes doesn't have enough moisture to do the job right, and it dried out quickly as I was wiping my face with it. All it did was smudge the make up around my eyes leaving me with racoon eyes. Once my eyes started to feel irritated I stopped using it, and I used Garnier cleansing water with a cotton pad. I took a picture of the towelette and the cotton pad side by side to show how much make up this product left behind. Also, this cleanser smells so bad that I had to hold my breath when using it. I don't recommend this cleanser at all.\nReview Title: Smells terrible, dries out quickly, doesn't remove make up\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Follain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nReview Date: 2020/11/30\nStore: Follain\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nReview Text: This soap doesn't have the best scent, but it is very creamy and moisturizing. It is a big bar of soap too so it will last me a long time. Because of its creamy texture, I used this soap to shave instead of using my shaving cream and it did a wonderful job! It makes me feel clean and fresh after every shower.\nReview Title: Very creamy and big bar of soap\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Roller for Face & Eye by Charmlily, Puffiness, Migraine, Pain Relief - Cold Facial Massager Treatment to Reduce Puffy Face & Tighten Pores, Under Eye Wrinkles (Blue)\nReview Date: 2020/12/21\nStore: CHARMLILY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'CHARMLILY', 'Special Feature': 'Heat', 'Is Cordless?': 'Yes', 'Product Grade': 'Home', 'Style': 'Rustic', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 3.54 x 2.44 inches; 5.61 Ounces', 'UPC': '679360114261', 'Manufacturer': 'CHARMLILY'}\nReview Text: I've never heard an ice roller before and as soon as I saw this I knew exactly what I would use it for. I have headache and neck pain everyday. I normally use an ice pack for aches and pain but replaced it with this roller. It massages my tight neck muscles and numbs the pain quickly. This roller is way better and more comfortable than a regular ice pack.\nReview Title: Easy to use, helps with headache\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pet Tear Stain Remover Comb, 8 Pcs Double-Sided Dog Eye Comb Brush, Double Head Grooming Comb, Multipurpose Tool for Small Pet Cat Dogs Crust and Mucus Removal (Silver & Black)\nReview Date: 2021/03/10\nStore: LBSXQGS\nAverage Rating: 3.5\nProduct Details: {'Material': 'Stainless Steel', 'Brand': 'LBSXQGS', 'Hair Type': 'Thick', 'Color': 'Silver', 'Size': 'Small', 'Package Dimensions': '9.76 x 6.89 x 0.35 inches; 4.94 Ounces', 'UPC': '805110051801'}\nReview Text: This double sided brush cleans my dog's eye area effectively. The pin side is very pointy and sharp so be very careful when brushing. I use the soft brush side of it when I apply my dog's eye stain remover gel. It distributes the gel better than using my fingers. The only thing that concerns me is the pin side for wiggly dogs. If your dog moves around constantly during grooming then this brush is not for you. My Mal-Shi is very calm during grooming so he just stands still, but my Shih Tzu is very wiggly, so I can't use this brush on him. The pin side is like needles, if he moves his head slightly he would get injured. I can't risk it.\nReview Title: Effective, but not for wiggly dogs\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heyedrate Activated Charcoal Soap Bar and Face Wash | Organic, Vegan, Natural Soap made with Dead Sea Mud and Our Essential Oil Blend (1 Pack (5 Ounces))\nReview Date: 2021/03/22\nStore: Eye Love\nAverage Rating: 4.4\nProduct Details: {'Item Form': 'Bar', 'Brand': 'Eye Love', 'Scent': 'Eucalyptus, Coconut, Grapefruit, Rosemary', 'Material Feature': 'Organic, Natural, Vegan', 'Age Range (Description)': 'Adult', 'Product Dimensions': '4 x 1 x 1 inches; 4.97 Ounces', 'UPC': '850436007827'}\nReview Text: I am not stranger to charcoal facial soap. I used to use the liquid version of it and got great results in the past. Since spring is here, I wanted to get rid of dead skin and rejuvenate my skin. This charcoal soap doesn't lather a lot but it is as effective as the liquid one. I distributed it using my silicone brush cleaner and got an amazing result. My skin feels cleaner, brighter and smoother. All the combination of natural ingredients in it nourishes my skin. This soap bar is going to last me a long time. Great value for what you get.\nReview Title: Makes skin feel smoother and look radiant\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Polish Gel Remover Tools Kit for Women with Nail Clip Caps, Nail File, Nail Remover Cotton Pads,Brush, 2-in-1 Cuticle Scraper and Pusher, Nail Separator\nReview Date: 2021/04/01\nStore: Lahien\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Lahien', 'Item Form': 'Pad', 'Unit Count': '5.2911 Ounce', 'Package Dimensions': '7.99 x 5.82 x 1.69 inches; 4.16 Ounces', 'UPC': '782910194573'}\nReview Text: I recently got a gel nail polish starter kit for myself. It was my first time doing gel nail and I loved it, but I didn't realize gel polish needs to be removed using a special technique. That's how I came across with this remover kit and I am glad I ordered it. I guess some people wrap aluminum foil around their nails, but I don't know how efficient that is. After I dipped the cotton pads in nail polish remover, I wrapped them around my nails and put the nail clippers on for 15 minutes. When I took them off, the gel polish looked soft and some of them were already peeled, so I used the scrapper to get rid of the rest of the polish, and filed my nails to smooth them out. That's it! This kit is very easy to use and does the job.\nReview Title: Easy to use, does the job quickly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yayoge Gel Nail Polish Kit ，6 Colors Gel Nail Polish Base and Top Coat ，UV Gel Nail Polish Set ，Soak Off Gel Nail Art Manicure Kit, Ideal Gifts DIY Salon and Home\nReview Date: 2021/04/08\nStore: yayoge\nAverage Rating: 3.1\nProduct Details: {'Brand': 'Yayoge', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Special Feature': 'Long-lasting', 'Age Range (Description)': 'Adult', 'Liquid Volume': '0.33 Fluid Ounces', 'Item Dimensions LxWxH': '8.66 x 7.09 x 2.36 inches', 'Product Dimensions': '8.66 x 7.09 x 2.36 inches; 13.76 Ounces'}\nReview Text: Before I cured my nails with the UV light, I applied different colors on each nail to see which one would compliment my skin. Unfortunately, I didn't like any of the colors in this set. Two of the gel polish are the same exact color, so I received 5 different colors not 6. The title of this product claims that it comes with a UV lamp, but it doesn't. I am glad I tested the colors on my nails before going further. Otherwise removal process is another painful process.\nReview Title: UV lamp is not included, the colors didn't look good on my nails\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Plant Therapy Natural Acetone Free Nail Polish Remover 6 fl oz One Touch Dispensing Bottle with Flip Top Cap Tropical Flower Scent\nReview Date: 2021/04/23\nStore: Plant Therapy\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Plant Therapy', 'Item Form': 'Liquid', 'Item Weight': '6.24 Ounces', 'Number of Items': '1', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '5.1 x 2.2 x 2.2 inches; 6.24 Ounces', 'UPC': '680912056168'}\nReview Text: This is the most nourishing nail polish remover I've ever used. It hydrates my cuticles and makes my nails look shiny. The only bad thing is that it doesn't remove nail polish easily. I had to put a lot of pressure on and go over a nail multiple times to be able to remove the nail polish. Let's put it this way, if I was wiping my nails with a regular acetone it would have taken me couple swipes, but with this nail polish remover it took 15 swipes. I would still prefer this remover because it didn't dry my nails. My nails look like I just applied cuticle oil. It smell really good too.\nReview Title: Nourishing nail polish remover\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Got2b Glued Spray Wax with 2-in-1 Dual Nozzle, 8 oz\nReview Date: 2021/04/25\nStore: Got2B\nProduct Description: ['The first dual-finish spray wax has officially hit the shelves! The got2b glued Spray Wax provides two looks with one product. So whether you want flexible texture or structured hold, this product has you covered! Best of all, this lightweight formula doesn’t leave your hair feeling sticky or crunchy. Create your own look and style. Turn to position 1 for flexible texture, turn to position 2 for structured hold. Be whoever you want 2b with got2b glued Spray Wax!']\nAverage Rating: 4.2\nProduct Details: {'Product Benefits': 'Firm Hold', 'Hair Type': 'All', 'Scent': 'Unscented', 'Liquid Volume': '8 Fluid Ounces', 'Item Form': 'Wax', 'Product Dimensions': '2 x 2 x 8.38 inches; 9.87 Ounces', 'Item model number': '31307', 'UPC': '017000313078', 'Manufacturer': 'AmazonUs/DIAW7', 'Country of Origin': 'USA'}\nReview Text: This is the waxiest and the most stickiest hair spray I've ever used. I touched my hair by accident and had to wash my hand, because it made my hand sticky. If I use this hair spray everyday then I have to wash my hair everyday too. After spraying this on my hair, it made it look like I didn't wash my hair for two weeks. It doesn't smell good either. I don't like this spray at all.\nReview Title: Makes hair feel waxy and sticky\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CAXIRO IPL Hair Removal Device for Women and Man, Permanent Reduction in Hair Regrowth for Body, Face & Precision Areas (Bikini and Underarms)\nReview Date: 2021/09/19\nStore: CAXIRO\nAverage Rating: 2.8\nProduct Details: {'Package Dimensions': '7.76 x 7.68 x 2.32 inches; 1.48 Pounds', 'UPC': '791324774318'}\nReview Text: I have been using this hair removal device for 2 months now. I used it once every 2 weeks so I've used it 5 times so far. Now, the sessions will be only once a month until all the unwated hair is removed. The manufacturer recommends using it once every 2 weeks for the first 5 sessions and then once a month after that, so using it multiple times a week won't change the outcome. The areas I use this device are my legs, under arms, bikini area and upper lip. The only difference I've noticed so far is the upper lip hair. It is growing significantly less, like almost 90% is gone. The rest of the body hair still grows the same amount, but the hair started to grow softer. I assume the hair is finally becoming weaker. I am half Greek and half Italian, I have olive skin color with dark hair, so it might take over a year for me to see some results. Overall, the device is very easy to use and it is painless, but it gets super hot to the touch after about 5-10 minutes of continues usage. I use the device on my legs first and then take a break until it cools down, and then I continue using it on other parts of the body and stop to cool it down again. I have to admit it is frustrating to stop the session to cool down the device. I don't know if other hair removal devices get this hot. This is my first time using something like this so I can't compare.\nReview Title: Painless and easy to use, but the device gets super hot\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Women Ultra Smooth Razor Womens Razors for Shaving Comfortable handle 5-blade Razor + 2 Refill Blades for a Smooth and safety Shave Reusable Razors for Girls Women\nReview Date: 2021/09/23\nStore: RONGCHUANG\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '8 x 5 x 1 inches; 7.41 Ounces', 'UPC': '607816401771'}\nReview Text: [[VIDEOID:605657cac95f549a7d3c2e340303de40]] I love the sleek design of this razor and the ceramic base it comes with. The razor gives a super close shave and makes my skin feel soft and smooth. The only thing that makes me nervous is the handle. It becomes slippery in the shower so I can't get a good grip. It worries me that I will cut myself when I am shaving. I searched if the company sells refill blades for this but they don't have them. You will have to purchase the whole set again, so that is something to think about before purchasing.\nReview Title: The handle becomes slippery in the shower\nRating: 3.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n1. **Skin Care Focus**:\n   - Strong preference for **gentle, effective** cleansing products, particularly for removing makeup.\n   - Utilizes both liquid cleansers and bar soaps, favoring moisturizing characteristics.\n\n2. **Product Expectations**:\n   - Expects products to efficiently remove makeup but shows concern for skin hydration post-use.\n   - Interested in **natural or organic** ingredients; positive feedback for products with essential oils or nourishing properties.\n\n3. **Hair Care and Removal**:\n   - Engages with hair removal devices, favors painless options but notes issues with device overheating.\n   - Uses razors that promise close shaves but expresses concerns regarding grip safety.\n\n4. **Fragrance Sensitivity**:\n   - Preference for products with pleasant or no scent; negative responses to unpleasant fragrances in cleansing towelettes.\n\n5. **Pet Care**:\n   - Involved in pet grooming, seeking effective tools but with safety concerns regarding wiggly pets.\n\n6. **Cosmetic Removal**:\n   - Values **efficiency** in cleansing, demonstrated by a preference for products specifically designed to combat stubborn makeup.\n\n7. **Dissatisfaction with Products**:\n   - Customers provide poor ratings for ineffective, pungent, or messy products, indicating a clear need for quality.\n\nOverall, the individual exhibits a trend towards effective skincare, sensitivity to product performance and fragrance, and a cautious approach to tools used for personal care and pet grooming.",
  "target_interaction": {
    "rating": 2.0,
    "title": "Pulls my hair and scratches my scalp",
    "text": "This is my first time using a zigzag style bristle brush. It pulls my hair and scratches my scalp. I don't recommend it if you have a sensitive scalp.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/712GTLHu4sL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/712GTLHu4sL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/712GTLHu4sL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/712rpJ3NByL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/712rpJ3NByL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/712rpJ3NByL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71iiYFlVxWL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71iiYFlVxWL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71iiYFlVxWL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B0BJSKTYHL",
    "parent_asin": "B0BJSKTYHL",
    "user_id": "AGTGHYRTZXKX4AIL42A3FKWR7SOQ",
    "timestamp": "2023-01-10 03:11:16.622000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "LUCETE Rainbow Volume S Brush-Detangling Paddle Hairbrush for Wet & Dry Hair",
    "average_rating": 4.2,
    "rating_number": 38,
    "features": [
      "“S” SHAPED BRISTLES—specially designed with patented technology: The S-shaped teeth create air holes in your hair, allowing easy, painless detangling, all while minimizing hair damage and giving natural volume.",
      "THE BEST PAINLESS KNOT-REMOVING BRUSH: Helping your hair stay strong and healthy, the LUCETE hairbrush loosens knots, on wet or dry hair, without pulling or snagging. Made of elastic acetal material that prevents scalps irritation. From the moment you experience its perfection, you will never want to try another hairbrush again!",
      "Enjoy the difference of A HANDMADE PREMIUM QUALITY HAIR BRUSH: LUCETE hair brushes are handmade, bristle by bristle with our love and care. Different than products that are mass-produced in factories, we increase customer satisfaction as the LUCETE hairbrush is a product customers happily use. The ergonomic design perfectly fits into your palm with a lightweight grip, it is also easy to store. DESIGNED AND MADE IN KOREA, we specifically made this product for you with the best quality possible.",
      "PERFECT FOR ALL HAIR TYPES: Whether you have straight, curly, textured, thick, wavy, or any type of hair, even for wigs, this brush will give you soft, shiny, and flowing hair. With the LUCETE hairbrush, you can effortlessly have beautiful tangle-free hair with a few strokes of the brush.",
      "All LUCETE brushes are eco friendly—our products are reliable and safe to use: A GREAT GIFT IDEA FOR ALL AGES AND HAIRTYPES! 100% SATISFACTION GUARANTEE: Your satisfaction is our top priority! Our promise to you is that our hairbrush will be the most efficient one you'll ever have. If you don't absolutely love your hair brush for whatever reason, we will give you a full refund or send you a replacement! This is our confidence that you will love our hairbrush! DON’T WAIT, ADD TO THE CART NOW!"
    ],
    "description": [],
    "price": 17.95,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51VATA+vHSL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51VATA+vHSL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81ouM3qMYvL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51k8J5byELL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51k8J5byELL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81GdxAvSkqL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51zpjn4gEnL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51zpjn4gEnL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81swqi6hi8L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/515-JmoHsGL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/515-JmoHsGL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/81PDvOOo+HL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51WC8MaiuwL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51WC8MaiuwL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81gBx5XKTRL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51AoOAZkHNL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51AoOAZkHNL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81pF1eCOnQL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512+m9Os6ML._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/512+m9Os6ML.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/81vLDEEadwL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Rainbow Plastic Forky Comb",
        "url": "https://www.amazon.com/vdp/57d5f7be2e874e0589ff6b800ebb367b?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Husband drawer organization ",
        "url": "https://www.amazon.com/vdp/0614ad807ccd4b488b8081d2a6d5c54c?ref=dp_vse_rvc_1",
        "user_id": "/shop/influencer-945b8938"
      }
    ],
    "store": "LUCETE",
    "categories": [],
    "details": {
      "Brand": "LUCETE",
      "Shape": "Oblong",
      "Special Feature": "Eco Friendly",
      "Unit Count": "1.00 Count",
      "Hair Type": "All",
      "Product Dimensions": "8.25 x 2.9 x 1.5 inches; 3.53 Ounces",
      "UPC": "627987655063",
      "Manufacturer": "TovMeod",
      "Country of Origin": "Korea, Republic of"
    },
    "bought_together": null
  }
}