{
  "user_id": "AFYSHCJX77N6OZHBKFSTSYZGNJWQ",
  "summary": "=== Purchase Information ===\nProduct Title: Mtmei hair 5Packs 10\" Pre-twisted Spring Twist Hair Crochet Braids 15 Strands/Pack Nubian Bomb Twist Crochet Hair Messy Fluffy Spring Twist Crochet Hair Extensions(T27)\nReview Date: 2020/07/22\nStore: Mtmei hair\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Mtmei hair', 'Material': 'Human Hair', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.02 x 7.52 x 2.76 inches; 11.99 Ounces', 'UPC': '765470972508'}\nReview Text: There are pros and cons to this hair.  This hair is very soft and very stretchy, so it can be pulled back out of your face. I love that this came with a crochet hook.  The T27 color is pretty BUT it is very frizzy, especially on the blonde ends.  It came straight out of the package frizzy, so I was very disappointed.  It looks like hair that has been in someone's hair for 2-3 weeks before I received it.  it's possible to make the 5 packs work, but I would've preferred to have 6 packs of hair included to make sure there weren't too many gaps without any colored hair, especially since my natural hair color is dark brown.  Overall the hair is just OK.  Next time I'll go for hair that is a better quality.\nReview Title: It's OK\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: zelaxy Mask Strap Extenders, Soft Silicone Mask Holders for Relieve Ear Pain Caused by Mask (Dot)\nReview Date: 2020/08/08\nStore: zelaxy\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '7.5 x 4.7 x 0.2 inches; 3.99 Ounces', 'Manufacturer': 'zelaxy'}\nReview Text: These Mask Strap Extenders are so comfortable! They're soft and it's easy to forget you have them on.  I love how they help keep my masks that are too large in place and snug where they need to be.  I love that there's no pressure on my ears whatsoever! These are phenomenal.  I highly recommend!\nReview Title: Comfortable and Necessary\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ombre Burgundy Prelooped Bomb Twist Crochet Hair Prelooped Crochet Braids 18 Inch\nReview Date: 2020/09/14\nStore: UHair\nAverage Rating: 5.0\nProduct Details: {'Brand': 'UHair', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '12.95 x 9.41 x 3.19 inches; 2.09 Pounds'}\nReview Text: I love this hair! It's GORGEOUS!!!  The color is perfect.  I love that these look neat and uniform.  The ends are curled to perfection.  There is definitely enough hair included to complete your full head without too many gaps.  The orange thing included looks more like a wrist band than a hair tie, but use it as you see fit.  This hair is phenomenal.  I highly recommend.\nReview Title: LOVE!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Toyotress Sierra Passion Braid Crochet Hair - 24 inch 8 Packs Jumbo Box Braids with Curly End Synthetic Braiding Hair Extensions (24 Inch, 1B)\nReview Date: 2020/09/23\nStore: ToyoTress\nAverage Rating: 4.2\nProduct Details: {'Brand': 'ToyoTress', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '14.61 x 10.28 x 3.31 inches; 2.14 Pounds'}\nReview Text: I was hesitant to order these because I didn't think I'd like the design of the braids, but after receiving them they are beautiful.  They look really nice when completely installed.  These are neat, and frizz free.  I prefer to wash my hair before the install to remove any smell the hair may have picked up in transit.  I cannot say enough about this hair.  Buy it now! I highly recommend!\nReview Title: Beautiful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YsesoAi 28 Pcs Hair Curlers Spiral Curls No Heat Wave Hair Curlers Styling Kit Spiral Hair Curlers Magic Hair Rollers with 2 Pieces Styling Hooks for Most Kinds of Hairstyles (20 cm/ 7.8 inches)\nReview Date: 2020/10/12\nStore: YsesoAi\nAverage Rating: 3.2\nProduct Details: {'Hair Type': 'Curly', 'Brand': 'YsesoAi', 'Color': 'Pink, Blue, Ivory, Yellow, Green', 'Item Dimensions LxWxH': '1.5 x 1.7 x 1.1 inches', 'Unit Count': '1.00 Count', 'Product Dimensions': '1.5 x 1.7 x 1.1 inches; 6.38 Ounces', 'UPC': '745895771436'}\nReview Text: My hair is just about too long for these, so I won't be getting much use out of them.  These do not look like it would be easy to achieve spiral curls with these rollers, because they roll straight on themselves like regular rollers, and do not come looking spiral like the advertisement picture suggests! I feel mislead! I'm sure I could try to get the outcome to look spiral but I do not have high hopes.  I would suggest a different product that arrives looking just like the picture in advertisement.\nReview Title: For Short Hair Only!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ZWIFEJIANQ Silicone Back Scrubber,Exfoliating Lengthen Silicone Bath Body Brush for Men and Women,Deep Clean & Invigorate Your Skin(30 inch, Green)\nReview Date: 2020/10/14\nStore: ZWIFEJIANQ\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '7.28 x 4.65 x 2.17 inches; 7.83 Ounces', 'UPC': '781076826113'}\nReview Text: I ordered this for my sister, and this is what she had to say:  She wanted it because she thought it would be exfoliating.  The bumpy side feels really nice but she was unsure of it's purpose outside of a general massage.  The scrubbing side of it also felt great, but she didn't trust that is was actually cleansing her back because the bristles are so soft.  She wishes it were longer; it doesn't stretch so she was limited in her range of motion while cleansing her back.  After using this body brush she said she still felt like she needed to follow up with a wash cloth to ensure that her body was cleansed to her liking.\nReview Title: A little better than okay\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Packs Short Spring Twist Crochet Hair Ombre Bomb Bob Curly Spring Pre-twisted Braids Synthetic Fluffy Hair Extensions (6, T27)\nReview Date: 2020/10/24\nStore: lianlian\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Lianlian', 'Material': 'Synthetic', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.79 x 7.76 x 2.83 inches; 15.94 Ounces'}\nReview Text: This hair is beautiful.  The ends are frizzy straight out of the pack, but after installed the hair is beautiful!  The only off putting thing about this hair is that this hair is rough.  I would recommend washing this hair and maybe soaking this hair in fabric softener for about 15, because it is made up of synthetic fibers in order to soften up this hair a bit.  Other than that, I highly recommend this hair. Make sure you space this hair out, so that the 6 packs will complete your entire hairstyle.\nReview Title: Hard Hair\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bomb Twist Crochet Hair 12 Inch Pre-Looped Senegalese Spring Twist Crochet Braids Hair Curly End Synthetic Hair Extension 24Roots Short Ombre Passion Twist Braiding Hair (#1B)\nReview Date: 2020/11/02\nStore: Belle Show\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '12 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.94 x 10.39 x 3.31 inches; 13.72 Ounces'}\nReview Text: This hair is gorgeous! I love this hair.  It's beautiful.  These twists are very small so your hair pattern would have to match accordingly.  I think if you have smaller cornrows in the front and combine a 2-3 cornrows into one large cornrow in the back of the hair, this will be enough hair for one hair style.  Spacing is everything when it comes to prepackaged hairstyles.  Overall I have no complaints about this hair, and I highly recommend.\nReview Title: Beautiful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Senegalese Twist Crochet Braids Wavy Twist Crochet Hair 14 Inch 5 Packs Wavy Ends free Synthetic Hair Extension Curly Crochet Twist Hair (1B#)\nReview Date: 2020/11/09\nStore: Liang Dian\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Liang Dian', 'Material': 'Synthetic', 'Extension Length': '14 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '8.78 x 8.35 x 2.64 inches; 8.47 Ounces', 'UPC': '738631321149'}\nReview Text: I have mixed feelings about this hair.  The twists are beautiful!  This is made from a coarser hair texture so it isn't as soft as I expected Senegalese twists to be.  These are twisted tightly, so based off of the twists alone, I think you could be able to get away with using this hair more than once.  The con of this hair is that the ends come tangled.  I finger detangled this hair for 5 minutes, and yes it did get easier to run my fingers through, I never achieved a complete detangle of the hair.  I think this hair will be difficult to reuse solely off of this aspect of the style.  I think the ends of this hair may have to be combed out daily...maybe even more than one time a day, daily.  This style is very cute I'm just not sure how long it will last since the ends are tangled straight out of the package.  I still believe this hair is gorgeous and worth buying.\nReview Title: Comes Tangled\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Pack Portable travel bottles-30ml Flip Cap Reusable Bottles Keychain Carriers for Shampoo,Hand Sanitizer Refillable Keychain Sanitizer Holder -1oz dispenser bottle, Metal 6 Pack Buckle Include\nReview Date: 2020/12/06\nStore: SKYCY\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '7.99 x 5.16 x 2.2 inches; 7.13 Ounces', 'UPC': '653552483144'}\nReview Text: These bottles are very easy to use.  They are easy to fill, and I love that I do not have to take the entire bottle out of the carrying case to gain access to my hand sanitizer. These are my favorite types of hand sanitizer holders.  I wish the bottles were a bit larger so I wouldn't have to refill so often, but overall I have no complaints.  I highly recommend.\nReview Title: I LOVE the colors\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Long Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nReview Date: 2021/03/08\nStore: HNYBEE\nAverage Rating: 2.9\nProduct Details: {'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nReview Text: This unit has no combs.  This unit makes me nervous because there aren't many ways to secure this unit to make sure it doesn't slide off.  The hair is very pretty, but does not look realistic.  This looks very plastic, and I doubt that this will last long.  I do appreciate all of the free extras included in the box.  I received  wig caps, lashes, a mirror, a temporary tattoo, a pair of earrings, and a headband in addition to the wig.  I don't like the quality of hair.\nReview Title: NO COMBS!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 7 Packs Pre Twisted Curly Crochet Hair Short Curly Spring 10 Inch Synthetic Crochet Braids Pre Passion Twist Crochet Hair(10 Inch,1B）\nReview Date: 2021/04/04\nStore: Ailsa\nAverage Rating: 4.9\nProduct Details: {'Brand': 'Ailsa', 'Material': 'Synthetic', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '13.23 x 9.29 x 2.95 inches; 1.12 Pounds', 'UPC': '761469636666'}\nReview Text: Spacing is important with these twists if you want a full look with the amount of hair that's provided.  The strands are both thin and short, so I made my cornrows smaller in the front and combined several in the back.  I spaced the hair in the back 2.5 finger widths apart and spaced the hair in the top about 1 finger width apart.  I ended up leaving some space at the very back/bottom empty and just let the hair that was hanging cover that part.  I wish this hair would've come with at least 8 packs for a fuller head.\nReview Title: Thin twists\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Isaic Headband Wigs for Women Long Wavy Headband Wig Glueless Synthetic Black Wig with Headband Heat Resistant 22 Inch\nReview Date: 2021/06/29\nStore: Isaic\nAverage Rating: 3.5\nProduct Details: {'Item Dimensions LxWxH': '9 x 7 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Isaic', 'Cartoon Character': 'Sexy', 'Product Dimensions': '9 x 7 x 3 inches; 11.68 Ounces'}\nReview Text: This wig was tangled immediately after I took it out of the package.  I never got it to be completely tangle free.  This unit feels like it will not last long because of the quality of the hair.  This hair is beautiful but tangles like crazy. I do not recommend.\nReview Title: Tangles Easily\nRating: 3.0\n--------------------------------------------------",
  "reference": "Mtmei hair 5Packs 10\" Pre-twisted Spring Twist Hair Crochet Braids 15 Strands/Pack Nubian Bomb Twist Crochet Hair Messy Fluffy Spring Twist Crochet Hair Extensions(T27)\nMtmei hair\n{'Brand': 'Mtmei hair', 'Material': 'Human Hair', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.02 x 7.52 x 2.76 inches; 11.99 Ounces', 'UPC': '765470972508'}\nThere are pros and cons to this hair.  This hair is very soft and very stretchy, so it can be pulled back out of your face. I love that this came with a crochet hook.  The T27 color is pretty BUT it is very frizzy, especially on the blonde ends.  It came straight out of the package frizzy, so I was very disappointed.  It looks like hair that has been in someone's hair for 2-3 weeks before I received it.  it's possible to make the 5 packs work, but I would've preferred to have 6 packs of hair included to make sure there weren't too many gaps without any colored hair, especially since my natural hair color is dark brown.  Overall the hair is just OK.  Next time I'll go for hair that is a better quality.\nIt's OK\nzelaxy Mask Strap Extenders, Soft Silicone Mask Holders for Relieve Ear Pain Caused by Mask (Dot)\nzelaxy\n{'Package Dimensions': '7.5 x 4.7 x 0.2 inches; 3.99 Ounces', 'Manufacturer': 'zelaxy'}\nThese Mask Strap Extenders are so comfortable! They're soft and it's easy to forget you have them on.  I love how they help keep my masks that are too large in place and snug where they need to be.  I love that there's no pressure on my ears whatsoever! These are phenomenal.  I highly recommend!\nComfortable and Necessary\nOmbre Burgundy Prelooped Bomb Twist Crochet Hair Prelooped Crochet Braids 18 Inch\nUHair\n{'Brand': 'UHair', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '12.95 x 9.41 x 3.19 inches; 2.09 Pounds'}\nI love this hair! It's GORGEOUS!!!  The color is perfect.  I love that these look neat and uniform.  The ends are curled to perfection.  There is definitely enough hair included to complete your full head without too many gaps.  The orange thing included looks more like a wrist band than a hair tie, but use it as you see fit.  This hair is phenomenal.  I highly recommend.\nLOVE!!!!\nToyotress Sierra Passion Braid Crochet Hair - 24 inch 8 Packs Jumbo Box Braids with Curly End Synthetic Braiding Hair Extensions (24 Inch, 1B)\nToyoTress\n{'Brand': 'ToyoTress', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '14.61 x 10.28 x 3.31 inches; 2.14 Pounds'}\nI was hesitant to order these because I didn't think I'd like the design of the braids, but after receiving them they are beautiful.  They look really nice when completely installed.  These are neat, and frizz free.  I prefer to wash my hair before the install to remove any smell the hair may have picked up in transit.  I cannot say enough about this hair.  Buy it now! I highly recommend!\nBeautiful!\nYsesoAi 28 Pcs Hair Curlers Spiral Curls No Heat Wave Hair Curlers Styling Kit Spiral Hair Curlers Magic Hair Rollers with 2 Pieces Styling Hooks for Most Kinds of Hairstyles (20 cm/ 7.8 inches)\nYsesoAi\n{'Hair Type': 'Curly', 'Brand': 'YsesoAi', 'Color': 'Pink, Blue, Ivory, Yellow, Green', 'Item Dimensions LxWxH': '1.5 x 1.7 x 1.1 inches', 'Unit Count': '1.00 Count', 'Product Dimensions': '1.5 x 1.7 x 1.1 inches; 6.38 Ounces', 'UPC': '745895771436'}\nMy hair is just about too long for these, so I won't be getting much use out of them.  These do not look like it would be easy to achieve spiral curls with these rollers, because they roll straight on themselves like regular rollers, and do not come looking spiral like the advertisement picture suggests! I feel mislead! I'm sure I could try to get the outcome to look spiral but I do not have high hopes.  I would suggest a different product that arrives looking just like the picture in advertisement.\nFor Short Hair Only!\nZWIFEJIANQ Silicone Back Scrubber,Exfoliating Lengthen Silicone Bath Body Brush for Men and Women,Deep Clean & Invigorate Your Skin(30 inch, Green)\nZWIFEJIANQ\n{'Package Dimensions': '7.28 x 4.65 x 2.17 inches; 7.83 Ounces', 'UPC': '781076826113'}\nI ordered this for my sister, and this is what she had to say:  She wanted it because she thought it would be exfoliating.  The bumpy side feels really nice but she was unsure of it's purpose outside of a general massage.  The scrubbing side of it also felt great, but she didn't trust that is was actually cleansing her back because the bristles are so soft.  She wishes it were longer; it doesn't stretch so she was limited in her range of motion while cleansing her back.  After using this body brush she said she still felt like she needed to follow up with a wash cloth to ensure that her body was cleansed to her liking.\nA little better than okay\n6 Packs Short Spring Twist Crochet Hair Ombre Bomb Bob Curly Spring Pre-twisted Braids Synthetic Fluffy Hair Extensions (6, T27)\nlianlian\n{'Brand': 'Lianlian', 'Material': 'Synthetic', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.79 x 7.76 x 2.83 inches; 15.94 Ounces'}\nThis hair is beautiful.  The ends are frizzy straight out of the pack, but after installed the hair is beautiful!  The only off putting thing about this hair is that this hair is rough.  I would recommend washing this hair and maybe soaking this hair in fabric softener for about 15, because it is made up of synthetic fibers in order to soften up this hair a bit.  Other than that, I highly recommend this hair. Make sure you space this hair out, so that the 6 packs will complete your entire hairstyle.\nHard Hair\nBomb Twist Crochet Hair 12 Inch Pre-Looped Senegalese Spring Twist Crochet Braids Hair Curly End Synthetic Hair Extension 24Roots Short Ombre Passion Twist Braiding Hair (#1B)\nBelle Show\n{'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '12 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.94 x 10.39 x 3.31 inches; 13.72 Ounces'}\nThis hair is gorgeous! I love this hair.  It's beautiful.  These twists are very small so your hair pattern would have to match accordingly.  I think if you have smaller cornrows in the front and combine a 2-3 cornrows into one large cornrow in the back of the hair, this will be enough hair for one hair style.  Spacing is everything when it comes to prepackaged hairstyles.  Overall I have no complaints about this hair, and I highly recommend.\nBeautiful!\nSenegalese Twist Crochet Braids Wavy Twist Crochet Hair 14 Inch 5 Packs Wavy Ends free Synthetic Hair Extension Curly Crochet Twist Hair (1B#)\nLiang Dian\n{'Brand': 'Liang Dian', 'Material': 'Synthetic', 'Extension Length': '14 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '8.78 x 8.35 x 2.64 inches; 8.47 Ounces', 'UPC': '738631321149'}\nI have mixed feelings about this hair.  The twists are beautiful!  This is made from a coarser hair texture so it isn't as soft as I expected Senegalese twists to be.  These are twisted tightly, so based off of the twists alone, I think you could be able to get away with using this hair more than once.  The con of this hair is that the ends come tangled.  I finger detangled this hair for 5 minutes, and yes it did get easier to run my fingers through, I never achieved a complete detangle of the hair.  I think this hair will be difficult to reuse solely off of this aspect of the style.  I think the ends of this hair may have to be combed out daily...maybe even more than one time a day, daily.  This style is very cute I'm just not sure how long it will last since the ends are tangled straight out of the package.  I still believe this hair is gorgeous and worth buying.\nComes Tangled\n6 Pack Portable travel bottles-30ml Flip Cap Reusable Bottles Keychain Carriers for Shampoo,Hand Sanitizer Refillable Keychain Sanitizer Holder -1oz dispenser bottle, Metal 6 Pack Buckle Include\nSKYCY\n{'Package Dimensions': '7.99 x 5.16 x 2.2 inches; 7.13 Ounces', 'UPC': '653552483144'}\nThese bottles are very easy to use.  They are easy to fill, and I love that I do not have to take the entire bottle out of the carrying case to gain access to my hand sanitizer. These are my favorite types of hand sanitizer holders.  I wish the bottles were a bit larger so I wouldn't have to refill so often, but overall I have no complaints.  I highly recommend.\nI LOVE the colors\nLong Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nHNYBEE\n{'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nThis unit has no combs.  This unit makes me nervous because there aren't many ways to secure this unit to make sure it doesn't slide off.  The hair is very pretty, but does not look realistic.  This looks very plastic, and I doubt that this will last long.  I do appreciate all of the free extras included in the box.  I received  wig caps, lashes, a mirror, a temporary tattoo, a pair of earrings, and a headband in addition to the wig.  I don't like the quality of hair.\nNO COMBS!\n7 Packs Pre Twisted Curly Crochet Hair Short Curly Spring 10 Inch Synthetic Crochet Braids Pre Passion Twist Crochet Hair(10 Inch,1B）\nAilsa\n{'Brand': 'Ailsa', 'Material': 'Synthetic', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '13.23 x 9.29 x 2.95 inches; 1.12 Pounds', 'UPC': '761469636666'}\nSpacing is important with these twists if you want a full look with the amount of hair that's provided.  The strands are both thin and short, so I made my cornrows smaller in the front and combined several in the back.  I spaced the hair in the back 2.5 finger widths apart and spaced the hair in the top about 1 finger width apart.  I ended up leaving some space at the very back/bottom empty and just let the hair that was hanging cover that part.  I wish this hair would've come with at least 8 packs for a fuller head.\nThin twists\nIsaic Headband Wigs for Women Long Wavy Headband Wig Glueless Synthetic Black Wig with Headband Heat Resistant 22 Inch\nIsaic\n{'Item Dimensions LxWxH': '9 x 7 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Isaic', 'Cartoon Character': 'Sexy', 'Product Dimensions': '9 x 7 x 3 inches; 11.68 Ounces'}\nThis wig was tangled immediately after I took it out of the package.  I never got it to be completely tangle free.  This unit feels like it will not last long because of the quality of the hair.  This hair is beautiful but tangles like crazy. I do not recommend.\nTangles Easily",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Mtmei hair 5Packs 10\" Pre-twisted Spring Twist Hair Crochet Braids 15 Strands/Pack Nubian Bomb Twist Crochet Hair Messy Fluffy Spring Twist Crochet Hair Extensions(T27)\nReview Date: 2020/07/22\nStore: Mtmei hair\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Mtmei hair', 'Material': 'Human Hair', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.02 x 7.52 x 2.76 inches; 11.99 Ounces', 'UPC': '765470972508'}\nReview Text: There are pros and cons to this hair.  This hair is very soft and very stretchy, so it can be pulled back out of your face. I love that this came with a crochet hook.  The T27 color is pretty BUT it is very frizzy, especially on the blonde ends.  It came straight out of the package frizzy, so I was very disappointed.  It looks like hair that has been in someone's hair for 2-3 weeks before I received it.  it's possible to make the 5 packs work, but I would've preferred to have 6 packs of hair included to make sure there weren't too many gaps without any colored hair, especially since my natural hair color is dark brown.  Overall the hair is just OK.  Next time I'll go for hair that is a better quality.\nReview Title: It's OK\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: zelaxy Mask Strap Extenders, Soft Silicone Mask Holders for Relieve Ear Pain Caused by Mask (Dot)\nReview Date: 2020/08/08\nStore: zelaxy\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '7.5 x 4.7 x 0.2 inches; 3.99 Ounces', 'Manufacturer': 'zelaxy'}\nReview Text: These Mask Strap Extenders are so comfortable! They're soft and it's easy to forget you have them on.  I love how they help keep my masks that are too large in place and snug where they need to be.  I love that there's no pressure on my ears whatsoever! These are phenomenal.  I highly recommend!\nReview Title: Comfortable and Necessary\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ombre Burgundy Prelooped Bomb Twist Crochet Hair Prelooped Crochet Braids 18 Inch\nReview Date: 2020/09/14\nStore: UHair\nAverage Rating: 5.0\nProduct Details: {'Brand': 'UHair', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '12.95 x 9.41 x 3.19 inches; 2.09 Pounds'}\nReview Text: I love this hair! It's GORGEOUS!!!  The color is perfect.  I love that these look neat and uniform.  The ends are curled to perfection.  There is definitely enough hair included to complete your full head without too many gaps.  The orange thing included looks more like a wrist band than a hair tie, but use it as you see fit.  This hair is phenomenal.  I highly recommend.\nReview Title: LOVE!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Toyotress Sierra Passion Braid Crochet Hair - 24 inch 8 Packs Jumbo Box Braids with Curly End Synthetic Braiding Hair Extensions (24 Inch, 1B)\nReview Date: 2020/09/23\nStore: ToyoTress\nAverage Rating: 4.2\nProduct Details: {'Brand': 'ToyoTress', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '14.61 x 10.28 x 3.31 inches; 2.14 Pounds'}\nReview Text: I was hesitant to order these because I didn't think I'd like the design of the braids, but after receiving them they are beautiful.  They look really nice when completely installed.  These are neat, and frizz free.  I prefer to wash my hair before the install to remove any smell the hair may have picked up in transit.  I cannot say enough about this hair.  Buy it now! I highly recommend!\nReview Title: Beautiful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YsesoAi 28 Pcs Hair Curlers Spiral Curls No Heat Wave Hair Curlers Styling Kit Spiral Hair Curlers Magic Hair Rollers with 2 Pieces Styling Hooks for Most Kinds of Hairstyles (20 cm/ 7.8 inches)\nReview Date: 2020/10/12\nStore: YsesoAi\nAverage Rating: 3.2\nProduct Details: {'Hair Type': 'Curly', 'Brand': 'YsesoAi', 'Color': 'Pink, Blue, Ivory, Yellow, Green', 'Item Dimensions LxWxH': '1.5 x 1.7 x 1.1 inches', 'Unit Count': '1.00 Count', 'Product Dimensions': '1.5 x 1.7 x 1.1 inches; 6.38 Ounces', 'UPC': '745895771436'}\nReview Text: My hair is just about too long for these, so I won't be getting much use out of them.  These do not look like it would be easy to achieve spiral curls with these rollers, because they roll straight on themselves like regular rollers, and do not come looking spiral like the advertisement picture suggests! I feel mislead! I'm sure I could try to get the outcome to look spiral but I do not have high hopes.  I would suggest a different product that arrives looking just like the picture in advertisement.\nReview Title: For Short Hair Only!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ZWIFEJIANQ Silicone Back Scrubber,Exfoliating Lengthen Silicone Bath Body Brush for Men and Women,Deep Clean & Invigorate Your Skin(30 inch, Green)\nReview Date: 2020/10/14\nStore: ZWIFEJIANQ\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '7.28 x 4.65 x 2.17 inches; 7.83 Ounces', 'UPC': '781076826113'}\nReview Text: I ordered this for my sister, and this is what she had to say:  She wanted it because she thought it would be exfoliating.  The bumpy side feels really nice but she was unsure of it's purpose outside of a general massage.  The scrubbing side of it also felt great, but she didn't trust that is was actually cleansing her back because the bristles are so soft.  She wishes it were longer; it doesn't stretch so she was limited in her range of motion while cleansing her back.  After using this body brush she said she still felt like she needed to follow up with a wash cloth to ensure that her body was cleansed to her liking.\nReview Title: A little better than okay\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Packs Short Spring Twist Crochet Hair Ombre Bomb Bob Curly Spring Pre-twisted Braids Synthetic Fluffy Hair Extensions (6, T27)\nReview Date: 2020/10/24\nStore: lianlian\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Lianlian', 'Material': 'Synthetic', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.79 x 7.76 x 2.83 inches; 15.94 Ounces'}\nReview Text: This hair is beautiful.  The ends are frizzy straight out of the pack, but after installed the hair is beautiful!  The only off putting thing about this hair is that this hair is rough.  I would recommend washing this hair and maybe soaking this hair in fabric softener for about 15, because it is made up of synthetic fibers in order to soften up this hair a bit.  Other than that, I highly recommend this hair. Make sure you space this hair out, so that the 6 packs will complete your entire hairstyle.\nReview Title: Hard Hair\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bomb Twist Crochet Hair 12 Inch Pre-Looped Senegalese Spring Twist Crochet Braids Hair Curly End Synthetic Hair Extension 24Roots Short Ombre Passion Twist Braiding Hair (#1B)\nReview Date: 2020/11/02\nStore: Belle Show\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '12 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.94 x 10.39 x 3.31 inches; 13.72 Ounces'}\nReview Text: This hair is gorgeous! I love this hair.  It's beautiful.  These twists are very small so your hair pattern would have to match accordingly.  I think if you have smaller cornrows in the front and combine a 2-3 cornrows into one large cornrow in the back of the hair, this will be enough hair for one hair style.  Spacing is everything when it comes to prepackaged hairstyles.  Overall I have no complaints about this hair, and I highly recommend.\nReview Title: Beautiful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Senegalese Twist Crochet Braids Wavy Twist Crochet Hair 14 Inch 5 Packs Wavy Ends free Synthetic Hair Extension Curly Crochet Twist Hair (1B#)\nReview Date: 2020/11/09\nStore: Liang Dian\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Liang Dian', 'Material': 'Synthetic', 'Extension Length': '14 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '8.78 x 8.35 x 2.64 inches; 8.47 Ounces', 'UPC': '738631321149'}\nReview Text: I have mixed feelings about this hair.  The twists are beautiful!  This is made from a coarser hair texture so it isn't as soft as I expected Senegalese twists to be.  These are twisted tightly, so based off of the twists alone, I think you could be able to get away with using this hair more than once.  The con of this hair is that the ends come tangled.  I finger detangled this hair for 5 minutes, and yes it did get easier to run my fingers through, I never achieved a complete detangle of the hair.  I think this hair will be difficult to reuse solely off of this aspect of the style.  I think the ends of this hair may have to be combed out daily...maybe even more than one time a day, daily.  This style is very cute I'm just not sure how long it will last since the ends are tangled straight out of the package.  I still believe this hair is gorgeous and worth buying.\nReview Title: Comes Tangled\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Pack Portable travel bottles-30ml Flip Cap Reusable Bottles Keychain Carriers for Shampoo,Hand Sanitizer Refillable Keychain Sanitizer Holder -1oz dispenser bottle, Metal 6 Pack Buckle Include\nReview Date: 2020/12/06\nStore: SKYCY\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '7.99 x 5.16 x 2.2 inches; 7.13 Ounces', 'UPC': '653552483144'}\nReview Text: These bottles are very easy to use.  They are easy to fill, and I love that I do not have to take the entire bottle out of the carrying case to gain access to my hand sanitizer. These are my favorite types of hand sanitizer holders.  I wish the bottles were a bit larger so I wouldn't have to refill so often, but overall I have no complaints.  I highly recommend.\nReview Title: I LOVE the colors\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Long Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nReview Date: 2021/03/08\nStore: HNYBEE\nAverage Rating: 2.9\nProduct Details: {'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nReview Text: This unit has no combs.  This unit makes me nervous because there aren't many ways to secure this unit to make sure it doesn't slide off.  The hair is very pretty, but does not look realistic.  This looks very plastic, and I doubt that this will last long.  I do appreciate all of the free extras included in the box.  I received  wig caps, lashes, a mirror, a temporary tattoo, a pair of earrings, and a headband in addition to the wig.  I don't like the quality of hair.\nReview Title: NO COMBS!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 7 Packs Pre Twisted Curly Crochet Hair Short Curly Spring 10 Inch Synthetic Crochet Braids Pre Passion Twist Crochet Hair(10 Inch,1B）\nReview Date: 2021/04/04\nStore: Ailsa\nAverage Rating: 4.9\nProduct Details: {'Brand': 'Ailsa', 'Material': 'Synthetic', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '13.23 x 9.29 x 2.95 inches; 1.12 Pounds', 'UPC': '761469636666'}\nReview Text: Spacing is important with these twists if you want a full look with the amount of hair that's provided.  The strands are both thin and short, so I made my cornrows smaller in the front and combined several in the back.  I spaced the hair in the back 2.5 finger widths apart and spaced the hair in the top about 1 finger width apart.  I ended up leaving some space at the very back/bottom empty and just let the hair that was hanging cover that part.  I wish this hair would've come with at least 8 packs for a fuller head.\nReview Title: Thin twists\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Isaic Headband Wigs for Women Long Wavy Headband Wig Glueless Synthetic Black Wig with Headband Heat Resistant 22 Inch\nReview Date: 2021/06/29\nStore: Isaic\nAverage Rating: 3.5\nProduct Details: {'Item Dimensions LxWxH': '9 x 7 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Isaic', 'Cartoon Character': 'Sexy', 'Product Dimensions': '9 x 7 x 3 inches; 11.68 Ounces'}\nReview Text: This wig was tangled immediately after I took it out of the package.  I never got it to be completely tangle free.  This unit feels like it will not last long because of the quality of the hair.  This hair is beautiful but tangles like crazy. I do not recommend.\nReview Title: Tangles Easily\nRating: 3.0\n--------------------------------------------------",
  "raw_response": "**Summary of Shopping Preferences and Patterns:**\n\n- **Hair Products**: Strong preference for **crochet braids** and extensions, particularly in **curly/wavy textures** and **ombre/colored variations**. Enjoys experimentation with lengths (10\" to 24\") and brands like Mtmei and UHair.\n  \n- **Quality Expectations**: Values **softness** and **ease of installation** but is often disappointed with **frizziness** and **texture** issues in synthetic products. Appears to prefer human hair or high-quality synthetic blends.\n\n- **Specific Feedback Trends**: Regularly mentions the importance of **pack quantity** for achieving a full look and the necessity of **pre-washing products** to remove odors or frizz. Some frustration with hair tangling and rough textures.\n\n- **Comfort Accessories**: Purchased silicone **mask strap extenders**, emphasizing comfort and functionality during mask-wearing.\n\n- **Cleansing and Care Products**: Interest in **exfoliating and deep cleansing products**, although critiques suggest they may not fully meet expectations.\n\n- **Wig Experience**: Mixed reviews on wigs, noting preferred aesthetics but often facing issues with **realism**, tangling, and overall quality.\n\n- **Practical Items**: Positive feedback towards **travel containers** for convenience, suggesting a blend of beauty and practicality in purchasing behavior. \n\nOverall, this shopper seeks beauty products that deliver on both softness and appearance, values practical accessories, and is discerning about quality, especially in hair products.",
  "target_interaction": {
    "rating": 2.0,
    "title": "Frizzy",
    "text": "This hair is very, VERY frizzy.  The frizz is so unattractive.  The twists kind of hide the extra hair when it’s all together but when  you go to run your fingers through the hair it is impossible to miss.  I do not recommend.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71JRmBMOCTL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71JRmBMOCTL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71JRmBMOCTL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/81i+Y2jQb9L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/81i+Y2jQb9L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/81i+Y2jQb9L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/91dOXpix-+L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/91dOXpix-+L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/91dOXpix-+L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/91x4p3RaJNL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/91x4p3RaJNL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/91x4p3RaJNL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B095Y1KFL7",
    "parent_asin": "B095Y1KFL7",
    "user_id": "AFYSHCJX77N6OZHBKFSTSYZGNJWQ",
    "timestamp": "2021-07-30 19:41:54.125000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Fly Pre-twisted Passion Twist Hair Natural Black Pre-looped Passion Twists Water Wave Crochet Hair 14Inch Fly Spring Twist Hair Crochet Braids",
    "average_rating": 4.1,
    "rating_number": 10,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/517G-9kinHS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/517G-9kinHS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/8143ms9u2eS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51u36ROBx-S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51u36ROBx-S.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81E8hd1MndS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61ROj7UEBkS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/61ROj7UEBkS.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81hWQ7gCUaS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51bwLBjSA5S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51bwLBjSA5S.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71CSoH4+qVS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51GyBxJo2sS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GyBxJo2sS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81kBV9lzC6S._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51KjA33eYKS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51KjA33eYKS.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81yK4qZ-iPS._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Shoobidoo",
    "categories": [],
    "details": {
      "Brand": "Shoobidoo",
      "Color": "black",
      "Material": "Synthetic",
      "Extension Length": "14 Inches",
      "Hair Type": "Wavy",
      "Package Dimensions": "10 x 8 x 2 inches; 1.34 Pounds",
      "Item model number": "passon"
    },
    "bought_together": null
  }
}