{
  "user_id": "AHRKSR7YAA6TGQGDO6CA5GDTRXDA",
  "summary": "=== Purchase Information ===\nProduct Title: Pumice Stone for Feet, 2 in 1 Double Sided Hard Skin Callus Remover for Feet,Hands and Body, Exfoliator Pedicure File Block Callus Remover Scrubber (Pack of 4)\nReview Date: 2020/09/21\nStore: KSang\nAverage Rating: 4.4\nProduct Details: {'Brand': 'KSang', 'Material': 'Volcanic Stone', 'Is Electric': 'No', 'Item Form': 'Scrubber, Filer', 'Unit Count': '4.00 Count', 'Package Dimensions': '6 x 5.6 x 2.7 inches; 3.21 Ounces', 'UPC': '192242957393'}\nReview Text: I feel like these do a good job of making rough skin a lot smoother. After just one use, I did notice that my skin was not quite as rough. Each time that I've used them, I've noticed my skin is a little smoother and softer. I think I've used it five or six times now. I'm used both the pumice stone side and the colored side. I actually like the colored side better, but when using the colored side, it leaves behind a bit of a grimy residue. If you're using it in the shower, as I do, this isn't a huge deal as you can just rinse it off. It does, though, make me wonder how long the colored side will last if it keeps coming apart a little each time that I use it.\nReview Title: Can Be Crumbly\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Butterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nReview Date: 2020/10/30\nStore: B bangcool\nAverage Rating: 4.6\nProduct Details: {'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nReview Text: There are sheets and sheets of butterflies in different sizes, ranging from small enough for a child's nails all the way up to big enough that I'd need long fake nails to use them. Even though they are all butterflies, there are a variety of styles. There are multicolored butterflies as well as some in a single color. You can really create the design that fits your style.<br /><br />There are directions on each sheet of butterflies, although the directions are the same for all of them. The directions are easy to follow even though they aren't always grammatically correct. My one complaint would be that I wish that there were directions for using the two jars of holographic butterflies. I'm sure that I can figure it out somewhere online, and it's probably pretty similar to how you apply the stickers, but directions still would have been nice. You really get an impressive amount for this price.\nReview Title: So Many Butterflies\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caudalie Beauty Essentials Beauty Elixir Set: 3 Piece Radiance Trio including a Pore Tightening Facial Mist, Daily Foam Cleanser, Brightening Glycolic Peel Mask\nReview Date: 2020/11/11\nAverage Rating: 4.4\nProduct Details: {'Package Dimensions': '7.87 x 5.83 x 1.61 inches; 1.18 Pounds'}\nReview Text: This set comes with three different products. They are all in small packaging, but you don't need to use a lot, so they should last a while. My opinion on each product differs a lot, so I'll provide a short review of each item.<br /><br />*Instant Foaming Cleanser: I love this one. It's my favorite. It smells wonderful, and it just feels great going on my skin and after I've rinsed it off. You really don't need much. I found that if I pressed down the top about halfway, I got enough to cover my whole face. For me, the cleanser is definitely a 5-star product.<br /><br />*Glycolic Peel Mask: While I felt like the mask did its job fine, I wasn't a fan of the smell at all. The best way that I can explain it is to say that it smells like wood to me. It's like I'm sniffing the bark of a tree. I'm not sure where that smell came from. It's not a horrible smell. It's just that I've had other masks that work just as well and have a more appealing smell. I'd probably give this one 3 stars.<br /><br />*Spray Beauty Elixir: This one is the hardest for me to review. When I first used it, I did not like it at all. While I like the smell, it's a bit overwhelming. The first time I used it, it also stung in a few spots. I know that this isn't how it was meant to be used, but I found that for me, it works best when I spray it on my hands and then pat my face with it. After using it a few times, it started to grow on me, and it does seem to moisturize my skin well. I'd give this 4 stars.<br /><br />Overall, this set evens out to 4 stars. It's a nice set, and if, like me, you haven't tried products by this brand before, this is a good way to sample them to decide what you like and what you don't like.\nReview Title: Depends on the Item\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bodyguard Moisturizing Immunity Soap 6pk | 7 Essential Oils Clinically Evaluated to Boost Immunity and Protect | Moisturizes with Sweet Almond Oil | Healthy PH for Skin Microbiome\nReview Date: 2020/12/08\nStore: Spa-Da\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Dry', 'Brand': 'Spa-Da', 'Scent': 'Cinnamon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8 x 3.3 x 2 inches; 7.2 Ounces', 'UPC': '860003618998'}\nReview Text: These are fairly small shields of soap. While the scent isn't overwhelmingly strong, you can definitely smell it when you are using the soap or if the soap is not in a container even when you are in the same room. We have a couple of bars sitting next to our bathroom sink, and you can smell them when you walk into the bathroom. To me, the most obvious scent is the clove. The other scents are cinnamon, oregano, rosemary, peppermint, parsley, and eucalyptus.<br /><br />I've liked the soap so far. It lathers up well. It's kind of a weird experience to wash with this. It's not really a scent that I generally associate with cleaning myself. While these scents might remind you more of your favorite Italian dish than what you would normally use as soap, if these are all smells that you generally enjoy, it's worth trying this soap.\nReview Title: Small But Nice\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LEAP Lemongrass Hand Soap, Natural & Moisturizing Lather, Gentle & Rinses Clean, Made with Organic Oils, Cruelty Free & Vegan, Liquid Hand Wash, Superbly Designed, 12 fl oz\nReview Date: 2020/12/09\nStore: Leap Organics\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'All', 'Brand': 'Leap Organics', 'Scent': 'Lemongrass', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.4 x 2.4 x 6.9 inches; 12 Ounces', 'UPC': '855920002692'}\nReview Text: I like the smell of lemon, so I really expected to like this hand soap a lot. Unfortunately, it's not a citrusy fresh lemon scent like I would want for a soap or another product that I'd put on my body. Instead, it reminds me more of a wood furniture polish smell. It's a pretty strong scent too. You can definitely smell it as you are washing your hands. Unfortunately, that smell lingers. I could still smell it on my hands about an hour after washing them. It also seemed to dry out my hands a lot more than other hand soaps that I've been using lately. I found that using a scented lotion on my hands after using this soap did help with both the wood furniture polish smell and with my dry hands.<br /><br />This soap does lather up well. I'm not a fan of the texture, though. For me, it felt like I had a slimy film on my hands. While I'm sure that other people will like this soap, I was not a fan.\nReview Title: The Smell Is Overwhelming\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nu-Pore Facial Sheet Mask Packaged Holiday Shippable Gift Set Aloe Vera Pomegranate Hibiscus Green Tea Lavender Cucumber 12 K-Beauty Sheets Perfect for Home Spa Treatment gifts Made in South Korea\nReview Date: 2021/01/25\nStore: nu-pore\nAverage Rating: 4.6\nProduct Details: {'Brand': 'nu-pore', 'Item Form': 'Sheet', 'Product Benefits': 'Soothing,Anti-aging', 'Scent': 'Pomegranate,Lavender', 'Skin Type': 'All', 'Package Dimensions': '9.69 x 6.89 x 1.93 inches; 15.52 Ounces'}\nReview Text: I've tried a few different facial sheet masks, and these are probably my favorites. One of the top reasons is the price. As of right now, the assortment pack of 12 is $1.25 per mask, and the larger packages are under a dollar a mask. For that price, I honestly wasn't expecting a whole lot, but I was surprised to find that these masks are at least as good as the ones that selling for twice the price or more.<br /><br />Another reason that I really like these masks is the way that they fit. While I like the end result of facial sheet masks, they often feel like they are too big for my face. I often feel like I either have to not have the holes for my eyes and mouth matching up, or I have to have weird wrinkles in the mask for everything to line up. With these masks, all the holes line up really well.<br /><br />I also like how moisturizing these masks are. My face just feels really smooth and soft after using one of these masks. While most of the masks look pretty similar to your typical masks, the panda one is also fun to use. I've included some pictures of what it looks like. I think it would be fun to buy the large pack of these for a sleepover, a girls' night, or even as part of a bachelorette party. While all of them would be fun to use with friends, the panda one provides an especially fun photo opportunity. The hibiscus also smells really nice. I don't think I've ever had a facial sheet mask that was hibiscus-scented, so that's also a little unique.\nReview Title: They Are Great!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vitamin C Face Serum with Lemon Peel Bio Ferment Restorative Anti-Aging Serum with 20% Vitamin C MSM Hyaluronic Acid Organic Aloe Vera and Jojoba – 1 Ounce\nReview Date: 2021/03/02\nStore: Sia Botanics\nAverage Rating: 4.6\nProduct Details: {'Package Dimensions': '4.57 x 1.46 x 1.34 inches; 3.21 Ounces', 'Item model number': 'SBCSRM', 'UPC': '713757595704'}\nReview Text: When I first started using this, I really did not like the scent. I was expected something citrusy, but that's not the scent I got. I'm not entirely sure how to describe it, but I assume that the smell comes from the lemon peels because it's kind of a fermented, musty, fishy smell. As I've used the serum more and more, I've adjusted to the smell. It's not great, but it's not horrible either. Given a scale of 0-10, with 0 being the most disgusting thing that I've ever smelled, 10 being the most amazing thing I've ever smelled, and 5 being neutral, neither good nor bad, I'd give this about a 4.8 when it comes to smell.<br /><br />Fortunately, the smell is fairly mild, and I can get past the slightly unpleasant smell because the product works well. It has made my face feel softer and smoother. I have a few dark spots on my face. After just two times using this, I noticed that they were a little lighter. With continued use, they have continued to fade.\nReview Title: You Get Used to the Scent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fiber Lash Mascara 2pcs Waterproof Dense Extra High Lash Blast Voluminous Lengthening Mascara Black, 0.54 Fl Oz\nReview Date: 2021/08/09\nStore: Marine Forest\nAverage Rating: 3.7\nProduct Details: {'Product Benefits': 'Lengthening', 'Brand': 'Marine Forest', 'Number of Items': '2', 'Item Volume': '0.27 Fluid Ounces', 'Package Information': 'Tube', 'Package Dimensions': '5 x 1.77 x 0.91 inches; 2.82 Ounces', 'Item model number': 'E3050-2', 'UPC': '762403106955'}\nReview Text: These are really nice mascaras. They go on easily and provide nice coverage. Since they are waterproof, I was concerned that it might be difficult to wash off, but it has come off without an issue. For this price, this is definitely a good mascara option.\nReview Title: Nice Mascara\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Foot Peel Mask Coconut - For Cracked Heels, Dead Skin Calluses - Removes & Repairs Rough Heels, Dry Feet, Make Your Feet Baby Soft - Natural Exfoliating Peeling Foot Mask 3 Pairs\nReview Date: 2021/08/23\nStore: HUALIJIA\nAverage Rating: 3.7\nProduct Details: {'Brand': 'HUALIJIA', 'Scent': 'Coconut', 'Skin Type': 'Dry', 'Unit Count': '3.00 Count', 'Number of Items': '6', 'Package Dimensions': '6.69 x 4.92 x 1.22 inches; 6.38 Ounces'}\nReview Text: I've used a few different foot masks before, and these have very different directions. Most tell you to put them on for 60-90 minutes. These only have you leave the foot masks on for 20-30 minutes. When we used these, we followed these directions. I'm not sure if they would have worked better if we'd left them on as long as we would with normal foot masks. Along with that, the directions say that if they aren't working as well as you'd like, you can use a new mask as soon as 4 days after the first mask. That seems really soon for me. Often, you aren't going to even begin seeing results until about four or five days after you first used the mask. Other brands suggest that you don't use another one for at least a month. That makes me think that these are not as powerful as other foot masks, which could be a good thing if you are concerned about your foot masks being too powerful.<br /><br />One thing that surprised me about these masks was that there was no mention of soaking your feet daily after using the foot masks. Every other foot mask that I've used has included that in the instructions. I'm not sure how well these would work without soaking your feet since my family soaked our feet even though that was not part of the directions.<br /><br />One thing that I liked about these was that they do smell really nice. They have a refreshing coconut scent. Some of the others that I've tried smell a bit chemically or like medicine. Unfortunately, I didn't feel like these worked as well as other foot masks. They are probably a 3.5-star item for me. They are less expensive than the other masks that I've tried, but they don't seem to work as well. I'd be willing to pay a little more for higher quality.\nReview Title: Different Directions Than Usual\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RBA’s Firming Serum to Reduce Fine Lines and Wrinkles - Improve Overall Tone With Yarrow, Neem, and Spirulina - Daily Vegan Serum - 1 fl oz\nReview Date: 2021/09/20\nStore: Round Barn Apothecary\nAverage Rating: 3.9\nProduct Details: {'Skin Type': 'All', 'Product Benefits': 'Hydrates, nourishes, and firms skin', 'Use for': 'Whole Body', 'Scent': 'Yarrow / Spirulina', 'Brand': 'Round Barn Apothecary', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '1.7 x 1.6 x 0.6 inches; 2.4 Ounces', 'UPC': '019962727542'}\nReview Text: The first thing I noticed about this product was the scent. It's a strong, earthy scent, much like I would expect from a pile of pulled-up weeds that had been sitting around for a few days. The scent lingered to the point that I've had to use scented moisturizer to cover up the smell.<br /><br />For me, the texture was a bit odd considering it's dispensed through a dropper. I'm guessing that's so you get the right amount and so that you don't end up using too much. For me, though, because it's a bit thick, I felt like a bottle where I could squirt the product out would make more sense.<br /><br />One good thing is that a little bit of this product does go a long way. When you squirt the product out of the dropper, you might think that it wouldn't be enough to cover your whole face. Fortunately, it is. That means that even though there is only one ounce of product in the container, it will likely last for a while.<br /><br />I have dry skin. While it's not too bad during the summer, I do use moisturizers specifically for dry skin most of the winter. Yet, this felt a little greasy on my face. It was like it didn't quite seep into my skin. Even a few hours later, my face felt slightly greasy. I tried it without using a moisturizer after putting it on, and it still felt greasier than expected. I think that come winter, when my skin is really dry, this might work without feeling too greasy, but I would definitely not suggest this for anyone with oily skin.<br /><br />While some people may love the smell, that combined with the greasy feeling and a price tag of $62 for an ounce, makes this a product that I would not get again or suggest to someone else.\nReview Title: Definitely Not For Oily Skin\nRating: 2.0\n--------------------------------------------------",
  "reference": "Pumice Stone for Feet, 2 in 1 Double Sided Hard Skin Callus Remover for Feet,Hands and Body, Exfoliator Pedicure File Block Callus Remover Scrubber (Pack of 4)\nKSang\n{'Brand': 'KSang', 'Material': 'Volcanic Stone', 'Is Electric': 'No', 'Item Form': 'Scrubber, Filer', 'Unit Count': '4.00 Count', 'Package Dimensions': '6 x 5.6 x 2.7 inches; 3.21 Ounces', 'UPC': '192242957393'}\nI feel like these do a good job of making rough skin a lot smoother. After just one use, I did notice that my skin was not quite as rough. Each time that I've used them, I've noticed my skin is a little smoother and softer. I think I've used it five or six times now. I'm used both the pumice stone side and the colored side. I actually like the colored side better, but when using the colored side, it leaves behind a bit of a grimy residue. If you're using it in the shower, as I do, this isn't a huge deal as you can just rinse it off. It does, though, make me wonder how long the colored side will last if it keeps coming apart a little each time that I use it.\nCan Be Crumbly\nButterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nB bangcool\n{'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nThere are sheets and sheets of butterflies in different sizes, ranging from small enough for a child's nails all the way up to big enough that I'd need long fake nails to use them. Even though they are all butterflies, there are a variety of styles. There are multicolored butterflies as well as some in a single color. You can really create the design that fits your style.<br /><br />There are directions on each sheet of butterflies, although the directions are the same for all of them. The directions are easy to follow even though they aren't always grammatically correct. My one complaint would be that I wish that there were directions for using the two jars of holographic butterflies. I'm sure that I can figure it out somewhere online, and it's probably pretty similar to how you apply the stickers, but directions still would have been nice. You really get an impressive amount for this price.\nSo Many Butterflies\nCaudalie Beauty Essentials Beauty Elixir Set: 3 Piece Radiance Trio including a Pore Tightening Facial Mist, Daily Foam Cleanser, Brightening Glycolic Peel Mask\n{'Package Dimensions': '7.87 x 5.83 x 1.61 inches; 1.18 Pounds'}\nThis set comes with three different products. They are all in small packaging, but you don't need to use a lot, so they should last a while. My opinion on each product differs a lot, so I'll provide a short review of each item.<br /><br />*Instant Foaming Cleanser: I love this one. It's my favorite. It smells wonderful, and it just feels great going on my skin and after I've rinsed it off. You really don't need much. I found that if I pressed down the top about halfway, I got enough to cover my whole face. For me, the cleanser is definitely a 5-star product.<br /><br />*Glycolic Peel Mask: While I felt like the mask did its job fine, I wasn't a fan of the smell at all. The best way that I can explain it is to say that it smells like wood to me. It's like I'm sniffing the bark of a tree. I'm not sure where that smell came from. It's not a horrible smell. It's just that I've had other masks that work just as well and have a more appealing smell. I'd probably give this one 3 stars.<br /><br />*Spray Beauty Elixir: This one is the hardest for me to review. When I first used it, I did not like it at all. While I like the smell, it's a bit overwhelming. The first time I used it, it also stung in a few spots. I know that this isn't how it was meant to be used, but I found that for me, it works best when I spray it on my hands and then pat my face with it. After using it a few times, it started to grow on me, and it does seem to moisturize my skin well. I'd give this 4 stars.<br /><br />Overall, this set evens out to 4 stars. It's a nice set, and if, like me, you haven't tried products by this brand before, this is a good way to sample them to decide what you like and what you don't like.\nDepends on the Item\nBodyguard Moisturizing Immunity Soap 6pk | 7 Essential Oils Clinically Evaluated to Boost Immunity and Protect | Moisturizes with Sweet Almond Oil | Healthy PH for Skin Microbiome\nSpa-Da\n{'Item Form': 'Oil', 'Skin Type': 'Dry', 'Brand': 'Spa-Da', 'Scent': 'Cinnamon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8 x 3.3 x 2 inches; 7.2 Ounces', 'UPC': '860003618998'}\nThese are fairly small shields of soap. While the scent isn't overwhelmingly strong, you can definitely smell it when you are using the soap or if the soap is not in a container even when you are in the same room. We have a couple of bars sitting next to our bathroom sink, and you can smell them when you walk into the bathroom. To me, the most obvious scent is the clove. The other scents are cinnamon, oregano, rosemary, peppermint, parsley, and eucalyptus.<br /><br />I've liked the soap so far. It lathers up well. It's kind of a weird experience to wash with this. It's not really a scent that I generally associate with cleaning myself. While these scents might remind you more of your favorite Italian dish than what you would normally use as soap, if these are all smells that you generally enjoy, it's worth trying this soap.\nSmall But Nice\nLEAP Lemongrass Hand Soap, Natural & Moisturizing Lather, Gentle & Rinses Clean, Made with Organic Oils, Cruelty Free & Vegan, Liquid Hand Wash, Superbly Designed, 12 fl oz\nLeap Organics\n{'Item Form': 'Liquid', 'Skin Type': 'All', 'Brand': 'Leap Organics', 'Scent': 'Lemongrass', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.4 x 2.4 x 6.9 inches; 12 Ounces', 'UPC': '855920002692'}\nI like the smell of lemon, so I really expected to like this hand soap a lot. Unfortunately, it's not a citrusy fresh lemon scent like I would want for a soap or another product that I'd put on my body. Instead, it reminds me more of a wood furniture polish smell. It's a pretty strong scent too. You can definitely smell it as you are washing your hands. Unfortunately, that smell lingers. I could still smell it on my hands about an hour after washing them. It also seemed to dry out my hands a lot more than other hand soaps that I've been using lately. I found that using a scented lotion on my hands after using this soap did help with both the wood furniture polish smell and with my dry hands.<br /><br />This soap does lather up well. I'm not a fan of the texture, though. For me, it felt like I had a slimy film on my hands. While I'm sure that other people will like this soap, I was not a fan.\nThe Smell Is Overwhelming\nNu-Pore Facial Sheet Mask Packaged Holiday Shippable Gift Set Aloe Vera Pomegranate Hibiscus Green Tea Lavender Cucumber 12 K-Beauty Sheets Perfect for Home Spa Treatment gifts Made in South Korea\nnu-pore\n{'Brand': 'nu-pore', 'Item Form': 'Sheet', 'Product Benefits': 'Soothing,Anti-aging', 'Scent': 'Pomegranate,Lavender', 'Skin Type': 'All', 'Package Dimensions': '9.69 x 6.89 x 1.93 inches; 15.52 Ounces'}\nI've tried a few different facial sheet masks, and these are probably my favorites. One of the top reasons is the price. As of right now, the assortment pack of 12 is $1.25 per mask, and the larger packages are under a dollar a mask. For that price, I honestly wasn't expecting a whole lot, but I was surprised to find that these masks are at least as good as the ones that selling for twice the price or more.<br /><br />Another reason that I really like these masks is the way that they fit. While I like the end result of facial sheet masks, they often feel like they are too big for my face. I often feel like I either have to not have the holes for my eyes and mouth matching up, or I have to have weird wrinkles in the mask for everything to line up. With these masks, all the holes line up really well.<br /><br />I also like how moisturizing these masks are. My face just feels really smooth and soft after using one of these masks. While most of the masks look pretty similar to your typical masks, the panda one is also fun to use. I've included some pictures of what it looks like. I think it would be fun to buy the large pack of these for a sleepover, a girls' night, or even as part of a bachelorette party. While all of them would be fun to use with friends, the panda one provides an especially fun photo opportunity. The hibiscus also smells really nice. I don't think I've ever had a facial sheet mask that was hibiscus-scented, so that's also a little unique.\nThey Are Great!\nVitamin C Face Serum with Lemon Peel Bio Ferment Restorative Anti-Aging Serum with 20% Vitamin C MSM Hyaluronic Acid Organic Aloe Vera and Jojoba – 1 Ounce\nSia Botanics\n{'Package Dimensions': '4.57 x 1.46 x 1.34 inches; 3.21 Ounces', 'Item model number': 'SBCSRM', 'UPC': '713757595704'}\nWhen I first started using this, I really did not like the scent. I was expected something citrusy, but that's not the scent I got. I'm not entirely sure how to describe it, but I assume that the smell comes from the lemon peels because it's kind of a fermented, musty, fishy smell. As I've used the serum more and more, I've adjusted to the smell. It's not great, but it's not horrible either. Given a scale of 0-10, with 0 being the most disgusting thing that I've ever smelled, 10 being the most amazing thing I've ever smelled, and 5 being neutral, neither good nor bad, I'd give this about a 4.8 when it comes to smell.<br /><br />Fortunately, the smell is fairly mild, and I can get past the slightly unpleasant smell because the product works well. It has made my face feel softer and smoother. I have a few dark spots on my face. After just two times using this, I noticed that they were a little lighter. With continued use, they have continued to fade.\nYou Get Used to the Scent\nFiber Lash Mascara 2pcs Waterproof Dense Extra High Lash Blast Voluminous Lengthening Mascara Black, 0.54 Fl Oz\nMarine Forest\n{'Product Benefits': 'Lengthening', 'Brand': 'Marine Forest', 'Number of Items': '2', 'Item Volume': '0.27 Fluid Ounces', 'Package Information': 'Tube', 'Package Dimensions': '5 x 1.77 x 0.91 inches; 2.82 Ounces', 'Item model number': 'E3050-2', 'UPC': '762403106955'}\nThese are really nice mascaras. They go on easily and provide nice coverage. Since they are waterproof, I was concerned that it might be difficult to wash off, but it has come off without an issue. For this price, this is definitely a good mascara option.\nNice Mascara\nFoot Peel Mask Coconut - For Cracked Heels, Dead Skin Calluses - Removes & Repairs Rough Heels, Dry Feet, Make Your Feet Baby Soft - Natural Exfoliating Peeling Foot Mask 3 Pairs\nHUALIJIA\n{'Brand': 'HUALIJIA', 'Scent': 'Coconut', 'Skin Type': 'Dry', 'Unit Count': '3.00 Count', 'Number of Items': '6', 'Package Dimensions': '6.69 x 4.92 x 1.22 inches; 6.38 Ounces'}\nI've used a few different foot masks before, and these have very different directions. Most tell you to put them on for 60-90 minutes. These only have you leave the foot masks on for 20-30 minutes. When we used these, we followed these directions. I'm not sure if they would have worked better if we'd left them on as long as we would with normal foot masks. Along with that, the directions say that if they aren't working as well as you'd like, you can use a new mask as soon as 4 days after the first mask. That seems really soon for me. Often, you aren't going to even begin seeing results until about four or five days after you first used the mask. Other brands suggest that you don't use another one for at least a month. That makes me think that these are not as powerful as other foot masks, which could be a good thing if you are concerned about your foot masks being too powerful.<br /><br />One thing that surprised me about these masks was that there was no mention of soaking your feet daily after using the foot masks. Every other foot mask that I've used has included that in the instructions. I'm not sure how well these would work without soaking your feet since my family soaked our feet even though that was not part of the directions.<br /><br />One thing that I liked about these was that they do smell really nice. They have a refreshing coconut scent. Some of the others that I've tried smell a bit chemically or like medicine. Unfortunately, I didn't feel like these worked as well as other foot masks. They are probably a 3.5-star item for me. They are less expensive than the other masks that I've tried, but they don't seem to work as well. I'd be willing to pay a little more for higher quality.\nDifferent Directions Than Usual\nRBA’s Firming Serum to Reduce Fine Lines and Wrinkles - Improve Overall Tone With Yarrow, Neem, and Spirulina - Daily Vegan Serum - 1 fl oz\nRound Barn Apothecary\n{'Skin Type': 'All', 'Product Benefits': 'Hydrates, nourishes, and firms skin', 'Use for': 'Whole Body', 'Scent': 'Yarrow / Spirulina', 'Brand': 'Round Barn Apothecary', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '1.7 x 1.6 x 0.6 inches; 2.4 Ounces', 'UPC': '019962727542'}\nThe first thing I noticed about this product was the scent. It's a strong, earthy scent, much like I would expect from a pile of pulled-up weeds that had been sitting around for a few days. The scent lingered to the point that I've had to use scented moisturizer to cover up the smell.<br /><br />For me, the texture was a bit odd considering it's dispensed through a dropper. I'm guessing that's so you get the right amount and so that you don't end up using too much. For me, though, because it's a bit thick, I felt like a bottle where I could squirt the product out would make more sense.<br /><br />One good thing is that a little bit of this product does go a long way. When you squirt the product out of the dropper, you might think that it wouldn't be enough to cover your whole face. Fortunately, it is. That means that even though there is only one ounce of product in the container, it will likely last for a while.<br /><br />I have dry skin. While it's not too bad during the summer, I do use moisturizers specifically for dry skin most of the winter. Yet, this felt a little greasy on my face. It was like it didn't quite seep into my skin. Even a few hours later, my face felt slightly greasy. I tried it without using a moisturizer after putting it on, and it still felt greasier than expected. I think that come winter, when my skin is really dry, this might work without feeling too greasy, but I would definitely not suggest this for anyone with oily skin.<br /><br />While some people may love the smell, that combined with the greasy feeling and a price tag of $62 for an ounce, makes this a product that I would not get again or suggest to someone else.\nDefinitely Not For Oily Skin",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Pumice Stone for Feet, 2 in 1 Double Sided Hard Skin Callus Remover for Feet,Hands and Body, Exfoliator Pedicure File Block Callus Remover Scrubber (Pack of 4)\nReview Date: 2020/09/21\nStore: KSang\nAverage Rating: 4.4\nProduct Details: {'Brand': 'KSang', 'Material': 'Volcanic Stone', 'Is Electric': 'No', 'Item Form': 'Scrubber, Filer', 'Unit Count': '4.00 Count', 'Package Dimensions': '6 x 5.6 x 2.7 inches; 3.21 Ounces', 'UPC': '192242957393'}\nReview Text: I feel like these do a good job of making rough skin a lot smoother. After just one use, I did notice that my skin was not quite as rough. Each time that I've used them, I've noticed my skin is a little smoother and softer. I think I've used it five or six times now. I'm used both the pumice stone side and the colored side. I actually like the colored side better, but when using the colored side, it leaves behind a bit of a grimy residue. If you're using it in the shower, as I do, this isn't a huge deal as you can just rinse it off. It does, though, make me wonder how long the colored side will last if it keeps coming apart a little each time that I use it.\nReview Title: Can Be Crumbly\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Butterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nReview Date: 2020/10/30\nStore: B bangcool\nAverage Rating: 4.6\nProduct Details: {'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nReview Text: There are sheets and sheets of butterflies in different sizes, ranging from small enough for a child's nails all the way up to big enough that I'd need long fake nails to use them. Even though they are all butterflies, there are a variety of styles. There are multicolored butterflies as well as some in a single color. You can really create the design that fits your style.<br /><br />There are directions on each sheet of butterflies, although the directions are the same for all of them. The directions are easy to follow even though they aren't always grammatically correct. My one complaint would be that I wish that there were directions for using the two jars of holographic butterflies. I'm sure that I can figure it out somewhere online, and it's probably pretty similar to how you apply the stickers, but directions still would have been nice. You really get an impressive amount for this price.\nReview Title: So Many Butterflies\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caudalie Beauty Essentials Beauty Elixir Set: 3 Piece Radiance Trio including a Pore Tightening Facial Mist, Daily Foam Cleanser, Brightening Glycolic Peel Mask\nReview Date: 2020/11/11\nAverage Rating: 4.4\nProduct Details: {'Package Dimensions': '7.87 x 5.83 x 1.61 inches; 1.18 Pounds'}\nReview Text: This set comes with three different products. They are all in small packaging, but you don't need to use a lot, so they should last a while. My opinion on each product differs a lot, so I'll provide a short review of each item.<br /><br />*Instant Foaming Cleanser: I love this one. It's my favorite. It smells wonderful, and it just feels great going on my skin and after I've rinsed it off. You really don't need much. I found that if I pressed down the top about halfway, I got enough to cover my whole face. For me, the cleanser is definitely a 5-star product.<br /><br />*Glycolic Peel Mask: While I felt like the mask did its job fine, I wasn't a fan of the smell at all. The best way that I can explain it is to say that it smells like wood to me. It's like I'm sniffing the bark of a tree. I'm not sure where that smell came from. It's not a horrible smell. It's just that I've had other masks that work just as well and have a more appealing smell. I'd probably give this one 3 stars.<br /><br />*Spray Beauty Elixir: This one is the hardest for me to review. When I first used it, I did not like it at all. While I like the smell, it's a bit overwhelming. The first time I used it, it also stung in a few spots. I know that this isn't how it was meant to be used, but I found that for me, it works best when I spray it on my hands and then pat my face with it. After using it a few times, it started to grow on me, and it does seem to moisturize my skin well. I'd give this 4 stars.<br /><br />Overall, this set evens out to 4 stars. It's a nice set, and if, like me, you haven't tried products by this brand before, this is a good way to sample them to decide what you like and what you don't like.\nReview Title: Depends on the Item\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bodyguard Moisturizing Immunity Soap 6pk | 7 Essential Oils Clinically Evaluated to Boost Immunity and Protect | Moisturizes with Sweet Almond Oil | Healthy PH for Skin Microbiome\nReview Date: 2020/12/08\nStore: Spa-Da\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Dry', 'Brand': 'Spa-Da', 'Scent': 'Cinnamon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8 x 3.3 x 2 inches; 7.2 Ounces', 'UPC': '860003618998'}\nReview Text: These are fairly small shields of soap. While the scent isn't overwhelmingly strong, you can definitely smell it when you are using the soap or if the soap is not in a container even when you are in the same room. We have a couple of bars sitting next to our bathroom sink, and you can smell them when you walk into the bathroom. To me, the most obvious scent is the clove. The other scents are cinnamon, oregano, rosemary, peppermint, parsley, and eucalyptus.<br /><br />I've liked the soap so far. It lathers up well. It's kind of a weird experience to wash with this. It's not really a scent that I generally associate with cleaning myself. While these scents might remind you more of your favorite Italian dish than what you would normally use as soap, if these are all smells that you generally enjoy, it's worth trying this soap.\nReview Title: Small But Nice\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LEAP Lemongrass Hand Soap, Natural & Moisturizing Lather, Gentle & Rinses Clean, Made with Organic Oils, Cruelty Free & Vegan, Liquid Hand Wash, Superbly Designed, 12 fl oz\nReview Date: 2020/12/09\nStore: Leap Organics\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'All', 'Brand': 'Leap Organics', 'Scent': 'Lemongrass', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.4 x 2.4 x 6.9 inches; 12 Ounces', 'UPC': '855920002692'}\nReview Text: I like the smell of lemon, so I really expected to like this hand soap a lot. Unfortunately, it's not a citrusy fresh lemon scent like I would want for a soap or another product that I'd put on my body. Instead, it reminds me more of a wood furniture polish smell. It's a pretty strong scent too. You can definitely smell it as you are washing your hands. Unfortunately, that smell lingers. I could still smell it on my hands about an hour after washing them. It also seemed to dry out my hands a lot more than other hand soaps that I've been using lately. I found that using a scented lotion on my hands after using this soap did help with both the wood furniture polish smell and with my dry hands.<br /><br />This soap does lather up well. I'm not a fan of the texture, though. For me, it felt like I had a slimy film on my hands. While I'm sure that other people will like this soap, I was not a fan.\nReview Title: The Smell Is Overwhelming\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nu-Pore Facial Sheet Mask Packaged Holiday Shippable Gift Set Aloe Vera Pomegranate Hibiscus Green Tea Lavender Cucumber 12 K-Beauty Sheets Perfect for Home Spa Treatment gifts Made in South Korea\nReview Date: 2021/01/25\nStore: nu-pore\nAverage Rating: 4.6\nProduct Details: {'Brand': 'nu-pore', 'Item Form': 'Sheet', 'Product Benefits': 'Soothing,Anti-aging', 'Scent': 'Pomegranate,Lavender', 'Skin Type': 'All', 'Package Dimensions': '9.69 x 6.89 x 1.93 inches; 15.52 Ounces'}\nReview Text: I've tried a few different facial sheet masks, and these are probably my favorites. One of the top reasons is the price. As of right now, the assortment pack of 12 is $1.25 per mask, and the larger packages are under a dollar a mask. For that price, I honestly wasn't expecting a whole lot, but I was surprised to find that these masks are at least as good as the ones that selling for twice the price or more.<br /><br />Another reason that I really like these masks is the way that they fit. While I like the end result of facial sheet masks, they often feel like they are too big for my face. I often feel like I either have to not have the holes for my eyes and mouth matching up, or I have to have weird wrinkles in the mask for everything to line up. With these masks, all the holes line up really well.<br /><br />I also like how moisturizing these masks are. My face just feels really smooth and soft after using one of these masks. While most of the masks look pretty similar to your typical masks, the panda one is also fun to use. I've included some pictures of what it looks like. I think it would be fun to buy the large pack of these for a sleepover, a girls' night, or even as part of a bachelorette party. While all of them would be fun to use with friends, the panda one provides an especially fun photo opportunity. The hibiscus also smells really nice. I don't think I've ever had a facial sheet mask that was hibiscus-scented, so that's also a little unique.\nReview Title: They Are Great!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vitamin C Face Serum with Lemon Peel Bio Ferment Restorative Anti-Aging Serum with 20% Vitamin C MSM Hyaluronic Acid Organic Aloe Vera and Jojoba – 1 Ounce\nReview Date: 2021/03/02\nStore: Sia Botanics\nAverage Rating: 4.6\nProduct Details: {'Package Dimensions': '4.57 x 1.46 x 1.34 inches; 3.21 Ounces', 'Item model number': 'SBCSRM', 'UPC': '713757595704'}\nReview Text: When I first started using this, I really did not like the scent. I was expected something citrusy, but that's not the scent I got. I'm not entirely sure how to describe it, but I assume that the smell comes from the lemon peels because it's kind of a fermented, musty, fishy smell. As I've used the serum more and more, I've adjusted to the smell. It's not great, but it's not horrible either. Given a scale of 0-10, with 0 being the most disgusting thing that I've ever smelled, 10 being the most amazing thing I've ever smelled, and 5 being neutral, neither good nor bad, I'd give this about a 4.8 when it comes to smell.<br /><br />Fortunately, the smell is fairly mild, and I can get past the slightly unpleasant smell because the product works well. It has made my face feel softer and smoother. I have a few dark spots on my face. After just two times using this, I noticed that they were a little lighter. With continued use, they have continued to fade.\nReview Title: You Get Used to the Scent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fiber Lash Mascara 2pcs Waterproof Dense Extra High Lash Blast Voluminous Lengthening Mascara Black, 0.54 Fl Oz\nReview Date: 2021/08/09\nStore: Marine Forest\nAverage Rating: 3.7\nProduct Details: {'Product Benefits': 'Lengthening', 'Brand': 'Marine Forest', 'Number of Items': '2', 'Item Volume': '0.27 Fluid Ounces', 'Package Information': 'Tube', 'Package Dimensions': '5 x 1.77 x 0.91 inches; 2.82 Ounces', 'Item model number': 'E3050-2', 'UPC': '762403106955'}\nReview Text: These are really nice mascaras. They go on easily and provide nice coverage. Since they are waterproof, I was concerned that it might be difficult to wash off, but it has come off without an issue. For this price, this is definitely a good mascara option.\nReview Title: Nice Mascara\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Foot Peel Mask Coconut - For Cracked Heels, Dead Skin Calluses - Removes & Repairs Rough Heels, Dry Feet, Make Your Feet Baby Soft - Natural Exfoliating Peeling Foot Mask 3 Pairs\nReview Date: 2021/08/23\nStore: HUALIJIA\nAverage Rating: 3.7\nProduct Details: {'Brand': 'HUALIJIA', 'Scent': 'Coconut', 'Skin Type': 'Dry', 'Unit Count': '3.00 Count', 'Number of Items': '6', 'Package Dimensions': '6.69 x 4.92 x 1.22 inches; 6.38 Ounces'}\nReview Text: I've used a few different foot masks before, and these have very different directions. Most tell you to put them on for 60-90 minutes. These only have you leave the foot masks on for 20-30 minutes. When we used these, we followed these directions. I'm not sure if they would have worked better if we'd left them on as long as we would with normal foot masks. Along with that, the directions say that if they aren't working as well as you'd like, you can use a new mask as soon as 4 days after the first mask. That seems really soon for me. Often, you aren't going to even begin seeing results until about four or five days after you first used the mask. Other brands suggest that you don't use another one for at least a month. That makes me think that these are not as powerful as other foot masks, which could be a good thing if you are concerned about your foot masks being too powerful.<br /><br />One thing that surprised me about these masks was that there was no mention of soaking your feet daily after using the foot masks. Every other foot mask that I've used has included that in the instructions. I'm not sure how well these would work without soaking your feet since my family soaked our feet even though that was not part of the directions.<br /><br />One thing that I liked about these was that they do smell really nice. They have a refreshing coconut scent. Some of the others that I've tried smell a bit chemically or like medicine. Unfortunately, I didn't feel like these worked as well as other foot masks. They are probably a 3.5-star item for me. They are less expensive than the other masks that I've tried, but they don't seem to work as well. I'd be willing to pay a little more for higher quality.\nReview Title: Different Directions Than Usual\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RBA’s Firming Serum to Reduce Fine Lines and Wrinkles - Improve Overall Tone With Yarrow, Neem, and Spirulina - Daily Vegan Serum - 1 fl oz\nReview Date: 2021/09/20\nStore: Round Barn Apothecary\nAverage Rating: 3.9\nProduct Details: {'Skin Type': 'All', 'Product Benefits': 'Hydrates, nourishes, and firms skin', 'Use for': 'Whole Body', 'Scent': 'Yarrow / Spirulina', 'Brand': 'Round Barn Apothecary', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '1.7 x 1.6 x 0.6 inches; 2.4 Ounces', 'UPC': '019962727542'}\nReview Text: The first thing I noticed about this product was the scent. It's a strong, earthy scent, much like I would expect from a pile of pulled-up weeds that had been sitting around for a few days. The scent lingered to the point that I've had to use scented moisturizer to cover up the smell.<br /><br />For me, the texture was a bit odd considering it's dispensed through a dropper. I'm guessing that's so you get the right amount and so that you don't end up using too much. For me, though, because it's a bit thick, I felt like a bottle where I could squirt the product out would make more sense.<br /><br />One good thing is that a little bit of this product does go a long way. When you squirt the product out of the dropper, you might think that it wouldn't be enough to cover your whole face. Fortunately, it is. That means that even though there is only one ounce of product in the container, it will likely last for a while.<br /><br />I have dry skin. While it's not too bad during the summer, I do use moisturizers specifically for dry skin most of the winter. Yet, this felt a little greasy on my face. It was like it didn't quite seep into my skin. Even a few hours later, my face felt slightly greasy. I tried it without using a moisturizer after putting it on, and it still felt greasier than expected. I think that come winter, when my skin is really dry, this might work without feeling too greasy, but I would definitely not suggest this for anyone with oily skin.<br /><br />While some people may love the smell, that combined with the greasy feeling and a price tag of $62 for an ounce, makes this a product that I would not get again or suggest to someone else.\nReview Title: Definitely Not For Oily Skin\nRating: 2.0\n--------------------------------------------------",
  "raw_response": "**Preferences and Patterns Summary:**\n\n- **Skin Care Enthusiast:** Frequent purchases of skincare products, including moisturizing treatments, facial masks, serums, and cleansers; seeks effective quality products.\n- **Foot Care Focus:** Regularly invests in foot care items, showing a clear desire for smooth skin and maintenance.\n- **Creative Expression:** Engages in activities like nail art, indicating an interest in personal grooming and aesthetics.\n- **Scent Sensitivity:** Experiences varied reactions to product scents, preferring pleasant and refreshing smells over overwhelming or unpleasant ones.\n- **Value-Seeking:** Shows a tendency to prioritize value, evidenced by positive feedback on affordable items that perform well despite lower expectations.\n- **Product Experimentation:** Willing to try different brands and formulations, though quickly judges based on experience, especially regarding scent and texture.\n- **Mixed Reviews:** Displays discerning standards; giving high ratings to products that meet expectations while expressing disappointment when items do not align with preferences.\n\nOverall, the individual indicates a strong focus on effective self-care, creative expression, and a discerning taste in quality and sensory experience.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Only Got Half",
    "text": "Unfortunately, I only got half of them, so I wasn't able to accurately review these. I got the lemon, tea tree, peach, and jasmine ones. Since I got the set mainly for the rose and coconut ones, I was definitely disappointed.<br /><br />The four that I did receive do smell decent. The scent is pretty mild. In my opinion, of the ones that I got, the jasmine and the peach smell the best. They do provide some suds, but they definitely don't suds up as well as I had hoped. They are a good size for putting in your purse, backpack, or another bag, and they will work in a clean-up emergency. Even if I'd gotten all eight packages, I probably wouldn't get these again.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61sBtbuXe4L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61sBtbuXe4L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61sBtbuXe4L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61xxsp024XL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61xxsp024XL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61xxsp024XL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B0B2QNLG7C",
    "parent_asin": "B0C5V83YMB",
    "user_id": "AHRKSR7YAA6TGQGDO6CA5GDTRXDA",
    "timestamp": "2022-07-08 21:45:41.518000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "YouClean 300 Antibacterial Travel Hand Soap Sheets - Pocket/Purse/Wallet/Backpack -Great for Outdoor Camping or Daily Use (Tea Party) (Tea Party)",
    "average_rating": 3.6,
    "rating_number": 35,
    "features": [
      "PORTABLE TRAVEL SIZE -- Each YouClean collection has 3 tiny boxes (2 x 1 x 0.25 inches) (5 x 2.5 x 0.5 cm) which nicely fit in any purse/ wallet, handbag, pack-backs that come in handy everywhere and at any time. These portable soap sheets are small, light and zero-waste which makes them perfect for travel, hiking, camping, school trips and convenient at workplaces.",
      "FOAMING, MOITURIZING & NOURISHING SKIN -- YouClean hand soap sheet quickly dissolves to create a foaming lather. It is made with high quality, all-natural plant-based ingredients, nourish and moisturize your skin with flower/fruit essential oils.",
      "WONDERFUL AROMATHERAPY with ESSENTIAL OILS -- YouClean 8 scent collections will keep your wallet, handbag, pack backs, or pockets smell good all the time. We also have The Nonsense (unscented) which is suitable for professional working environments.",
      "EASY-TO-USE -- Take out a YouClean soap sheet with dry hands. Add water and rub hands to form a lather. Rinse, dry and enjoy your clean hands. It is suitable for all skin types and whole body. It can be used as shampoo or body wash, if needed.",
      "NO PLASTIC PACKAGING with 100% biodegradable paper packaging. We are fighting with the plastic waste by being part of the solution. GREEN EARTH IS OUR GOAL - KEEP YouClean IS YOUR MISSION!"
    ],
    "description": [
      "Brand:",
      "YouClean",
      "Item Form:",
      "Sheet",
      "Formulation:",
      "Concentrated plant-based soap",
      "Scent:",
      "Tea Party (Chamomile, Green Tea, Tea Tree)",
      "Package Box Size:",
      "2 x 1 x 1.5 inch",
      "www.shopyouclean.com",
      "We are changing our packaging. No more small plastic cases!   Our new packaging is 100% biodegradable paper. All 300 sheets are tightly packed in 3 tiny paper boxes (100 sheets/box) which nicely fit in any purse/wallet, handbag, and kids' pack-backs.   Check out our 9 scent collections:   - Tea Party  - Citrus Collection  - Purple Heart  - Pink Pamper  - Red Passion  - Blanca Elegance  - Seaside Vacation  - The Adventure  - The Nonsense (unscented)"
    ],
    "price": 13.87,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51yyb7H-oAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51yyb7H-oAL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81WNf9Y-xzL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51yHmgMmuxL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51yHmgMmuxL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71Y-crWSXHL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/21K1kGeUuAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/21K1kGeUuAL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/51-RrxXdXCL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31NCHZGYWWL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31NCHZGYWWL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61yQXlC91iL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/310ID+BQ3tL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/310ID+BQ3tL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/515T1kWGH4L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41L9dEfsRRL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41L9dEfsRRL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71wHP8jox0L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51QKTSaNuhL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51QKTSaNuhL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/81qxOR1TMGL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51tpJjTPDhL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51tpJjTPDhL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71bulGhlvAL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41df9VrWCbL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41df9VrWCbL.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/81lwA4QWyDL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Really great for travel!",
        "url": "https://www.amazon.com/vdp/01ce11c1abaf4876bcb7488c49c7e7fd?ref=dp_vse_rvc_0",
        "user_id": "AGUTCY4WTOF2FS5XSFK7RFWPX6MQ"
      }
    ],
    "store": "YouClean",
    "categories": [],
    "details": {
      "Item Form": "Sheet",
      "Skin Type": "All",
      "Brand": "YouClean",
      "Scent": "Tea Party",
      "Material Type Free": "Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)  See more",
      "Product Dimensions": "2 x 1 x 1.25 inches; 2.4 Ounces",
      "UPC": "609670421100",
      "Manufacturer": "YouClean"
    },
    "bought_together": null
  }
}