{
  "user_id": "AE6I5KFJ2EJNRBBV7NWURRU2X6UQ_1",
  "summary": "=== Purchase Information ===\nProduct Title: Lihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nReview Date: 2020/02/03\nStore: Lihui\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nReview Text: I ordered these Lihui Pre- Twisted Passion twists crochet 6 packs hair for my wife and she likes them so much. She says they seem to be made of good quality materials and like that they are pe-twisted. My wife wanted to try out a different style so we got these crochet passion twists. She likes that they are lightweight, durable, and easy to install with simple to follow instructions. She says she likes that the twists are tight and bouncy and they are also soft and shiny. Another feature my wife likes is that the passion twists don't tangle easily as she since she fixed them. She likes that they comes with enough twists for her whole head, and even had extra after fixing the hair. My wife has ordered hair in the past that smelled bad, luckily these twists didn't have a foul odor. Overall, my wife was very happy with these twists and how beautiful they looked on her. I would recommend them.\nReview Title: Easy to install, and good value for money\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: STYLEAGAL False Eyelashes - 4 Pairs Multipack Natural 3D False Eyelashes Natural Thick Hand-Made Faux Mink Eyelashes Extension(G106)\nReview Date: 2020/02/12\nStore: styleagal\nAverage Rating: 4.0\nProduct Details: {'Brand': 'styleagal', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 3.8 x 0.3 inches; 0.63 Ounces'}\nReview Text: I ordered these STYLEAGAL false eyelashes for my wife and she says she likes them so much and the thickness and the color. She says the eyelashes were easy to attach on her own eyelashes by following simple steps.<br />After applying them the lashes on, she says she likes how the false eyelashes blend well with her own natural eyelashes; giving them a more full look. She likes that they were made of good quality synthetic fibers, and they appear to be durable. She says she likes that they are lightweight, soft, and smooth. My wife likes that she can reuse them and she has reused them 6 times in the last 2+ weeks, and so far, so good.<br />For the quality, quantity and price, they are great value for money. I would recommend them.\nReview Title: Great quality and value for money\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pre-stretched Braiding Hair Easy Braid Professional Itch Free Synthetic Fiber Corchet Braids Yaki Texture Hair Extensions 5 packs Braid Hair 22 Inch (Color T1B/27)\nReview Date: 2020/06/28\nStore: Kapelli Hair\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Kapelli Hair', 'Material': 'Synthetic', 'Extension Length': '22 Inches', 'Package Dimensions': '11.9 x 11.25 x 2.3 inches; 15.2 Ounces'}\nReview Text: I ordered these Kapelli Hair textured crochet extensions for my wife and she does look really good with them. My wife says that she says she does like them a lot because they are different from the crochet hair extensions that she usually gets and she likes how lightweight, abundant and flowy they feel on her head. She likes how they have a very natural and fluffy look and how easy they are to fic with no harm or damage to her skin. My wife does like the hair pattern and she says that they are nice and smooth. She says that they didn't even look frizzy or damaged when the hair was taken out of the packets. She says her favorite thing about these hair's is how easy they are to wash and how breathable it feels which makes it nice for when it’s hot in our neck of the woods Summer weather. My wife does like that the hair looks tangle -free and sheds- free after washing them. Overall my wife really likes the hair extension and she says that they are different, cute and they look natural and shiny. I would definitely recommend them.\nReview Title: Durable, easy to fix and great value for money!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: JulyQueen 165g Crochet Braiding Hair Blonde Color Crochet Hair for Black Women Synthetic Hair Extension Fold Length 41 Inch 3 Pack\nReview Date: 2020/07/29\nStore: JulyQueen\nAverage Rating: 3.0\nProduct Details: {'Item model number': '165Ycl-543'}\nReview Text: I ordered these JulyQueen 3 packs of Jumbo Kanekalon synthetic hair extensions for one of our daughters, and she says that she likes them a lot. Our daughter says that she likes the blonde color, the braiding style, and the long texture. She says that she likes that the hair is soft to touch, smooth, thick and full, and she likes that they are 24 inches long as she wanted the hair. Our daughter says that she wanted to try a different hair style and she used these hair extensions for her Sengalese twist and she says that she used 6 packs in total to complete the style as she has 3 packs of different colors and she decided to combine the Blonde and Rose Red colors with a little left over. She says she likes that the hair extensions were easy to install and braid and she says that she likes the look, the styling of the twist and she likes that the hair extensions seem to be made with good quality 100% Kanekalon synthetic fiber, and they appear to be comfortable on her hair, lightweight, tangle- free and durable.<br />Our daughter says that so far so good with the Senagalese twists and she says she likes how gorgeous they look on her. For the quality, quantity and price point, they seem to be good value for money. I would recommend them.\nReview Title: Easy to install, soft and durable!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Packs/Lot 26 Inch Pre-stretched Braiding Hair Professional Perm Yaki Synthetic Hair Braids(Ombre Brown Blond,#1B/30/27)\nReview Date: 2020/09/28\nStore: Alishow\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Alishow', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '16.97 x 12.48 x 2.52 inches; 2.07 Pounds', 'UPC': '727196547491'}\nReview Text: I ordered these Alishow 6 packs, synthetic braiding hair for our daughter and she likes them a lot. Our daughter does say she likes the brown blond colors, the texture and the design and the styling of the thick end, the 26 inch length, and the pre-stretched braiding.<br />She says she likes that these hair braids were easy and quick to install, and she says the hair is soft and smooth to touch and she likes that they are lightweight, don’t form tangles, and so far she has not experienced any itching. She did braids and twists and she says she does like the look, and she likes how she can change the pre-stretched braiding style by dipping the hair braids in hot water for them to set.<br />Our daughter says she likes that these hair twists appear to be made with good quality synthetic materials and they seem to be durable, comfortable on her head, and easy to wash and clean. So far she says that these braids appear to be good value for money, considering the quality and the price point. I would recommend them.\nReview Title: Easy to install, soft and lightweight!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jumbo Braiding Hair Extensions 24 Inch 6 Packs Ombre Synthetic Hair Crochet Braids Kanekalon Long Jumbo Braids For Box Braid Twist Crochet Hair (Black/Dark Brown/Light Brown)\nReview Date: 2020/10/07\nStore: Belle Show\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Installation Type': 'Clip-In', 'Package Dimensions': '10.16 x 9.49 x 4.29 inches; 1.43 Pounds'}\nReview Text: I ordered these Belle Show Jumbo Braiding Hair Extensions of 6 packs for my wife and she says she likes them so much. My wife says that she likes the black, dark and light brown colors of the hair, the texture, and the 24 inches length of these synthetic hair. She says she likes that the 6 packs were enough to braid her hair. She likes that her hair stylist found these hair extensions easy to install without any hassles.  My wife says she likes that these hair extensions appear to be made with good quality synthetic fiber, and they seem to be lightweight, durable, soft, smooth to touch and comfortable on her hair and head. She says she likes that these hair extensions are tangle- free, don’t have any shedding or itching so far. She says that she has washed the hair once after installing them and she likes that the colors and the quality didn’t change. Considering the quality, the quantity and the price point, they seem to be good value for bucks. I would recommend them.\nReview Title: Durable, comfy and easy to install\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YinMer Lavish Lash – Eyelash Growth Enhancer & Brow Serum with Biotin & Natural Growth Peptides for Long, Thick Lashes and Eyebrows\nReview Date: 2020/10/14\nStore: OUZIFISH\nAverage Rating: 3.7\nProduct Details: {'Package Dimensions': '6.61 x 2.8 x 1.26 inches; 3.53 Ounces'}\nReview Text: I ordered this OUZIFISH YinMer Lavish Eyelash growth enhancer for one of our daughters, and she says that she does like texture and the ease of application of the liquid. She says she followed the simple step by step process to apply it on her eyelashes and brow. Our daughter says that she likes that the applicator’s handle is comfortable to hold, and easy to use. She has been applying the liquid daily for the last 2 weeks and she followed all the processes and she says she has only noticed a little growth and thickness in her eyelashes and brow. Our daughter says she would continue to apply it in the next few weeks to see if he would get more growth in her eyelashes and brow.<br />I will update this review if anything changes with the expected outcome of this serum.\nReview Title: Easy to apply!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Black Wolf - Men’s Ultra Hydrating Moisturizer - 1.7 Fl Oz – Soothe Dry, Patchy & Flaky Areas on your Skin - Fast Absorbing Formula Won't Feel Heavy or Greasy - Sulfate Free for Dry Skin\nReview Date: 2020/10/25\nStore: Black Wolf\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Black Wolf', 'Item Form': 'Lotion', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Dry', 'Package Dimensions': '5.39 x 3.15 x 1.46 inches; 2.4 Ounces', 'Item model number': 'BLKWLF_MOIST_DRY', 'UPC': '850021340087'}\nReview Text: I ordered this Black Wolf Nation Ultra Moisturizer for Men for our son and he says that he likes it a lot and says that he likes that it is easy to apply on his dry skin by following the simple directions on how to use it. Our son says he has been using it for the last several days and he has started to see the changes with his skin as it is less dry as this formula helps to hydrate and moisturize his skin and decrease flakiness of his skin. He says that after applying the moisturizer, he says that it feels soft, gentle and easy on his skin.<br />Our son says that it seems that this formula was made with good quality active ingredients like Paraffinum, Liquidum, Tocopherol, Potassium Sorbate, Water, Squalane and others, and he says he likes the texture of this skin care product on his facial skin. Our son says he plans to continue to use it for the next few  weeks and if anything changes with the expectations, I would update this review. He says so far, so good.\nReview Title: Soft, easy to use and it works!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leetaltree 6Pcs Makeup Sponge Set\nReview Date: 2020/10/26\nStore: Leetaltree\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Leetaltree', 'Color': 'Ivory', 'Item Dimensions LxWxH': '1.6 x 1.6 x 2.36 inches', 'Skin Type': 'Normal,All Skin Types', 'Product Dimensions': '1.6 x 1.6 x 2.36 inches; 2.08 Ounces'}\nReview Text: I ordered these Leetaltree Foundation sponges for one of our daughters and she says she likes the multi-colors, the variety of drop, gourd and oblique-cut shapes. She says her favorite features are the dry and wet use and the sponge turning bigger when wet, and she likes that she can use the sponges for her variety of cosmetics, foundation and powder. Our daughter says she likes that the sponges are soft, smooth and gentle on her skin and that they are easy to use, and apply on her skin by following the simple instruction on how to evenly dab it on her skin. She says she likes how the makeup turns out each time after the application.<br />Our daughter says she likes that the sponges seem to be made with good quality non- latex materials and they appear to be lightweight, durable and well designed. She likes that she can re-use them and the sponges appear to be great value for money considering the quality and the price point. I would definitely recommend them.\nReview Title: Soft, easy to apply and great value for bucks!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AISI QUEENS Curly Bob Wig Short Ombre Brown Wig for Black Women Kinky Hair Middle Part Heat Resistant Synthetic Hair Wig for Women 14inch\nReview Date: 2021/01/14\nStore: AISI QUEENS\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Coily', 'Style': 'Modern', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.71 x 8.9 x 2.72 inches; 9.14 Ounces'}\nReview Text: I ordered this AISI QUEENS Short Bob Wig for Women for my wife and she says she likes the Brown color, the 14 inch length, the curvature of the hair, and she likes that it covers her scalp and hair fully.<br />My wife says she likes the density of this synthetic hair and she says that she likes that it is comfortable to wear, easy to put on and take off as needed by following the simple instructions and she likes the design and the styling of the wig cap and the buckle up adjustable straps. My wife says she has been wearing it for about 2 weeks now and she has only noticed very minor tangling and shedding in the first few days. She says that she likes that the kinky wig appears to be made with good quality synthetic materials, and that the wig seems to be durable, elegant, lightweight and curly.<br />My wife says the hair is soft, smooth to touch, and she likes that the wig fits her head shape snugly as she can adjust it as needed. She says she likes the texture of this wig and she likes that it doesn't smell and that she says she gets compliments from people in the last several days. She says so far so good and that considering the quality, and the price point, this wig appears to be good value for bucks. I would recommend it.\nReview Title: Stylish, and easy to put on, and take off!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kinky Straight Headband Wig For Black Women Yaki Human Hair Blend Wigs None Lace Front Wigs Silky Machine Made Wig Glueless Natural Color Costume Wigs 150% Density 20 Inches\nReview Date: 2021/01/18\nStore: GIESWY\nAverage Rating: 3.1\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Kinky Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'GIESWY', 'Package Dimensions': '11.22 x 7.36 x 2.28 inches; 12.42 Ounces', 'UPC': '738598811448'}\nReview Text: I ordered this GIESWY headband wig for my wife and she says she likes the black color, the straight hair, the elastic net design and the styling of the elastic silk headband in place of the lace part, and she likes that she doesn't have to use gel or glue to fix the wig.<br />My wife says that she likes the wig’s medium cap size, and the adjustable strap with velcro. She says she has been wearing the wig for over 2 weeks and she says so far so good, as she has not experienced any itching or shedding. Our daughter says that she likes the Yaki texture, and she says that it is soft and smooth to touch and she likes that after washing and drying the hair, no smells of any kind.<br />She says she likes that this kinky wig appears to be made with good human hair and it seems to be durable, comfortable on her head, lightweight and breathable. Considering the quality and the price point, it appears to be a good value for bucks. I would recommend it.\nReview Title: Comfy, durable and easy to wear!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NOBLE Lace Front Wigs for Black Women 38 Inch Super Long Blonde Wig for White Women Synthetic Body Wave HD Lace Front Wavy Wigs for Daily Party Cosplay Use\nReview Date: 2021/04/18\nStore: NOBLE\nAverage Rating: 3.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'NOBLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.7 x 7.7 x 2.6 inches; 1.05 Pounds'}\nReview Text: I ordered this NOBLE wig for one of our daughters and she says she likes the ombre blonde color, the design of the lace front, the styling of the 38 inch long waves and the adjustable straps, and the elastic cap. Our daughter says her favorite features are the 6 inch middle lace part, the pre- plucked front hair, and the 3 reinforced combs. She says she likes that the texture of the hair is soft, smooth and feels gentle as she runs her hands through it. Our daughter does like that the wig is fluffy, and she says the cap fits her head pretty well, comfortable to wear and easy to put on and take off without any hassles. She says she got a lot of compliments the first day she had it on and she likes that the hairline blends in more with her skin tone.<br />Our daughter does like that she can quickly comb the wig to get rid of any tangles. She says so far, so good with the use of this wig and it seems to be good value for bucks, considering the quality and the price point. I would recommend it.\nReview Title: Stylish, durable and easy to wear!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Human Hair Wigs Short Length Machine Made Natural Black Color 1B (1B, Afro Curly)\nReview Date: 2021/05/17\nStore: Refeeny\nAverage Rating: 4.0\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Curly, Coily', 'Brand': 'Refeeny', 'Package Dimensions': '11.34 x 7.4 x 2.17 inches; 4.16 Ounces'}\nReview Text: My wife likes this short Afro wig and she says she likes the design and the styling of the curls, the glueless none lace front, and the adjustable straps. She says that she likes that the wig is comfortable to wear, fits her head shape snugly pretty well, and easy to put on and adjust as needed. She has been wearing the wig for several days, and she says so far, so good; no shedding or tangling, and she likes that it is easy to comb.<br />My wife says that she likes the soft and smooth texture of the wig and<br />and she says that she gets compliments from people.\nReview Title: Curly, easy to put on and comb!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: iShine Pixie Cut Wigs 100% Human Hair Short Mommy Wig Finger Wave Wigs Ocean Wave Wig 6 Inch Short Curly Wigs Parting Wig for Black Women & Mommy (Medium Auburn #30)\nReview Date: 2021/06/28\nStore: ISHINE\nAverage Rating: 4.1\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Special Feature': 'Tangle Free', 'Brand': 'ISHINE', 'Package Dimensions': '9.25 x 6.81 x 2.17 inches; 5.61 Ounces', 'Item model number': '000LE003S0630'}\nReview Text: My wife does this short mommy wig’s brown color, the design of the adjustable tabs, the ear tabs, the open wefts and the closed elastic lace cap. She says her favorite features are the velvet front hairline, the 2 stainless steel combs at the front and back and the breathable net cap. My wife says that she likes that she was able to adjust this wig and it fits her pretty well, comfortable to wear, easy to put on and take off as needed.  She says she has been wearing this wig for over 2 weeks now and she says so far, so good, as she says the texture of the wig is soft, smooth and she likes the waves and she likes that it appears to be made with good quality 100% Brazilian human hair, and it matches some of her outfits and she does like that she get compliments each time she wear the wig.\nReview Title: Curly, durable and easy to install and adjust!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Water Wave Transparent Lace Front Wig Human Hair T Part Glueless Human Hair Wig for Black Women 100% Unprocessed Brazilian Ocean Wave Wig with Baby Hair 150% Density Natural Color 30 Inch\nReview Date: 2021/12/26\nStore: Laritaiya\nAverage Rating: 4.3\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Laritaiya'}\nReview Text: We ordered this unprocessed Brazilian human hair with ocean waves for my wife as she needed to replace her old wig. She does like the 30-inch length of the wig, the thickness and the curly design and she does like that it doesn’t require glue to wear it. She says the wig fits her head perfectly well, comfortable to wear and easy to put on and take off without any issues, and she says she likes that it comes with 4 combs and adjustable strap, but she doesn’t like that it has an unnatural hairline. She was equally disappointed that the T- middle part is too wide and the lace front shows too clearly when she wears the wig (see the attached first image). Another thing, she doesn’t like that the color of the lace is not a natural color for black women.\nReview Title: Soft, wavy and glueless......but the T- part shows unnatural color for black women!\nRating: 3.0\n--------------------------------------------------",
  "reference": "Lihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nI ordered these Lihui Pre- Twisted Passion twists crochet 6 packs hair for my wife and she likes them so much. She says they seem to be made of good quality materials and like that they are pe-twisted. My wife wanted to try out a different style so we got these crochet passion twists. She likes that they are lightweight, durable, and easy to install with simple to follow instructions. She says she likes that the twists are tight and bouncy and they are also soft and shiny. Another feature my wife likes is that the passion twists don't tangle easily as she since she fixed them. She likes that they comes with enough twists for her whole head, and even had extra after fixing the hair. My wife has ordered hair in the past that smelled bad, luckily these twists didn't have a foul odor. Overall, my wife was very happy with these twists and how beautiful they looked on her. I would recommend them.\nEasy to install, and good value for money\nSTYLEAGAL False Eyelashes - 4 Pairs Multipack Natural 3D False Eyelashes Natural Thick Hand-Made Faux Mink Eyelashes Extension(G106)\nstyleagal\n{'Brand': 'styleagal', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 3.8 x 0.3 inches; 0.63 Ounces'}\nI ordered these STYLEAGAL false eyelashes for my wife and she says she likes them so much and the thickness and the color. She says the eyelashes were easy to attach on her own eyelashes by following simple steps.<br />After applying them the lashes on, she says she likes how the false eyelashes blend well with her own natural eyelashes; giving them a more full look. She likes that they were made of good quality synthetic fibers, and they appear to be durable. She says she likes that they are lightweight, soft, and smooth. My wife likes that she can reuse them and she has reused them 6 times in the last 2+ weeks, and so far, so good.<br />For the quality, quantity and price, they are great value for money. I would recommend them.\nGreat quality and value for money\nPre-stretched Braiding Hair Easy Braid Professional Itch Free Synthetic Fiber Corchet Braids Yaki Texture Hair Extensions 5 packs Braid Hair 22 Inch (Color T1B/27)\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Material': 'Synthetic', 'Extension Length': '22 Inches', 'Package Dimensions': '11.9 x 11.25 x 2.3 inches; 15.2 Ounces'}\nI ordered these Kapelli Hair textured crochet extensions for my wife and she does look really good with them. My wife says that she says she does like them a lot because they are different from the crochet hair extensions that she usually gets and she likes how lightweight, abundant and flowy they feel on her head. She likes how they have a very natural and fluffy look and how easy they are to fic with no harm or damage to her skin. My wife does like the hair pattern and she says that they are nice and smooth. She says that they didn't even look frizzy or damaged when the hair was taken out of the packets. She says her favorite thing about these hair's is how easy they are to wash and how breathable it feels which makes it nice for when it’s hot in our neck of the woods Summer weather. My wife does like that the hair looks tangle -free and sheds- free after washing them. Overall my wife really likes the hair extension and she says that they are different, cute and they look natural and shiny. I would definitely recommend them.\nDurable, easy to fix and great value for money!\nJulyQueen 165g Crochet Braiding Hair Blonde Color Crochet Hair for Black Women Synthetic Hair Extension Fold Length 41 Inch 3 Pack\nJulyQueen\n{'Item model number': '165Ycl-543'}\nI ordered these JulyQueen 3 packs of Jumbo Kanekalon synthetic hair extensions for one of our daughters, and she says that she likes them a lot. Our daughter says that she likes the blonde color, the braiding style, and the long texture. She says that she likes that the hair is soft to touch, smooth, thick and full, and she likes that they are 24 inches long as she wanted the hair. Our daughter says that she wanted to try a different hair style and she used these hair extensions for her Sengalese twist and she says that she used 6 packs in total to complete the style as she has 3 packs of different colors and she decided to combine the Blonde and Rose Red colors with a little left over. She says she likes that the hair extensions were easy to install and braid and she says that she likes the look, the styling of the twist and she likes that the hair extensions seem to be made with good quality 100% Kanekalon synthetic fiber, and they appear to be comfortable on her hair, lightweight, tangle- free and durable.<br />Our daughter says that so far so good with the Senagalese twists and she says she likes how gorgeous they look on her. For the quality, quantity and price point, they seem to be good value for money. I would recommend them.\nEasy to install, soft and durable!\n6 Packs/Lot 26 Inch Pre-stretched Braiding Hair Professional Perm Yaki Synthetic Hair Braids(Ombre Brown Blond,#1B/30/27)\nAlishow\n{'Brand': 'Alishow', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '16.97 x 12.48 x 2.52 inches; 2.07 Pounds', 'UPC': '727196547491'}\nI ordered these Alishow 6 packs, synthetic braiding hair for our daughter and she likes them a lot. Our daughter does say she likes the brown blond colors, the texture and the design and the styling of the thick end, the 26 inch length, and the pre-stretched braiding.<br />She says she likes that these hair braids were easy and quick to install, and she says the hair is soft and smooth to touch and she likes that they are lightweight, don’t form tangles, and so far she has not experienced any itching. She did braids and twists and she says she does like the look, and she likes how she can change the pre-stretched braiding style by dipping the hair braids in hot water for them to set.<br />Our daughter says she likes that these hair twists appear to be made with good quality synthetic materials and they seem to be durable, comfortable on her head, and easy to wash and clean. So far she says that these braids appear to be good value for money, considering the quality and the price point. I would recommend them.\nEasy to install, soft and lightweight!\nJumbo Braiding Hair Extensions 24 Inch 6 Packs Ombre Synthetic Hair Crochet Braids Kanekalon Long Jumbo Braids For Box Braid Twist Crochet Hair (Black/Dark Brown/Light Brown)\nBelle Show\n{'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Installation Type': 'Clip-In', 'Package Dimensions': '10.16 x 9.49 x 4.29 inches; 1.43 Pounds'}\nI ordered these Belle Show Jumbo Braiding Hair Extensions of 6 packs for my wife and she says she likes them so much. My wife says that she likes the black, dark and light brown colors of the hair, the texture, and the 24 inches length of these synthetic hair. She says she likes that the 6 packs were enough to braid her hair. She likes that her hair stylist found these hair extensions easy to install without any hassles.  My wife says she likes that these hair extensions appear to be made with good quality synthetic fiber, and they seem to be lightweight, durable, soft, smooth to touch and comfortable on her hair and head. She says she likes that these hair extensions are tangle- free, don’t have any shedding or itching so far. She says that she has washed the hair once after installing them and she likes that the colors and the quality didn’t change. Considering the quality, the quantity and the price point, they seem to be good value for bucks. I would recommend them.\nDurable, comfy and easy to install\nYinMer Lavish Lash – Eyelash Growth Enhancer & Brow Serum with Biotin & Natural Growth Peptides for Long, Thick Lashes and Eyebrows\nOUZIFISH\n{'Package Dimensions': '6.61 x 2.8 x 1.26 inches; 3.53 Ounces'}\nI ordered this OUZIFISH YinMer Lavish Eyelash growth enhancer for one of our daughters, and she says that she does like texture and the ease of application of the liquid. She says she followed the simple step by step process to apply it on her eyelashes and brow. Our daughter says that she likes that the applicator’s handle is comfortable to hold, and easy to use. She has been applying the liquid daily for the last 2 weeks and she followed all the processes and she says she has only noticed a little growth and thickness in her eyelashes and brow. Our daughter says she would continue to apply it in the next few weeks to see if he would get more growth in her eyelashes and brow.<br />I will update this review if anything changes with the expected outcome of this serum.\nEasy to apply!\nBlack Wolf - Men’s Ultra Hydrating Moisturizer - 1.7 Fl Oz – Soothe Dry, Patchy & Flaky Areas on your Skin - Fast Absorbing Formula Won't Feel Heavy or Greasy - Sulfate Free for Dry Skin\nBlack Wolf\n{'Brand': 'Black Wolf', 'Item Form': 'Lotion', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Dry', 'Package Dimensions': '5.39 x 3.15 x 1.46 inches; 2.4 Ounces', 'Item model number': 'BLKWLF_MOIST_DRY', 'UPC': '850021340087'}\nI ordered this Black Wolf Nation Ultra Moisturizer for Men for our son and he says that he likes it a lot and says that he likes that it is easy to apply on his dry skin by following the simple directions on how to use it. Our son says he has been using it for the last several days and he has started to see the changes with his skin as it is less dry as this formula helps to hydrate and moisturize his skin and decrease flakiness of his skin. He says that after applying the moisturizer, he says that it feels soft, gentle and easy on his skin.<br />Our son says that it seems that this formula was made with good quality active ingredients like Paraffinum, Liquidum, Tocopherol, Potassium Sorbate, Water, Squalane and others, and he says he likes the texture of this skin care product on his facial skin. Our son says he plans to continue to use it for the next few  weeks and if anything changes with the expectations, I would update this review. He says so far, so good.\nSoft, easy to use and it works!\nLeetaltree 6Pcs Makeup Sponge Set\nLeetaltree\n{'Brand': 'Leetaltree', 'Color': 'Ivory', 'Item Dimensions LxWxH': '1.6 x 1.6 x 2.36 inches', 'Skin Type': 'Normal,All Skin Types', 'Product Dimensions': '1.6 x 1.6 x 2.36 inches; 2.08 Ounces'}\nI ordered these Leetaltree Foundation sponges for one of our daughters and she says she likes the multi-colors, the variety of drop, gourd and oblique-cut shapes. She says her favorite features are the dry and wet use and the sponge turning bigger when wet, and she likes that she can use the sponges for her variety of cosmetics, foundation and powder. Our daughter says she likes that the sponges are soft, smooth and gentle on her skin and that they are easy to use, and apply on her skin by following the simple instruction on how to evenly dab it on her skin. She says she likes how the makeup turns out each time after the application.<br />Our daughter says she likes that the sponges seem to be made with good quality non- latex materials and they appear to be lightweight, durable and well designed. She likes that she can re-use them and the sponges appear to be great value for money considering the quality and the price point. I would definitely recommend them.\nSoft, easy to apply and great value for bucks!\nAISI QUEENS Curly Bob Wig Short Ombre Brown Wig for Black Women Kinky Hair Middle Part Heat Resistant Synthetic Hair Wig for Women 14inch\nAISI QUEENS\n{'Hair Type': 'Coily', 'Style': 'Modern', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.71 x 8.9 x 2.72 inches; 9.14 Ounces'}\nI ordered this AISI QUEENS Short Bob Wig for Women for my wife and she says she likes the Brown color, the 14 inch length, the curvature of the hair, and she likes that it covers her scalp and hair fully.<br />My wife says she likes the density of this synthetic hair and she says that she likes that it is comfortable to wear, easy to put on and take off as needed by following the simple instructions and she likes the design and the styling of the wig cap and the buckle up adjustable straps. My wife says she has been wearing it for about 2 weeks now and she has only noticed very minor tangling and shedding in the first few days. She says that she likes that the kinky wig appears to be made with good quality synthetic materials, and that the wig seems to be durable, elegant, lightweight and curly.<br />My wife says the hair is soft, smooth to touch, and she likes that the wig fits her head shape snugly as she can adjust it as needed. She says she likes the texture of this wig and she likes that it doesn't smell and that she says she gets compliments from people in the last several days. She says so far so good and that considering the quality, and the price point, this wig appears to be good value for bucks. I would recommend it.\nStylish, and easy to put on, and take off!\nKinky Straight Headband Wig For Black Women Yaki Human Hair Blend Wigs None Lace Front Wigs Silky Machine Made Wig Glueless Natural Color Costume Wigs 150% Density 20 Inches\nGIESWY\n{'Material': 'Human Hair', 'Hair Type': 'Kinky Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'GIESWY', 'Package Dimensions': '11.22 x 7.36 x 2.28 inches; 12.42 Ounces', 'UPC': '738598811448'}\nI ordered this GIESWY headband wig for my wife and she says she likes the black color, the straight hair, the elastic net design and the styling of the elastic silk headband in place of the lace part, and she likes that she doesn't have to use gel or glue to fix the wig.<br />My wife says that she likes the wig’s medium cap size, and the adjustable strap with velcro. She says she has been wearing the wig for over 2 weeks and she says so far so good, as she has not experienced any itching or shedding. Our daughter says that she likes the Yaki texture, and she says that it is soft and smooth to touch and she likes that after washing and drying the hair, no smells of any kind.<br />She says she likes that this kinky wig appears to be made with good human hair and it seems to be durable, comfortable on her head, lightweight and breathable. Considering the quality and the price point, it appears to be a good value for bucks. I would recommend it.\nComfy, durable and easy to wear!\nNOBLE Lace Front Wigs for Black Women 38 Inch Super Long Blonde Wig for White Women Synthetic Body Wave HD Lace Front Wavy Wigs for Daily Party Cosplay Use\nNOBLE\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'NOBLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.7 x 7.7 x 2.6 inches; 1.05 Pounds'}\nI ordered this NOBLE wig for one of our daughters and she says she likes the ombre blonde color, the design of the lace front, the styling of the 38 inch long waves and the adjustable straps, and the elastic cap. Our daughter says her favorite features are the 6 inch middle lace part, the pre- plucked front hair, and the 3 reinforced combs. She says she likes that the texture of the hair is soft, smooth and feels gentle as she runs her hands through it. Our daughter does like that the wig is fluffy, and she says the cap fits her head pretty well, comfortable to wear and easy to put on and take off without any hassles. She says she got a lot of compliments the first day she had it on and she likes that the hairline blends in more with her skin tone.<br />Our daughter does like that she can quickly comb the wig to get rid of any tangles. She says so far, so good with the use of this wig and it seems to be good value for bucks, considering the quality and the price point. I would recommend it.\nStylish, durable and easy to wear!\nHuman Hair Wigs Short Length Machine Made Natural Black Color 1B (1B, Afro Curly)\nRefeeny\n{'Material': 'Human Hair', 'Hair Type': 'Curly, Coily', 'Brand': 'Refeeny', 'Package Dimensions': '11.34 x 7.4 x 2.17 inches; 4.16 Ounces'}\nMy wife likes this short Afro wig and she says she likes the design and the styling of the curls, the glueless none lace front, and the adjustable straps. She says that she likes that the wig is comfortable to wear, fits her head shape snugly pretty well, and easy to put on and adjust as needed. She has been wearing the wig for several days, and she says so far, so good; no shedding or tangling, and she likes that it is easy to comb.<br />My wife says that she likes the soft and smooth texture of the wig and<br />and she says that she gets compliments from people.\nCurly, easy to put on and comb!\niShine Pixie Cut Wigs 100% Human Hair Short Mommy Wig Finger Wave Wigs Ocean Wave Wig 6 Inch Short Curly Wigs Parting Wig for Black Women & Mommy (Medium Auburn #30)\nISHINE\n{'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Special Feature': 'Tangle Free', 'Brand': 'ISHINE', 'Package Dimensions': '9.25 x 6.81 x 2.17 inches; 5.61 Ounces', 'Item model number': '000LE003S0630'}\nMy wife does this short mommy wig’s brown color, the design of the adjustable tabs, the ear tabs, the open wefts and the closed elastic lace cap. She says her favorite features are the velvet front hairline, the 2 stainless steel combs at the front and back and the breathable net cap. My wife says that she likes that she was able to adjust this wig and it fits her pretty well, comfortable to wear, easy to put on and take off as needed.  She says she has been wearing this wig for over 2 weeks now and she says so far, so good, as she says the texture of the wig is soft, smooth and she likes the waves and she likes that it appears to be made with good quality 100% Brazilian human hair, and it matches some of her outfits and she does like that she get compliments each time she wear the wig.\nCurly, durable and easy to install and adjust!\nWater Wave Transparent Lace Front Wig Human Hair T Part Glueless Human Hair Wig for Black Women 100% Unprocessed Brazilian Ocean Wave Wig with Baby Hair 150% Density Natural Color 30 Inch\nLaritaiya\n{'Material': 'Human Hair', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Laritaiya'}\nWe ordered this unprocessed Brazilian human hair with ocean waves for my wife as she needed to replace her old wig. She does like the 30-inch length of the wig, the thickness and the curly design and she does like that it doesn’t require glue to wear it. She says the wig fits her head perfectly well, comfortable to wear and easy to put on and take off without any issues, and she says she likes that it comes with 4 combs and adjustable strap, but she doesn’t like that it has an unnatural hairline. She was equally disappointed that the T- middle part is too wide and the lace front shows too clearly when she wears the wig (see the attached first image). Another thing, she doesn’t like that the color of the lace is not a natural color for black women.\nSoft, wavy and glueless......but the T- part shows unnatural color for black women!",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Lihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nReview Date: 2020/02/03\nStore: Lihui\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nReview Text: I ordered these Lihui Pre- Twisted Passion twists crochet 6 packs hair for my wife and she likes them so much. She says they seem to be made of good quality materials and like that they are pe-twisted. My wife wanted to try out a different style so we got these crochet passion twists. She likes that they are lightweight, durable, and easy to install with simple to follow instructions. She says she likes that the twists are tight and bouncy and they are also soft and shiny. Another feature my wife likes is that the passion twists don't tangle easily as she since she fixed them. She likes that they comes with enough twists for her whole head, and even had extra after fixing the hair. My wife has ordered hair in the past that smelled bad, luckily these twists didn't have a foul odor. Overall, my wife was very happy with these twists and how beautiful they looked on her. I would recommend them.\nReview Title: Easy to install, and good value for money\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: STYLEAGAL False Eyelashes - 4 Pairs Multipack Natural 3D False Eyelashes Natural Thick Hand-Made Faux Mink Eyelashes Extension(G106)\nReview Date: 2020/02/12\nStore: styleagal\nAverage Rating: 4.0\nProduct Details: {'Brand': 'styleagal', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 3.8 x 0.3 inches; 0.63 Ounces'}\nReview Text: I ordered these STYLEAGAL false eyelashes for my wife and she says she likes them so much and the thickness and the color. She says the eyelashes were easy to attach on her own eyelashes by following simple steps.<br />After applying them the lashes on, she says she likes how the false eyelashes blend well with her own natural eyelashes; giving them a more full look. She likes that they were made of good quality synthetic fibers, and they appear to be durable. She says she likes that they are lightweight, soft, and smooth. My wife likes that she can reuse them and she has reused them 6 times in the last 2+ weeks, and so far, so good.<br />For the quality, quantity and price, they are great value for money. I would recommend them.\nReview Title: Great quality and value for money\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pre-stretched Braiding Hair Easy Braid Professional Itch Free Synthetic Fiber Corchet Braids Yaki Texture Hair Extensions 5 packs Braid Hair 22 Inch (Color T1B/27)\nReview Date: 2020/06/28\nStore: Kapelli Hair\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Kapelli Hair', 'Material': 'Synthetic', 'Extension Length': '22 Inches', 'Package Dimensions': '11.9 x 11.25 x 2.3 inches; 15.2 Ounces'}\nReview Text: I ordered these Kapelli Hair textured crochet extensions for my wife and she does look really good with them. My wife says that she says she does like them a lot because they are different from the crochet hair extensions that she usually gets and she likes how lightweight, abundant and flowy they feel on her head. She likes how they have a very natural and fluffy look and how easy they are to fic with no harm or damage to her skin. My wife does like the hair pattern and she says that they are nice and smooth. She says that they didn't even look frizzy or damaged when the hair was taken out of the packets. She says her favorite thing about these hair's is how easy they are to wash and how breathable it feels which makes it nice for when it’s hot in our neck of the woods Summer weather. My wife does like that the hair looks tangle -free and sheds- free after washing them. Overall my wife really likes the hair extension and she says that they are different, cute and they look natural and shiny. I would definitely recommend them.\nReview Title: Durable, easy to fix and great value for money!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: JulyQueen 165g Crochet Braiding Hair Blonde Color Crochet Hair for Black Women Synthetic Hair Extension Fold Length 41 Inch 3 Pack\nReview Date: 2020/07/29\nStore: JulyQueen\nAverage Rating: 3.0\nProduct Details: {'Item model number': '165Ycl-543'}\nReview Text: I ordered these JulyQueen 3 packs of Jumbo Kanekalon synthetic hair extensions for one of our daughters, and she says that she likes them a lot. Our daughter says that she likes the blonde color, the braiding style, and the long texture. She says that she likes that the hair is soft to touch, smooth, thick and full, and she likes that they are 24 inches long as she wanted the hair. Our daughter says that she wanted to try a different hair style and she used these hair extensions for her Sengalese twist and she says that she used 6 packs in total to complete the style as she has 3 packs of different colors and she decided to combine the Blonde and Rose Red colors with a little left over. She says she likes that the hair extensions were easy to install and braid and she says that she likes the look, the styling of the twist and she likes that the hair extensions seem to be made with good quality 100% Kanekalon synthetic fiber, and they appear to be comfortable on her hair, lightweight, tangle- free and durable.<br />Our daughter says that so far so good with the Senagalese twists and she says she likes how gorgeous they look on her. For the quality, quantity and price point, they seem to be good value for money. I would recommend them.\nReview Title: Easy to install, soft and durable!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Packs/Lot 26 Inch Pre-stretched Braiding Hair Professional Perm Yaki Synthetic Hair Braids(Ombre Brown Blond,#1B/30/27)\nReview Date: 2020/09/28\nStore: Alishow\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Alishow', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '16.97 x 12.48 x 2.52 inches; 2.07 Pounds', 'UPC': '727196547491'}\nReview Text: I ordered these Alishow 6 packs, synthetic braiding hair for our daughter and she likes them a lot. Our daughter does say she likes the brown blond colors, the texture and the design and the styling of the thick end, the 26 inch length, and the pre-stretched braiding.<br />She says she likes that these hair braids were easy and quick to install, and she says the hair is soft and smooth to touch and she likes that they are lightweight, don’t form tangles, and so far she has not experienced any itching. She did braids and twists and she says she does like the look, and she likes how she can change the pre-stretched braiding style by dipping the hair braids in hot water for them to set.<br />Our daughter says she likes that these hair twists appear to be made with good quality synthetic materials and they seem to be durable, comfortable on her head, and easy to wash and clean. So far she says that these braids appear to be good value for money, considering the quality and the price point. I would recommend them.\nReview Title: Easy to install, soft and lightweight!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jumbo Braiding Hair Extensions 24 Inch 6 Packs Ombre Synthetic Hair Crochet Braids Kanekalon Long Jumbo Braids For Box Braid Twist Crochet Hair (Black/Dark Brown/Light Brown)\nReview Date: 2020/10/07\nStore: Belle Show\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Installation Type': 'Clip-In', 'Package Dimensions': '10.16 x 9.49 x 4.29 inches; 1.43 Pounds'}\nReview Text: I ordered these Belle Show Jumbo Braiding Hair Extensions of 6 packs for my wife and she says she likes them so much. My wife says that she likes the black, dark and light brown colors of the hair, the texture, and the 24 inches length of these synthetic hair. She says she likes that the 6 packs were enough to braid her hair. She likes that her hair stylist found these hair extensions easy to install without any hassles.  My wife says she likes that these hair extensions appear to be made with good quality synthetic fiber, and they seem to be lightweight, durable, soft, smooth to touch and comfortable on her hair and head. She says she likes that these hair extensions are tangle- free, don’t have any shedding or itching so far. She says that she has washed the hair once after installing them and she likes that the colors and the quality didn’t change. Considering the quality, the quantity and the price point, they seem to be good value for bucks. I would recommend them.\nReview Title: Durable, comfy and easy to install\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YinMer Lavish Lash – Eyelash Growth Enhancer & Brow Serum with Biotin & Natural Growth Peptides for Long, Thick Lashes and Eyebrows\nReview Date: 2020/10/14\nStore: OUZIFISH\nAverage Rating: 3.7\nProduct Details: {'Package Dimensions': '6.61 x 2.8 x 1.26 inches; 3.53 Ounces'}\nReview Text: I ordered this OUZIFISH YinMer Lavish Eyelash growth enhancer for one of our daughters, and she says that she does like texture and the ease of application of the liquid. She says she followed the simple step by step process to apply it on her eyelashes and brow. Our daughter says that she likes that the applicator’s handle is comfortable to hold, and easy to use. She has been applying the liquid daily for the last 2 weeks and she followed all the processes and she says she has only noticed a little growth and thickness in her eyelashes and brow. Our daughter says she would continue to apply it in the next few weeks to see if he would get more growth in her eyelashes and brow.<br />I will update this review if anything changes with the expected outcome of this serum.\nReview Title: Easy to apply!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Black Wolf - Men’s Ultra Hydrating Moisturizer - 1.7 Fl Oz – Soothe Dry, Patchy & Flaky Areas on your Skin - Fast Absorbing Formula Won't Feel Heavy or Greasy - Sulfate Free for Dry Skin\nReview Date: 2020/10/25\nStore: Black Wolf\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Black Wolf', 'Item Form': 'Lotion', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Dry', 'Package Dimensions': '5.39 x 3.15 x 1.46 inches; 2.4 Ounces', 'Item model number': 'BLKWLF_MOIST_DRY', 'UPC': '850021340087'}\nReview Text: I ordered this Black Wolf Nation Ultra Moisturizer for Men for our son and he says that he likes it a lot and says that he likes that it is easy to apply on his dry skin by following the simple directions on how to use it. Our son says he has been using it for the last several days and he has started to see the changes with his skin as it is less dry as this formula helps to hydrate and moisturize his skin and decrease flakiness of his skin. He says that after applying the moisturizer, he says that it feels soft, gentle and easy on his skin.<br />Our son says that it seems that this formula was made with good quality active ingredients like Paraffinum, Liquidum, Tocopherol, Potassium Sorbate, Water, Squalane and others, and he says he likes the texture of this skin care product on his facial skin. Our son says he plans to continue to use it for the next few  weeks and if anything changes with the expectations, I would update this review. He says so far, so good.\nReview Title: Soft, easy to use and it works!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leetaltree 6Pcs Makeup Sponge Set\nReview Date: 2020/10/26\nStore: Leetaltree\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Leetaltree', 'Color': 'Ivory', 'Item Dimensions LxWxH': '1.6 x 1.6 x 2.36 inches', 'Skin Type': 'Normal,All Skin Types', 'Product Dimensions': '1.6 x 1.6 x 2.36 inches; 2.08 Ounces'}\nReview Text: I ordered these Leetaltree Foundation sponges for one of our daughters and she says she likes the multi-colors, the variety of drop, gourd and oblique-cut shapes. She says her favorite features are the dry and wet use and the sponge turning bigger when wet, and she likes that she can use the sponges for her variety of cosmetics, foundation and powder. Our daughter says she likes that the sponges are soft, smooth and gentle on her skin and that they are easy to use, and apply on her skin by following the simple instruction on how to evenly dab it on her skin. She says she likes how the makeup turns out each time after the application.<br />Our daughter says she likes that the sponges seem to be made with good quality non- latex materials and they appear to be lightweight, durable and well designed. She likes that she can re-use them and the sponges appear to be great value for money considering the quality and the price point. I would definitely recommend them.\nReview Title: Soft, easy to apply and great value for bucks!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AISI QUEENS Curly Bob Wig Short Ombre Brown Wig for Black Women Kinky Hair Middle Part Heat Resistant Synthetic Hair Wig for Women 14inch\nReview Date: 2021/01/14\nStore: AISI QUEENS\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Coily', 'Style': 'Modern', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.71 x 8.9 x 2.72 inches; 9.14 Ounces'}\nReview Text: I ordered this AISI QUEENS Short Bob Wig for Women for my wife and she says she likes the Brown color, the 14 inch length, the curvature of the hair, and she likes that it covers her scalp and hair fully.<br />My wife says she likes the density of this synthetic hair and she says that she likes that it is comfortable to wear, easy to put on and take off as needed by following the simple instructions and she likes the design and the styling of the wig cap and the buckle up adjustable straps. My wife says she has been wearing it for about 2 weeks now and she has only noticed very minor tangling and shedding in the first few days. She says that she likes that the kinky wig appears to be made with good quality synthetic materials, and that the wig seems to be durable, elegant, lightweight and curly.<br />My wife says the hair is soft, smooth to touch, and she likes that the wig fits her head shape snugly as she can adjust it as needed. She says she likes the texture of this wig and she likes that it doesn't smell and that she says she gets compliments from people in the last several days. She says so far so good and that considering the quality, and the price point, this wig appears to be good value for bucks. I would recommend it.\nReview Title: Stylish, and easy to put on, and take off!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kinky Straight Headband Wig For Black Women Yaki Human Hair Blend Wigs None Lace Front Wigs Silky Machine Made Wig Glueless Natural Color Costume Wigs 150% Density 20 Inches\nReview Date: 2021/01/18\nStore: GIESWY\nAverage Rating: 3.1\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Kinky Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'GIESWY', 'Package Dimensions': '11.22 x 7.36 x 2.28 inches; 12.42 Ounces', 'UPC': '738598811448'}\nReview Text: I ordered this GIESWY headband wig for my wife and she says she likes the black color, the straight hair, the elastic net design and the styling of the elastic silk headband in place of the lace part, and she likes that she doesn't have to use gel or glue to fix the wig.<br />My wife says that she likes the wig’s medium cap size, and the adjustable strap with velcro. She says she has been wearing the wig for over 2 weeks and she says so far so good, as she has not experienced any itching or shedding. Our daughter says that she likes the Yaki texture, and she says that it is soft and smooth to touch and she likes that after washing and drying the hair, no smells of any kind.<br />She says she likes that this kinky wig appears to be made with good human hair and it seems to be durable, comfortable on her head, lightweight and breathable. Considering the quality and the price point, it appears to be a good value for bucks. I would recommend it.\nReview Title: Comfy, durable and easy to wear!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NOBLE Lace Front Wigs for Black Women 38 Inch Super Long Blonde Wig for White Women Synthetic Body Wave HD Lace Front Wavy Wigs for Daily Party Cosplay Use\nReview Date: 2021/04/18\nStore: NOBLE\nAverage Rating: 3.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'NOBLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.7 x 7.7 x 2.6 inches; 1.05 Pounds'}\nReview Text: I ordered this NOBLE wig for one of our daughters and she says she likes the ombre blonde color, the design of the lace front, the styling of the 38 inch long waves and the adjustable straps, and the elastic cap. Our daughter says her favorite features are the 6 inch middle lace part, the pre- plucked front hair, and the 3 reinforced combs. She says she likes that the texture of the hair is soft, smooth and feels gentle as she runs her hands through it. Our daughter does like that the wig is fluffy, and she says the cap fits her head pretty well, comfortable to wear and easy to put on and take off without any hassles. She says she got a lot of compliments the first day she had it on and she likes that the hairline blends in more with her skin tone.<br />Our daughter does like that she can quickly comb the wig to get rid of any tangles. She says so far, so good with the use of this wig and it seems to be good value for bucks, considering the quality and the price point. I would recommend it.\nReview Title: Stylish, durable and easy to wear!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Human Hair Wigs Short Length Machine Made Natural Black Color 1B (1B, Afro Curly)\nReview Date: 2021/05/17\nStore: Refeeny\nAverage Rating: 4.0\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Curly, Coily', 'Brand': 'Refeeny', 'Package Dimensions': '11.34 x 7.4 x 2.17 inches; 4.16 Ounces'}\nReview Text: My wife likes this short Afro wig and she says she likes the design and the styling of the curls, the glueless none lace front, and the adjustable straps. She says that she likes that the wig is comfortable to wear, fits her head shape snugly pretty well, and easy to put on and adjust as needed. She has been wearing the wig for several days, and she says so far, so good; no shedding or tangling, and she likes that it is easy to comb.<br />My wife says that she likes the soft and smooth texture of the wig and<br />and she says that she gets compliments from people.\nReview Title: Curly, easy to put on and comb!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: iShine Pixie Cut Wigs 100% Human Hair Short Mommy Wig Finger Wave Wigs Ocean Wave Wig 6 Inch Short Curly Wigs Parting Wig for Black Women & Mommy (Medium Auburn #30)\nReview Date: 2021/06/28\nStore: ISHINE\nAverage Rating: 4.1\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Special Feature': 'Tangle Free', 'Brand': 'ISHINE', 'Package Dimensions': '9.25 x 6.81 x 2.17 inches; 5.61 Ounces', 'Item model number': '000LE003S0630'}\nReview Text: My wife does this short mommy wig’s brown color, the design of the adjustable tabs, the ear tabs, the open wefts and the closed elastic lace cap. She says her favorite features are the velvet front hairline, the 2 stainless steel combs at the front and back and the breathable net cap. My wife says that she likes that she was able to adjust this wig and it fits her pretty well, comfortable to wear, easy to put on and take off as needed.  She says she has been wearing this wig for over 2 weeks now and she says so far, so good, as she says the texture of the wig is soft, smooth and she likes the waves and she likes that it appears to be made with good quality 100% Brazilian human hair, and it matches some of her outfits and she does like that she get compliments each time she wear the wig.\nReview Title: Curly, durable and easy to install and adjust!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Water Wave Transparent Lace Front Wig Human Hair T Part Glueless Human Hair Wig for Black Women 100% Unprocessed Brazilian Ocean Wave Wig with Baby Hair 150% Density Natural Color 30 Inch\nReview Date: 2021/12/26\nStore: Laritaiya\nAverage Rating: 4.3\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Laritaiya'}\nReview Text: We ordered this unprocessed Brazilian human hair with ocean waves for my wife as she needed to replace her old wig. She does like the 30-inch length of the wig, the thickness and the curly design and she does like that it doesn’t require glue to wear it. She says the wig fits her head perfectly well, comfortable to wear and easy to put on and take off without any issues, and she says she likes that it comes with 4 combs and adjustable strap, but she doesn’t like that it has an unnatural hairline. She was equally disappointed that the T- middle part is too wide and the lace front shows too clearly when she wears the wig (see the attached first image). Another thing, she doesn’t like that the color of the lace is not a natural color for black women.\nReview Title: Soft, wavy and glueless......but the T- part shows unnatural color for black women!\nRating: 3.0\n--------------------------------------------------",
  "raw_response": "This individual's shopping behavior suggests a strong preference for high-quality, synthetic and human hair products, particularly wigs and hair extensions, with emphasis on ease of application and comfort. Key preferences include:\n\n- **Hair Extensions:** Multiple purchases of lightweight, durable, and tangle-free synthetic hair with natural textures and various lengths (14-38 inches). Customers appreciate styles that are easy to install, wash, and maintain, highlighting a desire for low-maintenance beauty solutions.\n  \n- **Color Variations:** A consistent interest in diverse color options, including ombre and natural shades, reflecting an appreciation for versatile styling.\n\n- **Skin and Hair Care Products:** The individual has also purchased skincare and eyelash products, suggesting a broader interest in beauty enhancements that are easy to use, effective, and value for money.\n\n- **Value for Money:** Across reviews, there’s a recurring theme of products being perceived as good value, indicating careful consideration of price relative to quality.\n\n- **Ease of Installation:** A strong preference for products that come with clear application instructions and are easy to use, indicating a user-friendly approach to beauty.\n\nOverall, the purchaser prioritizes quality, versatility, ease of use, and value in their beauty and personal care products, often favoring products that enhance natural beauty without extensive maintenance.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Breathable, comfy to wear, and fits well!",
    "text": "We ordered this Brazilian virgin human hair wig for one of our daughters and she does like the transparent and glueless lace closure, the design of the deep wave and the 16 inches length of the wig. She likes that the wig lace front, the pre plucked and she says her favorite feature is that the lace can be melted into her skin without any hassles. She says that she does like the wig’s cap size, and she says that it fits her head comfortably, and is adjusted with adjustable straps and 3 combs. She says she has been wearing it for over the last 2 weeks and she likes that she can make the hair wig into a ponytail or straightened as needed, and she likes that the wig is pretty easy to fix on her head. Another feature she likes is that she doesn't have to use gel or glue to fix the wig.<br />Our daughter does like that she has not experienced any tangling or shedding so far.",
    "images": [],
    "asin": "B09D7SCHM7",
    "parent_asin": "B09D7SCHM7",
    "user_id": "AE6I5KFJ2EJNRBBV7NWURRU2X6UQ_1",
    "timestamp": "2022-01-31 07:09:11.269000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Deep Wave Human Hair Wigs - 4x4 Transparent HD Lace Closure Wigs Human Hair Glueless Lace Front Wigs for Black Women Pre Plucked 150% Density Brazilian Virgin Wet and Wavy Wigs Natural 16 Inch",
    "average_rating": 3.1,
    "rating_number": 14,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51X8LhRNh1L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51X8LhRNh1L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71g80PZ7NlL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512aeIfkFML._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/512aeIfkFML.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81xamruKemL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51u9U00wfdL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51u9U00wfdL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81dwN0Yh+wL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51UfqVK1urL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51UfqVK1urL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81Zf6Cbyi+L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/416qSmeBMKL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/416qSmeBMKL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71Hbky9PmjL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Looks terrible, dry and frizzy",
        "url": "https://www.amazon.com/vdp/0546b4de29c14ad89d0ad7b62cc3f463?ref=dp_vse_rvc_0",
        "user_id": "AEEYTXVZ7CBF5EELMRD64XFELEYQ"
      },
      {
        "title": "Deep Wave Human Hair Wigs - 4x4 Transparent HD Lace Closure Wigs Human Hair Glueless Lace Front W...",
        "url": "https://www.amazon.com/vdp/03402216234847a18fc7bfc8291d934b?ref=dp_vse_rvc_1",
        "user_id": ""
      }
    ],
    "store": "Trumore",
    "categories": [],
    "details": {
      "Material": "Human Hair",
      "Hair Type": "Wavy",
      "Style": "Modern",
      "Special Feature": "Glueless",
      "Brand": "Trumore",
      "Package Dimensions": "11.61 x 7.87 x 2.2 inches; 6.74 Ounces",
      "UPC": "737311715520"
    },
    "bought_together": null
  }
}