{
  "user_id": "AE53545QTFI7RPWHC2BSGOAD3NYA",
  "summary": "=== Purchase Information ===\nProduct Title: OZNaturals Body Butter – This Natural Body Moisturizer Contains Sweet Almond & Macadamia Nut - This Luxurious Skin Moisturizer Will Provide Your Body With A Healthy Vibrant Glow!\nReview Date: 2015/08/21\nStore: MUPATER\nProduct Description: ['Size:30ML PuriDerma scar removal cream is highly effective in fading away scars from acne, cuts, stretch marks, C-sections, and surgeries.']\nAverage Rating: 3.5\nProduct Details: {'Brand': 'MUPATER', 'Scent': 'Almond', 'Item Form': 'Butter', 'Unit Count': '8.0 Ounce', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 1 inches; 8 Ounces', 'Manufacturer recommended age': '6 months - 3 years', 'Item model number': '04-KPOU-1KSA', 'UPC': '616806598506 885337394905', 'Manufacturer': 'OZ Naturals'}\nReview Text: My body butter arrived  a few days ago and I decided  to use it daily  on my entire  body. I love  the fact that  this  lotion  features  key ingredients  such  as Shea Butter, avocado  oil, and kukui nut oil. I applied  it every  night  before  bed. This butter  is super  rich  and  moisturizing. My legs were starting  to have  that  alligator  look and now they don't. I wish  this  scent was way stronger. It's to faint for me. Also this  butter absorbs  at a slower rate. That's why  I  choose  to apply  at night. I received  this  product  for  free  in  exchange  for  an  honest  review.\nReview Title: Super  rich!!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: OZNaturals Tinted Moisturizer, SPF 30 Sunscreen. Broad Spectrum Protection. Zinc Oxide + Minerals In This Tinted Sunscreen Protects, Moisturizes And Blends Well To Provide A Rich, Youthful Glow!\nReview Date: 2015/08/28\nStore: OZ Naturals\nProduct Description: ['Skin care experts and dermatologists are in agreement on the importance of wearing sunscreen. \\xa0Most premature aging of the skin is caused by sun exposure. “Photo aging,” as is it known in skin care circles, includes wrinkles, freckles, age spots, blotchy complexion, dullness, sagging skin and rough, leathery texture. \\xa0In other words, just about every complaint surrounding aging skin can be traced at least in part to sun exposure, making daily sunscreen protection with an SPF 30 sunscreen a must. But not all sunscreens are created equal. \\xa0OZNaturals Age Defying Solar Shield SPF 30 Broad Spectrum Tinted Sunscreen with Zinc Oxide provides broad spectrum protection from the sun’s harmful UVA/UVB rays, while moisturizing skin with a healthy-looking hint of color. Utilizing the highly stable and reflective properties of Zinc Oxide, with the natural UV diluting qualities of Octyl Methoxycinnamate, our formula offers sheer, broad-spectrum UV coverage in a luxurious tinted moisturizer formulation.']\nAverage Rating: 3.4\nProduct Details: {'Scent': 'Unscented', 'Sun Protection Factor': '30 Sun Protection Factor (SPF)', 'Number of Items': '1', 'Unit Count': '1.0 Ounce', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.5 x 3.5 x 1 inches; 1.76 Ounces', 'Item model number': 'I1-7LV1-6RQ9', 'UPC': '638317780652', 'Manufacturer': 'OZ Naturals, LLC'}\nReview Text: First  of  all  let  me  tell  you that  this  product  is paraben, sulfate, mineral  oil, and lanolin  free. It can  be  applied  all  over  your  body  as well  as worn like  foundation  or under your  makeup. This sunscreen  has a brownish  tint to it and it blends  with  ease. I do wish  it was a little  darker. The consistency  is creamy  but not oily. I wish  the scent  was a bit stronger. I find  this  product  to  be  really  moisturizing. I received  this  product  for  free  in  exchange  for  an  honest  review.\nReview Title: A little  tint alotta  moisture!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UNGLINGA Black Mask Blackhead Remover Purifying Peel Off Mask Bamboo Activated Charcoal Face Deep Pore Cleansing Mask For Face Nose and Acne Blemishes Treatment\nReview Date: 2015/09/24\nStore: UNGLINGA\nProduct Description: ['CONCERNS: Enlarged pore, Blackheads, Anti-aging, Fine lines and blemishes, Oily skin, Strawberry nose. Effect: Absorbent pores of blackheads and stubborn dirt, shrink pores, regulate oil secretion. How to use： Step 1 : Wash your face with warm water and cover it with a hot towel to open the pores . Step 2 : Spread the Blackhead remover mask gently on your face and wait 10-15 for it to dry. Step 3 : Peel off the black mask gently from chin to forehead . Step 4 : Rains with cold water and you may apply your daily skin care products afterwards. Tips: 1.The Blackhead Mask is only used for removing blackheads, exfoliating and cleaning the skin. 2.No effective against acne. Don’t use it on your acne or inflamed areas. 3.Spread the Blackhead Mask slowly in the same direction on your face and don’t stay on the same area too long. 4. Please ensure that you are not allergic. 5. If there is any discomfort, stop using. Package Included: 1 * Blackhead remover mask Gender: Unisex Net weight: 60g Shelf life: 3 years Ingredients: WATER, PROPANEDIOL, KAOLIN, POLYVINYLALCOHOL CROSSPOLYMER, POLYVINYL ALCOHOL, RUBBER LATEX, AMMONIUM GLYCOLATE, IMIDAZOLIDINYL UREA, AROMA']\nAverage Rating: 3.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 3 x 2.9 inches; 8.8 Ounces', 'UPC': '712038120383 777269135650 646437061445 646437182287', 'Manufacturer': 'KoEily'}\nReview Text: First  of all I am a huge fan of masks. I buy them all of the time. I have tried different  brands  from your dollar ones all the way to paying  $200 for one in a spa. So when  I  got  the  opportunity  to  review  this  product  for  free  in  exchange  for  an  honest  review  I was in. Let me say that  I liked the scent  which  is kind  of important  because  you  have  to  leave  this  mask on for at least 7 minutes. Next the color is dark  and the consistency  is lighter than what is typical. This means that a little  will go along way. It didn't  get too tight and was easy to remove. I used it both on my face and my cellulite  areas. It felt good  and I had no irritation. It definitely  made my face soft and bright. My makeup  also laid nicely. As far  as  the  cellulite  it didn't  melt  away. I am going  to continue  regulated use and see what  happens.\nReview Title: Dead Sea Delight\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyelash Serum 3.5ml\nReview Date: 2015/09/28\nAverage Rating: 3.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4 x 1.7 x 1 inches; 2.4 Ounces', 'UPC': '646437061599'}\nReview Text: I have the shortest, thinnest  eyelashes  ever. I constantly  use gobs of mascara to make  them thicker and longer. So when  I was  offered  to  review  this  product  for a  discount  in  exchange  for  an  honest  review  I jumped on it. This serum comes packaged  nicely and the bottle  seemed on the small side. I opened and tested  it on the back of my knee. No irritation  at all. So before  I went to sleep  I put it on my eye lashes  and brows. When I woke  up I didn't  see a difference. I decided  to try it in the morning  under my makeup. It made my eyebrows  super defined and they laid perfectly  through the day. It also made  my mascara  lay well and my eye lashes  appeared longer. I will continue  to  use  it  and see what happens.\nReview Title: Decent  day time  solution\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fungus Nail Treatment,Sky-shop Fungus Nail Repair Oil, Fungal Nail Eliminator for Fingernails and Toenails, Repairs & Protects from Discoloration, Brittle and Cracked Nails (35ml)\nReview Date: 2016/03/29\nStore: Pei Mei\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Pei Mei', 'Item Form': 'Oil', 'Item Weight': '0.25 Pounds', 'Number of Items': '1', 'Unit Count': '1.0582 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 5 inches; 4 Ounces', 'Item model number': 'Natural Nail Polish Remover', 'UPC': '646437736213'}\nReview Text: This nail polish  remover is a fascinating  product. First  of all the biggest  positive  for me is that this product  has no scent at all. It literally  smells  like water. Second biggest  positive  is that this nail  polish  remover is all natural  plant based as opposed  to pure chemical. This product  had no problems  removing  my old nail polish and worked well. This nail  polish  remover really  surprised  me by its quality  I am impressed. I  received  this  product  for  a  discount  in  exchange  for  an  unbiased  and  honest  review.\nReview Title: Fascinated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Exfoliating Grapefruit Body Scrub for Face and Body Exfoliating Scrub for Acne and Inflammation, 12 Ounce by Pure Body Naturals\nReview Date: 2016/04/18\nAverage Rating: 3.5\nProduct Details: {'Skin Type': 'Dry', 'Product Benefits': 'Brightening', 'Material Feature': 'Natural', 'Number of Items': '1', 'Special Feature': 'Exfoliating', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.4 x 3 x 2.6 inches; 13.76 Ounces', 'Item model number': 'Grapefruit Facial Scrub', 'UPC': '646437736305'}\nReview Text: This grapefruit  scrub smells just  like  grapefruit. I take my showers in the morning  and find this scent  to invigorate  me. I was concerned  at first  because  the color of the scrub is bright  orange  and I didn't  know  if it would  tint my skin...it didn't. This scrub is medium sized in exfoliating crystal. It is a drier consistency  and is easy to apply. I just dumped  some in my hand and gently  massaged it into my skin. It leaves your skin hydrated  and soft. I received  this  product  for  a  discount  in  exchange  for  an  unbiased  and  honest  review.\nReview Title: Invigorating\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Best Anti-bacterial Body Wash : Tea Tree Oil, Argan Oil and Coconut Oil 3-in-1 Formula By Keeva. 100% Natural Ingredients Are Perfect for Moisturizing Dry, Sensitive Skin, & Fighting Body Acne.\nReview Date: 2016/05/12\nStore: Keeva Organics\nAverage Rating: 3.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Sensitive, Dry', 'Brand': 'Keeva Organics', 'Scent': 'Tea Tree, Coconut', 'Material Feature': 'Antibacterial, Natural', 'Package Dimensions': '11 x 10 x 3.4 inches; 1.9 Pounds', 'UPC': '641938999594'}\nReview Text: I have  been  using  this  body wash  for about  a  week  and I have to say my skin is looking  fabulous. As far as a body wash goes this one has a very light scent. While it definitely  cleans  the skin it is a low lather soap. You do not  get a lot of bubbles. There are three  different  types  of  oils  in this body wash  coconut, argan, and tea tree. They work  well in terms  of moisturization. One of my favorite  features  is the pump that is included  to dispense the soap. It is really  well  made. It doesn't  allow  for any drips and dispenses  accurately. I  received  a  discounted  sample  of  this  product  in  exchange  for  an  unbiased  and  honest  review.\nReview Title: Moisturizing\nRating: 4.0\n--------------------------------------------------",
  "reference": "OZNaturals Body Butter – This Natural Body Moisturizer Contains Sweet Almond & Macadamia Nut - This Luxurious Skin Moisturizer Will Provide Your Body With A Healthy Vibrant Glow!\nMUPATER\n['Size:30ML PuriDerma scar removal cream is highly effective in fading away scars from acne, cuts, stretch marks, C-sections, and surgeries.']\n{'Brand': 'MUPATER', 'Scent': 'Almond', 'Item Form': 'Butter', 'Unit Count': '8.0 Ounce', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 1 inches; 8 Ounces', 'Manufacturer recommended age': '6 months - 3 years', 'Item model number': '04-KPOU-1KSA', 'UPC': '616806598506 885337394905', 'Manufacturer': 'OZ Naturals'}\nMy body butter arrived  a few days ago and I decided  to use it daily  on my entire  body. I love  the fact that  this  lotion  features  key ingredients  such  as Shea Butter, avocado  oil, and kukui nut oil. I applied  it every  night  before  bed. This butter  is super  rich  and  moisturizing. My legs were starting  to have  that  alligator  look and now they don't. I wish  this  scent was way stronger. It's to faint for me. Also this  butter absorbs  at a slower rate. That's why  I  choose  to apply  at night. I received  this  product  for  free  in  exchange  for  an  honest  review.\nSuper  rich!!\nOZNaturals Tinted Moisturizer, SPF 30 Sunscreen. Broad Spectrum Protection. Zinc Oxide + Minerals In This Tinted Sunscreen Protects, Moisturizes And Blends Well To Provide A Rich, Youthful Glow!\nOZ Naturals\n['Skin care experts and dermatologists are in agreement on the importance of wearing sunscreen. \\xa0Most premature aging of the skin is caused by sun exposure. “Photo aging,” as is it known in skin care circles, includes wrinkles, freckles, age spots, blotchy complexion, dullness, sagging skin and rough, leathery texture. \\xa0In other words, just about every complaint surrounding aging skin can be traced at least in part to sun exposure, making daily sunscreen protection with an SPF 30 sunscreen a must. But not all sunscreens are created equal. \\xa0OZNaturals Age Defying Solar Shield SPF 30 Broad Spectrum Tinted Sunscreen with Zinc Oxide provides broad spectrum protection from the sun’s harmful UVA/UVB rays, while moisturizing skin with a healthy-looking hint of color. Utilizing the highly stable and reflective properties of Zinc Oxide, with the natural UV diluting qualities of Octyl Methoxycinnamate, our formula offers sheer, broad-spectrum UV coverage in a luxurious tinted moisturizer formulation.']\n{'Scent': 'Unscented', 'Sun Protection Factor': '30 Sun Protection Factor (SPF)', 'Number of Items': '1', 'Unit Count': '1.0 Ounce', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.5 x 3.5 x 1 inches; 1.76 Ounces', 'Item model number': 'I1-7LV1-6RQ9', 'UPC': '638317780652', 'Manufacturer': 'OZ Naturals, LLC'}\nFirst  of  all  let  me  tell  you that  this  product  is paraben, sulfate, mineral  oil, and lanolin  free. It can  be  applied  all  over  your  body  as well  as worn like  foundation  or under your  makeup. This sunscreen  has a brownish  tint to it and it blends  with  ease. I do wish  it was a little  darker. The consistency  is creamy  but not oily. I wish  the scent  was a bit stronger. I find  this  product  to  be  really  moisturizing. I received  this  product  for  free  in  exchange  for  an  honest  review.\nA little  tint alotta  moisture!\nUNGLINGA Black Mask Blackhead Remover Purifying Peel Off Mask Bamboo Activated Charcoal Face Deep Pore Cleansing Mask For Face Nose and Acne Blemishes Treatment\nUNGLINGA\n['CONCERNS: Enlarged pore, Blackheads, Anti-aging, Fine lines and blemishes, Oily skin, Strawberry nose. Effect: Absorbent pores of blackheads and stubborn dirt, shrink pores, regulate oil secretion. How to use： Step 1 : Wash your face with warm water and cover it with a hot towel to open the pores . Step 2 : Spread the Blackhead remover mask gently on your face and wait 10-15 for it to dry. Step 3 : Peel off the black mask gently from chin to forehead . Step 4 : Rains with cold water and you may apply your daily skin care products afterwards. Tips: 1.The Blackhead Mask is only used for removing blackheads, exfoliating and cleaning the skin. 2.No effective against acne. Don’t use it on your acne or inflamed areas. 3.Spread the Blackhead Mask slowly in the same direction on your face and don’t stay on the same area too long. 4. Please ensure that you are not allergic. 5. If there is any discomfort, stop using. Package Included: 1 * Blackhead remover mask Gender: Unisex Net weight: 60g Shelf life: 3 years Ingredients: WATER, PROPANEDIOL, KAOLIN, POLYVINYLALCOHOL CROSSPOLYMER, POLYVINYL ALCOHOL, RUBBER LATEX, AMMONIUM GLYCOLATE, IMIDAZOLIDINYL UREA, AROMA']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 3 x 2.9 inches; 8.8 Ounces', 'UPC': '712038120383 777269135650 646437061445 646437182287', 'Manufacturer': 'KoEily'}\nFirst  of all I am a huge fan of masks. I buy them all of the time. I have tried different  brands  from your dollar ones all the way to paying  $200 for one in a spa. So when  I  got  the  opportunity  to  review  this  product  for  free  in  exchange  for  an  honest  review  I was in. Let me say that  I liked the scent  which  is kind  of important  because  you  have  to  leave  this  mask on for at least 7 minutes. Next the color is dark  and the consistency  is lighter than what is typical. This means that a little  will go along way. It didn't  get too tight and was easy to remove. I used it both on my face and my cellulite  areas. It felt good  and I had no irritation. It definitely  made my face soft and bright. My makeup  also laid nicely. As far  as  the  cellulite  it didn't  melt  away. I am going  to continue  regulated use and see what  happens.\nDead Sea Delight\nEyelash Serum 3.5ml\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4 x 1.7 x 1 inches; 2.4 Ounces', 'UPC': '646437061599'}\nI have the shortest, thinnest  eyelashes  ever. I constantly  use gobs of mascara to make  them thicker and longer. So when  I was  offered  to  review  this  product  for a  discount  in  exchange  for  an  honest  review  I jumped on it. This serum comes packaged  nicely and the bottle  seemed on the small side. I opened and tested  it on the back of my knee. No irritation  at all. So before  I went to sleep  I put it on my eye lashes  and brows. When I woke  up I didn't  see a difference. I decided  to try it in the morning  under my makeup. It made my eyebrows  super defined and they laid perfectly  through the day. It also made  my mascara  lay well and my eye lashes  appeared longer. I will continue  to  use  it  and see what happens.\nDecent  day time  solution\nFungus Nail Treatment,Sky-shop Fungus Nail Repair Oil, Fungal Nail Eliminator for Fingernails and Toenails, Repairs & Protects from Discoloration, Brittle and Cracked Nails (35ml)\nPei Mei\n{'Brand': 'Pei Mei', 'Item Form': 'Oil', 'Item Weight': '0.25 Pounds', 'Number of Items': '1', 'Unit Count': '1.0582 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 5 inches; 4 Ounces', 'Item model number': 'Natural Nail Polish Remover', 'UPC': '646437736213'}\nThis nail polish  remover is a fascinating  product. First  of all the biggest  positive  for me is that this product  has no scent at all. It literally  smells  like water. Second biggest  positive  is that this nail  polish  remover is all natural  plant based as opposed  to pure chemical. This product  had no problems  removing  my old nail polish and worked well. This nail  polish  remover really  surprised  me by its quality  I am impressed. I  received  this  product  for  a  discount  in  exchange  for  an  unbiased  and  honest  review.\nFascinated\nExfoliating Grapefruit Body Scrub for Face and Body Exfoliating Scrub for Acne and Inflammation, 12 Ounce by Pure Body Naturals\n{'Skin Type': 'Dry', 'Product Benefits': 'Brightening', 'Material Feature': 'Natural', 'Number of Items': '1', 'Special Feature': 'Exfoliating', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.4 x 3 x 2.6 inches; 13.76 Ounces', 'Item model number': 'Grapefruit Facial Scrub', 'UPC': '646437736305'}\nThis grapefruit  scrub smells just  like  grapefruit. I take my showers in the morning  and find this scent  to invigorate  me. I was concerned  at first  because  the color of the scrub is bright  orange  and I didn't  know  if it would  tint my skin...it didn't. This scrub is medium sized in exfoliating crystal. It is a drier consistency  and is easy to apply. I just dumped  some in my hand and gently  massaged it into my skin. It leaves your skin hydrated  and soft. I received  this  product  for  a  discount  in  exchange  for  an  unbiased  and  honest  review.\nInvigorating\nBest Anti-bacterial Body Wash : Tea Tree Oil, Argan Oil and Coconut Oil 3-in-1 Formula By Keeva. 100% Natural Ingredients Are Perfect for Moisturizing Dry, Sensitive Skin, & Fighting Body Acne.\nKeeva Organics\n{'Item Form': 'Oil', 'Skin Type': 'Sensitive, Dry', 'Brand': 'Keeva Organics', 'Scent': 'Tea Tree, Coconut', 'Material Feature': 'Antibacterial, Natural', 'Package Dimensions': '11 x 10 x 3.4 inches; 1.9 Pounds', 'UPC': '641938999594'}\nI have  been  using  this  body wash  for about  a  week  and I have to say my skin is looking  fabulous. As far as a body wash goes this one has a very light scent. While it definitely  cleans  the skin it is a low lather soap. You do not  get a lot of bubbles. There are three  different  types  of  oils  in this body wash  coconut, argan, and tea tree. They work  well in terms  of moisturization. One of my favorite  features  is the pump that is included  to dispense the soap. It is really  well  made. It doesn't  allow  for any drips and dispenses  accurately. I  received  a  discounted  sample  of  this  product  in  exchange  for  an  unbiased  and  honest  review.\nMoisturizing",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: OZNaturals Body Butter – This Natural Body Moisturizer Contains Sweet Almond & Macadamia Nut - This Luxurious Skin Moisturizer Will Provide Your Body With A Healthy Vibrant Glow!\nReview Date: 2015/08/21\nStore: MUPATER\nProduct Description: ['Size:30ML PuriDerma scar removal cream is highly effective in fading away scars from acne, cuts, stretch marks, C-sections, and surgeries.']\nAverage Rating: 3.5\nProduct Details: {'Brand': 'MUPATER', 'Scent': 'Almond', 'Item Form': 'Butter', 'Unit Count': '8.0 Ounce', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 1 inches; 8 Ounces', 'Manufacturer recommended age': '6 months - 3 years', 'Item model number': '04-KPOU-1KSA', 'UPC': '616806598506 885337394905', 'Manufacturer': 'OZ Naturals'}\nReview Text: My body butter arrived  a few days ago and I decided  to use it daily  on my entire  body. I love  the fact that  this  lotion  features  key ingredients  such  as Shea Butter, avocado  oil, and kukui nut oil. I applied  it every  night  before  bed. This butter  is super  rich  and  moisturizing. My legs were starting  to have  that  alligator  look and now they don't. I wish  this  scent was way stronger. It's to faint for me. Also this  butter absorbs  at a slower rate. That's why  I  choose  to apply  at night. I received  this  product  for  free  in  exchange  for  an  honest  review.\nReview Title: Super  rich!!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: OZNaturals Tinted Moisturizer, SPF 30 Sunscreen. Broad Spectrum Protection. Zinc Oxide + Minerals In This Tinted Sunscreen Protects, Moisturizes And Blends Well To Provide A Rich, Youthful Glow!\nReview Date: 2015/08/28\nStore: OZ Naturals\nProduct Description: ['Skin care experts and dermatologists are in agreement on the importance of wearing sunscreen. \\xa0Most premature aging of the skin is caused by sun exposure. “Photo aging,” as is it known in skin care circles, includes wrinkles, freckles, age spots, blotchy complexion, dullness, sagging skin and rough, leathery texture. \\xa0In other words, just about every complaint surrounding aging skin can be traced at least in part to sun exposure, making daily sunscreen protection with an SPF 30 sunscreen a must. But not all sunscreens are created equal. \\xa0OZNaturals Age Defying Solar Shield SPF 30 Broad Spectrum Tinted Sunscreen with Zinc Oxide provides broad spectrum protection from the sun’s harmful UVA/UVB rays, while moisturizing skin with a healthy-looking hint of color. Utilizing the highly stable and reflective properties of Zinc Oxide, with the natural UV diluting qualities of Octyl Methoxycinnamate, our formula offers sheer, broad-spectrum UV coverage in a luxurious tinted moisturizer formulation.']\nAverage Rating: 3.4\nProduct Details: {'Scent': 'Unscented', 'Sun Protection Factor': '30 Sun Protection Factor (SPF)', 'Number of Items': '1', 'Unit Count': '1.0 Ounce', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.5 x 3.5 x 1 inches; 1.76 Ounces', 'Item model number': 'I1-7LV1-6RQ9', 'UPC': '638317780652', 'Manufacturer': 'OZ Naturals, LLC'}\nReview Text: First  of  all  let  me  tell  you that  this  product  is paraben, sulfate, mineral  oil, and lanolin  free. It can  be  applied  all  over  your  body  as well  as worn like  foundation  or under your  makeup. This sunscreen  has a brownish  tint to it and it blends  with  ease. I do wish  it was a little  darker. The consistency  is creamy  but not oily. I wish  the scent  was a bit stronger. I find  this  product  to  be  really  moisturizing. I received  this  product  for  free  in  exchange  for  an  honest  review.\nReview Title: A little  tint alotta  moisture!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UNGLINGA Black Mask Blackhead Remover Purifying Peel Off Mask Bamboo Activated Charcoal Face Deep Pore Cleansing Mask For Face Nose and Acne Blemishes Treatment\nReview Date: 2015/09/24\nStore: UNGLINGA\nProduct Description: ['CONCERNS: Enlarged pore, Blackheads, Anti-aging, Fine lines and blemishes, Oily skin, Strawberry nose. Effect: Absorbent pores of blackheads and stubborn dirt, shrink pores, regulate oil secretion. How to use： Step 1 : Wash your face with warm water and cover it with a hot towel to open the pores . Step 2 : Spread the Blackhead remover mask gently on your face and wait 10-15 for it to dry. Step 3 : Peel off the black mask gently from chin to forehead . Step 4 : Rains with cold water and you may apply your daily skin care products afterwards. Tips: 1.The Blackhead Mask is only used for removing blackheads, exfoliating and cleaning the skin. 2.No effective against acne. Don’t use it on your acne or inflamed areas. 3.Spread the Blackhead Mask slowly in the same direction on your face and don’t stay on the same area too long. 4. Please ensure that you are not allergic. 5. If there is any discomfort, stop using. Package Included: 1 * Blackhead remover mask Gender: Unisex Net weight: 60g Shelf life: 3 years Ingredients: WATER, PROPANEDIOL, KAOLIN, POLYVINYLALCOHOL CROSSPOLYMER, POLYVINYL ALCOHOL, RUBBER LATEX, AMMONIUM GLYCOLATE, IMIDAZOLIDINYL UREA, AROMA']\nAverage Rating: 3.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 3 x 2.9 inches; 8.8 Ounces', 'UPC': '712038120383 777269135650 646437061445 646437182287', 'Manufacturer': 'KoEily'}\nReview Text: First  of all I am a huge fan of masks. I buy them all of the time. I have tried different  brands  from your dollar ones all the way to paying  $200 for one in a spa. So when  I  got  the  opportunity  to  review  this  product  for  free  in  exchange  for  an  honest  review  I was in. Let me say that  I liked the scent  which  is kind  of important  because  you  have  to  leave  this  mask on for at least 7 minutes. Next the color is dark  and the consistency  is lighter than what is typical. This means that a little  will go along way. It didn't  get too tight and was easy to remove. I used it both on my face and my cellulite  areas. It felt good  and I had no irritation. It definitely  made my face soft and bright. My makeup  also laid nicely. As far  as  the  cellulite  it didn't  melt  away. I am going  to continue  regulated use and see what  happens.\nReview Title: Dead Sea Delight\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyelash Serum 3.5ml\nReview Date: 2015/09/28\nAverage Rating: 3.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4 x 1.7 x 1 inches; 2.4 Ounces', 'UPC': '646437061599'}\nReview Text: I have the shortest, thinnest  eyelashes  ever. I constantly  use gobs of mascara to make  them thicker and longer. So when  I was  offered  to  review  this  product  for a  discount  in  exchange  for  an  honest  review  I jumped on it. This serum comes packaged  nicely and the bottle  seemed on the small side. I opened and tested  it on the back of my knee. No irritation  at all. So before  I went to sleep  I put it on my eye lashes  and brows. When I woke  up I didn't  see a difference. I decided  to try it in the morning  under my makeup. It made my eyebrows  super defined and they laid perfectly  through the day. It also made  my mascara  lay well and my eye lashes  appeared longer. I will continue  to  use  it  and see what happens.\nReview Title: Decent  day time  solution\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fungus Nail Treatment,Sky-shop Fungus Nail Repair Oil, Fungal Nail Eliminator for Fingernails and Toenails, Repairs & Protects from Discoloration, Brittle and Cracked Nails (35ml)\nReview Date: 2016/03/29\nStore: Pei Mei\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Pei Mei', 'Item Form': 'Oil', 'Item Weight': '0.25 Pounds', 'Number of Items': '1', 'Unit Count': '1.0582 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 5 inches; 4 Ounces', 'Item model number': 'Natural Nail Polish Remover', 'UPC': '646437736213'}\nReview Text: This nail polish  remover is a fascinating  product. First  of all the biggest  positive  for me is that this product  has no scent at all. It literally  smells  like water. Second biggest  positive  is that this nail  polish  remover is all natural  plant based as opposed  to pure chemical. This product  had no problems  removing  my old nail polish and worked well. This nail  polish  remover really  surprised  me by its quality  I am impressed. I  received  this  product  for  a  discount  in  exchange  for  an  unbiased  and  honest  review.\nReview Title: Fascinated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Exfoliating Grapefruit Body Scrub for Face and Body Exfoliating Scrub for Acne and Inflammation, 12 Ounce by Pure Body Naturals\nReview Date: 2016/04/18\nAverage Rating: 3.5\nProduct Details: {'Skin Type': 'Dry', 'Product Benefits': 'Brightening', 'Material Feature': 'Natural', 'Number of Items': '1', 'Special Feature': 'Exfoliating', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.4 x 3 x 2.6 inches; 13.76 Ounces', 'Item model number': 'Grapefruit Facial Scrub', 'UPC': '646437736305'}\nReview Text: This grapefruit  scrub smells just  like  grapefruit. I take my showers in the morning  and find this scent  to invigorate  me. I was concerned  at first  because  the color of the scrub is bright  orange  and I didn't  know  if it would  tint my skin...it didn't. This scrub is medium sized in exfoliating crystal. It is a drier consistency  and is easy to apply. I just dumped  some in my hand and gently  massaged it into my skin. It leaves your skin hydrated  and soft. I received  this  product  for  a  discount  in  exchange  for  an  unbiased  and  honest  review.\nReview Title: Invigorating\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Best Anti-bacterial Body Wash : Tea Tree Oil, Argan Oil and Coconut Oil 3-in-1 Formula By Keeva. 100% Natural Ingredients Are Perfect for Moisturizing Dry, Sensitive Skin, & Fighting Body Acne.\nReview Date: 2016/05/12\nStore: Keeva Organics\nAverage Rating: 3.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Sensitive, Dry', 'Brand': 'Keeva Organics', 'Scent': 'Tea Tree, Coconut', 'Material Feature': 'Antibacterial, Natural', 'Package Dimensions': '11 x 10 x 3.4 inches; 1.9 Pounds', 'UPC': '641938999594'}\nReview Text: I have  been  using  this  body wash  for about  a  week  and I have to say my skin is looking  fabulous. As far as a body wash goes this one has a very light scent. While it definitely  cleans  the skin it is a low lather soap. You do not  get a lot of bubbles. There are three  different  types  of  oils  in this body wash  coconut, argan, and tea tree. They work  well in terms  of moisturization. One of my favorite  features  is the pump that is included  to dispense the soap. It is really  well  made. It doesn't  allow  for any drips and dispenses  accurately. I  received  a  discounted  sample  of  this  product  in  exchange  for  an  unbiased  and  honest  review.\nReview Title: Moisturizing\nRating: 4.0\n--------------------------------------------------",
  "raw_response": "**Preferences and Trends:**\n\n- **Moisturizing Products**: Frequent purchases of rich and hydrating creams, oils, and butters indicate a strong preference for deeply moisturizing body products.\n- **Natural Ingredients**: A consistent focus on items made with natural and organic components, such as shea butter, coconut oil, and tea tree oil, highlights a preference for clean and effective skincare.\n- **Skin Protection**: Interest in products that provide sun protection, like tinted moisturizers with SPF, suggests an awareness of skincare related to aging and environmental damage.\n- **Body Care and Exfoliation**: Engagement with body scrubs and antibacterial washes reflects a commitment to maintaining skin cleanliness and texture through exfoliation and moisturizing.\n- **Scent Sensitivity**: An expressed desire for more pronounced scents in body products indicates a preference for stronger fragrance experiences.\n- **Reviews for Discounts**: Participation in reviewing products for discounts suggests a proactive approach to trying new skincare solutions and sharing feedback.\n- **Mask Usage**: Regular use of face masks, particularly those targeting blackhead removal, shows an active routine for addressing skin imperfections and maintaining facial care.\n\nOverall, the person exhibits a clear inclination towards effective moisturization, natural ingredients, and skincare routines that focus on protection and blemish control.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Great Choice",
    "text": "In today's  world  you are constantly  exposed  to chemicals, sun damage, and who knows  what else. Being pregnant  I  have  started  to  become  more aware  of the beauty products  I typically  use so  when  the  opportunity  arose  to  try  this  product  for  a  discount  in  exchange  for  an  unbiased  and  honest  review  I  jumped  on  it. Yes it is chemical  free and compared to my other  face wash essentially  scent  free as well. It provided  good  lather  and actually  got my face clean. My skin seems  to be well  balanced  which is practically  impossible  when your expecting. I am definitely  going  to  continue  using  this face wash  throughout  my pregnancy.",
    "images": [],
    "asin": "B01FJ5RH6U",
    "parent_asin": "B01FJ5RH6U",
    "user_id": "AE53545QTFI7RPWHC2BSGOAD3NYA",
    "timestamp": "2016-09-04 12:45:14",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Maternal Anti-Blemish Face Wash 6 oz – For Acne Prone And Problem Skin – Safe And Effective For Expecting Mom To Be And Beyond Pregnancy",
    "average_rating": 3.9,
    "rating_number": 83,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41X2mFTlwBL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41X2mFTlwBL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61TCGfb1EwL._SL1371_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51L78lFvRWL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51L78lFvRWL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81iFU0SZ-3L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41eI5zsAE+L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41eI5zsAE+L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71EqLEmjB+L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/413FwfT-sAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/413FwfT-sAL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/713WXdDIRpL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Inn&Co",
    "categories": [],
    "details": {
      "Item Form": "Cream",
      "Skin Type": "Sensitive",
      "Brand": "Inn&Co",
      "Age Range (Description)": "Adult",
      "Unit Count": "6.0 Ounce",
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "6.6 x 2.3 x 2.3 inches; 8 Ounces",
      "Item model number": "SG_B01FJ5RH6U_US",
      "UPC": "866181000242"
    },
    "bought_together": null
  }
}