{
  "user_id": "AHVQR7U4PJ7VTG36DQMRSIHK7O6A",
  "summary": "=== Purchase Information ===\nProduct Title: Calily Genuine Handcrafted Sandalwood Comb for Men – Pocket Size Mustache and Beard Comb with Premium Synthetic Leather Case / Ultra-Smooth Combing; No Static or Snagging\nReview Date: 2016/08/05\nStore: Calily\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Calily', 'Hair Type': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.6 x 3.1 x 0.6 inches; 2.4 Ounces', 'UPC': '821079365117'}\nReview Text: If you’re looking for a compact, yet very stylish comb that can be used on your beard, mustache, and even hair, look no further than this handcrafted sandalwood comb by Calily. The comb itself is just over 3 inches, meaning it fits perfectly in any pocket, bag, glove compartment of a car, etc. If you are always on the run like I am, having a useful and reliable comb is key in making sure you look your best! I usually slick back my hair, and on especially hot days, it can come undone, leading to a rather homely look. Now the only thing I have to do is take the comb out of my pocket and I’m good to go! Although my beard isn’t anywhere near as long as I’d like it, It also works well there.<br /><br />The comb itself features a nice sandalwood scent that is both refreshing and calming. The wood on the comb feels very sturdy, and the teeth on the comb feel as if they will not break easily, like plastic combs do. The comb also comes with a very nice carrying case.<br /><br />Overall, if you need a reliable, stylish, and VERY compact comb, I would absolutely recommend this comb by Calily.<br /><br />I was sent this product for free in order to evaluate and leave my honest feedback.\nReview Title: The perfect comb for anybody who is always on the go!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Webat Bath Bombs Gift Set, Spa Bomb Fizzies & Ultra Lush Essential Oil - Dry Skin Moisturize, Fit for Bubble & Spa Bath, Handmade Birthday Gift Ideal for Lady, Women, Girlfriend, Men\nReview Date: 2016/08/15\nStore: Webat\nProduct Description: [\"Product Specification: 1. Quantity: 6* 2.5 oz 2. Set Size: 6.3 * 4.3 * 2 inch 3. Total Weight: 14.5 oz 4. Ingredients: Baking soda, citric acid, cellulose, sodium sulfate 5. Flavor: Purple-lavender, Blue-ocean, Red-rose, Pink-vanilla, Green-green Tea, Yellow-lemon ★Best Gift Set for All Individually wrapped and gift set, perfect for birthdays, Christmas gift, anniversaries, parties and wedding favours. It is a best gift set for lover, friend, lady, women, men and so on. ★Healthy Spa at Home Bath bombs features exfoliating, fine pores, anti-fatigue, bactericidal and itching functions. Fit for detoxifying minerals and moisturizers skin, it relaxs your body and relieves fatigue to get a deep sleep after the whole day's work. A enjoyable spa aromatherapy at your home. ★Note: For external use only. Keep out of eyes. If irritation occurs, stop to use immediately and consult with your doctor. ★Package included: 1* bath bombs set（6* bath bombs)\"]\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Webat', 'Scent': 'Lavender, Vanilla, Rose, Lemon', 'Age Range (Description)': 'Adult', 'Product Benefits': 'Moisturizing,Relaxing,Aromatherapy,Moisturize', 'Material Feature': 'No artificial flavors', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.52 x 5.2 x 2.8 inches; 1.85 Pounds', 'UPC': '600736170253', 'Manufacturer': 'Webat'}\nReview Text: It can be argued that taking a bath is one of the most relaxing experiences there is! Now add these bath bombs by Calily to the mix, and you have an even more enjoyable experience!<br /><br />This set comes with 6 bath bombs; Garden of Heaven, Yoga Strength, Revive, Vanilla Indulgence, Stress relief, and Energy Grapefruit.<br /><br />The bath bombs all come individually wrapped, in a very nice gift box. This means that they would be an excellent present for any lady in your life. Once you add them to the water, the immediately begin to fizz and turn your water a color (does not stain your skin). They all smell beautiful. My personal favorite is the Vanilla Indulgence scent!<br /><br />If you’re looking for a gift for a special lady (I suppose guys can use them as well!) in your life, or looking for a way to take your relaxation to the next level, I would totally recommend trying out these bath bombs by Calily!<br /><br />I received these bath bombs for free in order to test and leave my honest feedback.\nReview Title: The ultimate bath time experience!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Beard Oil - Rousing Citrus Scent - Huge Man-Sized 4 oz Bottle - 100% Natural - Softens Your Beard and Stops Itching - Scent Women Love - Best Beard Oil And Conditioner For Men\nReview Date: 2016/09/20\nStore: BEARDSMEN SPIRIT\nAverage Rating: 3.3\nProduct Details: {'Scent': 'Citrus', 'Liquid Volume': '4 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'BEARDSMEN SPIRIT', 'Number of Items': '2', 'Package Dimensions': '4.1 x 2 x 1.8 inches; 8 Ounces'}\nReview Text: This is a very high quality beard oil that is sure to keep your facial hair looking its best! The citrus scent, while good, is more of a clove scent than a citrus in my opinion (as the product DOES contain clove), but it is not at all overpowering in any way, so it will not clash with your colognes or other fragrances that you wear. Just a small drop is enough to keep your facial hair looking hydrated, as there is truly nothing worse looking than a dry beard! This blend of beard oil contains many top quality oils such as: grape seed oil, orange oil, jojoba oil, and more! The 4 oz. bottle will last you a very long time. In fact, I have barely made a dent in mine! If you’re growing out your facial hair and want it to look its best, this beard oil is a great place to start!<br /><br />I was provided this beard oil for free in order to evaluate and provide my honest feedback through a review.\nReview Title: Good quality oil; Smells more like clove than citrus though\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Poly Gel Nail Kit, opove Nail Builder Gel Extension Nail thickening Solution French Nail Art Equitment - 6 Colors 15ML\nReview Date: 2020/07/25\nStore: opove\nAverage Rating: 4.3\nProduct Details: {'Product Dimensions': '13.78 x 5.91 x 1.97 inches; 1.82 Pounds'}\nReview Text: This kit had everything We were looking for. The packaging is very nice and it includes everything you could possibly need to get salon quality nails. It includes the polish itself, the nails, an Emory board and more. I like the look of natural, subtle colors so I was happy with the choices it came with. The gel itself goes on very smooth and once I applied the nails, they felt strong and held up well. It’s definitely a game changer it’s nice that My girlfriend won’t be going back to the nail salon any time soon.\nReview Title: This kit has it all!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YiJiaBa Under Eye Mask, Collagen Eye Mask, Eye Gel Pads, Green Tea Under Eye Patches, Firming Eye Mask, 30 Pairs Collagen Eye Patches for Eye Moisturizing, Dark Circles, Wrinkles, Fine Lines\nReview Date: 2021/03/07\nStore: YiJiaBa\nProduct Description: ['Imagine that when we saw a person, the first thing we saw was their eyes, which is why eyes are very important. Because it is great significance for your \"first impression\" to others.', \"Whether it's women or men - beautiful looks and energetic eyes look great, they are now as important as a clean skin or haircut.\", 'It decorates your eyes and enhances your features, making them a must-have beauty item.', 'WHY CHOOSE YiJiaBa EYE MASK?', '1.Safety- 100% natural ingredients, safe to use.', '2. Powerful Effect- Reduce dark circles, eliminate edema, prevent and delay aging.', '3. Soothes skin, moisturizes and whitening.', 'HOW TO USE?', '1. Clean your face.', '2. Apply the eye mask to the area where it is dry or has fine lines.', '3. Wait for 15 to 20 minutes until the essence is completely absorbed.', '4. Remove the eye mask and gently massage the skin around the eyes for 1 minute to help absorb.', 'Tips', '-Store in a cool, dry place, away from direct sunlight or near high temperatures.', '-There is a course of treatment for the eye mask, and it takes a long term process to get beautiful']\nAverage Rating: 4.1\nProduct Details: {'Package Dimensions': '3.23 x 3.19 x 1.65 inches; 5.61 Ounces', 'UPC': '788481727226', 'Manufacturer': 'YiJiaBa'}\nReview Text: These under eye pads are an absolute treat for your eyes. I've been wearing them daily in the morning and I've noticed such an improvement in my eyes and the puffiness around them. I usually leave them on for 45 minutes each morning and when I take them off my eyes feel moisturized and rejuvenated.<br /><br />They come packed nicely in the container and comes with a little spoon that you can use to get a pair of masks out since they are saturated in a liquid.<br /><br />As a bonus tip, try keeping these in your refrigerator. It feels SO much better on your eyes and the cooling effect helps a ton with puffiness.\nReview Title: A treat for your eyes\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Brazilian Body Wave Human Hair Lace Frontal Wigs 13x4x1 T Part Lace Front Wigs for Black Women Natural Hairline 18 inches\nReview Date: 2021/03/19\nStore: Aliglossy\nAverage Rating: 2.9\nProduct Details: {'Hair Type': 'Wavy', 'Special Feature': 'Tangle Free', 'Brand': 'Aliglossy', 'Age Range (Description)': 'Adult', 'Cartoon Character': 'Wavy', 'Package Dimensions': '9.09 x 7.2 x 2.6 inches; 9.52 Ounces', 'UPC': '791715548177'}\nReview Text: A really beautiful wavy wig for when you’re wanting to go for a casual or more formal look. The wig itself came very nicely packaged in a box and didn’t have any noticeable smells. In fact, mine smelled clean like shampoo. The hair feels very soft to the touch and looks very natural.<br /><br />The wig comes naturally with waves in it already and so far I haven’t noticed much shedding. The lace comes pre-plucked which makes the hairline look very natural. You wouldn’t know it’s a wig unless someone told you. All in all, it's a solid value and great for every day use.\nReview Title: Soft with a very realistic hairline.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: (Pack of 30 Patch) PRRETI Real Vita Eye Zone Patch, Eye Mask for Heeling, Zipper Bag Type Package, Korean Skin Care Eye Treatment for Dryness & Dull Skin, Vita Complex-10 / Made in Korea, K Beauty (1 Pack of 30 Patch)\nReview Date: 2022/02/22\nStore: Prreti\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Prreti', 'Product Benefits': 'Brightening', 'Scent': 'Citrus', 'Skin Type': 'Acne Prone', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.02 x 4.06 x 0.08 inches; 1.16 Ounces'}\nReview Text: These eye patches provide a nice level of hydration for the price, but there is some room for improvement. To begin, the patches are super thin. This makes getting them out of the package difficult, as you will likely find yourself grabbing more than you need at once. Also, they have a very light fragrance, but something a little more aromatic would be nice, maybe a citrus scent to help wake you up in the morning. For the price, it's hard to complain, but these could easily be a much better product with a few changes.\nReview Title: Nice hydration, but some room for improvement.\nRating: 3.0\n--------------------------------------------------",
  "reference": "Calily Genuine Handcrafted Sandalwood Comb for Men – Pocket Size Mustache and Beard Comb with Premium Synthetic Leather Case / Ultra-Smooth Combing; No Static or Snagging\nCalily\n{'Brand': 'Calily', 'Hair Type': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.6 x 3.1 x 0.6 inches; 2.4 Ounces', 'UPC': '821079365117'}\nIf you’re looking for a compact, yet very stylish comb that can be used on your beard, mustache, and even hair, look no further than this handcrafted sandalwood comb by Calily. The comb itself is just over 3 inches, meaning it fits perfectly in any pocket, bag, glove compartment of a car, etc. If you are always on the run like I am, having a useful and reliable comb is key in making sure you look your best! I usually slick back my hair, and on especially hot days, it can come undone, leading to a rather homely look. Now the only thing I have to do is take the comb out of my pocket and I’m good to go! Although my beard isn’t anywhere near as long as I’d like it, It also works well there.<br /><br />The comb itself features a nice sandalwood scent that is both refreshing and calming. The wood on the comb feels very sturdy, and the teeth on the comb feel as if they will not break easily, like plastic combs do. The comb also comes with a very nice carrying case.<br /><br />Overall, if you need a reliable, stylish, and VERY compact comb, I would absolutely recommend this comb by Calily.<br /><br />I was sent this product for free in order to evaluate and leave my honest feedback.\nThe perfect comb for anybody who is always on the go!\nWebat Bath Bombs Gift Set, Spa Bomb Fizzies & Ultra Lush Essential Oil - Dry Skin Moisturize, Fit for Bubble & Spa Bath, Handmade Birthday Gift Ideal for Lady, Women, Girlfriend, Men\nWebat\n[\"Product Specification: 1. Quantity: 6* 2.5 oz 2. Set Size: 6.3 * 4.3 * 2 inch 3. Total Weight: 14.5 oz 4. Ingredients: Baking soda, citric acid, cellulose, sodium sulfate 5. Flavor: Purple-lavender, Blue-ocean, Red-rose, Pink-vanilla, Green-green Tea, Yellow-lemon ★Best Gift Set for All Individually wrapped and gift set, perfect for birthdays, Christmas gift, anniversaries, parties and wedding favours. It is a best gift set for lover, friend, lady, women, men and so on. ★Healthy Spa at Home Bath bombs features exfoliating, fine pores, anti-fatigue, bactericidal and itching functions. Fit for detoxifying minerals and moisturizers skin, it relaxs your body and relieves fatigue to get a deep sleep after the whole day's work. A enjoyable spa aromatherapy at your home. ★Note: For external use only. Keep out of eyes. If irritation occurs, stop to use immediately and consult with your doctor. ★Package included: 1* bath bombs set（6* bath bombs)\"]\n{'Brand': 'Webat', 'Scent': 'Lavender, Vanilla, Rose, Lemon', 'Age Range (Description)': 'Adult', 'Product Benefits': 'Moisturizing,Relaxing,Aromatherapy,Moisturize', 'Material Feature': 'No artificial flavors', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.52 x 5.2 x 2.8 inches; 1.85 Pounds', 'UPC': '600736170253', 'Manufacturer': 'Webat'}\nIt can be argued that taking a bath is one of the most relaxing experiences there is! Now add these bath bombs by Calily to the mix, and you have an even more enjoyable experience!<br /><br />This set comes with 6 bath bombs; Garden of Heaven, Yoga Strength, Revive, Vanilla Indulgence, Stress relief, and Energy Grapefruit.<br /><br />The bath bombs all come individually wrapped, in a very nice gift box. This means that they would be an excellent present for any lady in your life. Once you add them to the water, the immediately begin to fizz and turn your water a color (does not stain your skin). They all smell beautiful. My personal favorite is the Vanilla Indulgence scent!<br /><br />If you’re looking for a gift for a special lady (I suppose guys can use them as well!) in your life, or looking for a way to take your relaxation to the next level, I would totally recommend trying out these bath bombs by Calily!<br /><br />I received these bath bombs for free in order to test and leave my honest feedback.\nThe ultimate bath time experience!\nBeard Oil - Rousing Citrus Scent - Huge Man-Sized 4 oz Bottle - 100% Natural - Softens Your Beard and Stops Itching - Scent Women Love - Best Beard Oil And Conditioner For Men\nBEARDSMEN SPIRIT\n{'Scent': 'Citrus', 'Liquid Volume': '4 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'BEARDSMEN SPIRIT', 'Number of Items': '2', 'Package Dimensions': '4.1 x 2 x 1.8 inches; 8 Ounces'}\nThis is a very high quality beard oil that is sure to keep your facial hair looking its best! The citrus scent, while good, is more of a clove scent than a citrus in my opinion (as the product DOES contain clove), but it is not at all overpowering in any way, so it will not clash with your colognes or other fragrances that you wear. Just a small drop is enough to keep your facial hair looking hydrated, as there is truly nothing worse looking than a dry beard! This blend of beard oil contains many top quality oils such as: grape seed oil, orange oil, jojoba oil, and more! The 4 oz. bottle will last you a very long time. In fact, I have barely made a dent in mine! If you’re growing out your facial hair and want it to look its best, this beard oil is a great place to start!<br /><br />I was provided this beard oil for free in order to evaluate and provide my honest feedback through a review.\nGood quality oil; Smells more like clove than citrus though\nPoly Gel Nail Kit, opove Nail Builder Gel Extension Nail thickening Solution French Nail Art Equitment - 6 Colors 15ML\nopove\n{'Product Dimensions': '13.78 x 5.91 x 1.97 inches; 1.82 Pounds'}\nThis kit had everything We were looking for. The packaging is very nice and it includes everything you could possibly need to get salon quality nails. It includes the polish itself, the nails, an Emory board and more. I like the look of natural, subtle colors so I was happy with the choices it came with. The gel itself goes on very smooth and once I applied the nails, they felt strong and held up well. It’s definitely a game changer it’s nice that My girlfriend won’t be going back to the nail salon any time soon.\nThis kit has it all!\nYiJiaBa Under Eye Mask, Collagen Eye Mask, Eye Gel Pads, Green Tea Under Eye Patches, Firming Eye Mask, 30 Pairs Collagen Eye Patches for Eye Moisturizing, Dark Circles, Wrinkles, Fine Lines\nYiJiaBa\n['Imagine that when we saw a person, the first thing we saw was their eyes, which is why eyes are very important. Because it is great significance for your \"first impression\" to others.', \"Whether it's women or men - beautiful looks and energetic eyes look great, they are now as important as a clean skin or haircut.\", 'It decorates your eyes and enhances your features, making them a must-have beauty item.', 'WHY CHOOSE YiJiaBa EYE MASK?', '1.Safety- 100% natural ingredients, safe to use.', '2. Powerful Effect- Reduce dark circles, eliminate edema, prevent and delay aging.', '3. Soothes skin, moisturizes and whitening.', 'HOW TO USE?', '1. Clean your face.', '2. Apply the eye mask to the area where it is dry or has fine lines.', '3. Wait for 15 to 20 minutes until the essence is completely absorbed.', '4. Remove the eye mask and gently massage the skin around the eyes for 1 minute to help absorb.', 'Tips', '-Store in a cool, dry place, away from direct sunlight or near high temperatures.', '-There is a course of treatment for the eye mask, and it takes a long term process to get beautiful']\n{'Package Dimensions': '3.23 x 3.19 x 1.65 inches; 5.61 Ounces', 'UPC': '788481727226', 'Manufacturer': 'YiJiaBa'}\nThese under eye pads are an absolute treat for your eyes. I've been wearing them daily in the morning and I've noticed such an improvement in my eyes and the puffiness around them. I usually leave them on for 45 minutes each morning and when I take them off my eyes feel moisturized and rejuvenated.<br /><br />They come packed nicely in the container and comes with a little spoon that you can use to get a pair of masks out since they are saturated in a liquid.<br /><br />As a bonus tip, try keeping these in your refrigerator. It feels SO much better on your eyes and the cooling effect helps a ton with puffiness.\nA treat for your eyes\nBrazilian Body Wave Human Hair Lace Frontal Wigs 13x4x1 T Part Lace Front Wigs for Black Women Natural Hairline 18 inches\nAliglossy\n{'Hair Type': 'Wavy', 'Special Feature': 'Tangle Free', 'Brand': 'Aliglossy', 'Age Range (Description)': 'Adult', 'Cartoon Character': 'Wavy', 'Package Dimensions': '9.09 x 7.2 x 2.6 inches; 9.52 Ounces', 'UPC': '791715548177'}\nA really beautiful wavy wig for when you’re wanting to go for a casual or more formal look. The wig itself came very nicely packaged in a box and didn’t have any noticeable smells. In fact, mine smelled clean like shampoo. The hair feels very soft to the touch and looks very natural.<br /><br />The wig comes naturally with waves in it already and so far I haven’t noticed much shedding. The lace comes pre-plucked which makes the hairline look very natural. You wouldn’t know it’s a wig unless someone told you. All in all, it's a solid value and great for every day use.\nSoft with a very realistic hairline.\n(Pack of 30 Patch) PRRETI Real Vita Eye Zone Patch, Eye Mask for Heeling, Zipper Bag Type Package, Korean Skin Care Eye Treatment for Dryness & Dull Skin, Vita Complex-10 / Made in Korea, K Beauty (1 Pack of 30 Patch)\nPrreti\n{'Brand': 'Prreti', 'Product Benefits': 'Brightening', 'Scent': 'Citrus', 'Skin Type': 'Acne Prone', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.02 x 4.06 x 0.08 inches; 1.16 Ounces'}\nThese eye patches provide a nice level of hydration for the price, but there is some room for improvement. To begin, the patches are super thin. This makes getting them out of the package difficult, as you will likely find yourself grabbing more than you need at once. Also, they have a very light fragrance, but something a little more aromatic would be nice, maybe a citrus scent to help wake you up in the morning. For the price, it's hard to complain, but these could easily be a much better product with a few changes.\nNice hydration, but some room for improvement.",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Calily Genuine Handcrafted Sandalwood Comb for Men – Pocket Size Mustache and Beard Comb with Premium Synthetic Leather Case / Ultra-Smooth Combing; No Static or Snagging\nReview Date: 2016/08/05\nStore: Calily\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Calily', 'Hair Type': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.6 x 3.1 x 0.6 inches; 2.4 Ounces', 'UPC': '821079365117'}\nReview Text: If you’re looking for a compact, yet very stylish comb that can be used on your beard, mustache, and even hair, look no further than this handcrafted sandalwood comb by Calily. The comb itself is just over 3 inches, meaning it fits perfectly in any pocket, bag, glove compartment of a car, etc. If you are always on the run like I am, having a useful and reliable comb is key in making sure you look your best! I usually slick back my hair, and on especially hot days, it can come undone, leading to a rather homely look. Now the only thing I have to do is take the comb out of my pocket and I’m good to go! Although my beard isn’t anywhere near as long as I’d like it, It also works well there.<br /><br />The comb itself features a nice sandalwood scent that is both refreshing and calming. The wood on the comb feels very sturdy, and the teeth on the comb feel as if they will not break easily, like plastic combs do. The comb also comes with a very nice carrying case.<br /><br />Overall, if you need a reliable, stylish, and VERY compact comb, I would absolutely recommend this comb by Calily.<br /><br />I was sent this product for free in order to evaluate and leave my honest feedback.\nReview Title: The perfect comb for anybody who is always on the go!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Webat Bath Bombs Gift Set, Spa Bomb Fizzies & Ultra Lush Essential Oil - Dry Skin Moisturize, Fit for Bubble & Spa Bath, Handmade Birthday Gift Ideal for Lady, Women, Girlfriend, Men\nReview Date: 2016/08/15\nStore: Webat\nProduct Description: [\"Product Specification: 1. Quantity: 6* 2.5 oz 2. Set Size: 6.3 * 4.3 * 2 inch 3. Total Weight: 14.5 oz 4. Ingredients: Baking soda, citric acid, cellulose, sodium sulfate 5. Flavor: Purple-lavender, Blue-ocean, Red-rose, Pink-vanilla, Green-green Tea, Yellow-lemon ★Best Gift Set for All Individually wrapped and gift set, perfect for birthdays, Christmas gift, anniversaries, parties and wedding favours. It is a best gift set for lover, friend, lady, women, men and so on. ★Healthy Spa at Home Bath bombs features exfoliating, fine pores, anti-fatigue, bactericidal and itching functions. Fit for detoxifying minerals and moisturizers skin, it relaxs your body and relieves fatigue to get a deep sleep after the whole day's work. A enjoyable spa aromatherapy at your home. ★Note: For external use only. Keep out of eyes. If irritation occurs, stop to use immediately and consult with your doctor. ★Package included: 1* bath bombs set（6* bath bombs)\"]\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Webat', 'Scent': 'Lavender, Vanilla, Rose, Lemon', 'Age Range (Description)': 'Adult', 'Product Benefits': 'Moisturizing,Relaxing,Aromatherapy,Moisturize', 'Material Feature': 'No artificial flavors', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.52 x 5.2 x 2.8 inches; 1.85 Pounds', 'UPC': '600736170253', 'Manufacturer': 'Webat'}\nReview Text: It can be argued that taking a bath is one of the most relaxing experiences there is! Now add these bath bombs by Calily to the mix, and you have an even more enjoyable experience!<br /><br />This set comes with 6 bath bombs; Garden of Heaven, Yoga Strength, Revive, Vanilla Indulgence, Stress relief, and Energy Grapefruit.<br /><br />The bath bombs all come individually wrapped, in a very nice gift box. This means that they would be an excellent present for any lady in your life. Once you add them to the water, the immediately begin to fizz and turn your water a color (does not stain your skin). They all smell beautiful. My personal favorite is the Vanilla Indulgence scent!<br /><br />If you’re looking for a gift for a special lady (I suppose guys can use them as well!) in your life, or looking for a way to take your relaxation to the next level, I would totally recommend trying out these bath bombs by Calily!<br /><br />I received these bath bombs for free in order to test and leave my honest feedback.\nReview Title: The ultimate bath time experience!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Beard Oil - Rousing Citrus Scent - Huge Man-Sized 4 oz Bottle - 100% Natural - Softens Your Beard and Stops Itching - Scent Women Love - Best Beard Oil And Conditioner For Men\nReview Date: 2016/09/20\nStore: BEARDSMEN SPIRIT\nAverage Rating: 3.3\nProduct Details: {'Scent': 'Citrus', 'Liquid Volume': '4 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'BEARDSMEN SPIRIT', 'Number of Items': '2', 'Package Dimensions': '4.1 x 2 x 1.8 inches; 8 Ounces'}\nReview Text: This is a very high quality beard oil that is sure to keep your facial hair looking its best! The citrus scent, while good, is more of a clove scent than a citrus in my opinion (as the product DOES contain clove), but it is not at all overpowering in any way, so it will not clash with your colognes or other fragrances that you wear. Just a small drop is enough to keep your facial hair looking hydrated, as there is truly nothing worse looking than a dry beard! This blend of beard oil contains many top quality oils such as: grape seed oil, orange oil, jojoba oil, and more! The 4 oz. bottle will last you a very long time. In fact, I have barely made a dent in mine! If you’re growing out your facial hair and want it to look its best, this beard oil is a great place to start!<br /><br />I was provided this beard oil for free in order to evaluate and provide my honest feedback through a review.\nReview Title: Good quality oil; Smells more like clove than citrus though\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Poly Gel Nail Kit, opove Nail Builder Gel Extension Nail thickening Solution French Nail Art Equitment - 6 Colors 15ML\nReview Date: 2020/07/25\nStore: opove\nAverage Rating: 4.3\nProduct Details: {'Product Dimensions': '13.78 x 5.91 x 1.97 inches; 1.82 Pounds'}\nReview Text: This kit had everything We were looking for. The packaging is very nice and it includes everything you could possibly need to get salon quality nails. It includes the polish itself, the nails, an Emory board and more. I like the look of natural, subtle colors so I was happy with the choices it came with. The gel itself goes on very smooth and once I applied the nails, they felt strong and held up well. It’s definitely a game changer it’s nice that My girlfriend won’t be going back to the nail salon any time soon.\nReview Title: This kit has it all!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YiJiaBa Under Eye Mask, Collagen Eye Mask, Eye Gel Pads, Green Tea Under Eye Patches, Firming Eye Mask, 30 Pairs Collagen Eye Patches for Eye Moisturizing, Dark Circles, Wrinkles, Fine Lines\nReview Date: 2021/03/07\nStore: YiJiaBa\nProduct Description: ['Imagine that when we saw a person, the first thing we saw was their eyes, which is why eyes are very important. Because it is great significance for your \"first impression\" to others.', \"Whether it's women or men - beautiful looks and energetic eyes look great, they are now as important as a clean skin or haircut.\", 'It decorates your eyes and enhances your features, making them a must-have beauty item.', 'WHY CHOOSE YiJiaBa EYE MASK?', '1.Safety- 100% natural ingredients, safe to use.', '2. Powerful Effect- Reduce dark circles, eliminate edema, prevent and delay aging.', '3. Soothes skin, moisturizes and whitening.', 'HOW TO USE?', '1. Clean your face.', '2. Apply the eye mask to the area where it is dry or has fine lines.', '3. Wait for 15 to 20 minutes until the essence is completely absorbed.', '4. Remove the eye mask and gently massage the skin around the eyes for 1 minute to help absorb.', 'Tips', '-Store in a cool, dry place, away from direct sunlight or near high temperatures.', '-There is a course of treatment for the eye mask, and it takes a long term process to get beautiful']\nAverage Rating: 4.1\nProduct Details: {'Package Dimensions': '3.23 x 3.19 x 1.65 inches; 5.61 Ounces', 'UPC': '788481727226', 'Manufacturer': 'YiJiaBa'}\nReview Text: These under eye pads are an absolute treat for your eyes. I've been wearing them daily in the morning and I've noticed such an improvement in my eyes and the puffiness around them. I usually leave them on for 45 minutes each morning and when I take them off my eyes feel moisturized and rejuvenated.<br /><br />They come packed nicely in the container and comes with a little spoon that you can use to get a pair of masks out since they are saturated in a liquid.<br /><br />As a bonus tip, try keeping these in your refrigerator. It feels SO much better on your eyes and the cooling effect helps a ton with puffiness.\nReview Title: A treat for your eyes\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Brazilian Body Wave Human Hair Lace Frontal Wigs 13x4x1 T Part Lace Front Wigs for Black Women Natural Hairline 18 inches\nReview Date: 2021/03/19\nStore: Aliglossy\nAverage Rating: 2.9\nProduct Details: {'Hair Type': 'Wavy', 'Special Feature': 'Tangle Free', 'Brand': 'Aliglossy', 'Age Range (Description)': 'Adult', 'Cartoon Character': 'Wavy', 'Package Dimensions': '9.09 x 7.2 x 2.6 inches; 9.52 Ounces', 'UPC': '791715548177'}\nReview Text: A really beautiful wavy wig for when you’re wanting to go for a casual or more formal look. The wig itself came very nicely packaged in a box and didn’t have any noticeable smells. In fact, mine smelled clean like shampoo. The hair feels very soft to the touch and looks very natural.<br /><br />The wig comes naturally with waves in it already and so far I haven’t noticed much shedding. The lace comes pre-plucked which makes the hairline look very natural. You wouldn’t know it’s a wig unless someone told you. All in all, it's a solid value and great for every day use.\nReview Title: Soft with a very realistic hairline.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: (Pack of 30 Patch) PRRETI Real Vita Eye Zone Patch, Eye Mask for Heeling, Zipper Bag Type Package, Korean Skin Care Eye Treatment for Dryness & Dull Skin, Vita Complex-10 / Made in Korea, K Beauty (1 Pack of 30 Patch)\nReview Date: 2022/02/22\nStore: Prreti\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Prreti', 'Product Benefits': 'Brightening', 'Scent': 'Citrus', 'Skin Type': 'Acne Prone', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.02 x 4.06 x 0.08 inches; 1.16 Ounces'}\nReview Text: These eye patches provide a nice level of hydration for the price, but there is some room for improvement. To begin, the patches are super thin. This makes getting them out of the package difficult, as you will likely find yourself grabbing more than you need at once. Also, they have a very light fragrance, but something a little more aromatic would be nice, maybe a citrus scent to help wake you up in the morning. For the price, it's hard to complain, but these could easily be a much better product with a few changes.\nReview Title: Nice hydration, but some room for improvement.\nRating: 3.0\n--------------------------------------------------",
  "raw_response": "**Genuine Preferences and Trends:**\n\n- **Self-Care & Grooming:** The person consistently purchases grooming products, indicating an emphasis on personal appearance and self-care.\n  \n- **Travel-Friendly & Convenience:** Favoring compact, portable items such as combs and grooming tools showcases a lifestyle that values practicality for on-the-go use.\n\n- **Relaxation & Beauty Rituals:** A clear interest in relaxation is evident through purchases of bath bombs and eye masks, suggesting a preference for home self-care rituals.\n\n- **Natural Ingredients:** Choices reflect a preference for natural or organic products, particularly in grooming items like beard oil and skincare treatments, indicating health-conscious consumption.\n\n- **Gift-Giving:** Multiple purchases labeled as gift sets reveal an inclination towards gifting, preferably items that are versatile for different recipients.\n\n- **Quality over Quantity:** Ratings suggest a focus on quality, particularly for grooming items and aesthetic products, which may influence the selection based on effectiveness and user experience.\n\n- **Cosmetics & Personal Enhancement:** Interest in nail kits and wigs indicates a commitment to personal style and aesthetics, suggesting a creative approach to self-presentation. \n\nOverall, this individual possesses a strong preference for high-quality, practical, and relaxing self-care items that enhance appearance and well-being, alongside a thoughtful approach to gifting.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Perfect fit. Comfortable and just the right thickness.",
    "text": "This headband fits perfectly. I'm in North Florida, so it still gets relatively cold here. I walk every day, so the colder weather can make it a little difficult. This headband is just the right about of thickness for weather in the 40-50 degree area. It does a great job of keeping my ears warm without overheating. The sleek black design goes great with any outfit as well.",
    "images": [],
    "asin": "B082XH9SDN",
    "parent_asin": "B082XHLYZ5",
    "user_id": "AHVQR7U4PJ7VTG36DQMRSIHK7O6A",
    "timestamp": "2022-11-17 17:01:31.658000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "New Balance Unisex Grid Fleece Headband",
    "average_rating": 4.5,
    "rating_number": 25,
    "features": [
      "polyester,polyester blend",
      "What's Included: 1 New Balance Unisex Grid Fleece Headband, suitable for both men and women.",
      "Ultimate Comfort: Made with our 360 Stretch Technology and the perfect polyester blend, you can stay assured that it stays comfortable everytime you wear.",
      "Features: Made with 95% Polyester and 5% Spandex blend, it helps wick moisture and keep you dry during your activities. With New Balance's Grid Fleece technology and a reflective logo, it’s the perfect headband for any occasion.",
      "Perfect For: skiing, motorcycling, running, biking, trekking, mountain climbing, snowboarding, cycling and other outdoor activities, keep your ears warm in the winter.",
      "Washer and dryer safe! You can machine wash our products on cold with like colors. For a long lasting product, only use nonchlorine bleach when needed and can be dried in a dryer. We suggest hang drying our products to keep the first as new as possible."
    ],
    "description": [
      "New Balance Unisex Grid Fleece Headband is engineered with comfort and performance in mind. The unique 3D stretch fabric blend allows for total freedom of movement while moving moisture away from the skin quickly for fast drying. These performance accessories feature our New Balance dry and New Balance fresh technology and is your new go-to accessory for any activity."
    ],
    "price": 14.98,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/418sSOwnfsL._AC_US40_.jpg",
        "large": "https://m.media-amazon.com/images/I/418sSOwnfsL._AC_.jpg",
        "variant": "MAIN",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31wM+2UMYWL._AC_US40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31wM+2UMYWL._AC_.jpg",
        "variant": "PT01",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "New Balance #RoadToNYC",
        "url": "https://www.amazon.com/vdp/f41019715f88493e8c8090de9fd707b1?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "New Balance",
    "categories": [],
    "details": {
      "Item Package Dimensions L x W x H": "12.01 x 4.29 x 0.55 inches",
      "Package Weight": "0.04 Kilograms",
      "Brand Name": "New Balance",
      "Color": "Black",
      "Material": "Polyester",
      "Number of Items": "1",
      "Manufacturer": "Terramar Sports",
      "Size": "One Size",
      "Sport Type": "Cycling, Skiing, Climbing, Running",
      "Date First Available": "December 18, 2019",
      "Age Range (Description)": "Adult",
      "Fabric Type": "polyester,polyester blend"
    },
    "bought_together": null
  }
}