{
  "user_id": "AEGKJTQWHGBIOTO34OB3GKIGCN7A",
  "summary": "=== Purchase Information ===\nProduct Title: Natural Solution Himalayan Pink Salt Body Scrub with Organic Marula Essential Oil, Moisturizes and Nourishes Face & Skin - 12.3 Oz\nReview Date: 2019/10/09\nStore: Natural Solution\nProduct Description: ['Natural Solution Organic Marula Oil Body Scrub Exfoliate and nourish your skin with this luxurious Natural Solution body scrub made with organic marula oil. Marula oil is a natural oil & is known for its ability to moisturize and protect the skin, as well as to reduce the appearance of wrinkles and fine lines. This body scrub is also made with Himalayan pink salt, which is a natural exfoliator that helps to remove dead skin cells and leave your skin feeling smooth and soft. The scrub is gentle enough for daily use, and it is perfect for all skin types. Usage: Apply a generous amount of scrub to wet skin. Massage in circular motions for 2-3 minutes. Rinse with water. Use 2 times per week for best results. Caution: Avoid contact with eyes. If contact occurs, rinse immediately with water. Keep out of reach of children. Store in a cool, dry place. Benefits: 1- Exfoliates and removes dead skin cells 2- Moisturizes and nourishes the skin 3- Protects the skin from free radicals 4- Leaves skin feeling smooth and soft 5-Suitable for all skin types']\nAverage Rating: 3.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.75 x 3.75 x 3.6 inches; 12.35 Ounces', 'Item model number': '8246E', 'UPC': '818581019775', 'Manufacturer': 'Natural Solution'}\nReview Text: Not great for exfoliating, but a pleasant experience.  All the salt in this product is less than I would’ve expected and very fine grained so the exfoliation experience isn’t what I expected. What I did like about it was it was not as oily as many of the products that I’ve had in the past. It did leave my skin feeling soft and refreshed. And I do think the price is very reasonable for the quality of the ingredients that are in it. I took one star off for the misrepresentation of the exfoliation product.\nReview Title: Not great for exfoliating, but a pleasant experience\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2oz / 60ml Glass Spray Bottles for DIY Refill, Essential Oils, Pillow Mists,Fine Mist Spray -3Packs Amber Color\nReview Date: 2020/07/31\nStore: EagleKing\nAverage Rating: 4.5\nProduct Details: {'Brand': 'EagleKing', 'Material': 'Glass', 'Capacity': '2 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray', 'Package Dimensions': '6.3 x 6.1 x 1.7 inches; 8.78 Ounces'}\nReview Text: Sturdy components, good quality glass bottle, sprays a perfect super fine mist.  No complaint at all about the quality, the price...a bit steep even for this quality but I don't find it obscene, hence only one star removed.\nReview Title: Good quality\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Argan Magic 100% Pure Argan Oil – Moisturizing Oil that Infuses Skin with Enriched Hydration | Leaves Skin Restored & Refreshed | Non-Greasy | Rich in Vitamin E | Made in USA | Cruelty Free (2 oz)\nReview Date: 2020/08/04\nStore: Argan Magic\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Argan Magic', 'Item Form': 'Oil', 'Active Ingredients': 'Vitamin e', 'Unit Count': '2 Fl Oz', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.2 x 1.1 x 1.1 inches; 2 Ounces', 'UPC': '605923474046'}\nReview Text: I don't think there is a part of your body that wouldn't benefit from this oil.  I use it on my hair, and mix a bit in my conditioner.  Great for the skin and especially the face.  I also use it for dried cuticles.  Perfect size.\nReview Title: Love this oil!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pure Active Body Cleansing Shower Wipes, 40 Individually Wrapped Reduced Price Personal Hygiene Body Wipes for Women and Men, XL, Extra Moist for After Gym Travel Camping Outdoors Sports\nReview Date: 2020/08/22\nStore: Pure Active\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Pure Active', 'Skin Type': 'Sensitive', 'Unit Count': '40.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8.39 x 6.81 x 6.57 inches; 2.55 Pounds', 'UPC': '613497909697'}\nReview Text: The Covid answer to post gym workouts!  If I were a gym owner,  I would keep these well in stock! This is a nice big cloth, used to clean up after a workout. It is not dripping wet but it is adequately moist. There is a slight clean scent to it, but nothing perfumy or anything that would fight with a perfume. It did a nice job, however other than doing may be under arms face and chest one of these towels would not be enough if you really wanted to clean yourself up.  These would also be great during camping trips. Or even long car trips when you like to refresh. For what it is, I don’t think the price is unreasonable. If I were a gym owner I would give each patron two of these towels when they arrived. I thought the product was good, the towel was really soft and enjoyable to use.  The towel itself is also as strong as it is soft. I will make sure to have a couple of these in my purse at all times.\nReview Title: The Covid answer to post gym workouts!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Empty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nReview Date: 2020/08/22\nStore: Cherry\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nReview Text: Nice quality but overpriced.  The bottle is quality glass, the sprayer is sturdy with multiple functions, you can spray or stream. It even has nice chalk type labels included. They are perfect if you want to make your own natural cleaning supplies, and the dark amber color will protect your essential oil’s, but I feel that the price is way out of line. I’m not debating the quality, the quality is there. The price… Not.\nReview Title: Nice quality but overpriced\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Pack Portable travel bottles-30ml Flip Cap Reusable Bottles Keychain Carriers for Travel Outdoor Camping Supplies, Metal Buckle Include, Set of 6\nReview Date: 2020/12/29\nStore: SKYCY\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '8.03 x 5.2 x 2.36 inches; 7.05 Ounces', 'UPC': '653552483120'}\nReview Text: I like making my own hand lotions and sanitizers and these little keychain lotion bottle and holders are just adorable for those projects. What’s really nice about them is they make a nice gift for a guy and a lot of these types of holders are way too feminine to give to a guy as a gift. Any patriot would certainly love it.  The price? I found it to be fair for the novelty that it is.\nReview Title: Adorable for DYI gifts\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 36 Pack 2oz Clear Plastic Empty Bottles Travel Containers with Flip Cap for Hand Sanitizer, Cosmetic, Shampoo, Lotion, Liquid Body Soap, Cream, Toner, BPA-free\nReview Date: 2021/01/10\nStore: JIUZHU\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '12.09 x 10.28 x 3.07 inches; 13.12 Ounces', 'UPC': '667322945817'}\nReview Text: Great for homemade projects!  I would’ve like them to be a little bit more flexible for pushing thicker lotions out. But if you’re going to be putting liquids and it won’t be an issue. Well packaged. I felt it was a decent value.\nReview Title: Great for homemade projects!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Empty Amber Glass Spray Bottles - (4 Pack) 16 oz with Labels Refillable Container for Essential Oils, Cleaning Solutions, Cleaning Products, Hair, Plant Mister, Daily Shower, Gardening or Aromatherapy\nReview Date: 2021/03/20\nStore: AYL\nAverage Rating: 4.5\nProduct Details: {'Brand': 'AYL', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '4', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.88 x 7.6 x 7.17 inches; 2.98 Pounds', 'Item model number': 'EmptyAmberGlassSprayBottles 4 Pack', 'UPC': '860005177202'}\nReview Text: These well made bottles are big and perfect for cleaning solutions.  The sprayer works well and I liked the addition of the metal funnel and the labels.  That being said, $5 each for a glass spray pump bottle is pricey...they back it up with quality, but if your buying 4 of them I think the price should be lower.\nReview Title: Nice quality\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 8 PCS 40ML Mini Spray Bottles, FANDAMEI Fine Mist Plastic Spray Bottles, Empty Refillable Clear Atomizer for Cleaning, Travel, Essential Oils, Perfume, Makeup Liquids. Travel Size, Pink & Blue\nReview Date: 2021/03/20\nStore: Fandamei\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Fandamei', 'Material': 'Plastic', 'Capacity': '40 Milliliters', 'Number of Items': '8', 'Special Feature': 'Mist Spray', 'Package Dimensions': '8.46 x 5.79 x 1.42 inches; 5.93 Ounces'}\nReview Text: I used these for a homemade essential oil facial spray.  The mist is really fine which I liked.  It has a double cap which is nice as it stays secure in your purse.  Well constructed and just cute.  I felt for a buck a bottle it was a good value.\nReview Title: Great for DYI projects\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ZMCARE 12-Pack, Eco-Friendly 28-410 (28 mm) Lotion Pump for Cosmetics, Hand Wash, Hand Sanitizer, Soap Dispenser Containers — Non-Slip Design — Fits Most 1 liter/33.8 Oz Bottles.\nReview Date: 2021/04/03\nStore: ZMCARE\nAverage Rating: 3.3\nProduct Details: {'Package Dimensions': '9.06 x 4.84 x 2.28 inches; 6.49 Ounces', 'UPC': '850013484591'}\nReview Text: These pumps are good quality, solid construction meant for larger bottles to pay attention to the type of bottle it fits or you will be unhappy.  The same company sells a smaller pump, set of two for $6 which I found way overpriced so I was surprised to find these pumps so reasonable and a good value.\nReview Title: Great value!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YARELI Organic Castor Oil for Eyelashes, Eyebrows, Hair, Skin and Body - Cold Pressed and Unrefined, 12oz\nReview Date: 2021/04/21\nStore: YARELI\nAverage Rating: 4.4\nProduct Details: {'Product Benefits': 'Moisturizing', 'Scent': 'Fragrance free', 'Liquid Volume': '12 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'YARELI', 'Package Dimensions': '10.2 x 2.36 x 2.2 inches; 12 Ounces'}\nReview Text: Great price for a quality product!  Are use a lot of castor oil in lotions and creams that I formulate myself. I like to use the best quality caster oil I can find and I find this product compatible with brands that I spend the same amount on for a 4 ounce bottle. So I find this to be an amazing value.\nReview Title: Great price for a quality product!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tanshine Airless Pump Bottle 6Pcs 30ml/1.01oz Empty Lotion Bottle Vacuum Lotion Bottle Tiny Travel Lotion Bottles Easy to Carry Out Vacuum Pump Lotion Bottles\nReview Date: 2021/07/01\nStore: TANSHINE\nAverage Rating: 4.7\nProduct Details: {'Package Dimensions': '10.67 x 8.5 x 1.93 inches; 8.47 Ounces'}\nReview Text: The mist is fine and the pump works well, make sure not to fill it all the way as when you prime the pump you need a little wiggle room.  The quality is not great, and this company makes a beautiful set of six with much better materials and gold accenting for two dollars more...spend the money on the other set.  The airless pump will keep ingredients from oxidizing too quickly.  Not a bad set, but since I've used the other one...I'm spoiled, so this one is just okay.\nReview Title: Just okay\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Claireceuticals Sweet Almond Oil for Hair, Face & Skin - Organic Almond Oil for Skin - Pure Almond Oil Moisturizer for Dry Skin - Facial Moisturizer for Women - Ideal Dandruff Remover - 1.69 Fl Oz\nReview Date: 2021/07/06\nStore: CLAIRECEUTICALS\nAverage Rating: 4.1\nProduct Details: {'Brand': 'CLAIRECEUTICALS', 'Item Form': 'Oil', 'Unit Count': '1.7 Fl Oz', 'Skin Type': 'All', 'Item Volume': '100 Milliliters'}\nReview Text: This is a nice quality oil, it absorbs well and leaves the skin soft.  At the time of this review there was no price listed, but I have to wonder...with good quality almond oil, even organic available in 16 ounce bottles for well under $20, what price will they put on this tiny bottle with less than 2 ounces.\nReview Title: Nice quality oil but...\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: anelor 56PCS Kids Temporary Tattoos,Glitter Styles Party Tattoo Stickers,Tattoos Decor for Birthday Beach and Donut Party,Party Favors for Girls and Boys, Medium (ane-0526-KTT2)\nReview Date: 2021/09/14\nStore: anelor\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Anelor', 'Pattern': 'Hearts', 'Number of Pieces': '56', 'Age Range (Description)': 'Adult', 'Product Dimensions': '8.25 x 6 x 0.1 inches; 0.65 Ounces', 'Item model number': 'ane-0526-KTT2'}\nReview Text: A different kind of treat for Halloween!  I don’t do candy anymore for Halloween but I try to find fun things for the kids and this was perfect! Fun, kid appropriate temporary tattoos with tons of different fun designs! Easy to put on, easy to takeoff. I felt the price was reasonable.\nReview Title: A different kind of treat for Halloween!\nRating: 5.0\n--------------------------------------------------",
  "reference": "Natural Solution Himalayan Pink Salt Body Scrub with Organic Marula Essential Oil, Moisturizes and Nourishes Face & Skin - 12.3 Oz\nNatural Solution\n['Natural Solution Organic Marula Oil Body Scrub Exfoliate and nourish your skin with this luxurious Natural Solution body scrub made with organic marula oil. Marula oil is a natural oil & is known for its ability to moisturize and protect the skin, as well as to reduce the appearance of wrinkles and fine lines. This body scrub is also made with Himalayan pink salt, which is a natural exfoliator that helps to remove dead skin cells and leave your skin feeling smooth and soft. The scrub is gentle enough for daily use, and it is perfect for all skin types. Usage: Apply a generous amount of scrub to wet skin. Massage in circular motions for 2-3 minutes. Rinse with water. Use 2 times per week for best results. Caution: Avoid contact with eyes. If contact occurs, rinse immediately with water. Keep out of reach of children. Store in a cool, dry place. Benefits: 1- Exfoliates and removes dead skin cells 2- Moisturizes and nourishes the skin 3- Protects the skin from free radicals 4- Leaves skin feeling smooth and soft 5-Suitable for all skin types']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.75 x 3.75 x 3.6 inches; 12.35 Ounces', 'Item model number': '8246E', 'UPC': '818581019775', 'Manufacturer': 'Natural Solution'}\nNot great for exfoliating, but a pleasant experience.  All the salt in this product is less than I would’ve expected and very fine grained so the exfoliation experience isn’t what I expected. What I did like about it was it was not as oily as many of the products that I’ve had in the past. It did leave my skin feeling soft and refreshed. And I do think the price is very reasonable for the quality of the ingredients that are in it. I took one star off for the misrepresentation of the exfoliation product.\nNot great for exfoliating, but a pleasant experience\n2oz / 60ml Glass Spray Bottles for DIY Refill, Essential Oils, Pillow Mists,Fine Mist Spray -3Packs Amber Color\nEagleKing\n{'Brand': 'EagleKing', 'Material': 'Glass', 'Capacity': '2 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray', 'Package Dimensions': '6.3 x 6.1 x 1.7 inches; 8.78 Ounces'}\nSturdy components, good quality glass bottle, sprays a perfect super fine mist.  No complaint at all about the quality, the price...a bit steep even for this quality but I don't find it obscene, hence only one star removed.\nGood quality\nArgan Magic 100% Pure Argan Oil – Moisturizing Oil that Infuses Skin with Enriched Hydration | Leaves Skin Restored & Refreshed | Non-Greasy | Rich in Vitamin E | Made in USA | Cruelty Free (2 oz)\nArgan Magic\n{'Brand': 'Argan Magic', 'Item Form': 'Oil', 'Active Ingredients': 'Vitamin e', 'Unit Count': '2 Fl Oz', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.2 x 1.1 x 1.1 inches; 2 Ounces', 'UPC': '605923474046'}\nI don't think there is a part of your body that wouldn't benefit from this oil.  I use it on my hair, and mix a bit in my conditioner.  Great for the skin and especially the face.  I also use it for dried cuticles.  Perfect size.\nLove this oil!\nPure Active Body Cleansing Shower Wipes, 40 Individually Wrapped Reduced Price Personal Hygiene Body Wipes for Women and Men, XL, Extra Moist for After Gym Travel Camping Outdoors Sports\nPure Active\n{'Brand': 'Pure Active', 'Skin Type': 'Sensitive', 'Unit Count': '40.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8.39 x 6.81 x 6.57 inches; 2.55 Pounds', 'UPC': '613497909697'}\nThe Covid answer to post gym workouts!  If I were a gym owner,  I would keep these well in stock! This is a nice big cloth, used to clean up after a workout. It is not dripping wet but it is adequately moist. There is a slight clean scent to it, but nothing perfumy or anything that would fight with a perfume. It did a nice job, however other than doing may be under arms face and chest one of these towels would not be enough if you really wanted to clean yourself up.  These would also be great during camping trips. Or even long car trips when you like to refresh. For what it is, I don’t think the price is unreasonable. If I were a gym owner I would give each patron two of these towels when they arrived. I thought the product was good, the towel was really soft and enjoyable to use.  The towel itself is also as strong as it is soft. I will make sure to have a couple of these in my purse at all times.\nThe Covid answer to post gym workouts!\nEmpty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nNice quality but overpriced.  The bottle is quality glass, the sprayer is sturdy with multiple functions, you can spray or stream. It even has nice chalk type labels included. They are perfect if you want to make your own natural cleaning supplies, and the dark amber color will protect your essential oil’s, but I feel that the price is way out of line. I’m not debating the quality, the quality is there. The price… Not.\nNice quality but overpriced\n6 Pack Portable travel bottles-30ml Flip Cap Reusable Bottles Keychain Carriers for Travel Outdoor Camping Supplies, Metal Buckle Include, Set of 6\nSKYCY\n{'Package Dimensions': '8.03 x 5.2 x 2.36 inches; 7.05 Ounces', 'UPC': '653552483120'}\nI like making my own hand lotions and sanitizers and these little keychain lotion bottle and holders are just adorable for those projects. What’s really nice about them is they make a nice gift for a guy and a lot of these types of holders are way too feminine to give to a guy as a gift. Any patriot would certainly love it.  The price? I found it to be fair for the novelty that it is.\nAdorable for DYI gifts\n36 Pack 2oz Clear Plastic Empty Bottles Travel Containers with Flip Cap for Hand Sanitizer, Cosmetic, Shampoo, Lotion, Liquid Body Soap, Cream, Toner, BPA-free\nJIUZHU\n{'Package Dimensions': '12.09 x 10.28 x 3.07 inches; 13.12 Ounces', 'UPC': '667322945817'}\nGreat for homemade projects!  I would’ve like them to be a little bit more flexible for pushing thicker lotions out. But if you’re going to be putting liquids and it won’t be an issue. Well packaged. I felt it was a decent value.\nGreat for homemade projects!\nEmpty Amber Glass Spray Bottles - (4 Pack) 16 oz with Labels Refillable Container for Essential Oils, Cleaning Solutions, Cleaning Products, Hair, Plant Mister, Daily Shower, Gardening or Aromatherapy\nAYL\n{'Brand': 'AYL', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '4', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.88 x 7.6 x 7.17 inches; 2.98 Pounds', 'Item model number': 'EmptyAmberGlassSprayBottles 4 Pack', 'UPC': '860005177202'}\nThese well made bottles are big and perfect for cleaning solutions.  The sprayer works well and I liked the addition of the metal funnel and the labels.  That being said, $5 each for a glass spray pump bottle is pricey...they back it up with quality, but if your buying 4 of them I think the price should be lower.\nNice quality\n8 PCS 40ML Mini Spray Bottles, FANDAMEI Fine Mist Plastic Spray Bottles, Empty Refillable Clear Atomizer for Cleaning, Travel, Essential Oils, Perfume, Makeup Liquids. Travel Size, Pink & Blue\nFandamei\n{'Brand': 'Fandamei', 'Material': 'Plastic', 'Capacity': '40 Milliliters', 'Number of Items': '8', 'Special Feature': 'Mist Spray', 'Package Dimensions': '8.46 x 5.79 x 1.42 inches; 5.93 Ounces'}\nI used these for a homemade essential oil facial spray.  The mist is really fine which I liked.  It has a double cap which is nice as it stays secure in your purse.  Well constructed and just cute.  I felt for a buck a bottle it was a good value.\nGreat for DYI projects\nZMCARE 12-Pack, Eco-Friendly 28-410 (28 mm) Lotion Pump for Cosmetics, Hand Wash, Hand Sanitizer, Soap Dispenser Containers — Non-Slip Design — Fits Most 1 liter/33.8 Oz Bottles.\nZMCARE\n{'Package Dimensions': '9.06 x 4.84 x 2.28 inches; 6.49 Ounces', 'UPC': '850013484591'}\nThese pumps are good quality, solid construction meant for larger bottles to pay attention to the type of bottle it fits or you will be unhappy.  The same company sells a smaller pump, set of two for $6 which I found way overpriced so I was surprised to find these pumps so reasonable and a good value.\nGreat value!\nYARELI Organic Castor Oil for Eyelashes, Eyebrows, Hair, Skin and Body - Cold Pressed and Unrefined, 12oz\nYARELI\n{'Product Benefits': 'Moisturizing', 'Scent': 'Fragrance free', 'Liquid Volume': '12 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'YARELI', 'Package Dimensions': '10.2 x 2.36 x 2.2 inches; 12 Ounces'}\nGreat price for a quality product!  Are use a lot of castor oil in lotions and creams that I formulate myself. I like to use the best quality caster oil I can find and I find this product compatible with brands that I spend the same amount on for a 4 ounce bottle. So I find this to be an amazing value.\nGreat price for a quality product!\nTanshine Airless Pump Bottle 6Pcs 30ml/1.01oz Empty Lotion Bottle Vacuum Lotion Bottle Tiny Travel Lotion Bottles Easy to Carry Out Vacuum Pump Lotion Bottles\nTANSHINE\n{'Package Dimensions': '10.67 x 8.5 x 1.93 inches; 8.47 Ounces'}\nThe mist is fine and the pump works well, make sure not to fill it all the way as when you prime the pump you need a little wiggle room.  The quality is not great, and this company makes a beautiful set of six with much better materials and gold accenting for two dollars more...spend the money on the other set.  The airless pump will keep ingredients from oxidizing too quickly.  Not a bad set, but since I've used the other one...I'm spoiled, so this one is just okay.\nJust okay\nClaireceuticals Sweet Almond Oil for Hair, Face & Skin - Organic Almond Oil for Skin - Pure Almond Oil Moisturizer for Dry Skin - Facial Moisturizer for Women - Ideal Dandruff Remover - 1.69 Fl Oz\nCLAIRECEUTICALS\n{'Brand': 'CLAIRECEUTICALS', 'Item Form': 'Oil', 'Unit Count': '1.7 Fl Oz', 'Skin Type': 'All', 'Item Volume': '100 Milliliters'}\nThis is a nice quality oil, it absorbs well and leaves the skin soft.  At the time of this review there was no price listed, but I have to wonder...with good quality almond oil, even organic available in 16 ounce bottles for well under $20, what price will they put on this tiny bottle with less than 2 ounces.\nNice quality oil but...\nanelor 56PCS Kids Temporary Tattoos,Glitter Styles Party Tattoo Stickers,Tattoos Decor for Birthday Beach and Donut Party,Party Favors for Girls and Boys, Medium (ane-0526-KTT2)\nanelor\n{'Brand': 'Anelor', 'Pattern': 'Hearts', 'Number of Pieces': '56', 'Age Range (Description)': 'Adult', 'Product Dimensions': '8.25 x 6 x 0.1 inches; 0.65 Ounces', 'Item model number': 'ane-0526-KTT2'}\nA different kind of treat for Halloween!  I don’t do candy anymore for Halloween but I try to find fun things for the kids and this was perfect! Fun, kid appropriate temporary tattoos with tons of different fun designs! Easy to put on, easy to takeoff. I felt the price was reasonable.\nA different kind of treat for Halloween!",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Natural Solution Himalayan Pink Salt Body Scrub with Organic Marula Essential Oil, Moisturizes and Nourishes Face & Skin - 12.3 Oz\nReview Date: 2019/10/09\nStore: Natural Solution\nProduct Description: ['Natural Solution Organic Marula Oil Body Scrub Exfoliate and nourish your skin with this luxurious Natural Solution body scrub made with organic marula oil. Marula oil is a natural oil & is known for its ability to moisturize and protect the skin, as well as to reduce the appearance of wrinkles and fine lines. This body scrub is also made with Himalayan pink salt, which is a natural exfoliator that helps to remove dead skin cells and leave your skin feeling smooth and soft. The scrub is gentle enough for daily use, and it is perfect for all skin types. Usage: Apply a generous amount of scrub to wet skin. Massage in circular motions for 2-3 minutes. Rinse with water. Use 2 times per week for best results. Caution: Avoid contact with eyes. If contact occurs, rinse immediately with water. Keep out of reach of children. Store in a cool, dry place. Benefits: 1- Exfoliates and removes dead skin cells 2- Moisturizes and nourishes the skin 3- Protects the skin from free radicals 4- Leaves skin feeling smooth and soft 5-Suitable for all skin types']\nAverage Rating: 3.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.75 x 3.75 x 3.6 inches; 12.35 Ounces', 'Item model number': '8246E', 'UPC': '818581019775', 'Manufacturer': 'Natural Solution'}\nReview Text: Not great for exfoliating, but a pleasant experience.  All the salt in this product is less than I would’ve expected and very fine grained so the exfoliation experience isn’t what I expected. What I did like about it was it was not as oily as many of the products that I’ve had in the past. It did leave my skin feeling soft and refreshed. And I do think the price is very reasonable for the quality of the ingredients that are in it. I took one star off for the misrepresentation of the exfoliation product.\nReview Title: Not great for exfoliating, but a pleasant experience\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2oz / 60ml Glass Spray Bottles for DIY Refill, Essential Oils, Pillow Mists,Fine Mist Spray -3Packs Amber Color\nReview Date: 2020/07/31\nStore: EagleKing\nAverage Rating: 4.5\nProduct Details: {'Brand': 'EagleKing', 'Material': 'Glass', 'Capacity': '2 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray', 'Package Dimensions': '6.3 x 6.1 x 1.7 inches; 8.78 Ounces'}\nReview Text: Sturdy components, good quality glass bottle, sprays a perfect super fine mist.  No complaint at all about the quality, the price...a bit steep even for this quality but I don't find it obscene, hence only one star removed.\nReview Title: Good quality\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Argan Magic 100% Pure Argan Oil – Moisturizing Oil that Infuses Skin with Enriched Hydration | Leaves Skin Restored & Refreshed | Non-Greasy | Rich in Vitamin E | Made in USA | Cruelty Free (2 oz)\nReview Date: 2020/08/04\nStore: Argan Magic\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Argan Magic', 'Item Form': 'Oil', 'Active Ingredients': 'Vitamin e', 'Unit Count': '2 Fl Oz', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.2 x 1.1 x 1.1 inches; 2 Ounces', 'UPC': '605923474046'}\nReview Text: I don't think there is a part of your body that wouldn't benefit from this oil.  I use it on my hair, and mix a bit in my conditioner.  Great for the skin and especially the face.  I also use it for dried cuticles.  Perfect size.\nReview Title: Love this oil!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pure Active Body Cleansing Shower Wipes, 40 Individually Wrapped Reduced Price Personal Hygiene Body Wipes for Women and Men, XL, Extra Moist for After Gym Travel Camping Outdoors Sports\nReview Date: 2020/08/22\nStore: Pure Active\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Pure Active', 'Skin Type': 'Sensitive', 'Unit Count': '40.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8.39 x 6.81 x 6.57 inches; 2.55 Pounds', 'UPC': '613497909697'}\nReview Text: The Covid answer to post gym workouts!  If I were a gym owner,  I would keep these well in stock! This is a nice big cloth, used to clean up after a workout. It is not dripping wet but it is adequately moist. There is a slight clean scent to it, but nothing perfumy or anything that would fight with a perfume. It did a nice job, however other than doing may be under arms face and chest one of these towels would not be enough if you really wanted to clean yourself up.  These would also be great during camping trips. Or even long car trips when you like to refresh. For what it is, I don’t think the price is unreasonable. If I were a gym owner I would give each patron two of these towels when they arrived. I thought the product was good, the towel was really soft and enjoyable to use.  The towel itself is also as strong as it is soft. I will make sure to have a couple of these in my purse at all times.\nReview Title: The Covid answer to post gym workouts!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Empty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nReview Date: 2020/08/22\nStore: Cherry\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nReview Text: Nice quality but overpriced.  The bottle is quality glass, the sprayer is sturdy with multiple functions, you can spray or stream. It even has nice chalk type labels included. They are perfect if you want to make your own natural cleaning supplies, and the dark amber color will protect your essential oil’s, but I feel that the price is way out of line. I’m not debating the quality, the quality is there. The price… Not.\nReview Title: Nice quality but overpriced\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 6 Pack Portable travel bottles-30ml Flip Cap Reusable Bottles Keychain Carriers for Travel Outdoor Camping Supplies, Metal Buckle Include, Set of 6\nReview Date: 2020/12/29\nStore: SKYCY\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '8.03 x 5.2 x 2.36 inches; 7.05 Ounces', 'UPC': '653552483120'}\nReview Text: I like making my own hand lotions and sanitizers and these little keychain lotion bottle and holders are just adorable for those projects. What’s really nice about them is they make a nice gift for a guy and a lot of these types of holders are way too feminine to give to a guy as a gift. Any patriot would certainly love it.  The price? I found it to be fair for the novelty that it is.\nReview Title: Adorable for DYI gifts\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 36 Pack 2oz Clear Plastic Empty Bottles Travel Containers with Flip Cap for Hand Sanitizer, Cosmetic, Shampoo, Lotion, Liquid Body Soap, Cream, Toner, BPA-free\nReview Date: 2021/01/10\nStore: JIUZHU\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '12.09 x 10.28 x 3.07 inches; 13.12 Ounces', 'UPC': '667322945817'}\nReview Text: Great for homemade projects!  I would’ve like them to be a little bit more flexible for pushing thicker lotions out. But if you’re going to be putting liquids and it won’t be an issue. Well packaged. I felt it was a decent value.\nReview Title: Great for homemade projects!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Empty Amber Glass Spray Bottles - (4 Pack) 16 oz with Labels Refillable Container for Essential Oils, Cleaning Solutions, Cleaning Products, Hair, Plant Mister, Daily Shower, Gardening or Aromatherapy\nReview Date: 2021/03/20\nStore: AYL\nAverage Rating: 4.5\nProduct Details: {'Brand': 'AYL', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '4', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.88 x 7.6 x 7.17 inches; 2.98 Pounds', 'Item model number': 'EmptyAmberGlassSprayBottles 4 Pack', 'UPC': '860005177202'}\nReview Text: These well made bottles are big and perfect for cleaning solutions.  The sprayer works well and I liked the addition of the metal funnel and the labels.  That being said, $5 each for a glass spray pump bottle is pricey...they back it up with quality, but if your buying 4 of them I think the price should be lower.\nReview Title: Nice quality\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 8 PCS 40ML Mini Spray Bottles, FANDAMEI Fine Mist Plastic Spray Bottles, Empty Refillable Clear Atomizer for Cleaning, Travel, Essential Oils, Perfume, Makeup Liquids. Travel Size, Pink & Blue\nReview Date: 2021/03/20\nStore: Fandamei\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Fandamei', 'Material': 'Plastic', 'Capacity': '40 Milliliters', 'Number of Items': '8', 'Special Feature': 'Mist Spray', 'Package Dimensions': '8.46 x 5.79 x 1.42 inches; 5.93 Ounces'}\nReview Text: I used these for a homemade essential oil facial spray.  The mist is really fine which I liked.  It has a double cap which is nice as it stays secure in your purse.  Well constructed and just cute.  I felt for a buck a bottle it was a good value.\nReview Title: Great for DYI projects\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ZMCARE 12-Pack, Eco-Friendly 28-410 (28 mm) Lotion Pump for Cosmetics, Hand Wash, Hand Sanitizer, Soap Dispenser Containers — Non-Slip Design — Fits Most 1 liter/33.8 Oz Bottles.\nReview Date: 2021/04/03\nStore: ZMCARE\nAverage Rating: 3.3\nProduct Details: {'Package Dimensions': '9.06 x 4.84 x 2.28 inches; 6.49 Ounces', 'UPC': '850013484591'}\nReview Text: These pumps are good quality, solid construction meant for larger bottles to pay attention to the type of bottle it fits or you will be unhappy.  The same company sells a smaller pump, set of two for $6 which I found way overpriced so I was surprised to find these pumps so reasonable and a good value.\nReview Title: Great value!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YARELI Organic Castor Oil for Eyelashes, Eyebrows, Hair, Skin and Body - Cold Pressed and Unrefined, 12oz\nReview Date: 2021/04/21\nStore: YARELI\nAverage Rating: 4.4\nProduct Details: {'Product Benefits': 'Moisturizing', 'Scent': 'Fragrance free', 'Liquid Volume': '12 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'YARELI', 'Package Dimensions': '10.2 x 2.36 x 2.2 inches; 12 Ounces'}\nReview Text: Great price for a quality product!  Are use a lot of castor oil in lotions and creams that I formulate myself. I like to use the best quality caster oil I can find and I find this product compatible with brands that I spend the same amount on for a 4 ounce bottle. So I find this to be an amazing value.\nReview Title: Great price for a quality product!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tanshine Airless Pump Bottle 6Pcs 30ml/1.01oz Empty Lotion Bottle Vacuum Lotion Bottle Tiny Travel Lotion Bottles Easy to Carry Out Vacuum Pump Lotion Bottles\nReview Date: 2021/07/01\nStore: TANSHINE\nAverage Rating: 4.7\nProduct Details: {'Package Dimensions': '10.67 x 8.5 x 1.93 inches; 8.47 Ounces'}\nReview Text: The mist is fine and the pump works well, make sure not to fill it all the way as when you prime the pump you need a little wiggle room.  The quality is not great, and this company makes a beautiful set of six with much better materials and gold accenting for two dollars more...spend the money on the other set.  The airless pump will keep ingredients from oxidizing too quickly.  Not a bad set, but since I've used the other one...I'm spoiled, so this one is just okay.\nReview Title: Just okay\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Claireceuticals Sweet Almond Oil for Hair, Face & Skin - Organic Almond Oil for Skin - Pure Almond Oil Moisturizer for Dry Skin - Facial Moisturizer for Women - Ideal Dandruff Remover - 1.69 Fl Oz\nReview Date: 2021/07/06\nStore: CLAIRECEUTICALS\nAverage Rating: 4.1\nProduct Details: {'Brand': 'CLAIRECEUTICALS', 'Item Form': 'Oil', 'Unit Count': '1.7 Fl Oz', 'Skin Type': 'All', 'Item Volume': '100 Milliliters'}\nReview Text: This is a nice quality oil, it absorbs well and leaves the skin soft.  At the time of this review there was no price listed, but I have to wonder...with good quality almond oil, even organic available in 16 ounce bottles for well under $20, what price will they put on this tiny bottle with less than 2 ounces.\nReview Title: Nice quality oil but...\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: anelor 56PCS Kids Temporary Tattoos,Glitter Styles Party Tattoo Stickers,Tattoos Decor for Birthday Beach and Donut Party,Party Favors for Girls and Boys, Medium (ane-0526-KTT2)\nReview Date: 2021/09/14\nStore: anelor\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Anelor', 'Pattern': 'Hearts', 'Number of Pieces': '56', 'Age Range (Description)': 'Adult', 'Product Dimensions': '8.25 x 6 x 0.1 inches; 0.65 Ounces', 'Item model number': 'ane-0526-KTT2'}\nReview Text: A different kind of treat for Halloween!  I don’t do candy anymore for Halloween but I try to find fun things for the kids and this was perfect! Fun, kid appropriate temporary tattoos with tons of different fun designs! Easy to put on, easy to takeoff. I felt the price was reasonable.\nReview Title: A different kind of treat for Halloween!\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Preferences and Trends Summary:**\n\n- **Natural Skincare Focus:** Consistently purchases products emphasizing natural ingredients like organic oils and scrubs. Preferences lean towards moisturizing and nourishing properties, particularly with oils known for their hydrating benefits.\n\n- **DIY Enthusiast:** Displays a significant interest in DIY projects, often purchasing empty bottles designed for mixing and storing personal care products, reinforcing a preference for customization and homemade solutions.\n\n- **Quality Over Quantity:** Values product quality, often expressing concern over pricing when perceived as excessive. Responds positively to sturdy and effective products, highlighting a balance between value and efficacy in reviews.\n\n- **Active Lifestyle:** Engages in fitness activities, indicated by purchases of personal hygiene products suitable for post-workout use. Additionally, appreciates convenience and portability in products, suggesting a need for on-the-go solutions.\n\n- **Value for Money:** Frequently mentions price as a factor in purchase satisfaction. Finds certain products excellent value, which influences repeat purchases and positive reviews.\n\n- **Kid-friendly Products:** Shows a willingness to engage with products suitable for children, indicating a consideration for family-oriented purchases, particularly during festive occasions.\n\nOverall, this shopper is health-conscious, enjoys crafting personal care regimes, and seeks high-quality, value-driven products that cater to both personal and family needs.",
  "target_interaction": {
    "rating": 5.0,
    "title": "A low priced perfect gift especially for a teacher!",
    "text": "A low priced perfect gift especially for a teacher!  Beautifully gift box this is an adorable, very girly gift set of rose scented bath bombs, soap and rose petals to put in the water. I found the price to be an excellent value and this would make a perfect gift for a teacher!",
    "images": [],
    "asin": "B095CG2ZV1",
    "parent_asin": "B095CG2ZV1",
    "user_id": "AEGKJTQWHGBIOTO34OB3GKIGCN7A",
    "timestamp": "2021-11-02 17:14:25.775000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Bath Bombs Gift Set, Bath Bomb Gift for Women with Rose Petals, Lavender Scent 5pc Handmade Bubble Bath Gift Box with Soap & Petals Mothers Day Gifts Ideas for Mom, New Mom, Wife Birthday Gift for Her",
    "average_rating": 4.5,
    "rating_number": 229,
    "features": [
      "🎁Fancy Bath Bombs Set: Includes 3* Bath Bombs, Soap Bar, and one pack of Bath Rose Petals in a pretty Present Box with Bow. Definitely a wonderful Gifts For Women, Mom, her, Friends, Wife or Colleagues.",
      "🎁Multi-benefits Gift Box For Women: Bath bombs adds emollients and softeners to the bath's water that moisturizes and indulges your skin. No matter what your skin type is, the beneficial ingredients in bath bombs leave it soft, supple, and silky.",
      "🎁Natural & Effective Spa Sets: Rich essential oils and Vitamin E. Perfect to place in the bath with some Bath Rose Petals after a long day or an intense workout. The aromatic fragrances transport you to a moment of calmness, or well-being.",
      "🎁Pamper Gift for New Mom: Achieve amazing scented aromatherapy with a spa set，worth giving the loved one this meaningful gift set. Excellent gifts for Birthday, Mother'day, Christmas, Thanksgiving, or Anniversary.",
      "🎁Cruelty-Free & Vegan-Friendly: All BFFLOVE products are made with organic ingredients, all-natural. We are committed to investigate and develop our products for a better customer experience. If you have any suggestions for our bath set, feel free to contact us. We'll spare no effort to provide perfect customer service."
    ],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41UsRA8k-eL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41UsRA8k-eL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61eXkIxLVSL._SL1080_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41JO1LtyimL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41JO1LtyimL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61eGCkbRwuL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51zBPXpLXtL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51zBPXpLXtL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71WaLyBzwuL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31PMn5ASqvL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31PMn5ASqvL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/51uxurBh5HL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5175YXj8-HS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/5175YXj8-HS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81a4yS5Ew6S._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Eeum14epL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Eeum14epL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71iGrcnnOHL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51bZDI4vfQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51bZDI4vfQL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/7148UUqFduL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41F+nqbS-sL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41F+nqbS-sL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71CDln6qfzL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51XQ6XVkuxS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51XQ6XVkuxS.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/81tdbJf5wsS._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Comes all Wrapped like a present",
        "url": "https://www.amazon.com/vdp/02b6c3fbd3aa45a5aea17c21d6a09a8a?ref=dp_vse_rvc_0",
        "user_id": "AHIF4RZLUWJ42DTIC3CGTZFS6XKA"
      },
      {
        "title": "BFFLOVE Bath Bombs Set, Relaxing Bubble Bath Gift Box Kit",
        "url": "https://www.amazon.com/vdp/0e4a0a45566b4ad8a88dcf67215d5e43?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "MOM Bath Bomb Gift Set",
        "url": "https://www.amazon.com/vdp/03aee9c695324bcdadbddca213c811ca?ref=dp_vse_rvc_2",
        "user_id": ""
      },
      {
        "title": "Lee Went gift set",
        "url": "https://www.amazon.com/vdp/03bfcf7fb38448928682cb0a6aa6c342?ref=dp_vse_rvc_3",
        "user_id": "/shop/influencer-d2f80b71"
      }
    ],
    "store": "# BFFLOVE",
    "categories": [],
    "details": {
      "Brand": "# BFFLOVE",
      "Scent": "Lavender,Rose",
      "Age Range (Description)": "Adult",
      "Product Benefits": "Softening,Stress Relief,Moisturizing,Aromatherapy",
      "Material Feature": "Organic, Vegan",
      "Product Dimensions": "7.65 x 1.85 x 5.35 inches; 13.76 Ounces",
      "UPC": "810001817473",
      "Manufacturer": "# BFFLOVE"
    },
    "bought_together": null
  }
}