{
  "user_id": "AGYRMITUSD6IEQMJDPHYMA7CJI2Q",
  "summary": "=== Purchase Information ===\nProduct Title: MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nReview Date: 2020/01/01\nStore: MOSTORY\nAverage Rating: 4.0\nProduct Details: {'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nReview Text: Okay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nReview Title: Fantastic natural-looking STAY PUT color with excellent pencil shape for easy application\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: [Weekly Point Cosmetic Rose edition mask sheet] - Facial skin care mask sheet 3solutions(Wriklecare, Brighten up, Moisture) in one (1Pack of 10pcs)\nReview Date: 2020/02/16\nStore: Weekly Point Cosmetic\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Weekly Point Cosmetic', 'Item Form': 'Sheet', 'Product Benefits': 'Moisture,Skin', 'Scent': 'Rose', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 4.84 x 7.01 inches; 12.63 Ounces'}\nReview Text: Even though I am not fond of the paper masks (prefer collagen), there is no denying they work well and my aging skin feels replenished, hydrated and rejuvenated. I have very sensitive skin due to seborrheic dermatitis, so I have to be very careful with skincare products. Why do I always feel the need to test them on Sunday when I have work the next day? No worries, my skin will look great and If I can find the time I may do another treatment in the morning to give my skin a little more radiance. There is no denying the results.<br /><br />Pro Tip: They work even better when you put them in the freezer for about 15 minutes before use. It will help tighten the pores up and feels extra refreshing!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: My aging skin feels replenished, hydrated and rejuvenated.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nReview Date: 2020/06/09\nStore: Milantia\nAverage Rating: 4.1\nProduct Details: {'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nReview Text: I have finally found the perfect flat iron for my bangs.  The Milantia Mini Hair Straightener 3/4\" Ceramic Tourmaline Ionic Flat Iron heats up fast to take care of my half curly bangs that have a mind of their own.<br /><br /> I have coarse thick hair, but my bangs have thinned with age and have started developing weird curls and cowlicks. It's the only part of my hair that needs the nuclear option because I keep the rest of it braised most of the time.<br /><br />I don't have time for a lot of hair care, and this little flat iron heats up fast and does exactly what I need it to do. It's small, lightweight,  nimble, and exactly what I have been looking for!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 *\nReview Title: Exactly what I have been looking for!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nReview Date: 2020/06/14\nStore: Kapelli Hair\nAverage Rating: 3.7\nProduct Details: {}\nReview Text: Lately, I have become enamored with hair building fibers for both root and scalp coverage. The results have been amazing, and many of the products I have used contain Keratin or Gossypium as the primary ingredient. The Toppik Hair Building Fibers contains 99% Keratin, but the fibers were larger and coarser than others and did not blend or adhere as well. It wasn't the natural-looking coverage I had come to expect. Just goes to show they're not all the same.<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: Not impressed\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nReview Date: 2020/07/30\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nReview Text: Out of all the 4D Silk Mascaraas I've tried recently the CPCP Elegant Princess Long Fiber Eyelash Mascara is one of my favorites. The packaging is gorgeous and the brush is a thicker comb-like bristle, which is great for volume and definition. My lashes looked dramatically darker and fuller and I really noticed the difference when I went outside and checked it out in my rearview mirror. I had tested two mascaras on each eye and this one really stood out. I have been wearing it for almost 36 hours and even slept in it.  After rubbing my eyes since the last night, the top lashes held and I didn't wake up with raccoon eyes. however, it does flake a bit. It applied smoothly and since It's not a quick drying mascara so you have a bit of time to tease out the lashes to avoid  any clumping..\nReview Title: Made my lashes dramatically darker and fuller\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Natural Waterproof Lash Mascara Black, 4D Silk Fiber Eyelash Mascara Makeup, Lengthening and Thick, No Clumping, Smudge-proof, Long-Lasting Voluminous Eyelashes Dramatic Extension Makeup Kit Eye Lash\nReview Date: 2020/07/30\nStore: SIKEMAY\nAverage Rating: 4.1\nProduct Details: {'Color': 'black', 'Brand': 'SIKEMAY', 'Item Form': 'Cream', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.2 inches; 2.4 Ounces', 'UPC': '764690676845', 'Manufacturer': 'SIKEMAY'}\nReview Text: I tried two 4D Silk mascaras by this brand on each eye for comparison and the CPCP Real Eyes Long Fiber Eyelash Mascara offers excellent lash separation. The thin comb bristle brush is great for separation, especially on the lower lashes.  I've worn both for 36 hours and after massive eye rubbing, I am surprised at how fresh it looks. I awoke with no raccoon eyes and no need to reapply it today. it didn't flake off! This is truly a long-lasting mascara.<br /><br />**  If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: Truly long lasting mascara with no raccoon eyes after 36 hours!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: OLEWELL Valentine's Day Mini Rubber Bands Soft Elastic Bands for Kids Hair Non-slip Rubber Hair Bands Soft Hair Elastics Ties Bands Braids Hair for Girls - STRONG - REUSEABLE(Total 2 Pack, One Pack of 1000, Another Pack of 500, Thickened version, BlackColorful1000+Colorful500)\nReview Date: 2020/08/18\nStore: OLEWELL\nAverage Rating: 4.0\nProduct Details: {'Material': 'Rubber', 'Item Form': 'Elastic', 'Brand': 'OLEWELL', 'Hair Type': 'Straight', 'Number of Pieces': '2', 'Package Dimensions': '7.6 x 7.25 x 0.7 inches; 3.21 Ounces'}\nReview Text: The black bands are very wide and perhaps triple the width of bands Ii have purchased preciously, which I like. It's interesting that there is such a contrast in thickness between the black and colored bands. Perhaps the colorful bands are meant for children's hair. They are well packaged in zippered plastic bags.\nReview Title: Wide balck bands, thin colored bands\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nReview Date: 2020/09/01\nStore: Sam&Helen\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nReview Text: I loved the super-thin brush to create an ultra-fine line. but it's not enough to keep the entire lash attached. Even the smallest ones are too large and applying several coats just results in a thick, messy tacky line. I have hooded lids and it transferred the upper lid in the blink of an eye.  The eyeliner itself is nearly impossible to remove. I applied it on my hand and had to use a stiff scrub brush in order to remove it.<br />I tried a few sets of magnetic lashes and only one performed fairly well, but this wasn't one of them.\nReview Title: Seemed like a good idea at the time.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hyaluronic Acid Serum for face - 11% Low molecules Anti-aging Hydrating Booster Serum 100% Pure Hyaluronic Acid\nReview Date: 2020/09/16\nStore: MEAROSA DESIGN\nAverage Rating: 4.4\nProduct Details: {'Skin Type': 'Dry', 'Scent': 'Aloe', 'Brand': 'MEAROSA DESIGN', 'Unit Count': '1.00 Fl Oz', 'Product Dimensions': '1.77 x 1.77 x 3.94 inches; 4.3 Ounces', 'UPC': '628504326121'}\nReview Text: This high HA formulation has a lot of great ingredients, and visibly reduced the appearance of fine lines and wrinkles with the first use.<br /><br />As a woman of a certain age, I am thrilled to find an effective and reasonably priced product that leaves my complexion 'naturally' soft, smooth and hydrated without leaving a slimy, or shiny silicone type residue.<br /><br />Too many beauty serums  tend to over promise, and under deliver in addition to being way overpriced., so  I am delighted to find a reasonably priced product that exceeded my expectations. I highly recommend this one!\nReview Title: Excellent high HA formulation that delivers on promise at a reasonable price\nRating: 5.0\n--------------------------------------------------",
  "reference": "MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nMOSTORY\n{'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nOkay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nFantastic natural-looking STAY PUT color with excellent pencil shape for easy application\n[Weekly Point Cosmetic Rose edition mask sheet] - Facial skin care mask sheet 3solutions(Wriklecare, Brighten up, Moisture) in one (1Pack of 10pcs)\nWeekly Point Cosmetic\n{'Brand': 'Weekly Point Cosmetic', 'Item Form': 'Sheet', 'Product Benefits': 'Moisture,Skin', 'Scent': 'Rose', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 4.84 x 7.01 inches; 12.63 Ounces'}\nEven though I am not fond of the paper masks (prefer collagen), there is no denying they work well and my aging skin feels replenished, hydrated and rejuvenated. I have very sensitive skin due to seborrheic dermatitis, so I have to be very careful with skincare products. Why do I always feel the need to test them on Sunday when I have work the next day? No worries, my skin will look great and If I can find the time I may do another treatment in the morning to give my skin a little more radiance. There is no denying the results.<br /><br />Pro Tip: They work even better when you put them in the freezer for about 15 minutes before use. It will help tighten the pores up and feels extra refreshing!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nMy aging skin feels replenished, hydrated and rejuvenated.\nHair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nMilantia\n{'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nI have finally found the perfect flat iron for my bangs.  The Milantia Mini Hair Straightener 3/4\" Ceramic Tourmaline Ionic Flat Iron heats up fast to take care of my half curly bangs that have a mind of their own.<br /><br /> I have coarse thick hair, but my bangs have thinned with age and have started developing weird curls and cowlicks. It's the only part of my hair that needs the nuclear option because I keep the rest of it braised most of the time.<br /><br />I don't have time for a lot of hair care, and this little flat iron heats up fast and does exactly what I need it to do. It's small, lightweight,  nimble, and exactly what I have been looking for!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 *\nExactly what I have been looking for!\nHair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nKapelli Hair\n{}\nLately, I have become enamored with hair building fibers for both root and scalp coverage. The results have been amazing, and many of the products I have used contain Keratin or Gossypium as the primary ingredient. The Toppik Hair Building Fibers contains 99% Keratin, but the fibers were larger and coarser than others and did not blend or adhere as well. It wasn't the natural-looking coverage I had come to expect. Just goes to show they're not all the same.<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nNot impressed\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nOut of all the 4D Silk Mascaraas I've tried recently the CPCP Elegant Princess Long Fiber Eyelash Mascara is one of my favorites. The packaging is gorgeous and the brush is a thicker comb-like bristle, which is great for volume and definition. My lashes looked dramatically darker and fuller and I really noticed the difference when I went outside and checked it out in my rearview mirror. I had tested two mascaras on each eye and this one really stood out. I have been wearing it for almost 36 hours and even slept in it.  After rubbing my eyes since the last night, the top lashes held and I didn't wake up with raccoon eyes. however, it does flake a bit. It applied smoothly and since It's not a quick drying mascara so you have a bit of time to tease out the lashes to avoid  any clumping..\nMade my lashes dramatically darker and fuller\nNatural Waterproof Lash Mascara Black, 4D Silk Fiber Eyelash Mascara Makeup, Lengthening and Thick, No Clumping, Smudge-proof, Long-Lasting Voluminous Eyelashes Dramatic Extension Makeup Kit Eye Lash\nSIKEMAY\n{'Color': 'black', 'Brand': 'SIKEMAY', 'Item Form': 'Cream', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.2 inches; 2.4 Ounces', 'UPC': '764690676845', 'Manufacturer': 'SIKEMAY'}\nI tried two 4D Silk mascaras by this brand on each eye for comparison and the CPCP Real Eyes Long Fiber Eyelash Mascara offers excellent lash separation. The thin comb bristle brush is great for separation, especially on the lower lashes.  I've worn both for 36 hours and after massive eye rubbing, I am surprised at how fresh it looks. I awoke with no raccoon eyes and no need to reapply it today. it didn't flake off! This is truly a long-lasting mascara.<br /><br />**  If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nTruly long lasting mascara with no raccoon eyes after 36 hours!\nOLEWELL Valentine's Day Mini Rubber Bands Soft Elastic Bands for Kids Hair Non-slip Rubber Hair Bands Soft Hair Elastics Ties Bands Braids Hair for Girls - STRONG - REUSEABLE(Total 2 Pack, One Pack of 1000, Another Pack of 500, Thickened version, BlackColorful1000+Colorful500)\nOLEWELL\n{'Material': 'Rubber', 'Item Form': 'Elastic', 'Brand': 'OLEWELL', 'Hair Type': 'Straight', 'Number of Pieces': '2', 'Package Dimensions': '7.6 x 7.25 x 0.7 inches; 3.21 Ounces'}\nThe black bands are very wide and perhaps triple the width of bands Ii have purchased preciously, which I like. It's interesting that there is such a contrast in thickness between the black and colored bands. Perhaps the colorful bands are meant for children's hair. They are well packaged in zippered plastic bags.\nWide balck bands, thin colored bands\nSam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nSam&Helen\n{'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nI loved the super-thin brush to create an ultra-fine line. but it's not enough to keep the entire lash attached. Even the smallest ones are too large and applying several coats just results in a thick, messy tacky line. I have hooded lids and it transferred the upper lid in the blink of an eye.  The eyeliner itself is nearly impossible to remove. I applied it on my hand and had to use a stiff scrub brush in order to remove it.<br />I tried a few sets of magnetic lashes and only one performed fairly well, but this wasn't one of them.\nSeemed like a good idea at the time.\nHyaluronic Acid Serum for face - 11% Low molecules Anti-aging Hydrating Booster Serum 100% Pure Hyaluronic Acid\nMEAROSA DESIGN\n{'Skin Type': 'Dry', 'Scent': 'Aloe', 'Brand': 'MEAROSA DESIGN', 'Unit Count': '1.00 Fl Oz', 'Product Dimensions': '1.77 x 1.77 x 3.94 inches; 4.3 Ounces', 'UPC': '628504326121'}\nThis high HA formulation has a lot of great ingredients, and visibly reduced the appearance of fine lines and wrinkles with the first use.<br /><br />As a woman of a certain age, I am thrilled to find an effective and reasonably priced product that leaves my complexion 'naturally' soft, smooth and hydrated without leaving a slimy, or shiny silicone type residue.<br /><br />Too many beauty serums  tend to over promise, and under deliver in addition to being way overpriced., so  I am delighted to find a reasonably priced product that exceeded my expectations. I highly recommend this one!\nExcellent high HA formulation that delivers on promise at a reasonable price",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nReview Date: 2020/01/01\nStore: MOSTORY\nAverage Rating: 4.0\nProduct Details: {'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nReview Text: Okay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nReview Title: Fantastic natural-looking STAY PUT color with excellent pencil shape for easy application\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: [Weekly Point Cosmetic Rose edition mask sheet] - Facial skin care mask sheet 3solutions(Wriklecare, Brighten up, Moisture) in one (1Pack of 10pcs)\nReview Date: 2020/02/16\nStore: Weekly Point Cosmetic\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Weekly Point Cosmetic', 'Item Form': 'Sheet', 'Product Benefits': 'Moisture,Skin', 'Scent': 'Rose', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 4.84 x 7.01 inches; 12.63 Ounces'}\nReview Text: Even though I am not fond of the paper masks (prefer collagen), there is no denying they work well and my aging skin feels replenished, hydrated and rejuvenated. I have very sensitive skin due to seborrheic dermatitis, so I have to be very careful with skincare products. Why do I always feel the need to test them on Sunday when I have work the next day? No worries, my skin will look great and If I can find the time I may do another treatment in the morning to give my skin a little more radiance. There is no denying the results.<br /><br />Pro Tip: They work even better when you put them in the freezer for about 15 minutes before use. It will help tighten the pores up and feels extra refreshing!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: My aging skin feels replenished, hydrated and rejuvenated.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nReview Date: 2020/06/09\nStore: Milantia\nAverage Rating: 4.1\nProduct Details: {'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nReview Text: I have finally found the perfect flat iron for my bangs.  The Milantia Mini Hair Straightener 3/4\" Ceramic Tourmaline Ionic Flat Iron heats up fast to take care of my half curly bangs that have a mind of their own.<br /><br /> I have coarse thick hair, but my bangs have thinned with age and have started developing weird curls and cowlicks. It's the only part of my hair that needs the nuclear option because I keep the rest of it braised most of the time.<br /><br />I don't have time for a lot of hair care, and this little flat iron heats up fast and does exactly what I need it to do. It's small, lightweight,  nimble, and exactly what I have been looking for!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 *\nReview Title: Exactly what I have been looking for!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nReview Date: 2020/06/14\nStore: Kapelli Hair\nAverage Rating: 3.7\nProduct Details: {}\nReview Text: Lately, I have become enamored with hair building fibers for both root and scalp coverage. The results have been amazing, and many of the products I have used contain Keratin or Gossypium as the primary ingredient. The Toppik Hair Building Fibers contains 99% Keratin, but the fibers were larger and coarser than others and did not blend or adhere as well. It wasn't the natural-looking coverage I had come to expect. Just goes to show they're not all the same.<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: Not impressed\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nReview Date: 2020/07/30\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nReview Text: Out of all the 4D Silk Mascaraas I've tried recently the CPCP Elegant Princess Long Fiber Eyelash Mascara is one of my favorites. The packaging is gorgeous and the brush is a thicker comb-like bristle, which is great for volume and definition. My lashes looked dramatically darker and fuller and I really noticed the difference when I went outside and checked it out in my rearview mirror. I had tested two mascaras on each eye and this one really stood out. I have been wearing it for almost 36 hours and even slept in it.  After rubbing my eyes since the last night, the top lashes held and I didn't wake up with raccoon eyes. however, it does flake a bit. It applied smoothly and since It's not a quick drying mascara so you have a bit of time to tease out the lashes to avoid  any clumping..\nReview Title: Made my lashes dramatically darker and fuller\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Natural Waterproof Lash Mascara Black, 4D Silk Fiber Eyelash Mascara Makeup, Lengthening and Thick, No Clumping, Smudge-proof, Long-Lasting Voluminous Eyelashes Dramatic Extension Makeup Kit Eye Lash\nReview Date: 2020/07/30\nStore: SIKEMAY\nAverage Rating: 4.1\nProduct Details: {'Color': 'black', 'Brand': 'SIKEMAY', 'Item Form': 'Cream', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.2 inches; 2.4 Ounces', 'UPC': '764690676845', 'Manufacturer': 'SIKEMAY'}\nReview Text: I tried two 4D Silk mascaras by this brand on each eye for comparison and the CPCP Real Eyes Long Fiber Eyelash Mascara offers excellent lash separation. The thin comb bristle brush is great for separation, especially on the lower lashes.  I've worn both for 36 hours and after massive eye rubbing, I am surprised at how fresh it looks. I awoke with no raccoon eyes and no need to reapply it today. it didn't flake off! This is truly a long-lasting mascara.<br /><br />**  If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: Truly long lasting mascara with no raccoon eyes after 36 hours!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: OLEWELL Valentine's Day Mini Rubber Bands Soft Elastic Bands for Kids Hair Non-slip Rubber Hair Bands Soft Hair Elastics Ties Bands Braids Hair for Girls - STRONG - REUSEABLE(Total 2 Pack, One Pack of 1000, Another Pack of 500, Thickened version, BlackColorful1000+Colorful500)\nReview Date: 2020/08/18\nStore: OLEWELL\nAverage Rating: 4.0\nProduct Details: {'Material': 'Rubber', 'Item Form': 'Elastic', 'Brand': 'OLEWELL', 'Hair Type': 'Straight', 'Number of Pieces': '2', 'Package Dimensions': '7.6 x 7.25 x 0.7 inches; 3.21 Ounces'}\nReview Text: The black bands are very wide and perhaps triple the width of bands Ii have purchased preciously, which I like. It's interesting that there is such a contrast in thickness between the black and colored bands. Perhaps the colorful bands are meant for children's hair. They are well packaged in zippered plastic bags.\nReview Title: Wide balck bands, thin colored bands\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nReview Date: 2020/09/01\nStore: Sam&Helen\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nReview Text: I loved the super-thin brush to create an ultra-fine line. but it's not enough to keep the entire lash attached. Even the smallest ones are too large and applying several coats just results in a thick, messy tacky line. I have hooded lids and it transferred the upper lid in the blink of an eye.  The eyeliner itself is nearly impossible to remove. I applied it on my hand and had to use a stiff scrub brush in order to remove it.<br />I tried a few sets of magnetic lashes and only one performed fairly well, but this wasn't one of them.\nReview Title: Seemed like a good idea at the time.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hyaluronic Acid Serum for face - 11% Low molecules Anti-aging Hydrating Booster Serum 100% Pure Hyaluronic Acid\nReview Date: 2020/09/16\nStore: MEAROSA DESIGN\nAverage Rating: 4.4\nProduct Details: {'Skin Type': 'Dry', 'Scent': 'Aloe', 'Brand': 'MEAROSA DESIGN', 'Unit Count': '1.00 Fl Oz', 'Product Dimensions': '1.77 x 1.77 x 3.94 inches; 4.3 Ounces', 'UPC': '628504326121'}\nReview Text: This high HA formulation has a lot of great ingredients, and visibly reduced the appearance of fine lines and wrinkles with the first use.<br /><br />As a woman of a certain age, I am thrilled to find an effective and reasonably priced product that leaves my complexion 'naturally' soft, smooth and hydrated without leaving a slimy, or shiny silicone type residue.<br /><br />Too many beauty serums  tend to over promise, and under deliver in addition to being way overpriced., so  I am delighted to find a reasonably priced product that exceeded my expectations. I highly recommend this one!\nReview Title: Excellent high HA formulation that delivers on promise at a reasonable price\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Shopping Preferences and Patterns:**\n\n- **Skincare Focus:** Strong preference for restorative and anti-aging products, particularly those with natural and hydrating ingredients (e.g., hyaluronic acid, sheet masks).\n- **Makeup Enthusiast:** Enjoys products that enhance appearance while maintaining a natural look—specifically brow and eyelash products that offer longevity and definition.\n- **Hair Care Solutions:** Seeks effective styling tools for managing hair texture, particularly for fine or frizzy hair; purchases suggest a need for convenience and efficiency in styling.\n- **Product Evaluation:** Reviews often highlight effectiveness and ease of use; the individual favors products that deliver visible results without excessive application effort.\n- **Material Sensitivity:** Caution in product selection due to sensitive skin issues, indicating a priority on compatibility and gentle formulations.\n- **Brand Preference:** Frequent purchases from specific brands suggest brand loyalty, particularly ones that provide satisfactory performance ratings.\n- **Packaging & Usability:** Positive remarks on product packaging and usability emphasize a preference for well-designed items that enhance the user experience.\n- **Critical Feedback:** Constructive criticism for underperforming products indicates a discerning consumer with clear expectations for quality. \n\nOverall, this individual demonstrates a balanced approach between makeup and skincare, valuing natural results and product effectiveness, while also being aware of their unique skin and hair care needs.",
  "target_interaction": {
    "rating": 5.0,
    "title": "BEST Detangling brush EVRER",
    "text": "I have long thick hair that knots easily and I am amazed at how well this brush is at detangled the most matted hair without causing pain or excessive hair loss. You would think I haven't brushed my hair in a year, but it is like this every morning.<br /><br />The difference is breathtaking after using it on dry hair, and I was amazed to see how much less hair loss there was on wet hair after shampooing and conditioning.<br /><br />I wish I had discovered this brush months ago and I would give them 10 stars if I could!.<br /><br />This brushwork all hair types and I highly recommend them",
    "images": [],
    "asin": "B08B5FYSL4",
    "parent_asin": "B08B5FYSL4",
    "user_id": "AGYRMITUSD6IEQMJDPHYMA7CJI2Q",
    "timestamp": "2020-12-31 23:51:35.808000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Detangling Brush for Curly Hair,Natural Hair Brush for Hair Textured 3A to 4C Kinky Wavy/Curly/Coily/Wet/Dry/Oil/Thick/Long Hair, Exfoliating for Beautiful and Shiny Curls",
    "average_rating": 4.6,
    "rating_number": 11,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31LxYiZdsnL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31LxYiZdsnL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51Xod8zYufL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51-HN5rKOFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-HN5rKOFL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61tIFJy61aL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41nT8gGAfwL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41nT8gGAfwL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61eEN7FsHVL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51OoDeF7ECL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51OoDeF7ECL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/616xOUXQEzL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51wYer6AcFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51wYer6AcFL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61CXAGWN7QL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51LMj2HpiAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51LMj2HpiAL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61TCeA83FcL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41FQ+GNaIyL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41FQ+GNaIyL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/510e-YOg6jL._SL1000_.jpg"
      }
    ],
    "videos": [],
    "store": "BeeGift",
    "categories": [],
    "details": {
      "Brand": "BeeGift",
      "Shape": "Oblong",
      "Handle Material": "Rubber",
      "Special Feature": "Detangling",
      "Product Benefits": "Detangle",
      "Package Dimensions": "5 x 3 x 0.35 inches; 1.6 Ounces",
      "UPC": "742089431473"
    },
    "bought_together": null
  }
}