{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: So Undercover\nReview Date: 2017/12/18\nStore: Miley Cyrus  (Actor),     Jeremy Piven  (Actor),     Tom Vaughan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['A tough, street-smart private eye is hired by the FBI to go undercover in a college sorority.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Tom Vaughan, Kelly Osbourne, Joshua Bowman, Miley Cyrus, Jeremy Piven', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FLKP14009DVD', 'Director': 'Tom Vaughan', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 5, 2013', 'Actors': 'Miley Cyrus, Jeremy Piven, Joshua Bowman, Kelly Osbourne', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nReview Text: I enjoy this movie for Jeremy Piven and having family ties to New Orleans/Tulane University. This movie stars Miley Cyrus who goes undercover as a student joining a sorority. It's a similar premise to Miss Congeniality. It's predictable and geared towards teens/college age IMO. Well cast and worth checking out for Miley or Jeremy or New Orleans. The third male lead, I forget his name, he was in the TV show Revenge.\nReview Title: Entertaining\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Chasing Dreams\nSean Roche & Therese Conte  (Director)    Rated:    PG    Format: VHS Tape\nMovies & TV, Featured Categories\n[\"When Gavin is faced with the decision to stay with the family farm or take a crack at a career in baseball, he is fueled by his older brother's success and cheers of his invalid brother to wind up and take a swing.\"]\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Sean Roche & Therese Conte', 'Run time': '96 minutes', 'Date First Available': 'September 21, 2004', 'Actors': 'David G. Brown, John Fife, Jim Shane, Lisa Kingston, Kevin Costner', 'Studio': 'Prism/IRC'}\nI buy all of Kevin's movies, so this one was a must buy, seeing as he is on the cover. I watched it, he is on two scenes MAX. They just have him on a cover to help sell the movie. I barely remember anything from this movie, so unless you're a fan of the kid in the movie, I wouldn't get it for Kevin Costner.\nNothing memorable\nJust My Luck\nComedy, Fantasy, Cerebral, Fantastic\n[\"Manhattanite Ashley is known to many as the luckiest woman around. After a chance encounter with a down-and-out young man, however, she realizes that she's swapped her fortune for his.\"]\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Donald Petrie'], 'Producers': ['Arnold Rifkin', 'Bruce Willis', 'Arnon Milchan'], 'Starring': ['Lindsay Lohan', 'Chris Pine', 'Samaire Armstrong']}\nSecond time I have seen this. It's predictable to some degree but cute if you like Chris or Lindsay. I've always been a fan of her as an actress and musician. Chris is just adorable and does well with Lindsay in this. Worth a rent.\ncute movie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kevin Altieri', 'Boyd Kirkland', 'Frank Paur', 'Dan Riba', 'Dick Sebast', 'Bruce Timm', 'Eric Radomski', 'Kent Butterworth'], 'Producers': ['Alan Burnett', 'Eric Radomski', 'Bruce Timm'], 'Starring': ['Kevin Conroy', 'Efrem Zimbalist', 'Jr.', 'Loren Lester']}\nThe only batman I watch\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jason Priestley', 'James Eckhouse', 'Bethany Rooney', \"Bill D'Elia\", 'Chip Chalmers', 'Daniel Attias', 'David Semel', 'Gilbert M. Shilton', 'James Whitmore Jr.', 'Jeff Melman', 'Jefferson Kibbee', 'Les Landau', 'Michael Lange', 'Paul Schneider', 'Richard Lang'], 'Producers': ['Aaron Spelling', 'E. Duke Vincent', 'Darren Star'], 'Starring': ['Jason Priestley', 'Shannon Doherty', 'Jennie Garth'], 'Studio': ['CBS']}\nLast Brenda season.  Good steve plots. Glad I got to stream it.\nseason 4\nThe Real Housewives of Orange County: Season 1\nJeana Tomasino  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Desperate for more housewife drama? Then get ready for addictive, indulgent fun with Season One of Bravo\\'s hit sensation, The Real Housewives of Orange County! Join five real-life ladies of leisure—Jo, Jeana, Lauri, Vicki and Kimberly—for an all-access pass inside their exclusive planned community. Whether they\\'re sharing cocktails, shopping trips, travel plans or Botox treatments, these stylish women espose the realities of living in Southern California luxury! Available on DVD for the first time, this must-own 2-disc set includes every revealing episode from the first season, plus the can\\'t-miss reunion special. For the best guilty pleasure entertainment around, take home this sensation that the New York Daily News calls \"utterly\" addictive.']\n{'Genre': 'Television, DVD Movie, Television/Reality Shows, Blu-ray Movie', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Jeana Tomasino', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': 'MOV-REALHWORANG', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '5 hours and 3 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Jeana Tomasino', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '2'}\nI wish this show was available on Prime Instant but it's not so I bought the dvd (cheaper than 1.99 pay per view).<br />RHOC is the only version I watch. It was great to see the beginning again.\nIt was great to see the beginning again\nGood Fortune\nJohn Paul DeJoria  (Actor),     Dan Aykroyd  (Actor),     Josh Tickell  (Director),     Rebecca Harrell Tickell  (Director)    &                   1                  more   Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n[\"'Success unshared is failure.'GOOD FORTUNE is the rags to riches tale of conscious capitalism pioneer John Paul DeJoria. The son of Greek immigrants, born into humble beginnings in East Los Angeles, John Paul DeJoria has built a life full of good fortune and achieved vast wealth through a variety of businesses, among them John Paul Mitchell Hair Care Systems and Patron Tequila.In 1980, he partnered with Paul Mitchell to start a line of professional hair care products. They turned a $700 investment and 3 products into a wildly successful venture that today is worth more than $800 million. Proving his success wasn't just a fluke, John Paul then created the largest and the most recognizable tequila brand in the world - Patron.GOOD FORTUNE focuses on DeJoria's inspiring success story as well as his philanthropy. It's the true tale of a man who overcame obstacles and dedicates his life to giving back to those less fortunate. He ran through his early adulthood in and out of motorcycle gangs and today John Paul's quest is finding innovative ways to share his sizable fortune. DeJoria spends his life creating back-to-work programs for the homeless, fighting whale poachers in the Arctic and working on over 100 other philanthropic ventures. Along with Bill Gates and Warren Buffet DeJoria signed 'The Giving Pledge,' a formal promise to continue to contribute more than half of their wealth to philanthropy or charitable causes during their lifetime or in their will.Dan Aykroyd narrates the film spinning colorful stories with humor and wit. GOOD FORTUNE is an incredibly powerful and noble narrative that gives an informative and entertaining picture of this self-made billionaire and verifiable poster boy of the American dream.\"]\n{'Genre': 'Special Interests', 'Format': 'NTSC', 'Contributor': 'John Paul DeJoria, Josh Tickell, Dan Aykroyd, Arianna Huffington, Danny Trejo, Cheech Marin, Rebecca Harrell TickellJohn Paul DeJoria, Josh Tickell, Dan Aykroyd, Arianna Huffington, Danny Trejo, Cheech Marin, Rebecca Harrell Tickell  See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.21 Ounces', 'Director': 'Josh Tickell, Rebecca Harrell Tickell', 'Media Format': 'NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'July 14, 2017', 'Actors': 'John Paul DeJoria, Dan Aykroyd, Danny Trejo, Cheech Marin, Arianna Huffington', 'Studio': 'Audio Fidelity', 'Number of discs': '1'}\nI heard about this dvd on The Garry Meier podcast out of Chicago. The price was fair on amazon so I immediately jumped on buying a copy. I did not know much about John Paul DeJoria except he was with Paul Mitchell Hair. This dvd is well edited and very entertaining. It's about an hour, maybe a little over. John Paul's life of &#34;rags to riches&#34; and ending up a philanthropic billionaire with a heart of gold was so heart warming to see. I shared this with several people who enjoyed it as well.\nHeart warming !\nDynasty\nDrama, Romance\n[\"The 9th and final season of the primetime soap begins as Alexis is comforted by Dex's solace and friendship and the two renew their passionate love for each other. Fallon slips out of Jeff's room after Sammy Jo shows up unexpectedly to accept his marriage offer. Blake is devastated by his fear that Krystle's disappearance at the end of season 8 may by a severe mental disorder.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Irving J. Moore', 'Don Medford'], 'Starring': ['Joan Collins', 'Linda Evans', 'John Forsythe']}\nDefinitely not as good as previous seasons. I was not as engaged as I had been. Krystle played by Linda Evans departs the show which didn't help. Same with Steven.\nDefinitely not as good as previous seasons\nSo Undercover\nMiley Cyrus  (Actor),     Jeremy Piven  (Actor),     Tom Vaughan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['A tough, street-smart private eye is hired by the FBI to go undercover in a college sorority.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Tom Vaughan, Kelly Osbourne, Joshua Bowman, Miley Cyrus, Jeremy Piven', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FLKP14009DVD', 'Director': 'Tom Vaughan', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 5, 2013', 'Actors': 'Miley Cyrus, Jeremy Piven, Joshua Bowman, Kelly Osbourne', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nI enjoy this movie for Jeremy Piven and having family ties to New Orleans/Tulane University. This movie stars Miley Cyrus who goes undercover as a student joining a sorority. It's a similar premise to Miss Congeniality. It's predictable and geared towards teens/college age IMO. Well cast and worth checking out for Miley or Jeremy or New Orleans. The third male lead, I forget his name, he was in the TV show Revenge.\nEntertaining",
  "profile": "**User Summary Update:**\n\n- **Genre Preference:** The user enjoys a diverse array of movie genres, with a continued emphasis on comedy and fantasy. They have shown an increasing interest in feel-good narratives and engaging documentaries, while retaining an appreciation for character-driven stories.\n\n- **Actor Affinity:** Their attraction to actors now includes personalities from comedic films and reality television, showcasing a preference for engaging storytelling that transcends traditional cinematic roles. Recent enjoyment of a specific film reflects their connection to actors like Jeremy Piven and Miley Cyrus.\n\n- **Decision-Making:** The user's impulsive buying habits remain evident, particularly when drawn to familiar narratives. They seek engaging content featuring recognizable talent across various mediums.\n\n- **Satisfaction Level:** While they maintain a low tolerance for predictability, their affinity for heartfelt storytelling grows, enhancing their viewing experiences and nostalgia.\n\n- **Review Attitude:** Their straightforward feedback reflects a discerning taste, valuing quality narratives. The latest review indicates a positive reception of a comedy, despite acknowledging its predictability, which aligns with their desire for both entertainment and relatable content.\n\n- **Overall Rating:** The user continues to differentiate between star power and meaningful storytelling, reinforcing their eclectic preference for quality entertainment.\n\nIn summary, the user balances nostalgia with a deepening appreciation for relatable storytelling and engaging characters, while their review patterns emphasize a consistent expectation for originality and quality.",
  "metrics": {
    "rouge1_f": 0.11339633129516398,
    "rouge2_f": 0.008903728436282694,
    "rougeL_f": 0.054474708171206226,
    "meteor": 0.035197400807324995,
    "bleu1": 0.0003560644856577788,
    "bleu2": 0.00010493253330708644,
    "bleu3": 3.361060192103302e-05,
    "bleu4": 1.0706576219351002e-05,
    "bertscore_precision": 0.34920167922973633,
    "bertscore_recall": 0.473380446434021,
    "bertscore_f1": 0.4019179046154022
  }
}