{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Just My Luck\nReview Date: 2013/05/30\nCategories: Comedy, Fantasy, Cerebral, Fantastic\nProduct Description: [\"Manhattanite Ashley is known to many as the luckiest woman around. After a chance encounter with a down-and-out young man, however, she realizes that she's swapped her fortune for his.\"]\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Donald Petrie'], 'Producers': ['Arnold Rifkin', 'Bruce Willis', 'Arnon Milchan'], 'Starring': ['Lindsay Lohan', 'Chris Pine', 'Samaire Armstrong']}\nReview Text: Second time I have seen this. It's predictable to some degree but cute if you like Chris or Lindsay. I've always been a fan of her as an actress and musician. Chris is just adorable and does well with Lindsay in this. Worth a rent.\nReview Title: cute movie\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Chasing Dreams\nSean Roche & Therese Conte  (Director)    Rated:    PG    Format: VHS Tape\nMovies & TV, Featured Categories\n[\"When Gavin is faced with the decision to stay with the family farm or take a crack at a career in baseball, he is fueled by his older brother's success and cheers of his invalid brother to wind up and take a swing.\"]\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Sean Roche & Therese Conte', 'Run time': '96 minutes', 'Date First Available': 'September 21, 2004', 'Actors': 'David G. Brown, John Fife, Jim Shane, Lisa Kingston, Kevin Costner', 'Studio': 'Prism/IRC'}\nI buy all of Kevin's movies, so this one was a must buy, seeing as he is on the cover. I watched it, he is on two scenes MAX. They just have him on a cover to help sell the movie. I barely remember anything from this movie, so unless you're a fan of the kid in the movie, I wouldn't get it for Kevin Costner.\nNothing memorable\nJust My Luck\nComedy, Fantasy, Cerebral, Fantastic\n[\"Manhattanite Ashley is known to many as the luckiest woman around. After a chance encounter with a down-and-out young man, however, she realizes that she's swapped her fortune for his.\"]\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Donald Petrie'], 'Producers': ['Arnold Rifkin', 'Bruce Willis', 'Arnon Milchan'], 'Starring': ['Lindsay Lohan', 'Chris Pine', 'Samaire Armstrong']}\nSecond time I have seen this. It's predictable to some degree but cute if you like Chris or Lindsay. I've always been a fan of her as an actress and musician. Chris is just adorable and does well with Lindsay in this. Worth a rent.\ncute movie",
  "profile": "**User Summary:**\n\n- **Genre Preference:** Enjoys a variety of movies, often leaning towards comedy and fantasy, especially those featuring well-known actors. \n- **Actor Affinity:** A strong fan of specific actors, particularly Chris Pine and Lindsay Lohan. The presence of favorite actors continues to play a significant role in their movie choices, affecting purchasing behavior.\n- **Decision-Making:** Demonstrates impulsive purchasing tendencies when attracted by favored actors, even if their roles are minor. This is consistent across previous purchases with star power as a deciding factor.\n- **Satisfaction Level:** Generally has low tolerance for content that feels predictable or lacks depth, often feeling misled by marketing. Recent feedback suggests a willingness to accept movies that might be formulaic as long as they feature beloved actors.\n- **Review Attitude:** Direct and sometimes critical in reviews, showing a tendency to express nuanced opinions. While content that doesn't meet high expectations can prompt disappointment, the user appears more forgiving when actors they admire perform well.\n- **Overall Rating:** The distinction between actor appeal and film quality remains evident, with a willingness to acknowledge flaws in predictable plots while maintaining appreciation for performances. \n\nIn summary, this user prioritizes star power in film selections, while also demonstrating a preference for lighthearted, entertaining films, despite occasionally feeling let down by overall content quality.",
  "metrics": {
    "rouge1_f": 0.24657534246575344,
    "rouge2_f": 0.015717092337917484,
    "rougeL_f": 0.09784735812133073,
    "meteor": 0.12330456226880396,
    "bleu1": 0.16740571223359685,
    "bleu2": 0.032890817233244475,
    "bleu3": 0.0061611958657289585,
    "bleu4": 0.0026690617807133324,
    "bertscore_precision": 0.3939785957336426,
    "bertscore_recall": 0.4347025752067566,
    "bertscore_f1": 0.4133399426937103
  }
}