{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Luminarias\nReview Date: 2013/01/15\nStore: Evelina Fernandez  (Actor),     Scott Bakula  (Actor),     Jose Luis Valenzuela  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nAverage Rating: 4.7\nProduct Details: {}\nReview Text: This is one of my favorite movies. Sort of like a Latina, &#34;Waiting to Exhale&#34;.  I love the characters and how they explore every facet, whether it's real or a myth about the way people perceive each other.  It is funny, poignant and serious all at the same time.  And the music is fabulous, the best soundtrack ever.  This is a great rainy day movie and one that you will watch over and over again.<br />Carolyn G\nReview Title: Luminarias-movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Bullitt (DVD) (Rpkg)\nSteve McQueen  (Actor),     Robert Vaughn  (Actor),     Peter Yates  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Bullitt (DVD) (Rpkg)', \"There are bad cops and there are good cops ... and then there's Bullitt. Steve McQueen stars as Lt. Frank Bullitt in the role that made him a superstar as the hard-bitten police detective assigned to protect the star witness in a Congressional investigation. But when the witness is murdered, Bullitt mercilessly tracks a trail of lies and corruption that leads all the way to the halls of power in Washington. Steve McQueen performed his own stunts, driving the Ford Mustang in the high-speed pursuit through San Francisco that stands as one of the best and most famous car chases ever filmed.\", ']]>']\n{'Genre': 'Drama, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': \"Norman Fell, Robert Duvall, Don Gordon, Robert Relyea, Steve McQueen, Georg Stanford Brown, Philip D'Antoni, Felice Orlandi, Jacqueline Bisset, Carl Reindel, Peter Yates, Vic Tayback, Simon Oakland, Justin Tarr, Robert VaughnNorman Fell, Robert Duvall, Don Gordon, Robert Relyea, Steve McQueen, Georg Stanford Brown, Philip D'Antoni, Felice Orlandi, Jacqueline Bisset, Carl Reindel, Peter Yates, Vic Tayback, Simon Oakland, Justin Tarr, Robert Vaughn  See more\", 'Language': 'French (Dolby Digital 1.0), English (Dolby Digital 4.0), Spanish (Mono)', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '164748', 'Director': 'Peter Yates', 'Media Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Steve McQueen, Robert Vaughn, Jacqueline Bisset, Don Gordon, Robert Duvall', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': \"Philip D'Antoni, Robert Relyea\", 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat can I say about Bullitt, one of the best Steve McQueen movies of all time.  I know many people like his Great Escape, and so do I, but this movie has it all.  Romance, intrigue and a fantastic car chase!!!  Especially because it was set in San Francisco, what a place for a car chase.  The next best is our modern day \"Ronin\", but that's a different kind of chase.  It's set in Europe, where the street are super narrow.  This movie, Bullit, is a great cop movie also.  So if by chance you've missed it, it needs to go on  your must see list.<br />Carolyn Gleeson- Lover of Steve McQueen movies in any form.  In fact if you like Steve, see his motorcycle documentary,\"On any Sunday\". Unbelievable!!!\nBullitt- must see for car buffs!\nLuminarias\nEvelina Fernandez  (Actor),     Scott Bakula  (Actor),     Jose Luis Valenzuela  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{}\nThis is one of my favorite movies. Sort of like a Latina, &#34;Waiting to Exhale&#34;.  I love the characters and how they explore every facet, whether it's real or a myth about the way people perceive each other.  It is funny, poignant and serious all at the same time.  And the music is fabulous, the best soundtrack ever.  This is a great rainy day movie and one that you will watch over and over again.<br />Carolyn G\nLuminarias-movie",
  "profile": "**User Summary:**\n\nThe user exhibits a strong preference for classic action and adventure films, particularly those featuring iconic actors like Steve McQueen. They express deep admiration for character-driven narratives that combine elements of romance, intrigue, and thrilling car chases, preferring high production value, notable stunt work, and well-crafted suspense. The user enjoys the cinematic experience of high-octane pursuits, especially those set in unique locations like San Francisco.\n\nRecent interactions indicate that their film interests extend beyond action and adventure; they also appreciate compelling comedies with rich character exploration. They favor narratives that interplay humor with poignant themes, demonstrating a deeper appreciation for how social perceptions are examined through film. The user's penchant for quality storytelling remains evident, as they are likely to enjoy and endorse films that resonate with them across diverse genres.\n\nAdditionally, they reference both classic and contemporary titles with similar themes, valuing the originals while being open to newer interpretations. Overall, the user is positioned as a passionate film enthusiast with a wide-ranging appreciation for cinematic experiences that blend humor, poignant storytelling, and character depth, while maintaining a particular affinity for the works of Steve McQueen and comparable films.",
  "metrics": {
    "rouge1_f": 0.19556714471968709,
    "rouge2_f": 0.023529411764705882,
    "rougeL_f": 0.09126466753585398,
    "meteor": 0.07109938053099987,
    "bleu1": 0.024481441546028663,
    "bleu2": 0.00950304896052952,
    "bleu3": 0.0030325018585087562,
    "bleu4": 0.0009644168100679546,
    "bertscore_precision": 0.34235674142837524,
    "bertscore_recall": 0.458517462015152,
    "bertscore_f1": 0.39201298356056213
  }
}