{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Bridges at Toko-Ri\nReview Date: 2015/02/04\nStore: William Holden  (Actor),     Grace Kelly  (Actor),     Mark Robson  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product description', 'Bridges at Toko-Ri (Full Screen) (Bilingual)', 'Amazon.com', 'A powerful study of courage in the face of irrational odds,', 'The Bridges at Toko-Ri', \"(based on James Michener's novel) is no less patriotic than many other war films, but it dispenses with gung-ho bluster to focus instead on the very real and tragic consequences of war. This is also one of the first films to openly criticize the morality of the Korean War while praising the honor and integrity of the men who fought it. Lt. Harry Brubaker (William Holden) is one of those men, with one difference: A lawyer with a loving wife (Grace Kelly) and two young daughters, he's been recalled to duty from the Navy Reserve, and reluctantly accepts his mission to fly with a bomber-jet squadron over one of the Communists' most heavily protected targets--the strategically vital bridges in the Korean canyon of Toko-Ri.\", \"Brubaker has his own noble protection, from his fellow pilots (including Charles McGraw in a fine supporting role), his admiring admiral (Frederic March), and from the helicopter scouts (Mickey Rooney and Earl Holliman) who've saved his life on previous missions. But his ambivalence--and his fear that the Toko-Ri mission will be his last--is what gives the film its potent emotional impact. Holden is perfect in his role, and director Mark Robson steadfastly avoids any false sentiment or macho theatrics that would diminish the film's devastating climax.\", 'The Bridges at Toko-Ri', 'is also a superlative showcase for Naval operations; the aerial sequences earned an Oscar for special effects, and complete Navy cooperation assures total authenticity in the \"flat-top\" aircraft carrier scenes. For these and other reasons, this will remain a timeless classic for anyone seeking to comprehend the emotional maelstrom of warfare.', '--Jeff Shannon']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 4 Ounces', 'Director': 'Mark Robson', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 42 minutes', 'Release date': 'May 22, 2001', 'Actors': 'William Holden, Grace Kelly, Fredric March, Mickey Rooney, Robert Strauss', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Studio': 'Paramount', 'Writers': 'James Michener, Valentine Davies', 'Number of discs': '1'}\nReview Text: Great old classic.<br /><br />Loved it.<br /><br />Carolyn G.\nReview Title: The Bridges of Toko-Ri\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Bullitt (DVD) (Rpkg)\nSteve McQueen  (Actor),     Robert Vaughn  (Actor),     Peter Yates  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Bullitt (DVD) (Rpkg)', \"There are bad cops and there are good cops ... and then there's Bullitt. Steve McQueen stars as Lt. Frank Bullitt in the role that made him a superstar as the hard-bitten police detective assigned to protect the star witness in a Congressional investigation. But when the witness is murdered, Bullitt mercilessly tracks a trail of lies and corruption that leads all the way to the halls of power in Washington. Steve McQueen performed his own stunts, driving the Ford Mustang in the high-speed pursuit through San Francisco that stands as one of the best and most famous car chases ever filmed.\", ']]>']\n{'Genre': 'Drama, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': \"Norman Fell, Robert Duvall, Don Gordon, Robert Relyea, Steve McQueen, Georg Stanford Brown, Philip D'Antoni, Felice Orlandi, Jacqueline Bisset, Carl Reindel, Peter Yates, Vic Tayback, Simon Oakland, Justin Tarr, Robert VaughnNorman Fell, Robert Duvall, Don Gordon, Robert Relyea, Steve McQueen, Georg Stanford Brown, Philip D'Antoni, Felice Orlandi, Jacqueline Bisset, Carl Reindel, Peter Yates, Vic Tayback, Simon Oakland, Justin Tarr, Robert Vaughn  See more\", 'Language': 'French (Dolby Digital 1.0), English (Dolby Digital 4.0), Spanish (Mono)', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '164748', 'Director': 'Peter Yates', 'Media Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Steve McQueen, Robert Vaughn, Jacqueline Bisset, Don Gordon, Robert Duvall', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': \"Philip D'Antoni, Robert Relyea\", 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat can I say about Bullitt, one of the best Steve McQueen movies of all time.  I know many people like his Great Escape, and so do I, but this movie has it all.  Romance, intrigue and a fantastic car chase!!!  Especially because it was set in San Francisco, what a place for a car chase.  The next best is our modern day \"Ronin\", but that's a different kind of chase.  It's set in Europe, where the street are super narrow.  This movie, Bullit, is a great cop movie also.  So if by chance you've missed it, it needs to go on  your must see list.<br />Carolyn Gleeson- Lover of Steve McQueen movies in any form.  In fact if you like Steve, see his motorcycle documentary,\"On any Sunday\". Unbelievable!!!\nBullitt- must see for car buffs!\nLuminarias\nEvelina Fernandez  (Actor),     Scott Bakula  (Actor),     Jose Luis Valenzuela  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{}\nThis is one of my favorite movies. Sort of like a Latina, &#34;Waiting to Exhale&#34;.  I love the characters and how they explore every facet, whether it's real or a myth about the way people perceive each other.  It is funny, poignant and serious all at the same time.  And the music is fabulous, the best soundtrack ever.  This is a great rainy day movie and one that you will watch over and over again.<br />Carolyn G\nLuminarias-movie\nOn Any Sunday - Re-Mastered-Director's Special Edition 2 Disc Set\nBruce Brown  (Actor, Director),     Mert Lawwill  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n['Featuring Steve McQueen with music by the famed Dominick Fronteirie, this film is without a doubt the quintessential motorcycle film, now digitally remastered and loaded with never-before-seen extras.']\n{'Genre': 'Sports', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Contributor': 'Bruce Brown, Malcolm Smith, Mert Lawwill, Steve McQueen', 'Language': 'Unqualified', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Item model number': 'Relay Time: 88 min; 2Videos', 'Director': 'Bruce Brown', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Bruce Brown, Mert Lawwill, Malcolm Smith, Steve McQueen', 'Studio': 'Monterey Video', 'Country of Origin': 'USA', 'Number of discs': '2'}\nProbably the great motorcycle movie every made.  I love all the other Bruce Brown movies, the ones about surfing around the world.  He's an incredible person and hits the pulse of motocycle riding with this film.\nOn any Sunday-Motorcyle movie extraordinare!!!\n47 Ronin\nKeanu Reeves  (Actor),     Hiroyuki Sanada  (Actor),     Carl Rinsch  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Keanu Reeves stars in the action-adventure epic, 47 Ronin. After a treacherous warlord kills their master and banishes their kind, 47 leaderless samurai vow to seek vengeance and reclaim their honor. This band of ronin must seek help from Kai (Reeves)—an enslaved half-breed they once rejected—in their ultimate fight for redemption in a savage world of mythic and wondrous terrors. Kai becomes their most deadly weapon and the heroic inspiration for these outnumbered warriors to confront their enemy and seize eternity.', 'Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Re-forging the Legend', 'Re-forging the Legend', ']]>']\n{'Genre': 'revenge movie, movie night, buy movie, DVD movie, Blu-ray movie, fantasy movie, samurai movie, 4K movie, digital movie, Action & Adventure, rent movie, action movie, adventure movierevenge movie, movie night, buy movie, DVD movie, Blu-ray movie, fantasy movie, samurai movie, 4K movie, digital movie, Action & Adventure, rent movie, action movie, adventure movie  See more', 'Format': 'Color, Multiple Formats, Widescreen, NTSC', 'Contributor': 'Ko Shibasaki, Cary-Hiroyuki Tagawa, Hiroyuki Sanada, Min Tanaka, Pamela Abdy, Keanu Reeves, Tadanobu Asano, Carl Rinsch, Hossein Amini, Rinko Kikuchi, Eric McLeod, Chris MorganKo Shibasaki, Cary-Hiroyuki Tagawa, Hiroyuki Sanada, Min Tanaka, Pamela Abdy, Keanu Reeves, Tadanobu Asano, Carl Rinsch, Hossein Amini, Rinko Kikuchi, Eric McLeod, Chris Morgan  See more', 'Initial release date': '2014-04-01', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '29093346', 'Director': 'Carl Rinsch', 'Media Format': 'Color, Multiple Formats, Widescreen, NTSC', 'Run time': '1 hour and 59 minutes', 'Release date': 'April 1, 2014', 'Actors': 'Keanu Reeves, Hiroyuki Sanada, Tadanobu Asano, Rinko Kikuchi, Ko Shibasaki', 'Subtitles': 'Spanish, French', 'Producers': 'Pamela Abdy, Eric McLeod', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Chris Morgan, Hossein Amini', 'Country of Origin': 'USA', 'Number of discs': '1'}\n47 Ronin wonderful movie, a bit of history, a bit of Sci fi, fantasy and a real spectacle.  Really enjoyed it.<br /><br />Carolyn G\n47 Ronin\nDespicable Me 2\nSteve Carell  (Actor),     Kristen Wiig  (Actor),     Chris Renaud  (Director),     Pierre Coffin  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', 'Gru, his adorable girls, and the mischievous Minions are back with a cast of unforgettable new characters in the blockbuster sequel to the worldwide phenomenon. Just as Gru has given up being super-bad to be a super-dad, the Anti-Villain League recruits him to track down a new criminal mastermind and save the world. Partnered with secret agent Lucy Wilde, Gru, along with the wildly unpredictable Minions, must figure out how to keep his cover while also keeping up with his duties as a father. Assemble the Minions for laugh-out-loud comedy in \"one of the funniest, most enjoyable movies ever!\" (MovieGuide).', 'There are multiple versions of this movie cover and each shipment is random. Customers are not guaranteed to receive a specific cover or to receive different covers with multiple purchases.', 'Amazon.com', \"Sticky doesn't begin to describe Gru's new life: the ex-supervillain has given up his villainous ways and he and Dr. Nefario (Russell Brand) have settled into the legitimate business of making jellies and jams with the help of his army of minions. Parenting is no less sticky, and the fact that Gru will go to any length to ensure the happiness of his adopted girls Agnes, Edith, and Margo is evident by the elaborate birthday party he's throwing for Agnes that includes a live unicorn and a princess named Gruzinkerbell. Anti-Villain League operative Lucy Wild (Kristen Wiig) kidnaps Gru after the party, using an arsenal of spy gadgetry that would make James Bond jealous, and the agency solicits his help in apprehending a criminal who's made an entire secret lab disappear from the Arctic Circle and stolen a dangerous transmutation formula. The lure of excitement tempts Gru, and he and Lucy set up an undercover operation in a bakery in Paradise Mall, the minions start cranking out cupcakes, and Gru and Lucy begin investigating their fellow business owners. Meanwhile, Agnes pines for a mother, Margo finds her first boyfriend, Dr. Nefario takes a more exciting job, a slew of minions go missing, and Gru staunchly refuses to enter the dating scene. Little does Gru know that his whole life is about to change once again. The minions and their antics are quite funny in this second film, and, for the 10-and-under crowd, they completely steal the show. For the older crowd, the film does a decent job of further developing Gru's character and provides lots of comedic material in the exaggeration of the many challenges of parenthood as well as through the wacky exploits of the minions. (Ages 6 and older)\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family, Animation, Comedy', 'Format': 'Animated, Color, NTSC, Widescreen', 'Contributor': 'Elsie Kate Fisher, Steve Carell, Nasim Pedrad, Christopher Meledandri, Pierre Coffin, Ken Jeong, Ken Daurio, Dana Gaier, Cinco Paul, Chris Renaud, Gregory Perler, Janet Healy, Benjamin Bratt, Miranda Cosgrove, Moises Arias, Kristen Wiig, Russell Brand, Steve CooganElsie Kate Fisher, Steve Carell, Nasim Pedrad, Christopher Meledandri, Pierre Coffin, Ken Jeong, Ken Daurio, Dana Gaier, Cinco Paul, Chris Renaud, Gregory Perler, Janet Healy, Benjamin Bratt, Miranda Cosgrove, Moises Arias, Kristen Wiig, Russell Brand, Steve Coogan  See more', 'Initial release date': '2013-12-10', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': 'D61120669D', 'Director': 'Chris Renaud, Pierre Coffin', 'Media Format': 'Animated, Color, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'December 10, 2013', 'Actors': 'Steve Carell, Kristen Wiig, Benjamin Bratt, Ken Jeong, Miranda Cosgrove', 'Subtitles': 'Spanish, French', 'Producers': 'Christopher Meledandri, Janet Healy', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cinco Paul, Ken Daurio', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove the Minions, so this is a favorite of mine.<br /><br />Carolyn G.\nFive Stars\nLucy\nScarlett Johansson  (Actor),     Morgan Freeman  (Actor),     Luc Besson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Science Fiction\n['From La Femme Nikita and The Professional to The Fifth Element, writer/director Luc Besson has created some of the toughest, most memorable female action heroes in cinematic history. Now, Besson directs Scarlett Johansson in Lucy, an action-thriller that tracks a woman accidentally caught in a dark deal who turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic. Lucy also stars Academy Award winner Morgan Freeman.']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '61131844', 'Director': 'Luc Besson', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 20, 2015', 'Actors': 'Scarlett Johansson, Morgan Freeman, Min-Sik Choi', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unknown (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLoved this movie, more interesting then i first expected.  Great food for thought.<br /><br />Carolyn G.\nFive Stars\nThe Bridges at Toko-Ri\nWilliam Holden  (Actor),     Grace Kelly  (Actor),     Mark Robson  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product description', 'Bridges at Toko-Ri (Full Screen) (Bilingual)', 'Amazon.com', 'A powerful study of courage in the face of irrational odds,', 'The Bridges at Toko-Ri', \"(based on James Michener's novel) is no less patriotic than many other war films, but it dispenses with gung-ho bluster to focus instead on the very real and tragic consequences of war. This is also one of the first films to openly criticize the morality of the Korean War while praising the honor and integrity of the men who fought it. Lt. Harry Brubaker (William Holden) is one of those men, with one difference: A lawyer with a loving wife (Grace Kelly) and two young daughters, he's been recalled to duty from the Navy Reserve, and reluctantly accepts his mission to fly with a bomber-jet squadron over one of the Communists' most heavily protected targets--the strategically vital bridges in the Korean canyon of Toko-Ri.\", \"Brubaker has his own noble protection, from his fellow pilots (including Charles McGraw in a fine supporting role), his admiring admiral (Frederic March), and from the helicopter scouts (Mickey Rooney and Earl Holliman) who've saved his life on previous missions. But his ambivalence--and his fear that the Toko-Ri mission will be his last--is what gives the film its potent emotional impact. Holden is perfect in his role, and director Mark Robson steadfastly avoids any false sentiment or macho theatrics that would diminish the film's devastating climax.\", 'The Bridges at Toko-Ri', 'is also a superlative showcase for Naval operations; the aerial sequences earned an Oscar for special effects, and complete Navy cooperation assures total authenticity in the \"flat-top\" aircraft carrier scenes. For these and other reasons, this will remain a timeless classic for anyone seeking to comprehend the emotional maelstrom of warfare.', '--Jeff Shannon']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 4 Ounces', 'Director': 'Mark Robson', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 42 minutes', 'Release date': 'May 22, 2001', 'Actors': 'William Holden, Grace Kelly, Fredric March, Mickey Rooney, Robert Strauss', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Studio': 'Paramount', 'Writers': 'James Michener, Valentine Davies', 'Number of discs': '1'}\nGreat old classic.<br /><br />Loved it.<br /><br />Carolyn G.\nThe Bridges of Toko-Ri",
  "profile": "The user is a passionate film enthusiast with a strong preference for classic action and adventure films, particularly those featuring iconic actors like Steve McQueen. They admire character-driven narratives intertwined with romance, intrigue, and thrilling elements, emphasizing high production values and exceptional stunt work in captivating locales. Recently, they've expanded their cinematic palette to include compelling comedies that explore rich character dynamics while blending humor with poignant themes, as well as both classic and contemporary sports cinema, appreciating original works alongside fresh interpretations.\n\nTheir latest interactions reveal a growing affinity for science fiction films, especially those with strong female leads and action-oriented plots, where they find depth and thought-provoking elements alongside entertainment. Additionally, the user has shown an interest in classic dramas that explore emotional and moral complexities, highlighting their appreciation for well-crafted storytelling across various genres.\n\nOverall, the user embodies a well-rounded film lover eager to experience diverse storytelling, maintaining a particular affection for captivating adventures and classic narratives while now embracing animated features and science fiction, which align with their comedic sensibilities and love for character-rich narratives.",
  "metrics": {
    "rouge1_f": 0.07706696595585484,
    "rouge2_f": 0.0067390490453013855,
    "rougeL_f": 0.03666292555181445,
    "meteor": 0.021755894621205685,
    "bleu1": 2.7821468668247872e-08,
    "bleu2": 1.0541914556027072e-08,
    "bleu3": 3.2497315219010057e-09,
    "bleu4": 1.0159239987884548e-09,
    "bertscore_precision": 0.32257789373397827,
    "bertscore_recall": 0.4902029037475586,
    "bertscore_f1": 0.3891052007675171
  }
}