{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: On Any Sunday - Re-Mastered-Director's Special Edition 2 Disc Set\nReview Date: 2013/12/09\nStore: Bruce Brown  (Actor, Director),     Mert Lawwill  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, Special Editions\nProduct Description: ['Featuring Steve McQueen with music by the famed Dominick Fronteirie, this film is without a doubt the quintessential motorcycle film, now digitally remastered and loaded with never-before-seen extras.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Sports', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Contributor': 'Bruce Brown, Malcolm Smith, Mert Lawwill, Steve McQueen', 'Language': 'Unqualified', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Item model number': 'Relay Time: 88 min; 2Videos', 'Director': 'Bruce Brown', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Bruce Brown, Mert Lawwill, Malcolm Smith, Steve McQueen', 'Studio': 'Monterey Video', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Probably the great motorcycle movie every made.  I love all the other Bruce Brown movies, the ones about surfing around the world.  He's an incredible person and hits the pulse of motocycle riding with this film.\nReview Title: On any Sunday-Motorcyle movie extraordinare!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Bullitt (DVD) (Rpkg)\nSteve McQueen  (Actor),     Robert Vaughn  (Actor),     Peter Yates  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Bullitt (DVD) (Rpkg)', \"There are bad cops and there are good cops ... and then there's Bullitt. Steve McQueen stars as Lt. Frank Bullitt in the role that made him a superstar as the hard-bitten police detective assigned to protect the star witness in a Congressional investigation. But when the witness is murdered, Bullitt mercilessly tracks a trail of lies and corruption that leads all the way to the halls of power in Washington. Steve McQueen performed his own stunts, driving the Ford Mustang in the high-speed pursuit through San Francisco that stands as one of the best and most famous car chases ever filmed.\", ']]>']\n{'Genre': 'Drama, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': \"Norman Fell, Robert Duvall, Don Gordon, Robert Relyea, Steve McQueen, Georg Stanford Brown, Philip D'Antoni, Felice Orlandi, Jacqueline Bisset, Carl Reindel, Peter Yates, Vic Tayback, Simon Oakland, Justin Tarr, Robert VaughnNorman Fell, Robert Duvall, Don Gordon, Robert Relyea, Steve McQueen, Georg Stanford Brown, Philip D'Antoni, Felice Orlandi, Jacqueline Bisset, Carl Reindel, Peter Yates, Vic Tayback, Simon Oakland, Justin Tarr, Robert Vaughn  See more\", 'Language': 'French (Dolby Digital 1.0), English (Dolby Digital 4.0), Spanish (Mono)', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '164748', 'Director': 'Peter Yates', 'Media Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Steve McQueen, Robert Vaughn, Jacqueline Bisset, Don Gordon, Robert Duvall', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': \"Philip D'Antoni, Robert Relyea\", 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat can I say about Bullitt, one of the best Steve McQueen movies of all time.  I know many people like his Great Escape, and so do I, but this movie has it all.  Romance, intrigue and a fantastic car chase!!!  Especially because it was set in San Francisco, what a place for a car chase.  The next best is our modern day \"Ronin\", but that's a different kind of chase.  It's set in Europe, where the street are super narrow.  This movie, Bullit, is a great cop movie also.  So if by chance you've missed it, it needs to go on  your must see list.<br />Carolyn Gleeson- Lover of Steve McQueen movies in any form.  In fact if you like Steve, see his motorcycle documentary,\"On any Sunday\". Unbelievable!!!\nBullitt- must see for car buffs!\nLuminarias\nEvelina Fernandez  (Actor),     Scott Bakula  (Actor),     Jose Luis Valenzuela  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{}\nThis is one of my favorite movies. Sort of like a Latina, &#34;Waiting to Exhale&#34;.  I love the characters and how they explore every facet, whether it's real or a myth about the way people perceive each other.  It is funny, poignant and serious all at the same time.  And the music is fabulous, the best soundtrack ever.  This is a great rainy day movie and one that you will watch over and over again.<br />Carolyn G\nLuminarias-movie\nOn Any Sunday - Re-Mastered-Director's Special Edition 2 Disc Set\nBruce Brown  (Actor, Director),     Mert Lawwill  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n['Featuring Steve McQueen with music by the famed Dominick Fronteirie, this film is without a doubt the quintessential motorcycle film, now digitally remastered and loaded with never-before-seen extras.']\n{'Genre': 'Sports', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Contributor': 'Bruce Brown, Malcolm Smith, Mert Lawwill, Steve McQueen', 'Language': 'Unqualified', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Item model number': 'Relay Time: 88 min; 2Videos', 'Director': 'Bruce Brown', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Bruce Brown, Mert Lawwill, Malcolm Smith, Steve McQueen', 'Studio': 'Monterey Video', 'Country of Origin': 'USA', 'Number of discs': '2'}\nProbably the great motorcycle movie every made.  I love all the other Bruce Brown movies, the ones about surfing around the world.  He's an incredible person and hits the pulse of motocycle riding with this film.\nOn any Sunday-Motorcyle movie extraordinare!!!",
  "profile": "**User Summary:**\n\nThe user exhibits a strong preference for classic action and adventure films, particularly those featuring iconic actors like Steve McQueen, and deeply admires character-driven narratives that weave together romance, intrigue, and thrilling car chases. They favor high production value, notable stunt work, and well-crafted suspense, often enjoying high-octane pursuits set in captivating locations like San Francisco. \n\nRecent interactions have revealed their film interests extend into compelling comedies that offer rich character exploration, favoring narratives that blend humor with poignant themes and provide social commentary. This shows a keen appreciation for quality storytelling across diverse genres, including a growing interest in sports cinema. The user remains open to both classic and contemporary titles, valuing original works while embracing fresh interpretations. \n\nTheir recent purchase and enthusiastic review of a quintessential motorcycle film further highlights their appreciation for Steve McQueen’s contributions to cinema and the broader context of films that celebrate thrilling adventures, whether on four wheels or two. Overall, the user is positioned as a passionate film enthusiast, valuing cinematic experiences that blend humor and depth while maintaining a particular affinity for iconic figures and classic storytelling.",
  "metrics": {
    "rouge1_f": 0.1625,
    "rouge2_f": 0.022964509394572022,
    "rougeL_f": 0.07916666666666668,
    "meteor": 0.05684781602489304,
    "bleu1": 0.005180346657038425,
    "bleu2": 0.0022626010876410614,
    "bleu3": 0.0008783856001531769,
    "bleu4": 0.00025910731145775364,
    "bertscore_precision": 0.3510609269142151,
    "bertscore_recall": 0.4710044264793396,
    "bertscore_f1": 0.4022825062274933
  }
}