{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/08/24\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Eric S. Smith'], 'Producers': ['Natalia Baldwin León', 'Julie Insogna', 'Seth Jarrett', 'Jennifer L. Rettig', 'Erin Shockey', 'Rick Van Meter', 'Donnie Wahlberg', 'Robert Wahlberg', 'Tim Davis'], 'Studio': ['TNT']}\nReview Text: I enjoy realistic shows and this was excellent.  Police are getting a bad rap and this shows they are caring people<br /> willing to keep our streets safe.\nReview Title: I enjoy realistic shows and this was excellent\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['J.C. Chandor'], 'Producers': ['Neal Dodson', 'Anna Gerb', 'Justin Nappi', 'Teddy Schwarzman'], 'Starring': ['Robert Redford'], 'Studio': ['Lionsgate']}\nI have to say it was a bit concerting without any or very little dialog.  I also found myself a bit empty as I had no idea how he got himself in the predicament in the first place.  Odd ending, but that was OK, sort of.  We had sailboats for years and I related to the sailing part of it.  Never been lost myself, but was in some pretty foggy weather.\nbut was in some pretty foggy weather\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jean-Marc Vallee'], 'Producers': ['Robbie Brenner', 'Rachel Winter'], 'Starring': ['Matthew McConaughey', 'Jennifer Garner', 'Jared Leto'], 'Studio': ['Universal City Studios Product']}\nI did not even get past the graphic sex part in the beginning.  I was told to watch it through that to get the feeling for where he came from.  OK, I just complained about not knowing the history of All is Lost so which way do I want it?  Hmmm.  OK, I will probably watch it all the way through, but for now I did not like it.\nI may change my mind on this one.\nFrozen\nComedy, Animation, Dreamlike, Exciting\n['Encountering Everest-like conditions, mystical trolls and a hilarious snowman named Olaf, Anna and Kristoff battle the elements in a race to save the kingdom.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Buck', 'Jennifer Lee'], 'Producers': ['Peter Del Vecho'], 'Starring': ['Kristen Bell', 'Idina Menzel', 'Jonathan Groff']}\nI loved it.  Great animation and great music.  I am a kid at heart, I guess.\nI loved it. Great animation and great music\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Lasse Hallstrom'], 'Producers': ['Steven Spielberg', 'Oprah Winfrey', 'Juliet Blake'], 'Starring': ['Helen Mirren', 'Om Puri', 'Manish Dayal']}\nThis was a wonderful movie.  My spouse and I totally enjoyed renting it.  I like these kinds of movies and this one was a winner for us.\nThis was a wonderful movie. My spouse and I totally enjoyed renting ...\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brett Ratner'], 'Producers': ['Eddie Murphy', 'Brian Grazer', 'Kim Roth'], 'Starring': ['Juan Carlos Hernandez', \"Harry O'reilly\", 'Ben Stiller']}\nThis was a light fun movie.  It was a good plot with twists and turns.  All in all, very entertaining.\nThis was a light fun movie. It was a good plot with twists ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Russell Crowe'], 'Producers': ['Andrew Mason', 'Keith Rodger', 'Troy Lum'], 'Starring': ['Russell Crowe', 'Olga Kurylenko', 'Yilmaz Erdogan'], 'Studio': ['WARNER BROS.']}\nThis was a very good movie.  It was well done.  Russell Crowe usually does good work.  It held my interest and I leaned more about WWI.  The father's journey was most interesting.  Some violence, but it was a war story.\nThis was a very good movie. It was well done\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Madden'], 'Producers': ['John Madden', 'Graham Broadbent', 'Peter Czernin', 'Michael Dreyer', 'Edward Gomez', 'Robert Lopez Gonzales', 'Jonathan King', 'Tabrez Noorani', 'Denis Pedregosa', 'Pravesh Sahni'], 'Starring': ['Judi Dench', 'Maggie Smith', 'Bill Nighy'], 'Studio': ['Fox Searchlight']}\nWe had seen the first Marigold Hotel movie and loved that.  It was fun to see everyone again with a sequel.  It was a happy movie and greatly enjoyed.\nWe had seen the first Marigold Hotel movie and loved that. It was fun to see everyone again ...\n{'Content advisory': ['Violence', 'alcohol use', 'smoking'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Simon Curtis'], 'Producers': ['David M. Thompson', 'Kris Thykier'], 'Starring': ['Ryan Reynolds', 'Helen Mirren', 'Katie Holmes'], 'Studio': ['Lionsgate']}\nThis was so well done.  I enjoyed it from beginning to end.  It was another wonderful story from WWII.  A woman who would not give up despite the government, as usual, thwarting the effort to retrieve something stolen from the family.  The acting was superb.  It was intriguing.  Great movie.\nI enjoyed it from beginning to end\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Eric S. Smith'], 'Producers': ['Natalia Baldwin León', 'Julie Insogna', 'Seth Jarrett', 'Jennifer L. Rettig', 'Erin Shockey', 'Rick Van Meter', 'Donnie Wahlberg', 'Robert Wahlberg', 'Tim Davis'], 'Studio': ['TNT']}\nI enjoy realistic shows and this was excellent.  Police are getting a bad rap and this shows they are caring people<br /> willing to keep our streets safe.\nI enjoy realistic shows and this was excellent",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to favor visually engaging storytelling, particularly in animated films with whimsical elements. Their appreciation for well-crafted dramas, especially those that highlight historical contexts, remains strong. A recent review reflects an enthusiasm for realistic narratives, particularly those that humanize complex subjects, such as policing in society. They enjoy feel-good stories that combine charm with entertainment.\n\n- **Emotion and Engagement:** While maintaining their introspective nature, the user expresses joy in gripping stories, including those with darker themes. Their latest interaction showcases a growing interest in narratives that resonate on a personal level, emphasizing emotional truth and authenticity.\n\n- **Interest in Themes:** The user's connection to isolation and survival themes persists but is complemented by an increasing openness to uplifting narratives. They are drawn to stories that blend realism with resilience and highlight human compassion amid challenges.\n\n- **Critical Approach:** Their reviews celebrate emotional depth and narrative engagement, often reflecting satisfaction through high ratings. They appreciate storytelling that balances serious themes with accessible, relatable content.\n\n- **Genre Awareness:** Mindful of content advisories, the user prefers films that intelligently mix serious themes with engaging storytelling.\n\n- **Viewing Format:** They continue to prefer English audio with subtitles, enhancing their experiences across both light-hearted and serious narratives.\n\nOverall, the user demonstrates a discerning taste in media, valuing rich, emotionally impactful stories that blend depth with engaging narratives across a variety of genres.",
  "metrics": {
    "rouge1_f": 0.13962635201573256,
    "rouge2_f": 0.005911330049261084,
    "rougeL_f": 0.06686332350049165,
    "meteor": 0.04430481714193653,
    "bleu1": 0.008772777263082345,
    "bleu2": 0.0009475735084273064,
    "bleu3": 0.00020969584300966192,
    "bleu4": 9.872865717271221e-05,
    "bertscore_precision": 0.3553978502750397,
    "bertscore_recall": 0.4374288022518158,
    "bertscore_f1": 0.3921695947647095
  }
}