{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NCIS: The Sixteenth Season\nReview Date: 2020/02/01\nStore: Maria Bello  (Actor),     Mark Harmon  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment\nProduct Description: [\"The cases of the Naval Criminal Investigative Service's Washington, D.C. Major Case Response Team, led by Special Agent Leroy Jethro Gibbs.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Sean Murray, Diona Reasonover, Mark Harmon, Rocky Carroll, David McCallum, Maria Bello, Brian Dietzen, Wilmer Valderrama, Emily WickershamSean Murray, Diona Reasonover, Mark Harmon, Rocky Carroll, David McCallum, Maria Bello, Brian Dietzen, Wilmer Valderrama, Emily Wickersham  See more', 'Language': 'English', 'Number Of Discs': '6', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 6.24 Ounces', 'Audio Description': 'English', 'Media Format': 'Subtitled, NTSC', 'Run time': '17 hours and 2 minutes', 'Release date': 'October 5, 2021', 'Actors': 'Maria Bello, Mark Harmon, Rocky Carroll, Sean Murray, Emily Wickersham', 'Subtitles': 'English', 'Studio': 'PARAMOUNT', 'Number of discs': '6'}\nReview Text: Color, sound & clarity are all GREAT\nReview Title: High Quality\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Paint Your Wagon\nClint Eastwood  (Actor),     Harve Presnell  (Actor),     Joshua Logan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Westerns\n['Alan J. Lerner and Frederick Loewe\\'s 1951 Broadway smash became the first and only musical undertaking for Clint Eastwood, who stars alongside Lee Marvin as two corners of a love triangle involved with beautiful Jean Seberg and partners in a bizarre financial enterprise in Gold Rush-era California. Songs include \"They Call the Wind Maria,\" \"I Talk to the Trees,\" and \"I\\'m on My Way\"; directed by Joshua Logan. 164 min. Widescreen (Enhanced); Soundtracks: English Dolby Digital 5.1, Dolby Digital Surround, French Dolby Digital mono; Subtitles: English; theatrical trailer.']\n{'Genre': 'Musicals & Performing Arts/Musicals/General, Westerns', 'Format': 'Subtitled, NTSC', 'Contributor': 'Ray Walston, Joshua Logan, Harve Presnell, Jean Seberg, Clint Eastwood, Lee Marvin', 'Language': 'English', 'Runtime': '164 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'French', 'Item model number': 'paint-your-wagon', 'Director': 'Joshua Logan', 'Media Format': 'Subtitled, NTSC', 'Run time': '164 minutes', 'Release date': 'August 29, 2017', 'Actors': 'Clint Eastwood, Harve Presnell, Ray Walston, Jean Seberg, Lee Marvin', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nSorry to say but DVD SKIPS Purchased total of 2 each at different times, & different cost both SKIP 😝😭😓☹\nTHEY SKIP\nRise Of The Planet Of The Apes + Dawn Of The Planet Of The Apes Double Feature\nAndy Serkis  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n{'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Media Format': 'AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Release date': 'May 9, 2017', 'Actors': 'Andy Serkis', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Surround)', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '2'}\nColor was good.\nDVD was clear, sound was good\nBlue Collar Comedy Tour 3-Pack\nJeff Foxworthy  (Actor, Writer),     Bill Engvall  (Actor, Writer),     C.B. Harding  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['For the first time ever, all three Blue Collar Comedy Tour movies are available to own in one complete set.']\n{'Genre': 'Comedy, Performing Arts', 'Format': 'Multiple Formats, Full Screen, NTSC, Widescreen', 'Contributor': 'Larry The Cable Guy, Ron White, Heidi Klum, David Alan Grier, C.B. Harding, Jeff Foxworthy, Bill EngvallLarry The Cable Guy, Ron White, Heidi Klum, David Alan Grier, C.B. Harding, Jeff Foxworthy, Bill Engvall  See more', 'Language': 'Unqualified', 'Runtime': '5 hours and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '7901587', 'Director': 'C.B. Harding', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Widescreen', 'Run time': '5 hours and 20 minutes', 'Release date': 'November 21, 2006', 'Actors': 'Jeff Foxworthy, Bill Engvall, Ron White, Larry The Cable Guy, Heidi Klum', 'Studio': 'Paramount', 'Writers': 'Bill Engvall, Jeff Foxworthy, Larry The Cable Guy, Ron White', 'Number of discs': '3'}\nGREAT, DVD had good color & sound\nGood Qu5\nThe Shadow Riders\nTom Selleck  (Actor),     Sam Elliott  (Actor),     Andrew McLaglen  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"The Civil War is over and the Traven brothers are going home. But what Mac (Tom Selleck, Quigley Down Under) and Dal (Sam Elliott, Tombstone) find upon their arrival is a town ravaged by Confederate rebels who've refused to surrender. Swearing to fight the Yankees to the bitter end, the guerillas have kidnapped the Travens' younger sisters - as well as Dal's sweetheart, Kate (Katharine Ross, Shenandoah) - and plan to sell them to a brothel in Mexico to raise money for guns and bullets. Determined to rescue their loved ones, Mac and Dal bust their Uncle Black Jack (Oscar(r) winner Ben Johnson, Best Actor in a Supporting Role, The Last Picture Show, 1971) out of prison and head south of the border, where they aim to finish a war they thought had already ended.\"]\n{'Genre': 'Action, Adventure', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Dubbed', 'Contributor': 'Dennis Durney, Tom Selleck, Ben Johnson, Geoffrey Lewis, Sam Elliott, Pegasus Group, Ltd./CPT, Katharine Ross, Gene Evans, Verne Nobles, Jeffrey Osterhage, Andrew McLaglenDennis Durney, Tom Selleck, Ben Johnson, Geoffrey Lewis, Sam Elliott, Pegasus Group, Ltd./CPT, Katharine Ross, Gene Evans, Verne Nobles, Jeffrey Osterhage, Andrew McLaglen  See more', 'Language': 'Unqualified, French (Mono)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '2856761', 'Director': 'Andrew McLaglen', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Dubbed', 'Run time': '1 hour and 36 minutes', 'Release date': 'May 13, 2008', 'Actors': 'Tom Selleck, Sam Elliott, Ben Johnson, Geoffrey Lewis, Jeffrey Osterhage', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Verne Nobles, Dennis Durney', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nEnjoyed DVD great color & sound\nGreat color & sound\nJesse Stone: Night Passage\nTom Selleck  (Actor),     Stephen Baldwin  (Actor),     Robert Harmon  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'A prequel to \"Stone Cold\" in the series of Jesse Stone novels by Robert B. Parker, the story picks up after Jesse Stone is fired from the Los Angeles Police Department. He becomes an unlikely candidate recruited by the town board of selectman to become police chief of Paradise, a small town on Boston\\'s North Shore. The board hopes his failed experience will keep him from digging too deep into the town\\'s secrets. Hungover on his first day on the job, he must investigate a domestic abuse case that ends up leaduing to a money laundering scheme perpetuated by a manager of a local bank.', 'Amazon.com', \"How Tom Selleck's world-weary cop Jesse Stone became the police chief of sleepy Paradise, Mass., is revealed in this engaging prequel to the first made-for-TV Stone feature,\", 'Stone Cold', \"(2005). Selleck is once again well cast as the rough-around-the-edges Stone, whose drinking problem gets him ejected from the Los Angeles police force; he soon finds himself the head lawman in a small New England fishing village, where his slow dissolution continues until a routine domestic disturbance case reveals connections to money laundering and murder, with several of the town's most affluent names as possible suspects. Selleck is well-matched by veteran scene stealer Saul Rubinek, and there's good work by Polly Shannon as a city attorney who becomes Stone's romantic interest, and Stephen Baldwin as an ill-tempered local. Fans of author Robert B. Parker (on whose books the Jesse Stone films are based) and Selleck won't be disappointed by this smart thriller.\", '--Paul Gaita']\n{'Genre': 'Drama, Mystery', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Polly Shannon, Sony Pictures Television, Tom Selleck, Steven J. Brandman, Stephen Baldwin, Kohl Sudduth, Viola Davis, Robert Harmon, Vito Rezza, Stephen McHattie, Saul Rubinek, Stephanie MarchPolly Shannon, Sony Pictures Television, Tom Selleck, Steven J. Brandman, Stephen Baldwin, Kohl Sudduth, Viola Davis, Robert Harmon, Vito Rezza, Stephen McHattie, Saul Rubinek, Stephanie March  See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2289013', 'Director': 'Robert Harmon', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'June 12, 2007', 'Actors': 'Tom Selleck, Stephen Baldwin, Stephanie March, Polly Shannon, Stephen McHattie', 'Dubbed': 'Thai, Portuguese, French', 'Subtitles': 'Thai, Mandarin Chinese, English, Portuguese, French, Spanish', 'Producers': 'Steven J. Brandman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat color and sound\nGreat sound and colo5\nHondo (Full Screen)\nMichael Pate  (Actor),     James Arness  (Actor),     John Farrow  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Based on the Louis L\\'Amour story \"The Gift of Cochise,\" this sparkling western has Wayne as a half-Indian Cavalry scout who, with his feral dog companion, finds a young woman and her son living on a isolated ranch in unfriendly Apache country. A poetic and exciting script, outstanding performances, and breathtaking scenery make this an indisputable classic. Page\\'s debut.']\n{'Genre': 'Westerns', 'Format': \"Multiple Formats, Color, Collector's Edition, NTSC, Full Screen, Special Edition\", 'Contributor': 'Michael Pate, John Wayne, John Farrow, Ward Bond, James Arness, Geraldine Page', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.35 x 7.52 x 0.63 inches; 2.12 Ounces', 'Item model number': '2238201', 'Director': 'John Farrow', 'Media Format': \"Multiple Formats, Color, Collector's Edition, NTSC, Full Screen, Special Edition\", 'Run time': '1 hour and 23 minutes', 'Release date': 'May 23, 2011', 'Actors': 'Michael Pate, James Arness, Geraldine Page, John Wayne, Ward Bond', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat can I  say, I love the cowboy. DVD had good color and sound\nGood value\nRoad House: Deluxe Edition (RPKG/DVD)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Road House: Deluxe Edition (RPKG/DVD)', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '109 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '133129', 'Director': 'Various', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '109 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat color & sound\nGood value\n3 Days of the Condor\nCarlin Glynn  (Actor),     Addison Powell  (Actor),     Sydney Pollack  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Action & Adventure', 'Format': 'Subtitled, NTSC', 'Contributor': 'Cliff Robertson, Carlin Glynn, Ed Setrakian, John Houseman, Helen Stenborg, Robert Redford, Faye Dunaway, Max Von Sydow, Hansford Rowe, Sydney Pollack, Addison Powell, Walter McGinn, Mike KaneCliff Robertson, Carlin Glynn, Ed Setrakian, John Houseman, Helen Stenborg, Robert Redford, Faye Dunaway, Max Von Sydow, Hansford Rowe, Sydney Pollack, Addison Powell, Walter McGinn, Mike Kane   See more', 'Language': 'English', 'Runtime': '117 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Item model number': '3-days-of-the-condor', 'Director': 'Sydney Pollack', 'Media Format': 'Subtitled, NTSC', 'Run time': '117 minutes', 'Release date': 'September 26, 2017', 'Actors': 'Carlin Glynn, Addison Powell, Ed Setrakian, Faye Dunaway, Cliff Robertson', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPicture quality OK but not great.\nOK for the price\n9 to 5 (Sexist, Egotistical, Lying Hypocritical Bigot Edition - Widescreen)\nJane Fonda  (Actor),     Lily Tomlin  (Actor),     Colin Higgins  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', \"In this witty, satirical farce, secretaries Dolly Parton, Jane Fonda and office manager Lily Tomlin live every female worker's dream after discovering they share the same resentment towards their egotistical, sexist boss (Dabney Coleman). When they get an unexpected chance to take revenge, they turn their male controlled workplace into a modle office - even as their scheme spins wildly out of control.\", 'Set Contains:', 'What\\'s on the \"Sexist, Egotistical, Lying Hypocritical Bigot Edition\" DVD of one of the more enduring comedies of the 1980s? The cast were obviously delighted for the opportunity to travel down memory lane, providing a commentary. Dolly Parton and Lily Tomlin recorded their bits in one city while Jane Fonda recorded hers simultaneously in another city, as they watched the movie again together. The three leads--one, Parton, a rookie actress--made for a well-balanced comedic team whose friendship has endured off-screen for 25 years, a friendship that comes across in their banter. A \"Nine At 25\" featurette finds the cast and producer dishing such tidbits as the fact Parton came to the set having memorized the entire script, everyone else\\'s parts included. A \"9 to 5\" karaoke feature may entertain depending on how many drinks one has had at the office party, but the words don\\'t always seem in sync with the music.', 'To celebrate the release of this edition of', '9 to 5', \", the cast, sans Dabney Coleman, reunited in Los Angeles for a party in which Dolly sang the theme song, memories were shared, and actresses dressed as '80s office workers acted busy in cubicles and reception desks.\", 'The Cast of', '9 to 5', 'Celebrate 25 Years of Sticking It to the Boss (click for larger image)']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition, Widescreen', 'Contributor': \"Lawrence Pressman, Gavin Mooney, Les Jankey, Michael Delano, Michael Hehr, Ren Woods, Lily Tomlin, Jerrold Ziman, Dabney Coleman, Edward Marshall, Esther Sutherland, Peter Hobbs, Colin Higgins, Elisabeth Fraser, Alan Haufrect, Vanna Salviati, Sterling Hayden, Barbara Chase, Brad David, Earl Boen, Gary Bisig, Jane Fonda, Eric Mansker, Roxanna Bonilla-Giannini, Jeffrey Douglas Thomas, Shirley Anthony, Tom Tarpey, David Price, Helene Heigh, Jessica Badovinac, Peggy Pope, Henry Jones, Ray Vitte, Elizabeth Wilson, Marian Mercer, Raymond O'Keefe, Terrence E. McNally, Richard Stahl, Norma Donaldson, Mark Rodney, Dolly Parton, Vicki Belmonte, Terry Jackson HouseLawrence Pressman, Gavin Mooney, Les Jankey, Michael Delano, Michael Hehr, Ren Woods, Lily Tomlin, Jerrold Ziman, Dabney Coleman, Edward Marshall, Esther Sutherland, Peter Hobbs, Colin Higgins, Elisabeth Fraser, Alan Haufrect, Vanna Salviati, Sterling Hayden, Barb…  See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'FOXS2233153DVD', 'Director': 'Colin Higgins', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'April 4, 2006', 'Actors': 'Jane Fonda, Lily Tomlin, Dolly Parton, Dabney Coleman, Sterling Hayden', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Studios', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGood sound and color.\nGood value\nThe Ghost and Mrs. Muir\nGene Tierney  (Actor),     Rex Harrison  (Actor),     Joseph L. Mankiewicz  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Dubbed, Full Screen, NTSC, Subtitled, Black & White, Closed-captioned', 'Contributor': 'Victoria Horne, Gene Tierney, Philip Dunne, Helen Freeman, George Sanders, Isobel Elsom, Edna Best, Stuart Holmes, Rex Harrison, Vanessa Brown, Robert Coote, Natalie Wood, Anna Lee, Joseph L. Mankiewicz, R.A. DickVictoria Horne, Gene Tierney, Philip Dunne, Helen Freeman, George Sanders, Isobel Elsom, Edna Best, Stuart Holmes, Rex Harrison, Vanessa Brown, Robert Coote, Natalie Wood, Anna Lee, Joseph L. Mankiewicz, R.A. Dick   See more', 'Language': 'English, French', 'Runtime': '1 hour and 44 minutes'}\nGood sound, good clarity in picture\nGood value\nThe Heat\nSandra Bullock  (Actor),     Melissa McCarthy  (Actor),     Paul Feig  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane CurtinMichael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane Curtin  See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes'}\nGood color and sound\nGood value\nMaltese Dog Grooming Instructional How To DVD Video and Equipment Guide-Do It Yourself At Home\nGroomingDvds\nMovies & TV, Genre for Featured Categories, Special Interests\n['This DVD is Performed and Explained by a Certified Pet Stylist! Why pay $45 and up to take your Maltese to the Groomer every 4-6 weeks? Buy this DVD and learn to do it all yourself at home with ease and confidence! You will learn how to express the anal glands and when you need to do this. I show in detail where the anal glands are located and what to expect while expressing the glands. You will learn how to bathe your pet without the struggle and the mess. I show in detail how to thoroughly bathe your pet to ensure the best results and proper maintenance of the skin and coat. You will learn how to use clippers, blades, shears, and more advanced grooming equipment. I show what is necessary for your pet and to get the desired groom so that you will not have to spend unnecessary amounts of money buying equipment you do not need. You will learn how to give your pet a haircut safely and how to maintain that cut. You will see how to easily cut out the lines for the cut, and how to make the cut look professional at home. You will learn how to do a thorough sanitary trim, how to get a smooth and detailed cut on the face and ears, and how to safely trim the face. You will learn the caution areas when cutting your pet and how to safely work around them. I show in detail all areas that are prone to injury and give advice on clipping around these areas to ensure that your pet has a safe groom. You will learn the different methods to grooming your pet and which one is right for you. You will learn how to safely handle your pet and reduce your risk of being bitten or having any accidents. I show in detail several different ways of holding your pet throughout the entire groom so that you can find the method that is most comfortable for you and your pet. I also give advice to help you remain calm and confident so that your pet is calm and confident giving you an easy grooming experience. Plus many other helpful hints.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.5 x 5.3 x 0.3 inches; 1.6 Ounces', 'Item model number': 'Maltese', 'Date First Available': 'March 20, 2009', 'Manufacturer': 'Le Spa De La Pooch'}\nGreat information, good video great instructions loved it.\nVery Detailed\nFive Card Stud\nDean Martin  (Actor),     Robert Mitchum  (Actor),     Henry Hathaway  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Westerns\n{'Genre': 'Westerns', 'Format': 'Dubbed, Subtitled, NTSC, Widescreen', 'Contributor': 'Katherine Justice, Roddy McDowall, Robert Mitchum, Bill Fletcher, Yaphet Kotto, Inger Stevens, Ruth Springford, Dean Martin, John Anderson, Denver Pyle, Henry HathawayKatherine Justice, Roddy McDowall, Robert Mitchum, Bill Fletcher, Yaphet Kotto, Inger Stevens, Ruth Springford, Dean Martin, John Anderson, Denver Pyle, Henry Hathaway  See more', 'Language': 'English', 'Runtime': '102 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.05 Ounces', 'Item model number': 'five-card-stud', 'Director': 'Henry Hathaway', 'Media Format': 'Dubbed, Subtitled, NTSC, Widescreen', 'Run time': '102 minutes', 'Release date': 'September 26, 2017', 'Actors': 'Dean Martin, Robert Mitchum, Inger Stevens, Roddy McDowall, Katherine Justice', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nGood qualty, sound & color\nGreat price\nNCIS: The Sixteenth Season\nMaria Bello  (Actor),     Mark Harmon  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment\n[\"The cases of the Naval Criminal Investigative Service's Washington, D.C. Major Case Response Team, led by Special Agent Leroy Jethro Gibbs.\"]\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Sean Murray, Diona Reasonover, Mark Harmon, Rocky Carroll, David McCallum, Maria Bello, Brian Dietzen, Wilmer Valderrama, Emily WickershamSean Murray, Diona Reasonover, Mark Harmon, Rocky Carroll, David McCallum, Maria Bello, Brian Dietzen, Wilmer Valderrama, Emily Wickersham  See more', 'Language': 'English', 'Number Of Discs': '6', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 6.24 Ounces', 'Audio Description': 'English', 'Media Format': 'Subtitled, NTSC', 'Run time': '17 hours and 2 minutes', 'Release date': 'October 5, 2021', 'Actors': 'Maria Bello, Mark Harmon, Rocky Carroll, Sean Murray, Emily Wickersham', 'Subtitles': 'English', 'Studio': 'PARAMOUNT', 'Number of discs': '6'}\nColor, sound & clarity are all GREAT\nHigh Quality",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user maintains a strong interest in classic films while now incorporating contemporary television series, demonstrating an evolving appreciation for diverse storytelling across formats.\n\n- **Genre Appreciation:** They enjoy musicals, comedies, action-adventure films, westerns, and television dramas, consistently favoring narratives that blend humor with emotional complexity and high-quality storytelling.\n\n- **Format Preference:** The user prefers DVDs, valuing superior audio-visual quality, craftsmanship, and the complete experience of physical media.\n\n- **Quality Concern:** Recent acquisitions emphasize their pursuit of high-quality productions, reflecting a keen interest in well-crafted films and series that offer exceptional sound and visual experiences.\n\n- **Rating Behavior:** They provide nuanced, positive reviews, frequently delivering high ratings supported by meaningful feedback.\n\n- **Emotional Engagement:** Their review style conveys emotional resonance and personal insights, adding depth to their perspectives.\n\n- **Collectors’ Interest:** The user actively curates iconic films and series across genres, showcasing their dedication to quality cinema and sophisticated storytelling.\n\n- **Expanding Interests:** They have ventured into instructional content and television, appreciating media that imparts valuable skills, reflecting an openness to explore diverse genres beyond traditional films.\n\nThis recent engagement highlights the user’s growing interest in television series, particularly in the action-adventure genre, further enhancing their collection and illustrating their evolving media preferences.",
  "metrics": {
    "rouge1_f": 0.05411314566821535,
    "rouge2_f": 0.0038282745419742953,
    "rougeL_f": 0.02732987154960372,
    "meteor": 0.014943344298952893,
    "bleu1": 1.393901166724948e-08,
    "bleu2": 3.15404006603382e-09,
    "bleu3": 5.223155001370344e-10,
    "bleu4": 2.127404629338968e-10,
    "bertscore_precision": 0.3521149754524231,
    "bertscore_recall": 0.49148768186569214,
    "bertscore_f1": 0.41028836369514465
  }
}