{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/01/21\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Brough'], 'Producers': ['Brian Brough', 'Steven A. Lee', 'Brittany Wiscombe'], 'Starring': ['Rachel Skarsten', 'Brant Daugherty', 'Jill Adler'], 'Studio': ['SunWorld Pictures']}\nReview Text: I like movies like this during the no-Christmas season. Sometimes I am SO disappointed in the actors. It is like the story drags on forever compared to movies that go to theater first. I will stop after 10-20 minutes in if I just cannot deal with it.  This story, I liked the liner and that it had 5 stars. Although the supporting actors and actresses left me wanting, the leads were REALLY good. The conversation flowed. The story line was so unique. I have had premonitions of my own in the past, and things like these could really happen. Believable characters and story made this something that I enjoyed immensely. I have seen the supporting actors in other movies, and some of them have done better I those roles, but overall. LOVED the locations and the way photography and writing were brought in. It actually was a motivating movie, that all we need is for ONE person to believe in us sometimes. And that we should not wait for something major to happen in our lives to reevaluate our current life-course. Will most likely watch it again with my girls. They LOVE movies like this, and they are hard to find. No sex, no swearing, no inappropriate content.\nReview Title: Surprisingly better than I expected. Good acting by leads.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike Binder'], 'Producers': ['Mike Binder', 'Cassian Elwes', 'Rod Lake', 'Jasa McCall', 'Ryan Kavanaugh', 'Tucker Tooley', 'Jacob Pechenk', 'Andy Neuberger', 'Robert Ogden Barnum', 'Alex Gartner', 'Kevin Costner', 'Todd Lewis'], 'Starring': ['Kevin Costner', 'Octavia Spencer', 'Anthony Mackie'], 'Studio': ['RELATIVITY MEDIA']}\nStrong language. Overall theme was good and it was entertaining.\nOverall theme was good and it was entertaining\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chip Chalmers', 'Cliff Bole', 'David Carson', 'Gabrielle Beaumont', 'Michael Wagner', 'Jonathan Frakes', 'Les Landau', 'Robert Legato', 'Robert Scheerer', 'Robert Wiemer', 'Shari Goodhart', 'Timothy Bond', 'Tom Benko', 'Winrich Kolbe'], 'Producers': ['Rick Berman', 'Michael Piller', 'Jeri Taylor'], 'Starring': ['Patrick Stewart', 'Jonathan Frakes', 'Levar Burton'], 'Studio': ['CBS']}\nI still dins this series fun and entertaining. I uses to watch it with my dad after work 20 years ago. Still love Jean-Luc Picard...but enjoying all of the characters a little more now that I am older. And my kids watch it with me. Nearly impossible to find a series that we can all watch together anymore...This will always be a favorite of mine.\nI still dins this series fun and entertaining\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chip Chalmers', 'Cliff Bole', 'Corey Allen', 'David Carson', 'David Livingston', 'Gabrielle Beaumont', 'Jonathan Frakes', 'Les Landau', 'Patrick Stewart', 'Paul Lynch', 'Peter Lauritson', 'Robert Lederman', 'Robert Scheerer', 'Robert Weimer', 'Winrich Kolbe'], 'Producers': ['Rick Berman', 'Michael Piller', 'Jeri Taylor'], 'Starring': ['Patrick Stewart', 'Jonathan Frakes', 'Levar Burton'], 'Studio': ['CBS']}\nMy sister and I grew up watching this show with our dad, and later the reruns after Jay Leno was on. My dad has since passed away and in an effort to connect him to my kids all four of them watxh the STNG reruns with me. We love them. Cutting edge for 25 years ago. And family friendly plots and episodes (with enough adult humour and scenes to keep the adults interested). As entertaining today as 20 yeara ago...and it still excites my son to think of the &#34;possibilities!&#34;\nToday or 25 Years ago\n{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English [CC]', 'Español (Latinoamérica)'], 'Directors': ['Robert Stevenson'], 'Producers': ['Bill Walsh'], 'Starring': ['Angela Lansbury', 'David Tomlinson'], 'Studio': ['Walt Disney Pictures']}\nOne of the best Disney movies ever. My littler children not as interested in it as the older ones.\nOne of the best Disney movies ever\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['John Walker'], 'Starring': ['Craig T. Nelson', 'Holly Hunter', 'Samuel L. Jackson'], 'Studio': ['Pixar']}\nGreat movie for the whole family! It is one of our favorites! :)\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Apted'], 'Producers': ['Andrew Adamson', 'Micheal Flaherty', 'Cary Granat', 'Douglas Gresham', 'Mark Johnson', 'Cort Kristensen', 'Perry Moore', 'Haroon Saleem', 'Jessie Thiele Schroeder'], 'Starring': ['Ben Barnes', 'Skandar Keynes', 'Georgie Henley', 'Will Poulter'], 'Studio': ['Fox']}\nMy 7 year olds favorite series!\nFive Stars\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['J.A. Bayona'], 'Producers': ['Frank Marshall', 'Patrick Crowley', 'Belén Atienza'], 'Starring': ['Chris Pratt', 'Bryce Dallas Howard', 'Rafe Spall']}\nNot as good as the first Jurassic World, and the story was a little weak...but overall it was good enough to purchase.\nNot as good as the first Jurassic World\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Favreau'], 'Producers': ['Avi Arad', 'Kevin Feige'], 'Starring': ['Robert Downey Jr.', 'Terrence Howard', 'Jeff Bridges'], 'Studio': ['Marvel']}\nRobert Downey Jr. Enough said!\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Rian Johnson'], 'Producers': ['Kathleen Kennedy', 'Ram Bergman'], 'Starring': ['Oscar Isaac', 'Mark Hamill', 'Daisy Ridley']}\nStar Wars fans since we were 3 years old and saw A New Hope in the theaters for the first time. This had wonderful twists and spins, and loved seeing Luke in this capacity albeit not the Luke that we remember. Fun for the whole family!\nThis had wonderful twists and spins\n{'Audio languages': ['English', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Brad Peyton'], 'Producers': ['Michael Bostick', 'Richard Brener', 'Samuel J. Brown', 'Michael Disco', 'Adam Ellison', 'Beau Flynn', 'Hiram Garcia', 'Charlotte Huggins', 'Dwayne Johnson'], 'Starring': ['Dwayne Johnson', 'Josh Hutcherson', 'Michael Caine'], 'Studio': ['New Line']}\nThis movie is so fun! It is like going on a ride at Disneyland! Of course Dwayne Johnson is easy on the eyes, but he delivers humor so well. My children loved both movies, but this one was their favorite. Who knew a sequel could be better than the first one? But this was like Land of the Lost meets Honey I Shrunk the Kids! Appropriate for all ages with some minor adult humor moments.\nThis movie is so fun! It is like going on a ride at ...\n{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)', 'Español (Latinoamérica) [CC]'], 'Directors': ['Kenny Ortega'], 'Producers': ['Michael Finnell'], 'Starring': ['Christian Bale', 'David Moscow', 'Bill Pullman'], 'Studio': ['Walt Disney Pictures']}\nOne of our all time favorite movies and plays! My children sing the songs from Newsies around the house on Disney's Pandora. We love Christian Bale and the story is historical fiction, so it is both education and fun. I think it provided an opportunity for me to explain to my own children how EASY they have it, and had they been born a century earlier this could be them...working 10-12 hours a day in a factory or selling newspapers. The songs though, so catchy. Fun for the whole family on movie night!\n\"It's a Fine Life, Carrying the Banner in New York!\"\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Chbosky'], 'Producers': ['David Hoberman', 'Todd Lieberman'], 'Starring': ['Julia Roberts', 'Jacob Tremblay', 'Owen Wilson'], 'Studio': ['Lionsgate']}\nMy children had a very very good friend who had a disfigured face due to a car accident when he was 2 yrs old. He was so precious to all of us. He could play with our 3 year old, or hang out with our son who was his age though my son towered over him. My son was very protective of him. He passed away in his sleep just before Christmas when he was 12 years old. Our hearts were broken. When we saw the trailers for &#34;Wonder,&#34; about six months after his death, we all KNEW that he HAD to see this movie together. We watched it in our home, and all of us cried. We all were amazed at the strength of this young boy, and were cheering his victories and crying during his sadness. We saw so much of our little friend in Auggie. It brought us closer to him. Our children already had had their learning experiences with their friend, but they all felt deeply for Auggie and as such, will never forget this story. It teaches so much about what is on the inside, and that those who are different from us...they can have the best stories!\nMy children had a very very good friend who had a disfigured face due to a ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad J. Silverman'], 'Producers': ['Robert Norton', 'Russ Rice', 'Larry Frenzel', 'Christopher M. Zarpas'], 'Starring': ['Aj Michalka', 'James Denton', 'Kevin Pollak'], 'Studio': ['ROADSIDE ATTRACTIONS LLC']}\nAlthough the plot was a little predictable (The Prodigal's Daughter), the music was amazing. And the lead's transition was also a wonderful, feel-good movie that I cannot wait to watch it with my daughters. Lots of great lessons to share and discover in this movie. Highly recommend.\nGreat Movie To Watch With My Teenage Girls\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chantelle Squires'], 'Producers': ['Brent Geisler', 'Melissa Leilani Larson', 'Tamu Smith', 'Chantelle Squires', 'Zandra Vranes'], 'Starring': ['Danielle Deadwyler', 'Emily Goss', 'Brad Schmidt'], 'Studio': ['Samuel Goldwyn Films']}\nThis was a Number 1 pick at a bookstore I was in, and I had also seen it advertised as a new release. I was excited to hear about Jane Mannings experiences with the Latter-day Saint people. Though I am not delusional enough to believe that the African-American's of that time were always treated equally, I also cannot see that Emma and Joseph would have ever knowingly hurt a person they cared and loved as they did Jane. From what I have read, Joseph and Emma loved Jane very much. From my studies it seems out of character for either of them to have spoken about or to Jane in a way that was condescending. I suppose I could be wrong. I suppose most of my thoughts regarding this are simply imagined as was this movie. It felt as if a message or agenda was being pushed where there wasn't any fact-based evidence to support that these events occurred. Perhaps I missed the notice of it being more than historical fiction. Either way, it just felt really off right up until the end. I would not watch it again myself. Would not recommend it either.\nVERY Disappointed\n{'Audio languages': ['English', 'English [Audio Description]', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)', 'Español (Latinoamérica) [CC]'], 'Directors': ['Rob Marshall'], 'Producers': ['Rob Marshall', 'John DeLuca', 'Marc Platt'], 'Starring': ['Emily Blunt', 'Ben Whishaw', 'Pixie Davies'], 'Studio': ['Walt Disney Pictures']}\nI had didn't have high expectations of this movie. I am tired of Disney redoing the classic movies and computer/lifelike film versions of our favorite animations. I love Emily Blunt...but not in this role. I felt that the whole movie lacked a strong execution of a storyline. That Mary Poppins came in and barely introduced herself before all her \"magic\" began. There was no real reason behind some of their adventures. Most were unnecessary. There was nearly no connection between Mary and Burt. Esp given their history...or even that Michael and Jane wouldn't be more excited that she was there??? It all was awkward. Sorry Disney, I will stick with Julie Andrews and Dick VanDyke. So quite redoing the movies!!!\nI was bored.\n{'Content advisory': ['Substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Thea Sharrock'], 'Producers': ['Karen Rosenfelt', 'Alison Owen'], 'Starring': ['Emilia Clarke', 'Sam Claflin', 'Janet McTeer'], 'Studio': ['New Line']}\nI LOVED this movie. The characters were completely wonderful. The actors did a brilliant job. The title song, \"Unsteady\" has helped me SO much since my husband died unexpectedly in April. I have thought of this movie and that song SO many times since. I believe that this is what true love is. This story is really beautiful, funny, cute and clever. It will be right up there with the Notebook for me.\nBeautiful & Heartbreaking Love Story-With a Beautiful Theme Song\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Brough'], 'Producers': ['Brian Brough', 'Steven A. Lee', 'Brittany Wiscombe'], 'Starring': ['Rachel Skarsten', 'Brant Daugherty', 'Jill Adler'], 'Studio': ['SunWorld Pictures']}\nI like movies like this during the no-Christmas season. Sometimes I am SO disappointed in the actors. It is like the story drags on forever compared to movies that go to theater first. I will stop after 10-20 minutes in if I just cannot deal with it.  This story, I liked the liner and that it had 5 stars. Although the supporting actors and actresses left me wanting, the leads were REALLY good. The conversation flowed. The story line was so unique. I have had premonitions of my own in the past, and things like these could really happen. Believable characters and story made this something that I enjoyed immensely. I have seen the supporting actors in other movies, and some of them have done better I those roles, but overall. LOVED the locations and the way photography and writing were brought in. It actually was a motivating movie, that all we need is for ONE person to believe in us sometimes. And that we should not wait for something major to happen in our lives to reevaluate our current life-course. Will most likely watch it again with my girls. They LOVE movies like this, and they are hard to find. No sex, no swearing, no inappropriate content.\nSurprisingly better than I expected. Good acting by leads.",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preferences:** The user maintains a strong affinity for engaging family-friendly narratives, seeking stories that nurture bonds and balance entertainment with educational elements. Their recent focus on unique themes and character authenticity highlights an increased sensitivity to historical accuracy and integrity in storytelling.\n\n- **Rating Trends:** While the user generally rates content highly, they have become more selective, particularly concerning narrative accuracy and perceived agendas. This shift indicates a growing demand for balanced and thoughtful storytelling.\n\n- **Content Tolerance:** The user remains open to mature themes but emphasizes emotionally engaging narratives suitable for family viewing. They continue to seek innovative explorations of overcoming adversity.\n\n- **Language and Accessibility:** The user enjoys English-language films with subtitles, valuing features like audio descriptions and dialogue boosts to enhance their experience.\n\n- **Cast and Production Values:** They favor films with acclaimed actors and respected producers, which significantly impacts their enjoyment.\n\n- **Entertainment Value:** The user seeks thought-provoking content that creates meaningful family experiences. Their recent interactions reflect a strong emotional connection to films, appreciating relatable and believable characters. They prioritize narratives that inspire motivation and self-reflection, ensuring that content is appropriate for family viewing with no offensive material. Their family particularly enjoys the types of movies they seek, emphasizing the challenge of finding quality options that align with their values.",
  "metrics": {
    "rouge1_f": 0.09680207433016423,
    "rouge2_f": 0.007785467128027682,
    "rougeL_f": 0.05185825410544512,
    "meteor": 0.025506133932989332,
    "bleu1": 7.101268734515872e-06,
    "bleu2": 1.7170429353144663e-06,
    "bleu3": 2.735729693007694e-07,
    "bleu4": 1.0929899728648966e-07,
    "bertscore_precision": 0.3481566309928894,
    "bertscore_recall": 0.48284071683883667,
    "bertscore_f1": 0.40458419919013977
  }
}