{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Hobbit: Battle of the Five Armies (Extended Edition) (Blu-ray)\nReview Date: 2015/12/03\nStore: Ian McKellen  (Actor),     Martin Freeman  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Hobbit, The: Battle of the Five Armies (Extended Edition) (Blu-ray)', \"Academy Award-winning filmmaker Peter Jackson returns to Middle-earth with the final of three films based on J.R.R. Tolkien's enduring masterpiece. Set in Middle-earth 60 years before the epic Lord of the Rings trilogy, the adventure follows the journey of Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf, Bilbo finds himself joining a company of dwarves on a journey into wild, treacherous lands swarming with beasts of every ilk. After reaching Erebor and encountering the dragon Smaug, Five Armies assemble for an epic battle that could decide the future of all in Middle-earth. The Extended Edition film is 20 minutes longer with new and extended scenes not seen in the theatrical release.\"]\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Blu-ray, NTSC', 'Contributor': \"Guillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Cate Blanchett, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Evangeline Lilly, Billy Connolly, Martin Freeman, Toby Emmerich, Benedict Cumberbatch, Alan Horn, Luke Evans, Stephen Fry, Orlando Bloom, Carolynne Cunningham, J.R.R. Tolkien, Mark Hadlow, Christopher Lee, Sylvester McCoy, Peter Jackson, William Kircher, Adam Brown, Dean O'Gorman, Aidan Turner, Ken Kamins, Ken Stott, Mikael Persbrandt, Zane Weiner, Hugo Weaving, Lee Pace, Eileen Moran, Peter Hambleton, John Callen, Ian Holm, Graham McTavishGuillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Cate Blanchett, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Evangeline Lilly, Billy Connolly, Martin Freeman, Toby Emmerich, Benedict Cumberbatch, Alan Horn, Luke Evans,…  See more\", 'Language': 'English', 'Digital Copy Expiration Date': 'November 17, 2018', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '35226210', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, NTSC', 'Release date': 'November 17, 2015', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, Ken Stott, Graham McTavish', 'Producers': 'Carolynne Cunningham, Alan Horn, Toby Emmerich, Zane Weiner, Ken Kamins', 'Studio': 'WarnerBrothers', 'Writers': 'Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nReview Text: Excellent movie if you are a Tolkien fan! The final chapter of the Hobbit movie series.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Outbreak\nDustin Hoffman  (Actor),     Rene Russo  (Actor),     Wolfgang Petersen  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Catch the fever of \"one of the great scare stories of our time\" (Roger Ebert) as Dustin Hoffman, Rene Russo and Morgan Freeman race to save life on earth when an unstoppable killer virus hits our shores.', 'Amazon.com', \"When Warner Brothers was unable to secure the rights to Richard Preston's terrifying nonfiction book\", 'The Hot Zone', '(purchased by a rival studio), they took the basic idea of a fatal virus on the loose in the U.S., added Dustin Hoffman and director Wolfgang Petersen (', 'Das Boot', '), and produced an unusual thriller--a surprise hit--called', 'Outbreak', '. The other picture, slated to star Robert Redford and Jodie Foster, fell through. The premise of', 'Outbreak', \", which owes something to Elia Kazan's 1950 plague-scare movie,\", 'Panic in the Streets', \", is as terrifying as it is timely. As developers slash their way deeper into the previously unexplored tropical rainforests, they are exposed to radically new forms of life, including diseases, that in these days of commonplace international travel could turn into deadly epidemics almost before we know it. Hoffman's character and his estranged wife (Rene Russo) are disease experts called in to identify the unknown killer, which was carried into the country by an illegally smuggled monkey. The best sequence shows the disease spreading--through recycled air on a passenger jet, or a sneeze in a crowded movie theater. The final chase is pretty conventional, but the cast is terrific, including Morgan Freeman, Kevin Spacey, Donald Sutherland, Cuba Gooding Jr., J.T. Walsh, and Zakes Mokae.\", '--Jim Emerson']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'MFR085391363224#VG', 'Director': 'Wolfgang Petersen', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Full Screen, Widescreen, NTSC', 'Run time': '2 hours and 7 minutes', 'Release date': 'May 21, 1997', 'Actors': 'Dustin Hoffman, Rene Russo, Morgan Freeman, Kevin Spacey, Cuba Gooding Jr.', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nGreat movie with an excellent cast.\nFour Stars\nThe Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\n{'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nGreat movies based on the beloved J. R. R. Tolkien classic novel told with loving details by Peter Jackson\nFive Stars\nThe Hobbit: The Desolation of Smaug (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The Hobbit: The Desolation of Smaug Extended Edition (Blu-ray)', 'THE ADVENTURE CONTINUES as Bilbo Baggins, the Wizard Gandalf and 13 Dwarves, led by Thorin Oakenshield, journey to reclaim the Dwarf Kingdom of Erebor. As they head East, they encounter the skin-changer Beorn and giant spiders in the treacherous forest, Mirkwood. Escaping capture by Wood-elves, they travel to Lake-town and finally the Lonely Mountain, where they face their greatest danger – a terrifying creature that will test their courage, their friendship and the wisdom of the journey itself – the Dragon Smaug.', ']]>']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Blu-ray', 'Contributor': \"Guillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Lawrence Makoare, Evangeline Lilly, John Bell, Martin Freeman, Toby Emmerich, Manu Bennett, Benedict Cumberbatch, Luke Evans, Stephen Fry, Alan Horn, Orlando Bloom, Carolynne Cunningham, Mark Hadlow, J.R.R. Tolkien, Sylvester McCoy, Peter Jackson, Adam Brown, William Kircher, Dean O'Gorman, Aidan Turner, Ken Stott, Ken Kamins, Mikael Persbrandt, Zane Weiner, Lee Pace, Peter Hambleton, John Callen, Graham McTavishGuillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Lawrence Makoare, Evangeline Lilly, John Bell, Martin Freeman, Toby Emmerich, Manu Bennett, Benedict Cumberbatch, Luke Ev…  See more\", 'Language': 'English, French', 'Runtime': '3 hours and 6 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': 'NEWL1000492328BR', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray', 'Run time': '3 hours and 6 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, Benedict Cumberbatch, Evangeline Lilly', 'Subtitles': 'Spanish, French, English', 'Producers': 'Peter Jackson, Alan Horn, Fran Walsh, Toby Emmerich, Zane Weiner', 'Studio': 'WarnerBrothers', 'Writers': 'Fran Walsh, Philippa Boyens, Guillermo del Toro, Peter Jackson', 'Number of discs': '3'}\nGreat movies based on the beloved J. R. R. Tolkien classic novel told with loving details by Peter Jackson.\nFive Stars\nGodzilla (Blu-ray)\nAaron Taylor-Johnson  (Actor),     Ken Watanabe  (Actor),     Gareth Edwards  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"In this gritty, realistic sci-fi action epic, Godzilla returns to its roots as one of the world's most recognized monsters. Directed by Gareth Edwards and featuring an all-star international cast, this spectacular adventure pits Godzilla against malevolent creatures that, bolstered by humanity's scientific arrogance, threaten our very existence.\"]\n{'Genre': 'Science Fiction & Fantasy, Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Brian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji OkuhiraBrian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji Okuhira  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 0.64 Ounces', 'Item model number': '828818', 'Director': 'Gareth Edwards', 'Media Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 16, 2014', 'Actors': 'Aaron Taylor-Johnson, Ken Watanabe, Elizabeth Olsen, Juliette Binoche, Sally Hawkins', 'Subtitles': 'Spanish, French', 'Producers': 'Patricia Whitcher, Thomas Tull, Alex Garcia, Jon Jashni, Yoshimitsu Banno', 'Studio': 'WarnerBrothers', 'Writers': 'Max Borenstein', 'Number of discs': '1'}\nA must for any Godzilla fan! (Another movie planned for the near future!)\nFour Stars\nTremors 5: Bloodlines\nJamie Kennedy  (Actor),     Pearl Thusi  (Actor),     Don Michael Paul  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"The stakes are raised for survivalist Burt Gummer (Michael Gross) in his most dangerous monster hunt yet. When Gummer's hired to capture a deadly Assblaster terrorizing South Africa, he and his new sidekick, Travis Welker (Jamie Kennedy), engage in a battle of survival against the fiercely aggressive Assblasters and Graboids. Discovering the monsters have evolved into even more lethal creatures, their killer mission takes on a whole new level of unseen terror–far more than they bargained for.\"]\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 4 Ounces', 'Item model number': '35222475', 'Director': 'Don Michael Paul', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Run time': '3 hours and 18 minutes', 'Release date': 'October 6, 2015', 'Actors': 'Jamie Kennedy, Pearl Thusi, Brandon Auret, Ian Roberts, Natalie Becker', 'Subtitles': 'Arabic, Portuguese, Spanish, Danish, Finnish, Cantonese, French, German, Hindi, Italian, Japanese, Norwegian, Icelandic, Mandarin Chinese, Korean, Swedish', 'Producers': 'Ogden Gavanski', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), Italian (DTS 5.1), German (DTS 5.1), Portuguese (Dolby Digital 5.1), French (Dolby Digital 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), Spanish (DTS 5.1), Thai (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Woodrow Truesmith, M.A. Deuce, John Whelpley', 'Number of discs': '2'}\nI really enjoy the Tremors series. This is is a lot of fun to watch!\nFour Stars\nThe Hobbit: Battle of the Five Armies (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Hobbit, The: Battle of the Five Armies (Extended Edition) (Blu-ray)', \"Academy Award-winning filmmaker Peter Jackson returns to Middle-earth with the final of three films based on J.R.R. Tolkien's enduring masterpiece. Set in Middle-earth 60 years before the epic Lord of the Rings trilogy, the adventure follows the journey of Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf, Bilbo finds himself joining a company of dwarves on a journey into wild, treacherous lands swarming with beasts of every ilk. After reaching Erebor and encountering the dragon Smaug, Five Armies assemble for an epic battle that could decide the future of all in Middle-earth. The Extended Edition film is 20 minutes longer with new and extended scenes not seen in the theatrical release.\"]\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Blu-ray, NTSC', 'Contributor': \"Guillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Cate Blanchett, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Evangeline Lilly, Billy Connolly, Martin Freeman, Toby Emmerich, Benedict Cumberbatch, Alan Horn, Luke Evans, Stephen Fry, Orlando Bloom, Carolynne Cunningham, J.R.R. Tolkien, Mark Hadlow, Christopher Lee, Sylvester McCoy, Peter Jackson, William Kircher, Adam Brown, Dean O'Gorman, Aidan Turner, Ken Kamins, Ken Stott, Mikael Persbrandt, Zane Weiner, Hugo Weaving, Lee Pace, Eileen Moran, Peter Hambleton, John Callen, Ian Holm, Graham McTavishGuillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Cate Blanchett, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Evangeline Lilly, Billy Connolly, Martin Freeman, Toby Emmerich, Benedict Cumberbatch, Alan Horn, Luke Evans,…  See more\", 'Language': 'English', 'Digital Copy Expiration Date': 'November 17, 2018', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '35226210', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, NTSC', 'Release date': 'November 17, 2015', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, Ken Stott, Graham McTavish', 'Producers': 'Carolynne Cunningham, Alan Horn, Toby Emmerich, Zane Weiner, Ken Kamins', 'Studio': 'WarnerBrothers', 'Writers': 'Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nExcellent movie if you are a Tolkien fan! The final chapter of the Hobbit movie series.\nFive Stars",
  "profile": "**User Summary:**\n\n- **Film Preferences:** Continues to enjoy thrillers and action-packed narratives, especially those involving suspense and high-stakes scenarios like pandemics. The enthusiasm for campy monster films and fantasy genres persists, with a particular interest in sci-fi themes and adaptations of classic literature featuring rich world-building.\n\n- **Cast Appreciation:** Maintains a strong admiration for talented actors, particularly Ian McKellen and Martin Freeman, reflecting a continued appreciation for performances in fantasy epics.\n\n- **Director Interest:** A clear preference for visionary filmmakers is noted, especially Peter Jackson, underscoring a taste for innovative storytelling and elaborate cinematic experiences.\n\n- **Viewing Format:** Strong preference for physical media, especially Blu-rays, indicating a traditional viewing habit and a desire for additional content and immersive experiences.\n\n- **Content Rating:** Primarily drawn to R-rated films but remains open to well-crafted PG-13 titles, prioritizing narrative quality and engagement.\n\n- **Critical Reception:** Responds positively to critically acclaimed films and adaptations of beloved literature, demonstrating a consistent appreciation for high production values and compelling narratives.\n\n- **Cultural Context:** Enjoys films that explore contemporary issues and resonate with literary sources, particularly in genre films that blend humor and campiness with thematic depth, showcasing a dual interest in light-hearted content alongside serious narratives. \n\nThe user continues to engage with beloved cinematic universes, evidenced by their ongoing patronage of films from established franchises.",
  "metrics": {
    "rouge1_f": 0.09099350046425254,
    "rouge2_f": 0.0055762081784386614,
    "rougeL_f": 0.04549675023212627,
    "meteor": 0.02486912449661577,
    "bleu1": 3.847188254701099e-05,
    "bleu2": 1.0846806409535426e-05,
    "bleu3": 4.485931644363461e-06,
    "bleu4": 1.365401532023122e-06,
    "bertscore_precision": 0.3581298291683197,
    "bertscore_recall": 0.48005980253219604,
    "bertscore_f1": 0.41022637486457825
  }
}