{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Godzilla (Blu-ray)\nReview Date: 2015/12/03\nStore: Aaron Taylor-Johnson  (Actor),     Ken Watanabe  (Actor),     Gareth Edwards  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"In this gritty, realistic sci-fi action epic, Godzilla returns to its roots as one of the world's most recognized monsters. Directed by Gareth Edwards and featuring an all-star international cast, this spectacular adventure pits Godzilla against malevolent creatures that, bolstered by humanity's scientific arrogance, threaten our very existence.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Brian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji OkuhiraBrian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji Okuhira  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 0.64 Ounces', 'Item model number': '828818', 'Director': 'Gareth Edwards', 'Media Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 16, 2014', 'Actors': 'Aaron Taylor-Johnson, Ken Watanabe, Elizabeth Olsen, Juliette Binoche, Sally Hawkins', 'Subtitles': 'Spanish, French', 'Producers': 'Patricia Whitcher, Thomas Tull, Alex Garcia, Jon Jashni, Yoshimitsu Banno', 'Studio': 'WarnerBrothers', 'Writers': 'Max Borenstein', 'Number of discs': '1'}\nReview Text: A must for any Godzilla fan! (Another movie planned for the near future!)\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Outbreak\nDustin Hoffman  (Actor),     Rene Russo  (Actor),     Wolfgang Petersen  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Catch the fever of \"one of the great scare stories of our time\" (Roger Ebert) as Dustin Hoffman, Rene Russo and Morgan Freeman race to save life on earth when an unstoppable killer virus hits our shores.', 'Amazon.com', \"When Warner Brothers was unable to secure the rights to Richard Preston's terrifying nonfiction book\", 'The Hot Zone', '(purchased by a rival studio), they took the basic idea of a fatal virus on the loose in the U.S., added Dustin Hoffman and director Wolfgang Petersen (', 'Das Boot', '), and produced an unusual thriller--a surprise hit--called', 'Outbreak', '. The other picture, slated to star Robert Redford and Jodie Foster, fell through. The premise of', 'Outbreak', \", which owes something to Elia Kazan's 1950 plague-scare movie,\", 'Panic in the Streets', \", is as terrifying as it is timely. As developers slash their way deeper into the previously unexplored tropical rainforests, they are exposed to radically new forms of life, including diseases, that in these days of commonplace international travel could turn into deadly epidemics almost before we know it. Hoffman's character and his estranged wife (Rene Russo) are disease experts called in to identify the unknown killer, which was carried into the country by an illegally smuggled monkey. The best sequence shows the disease spreading--through recycled air on a passenger jet, or a sneeze in a crowded movie theater. The final chase is pretty conventional, but the cast is terrific, including Morgan Freeman, Kevin Spacey, Donald Sutherland, Cuba Gooding Jr., J.T. Walsh, and Zakes Mokae.\", '--Jim Emerson']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'MFR085391363224#VG', 'Director': 'Wolfgang Petersen', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Full Screen, Widescreen, NTSC', 'Run time': '2 hours and 7 minutes', 'Release date': 'May 21, 1997', 'Actors': 'Dustin Hoffman, Rene Russo, Morgan Freeman, Kevin Spacey, Cuba Gooding Jr.', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nGreat movie with an excellent cast.\nFour Stars\nThe Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\n{'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nGreat movies based on the beloved J. R. R. Tolkien classic novel told with loving details by Peter Jackson\nFive Stars\nThe Hobbit: The Desolation of Smaug (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The Hobbit: The Desolation of Smaug Extended Edition (Blu-ray)', 'THE ADVENTURE CONTINUES as Bilbo Baggins, the Wizard Gandalf and 13 Dwarves, led by Thorin Oakenshield, journey to reclaim the Dwarf Kingdom of Erebor. As they head East, they encounter the skin-changer Beorn and giant spiders in the treacherous forest, Mirkwood. Escaping capture by Wood-elves, they travel to Lake-town and finally the Lonely Mountain, where they face their greatest danger – a terrifying creature that will test their courage, their friendship and the wisdom of the journey itself – the Dragon Smaug.', ']]>']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Blu-ray', 'Contributor': \"Guillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Lawrence Makoare, Evangeline Lilly, John Bell, Martin Freeman, Toby Emmerich, Manu Bennett, Benedict Cumberbatch, Luke Evans, Stephen Fry, Alan Horn, Orlando Bloom, Carolynne Cunningham, Mark Hadlow, J.R.R. Tolkien, Sylvester McCoy, Peter Jackson, Adam Brown, William Kircher, Dean O'Gorman, Aidan Turner, Ken Stott, Ken Kamins, Mikael Persbrandt, Zane Weiner, Lee Pace, Peter Hambleton, John Callen, Graham McTavishGuillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Lawrence Makoare, Evangeline Lilly, John Bell, Martin Freeman, Toby Emmerich, Manu Bennett, Benedict Cumberbatch, Luke Ev…  See more\", 'Language': 'English, French', 'Runtime': '3 hours and 6 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': 'NEWL1000492328BR', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray', 'Run time': '3 hours and 6 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, Benedict Cumberbatch, Evangeline Lilly', 'Subtitles': 'Spanish, French, English', 'Producers': 'Peter Jackson, Alan Horn, Fran Walsh, Toby Emmerich, Zane Weiner', 'Studio': 'WarnerBrothers', 'Writers': 'Fran Walsh, Philippa Boyens, Guillermo del Toro, Peter Jackson', 'Number of discs': '3'}\nGreat movies based on the beloved J. R. R. Tolkien classic novel told with loving details by Peter Jackson.\nFive Stars\nGodzilla (Blu-ray)\nAaron Taylor-Johnson  (Actor),     Ken Watanabe  (Actor),     Gareth Edwards  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"In this gritty, realistic sci-fi action epic, Godzilla returns to its roots as one of the world's most recognized monsters. Directed by Gareth Edwards and featuring an all-star international cast, this spectacular adventure pits Godzilla against malevolent creatures that, bolstered by humanity's scientific arrogance, threaten our very existence.\"]\n{'Genre': 'Science Fiction & Fantasy, Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Brian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji OkuhiraBrian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji Okuhira  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 0.64 Ounces', 'Item model number': '828818', 'Director': 'Gareth Edwards', 'Media Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 16, 2014', 'Actors': 'Aaron Taylor-Johnson, Ken Watanabe, Elizabeth Olsen, Juliette Binoche, Sally Hawkins', 'Subtitles': 'Spanish, French', 'Producers': 'Patricia Whitcher, Thomas Tull, Alex Garcia, Jon Jashni, Yoshimitsu Banno', 'Studio': 'WarnerBrothers', 'Writers': 'Max Borenstein', 'Number of discs': '1'}\nA must for any Godzilla fan! (Another movie planned for the near future!)\nFour Stars",
  "profile": "**User Summary:**\n\n- **Film Preferences:** Enjoys thrillers and action-packed narratives, particularly involving suspense and high-stakes scenarios like pandemics or contagious diseases. Recently expressed a keen interest in fantasy films with elaborate storytelling and rich world-building, also appreciating sci-fi themes in contemporary films like those featuring classic monsters.\n- **Cast Appreciation:** Values strong performances from renowned actors and consistently favors ensemble casts. Shows particular admiration for performances by Ian McKellen, Martin Freeman, and now also Aaron Taylor-Johnson and Ken Watanabe, noting their roles in significant genre films.\n- **Director Interest:** Demonstrates a clear preference for films directed by visionary filmmakers, with appreciation for works by Peter Jackson and Gareth Edwards, whose styles align with the user's taste.\n- **Viewing Format:** Prefers physical media formats, especially Blu-rays, reflecting a traditional viewing habit and an appreciation for additional content these formats provide.\n- **Content Rating:** Primarily attracted to R-rated films but remains open to well-crafted PG-13 films, focusing on narrative quality.\n- **Critical Reception:** Acts positively towards critically acclaimed films and adaptations of classic literature, showing a tendency to appreciate high production values and engaging narratives.\n- **Cultural Context:** Enjoys films that address contemporary issues and resonate with beloved literary sources, including explorations of global health crises and humanity's struggles against external threats. \n\nThis updated profile highlights the user's evolving interests, particularly in the sci-fi genre, while still reflecting a deep appreciation for strong narratives and performances.",
  "metrics": {
    "rouge1_f": 0.13396481732070364,
    "rouge2_f": 0.021680216802168018,
    "rougeL_f": 0.056833558863328824,
    "meteor": 0.04195967297553554,
    "bleu1": 0.00209140954305257,
    "bleu2": 0.0008632667738180445,
    "bleu3": 0.00046968375516368927,
    "bleu4": 0.00025350265753999566,
    "bertscore_precision": 0.38059380650520325,
    "bertscore_recall": 0.47467273473739624,
    "bertscore_f1": 0.4224589467048645
  }
}