{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Hellstrom Chronicle\nReview Date: 2017/03/31\nStore: Walon Green  (Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['Scientist Nils Hellstrom shows why he thinks ants, bees and other hardy insects will outlast man. Oscar for best documentary.']\nAverage Rating: 4.1\nProduct Details: {'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'OLV298DVD', 'Director': 'Walon Green', 'Media Format': 'Multiple Formats, NTSC, Color', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 10, 2012', 'Producers': 'David L. Wolper', 'Studio': 'Olive Films', 'Number of discs': '1'}\nReview Text: Not a science-fiction movie but a science-fact film in a semi-documentary format. The theme is that the insect world is more than capable of surviving conditions that could very well be an end to the human race. Insects are much more adaptable to changes in the world around them which has allowed them to be so successful for millions of years. Fantastic photography even with techniques almost 50 year old..\nReview Title: Fantastic photography even with techniques almost 50 year old\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Outbreak\nDustin Hoffman  (Actor),     Rene Russo  (Actor),     Wolfgang Petersen  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Catch the fever of \"one of the great scare stories of our time\" (Roger Ebert) as Dustin Hoffman, Rene Russo and Morgan Freeman race to save life on earth when an unstoppable killer virus hits our shores.', 'Amazon.com', \"When Warner Brothers was unable to secure the rights to Richard Preston's terrifying nonfiction book\", 'The Hot Zone', '(purchased by a rival studio), they took the basic idea of a fatal virus on the loose in the U.S., added Dustin Hoffman and director Wolfgang Petersen (', 'Das Boot', '), and produced an unusual thriller--a surprise hit--called', 'Outbreak', '. The other picture, slated to star Robert Redford and Jodie Foster, fell through. The premise of', 'Outbreak', \", which owes something to Elia Kazan's 1950 plague-scare movie,\", 'Panic in the Streets', \", is as terrifying as it is timely. As developers slash their way deeper into the previously unexplored tropical rainforests, they are exposed to radically new forms of life, including diseases, that in these days of commonplace international travel could turn into deadly epidemics almost before we know it. Hoffman's character and his estranged wife (Rene Russo) are disease experts called in to identify the unknown killer, which was carried into the country by an illegally smuggled monkey. The best sequence shows the disease spreading--through recycled air on a passenger jet, or a sneeze in a crowded movie theater. The final chase is pretty conventional, but the cast is terrific, including Morgan Freeman, Kevin Spacey, Donald Sutherland, Cuba Gooding Jr., J.T. Walsh, and Zakes Mokae.\", '--Jim Emerson']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'MFR085391363224#VG', 'Director': 'Wolfgang Petersen', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Full Screen, Widescreen, NTSC', 'Run time': '2 hours and 7 minutes', 'Release date': 'May 21, 1997', 'Actors': 'Dustin Hoffman, Rene Russo, Morgan Freeman, Kevin Spacey, Cuba Gooding Jr.', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nGreat movie with an excellent cast.\nFour Stars\nThe Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\n{'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nGreat movies based on the beloved J. R. R. Tolkien classic novel told with loving details by Peter Jackson\nFive Stars\nThe Hobbit: The Desolation of Smaug (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The Hobbit: The Desolation of Smaug Extended Edition (Blu-ray)', 'THE ADVENTURE CONTINUES as Bilbo Baggins, the Wizard Gandalf and 13 Dwarves, led by Thorin Oakenshield, journey to reclaim the Dwarf Kingdom of Erebor. As they head East, they encounter the skin-changer Beorn and giant spiders in the treacherous forest, Mirkwood. Escaping capture by Wood-elves, they travel to Lake-town and finally the Lonely Mountain, where they face their greatest danger – a terrifying creature that will test their courage, their friendship and the wisdom of the journey itself – the Dragon Smaug.', ']]>']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Blu-ray', 'Contributor': \"Guillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Lawrence Makoare, Evangeline Lilly, John Bell, Martin Freeman, Toby Emmerich, Manu Bennett, Benedict Cumberbatch, Luke Evans, Stephen Fry, Alan Horn, Orlando Bloom, Carolynne Cunningham, Mark Hadlow, J.R.R. Tolkien, Sylvester McCoy, Peter Jackson, Adam Brown, William Kircher, Dean O'Gorman, Aidan Turner, Ken Stott, Ken Kamins, Mikael Persbrandt, Zane Weiner, Lee Pace, Peter Hambleton, John Callen, Graham McTavishGuillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Lawrence Makoare, Evangeline Lilly, John Bell, Martin Freeman, Toby Emmerich, Manu Bennett, Benedict Cumberbatch, Luke Ev…  See more\", 'Language': 'English, French', 'Runtime': '3 hours and 6 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': 'NEWL1000492328BR', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray', 'Run time': '3 hours and 6 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, Benedict Cumberbatch, Evangeline Lilly', 'Subtitles': 'Spanish, French, English', 'Producers': 'Peter Jackson, Alan Horn, Fran Walsh, Toby Emmerich, Zane Weiner', 'Studio': 'WarnerBrothers', 'Writers': 'Fran Walsh, Philippa Boyens, Guillermo del Toro, Peter Jackson', 'Number of discs': '3'}\nGreat movies based on the beloved J. R. R. Tolkien classic novel told with loving details by Peter Jackson.\nFive Stars\nGodzilla (Blu-ray)\nAaron Taylor-Johnson  (Actor),     Ken Watanabe  (Actor),     Gareth Edwards  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"In this gritty, realistic sci-fi action epic, Godzilla returns to its roots as one of the world's most recognized monsters. Directed by Gareth Edwards and featuring an all-star international cast, this spectacular adventure pits Godzilla against malevolent creatures that, bolstered by humanity's scientific arrogance, threaten our very existence.\"]\n{'Genre': 'Science Fiction & Fantasy, Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Brian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji OkuhiraBrian Rogers, Bryan Cranston, Elizabeth Olsen, Sally Hawkins, Aaron Taylor-Johnson, Thomas Tull, Juliette Binoche, Alex Garcia, Yoshimitsu Banno, Mary Parent, David Strathairn, Ken Watanabe, Max Borenstein, Patricia Whitcher, Gareth Edwards, Jon Jashni, Kenji Okuhira  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 0.64 Ounces', 'Item model number': '828818', 'Director': 'Gareth Edwards', 'Media Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 16, 2014', 'Actors': 'Aaron Taylor-Johnson, Ken Watanabe, Elizabeth Olsen, Juliette Binoche, Sally Hawkins', 'Subtitles': 'Spanish, French', 'Producers': 'Patricia Whitcher, Thomas Tull, Alex Garcia, Jon Jashni, Yoshimitsu Banno', 'Studio': 'WarnerBrothers', 'Writers': 'Max Borenstein', 'Number of discs': '1'}\nA must for any Godzilla fan! (Another movie planned for the near future!)\nFour Stars\nTremors 5: Bloodlines\nJamie Kennedy  (Actor),     Pearl Thusi  (Actor),     Don Michael Paul  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"The stakes are raised for survivalist Burt Gummer (Michael Gross) in his most dangerous monster hunt yet. When Gummer's hired to capture a deadly Assblaster terrorizing South Africa, he and his new sidekick, Travis Welker (Jamie Kennedy), engage in a battle of survival against the fiercely aggressive Assblasters and Graboids. Discovering the monsters have evolved into even more lethal creatures, their killer mission takes on a whole new level of unseen terror–far more than they bargained for.\"]\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 4 Ounces', 'Item model number': '35222475', 'Director': 'Don Michael Paul', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Run time': '3 hours and 18 minutes', 'Release date': 'October 6, 2015', 'Actors': 'Jamie Kennedy, Pearl Thusi, Brandon Auret, Ian Roberts, Natalie Becker', 'Subtitles': 'Arabic, Portuguese, Spanish, Danish, Finnish, Cantonese, French, German, Hindi, Italian, Japanese, Norwegian, Icelandic, Mandarin Chinese, Korean, Swedish', 'Producers': 'Ogden Gavanski', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), Italian (DTS 5.1), German (DTS 5.1), Portuguese (Dolby Digital 5.1), French (Dolby Digital 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), Spanish (DTS 5.1), Thai (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Woodrow Truesmith, M.A. Deuce, John Whelpley', 'Number of discs': '2'}\nI really enjoy the Tremors series. This is is a lot of fun to watch!\nFour Stars\nThe Hobbit: Battle of the Five Armies (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Hobbit, The: Battle of the Five Armies (Extended Edition) (Blu-ray)', \"Academy Award-winning filmmaker Peter Jackson returns to Middle-earth with the final of three films based on J.R.R. Tolkien's enduring masterpiece. Set in Middle-earth 60 years before the epic Lord of the Rings trilogy, the adventure follows the journey of Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf, Bilbo finds himself joining a company of dwarves on a journey into wild, treacherous lands swarming with beasts of every ilk. After reaching Erebor and encountering the dragon Smaug, Five Armies assemble for an epic battle that could decide the future of all in Middle-earth. The Extended Edition film is 20 minutes longer with new and extended scenes not seen in the theatrical release.\"]\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Blu-ray, NTSC', 'Contributor': \"Guillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Cate Blanchett, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Evangeline Lilly, Billy Connolly, Martin Freeman, Toby Emmerich, Benedict Cumberbatch, Alan Horn, Luke Evans, Stephen Fry, Orlando Bloom, Carolynne Cunningham, J.R.R. Tolkien, Mark Hadlow, Christopher Lee, Sylvester McCoy, Peter Jackson, William Kircher, Adam Brown, Dean O'Gorman, Aidan Turner, Ken Kamins, Ken Stott, Mikael Persbrandt, Zane Weiner, Hugo Weaving, Lee Pace, Eileen Moran, Peter Hambleton, John Callen, Ian Holm, Graham McTavishGuillermo del Toro, Carolyn Blackwood, Jed Brophy, James Nesbitt, Cate Blanchett, Philippa Boyens, Richard Armitage, Ian McKellen, Fran Walsh, Stephen Hunter, Evangeline Lilly, Billy Connolly, Martin Freeman, Toby Emmerich, Benedict Cumberbatch, Alan Horn, Luke Evans,…  See more\", 'Language': 'English', 'Digital Copy Expiration Date': 'November 17, 2018', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '35226210', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, NTSC', 'Release date': 'November 17, 2015', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, Ken Stott, Graham McTavish', 'Producers': 'Carolynne Cunningham, Alan Horn, Toby Emmerich, Zane Weiner, Ken Kamins', 'Studio': 'WarnerBrothers', 'Writers': 'Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nExcellent movie if you are a Tolkien fan! The final chapter of the Hobbit movie series.\nFive Stars\nJurassic World [Blu-ray]\nChris Pratt  (Actor),     Bryce Dallas Howard  (Actor),     Colin Trevorrow  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Steven Spielberg returns to executive produce the long-awaited next installment of his groundbreaking Jurassic Park series, Jurassic World, an epic action-adventure.']\n{'Genre': 'Jurassic Park Undiscovered, Science Fiction & Fantasy, Jurassic Park 4, DVD Movie, Monde Jurassique, Isla Nublar, Ebb Tide, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseJurassic Park Undiscovered, Science Fiction & Fantasy, Jurassic Park 4, DVD Movie, Monde Jurassique, Isla Nublar, Ebb Tide, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': \"Blu-ray, Collector's Edition, Color, Limited Collector's Edition, Widescreen, Digital_copy\", 'Contributor': 'Lauren Lapkus, Nick Robinson, Irrfan Khan, Jake Johnson, Judy Greer, Colin Trevorrow, Ty Simpkins, Bryce Dallas Howard, Chris Pratt, BD WongLauren Lapkus, Nick Robinson, Irrfan Khan, Jake Johnson, Judy Greer, Colin Trevorrow, Ty Simpkins, Bryce Dallas Howard, Chris Pratt, BD Wong  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (DTS 5.1), Spanish (DTS 5.1)', 'Runtime': '2 hours and 4 minutes', 'Aspect Ratio': '2.20:1, 2:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Colin Trevorrow', 'Media Format': \"Blu-ray, Collector's Edition, Color, Limited Collector's Edition, Widescreen, Digital_copy\", 'Run time': '2 hours and 4 minutes', 'Release date': 'October 20, 2015', 'Actors': 'Chris Pratt, Bryce Dallas Howard, Judy Greer, Jake Johnson, Lauren Lapkus', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Studios', 'Number of discs': '3'}\nAnother fun movie! If you enjoyed the Jurassic Park movies, you'll will enjoy this one.\nFour Stars\nStar Wars: The Force Awakens\nHarrison Ford  (Actor),     Mark Hamill  (Actor),     J.J. Abrams  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Product Description', \"Visionary director J.J. Abrams brings to life the motion picture event of a generation. As Kylo Ren and the sinister First Order rise from the ashes of the Empire, Luke Skywalker is missing when the galaxy needs him most. It's up to Rey, a desert scavenger, and Finn, a defecting stormtrooper, to join forces with Han Solo and Chewbacca in a desperate search for the one hope of restoring peace to the galaxy.\", 'Additional Features', 'How to redeem your digital code:  1. Find Code on Insert  2. Enter Code   3. Select Provider   4. Enjoy Movie!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'J.J. Abrams', 'Media Format': 'Blu-ray, Digital_copy, DVD+Blu-ray', 'Run time': '2 hours and 16 minutes', 'Release date': 'April 5, 2016', 'Actors': 'Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley', 'Subtitles': 'French, Spanish, English', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Studio': 'Walt Disney Studios', 'Writers': 'Screenplay by Lawrence Kasdan & J.J. Abrams and Mi', 'Number of discs': '3'}\nLoved it! I was hooked on Star Wars from the opening seconds of the original movie, now called Star Wars: A New Hope back in 1977.<br />The fantastic music by John Williams and the story line preview mimicking the old serial films of the 1930s and 1940s had me hook, line, and sinker from the start. I have enjoyed each and every film in the series.\nLoved it! I was hooked on Star Wars from ...\nJohn Carter (Four-Disc Combo: Blu-ray 3D/Blu-ray/DVD + Digital Copy) [3D Blu-ray]\nTaylor Kitsch  (Actor),     Lynn Collins  (Actor),     Andrew Stanton  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product description', 'John Carter [Blu-ray 3D + Blu-ray + DVD + Dig', 'Amazon.com', \"Disney's megabudget foray into a new CGI franchise of epic sci-fi mythology arrives with a massive marketing push and an interesting pulp pedigree that will probably inspire as many fans as it will naysayers. This impressively crafted piece of escapist fantasy is based on a character and series of books by Edgar Rice Burroughs that is runner-up to his primary creation, Tarzan, and the 20-plus volumes he wrote about that iconic ape-raised jungle adventurer. Burroughs churned out books in both series concurrently for roughly his entire adult life in the first half of the 20th century. John Carter is a former Confederate Civil War captain and fortune-hunting ne'er-do-well who through a weird incident of astral projection is plopped down on the red planet, where he becomes a passionate warrior against beasts and humanoids for the security of a home world known to its inhabitants as Barsoom.\", 'John Carter', 'presents this origin setup in a clever prologue that finds the cranky Carter on the run from frontier military authorities as well as a band of marauding Indians. Carter is played by', 'Friday Night Lights', \"star Taylor Kitsch with great bravado. His character undergoes radical change when confronted with something he can finally care about. It doesn't hurt that an exotic princess of Mars is part of the prize package that comes from his battle against evil and ultimately doing the right thing.\", 'John Carter', 'is a visual feast (especially in well-conceived 3-D) with an array of digital and motion-capture techniques that create an eye-popping world of strange creatures, astounding architectural vistas, aerial panoramas, and luminous landscapes. All the extraordinary detail is not surprising considering that Pixar superstar Andrew Stanton is at the helm (he also directed', 'Finding Nemo', 'and', 'WALL-E', \"). There's a lot going on in the script, and it sometimes feels as though too much work was done in the editing suite to streamline a story that is often overly complicated. Barsoom is ruled by three species, all with their own political and social agendas. There are the humans whose city-state cultures are threatened by civil war and the aggression of Tharks, a race of giant green-skinned, four-armed warriors with horrific tusks and a deeply bellicose intellect. Separate from both are the mythic Therns, a cultlike sect of über-beings who seek to manipulate all of Barsoom into their own submission. Added to the mix are a variety of outrageous animal creatures both vicious and sublime that make for an extremely motley ensemble of beasties. The huge cast of characters, species, and names becomes a bit confusing to keep straight in all the rapid-fire exposition. Fortunately the movie doesn't ever stop long enough to allow much time for thinking; there's something new and exciting to look at in virtually every scene. Because of some fantastical leaps of physics and gravity, Carter's Martian body possesses super strength and the ability to make single bounds over huge distances. His powers not only make him a godlike presence to the natives of Barsoom, they also provide for some dizzying feats of movie magic. The most bravura element of the conceptual design is a fleet of massive solar-powered flying machines that recall something out of H.G. Wells or a steampunk fantasy. These colorful, insectlike machines soar and float in the gold-hued Martian atmosphere with thrilling precision. Even though the multitude of beings, names, and alliances may sometimes elicit a glassy-eyed response, there's plenty of attention-grabbing exactitude to behold in\", 'John Carter', \". There's also a good chance that the fans will make it worth Disney's while to shell out another hundred million to keep the saga going. --\", 'Ted Fry', 'Related Products', \"Amazon's Disney Store\", 'More', 'John Carter', 'More Blu-ray 3D Movies', 'Versions of', 'John Carter', 'on Blu-ray and DVD', 'John Carter', 'John Carter (Two-Disc Blu-ray/DVD Combo)', 'John Carter (Four-Disc Combo: Blu-ray 3D, Blu-ray, DVD + Digital Copy)', 'Release Date', 'June 5, 2012 June 5, 2012 June 5, 2012', 'Format/Disc #', 'DVD Blu-ray, DVD Blu-ray 3D, Blu-ray, DVD + Digital Copy', 'Blu-ray', 'No Yes Yes', 'DVD', 'Yes Yes Yes', 'Digital Copy', 'No No Yes', 'Bonus Features', 'None · Blu-ray Feature Film + Bonus· DVD Feature Film+ Bonus· Disney Second Screen· 360 Degrees of John Carter· Deleted Scene with Option Commentary by Director Andrew Stanton· Barsoom Bloopers· 100 Years in the Making· Audio Commentary with Film Makers · Blu-ray 3D (TM) Feature Film· Blu-ray Feature Film + Bonus· DVD Feature Film+ Bonus· Digital Copy of Feature Film· Disney Second Screen· 360 Degrees of John Carter· Deleted Scenes with Optional Commentary by Director Andrew Stanton· Barsoom Bloopers· 100 Years of in the Making· Audio Commentary with Film Makers']\n{'Format': 'Blu-ray, Box set, Color, DTS Surround Sound, Dubbed, NTSC, Subtitled, 3D, Widescreen, Digital_copy', 'Contributor': 'Andrew Stanton, Taylor Kitsch, Lynn Collins', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 12 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': 'WD10838300TD', 'Director': 'Andrew Stanton', 'Media Format': 'Blu-ray, Box set, Color, DTS Surround Sound, Dubbed, NTSC, Subtitled, 3D, Widescreen, Digital_copy', 'Run time': '2 hours and 12 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Taylor Kitsch, Lynn Collins', 'Subtitles': 'English, French, Spanish', 'Studio': 'Buena Vista', 'Number of discs': '1'}\nGreat movie! Four disc combo allows viewing for all!\nFour Stars\n{'Content advisory': ['Violence', 'smoking'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Unavailable'], 'Studio': ['Total Content Digital']}\nGreat use of old movies taken during the war as from both sides outlining the major moves taken by all the combatants.\nGreat use of old movies taken during the war as ...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English', 'English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['David Semel', 'Daniel Percival', 'Ken Olin', 'Michael Rymer', 'Bryan Spicer', 'Nelson Mccormick', 'Brad Anderson', 'Karyn Kusama', 'Michael Slovis'], 'Producers': ['Ridley Scott', 'David W. Zucker', 'Frank Spotnitz', 'Isa Dick Hackett', 'Christopher Tricarico', 'Stewart Mackinnon', 'Chrtistian Baute', 'Jace Richdale', 'Richard Heus', 'Dan Percival', 'Jordan Sheehan', 'Kalen Egan', 'Erin Smith'], 'Starring': ['Alexa Davalos', 'Rupert Evans', 'Luke Kleintank'], 'Studio': ['Amazon Studios']}\nThis is the second request for my opinion on this show but unfortunately, I have not been able to watch past the fifth episode so any review will basically hold only a little weight. I have enjoyed what I've seen which is the reason for the three star rating.\nI have not been able towatch past the fifth episode so any review will basically ...\nThe Hellstrom Chronicle\nWalon Green  (Director)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Scientist Nils Hellstrom shows why he thinks ants, bees and other hardy insects will outlast man. Oscar for best documentary.']\n{'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'OLV298DVD', 'Director': 'Walon Green', 'Media Format': 'Multiple Formats, NTSC, Color', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 10, 2012', 'Producers': 'David L. Wolper', 'Studio': 'Olive Films', 'Number of discs': '1'}\nNot a science-fiction movie but a science-fact film in a semi-documentary format. The theme is that the insect world is more than capable of surviving conditions that could very well be an end to the human race. Insects are much more adaptable to changes in the world around them which has allowed them to be so successful for millions of years. Fantastic photography even with techniques almost 50 year old..\nFantastic photography even with techniques almost 50 year old",
  "profile": "The user continues to demonstrate a strong preference for thrillers and action narratives, particularly those featuring suspenseful scenarios such as pandemics. Their fondness for campy monster films and fantasy is unwavering, with a noteworthy interest in sci-fi, especially adaptations of classic literature emphasizing extensive world-building.\n\nRecently, they showcased an appreciation for documentaries, indicating a curiosity about the natural world and a desire for educational content. This aligns with their evolving viewing habits, where they seek a balance between entertainment and informative experiences. Their interest in historical narratives and multimedia storytelling remains prevalent, mirroring their engagement with immersive sci-fi.\n\nAdmiring talented actors, they favor performances by Ian McKellen and Martin Freeman, particularly in fantasy epics, and their admiration for innovative filmmakers like Peter Jackson and J.J. Abrams persists. The user values physical media and enjoys supplementary content, indicating a preference for enriched viewing experiences.\n\nWhile predominantly drawn to R-rated films, they remain receptive to well-crafted PG-13 titles. Critics' favor and adaptations of beloved literature resonate with them, reflecting a dual interest in both light-hearted and serious themes. Overall, the latest interaction reveals a growing appreciation for rich visual storytelling, reinforcing their commitment to thoughtfully curated films and narratives while acknowledging a practical approach to their entertainment consumption.",
  "metrics": {
    "rouge1_f": 0.05968011458582,
    "rouge2_f": 0.006687365655600668,
    "rougeL_f": 0.03246598233468608,
    "meteor": 0.01541973049526032,
    "bleu1": 2.954760972727567e-11,
    "bleu2": 1.1882180720363628e-11,
    "bleu3": 4.147065862277825e-12,
    "bleu4": 1.1597888037624643e-12,
    "bertscore_precision": 0.32877835631370544,
    "bertscore_recall": 0.5006520748138428,
    "bertscore_f1": 0.3969074487686157
  }
}