{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Clifford: Clifford's Doghouse Adventures\nReview Date: 2016/05/22\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Clifford\\'s big doghouse is where the fun begins on Birdwell Island. It\\'s the place Clifford, Emily Elizabeth and their friends meet and make plans for adventures big and small. Laughing, playing and sharing great times together, they dig up treasures, perform in a band, explore the local carnival, and make a new friend. Episodes include: \"Clifford Cleans His Doghouse,\" \"Doggie Garden,\" \"Screaming for Ice Cream,\" \"Jetta\\'s Project,\" \"Then Came Bob,\" \"Clothes Don\\'t Make the Dog,\" \"Limelight Fright,\" \"Clifford\\'s Cookie Craving,\" \"Guess Who\\'s Coming to Birdwell.\"']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 3.2 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Full Screen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'February 6, 2007', 'Dubbed': 'Spanish', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nReview Text: Fast shipping. Grand baby loves it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Little Bear - Rainy Day Tales\nAndrew Sabiston  (Actor),     Kristin Fairlie  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': \"Dan Hennessey, Amos Crawley, Maurice Sendak, Andrew Sabiston, Elizabeth Hanna, Michael Thoma, Diane D'Aquila, Tracy Ryan, Jed MacKay, Ashley Taylor, Tara Strong, Jennifer Pertsch, Betty Quan, Kristin Fairlie, Jennifer Martini, Clive Endersby, Sean McCann, Else Holmelund Minarik, Rhonda Smiley, Janet-Laine GreenDan Hennessey, Amos Crawley, Maurice Sendak, Andrew Sabiston, Elizabeth Hanna, Michael Thoma, Diane D'Aquila, Tracy Ryan, Jed MacKay, Ashley Taylor, Tara Strong, Jennifer Pertsch, Betty Quan, Kristin Fairlie, Jennifer Martini, Clive Endersby, Sean McCann, Else Holmelund…   See more\", 'Language': 'English', 'Number Of Discs': '1'}\nOne of mine and my children's favorites. Glad I can share with my grandkids\nGlad I can share with my grandkids\nFranklin Triple Feature - Finders Keepers\nVarious  (Actor),     Dermot Walshe  (Director),     Gary Hurst  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Lovable and relatable Franklin explores the world around him by conquering his fears and finding solutions to any troubles he gets himself into. Join Franklin and his band of animal pals in over 3 hours of fun.']\n{'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'John Bruggen, Dermot Walshe, Gary Hurst, Various', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'PRC55540DVD', 'Director': 'Dermot Walshe, Gary Hurst, John Bruggen', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Various', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nFast shipping and great to share with the whole family\nFive Stars\nPaw Patrol\nVictoria Abril  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['PAW PATROL is a CG, action-adventure preschool series starring a pack of six heroic puppies: Chase, Marshall, Rocky, Zuma, Rubble, and Skye, who are led by a tech-savvy 10-year-old boy named Ryder. With a unique blend of problem-solving skills, cool vehicles and lots of cute doggy humor, the PAW PATROL works together on high-stakes rescue missions to protect the Adventure Bay community. From Marshall the firedog to Chase the police pup to Skye, who flies high in her copter, each pup brings unique personality and skill to the team, modeling the importance of teamwork and good citizenship. They all have special Pup Packs on their backs to help them handle anything - from rescuing kittens to saving a train from a rockslide! And no matter how big the adventure, the PAW PATROL always has time for a game, a laugh, and an ear scratch from Ryder.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.33 Ounces', 'Item model number': '131390', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Victoria Abril', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nFast shipping and awesome cartoon. The kids love it\nFive Stars\nPaw Patrol: Brave Heroes, Big Rescues\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Paw Patrol: Brave Heroes Big Rescues DVD - Save the day with 6 huge and heroic rescues of PAW Patrol! EmBARK on two daring double-length adventures as the PAW Patrol transforms into magical Mer-Pups to save underwater friends AND rescues Adventure Bay from a dinosaur invasion! Plus, join the pups as they save Jake, the Adventure Day Parade, a kitty, and even Marshall! Nickelodeon Run Time: 92 minutes']\n{'Genre': 'Kids & Family/Animation', 'Format': 'NTSC, Widescreen', 'Contributor': 'PAW PATROL: BRAVE HEROES BIG RESCUES', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '35225889', 'Media Format': 'NTSC, Widescreen', 'Release date': 'March 1, 2016', 'Studio': 'Paramount', 'Number of discs': '1'}\nFast shipping and kids love it!\nFive Stars\nClifford: Clifford's Doghouse Adventures\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Clifford\\'s big doghouse is where the fun begins on Birdwell Island. It\\'s the place Clifford, Emily Elizabeth and their friends meet and make plans for adventures big and small. Laughing, playing and sharing great times together, they dig up treasures, perform in a band, explore the local carnival, and make a new friend. Episodes include: \"Clifford Cleans His Doghouse,\" \"Doggie Garden,\" \"Screaming for Ice Cream,\" \"Jetta\\'s Project,\" \"Then Came Bob,\" \"Clothes Don\\'t Make the Dog,\" \"Limelight Fright,\" \"Clifford\\'s Cookie Craving,\" \"Guess Who\\'s Coming to Birdwell.\"']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 3.2 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Full Screen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'February 6, 2007', 'Dubbed': 'Spanish', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nFast shipping. Grand baby loves it.\nFive Stars",
  "profile": "The user continues to showcase a strong commitment to family-oriented animated content, highlighting their preference for films that facilitate enjoyable viewing experiences for audiences of all ages. Their latest acquisition reflects an ongoing endorsement of high-quality titles that emphasize entertainment value and foster family interactions. This aligns with their established pattern of selecting content that incorporates positive themes, character development, and valuable lessons.\n\nFocusing particularly on animated films, the user favors those that blend fun with educational elements, centering on relatable characters who navigate challenges while promoting teamwork and good citizenship. Their consistent choice of DVD formats reinforces a desire to create shared moments with family, away from digital distractions.\n\nThe recent review, which praised fast shipping and the enjoyment it brought to their grandchild, emphasizes their role as a discerning consumer dedicated to enriching family experiences. Overall, the user's selections reflect a commitment to uplifting narratives that resonate across generations, underscoring their desire to cultivate cherished memories through engaging animated storytelling. Their ongoing dedication to high-quality family entertainment solidifies their identity as a caregiver who values the joy of shared viewing experiences with loved ones.",
  "metrics": {
    "rouge1_f": 0.13543599257884972,
    "rouge2_f": 0.00929368029739777,
    "rougeL_f": 0.0686456400742115,
    "meteor": 0.043463758998604135,
    "bleu1": 0.0016642109088190603,
    "bleu2": 0.0005857739253248062,
    "bleu3": 0.0002872377732939928,
    "bleu4": 0.00018197455306906237,
    "bertscore_precision": 0.30343201756477356,
    "bertscore_recall": 0.4217710793018341,
    "bertscore_f1": 0.3529462218284607
  }
}