{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Paw Patrol: Brave Heroes, Big Rescues\nReview Date: 2016/05/19\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Paw Patrol: Brave Heroes Big Rescues DVD - Save the day with 6 huge and heroic rescues of PAW Patrol! EmBARK on two daring double-length adventures as the PAW Patrol transforms into magical Mer-Pups to save underwater friends AND rescues Adventure Bay from a dinosaur invasion! Plus, join the pups as they save Jake, the Adventure Day Parade, a kitty, and even Marshall! Nickelodeon Run Time: 92 minutes']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family/Animation', 'Format': 'NTSC, Widescreen', 'Contributor': 'PAW PATROL: BRAVE HEROES BIG RESCUES', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '35225889', 'Media Format': 'NTSC, Widescreen', 'Release date': 'March 1, 2016', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: Fast shipping and kids love it!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Little Bear - Rainy Day Tales\nAndrew Sabiston  (Actor),     Kristin Fairlie  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': \"Dan Hennessey, Amos Crawley, Maurice Sendak, Andrew Sabiston, Elizabeth Hanna, Michael Thoma, Diane D'Aquila, Tracy Ryan, Jed MacKay, Ashley Taylor, Tara Strong, Jennifer Pertsch, Betty Quan, Kristin Fairlie, Jennifer Martini, Clive Endersby, Sean McCann, Else Holmelund Minarik, Rhonda Smiley, Janet-Laine GreenDan Hennessey, Amos Crawley, Maurice Sendak, Andrew Sabiston, Elizabeth Hanna, Michael Thoma, Diane D'Aquila, Tracy Ryan, Jed MacKay, Ashley Taylor, Tara Strong, Jennifer Pertsch, Betty Quan, Kristin Fairlie, Jennifer Martini, Clive Endersby, Sean McCann, Else Holmelund…   See more\", 'Language': 'English', 'Number Of Discs': '1'}\nOne of mine and my children's favorites. Glad I can share with my grandkids\nGlad I can share with my grandkids\nFranklin Triple Feature - Finders Keepers\nVarious  (Actor),     Dermot Walshe  (Director),     Gary Hurst  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Lovable and relatable Franklin explores the world around him by conquering his fears and finding solutions to any troubles he gets himself into. Join Franklin and his band of animal pals in over 3 hours of fun.']\n{'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'John Bruggen, Dermot Walshe, Gary Hurst, Various', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'PRC55540DVD', 'Director': 'Dermot Walshe, Gary Hurst, John Bruggen', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Various', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nFast shipping and great to share with the whole family\nFive Stars\nPaw Patrol\nVictoria Abril  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['PAW PATROL is a CG, action-adventure preschool series starring a pack of six heroic puppies: Chase, Marshall, Rocky, Zuma, Rubble, and Skye, who are led by a tech-savvy 10-year-old boy named Ryder. With a unique blend of problem-solving skills, cool vehicles and lots of cute doggy humor, the PAW PATROL works together on high-stakes rescue missions to protect the Adventure Bay community. From Marshall the firedog to Chase the police pup to Skye, who flies high in her copter, each pup brings unique personality and skill to the team, modeling the importance of teamwork and good citizenship. They all have special Pup Packs on their backs to help them handle anything - from rescuing kittens to saving a train from a rockslide! And no matter how big the adventure, the PAW PATROL always has time for a game, a laugh, and an ear scratch from Ryder.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.33 Ounces', 'Item model number': '131390', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Victoria Abril', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nFast shipping and awesome cartoon. The kids love it\nFive Stars\nPaw Patrol: Brave Heroes, Big Rescues\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Paw Patrol: Brave Heroes Big Rescues DVD - Save the day with 6 huge and heroic rescues of PAW Patrol! EmBARK on two daring double-length adventures as the PAW Patrol transforms into magical Mer-Pups to save underwater friends AND rescues Adventure Bay from a dinosaur invasion! Plus, join the pups as they save Jake, the Adventure Day Parade, a kitty, and even Marshall! Nickelodeon Run Time: 92 minutes']\n{'Genre': 'Kids & Family/Animation', 'Format': 'NTSC, Widescreen', 'Contributor': 'PAW PATROL: BRAVE HEROES BIG RESCUES', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '35225889', 'Media Format': 'NTSC, Widescreen', 'Release date': 'March 1, 2016', 'Studio': 'Paramount', 'Number of discs': '1'}\nFast shipping and kids love it!\nFive Stars",
  "profile": "The user demonstrates a strong commitment to family-oriented animated content, favoring films that create enjoyable viewing experiences for all age groups. Their purchases and ratings reflect a keen appreciation for high-quality entertainment that fosters family bonds, with a consistent preference for DVD formats, allowing families to gather for shared moments away from digital distractions.\n\nRecently, the user acquired another well-rated animated title, showcasing their continued endorsement of engaging and relatable content aimed at young audiences. Their review praised the product for both its entertainment value and the joy it brings to family interactions. This emphasizes their preference for titles that incorporate positive themes, character development, and valuable lessons.\n\nThe user particularly favors animated films that blend fun and educational elements, spotlighting relatable characters who navigate challenges while promoting teamwork and good citizenship. Their ongoing dedication to high-quality family entertainment reinforces their identity as a discerning consumer, committed to creating cherished memories with loved ones through animated storytelling. Overall, the user's choices reflect a desire to enrich family experiences with uplifting and engaging narratives that resonate across generations.",
  "metrics": {
    "rouge1_f": 0.14831460674157304,
    "rouge2_f": 0.01126126126126126,
    "rougeL_f": 0.07191011235955055,
    "meteor": 0.0485680166977077,
    "bleu1": 0.004584932327892618,
    "bleu2": 0.0017373792887608196,
    "bleu3": 0.0008732107740166454,
    "bleu4": 0.0005601051924573423,
    "bertscore_precision": 0.30192387104034424,
    "bertscore_recall": 0.42182987928390503,
    "bertscore_f1": 0.35194429755210876
  }
}