{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Goonies, The (WBFE) (DVD)\nReview Date: 2018/09/20\nStore: Sean Astin  (Actor),     Josh Brolin  (Actor),     Richard Donner  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Product Description', 'Goonies, The (WBFE) (DVD)', \"Steven Spielberg, Richard Donner (Lethal Weapon films) and Chris Columbus (Harry Potter films) collaborate to create an epic childen's adventure of subterranean caverns, sunken galleons and a fortune in lost pirate treasure waiting to be found by a group of friends known as the Goonies. With brothers Mikey (Sean Astin) and Brand's (Josh Brolin) house slated for demolition by greedy land developers, the boys decide their only hope lies in finding a long-lost treasure. They uncover a treasure map and with their friends descend to a subterranean sea and an abandoned galleon in this fun-filled, fast-paced adventure.\", ']]>', 'Review', \"It has crooks, bats, cobwebs, skeletons, a lovable monster, an underground grotto and a treasure hidden by some of the most considerate, clue-loving pirates who ever lived. Their ghostly ship is the movie's piece de resistance. --The New York Times, Janet MaslinThe movie remains an embodiment of Spielberg's commercially cunning brand of clankingly retro film making. Despite the wit and charm brought to their Spiel-speak dialogue by the talented young performers, The Goonies is less a movie than an entertainment machine. --The Globe and Mail, Jay ScottThis is truly a great kids film and great family film. The clever usage of the plot is what will really capture your attention. If not that then the great characters, bits of action, and bits of comedy will catch your eye. --Zilcell\"]\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '16:9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.64 Ounces', 'Item model number': '116314', 'Director': 'Richard Donner', 'Media Format': 'NTSC, Multiple Formats, Color, Widescreen, Closed-captioned', 'Run time': '1 hour and 54 minutes', 'Release date': 'January 8, 2008', 'Actors': 'Sean Astin, Josh Brolin, Jeff Cohen, Corey Feldman, Kerri Green', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Richard Donner, Steven Spielberg, Frank Marshall, Harvey Bernhard, Kathleen Kennedy', 'Language': 'Unqualified', 'Studio': 'WarnerBrothers', 'Writers': 'Chris Columbus, Steven Spielberg', 'Number of discs': '1'}\nReview Text: My favorite movie!!\nReview Title: Awesome product\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Little Bear - Rainy Day Tales\nAndrew Sabiston  (Actor),     Kristin Fairlie  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': \"Dan Hennessey, Amos Crawley, Maurice Sendak, Andrew Sabiston, Elizabeth Hanna, Michael Thoma, Diane D'Aquila, Tracy Ryan, Jed MacKay, Ashley Taylor, Tara Strong, Jennifer Pertsch, Betty Quan, Kristin Fairlie, Jennifer Martini, Clive Endersby, Sean McCann, Else Holmelund Minarik, Rhonda Smiley, Janet-Laine GreenDan Hennessey, Amos Crawley, Maurice Sendak, Andrew Sabiston, Elizabeth Hanna, Michael Thoma, Diane D'Aquila, Tracy Ryan, Jed MacKay, Ashley Taylor, Tara Strong, Jennifer Pertsch, Betty Quan, Kristin Fairlie, Jennifer Martini, Clive Endersby, Sean McCann, Else Holmelund…   See more\", 'Language': 'English', 'Number Of Discs': '1'}\nOne of mine and my children's favorites. Glad I can share with my grandkids\nGlad I can share with my grandkids\nFranklin Triple Feature - Finders Keepers\nVarious  (Actor),     Dermot Walshe  (Director),     Gary Hurst  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Lovable and relatable Franklin explores the world around him by conquering his fears and finding solutions to any troubles he gets himself into. Join Franklin and his band of animal pals in over 3 hours of fun.']\n{'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'John Bruggen, Dermot Walshe, Gary Hurst, Various', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'PRC55540DVD', 'Director': 'Dermot Walshe, Gary Hurst, John Bruggen', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Various', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nFast shipping and great to share with the whole family\nFive Stars\nPaw Patrol\nVictoria Abril  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['PAW PATROL is a CG, action-adventure preschool series starring a pack of six heroic puppies: Chase, Marshall, Rocky, Zuma, Rubble, and Skye, who are led by a tech-savvy 10-year-old boy named Ryder. With a unique blend of problem-solving skills, cool vehicles and lots of cute doggy humor, the PAW PATROL works together on high-stakes rescue missions to protect the Adventure Bay community. From Marshall the firedog to Chase the police pup to Skye, who flies high in her copter, each pup brings unique personality and skill to the team, modeling the importance of teamwork and good citizenship. They all have special Pup Packs on their backs to help them handle anything - from rescuing kittens to saving a train from a rockslide! And no matter how big the adventure, the PAW PATROL always has time for a game, a laugh, and an ear scratch from Ryder.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.33 Ounces', 'Item model number': '131390', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Victoria Abril', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nFast shipping and awesome cartoon. The kids love it\nFive Stars\nPaw Patrol: Brave Heroes, Big Rescues\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Paw Patrol: Brave Heroes Big Rescues DVD - Save the day with 6 huge and heroic rescues of PAW Patrol! EmBARK on two daring double-length adventures as the PAW Patrol transforms into magical Mer-Pups to save underwater friends AND rescues Adventure Bay from a dinosaur invasion! Plus, join the pups as they save Jake, the Adventure Day Parade, a kitty, and even Marshall! Nickelodeon Run Time: 92 minutes']\n{'Genre': 'Kids & Family/Animation', 'Format': 'NTSC, Widescreen', 'Contributor': 'PAW PATROL: BRAVE HEROES BIG RESCUES', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '35225889', 'Media Format': 'NTSC, Widescreen', 'Release date': 'March 1, 2016', 'Studio': 'Paramount', 'Number of discs': '1'}\nFast shipping and kids love it!\nFive Stars\nClifford: Clifford's Doghouse Adventures\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Clifford\\'s big doghouse is where the fun begins on Birdwell Island. It\\'s the place Clifford, Emily Elizabeth and their friends meet and make plans for adventures big and small. Laughing, playing and sharing great times together, they dig up treasures, perform in a band, explore the local carnival, and make a new friend. Episodes include: \"Clifford Cleans His Doghouse,\" \"Doggie Garden,\" \"Screaming for Ice Cream,\" \"Jetta\\'s Project,\" \"Then Came Bob,\" \"Clothes Don\\'t Make the Dog,\" \"Limelight Fright,\" \"Clifford\\'s Cookie Craving,\" \"Guess Who\\'s Coming to Birdwell.\"']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 3.2 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Full Screen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'February 6, 2007', 'Dubbed': 'Spanish', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nFast shipping. Grand baby loves it.\nFive Stars\nClifford - Everyone Loves Clifford / Good Friends, Good Times\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Features include: •MPAA Rating: UNRATED•Format: DVD•Runtime: 112 minutes']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC', 'Language': 'Unqualified', 'Runtime': '1 hour and 52 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC', 'Run time': '1 hour and 52 minutes', 'Release date': 'February 1, 2005', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nThank you so much. Great DVD 😊\nGreat DVD 😊\nThe Water Babies [DVD]\nJames Mason  (Actor),     Bernard Cribbins  (Actor),     Lionel Jeffries  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n[\"Dive beneath the wavesand beyond your wildest dreamsto an underwater playground overflowing with adventure! Featuring a magical mix of live action and animation, The Water Babies is the most fun you'll have aboveand belowsea level! When 12-year-old Tom jumps into a swirling stream, he is suddenly swept away to a fantastical place filled with music, excitement and colorful characters. Frolicking with the fish, singing with the squid and cavorting with the crabs, Tom's as happy as a clam until he grows lonesome for his friends back home. To get to solid ground, Tom must findthe Water Babiesa group of fun-loving children who live far across the ocean. For only the WaterBabies can take Tom to the great Lord of the Seathe one creature powerful enough to make his every wish come true!\"]\n{'Genre': 'Anime & Manga, Action & Adventure', 'Format': 'Animated, Color, DVD, Live, NTSC', 'Contributor': 'Denis Norden, Tommy Pender, Jon Pertwee, Joan Greenwood, Paul Luty, Michael Robson, Charles Kingsley, Lance Percival, David Jason, Olive Gregg, Lionel Jeffries, Billie Whitelaw, Bernard Cribbins, David Tomlinson, Samantha Gates, James MasonDenis Norden, Tommy Pender, Jon Pertwee, Joan Greenwood, Paul Luty, Michael Robson, Charles Kingsley, Lance Percival, David Jason, Olive Gregg, Lionel Jeffries, Billie Whitelaw, Bernard Cribbins, David Tomlinson, Samantha Gates, James Mason  See more', 'Language': 'English (Mono)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Lionel Jeffries', 'Media Format': 'Animated, Color, DVD, Live, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'February 4, 2003', 'Actors': 'James Mason, Bernard Cribbins, Billie Whitelaw, Joan Greenwood, David Tomlinson', 'Subtitles': 'English, French, Spanish', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Charles Kingsley, Denis Norden, Lionel Jeffries, Michael Robson', 'Number of discs': '1'}\nThis takes me back to my childhood. The case was a little cracked, but overall I'm very happy. Thank you\nbut overall I'm very happy. Thank\nSesame Street: Essentials Collection - Learning\nStephen Colbert  (Actor),     Nicole Sullivan  (Actor),     Jon Stone  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"All-Star Alphabet: Get to know your ABCs with this fun-filled adventure that celebrates the wonder of word and the joys of the alphabet, Sesame Street-style. Shapes, sounds, and colors come to life as letters A and Z join Elmo and the gang for some F-U-N at the mall. Whether it's crooning with Sheryl Crow or rocking with Melissa Ethridge, dozens of entertaining songs and skits add to the excitement as every letter gets a chance to shine. No matter how you spell it, Sesame Street's All-Star Alphabet makes the grade! Learning About Numbers: The Count shows why he's the Number One host when it comes to numbers. In a wacky, way-out look at counting, the Count and his Sesame Street friends Big Bird, Ernie and Grover count their way from 1 to 10 and beyond. Count on plenty of fun and learning, with a street full of silly songs, hilarious comedy sketches and animation. Guess That Shape and Color: You're invited to play a shapes guessing game with Elmo and Zoe and their friends! From squares and circles to ovals and octagons, shapes are everywhere! Can the Sesame Street gang find seven squares before the mouse climbs up the cock? Elmo and Zoe must also find a gorgeous rainbow of fabulous food choices. Can your preschooler help them out? Join everyone's favorite furry monsters in this video that teaches shapes, colors and healthy eating.Bonus Content:\", 'Disc 1 - Sesame Street All-Star Alphabet:', 'Alphabet Matching Game', 'Alphabet Matching Game']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '17370940', 'Director': 'Jon Stone', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'September 3, 2018', 'Actors': 'Stephen Colbert, Nicole Sullivan', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Warner Home Video', 'Writers': 'Norman Stiles', 'Number of discs': '3'}\nThe kids love it. Brings back many memories from when I was younger\nFive Stars\nThe Wild Thornberrys: The Complete Series\nTim Curry  (Actor),     Lacey Chabert  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n[\"All 91 Wild Adventures! The globe-trotting girl with the gift of gab and her fantastic family invite you to join them on the adventure of a lifetime in The Wild Thornberrys: The Complete Series! After an encounter with a mysterious shaman, Eliza Thornberry is granted the amazing ability to talk with animals. Traveling to every corner of the world with her family of daffy documentarians, Eliza uses her fantastic skill to learn about the lifestyles and habitats of the world's most exotic creatures: straight from the horse's mouth! (And the chimp’s mouth, and the lion’s mouth, and… well, you get the idea.) With all 91 episodes of the Nickelodeon classic cartoon series, Eliza’s animated adventures promise hours upon hours of family fun. So what are you waiting for? Climb aboard the Thornberry Commvee: the journey is about to begin, and your ticket is The Wild Thornberrys: The Complete Series… brought to you by a Nickelodeon fan’s favorite travel agent, Shout! Factory\"]\n{'Genre': 'Animation/Television, Kids & Family/Animation', 'Format': 'Multiple Formats, Box set, Color, Full Screen, Animated, NTSC', 'Contributor': 'Flea, Tim Curry, Various, Lacey Chabert', 'Language': 'English', 'Number Of Discs': '15', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.09 Pounds', 'Item model number': '35225515', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, Animated, NTSC', 'Run time': '34 hours and 30 minutes', 'Release date': 'December 8, 2015', 'Actors': 'Tim Curry, Lacey Chabert, Flea', 'Studio': 'Shout Factory', 'Number of discs': '15'}\nMy kids used to watch this show all the time and now I get to share it with their children 😊\nMy kids used to watch this show all the time ...\nDragon Tales: Experience New Things!\nAndrea Libman  (Actor),     Danny McKinnon  (Actor),     Michael Hack  (Director),     Phil Weinstein  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n{'Genre': 'Children, TV Family', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Scott McNeil, Ron Rodecker, James Coane, Phil Weinstein, Chantal Strand, Janna King Kalichman, Wesley Eure, Danny McKinnon, Eli Gabay, Stevie Vallance, Ty Olsson, Jason Michas, Kathleen Barr, Aida Ortega, Melody Fox, Gary Chalk, Andrea Libman, Ellen Kennedy, Michael HackScott McNeil, Ron Rodecker, James Coane, Phil Weinstein, Chantal Strand, Janna King Kalichman, Wesley Eure, Danny McKinnon, Eli Gabay, Stevie Vallance, Ty Olsson, Jason Michas, Kathleen Barr, Aida Ortega, Melody Fox, Gary Chalk, Andrea Libman, Ellen Kennedy,…  See more', 'Language': 'English', 'Runtime': '38 minutes'}\nOh how this brings back memories. Love it!\nLove it!\nDragon Tales - Don't Give Up\nAndrea Libman  (Actor),     Danny McKinnon  (Actor),     Michael Hack  (Director),     Phil Weinstein  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Must have DVD of the popular PBS animated series Dragon Tales!!', 'Amazon.com', 'Max and Emmy, best-loved siblings of the sandbox set, dust off their dragon scale a crowd-pleasing five times for', \"Don't Give Up\", '. From a parent\\'s perspective, that adds up to five recitations of the magic rhyme to come back home until next time, which equals the same count of tricky life lessons tucked into a child\\'s belt. From preschoolers\\' vantage point, it means a quintuple scoop of dragon play dates amid the show\\'s sherbet-hued scenery. \"Pigment of Your Imagination\" pits the gang against a broken map; \"Backwards to Forwards\" sends Dragonland into topsy-turvy tailspins; \"Sand Castle Hassle\" tests the troop\\'s perseverance as the homes they craft for turtles topple; \"Tails You Lose\" lets the wind out of Emmy\\'s idea that winning is everything; and \"Bully for You\" gets to the bottom of what\\'s really bothering a scaly green meanie. A sing-along segment and subtitles sweep this PBS program squarely into satisfaction-guaranteed territory.', '--Tammy La Gorce']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 70 min', 'Director': 'Michael Hack, Phil Weinstein', 'Media Format': 'Color, Multiple Formats, NTSC, Animated, Closed-captioned, Subtitled, Dubbed', 'Run time': '30 minutes', 'Release date': 'January 1, 2002', 'Actors': 'Andrea Libman, Danny McKinnon, Ty Olsson, Chantal Strand, Jason Michas', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French, English', 'Language': 'English (Dolby Digital 2.0 Surround), Spanish, Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'James Coane, Janna King Kalichman, Melody Fox, Ron Rodecker, Wesley Eure', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOh how this brings back memories. Love it!\nLove it!\nDragon Tales - Sing and Dance in Dragonland\nAndrea Libman  (Actor),     Danny McKinnon  (Actor),     Michael Hack  (Director),     Phil Weinstein  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Get ready to sing and \"Shake Your Dragon Tail\" with all of your Dragon friends in this collection of favorite musical moments from Dragon Tales! Children will have lot of fun signing and dancing to the most popular songs from the top-rated PBS series. \"Sing and Dance in Dragonland!\" is a fun, reading readiness activity with bold animated lettering, making it easy for little ones to follow along. It\\'s an activity they\\'ll enjoy over and over again!']\n{'Genre': 'Family, Children', 'Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Contributor': 'Scott McNeil, Ron Rodecker, James Coane, Phil Weinstein, Chantal Strand, Janna King Kalichman, Wesley Eure, Danny McKinnon, Eli Gabay, Stevie Vallance, Ty Olsson, Jason Michas, Kathleen Barr, Aida Ortega, Melody Fox, Gary Chalk, Andrea Libman, Ellen Kennedy, Michael HackScott McNeil, Ron Rodecker, James Coane, Phil Weinstein, Chantal Strand, Janna King Kalichman, Wesley Eure, Danny McKinnon, Eli Gabay, Stevie Vallance, Ty Olsson, Jason Michas, Kathleen Barr, Aida Ortega, Melody Fox, Gary Chalk, Andrea Libman, Ellen Kennedy,…   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': 'MFR043396081048#VG', 'Director': 'Michael Hack, Phil Weinstein', 'Media Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Run time': '30 minutes', 'Release date': 'August 2, 2005', 'Actors': 'Andrea Libman, Danny McKinnon, Ty Olsson, Chantal Strand, Jason Michas', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'James Coane, Janna King Kalichman, Melody Fox, Ron Rodecker, Wesley Eure', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOh how this brings back memories. Love it!\nLove it!\nDragon Tales - Let's Share! Let's Play!\nAndrea Libman  (Actor),     Danny McKinnon  (Actor),     Michael Hack  (Director),     Phil Weinstein  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Six-year-old Emmy, her four-year-old brother Max, and the colorful residents of Dragon Land learn the value of sharing and playing together in six warm learning adventures for children.', 'Amazon.com', 'Emmy and her little brother Max learn the basic lessons of young childhood with the help of their dragon buddies in this PBS series. Whenever earthly life gets a little overwhelming or puzzling, the pair chant their way to a make-believe land where the wise elder Quetzal and some young flying lizards help them solve problems. Although two of the five titles use adult word play (\"Much Ado About Nodlings,\" \"The Fury Is Out on This One\"), the humor and storytelling are strictly for the kids. Cooperation, understanding the consequences of one\\'s actions, sibling compromise, and anger-management lessons for tots are at the top of the agenda. Puppet shows, magical creatures, and Zak and Wheezie (the two-headed brother-sister dragon) help teach the lessons. The advantage of the DVD format is that each 12-minute segment can be viewed independently, without the kids getting tempted by the next episode. The disadvantage: Until the little ones get the hang of the remote controls, you have to be there every 12 minutes to start the next episode. DVD features include three 90-second sing-alongs designed to get the kids up and dancing. (Ages 3 to 7)', '--Kimberly Heinrichs']\n{'Genre': 'Children', 'Format': 'Closed-captioned, Color, NTSC, Subtitled, Multiple Formats, Animated', 'Contributor': 'Scott McNeil, Ron Rodecker, James Coane, Phil Weinstein, Chantal Strand, Janna King Kalichman, Wesley Eure, Danny McKinnon, Eli Gabay, Stevie Vallance, Ty Olsson, Jason Michas, Kathleen Barr, Aida Ortega, Melody Fox, Gary Chalk, Andrea Libman, Ellen Kennedy, Michael HackScott McNeil, Ron Rodecker, James Coane, Phil Weinstein, Chantal Strand, Janna King Kalichman, Wesley Eure, Danny McKinnon, Eli Gabay, Stevie Vallance, Ty Olsson, Jason Michas, Kathleen Barr, Aida Ortega, Melody Fox, Gary Chalk, Andrea Libman, Ellen Kennedy,…   See more', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Item model number': '07304', 'Director': 'Michael Hack, Phil Weinstein', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '30 minutes', 'Release date': 'August 14, 2001', 'Actors': 'Andrea Libman, Danny McKinnon, Ty Olsson, Chantal Strand, Jason Michas', 'Subtitles': 'English, Spanish, French', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'James Coane, Janna King Kalichman, Melody Fox, Ron Rodecker, Wesley Eure', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOh how this brings back memories. Love it!\nLove it!\nTop Secret! (1984)\nVarious  (Actor, Director)    Rated:    PG    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Top Secret! (DVD)', ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Mono)', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'May 21, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nOne of my childhood favorites\nGreat movie\nGoonies, The (WBFE) (DVD)\nSean Astin  (Actor),     Josh Brolin  (Actor),     Richard Donner  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Product Description', 'Goonies, The (WBFE) (DVD)', \"Steven Spielberg, Richard Donner (Lethal Weapon films) and Chris Columbus (Harry Potter films) collaborate to create an epic childen's adventure of subterranean caverns, sunken galleons and a fortune in lost pirate treasure waiting to be found by a group of friends known as the Goonies. With brothers Mikey (Sean Astin) and Brand's (Josh Brolin) house slated for demolition by greedy land developers, the boys decide their only hope lies in finding a long-lost treasure. They uncover a treasure map and with their friends descend to a subterranean sea and an abandoned galleon in this fun-filled, fast-paced adventure.\", ']]>', 'Review', \"It has crooks, bats, cobwebs, skeletons, a lovable monster, an underground grotto and a treasure hidden by some of the most considerate, clue-loving pirates who ever lived. Their ghostly ship is the movie's piece de resistance. --The New York Times, Janet MaslinThe movie remains an embodiment of Spielberg's commercially cunning brand of clankingly retro film making. Despite the wit and charm brought to their Spiel-speak dialogue by the talented young performers, The Goonies is less a movie than an entertainment machine. --The Globe and Mail, Jay ScottThis is truly a great kids film and great family film. The clever usage of the plot is what will really capture your attention. If not that then the great characters, bits of action, and bits of comedy will catch your eye. --Zilcell\"]\n{'Aspect Ratio': '16:9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.64 Ounces', 'Item model number': '116314', 'Director': 'Richard Donner', 'Media Format': 'NTSC, Multiple Formats, Color, Widescreen, Closed-captioned', 'Run time': '1 hour and 54 minutes', 'Release date': 'January 8, 2008', 'Actors': 'Sean Astin, Josh Brolin, Jeff Cohen, Corey Feldman, Kerri Green', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Richard Donner, Steven Spielberg, Frank Marshall, Harvey Bernhard, Kathleen Kennedy', 'Language': 'Unqualified', 'Studio': 'WarnerBrothers', 'Writers': 'Chris Columbus, Steven Spielberg', 'Number of discs': '1'}\nMy favorite movie!!\nAwesome product",
  "profile": "The user continues to demonstrate a strong dedication to family-friendly animated content that fosters connection and educational value across generations. Their recent purchase of a nostalgic film further highlights their commitment to high-quality narratives that encourage family bonding and showcase relatable characters facing challenges, aligning with their history of selecting stories that promote teamwork and life lessons.\n\nThey particularly appreciate films that merge entertainment with educational themes, featuring rich character development suitable for all ages. Their preference for DVD formats reflects a desire to create meaningful family experiences, minimizing distractions during viewing. Their ongoing enthusiasm for cherished childhood titles emphasizes a passion for engaging storytelling and nostalgia.\n\nThe latest interaction reveals the user's appreciation for humor and narratives that provide a blend of entertainment and nostalgia, transcending typical genres while maintaining an emphasis on uplifting themes. Their interest in music-based content showcases their belief in the unifying power of songs to enhance interactive family viewing experiences.\n\nOverall, the user's profile underscores their role as a caregiver devoted to fostering meaningful connections through enriching narratives during family gatherings, cherishing memories, and prioritizing experiences that stimulate joy and shared learning through entertainment. Their choices reflect a blend of adventure, humor, and heartfelt storytelling that resonates with both children and adults alike.",
  "metrics": {
    "rouge1_f": 0.05697299975229131,
    "rouge2_f": 0.005947955390334573,
    "rougeL_f": 0.031211295516472632,
    "meteor": 0.01466827885587425,
    "bleu1": 3.3535953845297404e-11,
    "bleu2": 1.3334402612798517e-11,
    "bleu3": 1.7726155450568485e-12,
    "bleu4": 6.470150800105112e-13,
    "bertscore_precision": 0.3091796338558197,
    "bertscore_recall": 0.4874110817909241,
    "bertscore_f1": 0.37835636734962463
  }
}