{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: PURE Castor Oil with Sweet Almond Oil, Coconut Oil and Vitamin E Oil - Best Hair Growth, Regrowth, & Conditioning Oil Blend for Eyelashes & Eyebrows. 100% Natural - NO Parabens, Fillers or Toxins\nReview Date: 2016/03/01\nStore: Mia Adora\nProduct Description: ['Short thinning lashes, brows, or other hair?', 'Forget harsh chemicals & growth products used around your eyes with possible long term side effects! MEET the', 'FABULOUS FOUR', 'super oil blend…', 'We’ve created a proprietary blend of the four most powerful & researched oils to', 'help thicken & strengthen your short thin hairs naturally.', 'May also be used as a', 'natural eye makeup remover that conditions lashes & prevents lash fallout.', 'Castor Oil –', 'This thick seed oil traditionally used to treat hair loss, conditions & lubricates hair, nourishes hair follicles with vitamins & fatty acids, prevents thinning & shedding of delicate hair, lashes, & brows.', 'Sweet Almond Oil –', 'Packed with nourishing vitamins that your delicate hair craves, this oil also is used to moisturize & condition hair. It strengthens hair, prevents damage & shedding while promoting growth.', 'Coconut Oil –', 'Another traditionally used oil packed with nutrients that easily penetrates hair follicles to stimulate growth & prevent loss. It also provides a lipid barrier to prevent hair damage.', 'Vitamin E Oil –', 'Powerful essential vitamin to promote hair growth by nourishing & conditioning hair follicles.', '*Our oils are cold-pressed, hexane free & packaged perfectly to preserve potency. Also comes with a no mess treatment pump which is preferred over droppers.']\nAverage Rating: 4.0\nProduct Details: {'Hair Type': 'Thick, Thin', 'Scent': 'Coconut', 'Item Form': 'Oil', 'Brand': 'Mia Adora', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.5 x 1.3 x 1.3 inches; 0.32 Ounces', 'UPC': '013189194309 794168039544', 'Manufacturer': 'Mia Adora'}\nReview Text: I really like this Castor Oil blend for removing my eye makeup. It does an exceptional job of breaking down mascara. The best part of this product comes from continued use! Eyelashes become darker, shinier and a lot healthier. I've noticed less breakage and fall down after introducing this product into my skin care routine. I'm hoping to see some growth soon. I gave up on trying to use one of those so-called miracle eyelash serums because it burned my eyes so bad. This Mia Adora oil does not burn if you get it in your eyes, it just makes your vision blurry for a while. I was fortunate to have purchased this item with a promotional discount for the purpose of testing and review. I like the way it effectively breaks down and removes eye makeup. It's gentle on the delicate eye area and it's fragrance free. You can use this oil as a conditioning treatment alone, just a drop or two for each eye, and the bottle will last you a good while.\nReview Title: The Mia Adore castor oil blend your lashes will love\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "PURE Castor Oil with Sweet Almond Oil, Coconut Oil and Vitamin E Oil - Best Hair Growth, Regrowth, & Conditioning Oil Blend for Eyelashes & Eyebrows. 100% Natural - NO Parabens, Fillers or Toxins\nMia Adora\n['Short thinning lashes, brows, or other hair?', 'Forget harsh chemicals & growth products used around your eyes with possible long term side effects! MEET the', 'FABULOUS FOUR', 'super oil blend…', 'We’ve created a proprietary blend of the four most powerful & researched oils to', 'help thicken & strengthen your short thin hairs naturally.', 'May also be used as a', 'natural eye makeup remover that conditions lashes & prevents lash fallout.', 'Castor Oil –', 'This thick seed oil traditionally used to treat hair loss, conditions & lubricates hair, nourishes hair follicles with vitamins & fatty acids, prevents thinning & shedding of delicate hair, lashes, & brows.', 'Sweet Almond Oil –', 'Packed with nourishing vitamins that your delicate hair craves, this oil also is used to moisturize & condition hair. It strengthens hair, prevents damage & shedding while promoting growth.', 'Coconut Oil –', 'Another traditionally used oil packed with nutrients that easily penetrates hair follicles to stimulate growth & prevent loss. It also provides a lipid barrier to prevent hair damage.', 'Vitamin E Oil –', 'Powerful essential vitamin to promote hair growth by nourishing & conditioning hair follicles.', '*Our oils are cold-pressed, hexane free & packaged perfectly to preserve potency. Also comes with a no mess treatment pump which is preferred over droppers.']\n{'Hair Type': 'Thick, Thin', 'Scent': 'Coconut', 'Item Form': 'Oil', 'Brand': 'Mia Adora', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.5 x 1.3 x 1.3 inches; 0.32 Ounces', 'UPC': '013189194309 794168039544', 'Manufacturer': 'Mia Adora'}\nI really like this Castor Oil blend for removing my eye makeup. It does an exceptional job of breaking down mascara. The best part of this product comes from continued use! Eyelashes become darker, shinier and a lot healthier. I've noticed less breakage and fall down after introducing this product into my skin care routine. I'm hoping to see some growth soon. I gave up on trying to use one of those so-called miracle eyelash serums because it burned my eyes so bad. This Mia Adora oil does not burn if you get it in your eyes, it just makes your vision blurry for a while. I was fortunate to have purchased this item with a promotional discount for the purpose of testing and review. I like the way it effectively breaks down and removes eye makeup. It's gentle on the delicate eye area and it's fragrance free. You can use this oil as a conditioning treatment alone, just a drop or two for each eye, and the bottle will last you a good while.\nThe Mia Adore castor oil blend your lashes will love",
  "profile": "**User Summary**\n\nThis user demonstrates a strong preference for natural, effective beauty products focused on hair and skin care. They prioritize ingredients that are free from harsh chemicals, parabens, and toxins, reflecting a commitment to health-conscious choices. The user seeks products that promote hair growth and conditioning, particularly for eyelashes and eyebrows, indicating a concern for hair health and aesthetics. They prefer multifunctional oils that can serve both as conditioning treatments and makeup removers, showcasing a desire for versatile solutions.\n\nIn their interaction, they express satisfaction with the product's effectiveness, particularly in removing makeup and enhancing the health of their eyelashes, showing a clear trend towards products that deliver visible results. The user's experience also highlights their sensitivity to product safety, as they mention discomfort with previous chemical products, favoring gentler options instead.\n\nOverall, this user values high-quality, natural beauty solutions that provide noticeable benefits, emphasize hair wellness, and maintain a gentle profile on sensitive areas like the eyes.",
  "metrics": {
    "rouge1_f": 0.2604501607717042,
    "rouge2_f": 0.025806451612903222,
    "rougeL_f": 0.09967845659163987,
    "meteor": 0.10749958867470374,
    "bleu1": 0.0543579605764058,
    "bleu2": 0.01723539637699526,
    "bleu3": 0.005660255479089666,
    "bleu4": 0.0018265380206085968,
    "bertscore_precision": 0.37335115671157837,
    "bertscore_recall": 0.4662374258041382,
    "bertscore_f1": 0.4146561622619629
  }
}