{
  "interaction_number": 18,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Beard Comb Or Fine Tooth Mustache Pocket Stainless Steel Metal Powder Coated Black Keychain Comb For Men - 3.25 x 1 Inches by Death Grip\nReview Date: 2022/07/05\nStore: THE VINTAGE GROOMING CO.\nAverage Rating: 4.5\nProduct Details: {'Material': 'Metal', 'Brand': 'Death Grip', 'Hair Type': 'All', 'Color': 'Black', 'Size': 'Small', 'Product Dimensions': '3 x 1 x 0.1 inches; 2.4 Ounces', 'Department': 'mens', 'UPC': '710702883497', 'Manufacturer': 'The Vintage Grooming Co'}\nReview Text: Though this grooming comb is small in size, the stainless steel composite is mighty in strength. The 3\" length fits quite comfortably in your hand too, which makes it perfect for combing & styling facial hair. A couple of the teeth on the piece I received are bent, but it's minor and not bad enough to warrant a rating reduction. The graphic logo on the comb's end features a skull with a fantastic handlebar mustache and the brand name 'Death Grip' proudly displayed. There is a hole cut out of the top that can be utilized with a small section of ball chain, if you wanted to make a keychain out of it. I wish the manufacturer would've included the ball chain; it would've been a nice gesture since this piece is obviously designed to be used like that.<br /><br />Photos included for perspective - including one of this itty bitty comb next to a full sized rat tail comb.\nReview Title: A major upgrade from the plastic rat tail comb, because men deserve nice things! 🤗\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "PURE Castor Oil with Sweet Almond Oil, Coconut Oil and Vitamin E Oil - Best Hair Growth, Regrowth, & Conditioning Oil Blend for Eyelashes & Eyebrows. 100% Natural - NO Parabens, Fillers or Toxins\nMia Adora\n['Short thinning lashes, brows, or other hair?', 'Forget harsh chemicals & growth products used around your eyes with possible long term side effects! MEET the', 'FABULOUS FOUR', 'super oil blend…', 'We’ve created a proprietary blend of the four most powerful & researched oils to', 'help thicken & strengthen your short thin hairs naturally.', 'May also be used as a', 'natural eye makeup remover that conditions lashes & prevents lash fallout.', 'Castor Oil –', 'This thick seed oil traditionally used to treat hair loss, conditions & lubricates hair, nourishes hair follicles with vitamins & fatty acids, prevents thinning & shedding of delicate hair, lashes, & brows.', 'Sweet Almond Oil –', 'Packed with nourishing vitamins that your delicate hair craves, this oil also is used to moisturize & condition hair. It strengthens hair, prevents damage & shedding while promoting growth.', 'Coconut Oil –', 'Another traditionally used oil packed with nutrients that easily penetrates hair follicles to stimulate growth & prevent loss. It also provides a lipid barrier to prevent hair damage.', 'Vitamin E Oil –', 'Powerful essential vitamin to promote hair growth by nourishing & conditioning hair follicles.', '*Our oils are cold-pressed, hexane free & packaged perfectly to preserve potency. Also comes with a no mess treatment pump which is preferred over droppers.']\n{'Hair Type': 'Thick, Thin', 'Scent': 'Coconut', 'Item Form': 'Oil', 'Brand': 'Mia Adora', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.5 x 1.3 x 1.3 inches; 0.32 Ounces', 'UPC': '013189194309 794168039544', 'Manufacturer': 'Mia Adora'}\nI really like this Castor Oil blend for removing my eye makeup. It does an exceptional job of breaking down mascara. The best part of this product comes from continued use! Eyelashes become darker, shinier and a lot healthier. I've noticed less breakage and fall down after introducing this product into my skin care routine. I'm hoping to see some growth soon. I gave up on trying to use one of those so-called miracle eyelash serums because it burned my eyes so bad. This Mia Adora oil does not burn if you get it in your eyes, it just makes your vision blurry for a while. I was fortunate to have purchased this item with a promotional discount for the purpose of testing and review. I like the way it effectively breaks down and removes eye makeup. It's gentle on the delicate eye area and it's fragrance free. You can use this oil as a conditioning treatment alone, just a drop or two for each eye, and the bottle will last you a good while.\nThe Mia Adore castor oil blend your lashes will love\nTinksky Nail Art Stamping Printing Plate Manicure Stamping Image Plate Templates with Stamp Pack of 10 (Silver)\n{'Package Dimensions': '6.1 x 3.6 x 1.2 inches; 8 Ounces', 'UPC': '889736846560'}\nI love to use nail stamping in my manicures. It is fairly easy to learn how to do, it's incredibly fun and really can amp up the look of your nails. The downside of all that is it can get expensive!! This 11 piece set from Tinksky is a great value for all that you get, and is perfect for anyone that either wants to try it out -or- wants to build up a variety of images. Granted, there aren't any examples shown of the stamping plates that you'll get, so that's a little bit of a mystery. If you don't mind that, I do recommend this set!!<br />Attached are photos of the plates that I received... I am super happy to have the images that I received and although I don't love the stamper, it is nice to have!! Keep in mind that you may have to experiment with your technique and try different polishes with these plates. Just because you may not get an image to pickup on the first or second try does not mean that the plate is trash. Not all stamper heads and polishes will work together nicely from plate to plate. Having said all that, I have had pretty good experiences using these and I am a beginner.<br />I was given a promotional discount on my purchase in exchange for my review.<br />Would I buy it again at full price? You bet!! Would I recommend it to a friend? Absolutely!!<br />***IMAGES IN MY SET (IN ORDER OF APPEARANCE)***<br />1. Ocean Elements<br />2. Butterflies/Flowers<br />3. Garden Scenery (Full Plate Buffet Style Image)<br />4. Shoe Couture<br />5. Horse & Carriage (Full Plate Buffet Style Image) Moyou London knockoff<br />6. French Motifs<br />7. Easter Icons<br />8. Masquerade Masks<br />9. Pop Comics<br />10. Designer French Tips<br />Thanks for reading my review and have a great day!! : )\nA great set for beginners and collectors too!!\nShinail Glass Nail File and Buffer Block, Nail Polish Tool with Leather Protective Pouch, Crystal Nail Shiner Manicure Tool\n{}\nThis is absolute garbage! It does not file the nail nor does it impart any shine whatsoever. Seriously, go to your local beauty supply store and get a 4way buffer block for less than a dollar-- you'll get great results with that!!<br />I purchased this item with a promotional discount for the purpose of testing and review.\nWhat a dissapointment!!\nFluorescent Pink 4 Oz - Liquid Latex Body Paint, Ammonia Free No Odor, Easy On and Off, Cosplay Makeup, Creates Professional Monster, Zombie Arts\nLiquid Latex Fashions\n{'Color': 'Fluorescent Pink', 'Brand': 'Liquid Latex Fashions', 'Item Weight': '4 Ounces', 'Item Form': 'Liquid', 'Package Information': 'Bottle', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 3 x 3 inches; 4 Ounces', 'Item model number': '010620aa', 'UPC': '811832016844', 'Manufacturer': 'Liquid Latex Fashions'}\nGood liquid latex is every nail artist's best friend. I decided to purchase this jar after using up my supply of prepared/bottled liquid latex varieties, and I am so glad I did. Prior to discovering Liquid Latex Fashions, I was buying liquid latex marketed as &#34;nail art tape&#34;. In terms of package price and the consistent quality of product, I find that this is the much better option. As long as I continue to stamp, water marble and do gradient nails I will continue to use THIS. Here are the highlights as to why I think Liquid Latex Fashions is superior to all the rest:<br /><br />* Package size is 4 ounces and an ample supply for simple nail art. It is smaller in real life than what it appears in the ad photos. I have been using this as my go-to for the past six months and have barely made a dent in it. I suspect that it will probably dry up before I can get through it all.<br />* Product is simple to decant - the large mouth on the jar makes it easy to use an infant medicine syringe to draw the liquid up and dispense into a clean nail polish bottle. (You can get the plastic medi syringes for free at the pharmacy counter - all you have to do is ask.)<br />* Consistency is thin/watery, which is easy to apply and dries very fast. It turns to a dark pink when it's dry. One layer works great for me, but you can add more layers if needed.<br />* It peels so good! Always a clean peel in one solid sheet - no bits and pieces of latex that break off. You can literally roll your fingertip across the edge and peel it off in one whole piece. No more fighting with latex removal after doing a gorgeous gradient!<br />* FYI: Ammonia free does not mean odorless. This product does not smell good at all. If you've used any type of liquid latex before, you know it does have a distinguishable smell. It is somewhere between fish oil and cat urine. Or a mixture of both. Yeah, it stinks to be perfectly honest. Just be forewarned.<br />* Pricing of this is so much more economical versus prepared varieties. In fact, I wouldn't be surprised if some folks weren't just repackaging this and slapping their brand labels on it.<br />* The bonus to THIS particular liquid latex - it's black light reactive... so if you plan on going to an all-night rave anytime soon, you can wear this and you'll glow all night! lol ;)<br /><br />🌟🌟🌟🌟🌟<br />Highly recommended and I will most definitely repurchase when I hit tub bottom. Thanks for reading!<br /><br />Seriously though, one more thing - In order to keep the latex fresh and from drying up, you should make sure to wipe any excess latex from around the neck of the jar. Keep the lid screwed on tight when not in use, and store it in a cool dry place.\nAbsolutely the BEST for nail art and I've tried MANY!\n3Pcs Nail Gradient Sponges Brush Pens Kit, AKWOX 3 Differents UV Gel Nail Art Brush Gradient Ombre Brushes Double Head Nail Sponge Painting Pen with 4 Replacement Heads\nAKWOX\n{'Product Dimensions': '7.1 x 3.1 x 0.52 inches; 3.99 Ounces', 'Item model number': 'AK-OT051'}\nPrior to purchasing this, I did some comparison shopping and found that this set costs roughly the same price as if i were to buy the same products, direct from overseas, (but without the 3-4 week wait). The quality of each item is astounding, and was delivered with 2-day Prime shipping. I was a tad bit surprised at the size of the gradient sponges though. I've seen them used in \"Aeropuffing\" tutorials, and for some reason i thought they'd be bigger. In actuality, they are about the size of a nickel, (and obviously round in circumference). The sponges feature both round and slightly tapered tips, and the package includes 2 replacements of each. Both of the ombrè brushes I received have adequate bristles, and the ferrules are securely attached. Every one of these items is exact to the ones you see being rebranded by big companies - without the hefty mark-up. I would definitely repurchase and I recommend this set without question! :)\nFantastic tools without the hefty mark-up!\n10Pack 2oz Plastic Empty Spray Bottle, Mostof Fine Mist Small Clear Travel Plastic Bottles Container with Funnels Labels\nMostof\n{'Brand': 'Mostof', 'Capacity': '2 Ounces', 'Special Feature': 'Mist Spray', 'Product Care Instructions': 'Hand Wash Only', 'Reusability': 'Reusable', 'Package Dimensions': '6.5 x 6.3 x 3.9 inches; 8.78 Ounces', 'UPC': '634715829481'}\nA spray bottle is a spray bottle, right? 🤔 Lol, nope!<br /><br />So, here we are... shopping on Amazon, presented with a thousand options for something as simple as a bottle that sprays. 😰<br /><br />My selection criteria was this: (a) The plastic must be able to handle liquid sanitizer made with a base of 60% alcohol (the 91% ISP variety), *without suffering undesirable changes* and (b) Have a good spray nozzle capable of producing a fine, even mist *without getting clogged*.<br /><br />This set of bottles from MOSTOF checks both of those boxes. ✔ I tested them specifically against 2 different types of liquid (not gel) sanitizer.  Initially, I chose this particular set for the larger sized funnels that are also included, and the fact that it comes with (10) travel sized bottles.<br /><br />None of my bottles leak and they spray a fine, even mist without leaving droplets.  After seeing the spray function in action, I decided to use a couple of these for facial mists and essences. I don't know (yet) whether they'll spray every last drop, but the sprayer feed wraps all the way around the bottom of the bottle, which does look promising. 🤞 So far, every liquid I've put in them has been fine; the plastic didn't change and the sprays perform the same.<br /><br />Ultimately, I had to dock a star from my rating because the bottles came filthy inside, 😬 every one of them is heavily scratched up, and one of the bottles I received doesn't sit evenly. ➡️(see photos 3&4: defect (warped) bottle is on the right)⬅️<br /><br />PRO'S:<br />+ Contains everything you need to package liquids immediately<br />+ Includes larger sized funnels = quick flow in filling<br />+ Spray nozzles produce fine, even mist without leaving droplets<br />+ Sprayer feed goes all the way around the bottom of the bottle<br />+ No leaking from the bottle necks or spray nozzles<br />+ Spray nozzles have not clogged<br />+ Caps fit tightly<br />+ No adverse reactions to the plastic (re: high alcohol content)<br />+ Airline approved carry-on size<br />+ Excellent price for ten bottles (and two funnels!)<br />+ Convenient PRIME shipping<br />+ Bonus sheet of labels (they're small, but they work)<br /><br />CONS:<br />- Bottles came really scratched up and very dirty<br />- One of the ten bottles I received doesn't sit evenly<br /><br />SUMMARY:<br />Ultimately, I think there's some quality control issues that the manufacturer could improve upon. As long as you're not an Etsy seller, or someone that's gonna be gifting these, you may not mind the scratches or the possibility of uneven bottom(s). Provided you wash them out really good, they still do the job! 👍🏼 Should anything happen to change with these as time goes on, I will update this review. Thanks for reading! Stay safe. 😷\nWash them well before using 💀\nCOSMOCOS FromNature Perfect Cover BB Cream - Light Beighe/Natural Beige SPF 50+ / PA+++ Sun Protection, Natural Skin Tone, High Coverage Korean Cosmetic K Beauty - 50g (1.76 fl oz) (Light Beige)\nCOSMOCOS\n{'Brand': 'COSMOCOS', 'Item Form': 'Cream', 'Unit Count': '1.72 Fl Oz', 'Number of Items': '1', 'Use for': 'Skin', 'Product Dimensions': '6 x 1.5 x 1 inches; 2.82 Ounces', 'UPC': '364597179540'}\nThe Fromnature BB cream by Cosmocos is unlike any beauty balm I've ever tried. It has much better coverage, and a thicker consistency than any other BB's I've used (which, until now, have all been Western brands). It almost covers like a foundation, but feels extremely lightweight like a BB. It does dry down really fast, and it was a bit darker than I expected. I am light neutral in complexion and chose the shade \"light beige\". I believe I was able to make the color work for me, but I'm not sure if it'll suit all light skin tones. 👻<br /><br />This BB has a beautiful satin matte finish, but did have a tendency to cling to my dry patches, so be sure to start with an exfoliated, well moisturized, and primed face. I did not use any primer with this product, (since it's marketed as a BB cream), and without the aid of a pore filling primer this product did eventually settle into my fine lines & large pores. I am really impressed with the staying power of this product though, even without primer & setting spray! After a full day of masking against covid in the South Florida heat, there was no transfer to my face mask. 😃 That's a huge, HUGE plus! With that being said, I highly recommend using a really good cleanser to efficiently remove this product at the end of the day.<br /><br />PROS:<br />+ Great coverage that can be built up<br />+ Very lightweight on the skin<br />+ Excellent staying power<br />+ SPF 50<br />+ Transfer resistant! 🙌<br />+ No photo flashback!<br />+ Fragrance free!<br />+ 1.67 oz of product (vs. the U.S. standard 1 fl. oz)<br />+ 2 sample hair care products included as a bonus! ❤<br />+ Convenient PRIME Shipping<br /><br />CONS:<br />- Dries very fast and can be difficult to blend<br />- Clings to dry patches<br />- Settles into pores & wrinkles (without primer)<br /><br />TO BE CONSIDERED:<br />* Warm yellow undertone may not suit everyone<br /><br />Side Note: There was one other thing I wanted to mention... When I took the manufacturer safety seal off of the tube, I had a volcanic eruption of BB cream that I wasn't prepared for, which made a mess of my tube. If you're like me and don't want to waste precious product, just be aware that it might come spilling out like lava when you break the product seal. 🙃\nTransfer resistant formula 😷 with excellent coverage! Unlike any BB cream I've ever tried!\nTOUCH IN SOL Best of No Pore Blem Travel Kit - Face Makeup Primer, Big Pores Perfect Cover, Inner-Glowing Skin with Moisture, Long Lasting Makeup's Staying Kit\nTouch in Sol\n{'Brand': 'Touch in Sol', 'Product Benefits': 'Hydrating', 'Skin Type': 'Dry', 'Package Information': 'Tube', 'Item Volume': '0.5 Fluid Ounces', 'Package Dimensions': '6.46 x 5.39 x 1.14 inches; 5.12 Ounces', 'Item model number': 'no pore blem kit'}\nThis is a really nice travel sized set of the Touch in Sol No Poreblem primers, which comes in a cute box, suitable for gifting. The products are deluxe sample sizes, which is a perfect way to try out the line and find your favorite. 🌹<br /><br />I will start off with the Priming Water and Priming Essence. Both of these products come in dropper style ampoules. Neither of mine were filled to the top. These bottles are already on the smaller side, so it was especially disappointing to see missing product. For that, I've docked a star. [see photos attached, including one with a nail polish bottle for scale of sizing.]<br /><br />Both the Essence and Water feels like a light oil in texture. They spread easily, absorb quickly, and are meant to be used as the last step in your skin care. The No Poreblem primer in a tube is your silicone based makeup primer. It has that familiar silky finish, and does do a good job of blurring the pores. This is not so much a pore \"filling\" primer; this one works more to smooth them out, and creates a nice base for your foundation.<br /><br />All of the products in this set have a light rose scent, which smells divine. I am not usually fond of most rosy florals because they are always either too strong, smell artificial, or very old lady-ish. This scent is none of those things. Touch in Sol has nailed the rose fragrance - it's lightweight, very fresh, and I really enjoy it. As someone who is skin sensitive to added fragrance, I had zero reactions to any of these products. 🌹\nPretty packaging, lovely scent 🌹 The best of Touch in Sol No Poreblem primers in a sample size set\nCURECODE Neuromide Ampoule (30 ml), Concentrated Formula of Active Ingredients, Microbiome Science for Extremely Sensitive & Dry Skin, Repair and Protect Skin Barrier Function, Brightening and Firming for Mature Skin Types\nCURECODE\n{'Brand': 'CURECODE', 'Scent': 'Aloe Vera', 'Item Form': 'Serum', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Product Dimensions': '1.5 x 1.5 x 4.25 inches; 3.21 Ounces', 'Item model number': '40006'}\nThe ingredients lineup on this CureCode Neuromide Ampoule is impressive, but the integrity of this product is questionable since the safety sticker was broken.\nNot too sure about this...\n7pcs Pearl Hair Clips Large Hair Clips Pins Barrette Ties Hair Headwear Barrette for Party Wedding Daily, Gift for Girls and Women\nMEETWIN\n{'Package Dimensions': '7.5 x 3.5 x 0.2 inches; 1.76 Ounces', 'UPC': '723668014119'}\nThese pearl clips and hair pins look more realistic than I was expecting for the price. They are larger than they appear in the photos. They're not high end designer, but they aren't dollar store quality either. A few of mine came with some scratches on the pearls, but since I received this as a sample, I did not reduce my rating. I did, however, deduct a star because on the larger barette clips the pearls are not thoroughly attached. {see photo} On the skinny hair pins, the pearls are wrapped all the way down the length of the hair pin. The larger barettes are only attached on the ends. With that, I have some reservations on how long these will actually last. I suppose with careful handling, and maybe occasional use they should be okay. All in all, they are pretty and I think they are worth the price.\nLarger and prettier than I expected. Nice for the price! 😄\nPine Gel Nail Polish Set 6 Colors Purple Blue Cat Eye Glitter Gel Polish 7.5 ml Soak Off UV LED Cure Home Salon Manicure\npine\n{'Brand': 'Pine', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '9.524 Ounce', 'Number of Items': '6', 'Liquid Volume': '0.25 Fluid Ounces', 'Item Dimensions LxWxH': '4.84 x 2.87 x 3.58 inches', 'Product Dimensions': '4.84 x 2.87 x 3.58 inches; 9.77 Ounces', 'UPC': '738628890955'}\nThis set of gel polishes from Pine Gel really blew me away! These cover in one easy coat and have a nice glossy finish. The glitter polish was a little bit thick, but it's packed with glitter so I guess that's to be expected. This set of six shades contains (1) Glitter, (3) Crèmes, (2) Magnetics, and a cats eye magnet wand needed to work the magnetic polishes. All of the colors cure for 60 secs in an LED lamp or 90 secs in a UV.<br /><br />The crèmes are all buttery smooth in application, and self level beautifully. Each dry down to a nice glossy finish. The magnetics are easy to manipulate with the enclosed magnet stick. I was able to do a double cat eye line on my first try! (These are gonna be a lot of fun to play with using different shaped magnets for different effects.) Both magnetic polishes covered completely in one easy coat. The glitter shade is jam-packed with small royal blue glitters and is accented with a sprinkling of medium sized blue hexagons. The depth and sparkle to this polish is incredible. The glitter load makes this shade a little bit thick - but it's still workable. None of these gel polishes have a bad odor. None of them gave me any issues during application or the curing process. I cannot speak to the wear time, as I always use a peel-off base coat or full coverage tips, with gel polish products.<br /><br />Because these are so rich in pigment, (and a lot of them are dark colors), it is best to work in thin coats. They do cure with a sticky layer. All of these (except the glitter) cured for 60 sec in my LED lamp. With the thickness and opacity of the glitter polish, I did a double cure on that one to be safe. All swatches in this review are ONE coat and are shown WITHOUT top coat.<br /><br />I think the coverage, formula, and finishes of these polishes is amazing and absolutely worth the price. I highly recommend these! Thanks for reading. :) If my review and photos were helpful to you in any way, please click the button below to let me know. Thanks!\nOne coat coverage, buttery smooth formulas & special FX finishes! 😍 Amazing set of polishes!\nROSEGIN 23 Pcs Gel Nail Polish Set with Glossy and Matte Top and Base Coat Soak Off Gel Polish Colors Pink Red Green Neon Long Lasting Nail Gel Polish\nROSEGIN\n{'Brand': 'ROSEGIN', 'Item Form': 'Gel', 'Color': 'Yellow,Orange,Green,Red,Pink', 'Finish Type': 'Glitter,Glossy', 'Special Feature': 'Long Lasting,Peel Off,Long-lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '23', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '11.77 x 10.12 x 1.14 inches; 1.78 Pounds'}\nIf you're looking to build your gel polish collection on a budget, this set of 20 colors from Rosegin has you covered. There's a little bit of everything in this kit - crèmes, full coverage microglitters, jellies, and crelly finishes. They also include a base, as well as glossy and matte no-wipe topcoats (both of which are phenomenal!) The glossy top is super shiny and the matte top looks like velvet.<br /><br />Rosegin curated a lovely rainbow assortment of mini gel colors in this set. You get pastels and primary colors, but no black or white polish is included. The bottles are 5ml; though they look tiny, they're filled to the top and contain enough product for several mani's. I swatched 12 out of the 20 shades in this kit and the formulas are amazing! Smooth and buttery. Beautifully pigmented - 2 coats to full coverage. The glitters aren't thick or clumpy, and don't leave bald spots during application. The brushes fan out nicely on the nail and make the polishes easy to control. There is no offensive odor to any of these and they cured within 60 secs in my LED lamp. I cannot speak to the wear time with these as I always wear a peel-off base or full cover tips with gel polish products.<br /><br />I've shown both the glossy and matte top coats with my swatches. All colors are shown at 2 easy coats. These are fabulous for the price and I wholeheartedly recommend them. I will definitely be checking out other Rosegin products! The colors are gorgeous and the quality is outstanding! Everything in this set comes beautifully boxed - perfect for gifting!\nA beautiful assortment of rainbow colors in a variety of finishes! 🌈 Stellar formula!\nAvajar Blue LED Hydrating Cream Mask 5 Pack - Hydrating Face Masks for Women | Moisturizing Face Mask for Girls | Collagen Face Sheet Masks Set | Korean Face Mask Sheets Pack | Sheet Mask For Face\na DAILY SELF-CARE COSMETICS avajar\n{'Brand': 'a DAILY SELF-CARE COSMETICS avajar', 'Item Form': 'Cream, Sheet', 'Product Benefits': 'Hydrating,Moisture', 'Scent': 'Hydrating', 'Skin Type': 'Sensitive', 'Product Dimensions': '5.67 x 0.98 x 7.28 inches; 6.38 Ounces'}\nTHIS IS A LENGTHY REVIEW, BUT I THINK IT'S WORTH THE READ:<br /><br />Avajar is a k-beauty skincare manufacturer out of Seoul, Korea, closely affiliated with the K-pop group, Super Junior, who is the face of the brand. Avajar, as a company, has been making face products since 2019, with a focus on offering quality ingredients at a fair price. In this particular product they have created (a series of) sheet masks that contain the same cream as their LED Ring Light Cream Moisturizer. The original LED Ring Light Cream Moisturizer is pictured here on the sheet mask packaging. That moisturizer actually comes with a mini LED light on top of the jar, which was designed to be used as the product applicator. The LED cream in a jar was a top seller for Avajar, and so they expanded on the delivery system to include sheet masks. With all that being said, these masks do not come with an LED light (but if you already have one of your own, you could certainly use it with this product). I just wanted to pass this info along to clear up the confusion surrounding the marketing terms used on these masks.<br /><br />For context: My skin is dry and dehydrated, very sensitive and product reactive. I have not experienced any issues from using these masks, outside of some temporary erythemia (a.k.a. skin flushing, which I experience regularly). These masks are formulated without any artificial colors, fragrance, silicons, and parabens. This is not to say these masks are fragrance free, because they absolutely have a scent. The smell is rather herbal to me, which I believe is attributed to fruit and flower essences used in the cream. All Avajar products are made in a cGMP (current Good Manufacturing Practices) certified lab. However, I do not see any claims of cruelty-free status, neither on the package nor on their website.<br /><br />I do self care Sundays every week and will wear a sheet mask for 30 minutes while I relax in bed. Putting this mask on is pretty messy. You'll want to apply it over your bathroom sink because the cream is on the watery side and will drip everywhere. There is a generous amount of the cream essence inside the package and on the mask. The sheet mask material is super thin and hugs the contours of my face well. It's a nice size and sticks well, so you can actually wear one and move about, without having it lift or slide all over. After 30 minutes I peel the mask off and massage the remaining product into my skin. There isn't any stickiness and the cream absorbs nicely. My skin feels baby soft, supple, and deeply moisturized each time I use one. These masks come in a box of 5 and there's 3 formulas to choose from - Hydrating {blue} (which is the one I got), Whitening {yellow}, and Nourishing {red}. I have really enjoyed using these in my weekly sheet masks rotation. The price is extremely reasonable for such great quality. I love the results I've gotten and I recommend them entirely! I just purchased the Nourishing set and will definitely repurchase these hydrating masks when I run out.<br /><br />PRO'S:<br />+ Adds moisture to dry, dehydrated skin<br />+ Soothes and calms skin irritation<br />+ Skin feels soft, supple & deeply nourished after use<br />+ No artificial color, fragrance, silicon, parabens<br />+ Mask material hugs facial contours<br />+ Masks don't slip & slide off the face<br />+ Fast absorption - refreshes in 20-30 minutes<br />+ Comes in a pack of 5 at a cost of $1.55 a piece<br />+ Perfect for a relaxing self care session<br />+ Conveniently shipped on PRIME<br /><br />CONS:<br />- None\nThe LED aspect explained & my experience with these masks 🎭 (spoiler alert: I LOVE them!)\nMagnesium Salt Bath Flakes | 8 lb Bulk Size | Body and Foot Soak | By Horbaach\nHorbäach\n{'Brand': 'Horbäach', 'Product Benefits': 'Relaxing', 'Unit Count': '128.0 Ounce', 'Item Weight': '8 Pounds', 'Variety': 'Bath Soak', 'Product Dimensions': '10 x 3 x 15 inches; 8 Pounds', 'UPC': '840050601426', 'Manufacturer': 'Horbaach'}\nFirst off, this bag of Magnesium flakes from Horbäach is huge! I've pictured it next to a full sized bag of Dr. Teal's Magnesium salts, for reference. You definitely get a lot of bang for your buck here. This bag of Magnesium flakes is fragrance free, so you have more options as well. You can scent the portions individually, (if you so choose), by adding a few drops of your favorite essential oils, or you can simply use it as-is. The flakes dissolve quicker than any of the commercially prepared salts I've ever used, which make these perfect for soaking. Skin is baby soft after a 20 minute bath, and muscle fatigue is greatly reduced. Magnesium Chloride soaks have helped my husband's charlie horses become far less frequent. Unfortunately he can't absorb Magnesium from his diet, so we have to supplement. Without this and high quality vitamins, he would suffer.<br /><br />There are some things I didn't realize when I ordered this product, but I found to be very interesting after researching the difference between Magnesium Chloride vs. Magnesium Sulfate:<br /><br />Both compounds contain a similar level of elemental Magnesium, but the key difference between Magnesium Chloride (flakes) and Magnesium Sulphate (salts) is the purity of Magnesium Chloride and the rate of its absorption within the body. It is reported that Magnesium Chloride is more easily absorbed and utilised by the body, compared to Epsom Salts.<br /><br />This seems like a much better choice for our needs. I'm so glad to have discovered that something better like this exists, to help his condition.\nThese flakes dissolve faster than any salt I've ever used 🦆💦\nPlant Therapy Natural Acetone Free Nail Polish Remover 6 fl oz One Touch Dispensing Bottle with Flip Top Cap Tropical Flower Scent\nPlant Therapy\n{'Brand': 'Plant Therapy', 'Item Form': 'Liquid', 'Item Weight': '6.24 Ounces', 'Number of Items': '1', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '5.1 x 2.2 x 2.2 inches; 6.24 Ounces', 'UPC': '680912056168'}\nThis non-acetone polish remover from Plant Therapy smells so good! To me, it smells a lot like fruit punch (Hawaiian Punch, to be exact). You can smell it from the outside of the bottle as soon as it arrives. But don't smell it straight from the bottle, or on your cotton round... the solvents themselves have a very strong odor! After you use the product though, the only thing lingering is the fruit punch scent on your fingertips. There is a little bit of an oily residue left behind, but it beats the ashy dryness of straight acetone.<br /><br />The leak-proof pump bottle works amazing! If you knock the bottle over, it does not spill. I love that! The cap on the bottle flips up to reveal the pump dispenser, which you press down to pull your liquid to the top. I did not have any issues during shipment, so I think this bottle will be fabulous for travel. This acetone-free formula removes traditional crème & shimmer polishes with little effort. The solvent base contains Ethyl Acetate & Isopropyl Mistrate. I wouldn't use this as my first defense against removing glitter lacquers, and I wouldn't use it to soak off gel polish at all. (Pure acetone is best for both of those options).<br /><br />Plant Therapy products are proudly made in the USA! 🇺🇸\nSmells like Hawaiian Punch 😋 Great formula and I love the no-spill pump bottle!\nCELIMAX The Real Sedum Aqua Boosting Essence - with 65.33% Sedum Extract, Hyaluronic Acid Complex, 150ml\nCELIMAX\n{'Brand': 'CELIMAX', 'Item Form': 'Liquid', 'Active Ingredients': 'Hyaluronic acid', 'Unit Count': '5.07 Fl Oz', 'Number of Items': '1', 'Package Dimensions': '9 x 3 x 2.25 inches; 9.59 Ounces'}\nThe sedum extract in this essence was quite intriguing to me.  As someone with chronically dry, sometimes dehydrated skin I thought this toner could help me.  \"Sedum is a succulent leaf known for its intense hydration, vitamins & mineral level.  It holds more hydration than watermelon and is rich in phytoestrogen that further boosts hydration and improves the skin condition.\"  When I read that, I thought this sounded like the recipe for perfect skin, but every time I use this essence my face turns super oily.  I have never experienced this kind of change from any of the hydrating essences I own.<br /><br />The scent on this is light, clean, and fresh, very herbal.  You should be aware that this product is fragranced with natural fruit oils & extracts.  A few minutes after application though, the scent dissipates quickly.  My skin is crazy reactive & very sensitive, but I did not experience any adverse reactions to the ingredients used in this essence.<br /><br />There was also a generous amount of samples from Celimax included with this toner.  😀  They sent 2 Noni ampoules, 3 serum packettes, and 2 AHA/BHA exfoliating/brightening pads (labeled for underarms, but can be used elsewhere).  Korean brands are so very gracious with samples!  Thank you, Celimax! ❤<br /><br />Both the package & bottle both come safety sealed.  The bottle is of nice size (150ml) and features a shaker style spout for easy dispensing.  I pour a small amount of the essence into my hands, then pat into the skin after cleansing. Then I apply my serums & moisturizer.<br /><br />Though I don't find this product to be a particularly good fit for my skin right now (during the hot & humid Florida summer heat, when my oil production is already at it's peak), I think this essence may work better for me in the winter.  I do think it's a nice product, so it still gets a 4 star rating from me.\nMy skin went from dry/dehydrated to oily after using this toner 😔\nPeripera Ink Mood Matte Lipstick, Lightweight, Matte, Smooth, Hydrating, Lasting Color Payoff (02 Pink Go Up)\nPeripera\n{'Brand': 'Peripera', 'Color': '02 PINK GO UP', 'Skin Type': 'Dry', 'Item Form': 'Crayon', 'Finish Type': 'Matte', 'Package Dimensions': '3.46 x 0.94 x 0.87 inches; 1.06 Ounces', 'Manufacturer': 'CLIO'}\nPeriPera is kinda known for having amazing lip tints & stains. When I saw that they were offering lipstick bullets now, I thought these would have that same effect. I was mistaken. This is a soft textured matte lip cream developed to attain the look of blurred lips, a popular Korean beauty trend. What exactly does \"blurred lips\" translate to in the West? It means skip the harsh lip liner & soften the edges of your lip borders. The goal is to achieve a gradual gradient of color.<br /><br />I got shade n°8 \"City Pop Chili\", which I would describe as a burnt brick red color. It feels very Autumnal and will be best complemented by those with warm skintones.<br /><br />The texture of the lip cream itself is soft & smooth, sorta like a mousse. It's very lightweight, easy to blend, and feels comfortable on the lips. It has a matte finish, with just the right amount of moisturizing properties to keep it from completely drying out my lips.<br /><br />I found that it's best to apply this product straight from the tube. I tried to build up opacity by using a lip brush to apply it, but every time I'd swipe the brush across my lips, it would actually remove product and leave bald spots. The formula isn't as long wearing as I was expecting from a matte lipstick, either. After a couple hours of eating, drinking, and expressive mouth movements, the color wears off entirely and I have to reapply. I really wish this wore down to a stain, but that's not what PeriPera was going for.<br /><br />The frosted, translucent pink lipstick component used for this line of lippies is understated, but pretty. It looks very feminine. The actual lipstick bullet has a slim silhouette and an angled tip. You get exactly one inch of visible product inside the tube. This formula is free of fragrance. There is no scent at all that I can detect.<br /><br />Expiration date printed on my product packaging is Aug. 2024<br />(2 years & 10 months from when I purchased it in Oct. 2021)<br /><br />Full Ingredients:<br />Dimethicone, Dibutyl Adipate, Microcrystalline Wax, Polyethylene, Dimethicone Crosspolymer, Ethylhexyl Palmitate, Hydrogenated Poly(C6-14 Olefin), Polyglyceryl-2 Triisostearate, Ceresin, Iron Oxide Red, Pentaerythrityl Tetraethylhexanoate, Diisostearyl Malate, Bis-Behenyl/Isostearyl/Phytosteryl Dimer Dilinoleyl Dimer Dilinoleate, Polyglyceryl-3 Diisostearate, Titanium Dioxide (CI 77891), Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Plukenetia Volubilis Seed Oil, Agave Tequilana Leaf Extract, Diglyceryl Sebacate/Isopalmitate, Caprylic/Capric Triglyceride, Silica, Polyglyceryl-2 Diisostearate, Stearalkonium Hectorite, Propylene Carbonate, Triethoxycaprylylsilane, Butylene Glycol, Water, BHT, Fragrance, Lithol Rubine BCA, Sunset Yellow FCF, Brilliant Blue FCF, Tartrazine\nSoft & smooth, lightweight matte lip cream that doesn't dry out the lips 💋\nBeard Comb Or Fine Tooth Mustache Pocket Stainless Steel Metal Powder Coated Black Keychain Comb For Men - 3.25 x 1 Inches by Death Grip\nTHE VINTAGE GROOMING CO.\n{'Material': 'Metal', 'Brand': 'Death Grip', 'Hair Type': 'All', 'Color': 'Black', 'Size': 'Small', 'Product Dimensions': '3 x 1 x 0.1 inches; 2.4 Ounces', 'Department': 'mens', 'UPC': '710702883497', 'Manufacturer': 'The Vintage Grooming Co'}\nThough this grooming comb is small in size, the stainless steel composite is mighty in strength. The 3\" length fits quite comfortably in your hand too, which makes it perfect for combing & styling facial hair. A couple of the teeth on the piece I received are bent, but it's minor and not bad enough to warrant a rating reduction. The graphic logo on the comb's end features a skull with a fantastic handlebar mustache and the brand name 'Death Grip' proudly displayed. There is a hole cut out of the top that can be utilized with a small section of ball chain, if you wanted to make a keychain out of it. I wish the manufacturer would've included the ball chain; it would've been a nice gesture since this piece is obviously designed to be used like that.<br /><br />Photos included for perspective - including one of this itty bitty comb next to a full sized rat tail comb.\nA major upgrade from the plastic rat tail comb, because men deserve nice things! 🤗",
  "actual_interaction": {
    "rating": 5.0,
    "title": "A major upgrade from the plastic rat tail comb, because men deserve nice things! 🤗",
    "text": "Though this grooming comb is small in size, the stainless steel composite is mighty in strength. The 3\" length fits quite comfortably in your hand too, which makes it perfect for combing & styling facial hair. A couple of the teeth on the piece I received are bent, but it's minor and not bad enough to warrant a rating reduction. The graphic logo on the comb's end features a skull with a fantastic handlebar mustache and the brand name 'Death Grip' proudly displayed. There is a hole cut out of the top that can be utilized with a small section of ball chain, if you wanted to make a keychain out of it. I wish the manufacturer would've included the ball chain; it would've been a nice gesture since this piece is obviously designed to be used like that.<br /><br />Photos included for perspective - including one of this itty bitty comb next to a full sized rat tail comb.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/617DseNv8bL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/617DseNv8bL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/617DseNv8bL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61nFJ4rH24L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61nFJ4rH24L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61nFJ4rH24L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61wCraK+O3L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61wCraK+O3L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61wCraK+O3L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61wcKudLQ+L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61wcKudLQ+L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61wcKudLQ+L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71Oz48qfJlL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71Oz48qfJlL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71Oz48qfJlL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09TFZZ4GW",
    "parent_asin": "B09TFZZ4GW",
    "user_id": "AGPGFFJDCKXPNBWCC5YP2ZUDPNGA",
    "timestamp": "2022-07-05 21:19:25.374000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Beard Comb Or Fine Tooth Mustache Pocket Stainless Steel Metal Powder Coated Black Keychain Comb For Men - 3.25 x 1 Inches by Death Grip",
    "average_rating": 4.5,
    "rating_number": 176,
    "features": [
      "Mustache & Beard Pocket Men's Custom Comb - Perfect For Styling Handlebar Moustaches, Men's Beards, Specialty Mustaches, & For You Old Timer’s Ear Hair",
      "Mens Keychain Pocket Comb - Easily Accessible To Fix Up & Groom Your Mustache, Beard, Goatee, Handlebar Moustache Or Sideburns",
      "Death Grip Pocket Key Chain Comb - Durable Metal, Heat Resistant & Cleans Easy 3.25 x 1 Inches by Death Grip",
      "Men's Facial Hair Grooming Comb - For Mustaches, Moustaches, Beards, Hair Styling & Is Not A Brush",
      "Death Grip Promise - We Stand Behind Our Products, Contact Us For Any Reason If You Are Not Satisfied And We Will Refund Your Money"
    ],
    "description": [],
    "price": 9.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/3165Rebpq1L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/3165Rebpq1L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/713+N4JPh-L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31Y7mDFtyFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31Y7mDFtyFL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71WVbzdLY8L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41ezP7iyz+L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41ezP7iyz+L.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/715vOuIEixL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41wd7Bdt1FL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41wd7Bdt1FL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71E6nivVoML._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/416Dc8plKcL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/416Dc8plKcL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71MqTYlaykL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41MEvkHwqcL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41MEvkHwqcL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81CirgsFJQL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31J8mzMGoxL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31J8mzMGoxL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/61yJAvKZLQL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/410kGhg4suL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/410kGhg4suL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/81vX3eI1IeL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/311wvWveGhL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/311wvWveGhL.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/71pcnLVjpdL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "THE VINTAGE GROOMING CO.",
    "categories": [],
    "details": {
      "Material": "Metal",
      "Brand": "Death Grip",
      "Hair Type": "All",
      "Color": "Black",
      "Size": "Small",
      "Product Dimensions": "3 x 1 x 0.1 inches; 2.4 Ounces",
      "Department": "mens",
      "UPC": "710702883497",
      "Manufacturer": "The Vintage Grooming Co"
    },
    "bought_together": null
  }
}