{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MEICOLY Fake Blood Washable,1.06oz Edible Stage Blood,Realistic Drips Sticky Fake Blood with Brush,Safe for Mouth,Teeth,Nosebleed,Halloween,Cosplay,SFX Makeup,Special Effects Cut Flesh Wound,Bright\nReview Date: 2022/08/29\nStore: MEICOLY\nAverage Rating: 4.3\nProduct Details: {'Color': '1.06 oz stage blood,bright', 'Brand': 'MEICOLY', 'Item Weight': '1.06 Ounces', 'Item Form': 'Liquid', 'Package Information': 'Bottle', 'Product Dimensions': '5.12 x 3.15 x 1.18 inches; 1.06 Ounces', 'Manufacturer': 'MEICOLY', 'Country of Origin': 'China'}\nReview Text: Great add on to any Halloween costume or one that you want to make more realistic. Can be used on face/body or as a prop on an object! Special FX must have, and it’s a decent size bottle! Can’t wait to have my looks come to life.\nReview Title: Super\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "FILMIA Pink Wig Long Pink Wig Pastel Pink Curly Body Wave Wig for Halloween Csotume, Cosplay Parties or Daily Use --23.6inch\nFILMIA\n{'Hair Type': 'Wavy', 'Style': 'Curly', 'Special Feature': 'Tangle Free', 'Brand': 'FILMIA', 'Age Range (Description)': 'Adult'}\nWhat a fun wig! It’s very bouncy and not too heavy. Also a plus that the wig is ready to wear and you don’t need to trim any of the front pieces.\nGreat Quality\n4240Pcs Flatback White Opal Rhinestones Glass Crystal Gemstones for Nail Art Face Makeup Glitter Round with Tweezers and Picking Pen (SS6~SS20 Set)\nMEIBITE\n{'Brand': 'MEIBITE', 'Shape': 'Round', 'Number of Pieces': '1', 'Item Form': 'Pen', 'Recommended Uses For Product': 'Crafts, Nail Arts, Arts', 'Package Dimensions': '7.2 x 4.33 x 0.59 inches; 2.4 Ounces', 'UPC': '749666774886'}\nHad to knock some stars off because of the poor packaging. Yes, you get tons of rhinestones… so much that I guess it popped off the lid. Thankfully it was enclosed in another packaging. I spent about an hour with tweezers putting the sizes back in the correct spots.\nLots of rhinestones but…\nL’ANGE HAIR Pocket Size Comb | Blush Acetate | Compact Design for Travel | Easy Glide Mini Wide Tooth Comb\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Hair Type': 'Wavy, Dry', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Product Dimensions': '5 x 3.63 x 0.25 inches; 1.45 Ounces', 'Item model number': '2438', 'UPC': '810108191001'}\nEverything about this pocket size comb is great. I love the pearl pink color and the comb itself is nice and thick. Almost feels like it detangles my hair as I use it. The packaging was neat and the white pouch it comes in is bright white & soft. This will fit in any purse I choose to wear - big or small.\nLove this Comb!\nProfessional Electric Nail Drill, Rechargeable 35000 RPM E-File Nail Drill Kit for Gel, Acrylic Nails, Manicure Pedicure Polishing Tools with 16 Pcs Bits, Great for Home or Salon (Black)\nPLIISLUP\n{'Brand': 'PLIISLUP', 'Color': 'Black', 'Material': 'Aluminum, Metal', 'Item Dimensions LxWxH': '6.8 x 2.7 x 0.9 inches', 'Power Source': 'Battery Powered', 'Product Dimensions': '6.8 x 2.7 x 0.9 inches; 1.32 Pounds', 'Batteries': '1 Lithium Ion batteries required. (included)', 'Manufacturer': 'PLIISLUP'}\nI have recently decided to get into doing acrylics and was looking for a nail drill- I’m picky about getting items unless it’s quality AND aesthetically appealing..well, this one was both! Love the different pinks and the nail bits have been easy to figure out (comes with instructions) so far. The drill came nicely packaged and is quieter than any other drill I have heard.\nGreat Nail Drill\nMilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nMilyBest\n{'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nYou get so many lashes for the price..these are fluffy and I like that there are different variations. I usually wear lashes with a clear band, so I will be using these for costumes and dramatic looks. The fit would be best on larger eyes, I have small eyes so I will be trimming these.\nFluffy and Fun!\nL’ANGE HAIR Wide Tooth Comb Tortoiseshell Acetate | Lightweight, Smooth, Compact Design | Easy Glide Wide Tooth Comb\nL'ANGE HAIR\n{'Product Dimensions': '0.25 x 7 x 3.13 inches; 1.76 Ounces', 'Item model number': '2427', 'UPC': '810108190974'}\nL’ange is a company you can tell puts effort into the presentation of how they package all of their items. I like this comb and it’s convenient to travel with, however I do believe the price point is a little too much for this item.\nGreat Travel Comb\nMEICOLY Fake Blood Washable,1.06oz Edible Stage Blood,Realistic Drips Sticky Fake Blood with Brush,Safe for Mouth,Teeth,Nosebleed,Halloween,Cosplay,SFX Makeup,Special Effects Cut Flesh Wound,Bright\nMEICOLY\n{'Color': '1.06 oz stage blood,bright', 'Brand': 'MEICOLY', 'Item Weight': '1.06 Ounces', 'Item Form': 'Liquid', 'Package Information': 'Bottle', 'Product Dimensions': '5.12 x 3.15 x 1.18 inches; 1.06 Ounces', 'Manufacturer': 'MEICOLY', 'Country of Origin': 'China'}\nGreat add on to any Halloween costume or one that you want to make more realistic. Can be used on face/body or as a prop on an object! Special FX must have, and it’s a decent size bottle! Can’t wait to have my looks come to life.\nSuper",
  "profile": "**User Summary:**\n\n- **Product Preferences:** The user continues to favor vibrant and playful accessories that enhance her cosmetic looks, now adding special effects cosmetics to her repertoire. Her recent purchase demonstrates an interest in fun, thematic items that combine aesthetic appeal with practical use for creative expression.\n\n- **Style Trends:** Embracing dramatic beauty looks, she actively seeks products that allow for personalization, particularly in costume makeup and expressive aesthetics. The focus on versatility is evident in her choice of products that cater to various activities, including Halloween and cosplay.\n\n- **Quality Appreciation:** Committed to high-quality, user-friendly products, she values brands that prioritize product presentation and packaging. Her recent experience highlights her critical appreciation for practicality, creativity, and perceived value, maintaining her preference for cruelty-free and visually appealing items.\n\n- **Use Cases:** Engaging in adaptive activities, she prioritizes versatile items that simplify beauty routines while allowing for distinctive style choices, particularly for themed events and performances.\n\n- **Overall Experience:** With a discerning eye for detail, she continues to gravitate towards lightweight, aesthetically pleasing products. Her enthusiastic feedback and critical analysis of value reflect a balance between playfulness and practicality, as she explores items that bring her creative visions to life.",
  "metrics": {
    "rouge1_f": 0.15737051792828685,
    "rouge2_f": 0.011976047904191617,
    "rougeL_f": 0.07569721115537847,
    "meteor": 0.05863177691385909,
    "bleu1": 0.013925938051840467,
    "bleu2": 0.0036229727789530365,
    "bleu3": 0.001274492051588822,
    "bleu4": 0.0004255068830612928,
    "bertscore_precision": 0.3523937463760376,
    "bertscore_recall": 0.46641385555267334,
    "bertscore_f1": 0.4014650881290436
  }
}