{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nReview Date: 2022/08/12\nStore: MilyBest\nAverage Rating: 4.1\nProduct Details: {'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nReview Text: You get so many lashes for the price..these are fluffy and I like that there are different variations. I usually wear lashes with a clear band, so I will be using these for costumes and dramatic looks. The fit would be best on larger eyes, I have small eyes so I will be trimming these.\nReview Title: Fluffy and Fun!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "FILMIA Pink Wig Long Pink Wig Pastel Pink Curly Body Wave Wig for Halloween Csotume, Cosplay Parties or Daily Use --23.6inch\nFILMIA\n{'Hair Type': 'Wavy', 'Style': 'Curly', 'Special Feature': 'Tangle Free', 'Brand': 'FILMIA', 'Age Range (Description)': 'Adult'}\nWhat a fun wig! It’s very bouncy and not too heavy. Also a plus that the wig is ready to wear and you don’t need to trim any of the front pieces.\nGreat Quality\n4240Pcs Flatback White Opal Rhinestones Glass Crystal Gemstones for Nail Art Face Makeup Glitter Round with Tweezers and Picking Pen (SS6~SS20 Set)\nMEIBITE\n{'Brand': 'MEIBITE', 'Shape': 'Round', 'Number of Pieces': '1', 'Item Form': 'Pen', 'Recommended Uses For Product': 'Crafts, Nail Arts, Arts', 'Package Dimensions': '7.2 x 4.33 x 0.59 inches; 2.4 Ounces', 'UPC': '749666774886'}\nHad to knock some stars off because of the poor packaging. Yes, you get tons of rhinestones… so much that I guess it popped off the lid. Thankfully it was enclosed in another packaging. I spent about an hour with tweezers putting the sizes back in the correct spots.\nLots of rhinestones but…\nL’ANGE HAIR Pocket Size Comb | Blush Acetate | Compact Design for Travel | Easy Glide Mini Wide Tooth Comb\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Hair Type': 'Wavy, Dry', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Product Dimensions': '5 x 3.63 x 0.25 inches; 1.45 Ounces', 'Item model number': '2438', 'UPC': '810108191001'}\nEverything about this pocket size comb is great. I love the pearl pink color and the comb itself is nice and thick. Almost feels like it detangles my hair as I use it. The packaging was neat and the white pouch it comes in is bright white & soft. This will fit in any purse I choose to wear - big or small.\nLove this Comb!\nProfessional Electric Nail Drill, Rechargeable 35000 RPM E-File Nail Drill Kit for Gel, Acrylic Nails, Manicure Pedicure Polishing Tools with 16 Pcs Bits, Great for Home or Salon (Black)\nPLIISLUP\n{'Brand': 'PLIISLUP', 'Color': 'Black', 'Material': 'Aluminum, Metal', 'Item Dimensions LxWxH': '6.8 x 2.7 x 0.9 inches', 'Power Source': 'Battery Powered', 'Product Dimensions': '6.8 x 2.7 x 0.9 inches; 1.32 Pounds', 'Batteries': '1 Lithium Ion batteries required. (included)', 'Manufacturer': 'PLIISLUP'}\nI have recently decided to get into doing acrylics and was looking for a nail drill- I’m picky about getting items unless it’s quality AND aesthetically appealing..well, this one was both! Love the different pinks and the nail bits have been easy to figure out (comes with instructions) so far. The drill came nicely packaged and is quieter than any other drill I have heard.\nGreat Nail Drill\nMilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nMilyBest\n{'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nYou get so many lashes for the price..these are fluffy and I like that there are different variations. I usually wear lashes with a clear band, so I will be using these for costumes and dramatic looks. The fit would be best on larger eyes, I have small eyes so I will be trimming these.\nFluffy and Fun!",
  "profile": "**User Summary:**\n\n- **Product Preferences:** The user continues to enjoy vibrant and playful accessories, actively exploring diverse items like false eyelashes that enhance her cosmetic looks. Her recent purchase reflects a keen interest in versatile tools that provide both fun aesthetics and functional use, aligning with her appreciation for quality and creativity in accessories.\n\n- **Style Trends:** She embraces creative expression through dramatic beauty looks, such as long lashes suitable for costumes and expressive make-up. This focus on variety indicates her ongoing engagement with playful aesthetics, complementing her previous interests in colorful hair options and accessories.\n\n- **Quality Appreciation:** A commitment to high-quality, user-friendly products remains essential, as demonstrated by her selection of cruelty-free and visually appealing beauty items. Her standards also extend to the practicality of products, especially how they enhance her creative expression.\n\n- **Use Cases:** The user engages in various activities, including costume makeup and dramatic looks for events. She appreciates versatile items that allow for personalization and adaptation to her distinct style, valuing tools that simplify her beauty routines.\n\n- **Overall Experience:** With a discerning eye for detail, she consistently favors lightweight, aesthetically pleasing products while being critical of any inconsistencies. Her enthusiastic feedback often rewards high-quality items, underscoring her playful yet selective approach to beauty and accessory choices.",
  "metrics": {
    "rouge1_f": 0.20049504950495048,
    "rouge2_f": 0.022332506203473945,
    "rougeL_f": 0.07920792079207921,
    "meteor": 0.08235031546256444,
    "bleu1": 0.04390365017870297,
    "bleu2": 0.011686588847364758,
    "bleu3": 0.005219061946560155,
    "bleu4": 0.0016508245176260275,
    "bertscore_precision": 0.3544990122318268,
    "bertscore_recall": 0.4386039972305298,
    "bertscore_f1": 0.3920920193195343
  }
}