{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Iles Formula 3 Step System - Shampoo, Conditioner, Finishing Serum Set\nReview Date: 2019/12/25\nStore: ILES FORMULA PARIS NEW YORK\nAverage Rating: 4.4\nProduct Details: {'Item Form': 'Liquid', 'Brand': 'ILES FORMULA PARIS NEW YORK', 'Number of Items': '3', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 6.3 x 1.46 inches; 1.68 Pounds', 'UPC': '813614020162'}\nReview Text: One of my favorite shampoos I have found in recent years -- nourishes your hair to have THE BEST hair days\nReview Title: Simply the best\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Benefit Cosmetics Hoola Lite Bronzer (Natural Light Bronze) 0.28 oz\nBenefit Cosmetics\n{'Item Form': 'Powder', 'Finish Type': 'Matte', 'Coverage': 'Light', 'Brand': 'Benefit Cosmetics', 'Color': 'Hoola Lite', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 2.6 x 1.42 inches; 1.76 Ounces', 'Item model number': 'FM46'}\nif you are very fair (like I am) its the perfect bronzer - not orange not \"fake tan\" looking but the perfect healthy glow!! I have bought 3 more bc I fear of running out!! LOVE THiS!!\nperfect bronzer\nCHARLOTTE TILBURY Magic Vanish! Color Corrector Tan\nCHARLOTTE TILBURY\n['A color-corrector that helps neutralize and smooth the undereye and face to help conceal pigmentation and brighten skin.']\n{'Item Form': 'Cream', 'Color': 'deep', 'Package Information': 'Tube', 'Brand': 'CHARLOTTE TILBURY', 'Coverage': 'Light', 'Package Dimensions': '5.24 x 2.4 x 1.46 inches; 1.2 Ounces'}\nCT is all things LUXURY!  LA Girl Pro conceal was my favorite forever and at night I still reach for it<br /><br />Yet this product has a finer finish and is perfect for layering and day wear\nCT Rocks\nIles Formula 3 Step System - Shampoo, Conditioner, Finishing Serum Set\nILES FORMULA PARIS NEW YORK\n{'Item Form': 'Liquid', 'Brand': 'ILES FORMULA PARIS NEW YORK', 'Number of Items': '3', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 6.3 x 1.46 inches; 1.68 Pounds', 'UPC': '813614020162'}\nOne of my favorite shampoos I have found in recent years -- nourishes your hair to have THE BEST hair days\nSimply the best",
  "profile": "**User Profile Summary:**\n\n- **Skin Tone Preference:** The user identifies as very fair-skinned and seeks cosmetic products that enhance their complexion without appearing artificial or overly bronzed.\n- **Product Type:** Preference for powder formulations, particularly bronzers with light coverage and matte finishes. The user also embraces cream formulations for specific uses, such as color correction.\n- **Brand Loyalty:** While exhibiting a strong preference for Benefit Cosmetics, the user has expanded their brand interests to include luxury brands like Charlotte Tilbury and Iles Formula, showcasing a willingness to explore high-quality products.\n- **Desired Effects:** Values natural, healthy glow and skincare benefits, focusing on understated beauty looks while appreciating products that provide a refined finish.\n- **Purchase Behavior:** Demonstrates a tendency to stock up on preferred items but is also open to trying new products that align with their aesthetic goals, reflecting a strategic approach to beauty and hair care purchases.\n- **Review Style:** Communicates enthusiasm and satisfaction in reviews, frequently awarding high ratings to products that meet their specific needs. The user appreciates improvements in product performance, particularly for everyday wear, and has expressed strong satisfaction with hair care products, highlighting their effectiveness in enhancing hair health.\n\nOverall, the user prioritizes natural-looking makeup suitable for fair skin and shows an openness to experimenting with new luxury products that align with their preferences for quality and effectiveness in both beauty and hair care.",
  "metrics": {
    "rouge1_f": 0.2459016393442623,
    "rouge2_f": 0.0205761316872428,
    "rougeL_f": 0.09836065573770492,
    "meteor": 0.11606734224323093,
    "bleu1": 0.14611969983458512,
    "bleu2": 0.033879213293118916,
    "bleu3": 0.006706173807376934,
    "bleu4": 0.0029862569882928704,
    "bertscore_precision": 0.37302082777023315,
    "bertscore_recall": 0.41322043538093567,
    "bertscore_f1": 0.3920929431915283
  }
}