{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: ZO Skin Health Intense Eye Creme 8ml 0.3 Fl Oz (Travel Size)\nReview Date: 2021/09/29\nStore: ZO SKIN HEALTH\nAverage Rating: 4.4\nProduct Details: {'Brand': 'ZO SKIN HEALTH', 'Item Form': 'Cream', 'Number of Items': '1', 'Skin Type': 'Mature', 'Item Volume': '0.3 Fluid Ounces', 'Package Dimensions': '10.12 x 7.87 x 3.03 inches; 3.53 Ounces', 'UPC': '860001752878'}\nReview Text: On the paper, the ZO intense eye cream looks perfect, and it apparently has a host of fans who love it. It's not a great fit for me though. While it seems very well tolerated and doesn't sting, burn or make my eyes water, it doesn't do anything else. Its texture is a bit too thick, which isn't usually the issue with rich/thick eye creams (think Estee Lauder Re-Nutritiv, Sisleya, Shiseido Benefiance), but ZO intense eye cream does tend to ball up on me; to me, it seems like a thick layer that looks almost waxy under the eyes.<br /><br />In general, with cosmetics there are two kinds of results, one comes from a handful of ingredients that actually do something for skin and improve it (usually over weeks/months, like retinol or glycolic acid) and the other type is when a product just makes skin look nicer (with some pigments, polymers and all the other chemical witchery - the stuff that washes off at the end of a day) - this eye product manages neither for me. ZO Intense eye cream claims it helps with the appearance of dark circles and eye puffiness - and I say, nope, the thicker formula does even enhance the appearance of eye bags and every line and wrinkle.\nReview Title: its not a ride or die -\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Benefit Cosmetics Hoola Lite Bronzer (Natural Light Bronze) 0.28 oz\nBenefit Cosmetics\n{'Item Form': 'Powder', 'Finish Type': 'Matte', 'Coverage': 'Light', 'Brand': 'Benefit Cosmetics', 'Color': 'Hoola Lite', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 2.6 x 1.42 inches; 1.76 Ounces', 'Item model number': 'FM46'}\nif you are very fair (like I am) its the perfect bronzer - not orange not \"fake tan\" looking but the perfect healthy glow!! I have bought 3 more bc I fear of running out!! LOVE THiS!!\nperfect bronzer\nCHARLOTTE TILBURY Magic Vanish! Color Corrector Tan\nCHARLOTTE TILBURY\n['A color-corrector that helps neutralize and smooth the undereye and face to help conceal pigmentation and brighten skin.']\n{'Item Form': 'Cream', 'Color': 'deep', 'Package Information': 'Tube', 'Brand': 'CHARLOTTE TILBURY', 'Coverage': 'Light', 'Package Dimensions': '5.24 x 2.4 x 1.46 inches; 1.2 Ounces'}\nCT is all things LUXURY!  LA Girl Pro conceal was my favorite forever and at night I still reach for it<br /><br />Yet this product has a finer finish and is perfect for layering and day wear\nCT Rocks\nIles Formula 3 Step System - Shampoo, Conditioner, Finishing Serum Set\nILES FORMULA PARIS NEW YORK\n{'Item Form': 'Liquid', 'Brand': 'ILES FORMULA PARIS NEW YORK', 'Number of Items': '3', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 6.3 x 1.46 inches; 1.68 Pounds', 'UPC': '813614020162'}\nOne of my favorite shampoos I have found in recent years -- nourishes your hair to have THE BEST hair days\nSimply the best\nToo Faced Gingerbread Extra Spicy Eyeshadow Palette\nToo Faced\n['Includes 18 multi-finish warm and toasty shadows that glide on with buttery smoothness for playful pops of color that smell like fresh-baked gingerbread.']\n{'Brand': 'Too Faced', 'Item Form': 'Cream', 'Finish Type': 'Sheer', 'Special Feature': 'Travel size, Matte', 'Number of Items': '1', 'Package Dimensions': '7.75 x 4.02 x 0.94 inches; 8.32 Ounces', 'UPC': '651986907939'}\nThis is the most used palette in my makeup wardrobe. I usually use it for a professional everyday look for work. However , it is versatile enough that I can intensify it for evening or dressy occasions or tone it down for subtly enhancing a \"no makeup\" look. Because it is neutral and universally flattering on almost all skin tones (may not show up well if you have a deep toned complexion), I can wear it with any color in my wardrobe. I also like that it has a fantastic cool toned set of colors that do not end up showing up blue or purple on the skin. The undertones are very subtle, just like real skin! So hard to find - there seems to be a profusion of warm toned makeup out there, but very little cool or neutral toned makeup that produces a smooth, natural looking and flattering gradient of color on the skin. Nice job, Too Faced! I hope you regard this as your flagship palette and never discontinue this. Don't change the formula either!\nTOO FACED DEVOTEE\nCharlotte's Genius Magic Powder For Under Eye and Face 13 Grams/.45 Ounce Shade 1 Fair\nCHARLOTTE TILBURY\n{'Brand': 'CHARLOTTE TILBURY', 'Color': 'Beige', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'Fair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 3.11 x 3.31 inches; 3.52 Ounces'}\nThey call it BAKING, I call it MY BABY!! it's a crease-less must have. I have two one in my makeup kit and one in my personal makeup bag. This baby is amazing work so well for all over the face, but best of your under eyes... love it. I cannot live without this product!! No Flashback either!  Charlotte T can we be BESTIES??\nSTOP LOOKING FOR THE BEST POWDER - YOU JUST FOUND IT!\nTARTE shape tape setting powder\nTarte\n{'Brand': 'Tarte', 'Item Form': 'Powder', 'Finish Type': 'Radiant', 'Number of Items': '1', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.83 x 2.76 x 1.26 inches; 0.42 Ounces', 'UPC': '846733025183'}\nwe go everywhere together these days! she erases shine, doesn't make my super-fair complexion orange, and my skin look nearly flawless.  i thought the translucent pressed powder was lovely...but that pales in comparison now. hands down THE best powder i've ever purchased.  ...but if you're pasty & tasty with a shiny t-zone--buy some! get two!\nLOVE!!!\nUCANBE Aromas Nudes Eyeshadow Palette, Matte Shimmer Glitter Blending 18 Color Eye Shadow Pallet with Mirror, Natural Velvet Texture Powder Creamy Cosmetic\nUCANBE\n{'Color': 'Aromas', 'Brand': 'UCANBE', 'Item Form': 'Powder,Creamy', 'Finish Type': 'Shimmering,Glitter,Matte,Shimmer,Velvet,Natural', 'Special Feature': 'Travel size, Matte', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.11 x 5.31 x 1.14 inches; 3.53 Ounces', 'UPC': '737798450020'}\nThese shadows are so lush!  So smooth and pigmented, plus they last. I love all the shades and it is the perfect warm yellow toned gold, yet it also is very skin-toned, if that makes sense (really blends into your overall look and makes you glow). I use this shade as a wash across my lids and use bronzer in the crease (the perfect everyday look). This eyeshadow also goes perfectly with my light/medium complexion.  One thing to watch for, these shadows are designed to pop out from the case (from the bottom), so you can place them in a palette. They also don’t take drops well (will shatter) so be carful and gentle with them.\nI LOVE THESE!\nZO Skin Health Intense Eye Creme 8ml 0.3 Fl Oz (Travel Size)\nZO SKIN HEALTH\n{'Brand': 'ZO SKIN HEALTH', 'Item Form': 'Cream', 'Number of Items': '1', 'Skin Type': 'Mature', 'Item Volume': '0.3 Fluid Ounces', 'Package Dimensions': '10.12 x 7.87 x 3.03 inches; 3.53 Ounces', 'UPC': '860001752878'}\nOn the paper, the ZO intense eye cream looks perfect, and it apparently has a host of fans who love it. It's not a great fit for me though. While it seems very well tolerated and doesn't sting, burn or make my eyes water, it doesn't do anything else. Its texture is a bit too thick, which isn't usually the issue with rich/thick eye creams (think Estee Lauder Re-Nutritiv, Sisleya, Shiseido Benefiance), but ZO intense eye cream does tend to ball up on me; to me, it seems like a thick layer that looks almost waxy under the eyes.<br /><br />In general, with cosmetics there are two kinds of results, one comes from a handful of ingredients that actually do something for skin and improve it (usually over weeks/months, like retinol or glycolic acid) and the other type is when a product just makes skin look nicer (with some pigments, polymers and all the other chemical witchery - the stuff that washes off at the end of a day) - this eye product manages neither for me. ZO Intense eye cream claims it helps with the appearance of dark circles and eye puffiness - and I say, nope, the thicker formula does even enhance the appearance of eye bags and every line and wrinkle.\nits not a ride or die -",
  "profile": "**Updated User Profile Summary:**\n\n- **Skin Tone Preference:** The user identifies as very fair-skinned, seeking cosmetic products that enhance their complexion without an artificial or overly bronzed look.\n  \n- **Product Type:** They favor powder formulations, particularly those providing light coverage and a matte finish, along with versatile cream formulations for color correction. The user recently expressed a preference for creamy products that seamlessly blend into their skin, yet critiques overly thick textures.\n\n- **Brand Loyalty:** A devoted fan of Benefit Cosmetics, the user has broadened their interests to include luxury brands like Charlotte Tilbury and Iles Formula, showcasing a preference for high-quality products with practical advantages.\n\n- **Desired Effects:** Valuing a natural, healthy glow, the user prioritizes understated beauty looks with products offering a refined finish suitable for both professional and casual settings. They recently indicated a desire for products that effectively address specific skin concerns while maintaining a natural appearance.\n\n- **Purchase Behavior:** The user approaches purchases strategically, stocking up on favorites but remains open to exploring new options. They are particularly drawn to neutral, flattering shades adaptable for various occasions.\n\n- **Review Style:** Their reviews are enthusiastic and highly positive, focusing on performance aspects such as shine control and the preservation of their fair complexion. However, the user does not hesitate to critique products that fail to deliver effective results, reflecting a discerning taste and high expectations.",
  "metrics": {
    "rouge1_f": 0.17482517482517484,
    "rouge2_f": 0.01400560224089636,
    "rougeL_f": 0.07412587412587414,
    "meteor": 0.059077526877196404,
    "bleu1": 0.00503692747887602,
    "bleu2": 0.0017205781530145571,
    "bleu3": 0.0004882631450744555,
    "bleu4": 0.0001463946967115395,
    "bertscore_precision": 0.3606141209602356,
    "bertscore_recall": 0.4677700698375702,
    "bertscore_f1": 0.40726152062416077
  }
}