{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: TARTE shape tape setting powder\nReview Date: 2020/12/27\nStore: Tarte\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Tarte', 'Item Form': 'Powder', 'Finish Type': 'Radiant', 'Number of Items': '1', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.83 x 2.76 x 1.26 inches; 0.42 Ounces', 'UPC': '846733025183'}\nReview Text: we go everywhere together these days! she erases shine, doesn't make my super-fair complexion orange, and my skin look nearly flawless.  i thought the translucent pressed powder was lovely...but that pales in comparison now. hands down THE best powder i've ever purchased.  ...but if you're pasty & tasty with a shiny t-zone--buy some! get two!\nReview Title: LOVE!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Benefit Cosmetics Hoola Lite Bronzer (Natural Light Bronze) 0.28 oz\nBenefit Cosmetics\n{'Item Form': 'Powder', 'Finish Type': 'Matte', 'Coverage': 'Light', 'Brand': 'Benefit Cosmetics', 'Color': 'Hoola Lite', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 2.6 x 1.42 inches; 1.76 Ounces', 'Item model number': 'FM46'}\nif you are very fair (like I am) its the perfect bronzer - not orange not \"fake tan\" looking but the perfect healthy glow!! I have bought 3 more bc I fear of running out!! LOVE THiS!!\nperfect bronzer\nCHARLOTTE TILBURY Magic Vanish! Color Corrector Tan\nCHARLOTTE TILBURY\n['A color-corrector that helps neutralize and smooth the undereye and face to help conceal pigmentation and brighten skin.']\n{'Item Form': 'Cream', 'Color': 'deep', 'Package Information': 'Tube', 'Brand': 'CHARLOTTE TILBURY', 'Coverage': 'Light', 'Package Dimensions': '5.24 x 2.4 x 1.46 inches; 1.2 Ounces'}\nCT is all things LUXURY!  LA Girl Pro conceal was my favorite forever and at night I still reach for it<br /><br />Yet this product has a finer finish and is perfect for layering and day wear\nCT Rocks\nIles Formula 3 Step System - Shampoo, Conditioner, Finishing Serum Set\nILES FORMULA PARIS NEW YORK\n{'Item Form': 'Liquid', 'Brand': 'ILES FORMULA PARIS NEW YORK', 'Number of Items': '3', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 6.3 x 1.46 inches; 1.68 Pounds', 'UPC': '813614020162'}\nOne of my favorite shampoos I have found in recent years -- nourishes your hair to have THE BEST hair days\nSimply the best\nToo Faced Gingerbread Extra Spicy Eyeshadow Palette\nToo Faced\n['Includes 18 multi-finish warm and toasty shadows that glide on with buttery smoothness for playful pops of color that smell like fresh-baked gingerbread.']\n{'Brand': 'Too Faced', 'Item Form': 'Cream', 'Finish Type': 'Sheer', 'Special Feature': 'Travel size, Matte', 'Number of Items': '1', 'Package Dimensions': '7.75 x 4.02 x 0.94 inches; 8.32 Ounces', 'UPC': '651986907939'}\nThis is the most used palette in my makeup wardrobe. I usually use it for a professional everyday look for work. However , it is versatile enough that I can intensify it for evening or dressy occasions or tone it down for subtly enhancing a \"no makeup\" look. Because it is neutral and universally flattering on almost all skin tones (may not show up well if you have a deep toned complexion), I can wear it with any color in my wardrobe. I also like that it has a fantastic cool toned set of colors that do not end up showing up blue or purple on the skin. The undertones are very subtle, just like real skin! So hard to find - there seems to be a profusion of warm toned makeup out there, but very little cool or neutral toned makeup that produces a smooth, natural looking and flattering gradient of color on the skin. Nice job, Too Faced! I hope you regard this as your flagship palette and never discontinue this. Don't change the formula either!\nTOO FACED DEVOTEE\nCharlotte's Genius Magic Powder For Under Eye and Face 13 Grams/.45 Ounce Shade 1 Fair\nCHARLOTTE TILBURY\n{'Brand': 'CHARLOTTE TILBURY', 'Color': 'Beige', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'Fair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 3.11 x 3.31 inches; 3.52 Ounces'}\nThey call it BAKING, I call it MY BABY!! it's a crease-less must have. I have two one in my makeup kit and one in my personal makeup bag. This baby is amazing work so well for all over the face, but best of your under eyes... love it. I cannot live without this product!! No Flashback either!  Charlotte T can we be BESTIES??\nSTOP LOOKING FOR THE BEST POWDER - YOU JUST FOUND IT!\nTARTE shape tape setting powder\nTarte\n{'Brand': 'Tarte', 'Item Form': 'Powder', 'Finish Type': 'Radiant', 'Number of Items': '1', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.83 x 2.76 x 1.26 inches; 0.42 Ounces', 'UPC': '846733025183'}\nwe go everywhere together these days! she erases shine, doesn't make my super-fair complexion orange, and my skin look nearly flawless.  i thought the translucent pressed powder was lovely...but that pales in comparison now. hands down THE best powder i've ever purchased.  ...but if you're pasty & tasty with a shiny t-zone--buy some! get two!\nLOVE!!!",
  "profile": "**Updated User Profile Summary:**\n\n- **Skin Tone Preference:** The user identifies as very fair-skinned and seeks cosmetic products that enhance their complexion without appearing artificial or overly bronzed.\n- **Product Type:** Preference for powder formulations, particularly those that provide light coverage and a matte finish. The user has shown a keen interest in finely milled powders with skincare benefits, as well as cream formulations for tasks like color correction and versatile uses in eyeshadow palettes.\n- **Brand Loyalty:** While a devoted fan of Benefit Cosmetics, the user has broadened their interests to include luxury brands like Charlotte Tilbury and Iles Formula, reflecting a preference for high-quality products offering practical advantages.\n- **Desired Effects:** They value a natural, healthy glow and focus on understated beauty looks, favoring products that lend a refined finish appropriate for both professional and casual settings.\n- **Purchase Behavior:** The user demonstrates a strategic approach to purchases, regularly stocking up on favorites while also being open to exploring new products. They appreciate neutral, flattering shades suitable for diverse occasions.\n- **Review Style:** Enthusiastic and satisfied in their reviews, the user emphasizes performance aspects such as shine control, avoidance of altering their fair complexion, and overall flawless appearance. They frequently award high ratings, reflecting strong satisfaction with makeup and hair care products.\n\nIncorporating recent purchases, the user has solidified their preference for effective powder products that offer a flawless, radiant finish while ensuring compatibility with their fair skin tone.",
  "metrics": {
    "rouge1_f": 0.2474437627811861,
    "rouge2_f": 0.018442622950819675,
    "rougeL_f": 0.08793456032719837,
    "meteor": 0.08902356408164272,
    "bleu1": 0.0401035374891215,
    "bleu2": 0.008199778015036553,
    "bleu3": 0.0013127142691854263,
    "bleu4": 0.0005256772897811768,
    "bertscore_precision": 0.3765667676925659,
    "bertscore_recall": 0.4680858850479126,
    "bertscore_f1": 0.41736820340156555
  }
}