{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/12/17\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Roland Emmerich'], 'Producers': ['Harald Kloser', 'Mark Gordon', 'Larry Franco'], 'Starring': ['John Cusack', 'Chiwetel Ejiofor', 'Amanda Peet'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nReview Text: Love the movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Harry Potter Double Feature: The Deathly Hallows Part 1 & 2\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Characters & Series, Harry Potter, Harry Potter and the Deathly Hallows\n['Harry Potter Double Feature: Year 7 (DBFE) (DVD)', 'In the first part of the seventh and final adventure, Harry, Ron and Hermione set out on their perilous mission to track down and destroy the secret to Voldemort\\'s immortality and destruction -- the Horcruxes. On their own, without the guidance of their professors or the protection of Dumbledore, the three friends must now rely on one another more than ever. But there are Dark Forces in their midst that threaten to tear them apart. The motion picture event of the generation comes to a close in the second part of the final chapter in the monumental Harry Potter series.Following 2010\\'s first installment, the boy wizard\\'s final adventure concludes with the climactic final battle between \"The Boy Who Lived \"and the Dark Lord Voldemort.', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Kids & Family, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense   See more', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Rupert Grint, Daniel Radcliffe, Emma Watson, David Yates, Robbie Coltrane, Alan Rickman, Maggie SmithRupert Grint, Daniel Radcliffe, Emma Watson, David Yates, Robbie Coltrane, Alan Rickman, Maggie Smith   See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Runtime': '2 hours and 10 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.3 x 0.6 x 7.5 inches; 3.2 Ounces', 'Batteries': 'Lithium Metal batteries required.', 'Director': 'David Yates', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 10 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane, Alan Rickman', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nGot here way earlier than I thought.  Discs are perfect to add to my collection!\nSuper Fast Shipping\nWill Smith - Seven Pounds\nWill Smith  (Actor, Producer),     Rosario Dawson  (Actor),     Gabriele Muccino  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Academy Award® nominee Will Smith (2006, Best Performance by an Actor in a Leading Role, The Pursuit of Happyness) stars as Ben Thomas, a man at a crossroads searching for a way to redeem his heavy conscience. He discovers he has the power to change the circumstances of seven strangers who deserve a second chance. But when one of them captures his heart, he must decide if he should reveal his secret -- even if it means giving up on his plan. From the creators of The Pursuit of Happyness, SEVEN POUNDS is an \"emotionally charged, captivating mystery with a soulful, tender love story and a tearful but joyfully inspiring ending\" (MOVIEGUIDE®).', 'Amazon.com', 'The mysteriously titled', 'Seven Pounds', 'stars Will Smith as Ben Thomas, who flashes his badge as an IRS agent to gain entrance into the lives of seven strangers in need. To each, he offers something that will reverse their troubles, seeking to atone for a haunting past mistake. But when Ben starts falling in love with a young woman with heart trouble (Rosario Dawson), his carefully laid plans threaten to collapse. To reveal more of the story would diminish it. Smith is an engaging, charismatic presence, but the impact of', 'Seven Pounds', 'comes from Dawson--she has the kind of emotional transparency that shimmers off the screen. Which is crucial, because Seven Pounds requires considerable suspension of disbelief; some scenes push and pull at plausibility, and you may question a few plot turns after the movie is over. But as the story unfolds, the performances can carry you over these bumps. If you surrender to its gently circling rhythms and its luminous images (including the glowing undulations of a poisonous jellyfish),', 'Seven Pounds', 'will pack an emotional wallop, heartbreaking and uplifting at the same time. Also featuring Barry Pepper (', 'Saving Private Ryan', '), Michael Ealy (', 'Sleeper Cell', '), and Woody Harrelson.', '--Bret Fetzer', 'Stills from', 'Seven Pounds', '(click for larger image)']\n{'Genre': 'Drama, Romance', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Widescreen, Dolby', 'Contributor': 'Michael Spellman, Kevin Cooney, Robinne Lee, Woody Harrelson, Gina Hecht, Jason Blumenthal, Andy Milder, Audrey Wasilewski, Will Smith, Barry Pepper, Rich Hutchman, Lee von Ernst, Sonya Eddy, Jora Senane, Todd Black, Bill Smitrovich, Robert Figueroa, Steve Tom, James Lassiter, Fiona Hale, Amanda Carlin, Columbia Pictures; Overbrook Entertainment Inc., Tim Kelleher, Sarah Morris, Octavia Spencer, David Haines, Dale Raoul, Cynthia Rube, Charlene Amoia, Elpidia Carrillo, Louisa Kendrick, Gaspar Uriarte, Quintin Kelley, Connor Cruise, Judyann Elder, Markus Flanagan, Todd Cahoon, Nadia Shazana, Michael Ealy, Jack Yang, Joseph Nuñez, Madison Pettis, Leif Rogers, Steve Tisch, Casey Morris, Ivan Angulo, Gabriele Muccino, Rosario Dawson, Nichole AmbrizMichael Spellman, Kevin Cooney, Robinne Lee, Woody Harrelson, Gina Hecht, Jason Blumenthal, Andy Milder, Audrey Wasilewski, Will Smith, Barry Pepper, Rich Hutchman, Lee von Ernst, Sonya Eddy, Jora Senane, Todd Black, Bill Smitrovich, Robert Figueroa, Steve To…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'CTR24915DVD', 'Director': 'Gabriele Muccino', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 3 minutes', 'Release date': 'March 31, 2009', 'Actors': 'Will Smith, Rosario Dawson, Michael Ealy, Barry Pepper, Woody Harrelson', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Jason Blumenthal, Todd Black, Steve Tisch, James Lassiter, Will Smith', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSuper fast shipping, perfect compliment to my collection.\nSuper Fast Shipping, ordered while standing in Best Buy waiting for them to check and see about their shipping.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rian Johnson'], 'Producers': ['Ram Bergman', 'James D. Stern'], 'Starring': ['Rachel Weisz', 'Mark Ruffalo', 'Adrien Brody'], 'Studio': ['Lionsgate']}\nGood movie.  We enjoy it!\nGood, fun movie!\nPirates of the Caribbean: On Stranger Tides (Two-Disc Blu-ray / DVD Combo in Blu-ray Packaging)\nJohnny Depp  (Actor),     Ian McShane  (Actor),     Rob Marshall  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From Disney and Producer Jerry Bruckheimer comes all the fun, epic adventure and humor that ignited the original. Johnny Depp returns as Captain Jack Sparrow in Pirates Of The Caribbean: On Stranger Tides. A tale of truth, betrayal, youth, demise - and mermaids! When Jack crosses paths with a woman from his past (Penelope Cruz), he's not sure if it's love, or if she's a ruthless con artist using him to find the fabled Fountain of Youth. Forced aboard the ship of the most feared pirate ever, Jack doesn't know who to fear more -Blackbeard (Ian McShane) or the woman from his past. Directed by Rob Marshall, it's filled with eye-popping battle scenes, mystery and all-out wit.\", 'Versions of', 'Pirates of the Caribbean: On Stranger Tides', \"Title Pirates of the Caribbean: On Stranger Tides (DVD) Pirates of the Caribbean: On Stranger Tides (Two-Disc Blu-ray / DVD Combo in Blu-ray Packaging) Pirates of the Caribbean: On Stranger Tides (Two-Disc Blu-ray / DVD Combo in DVD Packaging)  Pirates of the Caribbean: On Stranger Tides (Five-Disc Combo: Blu-ray 3D / Blu-ray / DVD / Digital Copy) Pirates of the Caribbean Four-Movie Collection (Blu-ray + Digital Copy) Release Date 10/18/2011 10/18/2011 10/18/2011 10/18/2011 10/18/2011 Format/ Number of discs One Disc: DVD Two Discs: Blu-ray + DVD Two Discs: Blu-ray + DVD Five Discs: Blu-ray + Blu-ray 3D+ DVD + Digital Copy 15 disc total: Curse of the Black Pearl Two Discs: BD + Digital Copy Dead Man's Chest Two Discs: Disc BD + Digital Copy At World's End Two Discs: BD + Digital Copy On Stranger Tides Blu-ray 3D + 2-Disc BD + BD Bonus Disc + DVD + Digital Copy Blu-ray 3D No No No Yes Yes (On\", 'Stranger Tides', 'Only) Blu-ray  No Yes Yes Yes Yes DVD Yes Yes Yes Yes Yes (On', 'Stranger Tides', 'Only) Digital Copy No No No Yes Yes Bonus Features(Bonus Material Not Rated) Bloopers of the CaribbeanLEGO Animated Shorts: Captain', \"Jack's Brick TalesAudio Commentary by Director Rob Marshall\", '*Not available in all territories. Features subject to change', 'Same as DVD plus: Disney Second Screen', '*Not available in all territories. Features subject to change', 'Same as DVD plus: Disney Second Screen         *', 'Not available in all territories. Features subject to change.', 'Same as Blu-ray / DVD Combo pack plus: Under the Scene: Bringing Mermaids to Life Legends of On Stranger Tides In Search of the Fountain Last Sail, First Voyage     *', 'Not available in all territories. Features subject to change.', 'Same as', 'Pirates of the Caribbean: On Stranger Tides (Five-Disc Combo)', 'plus: Digital Copies of first 3 films (never before released) 2-Disc Blu-rays of first 3 movies including all previous bonus All new Blu-ray bonus disc which includes an all-new short film and more!  *', 'Not available in all territories. Features subject to change.']\n{'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Johnny Depp, Ian McShane, Rob Marshall', 'Language': 'French, English (Dolby Digital 2.0), Spanish, English (DTS-HD High Res Audio)', 'Runtime': '2 hours and 16 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': 'WD10792500BR', 'Director': 'Rob Marshall', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 16 minutes', 'Release date': 'October 18, 2011', 'Actors': 'Johnny Depp, Ian McShane', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Walt Disney Pictures', 'Country of Origin': 'USA', 'Number of discs': '2'}\nCompletes my collections of movies.  Quick shipping, mint movie.\nCompletes my collection!\nInto The Woods\nMeryl Streep  (Actor),     Emily Blunt  (Actor),     Rob Marshall  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"From the director of CHICAGO and the producer of WICKED comes a modern twist on the beloved fairy tales you thought you knew. Meryl Streep stars in this epic musical saga about daring to venture INTO THE WOODS. Iconic characters, such as Cinderella, Little Red Riding Hood, Jack and the Beanstalk and Rapunzel, find their fates intertwined with a humble baker and his wife, whose longing to have a child sends them on a quest to reverse a witch's (Streep) curse. With an all-star cast, this spellbinding adventure is everything you could ever wish for.\"]\n{'Genre': 'Musical', 'Format': 'Multiple Formats, NTSC, Subtitled', 'Contributor': 'Meryl Streep, Emily Blunt, Christine Baranski, Based On The Musical By Stephen Sondheim And James, Anna Kendrick, Johnny Depp, James Corden, Chris Pine, Rob Marshall, Tracey Ullman, Screenplay By James LapineMeryl Streep, Emily Blunt, Christine Baranski, Based On The Musical By Stephen Sondheim And James, Anna Kendrick, Johnny Depp, James Corden, Chris Pine, Rob Marshall, Tracey Ullman, Screenplay By James Lapine  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '12636100', 'Director': 'Rob Marshall', 'Media Format': 'Multiple Formats, NTSC, Subtitled', 'Run time': '2 hours and 5 minutes', 'Release date': 'March 24, 2015', 'Actors': 'Meryl Streep, Emily Blunt, James Corden, Anna Kendrick, Chris Pine', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Screenplay By James Lapine, Based On The Musical By Stephen Sondheim And James', 'Number of discs': '1'}\nExcellent movie, came early!  Awesome pkg.  New movie\nExcellent movie and seller\n{'Subtitles': ['None available'], 'Directors': ['Lee Cipolla'], 'Producers': ['Melanie DiPietro', 'James Ganiere', 'William Garcia', 'Jeremy Mitchell'], 'Starring': ['Leo Oliva', 'Casey Fitzgerald', 'Danny Glover'], 'Studio': ['Random Media']}\nInteresting movie\nFour Stars\n{'Subtitles': ['None available'], 'Directors': ['Giulio Base'], 'Starring': ['Lorenzo Crespi', 'Andrea Osvárt'], 'Studio': ['Indie Crush']}\nIt was a bit goofy.  Not sure I would watch it again.\nTwo Stars\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Alejandro Amenábar'], 'Producers': ['Alejandro Amenábar'], 'Starring': ['Emma Watson', 'Ethan Hawke', 'David Thewlis']}\nReally interesting movie.\nGreat Movie worth the watch :)\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Robert Zemeckis', 'Steve Starkey'], 'Starring': ['Goldie Hawn', 'Bruce Willis', 'Meryl Streep'], 'Studio': ['Universal City Studios Product']}\nI love this movie!\nFive Stars\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Roland Emmerich'], 'Producers': ['Harald Kloser', 'Mark Gordon', 'Larry Franco'], 'Starring': ['John Cusack', 'Chiwetel Ejiofor', 'Amanda Peet'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nLove the movie!\nFive Stars",
  "profile": "**User Profile Summary (Updated):**\n\n- **Interests**: The user continues to express a deep passion for the Harry Potter franchise and emotionally resonant film narratives, especially those infused with musical elements. Their recent interactions underscore an openness to diverse storytelling and an increasing appreciation for mature themes within cinema.\n\n- **Genres**: While maintaining a strong preference for fantasy and science fiction, the user is expanding their interest into action/adventure films characterized by rich storylines and well-rounded characters. Their latest review reflects a balance of enthusiasm and critical engagement.\n\n- **Purchase Behavior**: The user values speed in transactions and prioritizes fast shipping. Although generally positive about films, they exhibit a more selective approach to ratings, showing a blend of enjoyment and critical thought.\n\n- **Media Format Preference**: They favor Blu-ray for their collection but also value DVDs, enhancing the viewing experience.\n\n- **Content Rating**: The user is comfortable with PG and PG-13 rated films and is increasingly exploring mature content, as evidenced by recent interactions embracing complex themes.\n\n- **Collecting Behavior**: Actively curating a collection focused on high-quality selections, the user demonstrates a commitment to well-crafted films.\n\n- **Quality Over Quantity**: They prioritize quality storytelling, often giving high ratings while exploring varied narratives, indicative of an evolving taste.\n\n- **Familiar Contributors**: The user engages with known actors and directors, indicating loyalty to creators whose works resonate with them.\n\nOverall, the user showcases a refined appreciation for discerning storytelling, blending emotional depth with a broader exploration of diverse narratives and themes.",
  "metrics": {
    "rouge1_f": 0.09566274827725983,
    "rouge2_f": 0.007302231237322515,
    "rougeL_f": 0.04458856911228212,
    "meteor": 0.027918234599002976,
    "bleu1": 3.107763924400489e-05,
    "bleu2": 8.158595648655264e-06,
    "bleu3": 1.166934075146606e-06,
    "bleu4": 4.416770390686924e-07,
    "bertscore_precision": 0.35497063398361206,
    "bertscore_recall": 0.4775836765766144,
    "bertscore_f1": 0.4072483479976654
  }
}