{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: ABH AmazingBeauty Hair Clip Ins - AmazingBeauty Luxury Blonde Remy Human Hair Double Weft Clip in Hair Extensions, Full Head 140 Gram, 7 Pieces with 18 Clips, Platinum Blonde 60, 20 Inch\nReview Date: 2019/12/27\nStore: ABH AMAZINGBEAUTY HAIR\nAverage Rating: 4.1\nProduct Details: {'Brand': 'ABH AMAZINGBEAUTY HAIR', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Package Dimensions': '10.2 x 4 x 3 inches; 10.41 Ounces', 'UPC': '639846527848'}\nReview Text: I have only had synthetic hair clip ins in the past and had no idea how dreamy real hair pieces would be. This hair is SOOO SOFT!!!!. It is light enough that I can't even tell they are clipped it, they feel natural.  The texture is fine and they blend well with my baby fine/thin hair.  I got the light blonde and while it didn't match my platinum perfectly, it was close enough.<br />My hair went from platinum to copper red last week so I needed a different color. I dyed these and they match perfectly.  I wish I could find a clip on pony tail or wrap from this company. These are so worth the money. They also come with a rat tail comb to help with sectioning and teasing your hair to attach these, extra clips and a nice drawstring storage bad.\nReview Title: These are great quality hair!!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "YOUFA Brazilian Human Hair Bundles 16 18 20 with Closure Straight Hair Unprocessed Virgin Hair Extensions Natural Color(16 18 20 +14\"closure)\nYOUFA\n{'Brand': 'YOUFA', 'Color': 'Natural', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10 x 7.7 x 2.1 inches; 12.8 Ounces'}\nThis hair is soooooo luxurious!!!  The bundles are probably middle weight-not super thin or lightweight but not suer heavy either. They are perfect for making clip in extensions or pony tail wraps.  The hair is soo soft and thick but looks fine with my fine hair.<br />Mine came with a small silk piece to use as a topper or perhaps bangs.  The one I got was a bit weird. The hair all went to a slight angle. I don't know if this is from being packed or what. I am going to wash it and brush it straight while wet and see how it dries. I'd love to have a little topper piece but if it stays slanted I'll make it into something else.\nGorgeous hair!!!\nC.O. Bigelow No. 007 Dr Hiosous Quince Hand Lotion, 4 Ounces\nC. O. Bigelow\n{'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion', 'Unit Count': '4 Ounce', 'Number of Items': '1', 'Use for': 'Hands', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 2 x 0.7 inches; 5.61 Ounces', 'Item model number': '20002240'}\nHarsh frigid air outside and dry heat inside have made my hands so dry this winter. I have a plethora of creams and lotions but nothing works as well as this Quince hand lotion. Seriously, this is best hand cream I've ever used.<br /><br />The tube it good sized and the lotion is thick and creamy. It isn't greasy at all and absorbs into the skin. I does feel like it creates some kind of invisible glove barrier.  Since using it, my hands and cuticles have been softer and are healing.  The scent is very faint and a little odd. I can't quite put my finger on what it is, but it does have a bit of a citrusy scent. It doesn't smell like quince fruit or carrot, but it's not a bad smell.<br /><br />C.O. Bigelow makes amazing products and this one doesn't disappoint.  Put it on at night and your hands will thank you. You'll feel and see a difference in the morning!\nWorks like a dream\nABH AmazingBeauty Hair Clip Ins - AmazingBeauty Luxury Blonde Remy Human Hair Double Weft Clip in Hair Extensions, Full Head 140 Gram, 7 Pieces with 18 Clips, Platinum Blonde 60, 20 Inch\nABH AMAZINGBEAUTY HAIR\n{'Brand': 'ABH AMAZINGBEAUTY HAIR', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Package Dimensions': '10.2 x 4 x 3 inches; 10.41 Ounces', 'UPC': '639846527848'}\nI have only had synthetic hair clip ins in the past and had no idea how dreamy real hair pieces would be. This hair is SOOO SOFT!!!!. It is light enough that I can't even tell they are clipped it, they feel natural.  The texture is fine and they blend well with my baby fine/thin hair.  I got the light blonde and while it didn't match my platinum perfectly, it was close enough.<br />My hair went from platinum to copper red last week so I needed a different color. I dyed these and they match perfectly.  I wish I could find a clip on pony tail or wrap from this company. These are so worth the money. They also come with a rat tail comb to help with sectioning and teasing your hair to attach these, extra clips and a nice drawstring storage bad.\nThese are great quality hair!!!!",
  "profile": "**User Summary:**\n\n- **Product Preference:** Enjoys high-quality, luxurious human hair extensions, particularly straight types, and has developed an appreciation for various types, including clip-in extensions, showcasing a desire for versatility in styling options. There's also a growing interest in quality personal care products, such as hand lotions.\n- **Quality Standards:** Values attributes like softness and thickness in hair extensions, emphasizing a preference for natural textures that seamlessly blend with fine hair. Maintains an expectation for effective, non-greasy formulations in skincare items.\n- **Buyer's Approach:** Open to experimenting with colors and styles; actively seeks effective solutions for hair care, indicating a hands-on attitude toward beauty and self-care.\n- **Specific Uses:** Initially focused on using hair extensions for clip-ins and ponytails, has recently expressed a need for color adaptability and product longevity, particularly in relation to challenging hair scenarios.\n- **Attention to Detail:** Appreciates packaging and presentation in hair products, noting functionality and quality across categories, particularly regarding the effectiveness of hair extensions and personal care products.\n- **Review Behavior:** Tends to leave positive reviews, particularly when products meet or exceed expectations. Recent experiences have deepened satisfaction levels with high-quality hair extensions, demonstrating a commitment to sharing positive experiences that underscore value.\n\nThis user consistently prioritizes quality, versatility, and attention to detail in both hair care and skincare purchases.",
  "metrics": {
    "rouge1_f": 0.2023255813953488,
    "rouge2_f": 0.03263403263403263,
    "rougeL_f": 0.09534883720930232,
    "meteor": 0.08369868473495418,
    "bleu1": 0.05605642629287234,
    "bleu2": 0.007902256317218763,
    "bleu3": 0.0015169308312208483,
    "bleu4": 0.0006652142873889763,
    "bertscore_precision": 0.36535120010375977,
    "bertscore_recall": 0.4460500180721283,
    "bertscore_f1": 0.4016875922679901
  }
}