{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lovrio 20\" 20 Pcs 50g Glue Hair Extensions Piano Color Dirty Blonde mixed with Light Golden Blonde P18-22 Seamless in Human Hair Hair Extensions With Adhensive Tape\nReview Date: 2020/03/05\nStore: Lovrio\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Lovrio', 'Hair Type': 'Oily', 'Installation Type': 'tape', 'Package Dimensions': '10.24 x 4.25 x 1.89 inches; 6.7 Ounces', 'UPC': '633085357099'}\nReview Text: I've been wanting to try tape in extensions and see how well they would do in my baby fine thin hair. In the past, sew in and clip in extensions pulled the hair from my scalp.  The salon I got to charges over $300 for a set so I was hesitant to spend that kind of money if it wasn't going to work well for me.<br /><br />I decided to get these so I could try them before spending hundreds at the salon.  They came quickly and are really wonderful quality hair. They are super soft and come with everything you need to put them in yourself-the hair pieces, tapes and a comb. I watched a few youtube videos to make sure I wouldn't screw it up. I wanted to add them just to the sides of my head, where I'm thinnest to see how I liked using/wearing them.  The application was super easy.  I am so surprised how easy this is to do yourself at least on the sides of your head. The back of the head will be a challenge but have a friend help you out. These also come with additional adhesive in case of any mistakes. There are only 20 pieces which create 10 hair pieces because you sandwich your hair between two loose hair pieces. So if you want a thicker look or have thick hair you'll want to order two boxes.<br /><br />I'm super pleased with these and will order more when these need replaced.\nReview Title: Gorgeous Hair Extensions\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "YOUFA Brazilian Human Hair Bundles 16 18 20 with Closure Straight Hair Unprocessed Virgin Hair Extensions Natural Color(16 18 20 +14\"closure)\nYOUFA\n{'Brand': 'YOUFA', 'Color': 'Natural', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10 x 7.7 x 2.1 inches; 12.8 Ounces'}\nThis hair is soooooo luxurious!!!  The bundles are probably middle weight-not super thin or lightweight but not suer heavy either. They are perfect for making clip in extensions or pony tail wraps.  The hair is soo soft and thick but looks fine with my fine hair.<br />Mine came with a small silk piece to use as a topper or perhaps bangs.  The one I got was a bit weird. The hair all went to a slight angle. I don't know if this is from being packed or what. I am going to wash it and brush it straight while wet and see how it dries. I'd love to have a little topper piece but if it stays slanted I'll make it into something else.\nGorgeous hair!!!\nC.O. Bigelow No. 007 Dr Hiosous Quince Hand Lotion, 4 Ounces\nC. O. Bigelow\n{'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion', 'Unit Count': '4 Ounce', 'Number of Items': '1', 'Use for': 'Hands', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 2 x 0.7 inches; 5.61 Ounces', 'Item model number': '20002240'}\nHarsh frigid air outside and dry heat inside have made my hands so dry this winter. I have a plethora of creams and lotions but nothing works as well as this Quince hand lotion. Seriously, this is best hand cream I've ever used.<br /><br />The tube it good sized and the lotion is thick and creamy. It isn't greasy at all and absorbs into the skin. I does feel like it creates some kind of invisible glove barrier.  Since using it, my hands and cuticles have been softer and are healing.  The scent is very faint and a little odd. I can't quite put my finger on what it is, but it does have a bit of a citrusy scent. It doesn't smell like quince fruit or carrot, but it's not a bad smell.<br /><br />C.O. Bigelow makes amazing products and this one doesn't disappoint.  Put it on at night and your hands will thank you. You'll feel and see a difference in the morning!\nWorks like a dream\nABH AmazingBeauty Hair Clip Ins - AmazingBeauty Luxury Blonde Remy Human Hair Double Weft Clip in Hair Extensions, Full Head 140 Gram, 7 Pieces with 18 Clips, Platinum Blonde 60, 20 Inch\nABH AMAZINGBEAUTY HAIR\n{'Brand': 'ABH AMAZINGBEAUTY HAIR', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Package Dimensions': '10.2 x 4 x 3 inches; 10.41 Ounces', 'UPC': '639846527848'}\nI have only had synthetic hair clip ins in the past and had no idea how dreamy real hair pieces would be. This hair is SOOO SOFT!!!!. It is light enough that I can't even tell they are clipped it, they feel natural.  The texture is fine and they blend well with my baby fine/thin hair.  I got the light blonde and while it didn't match my platinum perfectly, it was close enough.<br />My hair went from platinum to copper red last week so I needed a different color. I dyed these and they match perfectly.  I wish I could find a clip on pony tail or wrap from this company. These are so worth the money. They also come with a rat tail comb to help with sectioning and teasing your hair to attach these, extra clips and a nice drawstring storage bad.\nThese are great quality hair!!!!\nLovrio 20\" 20 Pcs 50g Glue Hair Extensions Piano Color Dirty Blonde mixed with Light Golden Blonde P18-22 Seamless in Human Hair Hair Extensions With Adhensive Tape\nLovrio\n{'Brand': 'Lovrio', 'Hair Type': 'Oily', 'Installation Type': 'tape', 'Package Dimensions': '10.24 x 4.25 x 1.89 inches; 6.7 Ounces', 'UPC': '633085357099'}\nI've been wanting to try tape in extensions and see how well they would do in my baby fine thin hair. In the past, sew in and clip in extensions pulled the hair from my scalp.  The salon I got to charges over $300 for a set so I was hesitant to spend that kind of money if it wasn't going to work well for me.<br /><br />I decided to get these so I could try them before spending hundreds at the salon.  They came quickly and are really wonderful quality hair. They are super soft and come with everything you need to put them in yourself-the hair pieces, tapes and a comb. I watched a few youtube videos to make sure I wouldn't screw it up. I wanted to add them just to the sides of my head, where I'm thinnest to see how I liked using/wearing them.  The application was super easy.  I am so surprised how easy this is to do yourself at least on the sides of your head. The back of the head will be a challenge but have a friend help you out. These also come with additional adhesive in case of any mistakes. There are only 20 pieces which create 10 hair pieces because you sandwich your hair between two loose hair pieces. So if you want a thicker look or have thick hair you'll want to order two boxes.<br /><br />I'm super pleased with these and will order more when these need replaced.\nGorgeous Hair Extensions",
  "profile": "**User Summary:**\n\n- **Product Preference:** Enjoys high-quality, luxurious human hair extensions, particularly straight types, with a new appreciation for tape-in extensions. Values versatility in styling options and is keen on quality personal care products, including hand lotions.\n- **Quality Standards:** Looks for attributes like softness and thickness in hair extensions, preferring natural textures that blend well with fine hair. Expects effective, non-greasy formulations in skincare products.\n- **Buyer's Approach:** Open to experimenting with colors and styles; proactive in seeking effective solutions for hair care, indicating a hands-on attitude toward beauty and self-care.\n- **Specific Uses:** Initially focused on clip-ins and ponytails, has recently expanded interest to include tape-in extensions for their ease of use and adaptability, particularly for specific areas of thinning hair. A preference for product longevity and versatility in challenging hair scenarios remains consistent.\n- **Attention to Detail:** Values packaging and presentation in hair products and emphasizes functionality across categories, especially in terms of the effectiveness of hair extensions and personal care items.\n- **Review Behavior:** Often leaves positive reviews, particularly for products that meet or exceed expectations. Recent experiences with high-quality hair extensions have heightened satisfaction levels, reinforcing a commitment to sharing positive feedback that highlights value. The user has expressed enthusiasm for trying new application methods to enhance their hair experience.\n\nThis user consistently prioritizes quality, versatility, and attention to detail in both hair care and skincare purchases.",
  "metrics": {
    "rouge1_f": 0.1761744966442953,
    "rouge2_f": 0.03697478991596639,
    "rougeL_f": 0.09899328859060404,
    "meteor": 0.068955582113937,
    "bleu1": 0.020282934097376252,
    "bleu2": 0.005991274282225981,
    "bleu3": 0.0018541373951474795,
    "bleu4": 0.0005805297233979135,
    "bertscore_precision": 0.386382520198822,
    "bertscore_recall": 0.4845203459262848,
    "bertscore_f1": 0.42992207407951355
  }
}