{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Carol’s Daughter Almond Milk Leave In Conditioner with Almond Milk, Aloe Butter and Shea Oil for Extremely Damaged Hair, 8 fl oz\nReview Date: 2017/06/07\nStore: Carol's Daughter\nProduct Description: ['Reverses Damage']\nAverage Rating: 4.4\nProduct Details: {'Brand': \"Carol's Daughter\", 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Hair Type': 'Curly, Damaged, Coily', 'Product Benefits': 'Repairs Damage, Strengthens and Protects Hair, Restores Softness for Over-Processed Hair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.97 x 1.97 x 7.49 inches; 9.88 Ounces', 'Item model number': 'K4268600', 'UPC': '820645235120 755332169061', 'Manufacturer': \"Carol's Daughter\"}\nReview Text: My daughter has very, very thick wavy blonde hair.  Not colored or processed.  We've been using another conditioner in a primarily African American line but she didn't like the smell (coconut).  This one has won her over completely.  After she gets out of the shower, she puts a dime size dab in hand and coats her hands and then start at the ends works her way to the roots.<br /><br />There is no residue and it washes out completely the next time so there are no flaky specs.\nReview Title: Carols Daughter Almond Milk Restoring Conditioner\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Carol’s Daughter Almond Milk Leave In Conditioner with Almond Milk, Aloe Butter and Shea Oil for Extremely Damaged Hair, 8 fl oz\nCarol's Daughter\n['Reverses Damage']\n{'Brand': \"Carol's Daughter\", 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Hair Type': 'Curly, Damaged, Coily', 'Product Benefits': 'Repairs Damage, Strengthens and Protects Hair, Restores Softness for Over-Processed Hair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.97 x 1.97 x 7.49 inches; 9.88 Ounces', 'Item model number': 'K4268600', 'UPC': '820645235120 755332169061', 'Manufacturer': \"Carol's Daughter\"}\nMy daughter has very, very thick wavy blonde hair.  Not colored or processed.  We've been using another conditioner in a primarily African American line but she didn't like the smell (coconut).  This one has won her over completely.  After she gets out of the shower, she puts a dime size dab in hand and coats her hands and then start at the ends works her way to the roots.<br /><br />There is no residue and it washes out completely the next time so there are no flaky specs.\nCarols Daughter Almond Milk Restoring Conditioner",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Preference:** Focus on products for extremely damaged, curly, and coily hair types.\n- **Ingredients Sensitivity:** Prefers natural ingredients, shown through product choices that emphasize repair and restoration.\n- **Usage Habits:** Emphasizes effective application techniques, such as applying a small amount from ends to roots, indicating a mindful approach to hair care.\n- **Scent Sensitivity:** Dislikes strong or overwhelming scents, specifically citing aversion to coconut fragrance, which suggests a preference for subtle or pleasant aromas.\n- **Family-Centric:** Focuses on products that cater to family needs, particularly for her daughter's thick wavy hair, indicating a nurturing and attentive role in choosing hair care solutions.\n- **Efficacy Valuation:** Values products that leave no residue and are easily washable, reflecting a focus on cleanliness and hair health.\n- **High Ratings Preference:** Shows inclination towards high-rated products (noted 5-star rating), suggesting she prioritizes quality based on user reviews.\n\nOverall, the user displays a strong preference for effective, family-friendly hair care solutions with natural ingredients and pleasant aromas, while being sensitive to product texture and ease of use.",
  "metrics": {
    "rouge1_f": 0.24444444444444444,
    "rouge2_f": 0.033519553072625705,
    "rougeL_f": 0.12777777777777777,
    "meteor": 0.14685456308127112,
    "bleu1": 0.22884702001521073,
    "bleu2": 0.05260946857420866,
    "bleu3": 0.02237668880868359,
    "bleu4": 0.008215107031984446,
    "bertscore_precision": 0.4166390895843506,
    "bertscore_recall": 0.44031447172164917,
    "bertscore_f1": 0.4281497299671173
  }
}