{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Waterproof Natural Thick Fiber Mascara, Thick Thickening Lengthening, Dramatic Extension Voluminous Eyelashes Mascara, No Clumping, No Smudging Lasting All Day\nReview Date: 2020/07/30\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.1 inches; 2.4 Ounces', 'UPC': '764690676838', 'Manufacturer': 'SIKEMAY'}\nReview Text: I have been search of the Holy Grail of mascaras for all my life.  A few times, some have come close (Max Factor 2000 Calorie Mascara has been the closest).  This product is so far off the mark, it's not funny.  The price point is good but it is clumpy and although I didn't have a bad allergic reaction, I did get raccoon eyes and resembled Rocket from Guardians of the Galaxy.  Not the look I was going for but in the deep South with 93 degrees and 100% humidity, I need a mascara that won't smear.<br /><br />On the plus side, it came off with simple soap/cleanser but I'm still on the hunt for the perfect mascara.\nReview Title: 4D Silk Fiber Lash Mascara\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Carol’s Daughter Almond Milk Leave In Conditioner with Almond Milk, Aloe Butter and Shea Oil for Extremely Damaged Hair, 8 fl oz\nCarol's Daughter\n['Reverses Damage']\n{'Brand': \"Carol's Daughter\", 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Hair Type': 'Curly, Damaged, Coily', 'Product Benefits': 'Repairs Damage, Strengthens and Protects Hair, Restores Softness for Over-Processed Hair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.97 x 1.97 x 7.49 inches; 9.88 Ounces', 'Item model number': 'K4268600', 'UPC': '820645235120 755332169061', 'Manufacturer': \"Carol's Daughter\"}\nMy daughter has very, very thick wavy blonde hair.  Not colored or processed.  We've been using another conditioner in a primarily African American line but she didn't like the smell (coconut).  This one has won her over completely.  After she gets out of the shower, she puts a dime size dab in hand and coats her hands and then start at the ends works her way to the roots.<br /><br />There is no residue and it washes out completely the next time so there are no flaky specs.\nCarols Daughter Almond Milk Restoring Conditioner\nGreen Goo Natural Skin Care for Eczema, Psoriasis, Cracked Hands and Feet, Black, Dry Skin, 1.82 Ounce\nGreen Goo\n{'Brand': 'Green Goo', 'Scent': 'Dry Skin', 'Item Form': 'Cream', 'Active Ingredients': '*Achillea Millefolium (Yarrow) Flower Extract, *Calendula Officinalis (Calendula) Flower Oil, *Chamomilla Recutita (Matricaria) Flower, *Sambucus Nigra (Elder) Flower, *Trifolium Pratense (Red Clover) Flower., Vitamin_e*Achillea Millefolium (Yarrow) Flower Extract, *Calendula Officinalis (Calendula) Flower Oil, *Chamomilla Recutita (Matricaria) Flower, *Sambucus Nigra (Elder) Flower, *Trif…  See more', 'Unit Count': '1.82 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 0.5 inches; 1.2 Ounces', 'Item model number': 'GOO-05690', 'Department': 'Unisex-adult', 'Date First Available': 'April 22, 2016', 'Manufacturer': 'Green Goo'}\nI got this because of a persistent dry spot on my neck and ear for over a year .  The doctor said it was eczema and prescribed an ointment.  Didn't help.  I must have tried everything over the counter in the beauty aisle and health.  Tried this as a last resort and bam!  Within two days of four times a day, the dry spots were gone.  Thanks!!\nGreen Goo Dry Skin Large Tin\nJade Roller for Face,Anti-aging Jade Roller Massager Eye Jade Facial Roller for Women Puffiness, Real Jade 100% Natural Herbivore Jade Facial Roller Jade Stone Roller Set with Gua Sha Tool,Case,Pouch\nOYOROL\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 2.2 x 0.59 inches; 8.8 Ounces', 'UPC': '799392612136'}\nI never thought I would like these.  I mean, come on a roller for your face?  But I admit I was wrong.  The first few times were pleasant.  I used them to spread my face oil around but I read that it's much better if it's cool.  I put it in the fridge for an hour and OMG!  Total turnaround.  The bags under my eyes shrunk a bit but it feels so much better.  I don't see the cosmetic changes but the coolness against my face after a long day at work.  Two thumbs up.\nJade Roller for Face\nAG Care Natural Remedy Apple Cider Vinegar Leave On Mist\n{'Brand': 'AG Care', 'Item Form': 'Spray', 'Material Feature': 'Plant Based, Vegan', 'Hair Type': 'All, Color Treated', 'Product Benefits': 'Gently cleanses and seals cuticle to enhance shine. Superfoods and apple cider vinegar support soft, healthy hair.Gently cleanses and seals cuticle to enhance shine. Superfoods and apple cider vinegar support soft, healthy hair.  See more', 'Product Dimensions': '1.75 x 1.75 x 6 inches; 6.14 Ounces', 'Item model number': '100150', 'UPC': '625336002391', 'Manufacturer': 'AG Hair', 'Country of Origin': 'Canada'}\nI can't use this.  It dried my very fine color treated out to make it look like red straw.  My daughter who doesn't wash her hair every day loves it.  Her hair is very thick and wavy and blonde.  Softened her hair and...I am not joking...made it shine in the sun.  She uses on the days when she doesn't wash (every three days).  This keeps the buildup at bay.<br /><br />My postal gal is pretty good about delivering packages but even with her careful handling, the plastic top was broken.  No leaks.\nAG Hair Natural Remedy Apple Cider Leave On Mist\n4D Silk Fiber Lash Mascara Black, Waterproof Natural Thick Fiber Mascara, Thick Thickening Lengthening, Dramatic Extension Voluminous Eyelashes Mascara, No Clumping, No Smudging Lasting All Day\nSIKEMAY\n{'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.1 inches; 2.4 Ounces', 'UPC': '764690676838', 'Manufacturer': 'SIKEMAY'}\nI have been search of the Holy Grail of mascaras for all my life.  A few times, some have come close (Max Factor 2000 Calorie Mascara has been the closest).  This product is so far off the mark, it's not funny.  The price point is good but it is clumpy and although I didn't have a bad allergic reaction, I did get raccoon eyes and resembled Rocket from Guardians of the Galaxy.  Not the look I was going for but in the deep South with 93 degrees and 100% humidity, I need a mascara that won't smear.<br /><br />On the plus side, it came off with simple soap/cleanser but I'm still on the hunt for the perfect mascara.\n4D Silk Fiber Lash Mascara",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Preference:** Focuses on products for extremely damaged, curly, and coily hair types, also considering her daughter’s thick, wavy hair needs.\n- **Ingredients Sensitivity:** Prefers natural, plant-based ingredients across beauty categories, valuing efficacy, particularly for repair and restoration in hair and skincare.\n- **Usage Habits:** Mindfully applies products from ends to roots, maintaining a thoughtful regimen. Recently, she demonstrated a willingness to try new cosmetics outside her typical preferences, indicating adaptability.\n- **Scent Sensitivity:** Dislikes strong scents, especially coconut, favoring subtle or pleasant aromas for a better user experience.\n- **Family-Centric:** Prioritizes family-centric solutions, noting her daughter benefits from certain products, showcasing a nurturing approach to purchases.\n- **Efficacy Valuation:** Values effective products that are easy to use and clean, emphasizing cleanliness and health in her routines. \n- **High Ratings Preference:** Generally inclined towards high-rated products, but pragmatic choices based on family needs have influenced recent behavior.\n- **Skeptical to Open-Minded:** Shows an open-mindedness toward new products, including those that may not entirely meet her standards, in order to accommodate family needs.\n\nOverall, the user remains committed to effective, family-friendly solutions, retaining a preference for natural ingredients, pleasant aromas, and a willingness to experiment with diverse beauty options, including makeup products.",
  "metrics": {
    "rouge1_f": 0.15084294587400177,
    "rouge2_f": 0.012444444444444444,
    "rougeL_f": 0.07275953859804792,
    "meteor": 0.06304172065651657,
    "bleu1": 0.015269204745213443,
    "bleu2": 0.0031893912330288924,
    "bleu3": 0.000514264889932598,
    "bleu4": 0.0002066839285307284,
    "bertscore_precision": 0.37480029463768005,
    "bertscore_recall": 0.46592193841934204,
    "bertscore_f1": 0.4154230058193207
  }
}