{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Short Bob Wig Human Hair Pixie Cut Wigs Natural Color Lace Wigs 100% Virgin Huam Hair Lace Front Side Part Wigs for Women\nReview Date: 2021/01/22\nStore: MarchQueen\nAverage Rating: 3.4\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'MarchQueen', 'Package Dimensions': '12.64 x 8.86 x 2.05 inches; 5.61 Ounces', 'UPC': '779303841725'}\nReview Text: Such a cute wig the hair wasn't soft as I thought it was be but its very nice.  Earrings and wig cap came with the bob wig, no smell, lightweight, and little to no shedding.  Very easy to install nice short cut cute for a quick look on the go and or summer style.\nReview Title: So Cute !\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Qiray Hair Ties For Women Coil Hair Ties,Large Lace Phnom Penh,5 Colors 10 Pieces.\nQiray\n{'Material': 'Rubber', 'Item Form': 'elastic', 'Brand': 'Qiray', 'Item Dimensions LxWxH': '3.15 x 3.15 x 2.36 inches', 'Number of Pieces': '10', 'Product Dimensions': '3.15 x 3.15 x 2.36 inches; 2.82 Ounces', 'UPC': '655160582486'}\nVery pretty, they have a good stretch depending you your hairstyle you may twist twice.  You get two of each color.  The only thing I did not like is that these hair ties have a paint smell to them so wash them before wearing them.\nGood\nSTYLEAGAL Portable Electric Nail Drill, Manicure Pedicure Drill Kit Professional nail starter kit for beginners acrylic with drill（2020 Upgraded）\nstyleagal\n{'Brand': 'styleagal', 'Voltage': '5 Volts', 'Power Source': 'Battery Powered', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.8 x 4.5 x 2 inches; 8.01 Ounces', 'UPC': '782913461771', 'Manufacturer': 'STYLEAGAL'}\n[[VIDEOID:c1d81e3cfad618ed65e971a49ab65264]] This is a nice drill great for beginners.  Just take some practice to get good at using it on your self and others hand.  The power cord is not long enough and the drill bits is hard to push them in and to pull out.  If you have never used a drill start working with the lower speed first.\nWorks very well\nPretty Frank Natural Deodorant Jar- No Aluminum Deodorant for Women, Men, Teens, & Kids – Paraben Sulfate Free Cream Deodorant with Shea Butter, Coconut Oil, Vitamin E & Baking Soda (Jasmine)\nPRETTY FRANK\n{'Brand': 'PRETTY FRANK', 'Item Form': 'Cream', 'Scent': 'Jasmine, Coconut', 'Material Feature': 'Natural', 'Number of Items': '1', 'Package Dimensions': '3.42 x 2.79 x 2.59 inches; 5.61 Ounces'}\nI like the fact that its organic and made in the US. However, this is not a deodorant for someone who is on the move. I do have sweaty underarms and I had to clean my armpits and apply this several times a day to be dry.  I don't like that I have to put this on with my fingers.  I was dry long as I wasn't moving around to much and in a cool place.  The jasmine scent is wonderful.  It is a small jar but you get a lot.\nNot for me\nYsesoAi 28 Pcs Hair Curlers Spiral Curls No Heat Wave Hair Curlers Styling Kit Spiral Hair Curlers Magic Hair Rollers with 2 Pieces Styling Hooks for Most Kinds of Hairstyles (20 cm/ 7.8 inches)\nYsesoAi\n{'Hair Type': 'Curly', 'Brand': 'YsesoAi', 'Color': 'Pink, Blue, Ivory, Yellow, Green', 'Item Dimensions LxWxH': '1.5 x 1.7 x 1.1 inches', 'Unit Count': '1.00 Count', 'Product Dimensions': '1.5 x 1.7 x 1.1 inches; 6.38 Ounces', 'UPC': '745895771436'}\nMy hair is naturally curly so , I wanted to see how it would do on a blowout.  I like the curly pattern that it creates the only problem I had was my hair was to long for this, pulling your hair threw with the hook that's given was easy. It did not hurt to pull your hair threw the spiral curlers.\nShort Hair Only\nAMAJULIE Non Slip Flexible Silicon Wigs Fix Strong Hold Comfort Silicone Lace Wig Grip Transparent Headband Hair Band Adjustable for Lace Wigs (Light Brown)\nAMAJULIE\n{'Material': 'Silicone', 'Fabric Type': 'Silicone,Silicon,Lace', 'Brand': 'AMAJULIE', 'Unit Count': '1.00 Count', 'Package Dimensions': '3.98 x 2.28 x 0.55 inches; 0.88 Ounces', 'UPC': '192389741275'}\nI love this thing, it's very comfortable and has nice snug fit.  It's not to tight and the ridges are on the top and bottom so it stays on your head and grips the lace on the wig.  You don't see the grip under your lace, this thing really keeps your wig on.  You must be wearing a Lace Front wig for it to work.\nMy new friend\nGlitter Poly Nail Gel Extensions Builder Gel UV/LED Soak Off Acrylic Fashion Gel Polish Set for Nails Beginner DIY Nail Art at Home 8 colors-15g (Pink series)\nMIZHSE\n{'Brand': 'MIZHSE', 'Item Form': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '478.00 Count', 'Number of Items': '9', 'Package Dimensions': '9.76 x 4.88 x 1.42 inches; 12.8 Ounces'}\nThis kit only comes with the poly gel, nail forms and a free gift. You will need your own tools to apply. I love this formula, very easy work with it doesn’t dry fast so you have to build or layer. What I like the most that after putting under the lamp your nails don’t have that tacky layer.  So the poly gel is sheer but building as in adding more will make it thicker.  I also like the nail forms.\nThe best I’ve used so far\n7pcs Pearl Hair Clips Large Hair Clips Pins Barrette Ties Hair Headwear Barrette for Party Wedding Daily, Gift for Girls and Women\nMEETWIN\n{'Package Dimensions': '7.5 x 3.5 x 0.2 inches; 1.76 Ounces', 'UPC': '723668014119'}\nThese are very pretty to jazz up your hairstyle. I love the big clips very easy to open and close also holds a of hair. None of the pearls were scratch or peeling. Definitely worth getting.\nBeautiful Pearl accessories\nCurly Girl Hair Spray Bottle – Ultra Fine Extended Water Mister for Curly Hairstyling, Care and Moisturizing (10 Fl. Oz. & 24 Fl. Oz Set, Swirls White Top)\nCurly Girl\n{'Brand': 'Curly Girl', 'Color': 'Swirls White Top', 'Number of Items': '1', 'Special Feature': 'Mist Spray', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '11.06 x 6.14 x 3.39 inches; 6.74 Ounces', 'UPC': '853356005850', 'Manufacturer': 'Curly Girl'}\n[[VIDEOID:7fc8bfe19a29a244cf5bea86c34ad870]] I absolutely love this bottle.  With the mist spray water isn’t dripping everywhere. I don’t have to keep refilling it up every day like I do with the regular spray bottle. Every easy to use just fill up with water put on the nozzle and spray where you like.\nEvery curly hair girl or guy needs this!\nShort Bob Wig Human Hair Pixie Cut Wigs Natural Color Lace Wigs 100% Virgin Huam Hair Lace Front Side Part Wigs for Women\nMarchQueen\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'MarchQueen', 'Package Dimensions': '12.64 x 8.86 x 2.05 inches; 5.61 Ounces', 'UPC': '779303841725'}\nSuch a cute wig the hair wasn't soft as I thought it was be but its very nice.  Earrings and wig cap came with the bob wig, no smell, lightweight, and little to no shedding.  Very easy to install nice short cut cute for a quick look on the go and or summer style.\nSo Cute !",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Focus**: The user is enhancing their focus on versatile beauty tools that cater to a variety of styles, specifically in hair care. Their recent purchase of a wig aligns with their interest in innovative yet practical solutions that offer quick and fashionable options for hairstyles.\n\n- **Aesthetic Preferences**: Vibrant colors and striking designs remain essential for the user, as demonstrated by their choice in accessories that are both visually appealing and functional. They appreciate items that allow for creative expression while maintaining a chic appearance.\n\n- **Functionality**: Ease of use is crucial for the user, who favors products that streamline their beauty routines. Their recent acquisition underscores a preference for user-friendly items that are quick to install and suitable for various occasions.\n\n- **Quality Assessment**: The user exhibits a discerning taste for quality, valuing durability and effective design in their beauty items. Their reviews indicate a careful consideration of performance, with an expectation for high standards that meet their specific style needs.\n\n- **Sensory Awareness**: The user continues to prioritize beauty tools that align with an active lifestyle, valuing functionality alongside creative potential.\n\n- **Buying Habit**: Their purchasing decisions reflect a blend of elegance and practicality, indicative of an evolving interest in unique yet functional accessories that enhance both daily beauty routines and special looks. This highlights their dedication to quality and personalized care in beauty products.",
  "metrics": {
    "rouge1_f": 0.13027387120651368,
    "rouge2_f": 0.0014825796886582653,
    "rougeL_f": 0.06365655070318282,
    "meteor": 0.04825090470446321,
    "bleu1": 0.0057724708271733064,
    "bleu2": 0.0005964285257226655,
    "bleu3": 0.00013005672082650393,
    "bleu4": 6.078591696965579e-05,
    "bertscore_precision": 0.3469420075416565,
    "bertscore_recall": 0.44254741072654724,
    "bertscore_f1": 0.3889559209346771
  }
}