{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Red Pill, The\nReview Date: 2017/05/10\nCategories: Documentary, Cerebral, Compelling, Intense\nProduct Description: [\"When a feminist filmmaker sets out to document the mysterious and polarizing world of the Men's Rights Movement, she begins to question her own beliefs.\"]\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Cassie Jaye'], 'Producers': ['Cassie Jaye', 'Jake Acer', 'Paul R. Cavanaugh', 'Mike Cernovich', 'Evan Davies', 'Thomas P. Ingoglia', 'Nena Jaye', 'Anna Laclergue', 'Brian Snodgrass', 'Tanja Snodgrass'], 'Starring': ['Cassie Jaye', 'Paul Elam', 'Dr. Warren Farrell']}\nReview Text: Certainly there are still problems for women, however, men have them too and hardly anyone is talking about these problems and if you do you are violently shouted down.\nReview Title: Chilling\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Big Year\nSteve Martin  (Actor),     Jack Black  (Actor),     David Frankel  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'Steve Martin, Jack Black and Owen Wilson star in this smart, funny comedy from the director of THE DEVIL WEARS PRADA and MARLEY & ME. Looking to shake up their routine lives, three amateur bird watchers compete to become the ultimate \"birder\" by spotting the greatest number of species within a single calendar year. But the friendly rivalry soon turns into a hilariously complicated cross-country adventure as each man begins to realize that the quest for success comes at a price and that\\'s not chicken feed!', 'Amazon.com', 'Never get between a birder and a Pink-footed Goose. As we learn from', 'The Big Year', ', the intensity of birders (the term', 'birdwatcher', \"is dismissed here as insufficiently committed) is not to be taken lightly, and their quest of rare species creates the gentle comedy of this film, which is based on a real phenomenon. In the world of birders, there's a goal set each calendar year, and based on the honor system: who can spot the most varieties of our feathered friends? All-time champ Kenny Bostick (Owen Wilson) is a legendary name in the birding game, and this year he's trying to beat his own record--but retired CEO Stu Preissler (Steve Martin) and slovenly upstart Brad Harris (Jack Black) are determined to topple the colorful and ruthless Bostick from his, er, perch. The movie's at its best when charting the movements of these obsessed enthusiasts in the wild, as they scramble from Alaska to Arizona to New Jersey in pursuit of their goal; it's less successful at trying to create human interest in the home lives of these guys. And despite the comedic talents of the main threesome, nobody really stands out; each plays to his usual persona without adding a new wrinkle. Director David Frankel (\", 'The Devil Wears Prada', \") has a weirdly overqualified supporting cast on his hands, but except for Rosamund Pike as Bostick's neglected wife and Rashida Jones as a geeky birder, most of these folks flit by with little to do: Brian Dennehy and Dianne Wiest as Brad's parents, Anjelica Huston as a salty sea captain, Tim Blake Nelson as an awestruck birder. It's easy enough to enjoy this film for its offbeat subject and mild-mannered tone, even if there isn't anything terribly distinctive about it.\", '--Robert Horton']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'David Frankel, Steve Martin, Owen Wilson, Jack Black', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 0.8 Ounces', 'Item model number': '25148863', 'Director': 'David Frankel', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'January 31, 2012', 'Actors': 'Steve Martin, Jack Black, Owen Wilson', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nWhen I saw this movie the first thing I thought was &#34;this is an actual thing? People do this?&#34;  I had no idea birders took their hobby so seriously.  One of the funniest movies I've seen.\nSo underrated\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['Christopher Eccleston', 'Billie Piper'], 'Studio': ['BBC America']}\nThe show is a little bit campy, but I think that's just because it's British.  Very good show overall, looking forward to the next seasons.\nNew Whovian.\nAngel\nScience Fiction, Suspense, Drama, Action\n['The Angel Investigations team is stunned when the Senior Partners of Wolfram and Hart give them control of the L.A. office.']\n{'Content advisory': ['Violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James A. Contner', 'Joss Whedon', 'David Greenwalt', 'Tim Minear', 'Bill Norton', \"Terrence O'Hara\", 'Skip Schoolnik', 'Marita Grabiak', 'Vern Gillum', 'David Grossman'], 'Starring': ['David Boreanaz', 'Charisma Carpenter', 'Alexis Denisof']}\nEverything by him is pure gold, If you liked Buffy then you'll love this. If you haven't watched Buffy you need to.\nIt's by Joss Whedon\nLost Girl: Season 3 [Blu-ray]\nAnna Silk  (Actor),     Ksenia Solo  (Actor),     Various  (Director)    &                   0                  more   Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['In the wake of the battle with the Garuda, Bo finds herself experiencing strange new appetites – and increasingly evil urges. Ever loyal Lauren and the Succubus get serious about their relationship, but keeping up with Bo proves to be no easy task. Meanwhile, Kenzi continues to struggle with being human in a Fae world, Hale is named the acting Ash, and Dyson’s new partner – a Valkyrie vixen known as Tamsin – has her sights set on Bo. To make matters worse, Trick reveals that Bo’s strange behavior is a result of The Dawning, a clandestine rite of passage that determines the fate of the each and every Fae. As Bo rushes to prepare for the ritual that will decide her future, a mysterious being known as the Wanderer makes his powerful presence felt. Should Bo survive long enough to decipher the riddle of this enigmatic visitor, she may unlock the long-sought secrets of her own dark past!']\n{'Genre': 'Horror/Television', 'Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Contributor': 'Rachel Skarsten, Zoie Palmer, K. C. Collins, Ksenia Solo, Anna Silk, Various, Kris Holden-Ried, Rick HowlandRachel Skarsten, Zoie Palmer, K. C. Collins, Ksenia Solo, Anna Silk, Various, Kris Holden-Ried, Rick Howland  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': 'FUP9117BR', 'Director': 'Various', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '9 hours and 32 minutes', 'Release date': 'November 19, 2013', 'Actors': 'Anna Silk, Ksenia Solo, Kris Holden-Ried, Rick Howland, Zoie Palmer', 'Studio': 'Prodigy Pictures', 'Number of discs': '3'}\nIf you're not watching this show you need to be.  Excellent cast of characters, amazing writing, I only wish there were more episodes, a 13 episode season is far too short.\nBrilliant\nLost Girl: Season 2 [Blu-ray]\nAnna Silk  (Actor),     Ksenia Solo  (Actor),     Steve DiMarco  (Director),     Lee Rose  (Director)    &                   1                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Product Description', \"Bo is a gorgeous renegade. An irresistible beauty. And a deadly succubus. For years, she had no idea what she was - or why every new lover died in the throes of passion. She fled one corpse after another until a chance encounter with the puckish thief Kenzi exposed Bo's existence to the clandestine order of the Fae. This ancient society of supernatural freaks exists outside the realm of mere mortals. Within their world, there are only two sides: Light and Dark. Each member of the Fae must choose who they will serve. But not Bo. Driven to understand her own aura of desire, Bo vows to live on her own terms - even if it means existing in the abyss between good and evil. With the help of the mischievous, but loyal, Kenzi and the handsome shape-shifter Dyson, Bo will use her powers of seduction to unravel the riddle of her mysterious past.\", 'Set Contains:', 'Uncut - featuring footage not seen on SYFY', 'Uncut - featuring footage not seen on SYFY', '60 minutes of extras featuring cast interviews, Making of Lost Girl featurettes, and bloopers', '60 minutes of extras featuring cast interviews, Making of Lost Girl featurettes, and bloopers', 'Episodes may be watched in English subtitles for the hearing impaired', 'Episodes may be watched in English subtitles for the hearing impaired']\n{'Genre': 'Horror/Television', 'Format': 'Multiple Formats, Blu-ray, Box set, NTSC, Widescreen', 'Contributor': 'David Greene, Lee Rose, Zoie Palmer, K. C. Collins, Gail Harvey, Ksenia Solo, Anna Silk, Steve DiMarco, Kris Holden-Ried, Richard HowlandDavid Greene, Lee Rose, Zoie Palmer, K. C. Collins, Gail Harvey, Ksenia Solo, Anna Silk, Steve DiMarco, Kris Holden-Ried, Richard Howland  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': '25752872', 'Director': 'Steve DiMarco, Lee Rose, Gail Harvey, David Greene', 'Media Format': 'Multiple Formats, Blu-ray, Box set, NTSC, Widescreen', 'Run time': '16 hours and 8 minutes', 'Release date': 'November 13, 2012', 'Actors': 'Anna Silk, Ksenia Solo, Kris Holden-Ried, Richard Howland, Zoie Palmer', 'Studio': 'Giant Ape', 'Number of discs': '5'}\nCanadian import that unfortunately means you have to wait for it to be licensed in the US, however it it well worth the wait.\nWatch this show\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Producers': ['Steven Moffat', 'Marcus Wilson', 'Sanne Wohlenberg', 'Piers Wenger', 'Beth Willis'], 'Starring': ['Matt Smith', 'Karen Gillan', 'Arthur Darvill']}\nOne of my new favorite shows. Just don't try and think too deeply about if the time travel makes sense.\nOne of my new favorite shows. Just don't try and think too deeply ...\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dean Holland', 'Michael Schur', 'Ken Whittingham', 'Troy Miller', 'Randall Einhorn', 'Morgan Sackett', 'Craig Zisk', 'Tristram Shapeero', 'Michael Trim', 'Nicole Holofcener'], 'Starring': ['Amy Poehler', 'Rashida Jones', 'Aziz Ansari'], 'Studio': ['NBC']}\nIt's funny, watch it.\nExcellent show.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Jason Moore'], 'Producers': ['Paul Brooks', 'Elizabeth Banks', 'Max Handelman'], 'Starring': ['Anna Kendrick', 'Skylar Astin', 'Rebel Wilson'], 'Studio': ['Universal Pictures']}\nFunny and clever. Watch it.\nFive Stars\nCarrie (Blu-ray + DVD + Digital HD with UltraViolet)\nChloë Grace Moretz  (Actor),     Judy Greer  (Actor),     Kimberly Peirce  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Chloe Grace Moretz and Academy Award nominee Julianne Moore star in this exhilarating reimagining of Stephen Kings iconic best seller. After merciless taunting from classmates and abuse at the hand of her religious fanatic mother (Moore), Carries (Mortez) anger and her telekinetic powers are unleashed. And when a prom prank goes horribly wrong, events spiral out of control until the terrifying conclusion of this powerful, pulse-quickening horror story.']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Ultraviolet, Subtitled, Widescreen, Blu-ray, Ultraviolet, Digital_copyMultiple Formats, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Ultraviolet, Subtitled, Widescreen, Blu-ray, Ultraviolet, Digital_copy   See more', 'Contributor': 'Ansel Elgort, Kimberly Peirce, Kevin Misher, Chloë Grace Moretz, Roberto Aguirre-Sacasa, Judy Greer, Lawrence D. Cohen, Portia Doubleday, Julianne Moore, Gabriella Wilde, Alex Russell, Barry Shabaka HenleyAnsel Elgort, Kimberly Peirce, Kevin Misher, Chloë Grace Moretz, Roberto Aguirre-Sacasa, Judy Greer, Lawrence D. Cohen, Portia Doubleday, Julianne Moore, Gabriella Wilde, Alex Russell, Barry Shabaka Henley   See more', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'FOXS129375BR', 'Director': 'Kimberly Peirce', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Ultraviolet, Subtitled, Widescreen, Blu-ray, Ultraviolet, Digital_copy', 'Release date': 'January 14, 2014', 'Actors': 'Chloë Grace Moretz, Judy Greer, Portia Doubleday, Alex Russell, Gabriella Wilde', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Kevin Misher', 'Studio': 'Mgm (Video & DVD)', 'Writers': 'Lawrence D. Cohen, Roberto Aguirre-Sacasa', 'Country of Origin': 'USA', 'Number of discs': '2'}\nIt's basically the same movie as the original, just set in 2013.\nFive Stars\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Alan Taylor'], 'Producers': ['David Ellison', 'Dana Goldberg', 'Bil Carraro', 'Laeta Kalogridis'], 'Starring': ['Arnold Schwarzenegger', 'Jason Clarke', 'Emilia Clarke']}\nIt wasn't exactly terrible, what it was was a movie that didn't need to be made. The first two were really all that was needed. The third one was actually decent and made sense within the timeline. This just got made because they wanted to make another Terminator movie for the money.\nIt wasn't exactly terrible, what it was was a movie that didn't ...\nRed Pill, The\nDocumentary, Cerebral, Compelling, Intense\n[\"When a feminist filmmaker sets out to document the mysterious and polarizing world of the Men's Rights Movement, she begins to question her own beliefs.\"]\n{'Content advisory': ['Nudity', 'violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Cassie Jaye'], 'Producers': ['Cassie Jaye', 'Jake Acer', 'Paul R. Cavanaugh', 'Mike Cernovich', 'Evan Davies', 'Thomas P. Ingoglia', 'Nena Jaye', 'Anna Laclergue', 'Brian Snodgrass', 'Tanja Snodgrass'], 'Starring': ['Cassie Jaye', 'Paul Elam', 'Dr. Warren Farrell']}\nCertainly there are still problems for women, however, men have them too and hardly anyone is talking about these problems and if you do you are violently shouted down.\nChilling",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user maintains a strong affinity for *comedy films* and *British shows*, while also embracing *sci-fi*, *drama*, *fantasy*, and *horror-themed television*. They continue to appreciate narratives that explore character depth and supernatural elements, recently showing an interest in thought-provoking documentaries.\n\n- **Preferred Themes**: They enjoy *humorous takes* on niche activities and are increasingly drawn to stories that challenge societal narratives, as evidenced by recent engagements. Their love for time travel and reimagined horror classics persists, with a keen eye on emotional and cerebral storytelling.\n\n- **Content Preference**: The user favors narratives that blend *comedy with heartfelt moments*, highlighting character development, particularly in ensemble casts. They seek high-quality world-building paired with fantasy elements, radiating joy and humor through their media consumption.\n\n- **Ratings**: Known for awarding *high ratings (4.5-5 stars)*, the user has recently adopted a more critical perspective, evident in their thoughtful reviews. A recent documentary received a high rating, showing their ability to appreciate compelling content that challenges conventional views.\n\n- **Engagement Style**: The user reviews with enthusiasm, focusing on character arcs and narrative twists while constructively critiquing weaker elements. \n\n- **Overall Attitude**: With a curious and discerning outlook, the user actively seeks media that blends humor, horror, and adventure, valuing innovative storytelling that resonates and provokes discussion. Their latest interactions reflect a broader exploration of social issues within their media choices.",
  "metrics": {
    "rouge1_f": 0.09035409035409035,
    "rouge2_f": 0.0032586558044806523,
    "rougeL_f": 0.03988603988603988,
    "meteor": 0.026298077680908114,
    "bleu1": 2.114729931961382e-05,
    "bleu2": 4.859291849795649e-06,
    "bleu3": 7.610736025790189e-07,
    "bleu4": 3.014415889671866e-07,
    "bertscore_precision": 0.37117505073547363,
    "bertscore_recall": 0.48755836486816406,
    "bertscore_f1": 0.42148005962371826
  }
}