{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/04/01\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jake Kasdan'], 'Producers': ['Matt Tolmach', 'William Teitler'], 'Starring': ['Dwayne Johnson', 'Kevin Hart', 'Jack Black'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nReview Text: I refused to watch this for years (Idk why, I like all the actors a lot) but then my daughter got me to finally watch it and I ended up really liking it. I was laughing a lot throughout it. Surprisingly interesting!\nReview Title: Didn't want to see it\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Kris Greengrove', 'Susan Holden', 'Steve Oakes', 'David Starr', 'Richard Winkler', 'Soo Kim', 'Jennifer Twomey', 'Marcy Pritchard', 'Amy Steinberg', 'Max Goodman'], 'Studio': ['CBS']}\nSuch a cute show, my 4 old loves it! I've noticed she developed an interest in math and patterns after starting this show...love that!\nFun and catchy songs!\nJurassic Park Collection (Jurassic Park / The Lost World: Jurassic Park / Jurassic Park III / Jurassic World)\nJeff Goldblum  (Actor),     Chris Pratt  (Actor),     Colin Trevorrow  (Director, Writer),     Joe Johnston  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Steven Spielberg returns to executive produce the long-awaited next installment of his groundbreaking Jurassic Park series, Jurassic World, an epic action-adventure.']\n{'Aspect Ratio': '2.20:1, 2:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.75 x 1 inches; 11.2 Ounces', 'Item model number': '35222591', 'Director': 'Colin Trevorrow, Joe Johnston, Steven Spielberg', 'Media Format': 'Box set, Color, Widescreen, Blu-ray, Digital_copy', 'Run time': '12 hours and 6 minutes', 'Release date': 'October 20, 2015', 'Actors': 'Jeff Goldblum, Chris Pratt, Sam Neill, Laura Dern, Bryce Dallas Howard', 'Subtitles': 'French, Spanish', 'Producers': 'Frank Marshall, Steven Spielberg, Patrick Crowley, Larry Franco, Kathleen Kennedy', 'Language': 'English (DTS-HD Master Audio 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD 2.0), French (DTS 5.1), French Canadian (DTS 5.1), Spanish (DTS 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Rick Jaffa, Amanda Silver, Peter Buchman, Derek Connolly, Colin Trevorrow', 'Number of discs': '6'}\nWe have had this set for a while now and it's great! I'm sorry, I'm not a person that knows all the tech details but from my perspective it's<br />the picture quality, value and the nerd factor of having the collection🤓🐊\nfrom my perspective it's the picture quality, value and the nerd factor\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '한국어', '日本語', 'العربية', 'Português', 'Nederlands', 'Deutsch', 'Русский', 'हिन्दी', 'Español (España)', 'Indonesia', 'Español (Latinoamérica)', 'Polski', 'Türkçe', '中文（台灣）', '中文（中国）', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Cam Lizotte', 'Nico Rijgersberg', 'Jay Silver', 'Joshua Young', 'Gilly Fogg'], 'Producers': ['Kristen Newlands', 'Phillip Stamp', 'Dr. Alice Wilder', 'Steven Denure', 'Shevaun Gray', 'Anne Loi', 'Margaret Harrison', 'Wendy Harris', 'Samantha Freeman'], 'Starring': ['DevanCohen', 'Ava Close', 'Elizabeth Hanna'], 'Studio': ['Amazon Studios']}\nI do think it's a cute show and I like that it's clean and sweet. My 7 year old loves it!<br /><br />But the singing reeeeeaallly gets to me. I wondered if I was the only one but I see from other season/episode reviews that I'm not🤔<br /><br />Other than that, it's worthy of 5 stars, in my opinion🙄\nSorry but the singing makes me want to rate it much lower\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Walt Dohrn'], 'Producers': ['Gina Shay'], 'Starring': ['Sam Rockwell', 'Caroline Hjelt', 'Anthony Ramos'], 'Studio': ['Universal Pictures']}\nI think most Trolls fans will love it (definitely the kiddos). I like the message it gives about people in our world (well their world) being different but we still need each other. I don't have much that I don't like about it. Overall love it and the music but the 2 things I feel are slight, personal disappointments:<br /><br />-Renting price: Mixed feelings. Had we seen it in theater we would have easily spent 3 times the amount for one showing (at a dine-in theater) so that's definitely cheaper...but, I guess I had in my mind it was going to be like Onward and have the ability to rent or buy. I'm thankful for the ability to see it since we had been excited for it for while...and a bit of fun to a difficult time. But we likely won't be able to rent it again after this time. So mixed feelings- thankful for the ability of watching it…but also kind of bummed that it still feels a bit expensive, during this time, to rent it. No one made me rent it though still sharing my personal viewpoint 🤔<br /><br />-Second: I'm not really strict about kids movies but I am getting tired of kids movies having butt jokes/showing butts… of course it cracks my kiddo up lol ugh BUT why is it necessary😒 There's not too much in this one- I think there were just a couple, still though...there are many other ways to make them laugh!<br /><br />ANYWAY, off my soapbox now. I did actually love the movie. We're currently watching it for the third time. My 9 year old is for sure enjoying it!\nWe're loving it! Though a little mixed feelings about renting\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jake Kasdan'], 'Producers': ['Matt Tolmach', 'William Teitler'], 'Starring': ['Dwayne Johnson', 'Kevin Hart', 'Jack Black'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nI refused to watch this for years (Idk why, I like all the actors a lot) but then my daughter got me to finally watch it and I ended up really liking it. I was laughing a lot throughout it. Surprisingly interesting!\nDidn't want to see it",
  "profile": "The user exhibits a strong preference for engaging, educational content tailored for young children, with a particular focus on shows that blend music and learning, especially in math and patterns. Their child’s growing interest in math drives this focus on educational value, alongside a fondness for family-friendly programming featuring fun songs. While previous interactions indicate consistently high ratings for quality programming, a recent mixed review suggests a developing critical perspective on content quality.\n\nIn their latest review, the user expressed delight in a children's film that conveyed a valuable message about diversity and connection, despite some reservations regarding the rental price and the presence of immature humor. Ultimately, their overall enjoyment led to a high rating, reinforcing their appreciation for quality, relatable content that engages both children and parents.\n\nFurthermore, the user has begun exploring adult-oriented content that prioritizes exceptional picture quality and intellectual depth, showcasing a desire for entertainment that encourages family discussions. This evolution illustrates their expanded viewing habits, while still maintaining a strong emphasis on entertaining, educational, and high-quality programming for both children and adults. The user remains discerning, particularly towards content that does not align with their elevated standards. Overall, they value a blend of fun, learning, and meaningful narratives in their media consumption.",
  "metrics": {
    "rouge1_f": 0.15505226480836237,
    "rouge2_f": 0.013961605584642234,
    "rougeL_f": 0.07317073170731707,
    "meteor": 0.05064815389094767,
    "bleu1": 0.002541049532233805,
    "bleu2": 0.0008134119807819058,
    "bleu3": 0.00037301503014526945,
    "bleu4": 0.00019213787662585128,
    "bertscore_precision": 0.31144073605537415,
    "bertscore_recall": 0.4232217073440552,
    "bertscore_f1": 0.3588273227214813
  }
}