{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Makeup Brush Holder OCHEAL Folding Brush Carrying Case Makeup Brush Rolling Pouch Great Makeup Kit Organizer Well-sized Slots for Variety of Brushes and Tools,Brush Not Include(Coffee)\nReview Date: 2017/10/26\nStore: OCHEAL\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.69 x 9.02 x 1.42 inches; 5.61 Ounces'}\nReview Text: not great for long brushes\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Ebingoo Blonde Ombre Lace Front Wigs Side Part Natural Long Wave Synthetic Heat Resistant Fiber Wig for Women 24 Inch\nEbingoo\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.5 x 1.89 x 1.5 inches; 8.8 Ounces', 'UPC': '736950486662'}\ngood wig\nFour Stars\nEbingoo Free Part Copper Red Long Natural Wave Synthetic Lace Front Wig 20inch\nEbingoo\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Brand': 'Ebingoo', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 6.3 x 1.8 inches; 12.64 Ounces', 'UPC': '711420424085'}\ngood hair\nFour Stars\nZeny Pro 2in1 Hot Salon Ozone Facial Steamer w/ 5x Desktop LED Magnifying Magnifier Floor Lamp Combo (#1)\n{'Package Dimensions': '28 x 13 x 8.5 inches; 10 Pounds'}\nflimsy but it works\nTwo Stars\nEbingoo 613 Platinum Blonde Wig Wavy Blond Plucked Middle Part Long Natural Straight Synthetic Lace Front Wigs for Women 24 inch\nEbingoo\n{'Material': 'synthetic', 'Hair Type': 'Straight', 'Brand': 'Ebingoo', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 5.8 x 1.8 inches; 9.6 Ounces', 'UPC': '736950484866 784190541290'}\nnice\nFour Stars\nShort Wavy Synthetic Lace Front Bob Wigs For Women Natural Black Glueless Lace Front Wig With Baby Hair\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Age Range (Description)': 'Adult'}\ngood wig. Could be less pricey\nFour Stars\nSilike 22\" Mini Lace Front Wigs Ombre Synthetic Fashion Blonde 3 Tone Long Wavy Curly Wigs For Women Big Discount\nSilike\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.04 x 6.93 x 2.76 inches; 8.8 Ounces'}\nnice wig for the price\nFour Stars\nMakeup Brush Cleaner Wloomm Electric Makeup Brush Cleaner And Dryer Tool Kits in Seconds for All Makeup Brushes Cleaning\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.13 x 4.33 x 6.5 inches; 11.99 Ounces', 'Item model number': 'BC0001', 'Batteries': '2 AA batteries required.', 'UPC': '611864350042'}\nit is a little tedious to chance the holder for the brushes. But, it does the best and fasted cleaning of my brushes ever! And they dry so much faster\nit is a little tedious to chance the holder for the brushes\nMakeup Brush Holder OCHEAL Folding Brush Carrying Case Makeup Brush Rolling Pouch Great Makeup Kit Organizer Well-sized Slots for Variety of Brushes and Tools,Brush Not Include(Coffee)\nOCHEAL\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.69 x 9.02 x 1.42 inches; 5.61 Ounces'}\nnot great for long brushes\nThree Stars",
  "profile": "**User Profile Summary:**\n\n- **Product Type Preference**: Wigs remain a primary focus, with a strong preference for lace front and synthetic varieties, alongside an expanding interest in beauty tools and accessories.\n- **Style Preference**: The user favors natural-looking styles with wave patterns; preferred shades include blonde, ombre, and copper red, while showing increasing openness to bolder colors.\n- **Purchase Behavior**: The user consistently seeks quality and affordability, reflected by a positive trend in beauty tools, evidenced by a recent 4.5 rating for a makeup brush holder, although receiving a cautious 3.0 rating for its suitability for longer brushes. The average rating for wig purchases is 3.3, indicating a careful approach to non-wig products due to past dissatisfaction (2.0 rating).\n- **Rating Consistency**: This user generally provides positive feedback on wig functionality and aesthetics, with an improving sentiment toward beauty tools. Recent reviews suggest a selective and more favorable exploration of beauty products that align with their standards for performance and convenience.\n- **Review Characteristics**: Prefers concise, effective feedback showcasing confidence in assessed quality. Recent interactions highlight a strategic selection of beauty items that complement their primary focus on stylish wigs, reflecting a balance of reliability and affordability across purchases.\n\nThe user remains committed to stylish wigs while progressively venturing into compatible beauty tools that meet their evolving expectations.",
  "metrics": {
    "rouge1_f": 0.1775700934579439,
    "rouge2_f": 0.015625,
    "rougeL_f": 0.08099688473520249,
    "meteor": 0.08317703447467167,
    "bleu1": 0.058231016281800455,
    "bleu2": 0.008601521128713076,
    "bleu3": 0.0021130871043045533,
    "bleu4": 0.0010483138901705787,
    "bertscore_precision": 0.34166666865348816,
    "bertscore_recall": 0.3575747013092041,
    "bertscore_f1": 0.34943971037864685
  }
}