{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Makeup Brush Cleaner Wloomm Electric Makeup Brush Cleaner And Dryer Tool Kits in Seconds for All Makeup Brushes Cleaning\nReview Date: 2017/10/20\nAverage Rating: 3.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.13 x 4.33 x 6.5 inches; 11.99 Ounces', 'Item model number': 'BC0001', 'Batteries': '2 AA batteries required.', 'UPC': '611864350042'}\nReview Text: it is a little tedious to chance the holder for the brushes. But, it does the best and fasted cleaning of my brushes ever! And they dry so much faster\nReview Title: it is a little tedious to chance the holder for the brushes\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Ebingoo Blonde Ombre Lace Front Wigs Side Part Natural Long Wave Synthetic Heat Resistant Fiber Wig for Women 24 Inch\nEbingoo\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.5 x 1.89 x 1.5 inches; 8.8 Ounces', 'UPC': '736950486662'}\ngood wig\nFour Stars\nEbingoo Free Part Copper Red Long Natural Wave Synthetic Lace Front Wig 20inch\nEbingoo\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Brand': 'Ebingoo', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 6.3 x 1.8 inches; 12.64 Ounces', 'UPC': '711420424085'}\ngood hair\nFour Stars\nZeny Pro 2in1 Hot Salon Ozone Facial Steamer w/ 5x Desktop LED Magnifying Magnifier Floor Lamp Combo (#1)\n{'Package Dimensions': '28 x 13 x 8.5 inches; 10 Pounds'}\nflimsy but it works\nTwo Stars\nEbingoo 613 Platinum Blonde Wig Wavy Blond Plucked Middle Part Long Natural Straight Synthetic Lace Front Wigs for Women 24 inch\nEbingoo\n{'Material': 'synthetic', 'Hair Type': 'Straight', 'Brand': 'Ebingoo', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 5.8 x 1.8 inches; 9.6 Ounces', 'UPC': '736950484866 784190541290'}\nnice\nFour Stars\nShort Wavy Synthetic Lace Front Bob Wigs For Women Natural Black Glueless Lace Front Wig With Baby Hair\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Age Range (Description)': 'Adult'}\ngood wig. Could be less pricey\nFour Stars\nSilike 22\" Mini Lace Front Wigs Ombre Synthetic Fashion Blonde 3 Tone Long Wavy Curly Wigs For Women Big Discount\nSilike\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.04 x 6.93 x 2.76 inches; 8.8 Ounces'}\nnice wig for the price\nFour Stars\nMakeup Brush Cleaner Wloomm Electric Makeup Brush Cleaner And Dryer Tool Kits in Seconds for All Makeup Brushes Cleaning\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.13 x 4.33 x 6.5 inches; 11.99 Ounces', 'Item model number': 'BC0001', 'Batteries': '2 AA batteries required.', 'UPC': '611864350042'}\nit is a little tedious to chance the holder for the brushes. But, it does the best and fasted cleaning of my brushes ever! And they dry so much faster\nit is a little tedious to chance the holder for the brushes",
  "profile": "**User Profile Summary:**\n\n- **Product Type Preference**: Wigs, particularly favoring lace front and synthetic options, along with a growing interest in beauty tools.\n- **Style Preference**: Natural-looking styles with wave patterns; favored shades include blonde, ombre, and copper red, with an increasing openness to bolder colors.\n- **Purchase Behavior**: The user consistently seeks quality and affordability in wig purchases, evidenced by high satisfaction with a recent 5.0 rating for a makeup brush cleaner, reflecting a willingness to engage with beauty tools despite previous reservations. The average rating for wig purchases is 3.3, indicating a cautious approach to non-wig products stemming from a prior dissatisfaction (2.0 rating). \n- **Rating Consistency**: Generally positive ratings indicate satisfaction with wig functionality and aesthetics. The user's sentiment towards beauty tools shows improvement, with the latest review highlighting efficient performance and faster results, suggesting a more favorable view of carefully chosen beauty products.\n- **Review Characteristics**: Prefers concise and effective feedback in reviews. Recent interactions showcase confidence in product quality and a selective exploration of new beauty items, reinforcing their primary focus on stylish wigs that enhance their appearance while balancing reliability and affordability across all purchases.\n\nThe user remains dedicated to stylish wigs while gradually expanding their interest in compatible beauty tools that meet their standards.",
  "metrics": {
    "rouge1_f": 0.1692573402417962,
    "rouge2_f": 0.01733102253032929,
    "rougeL_f": 0.08981001727115717,
    "meteor": 0.08386883757109964,
    "bleu1": 0.06265601110157515,
    "bleu2": 0.003138728281391841,
    "bleu3": 0.0011585108513474645,
    "bleu4": 0.0007045095961456427,
    "bertscore_precision": 0.346431702375412,
    "bertscore_recall": 0.35465458035469055,
    "bertscore_f1": 0.350494921207428
  }
}