{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: LIAZAHAIR Deep Curly Brazilian Virgin Hair Lace Front Wig With Baby Hair Pre-Plucked Natural Hairline Wigs For Ladies\nReview Date: 2018/06/06\nAverage Rating: 3.5\nProduct Details: {'Material': 'Human', 'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.9 x 7.6 x 2.4 inches; 11.36 Ounces', 'UPC': '788988045717'}\nReview Text: This is my first 100% human haired wig, I usually buy synthetic blends. I love the way this hair feels, it feels so soft & the density of this hair is just right, it’s not too thick or thin. The part is already pre-plucked, but I’ll likely customize it further &  dye the hair black because it’s too brown for my liking. Other than that, this wig is perfect.\nReview Title: I love the way this hair feels\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mini Women’s Facial Painless Hair Remover Women Hair Removal Skin Soft Electric Lipstick Shape Light Hair Removal Tool\n{'Package Dimensions': '8.74 x 6.5 x 1.73 inches; 3.42 Ounces'}\nIt’s sucks, doesn’t work no matter how many times I change the batteries\nOne Star\nLIAZAHAIR Deep Curly Brazilian Virgin Hair Lace Front Wig With Baby Hair Pre-Plucked Natural Hairline Wigs For Ladies\n{'Material': 'Human', 'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.9 x 7.6 x 2.4 inches; 11.36 Ounces', 'UPC': '788988045717'}\nThis is my first 100% human haired wig, I usually buy synthetic blends. I love the way this hair feels, it feels so soft & the density of this hair is just right, it’s not too thick or thin. The part is already pre-plucked, but I’ll likely customize it further &  dye the hair black because it’s too brown for my liking. Other than that, this wig is perfect.\nI love the way this hair feels",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Type Preference:** The user shows an interest in women's personal care, particularly hair removal products, and demonstrates a growing interest in hair-related products, specifically human hair wigs.\n- **Satisfaction Level:** The user has a low tolerance for ineffective products, previously indicated by a very low satisfaction rating (1 star). However, they have recently given a high satisfaction rating (5 stars) for a wig, suggesting more favorable experiences in the hair product category.\n- **Functionality Expectation:** The user expects products to perform effectively. While there was disappointment with previous purchases that did not meet expectations, the recent review illustrates a positive experience with the wig, praised for its softness and feel, indicating a potential shift in expectations regarding hair products.\n- **Quality Consciousness:** The user values quality and reliability, highlighted by their detailed feedback regarding the wig's characteristics and their intent to customize it further. This reinforces their preference for products that deliver consistent and satisfying results.\n- **Review Tone:** The user communicates in a straightforward style, previously blunt and negative, but the recent interaction reflects a more positive appreciation, suggesting a possible adjustment to their review tone when satisfied.\n\nOverall, the user favors effective and reliable personal care tools, has recently expanded their interests into quality hair products, and is willing to express satisfaction when a product meets their standards.",
  "metrics": {
    "rouge1_f": 0.2019704433497537,
    "rouge2_f": 0.034653465346534656,
    "rougeL_f": 0.11330049261083742,
    "meteor": 0.14779350541215652,
    "bleu1": 0.1672473867595819,
    "bleu2": 0.054073148261681185,
    "bleu3": 0.021728987192904975,
    "bleu4": 0.007752647324671644,
    "bertscore_precision": 0.40832024812698364,
    "bertscore_recall": 0.41823330521583557,
    "bertscore_f1": 0.41321733593940735
  }
}