{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/03/26\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Mario Van Peebles', 'Peter Medak', 'Christine Moore', 'Sarah Pia Anderson', 'Ali Selim', 'Stephen Surjik', 'Tim Hunter', 'Kate Woods', 'Ben Watkins'], 'Producers': ['Ben Watkins', 'Marc Forster', 'Brian Wilkins', 'Ron Perlman', 'Jim Dunn', 'Sam Ernst', 'Michael Angeli', 'Jillian Kugler', 'Craig Siebels', 'Shernold Edwards', 'Erik Lee'], 'Starring': ['Ron Perlman', 'Dana Delany', 'Andre Royo'], 'Studio': ['Amazon Studios']}\nReview Text: Wildly eclectic story that doesn't fit neatly into any particular genre and is sure to find a niche audience who will just love it.  More like a spy drama than a crime story, it attracts viewers who like character studies as well as intrigue.  It requires your patience, your attention, and a willingness to be wrong as you make predictions about what happens next.  The story is so skillfully layered.  It mainly focuses on the frailties of the powerful and the dynamics of the selfish and self serving people they attract but there's so much more to it.  I just LOVE it.  Of course, the acting is excellent.  The Harris' are cast with perfection.  The tweeking preacher is a stroke of genius as he is an all too common reality.  I suspect his delusions will enter into the story as they develop along with his addiction, ooo.  The writers are so much more clever and courageous than most and I hope I am not made to wait in vain for the completion of the story.  It is one of those tales that is full of surprises.  It is just too good to drop!  Niche audiences matter too, ;)  I am sure that a production like this has staying power.  The story is unlikely to ever become irrelevant or dated.  While the masses aren't flocking to watch it now, it is a story that can continue to find an adoring audience over time.  I hope this will be taken into consideration when making decisions on the future of this production.\nReview Title: BRAVO!!!  MORE MORE MORE , PLEASE :)\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Blair'], 'Producers': ['David Snodin', 'Kate Harwood'], 'Starring': ['Gemma Arterton', 'Eddie Redmayne', 'Hans Matheson'], 'Studio': ['BBC America']}\nAll the drama and wickedness one can hope for in the long list of great British stories and productions. Certainly not your usual love story, that is for sure.\nSo sad\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Cote'], 'Producers': ['Bill Cote', 'John Cheshire', 'Carol Cote', 'Michael Gerber', 'Marianne McCune', 'Robert Watts'], 'Starring': ['GrahamHancock', 'RobertBauval', 'MichaelCremo'], 'Studio': ['UFOTV']}\nOh, my.  The gun loving egotist takes on science now.  Creationism has been crammed down the throats of a fearful Jane and John Q Public for more than 2000 years and many a scientist and healer has been murdered by the religious elite for helping us get off our knees and participate in our world.  It is the religious community who is force feeding their false doctrine, and, as they have done historically, they play the victim.<br />For hundreds of years, only the clergy were allowed to learn to read, write and perform experiments to better understand the nature of reality.  In industrialized parts of the world, almost anyone can read now.  That was a hard won fight.  Religion and science don't have to be enemies.  Scientists aren't calling for the end of Christianity.  Simply because science doesn't support religious stories, doesn't make the scientist the bad guy here.  Religion has a long history of the intentional misuse of information as it was once the major force of political power, created to keep you on your knees in service of the Lord, the King/Queen and the Pope.  Much like the Middle East today, only their mind control is Islam.<br />Science doesn't attack religion.  Religion is the bully here.  Science only illuminates.\nAnother bullying attack on scientists and sensibility.  Steer clear if you value education.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Timothy Van Patten', 'Allen Coulter', 'Jeremy Podeswa', 'Ed Bianchi', 'Brad Anderson', 'Alik Sakharov', 'Jake Paltrow', 'Simon Cellan Jones', 'Brian Kirk', 'Martin Scorsese'], 'Producers': ['Rudd Simmons', 'Terence Winter', 'Martin Scorsese', 'Tim Van Patten', 'Stephen Levinson', 'Mark Wahlberg'], 'Starring': ['Steve Buscemi', 'Michael Pitt', 'Kelly Macdonald'], 'Studio': ['HBO']}\nSorry is compelling and relevant.  There's an artistic quality that separates it from other stories of organized crime and government corruption setting it above the crowd.  I appreciate the rather undramatic approach taken to the violence.  Paired with displays of hedonistic self indulgence.  It allows us to think through the event rather than just a simple viceral respnse to blood and guts.  Well done!\nBrilliant production.\n{'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語', 'Português'], 'Directors': ['Woody Allen'], 'Producers': ['Erika Aronson', 'Helen Robin'], 'Starring': ['Woody Allen', 'Miley Cyrus', 'Elaine May']}\nStill suspect about the choice of Ms. Cyrus to play the revolutionary.  On the one hand, she will attract an important and large following of young minds.  This would make the choice clever.  On the other hand, the chemistry between the actors, which is always right on in Mr. Allen's films, is challenged by the Disney camera style that Ms. Cyrus is accustomed to.  The writing is pure Allen and there are, as always, many quotable and memorable moments that make this a really fun watch for those of us who love his openly neurotic, pensive and ultimately hilarious creations.  Love this one!\nClassic Woody Allen\nPrince Philip: The Plot to Make a King\nDocumentary\n['This is the inside story of the dynastic tensions that were unleashed when Princess Elizabeth, the future queen, fell in love with Prince Philip. Witness the complexities and frustrations of the royal marriage, as the monarch struggled to reconcile the love of her husband with the suspicions of her family and her government.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Sanders'], 'Producers': ['Richard Sanders', 'Denys Blakeway'], 'Starring': ['Tamsin Greig']}\nTypical, shallow documentary about an English royal.  Oddly enough, I was expecting it to contain more about him: how he adapted to the seeming effeminate role of King Consort would have made it interesting.  Otherwise, it is much like the pedigree of a fine stallion on film.  I sense he is a far more interesting person than this documentary presented.  From my recall of various events and instances where we have been given access to his thoughts and deeds he is rather hilarious in a quintessentially British way.  Observant, irreverent, quick, sporting, and lets face it, absolutely DASHING; that's what I was hoping would be highlighted.\nThis Man is FAR More Interesting Than the Documentary\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rowan Woods', 'Tony Krawitz'], 'Producers': ['Victoria Madden', 'Vincent Sheehan', 'Andy Walker', 'Penny Win'], 'Starring': ['Elizabeth Debicki', 'Matthew Le Nevez', 'Henry Nixon']}\nA compelling story, complete with layers of symbols however the use of red herrings gets a bit annoying.  Love the,performances and authenticity of the set.  A remarkable production.\nBrave attempt at a complex story\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Apted', 'Mikael Salomon', 'Allen Coulter', 'Alan Poul', 'Steve Shill', 'Timothy Van Patten', 'Alan Taylor', 'John Maybury', 'Julian Farino', 'Jeremy Podeswa'], 'Producers': ['Bruno Heller', 'William J. MacDonald', 'John Milius', 'Anne Thomopoulos', 'John Melfi'], 'Starring': ['Kevin McKidd', 'Ray Stevenson', 'Ciaran Hinds'], 'Studio': ['HBO']}\nWhile the characterizations are a bit contrived and stereotypical, it is highly entertaining.  With excellent performances by a number of the cast members, it is more fun than illuminating or educational.  I agree much of the sex is gratuitous, that seems to be pat for HBO and let's face it, it draws in the crowds.  I love Ian McNiece as the herald.  In fact, bravo to the casting crew!  This assemblage of actors alone is well worth watching.\nEntertaining\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti'], 'Producers': ['Michael Hirst', \"Morgan O'Sullivan\", 'John Weber', 'James Flynn', 'Sherry Marsh', 'Alan Gasmer', 'Shelia Hockin', 'Steve Wakefield', 'Keith Thompson'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Gabriel Byrne'], 'Studio': ['MGM']}\nWow!  Each season just gets better and better.  I don't ever want it to end.  What a cast!  This is a collection of really talented athletes who act!  The characterizations are flawless.  It took me a season to get used to the quirky jerk styles of Ragnar and Loki but I am over it and have even decided that I like it, lol.  There is everything to love about season 4 that there was in 1, 2 and 3.  In fact, it might be their best performances yet.  BRAVO to the many amazing talents it takes to produce this work of art.  This will stand the test of time.\nWOW!  It jut keeps getting better\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti', 'Steve Saint Leger', 'Jeff Woolnough', 'Helen Shaver', 'Daniel Grou', 'David Frazee', 'Joshua Zimmerman', 'David Wellington', 'Johan Renck'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Clive Standen']}\nWOW, WOW, WOW!  Isn't this one of the finest examples of historical drama ever produced?  The cast is even better than 1 and 2.  This is the best of the best.  The talent that make it possible must be superhumans, like the Vikings themselves.  The storytelling is simply flawless.  The writers give the actors the opportunity to develop flawless characterizations.  The cinematography, staging and settings are perfect, of course.  Whatever pains the cast, crew and talents involved with this production suffer through, I am grateful they persist anyway!  I rarely find myself feeling so strongly about my entertainment but this is simply a WOW!\nSeason WOW WOW WOW\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Anthony Byrne', 'John Strickland', 'Jon Jones', 'Michael Keillor'], 'Producers': ['Jeremy Piven', 'Andrew Davies', 'Chrissy Skinns', 'Kate Lewis', 'Rebecca Eaton'], 'Starring': ['Aisling Loftus', \"Frances O'Connor\", 'Gregory Fitoussi'], 'Studio': ['PBS']}\nLove this series from start to finish.  Mr. Priven was the perfect choice to portray the manic Mr. Selfridge.  In all his brilliance, he was after all, only human, yet, as is noted by one of the journalists in the series, he &#34;seems to have more hours in his day than the rest of us&#34;, lol.  I appreciate that the writers, cast and director are careful not to turn him into a stereotypical megalomaniac but, if you know what to look for, the mania comes through so clearly.  Gambling addictions are awful!\nPriven is perfect as the manic Mr. Selfridge\n{'Content advisory': ['Substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jerry Ciccoritti', 'Paul Fox'], 'Producers': ['Eugene Levy', 'Daniel Levy'], 'Starring': ['Eugene Levy', 'Daniel Levy', \"Catherine O'Hara\"], 'Studio': ['POP']}\nEugene Levy and Katherine O'Hara.  That is usually enough for me but what a cast!  They give what could be a tired old story a new breath of hilarity and I can't wait for more!  It's like the first signs of spring in a bleak winter, lol.  Great for binge watching :)\nIt's like the first signs of spring in a bleak winter\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Mario Van Peebles', 'Peter Medak', 'Christine Moore', 'Sarah Pia Anderson', 'Ali Selim', 'Stephen Surjik', 'Tim Hunter', 'Kate Woods', 'Ben Watkins'], 'Producers': ['Ben Watkins', 'Marc Forster', 'Brian Wilkins', 'Ron Perlman', 'Jim Dunn', 'Sam Ernst', 'Michael Angeli', 'Jillian Kugler', 'Craig Siebels', 'Shernold Edwards', 'Erik Lee'], 'Starring': ['Ron Perlman', 'Dana Delany', 'Andre Royo'], 'Studio': ['Amazon Studios']}\nWildly eclectic story that doesn't fit neatly into any particular genre and is sure to find a niche audience who will just love it.  More like a spy drama than a crime story, it attracts viewers who like character studies as well as intrigue.  It requires your patience, your attention, and a willingness to be wrong as you make predictions about what happens next.  The story is so skillfully layered.  It mainly focuses on the frailties of the powerful and the dynamics of the selfish and self serving people they attract but there's so much more to it.  I just LOVE it.  Of course, the acting is excellent.  The Harris' are cast with perfection.  The tweeking preacher is a stroke of genius as he is an all too common reality.  I suspect his delusions will enter into the story as they develop along with his addiction, ooo.  The writers are so much more clever and courageous than most and I hope I am not made to wait in vain for the completion of the story.  It is one of those tales that is full of surprises.  It is just too good to drop!  Niche audiences matter too, ;)  I am sure that a production like this has staying power.  The story is unlikely to ever become irrelevant or dated.  While the masses aren't flocking to watch it now, it is a story that can continue to find an adoring audience over time.  I hope this will be taken into consideration when making decisions on the future of this production.\nBRAVO!!!  MORE MORE MORE , PLEASE :)",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to have a deep appreciation for British dramas with intricate narratives and emotional depth, now showing a pronounced affinity for eclectic storytelling that blends genres, particularly spy dramas that delve into character studies and intrigue. Their enjoyment of comedies featuring seasoned actors remains, highlighting a growing appreciation for clever humor.\n\n- **Language:** Their preference for English content and enhancements like audio descriptions and subtitles endures, enhancing their viewing experience.\n\n- **Rating Behavior:** The user maintains a careful rating approach, consistently scoring between 4.5 and 5.0. A recent perfect score reflects their enthusiasm for exceptional performances and engaging narratives, underscoring their versatile taste.\n\n- **Engagement Style:** Their analytical reviews emphasize emotional resonance and narrative quality, with an appreciation for ethical dimensions in storytelling. They show insight into layers within plots, valuing patience and attention from viewers.\n\n- **Themes:** The user favors originality and darker themes but remains receptive to lighter narratives that provide depth. They seek authenticity in cultural discussions and recognize niche audiences.\n\n- **Favorite Elements:** They look for high-quality productions led by acclaimed directors and talented casts, favoring thought-provoking content that addresses complex social issues, while being critical of sensationalism.\n\nThis update reflects their evolving taste and enthusiasm for nuanced character portrayals in both drama and comedy, as well as their insight into layered storytelling.",
  "metrics": {
    "rouge1_f": 0.10559284116331097,
    "rouge2_f": 0.010747872816838333,
    "rougeL_f": 0.04742729306487696,
    "meteor": 0.029324752129652534,
    "bleu1": 1.931899815305074e-05,
    "bleu2": 5.8594787573111985e-06,
    "bleu3": 1.7722860248995408e-06,
    "bleu4": 5.48603153209904e-07,
    "bertscore_precision": 0.35090532898902893,
    "bertscore_recall": 0.4932752549648285,
    "bertscore_f1": 0.4100850522518158
  }
}