{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/09/19\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Timothy Van Patten', 'Allen Coulter', 'Jeremy Podeswa', 'Ed Bianchi', 'Brad Anderson', 'Alik Sakharov', 'Jake Paltrow', 'Simon Cellan Jones', 'Brian Kirk', 'Martin Scorsese'], 'Producers': ['Rudd Simmons', 'Terence Winter', 'Martin Scorsese', 'Tim Van Patten', 'Stephen Levinson', 'Mark Wahlberg'], 'Starring': ['Steve Buscemi', 'Michael Pitt', 'Kelly Macdonald'], 'Studio': ['HBO']}\nReview Text: Sorry is compelling and relevant.  There's an artistic quality that separates it from other stories of organized crime and government corruption setting it above the crowd.  I appreciate the rather undramatic approach taken to the violence.  Paired with displays of hedonistic self indulgence.  It allows us to think through the event rather than just a simple viceral respnse to blood and guts.  Well done!\nReview Title: Brilliant production.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Blair'], 'Producers': ['David Snodin', 'Kate Harwood'], 'Starring': ['Gemma Arterton', 'Eddie Redmayne', 'Hans Matheson'], 'Studio': ['BBC America']}\nAll the drama and wickedness one can hope for in the long list of great British stories and productions. Certainly not your usual love story, that is for sure.\nSo sad\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Cote'], 'Producers': ['Bill Cote', 'John Cheshire', 'Carol Cote', 'Michael Gerber', 'Marianne McCune', 'Robert Watts'], 'Starring': ['GrahamHancock', 'RobertBauval', 'MichaelCremo'], 'Studio': ['UFOTV']}\nOh, my.  The gun loving egotist takes on science now.  Creationism has been crammed down the throats of a fearful Jane and John Q Public for more than 2000 years and many a scientist and healer has been murdered by the religious elite for helping us get off our knees and participate in our world.  It is the religious community who is force feeding their false doctrine, and, as they have done historically, they play the victim.<br />For hundreds of years, only the clergy were allowed to learn to read, write and perform experiments to better understand the nature of reality.  In industrialized parts of the world, almost anyone can read now.  That was a hard won fight.  Religion and science don't have to be enemies.  Scientists aren't calling for the end of Christianity.  Simply because science doesn't support religious stories, doesn't make the scientist the bad guy here.  Religion has a long history of the intentional misuse of information as it was once the major force of political power, created to keep you on your knees in service of the Lord, the King/Queen and the Pope.  Much like the Middle East today, only their mind control is Islam.<br />Science doesn't attack religion.  Religion is the bully here.  Science only illuminates.\nAnother bullying attack on scientists and sensibility.  Steer clear if you value education.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Timothy Van Patten', 'Allen Coulter', 'Jeremy Podeswa', 'Ed Bianchi', 'Brad Anderson', 'Alik Sakharov', 'Jake Paltrow', 'Simon Cellan Jones', 'Brian Kirk', 'Martin Scorsese'], 'Producers': ['Rudd Simmons', 'Terence Winter', 'Martin Scorsese', 'Tim Van Patten', 'Stephen Levinson', 'Mark Wahlberg'], 'Starring': ['Steve Buscemi', 'Michael Pitt', 'Kelly Macdonald'], 'Studio': ['HBO']}\nSorry is compelling and relevant.  There's an artistic quality that separates it from other stories of organized crime and government corruption setting it above the crowd.  I appreciate the rather undramatic approach taken to the violence.  Paired with displays of hedonistic self indulgence.  It allows us to think through the event rather than just a simple viceral respnse to blood and guts.  Well done!\nBrilliant production.",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** Strong affinity for British dramas with complex narratives and emotional depth, alongside content exploring controversial subjects in science and religion. Recently expressed appreciation for stories that offer artistic and nuanced perspectives on themes such as organized crime and government corruption.\n  \n- **Language:** Prefers content in English, including both audio and subtitles.\n\n- **Rating Behavior:** Generally rates products highly, typically near 4.5 to 5.0, while demonstrating a willingness to lower ratings when content does not align with expectations or values. Recently provided a perfect rating for a production recognized for its artistic quality and thoughtful handling of violence.\n\n- **Engagement Style:** Writes reflective and thoughtful reviews that emphasize emotional impact, narrative quality, and a critical approach to societal issues, particularly around the themes of ethical responsibility in storytelling.\n\n- **Themes:** Enjoys narratives that diverge from typical romantic tropes, with a preference for originality and darker themes. Engages critically with cultural and scientific discussions, emphasizing the importance of integrity in storytelling.\n\n- **Favorite Elements:** Values well-crafted productions featuring notable directors, producers, and cast members, and appreciates content that invites reflection rather than sensationalism, particularly resonating with themes that provoke deeper thought on complex societal issues.",
  "metrics": {
    "rouge1_f": 0.22395023328149302,
    "rouge2_f": 0.021840873634945395,
    "rougeL_f": 0.10886469673405912,
    "meteor": 0.08745687037857876,
    "bleu1": 0.0668997947408523,
    "bleu2": 0.021436535444478905,
    "bleu3": 0.010184184763222802,
    "bleu4": 0.0063491792837421105,
    "bertscore_precision": 0.3560712933540344,
    "bertscore_recall": 0.4254709780216217,
    "bertscore_f1": 0.38768982887268066
  }
}