{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/12/17\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rowan Woods', 'Tony Krawitz'], 'Producers': ['Victoria Madden', 'Vincent Sheehan', 'Andy Walker', 'Penny Win'], 'Starring': ['Elizabeth Debicki', 'Matthew Le Nevez', 'Henry Nixon']}\nReview Text: A compelling story, complete with layers of symbols however the use of red herrings gets a bit annoying.  Love the,performances and authenticity of the set.  A remarkable production.\nReview Title: Brave attempt at a complex story\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Blair'], 'Producers': ['David Snodin', 'Kate Harwood'], 'Starring': ['Gemma Arterton', 'Eddie Redmayne', 'Hans Matheson'], 'Studio': ['BBC America']}\nAll the drama and wickedness one can hope for in the long list of great British stories and productions. Certainly not your usual love story, that is for sure.\nSo sad\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Cote'], 'Producers': ['Bill Cote', 'John Cheshire', 'Carol Cote', 'Michael Gerber', 'Marianne McCune', 'Robert Watts'], 'Starring': ['GrahamHancock', 'RobertBauval', 'MichaelCremo'], 'Studio': ['UFOTV']}\nOh, my.  The gun loving egotist takes on science now.  Creationism has been crammed down the throats of a fearful Jane and John Q Public for more than 2000 years and many a scientist and healer has been murdered by the religious elite for helping us get off our knees and participate in our world.  It is the religious community who is force feeding their false doctrine, and, as they have done historically, they play the victim.<br />For hundreds of years, only the clergy were allowed to learn to read, write and perform experiments to better understand the nature of reality.  In industrialized parts of the world, almost anyone can read now.  That was a hard won fight.  Religion and science don't have to be enemies.  Scientists aren't calling for the end of Christianity.  Simply because science doesn't support religious stories, doesn't make the scientist the bad guy here.  Religion has a long history of the intentional misuse of information as it was once the major force of political power, created to keep you on your knees in service of the Lord, the King/Queen and the Pope.  Much like the Middle East today, only their mind control is Islam.<br />Science doesn't attack religion.  Religion is the bully here.  Science only illuminates.\nAnother bullying attack on scientists and sensibility.  Steer clear if you value education.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Timothy Van Patten', 'Allen Coulter', 'Jeremy Podeswa', 'Ed Bianchi', 'Brad Anderson', 'Alik Sakharov', 'Jake Paltrow', 'Simon Cellan Jones', 'Brian Kirk', 'Martin Scorsese'], 'Producers': ['Rudd Simmons', 'Terence Winter', 'Martin Scorsese', 'Tim Van Patten', 'Stephen Levinson', 'Mark Wahlberg'], 'Starring': ['Steve Buscemi', 'Michael Pitt', 'Kelly Macdonald'], 'Studio': ['HBO']}\nSorry is compelling and relevant.  There's an artistic quality that separates it from other stories of organized crime and government corruption setting it above the crowd.  I appreciate the rather undramatic approach taken to the violence.  Paired with displays of hedonistic self indulgence.  It allows us to think through the event rather than just a simple viceral respnse to blood and guts.  Well done!\nBrilliant production.\n{'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語', 'Português'], 'Directors': ['Woody Allen'], 'Producers': ['Erika Aronson', 'Helen Robin'], 'Starring': ['Woody Allen', 'Miley Cyrus', 'Elaine May']}\nStill suspect about the choice of Ms. Cyrus to play the revolutionary.  On the one hand, she will attract an important and large following of young minds.  This would make the choice clever.  On the other hand, the chemistry between the actors, which is always right on in Mr. Allen's films, is challenged by the Disney camera style that Ms. Cyrus is accustomed to.  The writing is pure Allen and there are, as always, many quotable and memorable moments that make this a really fun watch for those of us who love his openly neurotic, pensive and ultimately hilarious creations.  Love this one!\nClassic Woody Allen\nPrince Philip: The Plot to Make a King\nDocumentary\n['This is the inside story of the dynastic tensions that were unleashed when Princess Elizabeth, the future queen, fell in love with Prince Philip. Witness the complexities and frustrations of the royal marriage, as the monarch struggled to reconcile the love of her husband with the suspicions of her family and her government.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Sanders'], 'Producers': ['Richard Sanders', 'Denys Blakeway'], 'Starring': ['Tamsin Greig']}\nTypical, shallow documentary about an English royal.  Oddly enough, I was expecting it to contain more about him: how he adapted to the seeming effeminate role of King Consort would have made it interesting.  Otherwise, it is much like the pedigree of a fine stallion on film.  I sense he is a far more interesting person than this documentary presented.  From my recall of various events and instances where we have been given access to his thoughts and deeds he is rather hilarious in a quintessentially British way.  Observant, irreverent, quick, sporting, and lets face it, absolutely DASHING; that's what I was hoping would be highlighted.\nThis Man is FAR More Interesting Than the Documentary\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rowan Woods', 'Tony Krawitz'], 'Producers': ['Victoria Madden', 'Vincent Sheehan', 'Andy Walker', 'Penny Win'], 'Starring': ['Elizabeth Debicki', 'Matthew Le Nevez', 'Henry Nixon']}\nA compelling story, complete with layers of symbols however the use of red herrings gets a bit annoying.  Love the,performances and authenticity of the set.  A remarkable production.\nBrave attempt at a complex story",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to show a strong affinity for British dramas characterized by intricate narratives and emotional depth. Their recent engagement includes stories that explore organized crime and government corruption while also appreciating complex productions. Notably, they are also interested in themes surrounding violence and substance use, suggesting a nuanced appreciation for gritty realism.\n\n- **Language:** Prefers content in English, valuing audio enhancements and English subtitles for an enriched viewing experience.\n\n- **Rating Behavior:** Rates productions discerningly, typically in the 4.5 to 5.0 range, with a recent classic film receiving a perfect score. Their recent review of a complex narrative reflects this tendency, as they rated it 4.0, emphasizing the compelling story and strong performances while also critiquing the overuse of red herrings. \n\n- **Engagement Style:** The user writes insightful reviews that focus on emotional impact and the quality of the narrative. They emphasize ethical considerations in storytelling while valuing literary integrity.\n\n- **Themes:** Prefers originality and darker themes, actively engaging in cultural discussions about authenticity. They seek narratives that avoid typical romantic tropes.\n\n- **Favorite Elements:** Values well-crafted productions from esteemed directors and actors. Enjoys thought-provoking content that addresses complex societal issues, showing a continued disfavor for sensationalism.",
  "metrics": {
    "rouge1_f": 0.17454545454545453,
    "rouge2_f": 0.030965391621129327,
    "rougeL_f": 0.08545454545454546,
    "meteor": 0.0570554931570326,
    "bleu1": 0.006060907469649527,
    "bleu2": 0.0024169482417904127,
    "bleu3": 0.0012087866159413115,
    "bleu4": 0.0006804938157915104,
    "bertscore_precision": 0.3638668656349182,
    "bertscore_recall": 0.4639778137207031,
    "bertscore_f1": 0.4078691303730011
  }
}