{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/08/24\nAverage Rating: 3.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Cote'], 'Producers': ['Bill Cote', 'John Cheshire', 'Carol Cote', 'Michael Gerber', 'Marianne McCune', 'Robert Watts'], 'Starring': ['GrahamHancock', 'RobertBauval', 'MichaelCremo'], 'Studio': ['UFOTV']}\nReview Text: Oh, my.  The gun loving egotist takes on science now.  Creationism has been crammed down the throats of a fearful Jane and John Q Public for more than 2000 years and many a scientist and healer has been murdered by the religious elite for helping us get off our knees and participate in our world.  It is the religious community who is force feeding their false doctrine, and, as they have done historically, they play the victim.<br />For hundreds of years, only the clergy were allowed to learn to read, write and perform experiments to better understand the nature of reality.  In industrialized parts of the world, almost anyone can read now.  That was a hard won fight.  Religion and science don't have to be enemies.  Scientists aren't calling for the end of Christianity.  Simply because science doesn't support religious stories, doesn't make the scientist the bad guy here.  Religion has a long history of the intentional misuse of information as it was once the major force of political power, created to keep you on your knees in service of the Lord, the King/Queen and the Pope.  Much like the Middle East today, only their mind control is Islam.<br />Science doesn't attack religion.  Religion is the bully here.  Science only illuminates.\nReview Title: Another bullying attack on scientists and sensibility.  Steer clear if you value education.\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Blair'], 'Producers': ['David Snodin', 'Kate Harwood'], 'Starring': ['Gemma Arterton', 'Eddie Redmayne', 'Hans Matheson'], 'Studio': ['BBC America']}\nAll the drama and wickedness one can hope for in the long list of great British stories and productions. Certainly not your usual love story, that is for sure.\nSo sad\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Cote'], 'Producers': ['Bill Cote', 'John Cheshire', 'Carol Cote', 'Michael Gerber', 'Marianne McCune', 'Robert Watts'], 'Starring': ['GrahamHancock', 'RobertBauval', 'MichaelCremo'], 'Studio': ['UFOTV']}\nOh, my.  The gun loving egotist takes on science now.  Creationism has been crammed down the throats of a fearful Jane and John Q Public for more than 2000 years and many a scientist and healer has been murdered by the religious elite for helping us get off our knees and participate in our world.  It is the religious community who is force feeding their false doctrine, and, as they have done historically, they play the victim.<br />For hundreds of years, only the clergy were allowed to learn to read, write and perform experiments to better understand the nature of reality.  In industrialized parts of the world, almost anyone can read now.  That was a hard won fight.  Religion and science don't have to be enemies.  Scientists aren't calling for the end of Christianity.  Simply because science doesn't support religious stories, doesn't make the scientist the bad guy here.  Religion has a long history of the intentional misuse of information as it was once the major force of political power, created to keep you on your knees in service of the Lord, the King/Queen and the Pope.  Much like the Middle East today, only their mind control is Islam.<br />Science doesn't attack religion.  Religion is the bully here.  Science only illuminates.\nAnother bullying attack on scientists and sensibility.  Steer clear if you value education.",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** Strong affinity for British dramas, particularly those with complex narratives and emotional depth, but also engages with content on controversial subjects related to science and religion.\n- **Language:** Prefers content in English, including both audio and subtitles.\n- **Rating Behavior:** Generally rates products highly, typically near 4.5 to 5.0, but shows willingness to rate lower when content does not align with expectations or values. \n- **Engagement Style:** Writes reflective and thoughtful reviews emphasizing emotional impact and narrative quality, while also expressing strong opinions on societal issues, highlighting a critical approach to controversial topics.\n- **Themes:** Enjoys narratives that diverge from typical romantic tropes, suggesting a preference for originality and perhaps darker themes, but also engages with discussions that critique cultural and scientific topics.\n- **Favorite Elements:** Appreciates well-crafted productions with notable directors, producers, and cast members while valuing educational content and integrity in storytelling over sensationalism.\n\nThe recent interaction indicates a discernment not only for storytelling quality but also for the responsibility of content to provide a thoughtful examination of important issues.",
  "metrics": {
    "rouge1_f": 0.1959183673469388,
    "rouge2_f": 0.00819672131147541,
    "rougeL_f": 0.08979591836734693,
    "meteor": 0.09163161468944263,
    "bleu1": 0.10706192011923027,
    "bleu2": 0.0270356503378952,
    "bleu3": 0.005003972020138437,
    "bleu4": 0.002155157714605592,
    "bertscore_precision": 0.3722476363182068,
    "bertscore_recall": 0.4148178696632385,
    "bertscore_f1": 0.392381489276886
  }
}