{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/10/05\nAverage Rating: 3.1\nProduct Details: {'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語', 'Português'], 'Directors': ['Woody Allen'], 'Producers': ['Erika Aronson', 'Helen Robin'], 'Starring': ['Woody Allen', 'Miley Cyrus', 'Elaine May']}\nReview Text: Still suspect about the choice of Ms. Cyrus to play the revolutionary.  On the one hand, she will attract an important and large following of young minds.  This would make the choice clever.  On the other hand, the chemistry between the actors, which is always right on in Mr. Allen's films, is challenged by the Disney camera style that Ms. Cyrus is accustomed to.  The writing is pure Allen and there are, as always, many quotable and memorable moments that make this a really fun watch for those of us who love his openly neurotic, pensive and ultimately hilarious creations.  Love this one!\nReview Title: Classic Woody Allen\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Blair'], 'Producers': ['David Snodin', 'Kate Harwood'], 'Starring': ['Gemma Arterton', 'Eddie Redmayne', 'Hans Matheson'], 'Studio': ['BBC America']}\nAll the drama and wickedness one can hope for in the long list of great British stories and productions. Certainly not your usual love story, that is for sure.\nSo sad\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Cote'], 'Producers': ['Bill Cote', 'John Cheshire', 'Carol Cote', 'Michael Gerber', 'Marianne McCune', 'Robert Watts'], 'Starring': ['GrahamHancock', 'RobertBauval', 'MichaelCremo'], 'Studio': ['UFOTV']}\nOh, my.  The gun loving egotist takes on science now.  Creationism has been crammed down the throats of a fearful Jane and John Q Public for more than 2000 years and many a scientist and healer has been murdered by the religious elite for helping us get off our knees and participate in our world.  It is the religious community who is force feeding their false doctrine, and, as they have done historically, they play the victim.<br />For hundreds of years, only the clergy were allowed to learn to read, write and perform experiments to better understand the nature of reality.  In industrialized parts of the world, almost anyone can read now.  That was a hard won fight.  Religion and science don't have to be enemies.  Scientists aren't calling for the end of Christianity.  Simply because science doesn't support religious stories, doesn't make the scientist the bad guy here.  Religion has a long history of the intentional misuse of information as it was once the major force of political power, created to keep you on your knees in service of the Lord, the King/Queen and the Pope.  Much like the Middle East today, only their mind control is Islam.<br />Science doesn't attack religion.  Religion is the bully here.  Science only illuminates.\nAnother bullying attack on scientists and sensibility.  Steer clear if you value education.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Timothy Van Patten', 'Allen Coulter', 'Jeremy Podeswa', 'Ed Bianchi', 'Brad Anderson', 'Alik Sakharov', 'Jake Paltrow', 'Simon Cellan Jones', 'Brian Kirk', 'Martin Scorsese'], 'Producers': ['Rudd Simmons', 'Terence Winter', 'Martin Scorsese', 'Tim Van Patten', 'Stephen Levinson', 'Mark Wahlberg'], 'Starring': ['Steve Buscemi', 'Michael Pitt', 'Kelly Macdonald'], 'Studio': ['HBO']}\nSorry is compelling and relevant.  There's an artistic quality that separates it from other stories of organized crime and government corruption setting it above the crowd.  I appreciate the rather undramatic approach taken to the violence.  Paired with displays of hedonistic self indulgence.  It allows us to think through the event rather than just a simple viceral respnse to blood and guts.  Well done!\nBrilliant production.\n{'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語', 'Português'], 'Directors': ['Woody Allen'], 'Producers': ['Erika Aronson', 'Helen Robin'], 'Starring': ['Woody Allen', 'Miley Cyrus', 'Elaine May']}\nStill suspect about the choice of Ms. Cyrus to play the revolutionary.  On the one hand, she will attract an important and large following of young minds.  This would make the choice clever.  On the other hand, the chemistry between the actors, which is always right on in Mr. Allen's films, is challenged by the Disney camera style that Ms. Cyrus is accustomed to.  The writing is pure Allen and there are, as always, many quotable and memorable moments that make this a really fun watch for those of us who love his openly neurotic, pensive and ultimately hilarious creations.  Love this one!\nClassic Woody Allen",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** Maintains a strong affinity for British dramas with intricate narratives and emotional depth, while also enjoying content that explores controversial themes in science and religion. Recently showed appreciation for stories tackling organized crime and government corruption, alongside a newfound enjoyment of classic works by renowned filmmakers.\n\n- **Language:** Prefers content in English, with a preference for various audio enhancements and English subtitles.\n\n- **Rating Behavior:** Generally rates productions highly, often between 4.5 to 5.0; however, demonstrates the ability to lower ratings based on misalignment with personal tastes or expectations. Recently provided a perfect score for a classic film known for its distinct artistic flair and intelligent humor.\n\n- **Engagement Style:** Writes reflective and insightful reviews focusing on emotional impact, narrative quality, and ethical considerations in storytelling. Emphasizes the importance of literary integrity, particularly in relation to societal issues.\n\n- **Themes:** Enjoys narratives that steer away from typical romantic tropes, favoring originality and darker themes. Engages critically with cultural discussions, underlining the significance of authenticity in storytelling.\n\n- **Favorite Elements:** Values well-crafted productions featuring esteemed directors, producers, and actors. Appreciates content that is thought-provoking, avoiding sensationalism and inviting deeper contemplation on complex societal concerns.",
  "metrics": {
    "rouge1_f": 0.19174757281553398,
    "rouge2_f": 0.0145985401459854,
    "rougeL_f": 0.08737864077669903,
    "meteor": 0.07038190273623389,
    "bleu1": 0.02345164840620729,
    "bleu2": 0.006589677840796375,
    "bleu3": 0.003258333575370641,
    "bleu4": 0.002072335442896623,
    "bertscore_precision": 0.35370582342147827,
    "bertscore_recall": 0.44350823760032654,
    "bertscore_f1": 0.3935491442680359
  }
}