{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Toyotress Tiana Passion Braid Hair - 18 inch 8 Packs Ombre Blonde Wavy Box Braids Crochet Synthetic Braiding Hair Extensions (18 Inch, T27)\nReview Date: 2020/11/06\nStore: ToyoTress\nAverage Rating: 3.7\nProduct Details: {'Brand': 'ToyoTress', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '14.57 x 9.45 x 2.91 inches; 1.45 Pounds'}\nReview Text: It’s faulty soft and lightweight. Easy to install. It’s quality hair. I just don’t like the look of it. The braids are a little too big for my liking right now. The color is pretty. Not as bright as the pic. I like the length. Not too short. Not too long. Overall, I like the hair.\nReview Title: Toyotress Tiana Passion Braid Hair - 18 inch 8 Packs Ombre\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Senegalese Twist Crochet Hair Extensions - Natural Black 32 Inch 8 Packs Pre-twisted Synthetic Crochet Braids Pre Looped Crotchet Hair Synthetic Braiding Hair(32 Inch,1B)\nToyoTree\n{'Brand': 'ToyoTree', 'Material': 'Synthetic', 'Extension Length': '32 Inches', 'Hair Type': 'Thick,Thin', 'Material Feature': 'Natural', 'Package Dimensions': '16 x 7.8 x 1.6 inches; 1.6 Pounds', 'UPC': '781827814338'}\nGood quality hair. Enough for a whole head. It’s super long. The twists are pretty. Easy to manage and install. Lightweight. No funny smell.\nSenegalese Twist Crochet Hair Extensions Black - 32inch 8Packs\n1000 Pcs Acrylic Nail Kit, Coffin Nails Long Fake Nails Tips For Nail Salons And DIY Nail, Artificial Half Cover Nail Tips With Box, Nature & Clear, 10 Size\nVEAFX\n{'Color': 'Clear', 'Size': 'Large', 'Material': 'Acrylic, Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'VEAFX', 'Style': 'French', 'Package Dimensions': '7.2 x 7 x 1.4 inches; 9.59 Ounces', 'UPC': '782912939134'}\nLots of nails to work with. They aren’t as thick as I’d like them to be. They’re more on the thin, flimsy plastic side. They do stay in place once applied. Overall, they’re good for what they’re for. I like that you get the regular coke and a clear set as well. Great starter kit.\n1000 Pcs Acrylic Nail Kit\nPretty Frank Natural Deodorant Jar- No Aluminum Deodorant for Women, Men, Teens, & Kids – Paraben Sulfate Free Cream Deodorant with Shea Butter, Coconut Oil, Vitamin E & Baking Soda (Jasmine)\nPRETTY FRANK\n{'Brand': 'PRETTY FRANK', 'Item Form': 'Cream', 'Scent': 'Jasmine, Coconut', 'Material Feature': 'Natural', 'Number of Items': '1', 'Package Dimensions': '3.42 x 2.79 x 2.59 inches; 5.61 Ounces'}\nI really love this deodorant. It doesn’t contain aluminum. As it states, a little goes a long way. I work in Nursing so my workload is very heavy and I sweat a lot. I’m still smelling fresh when using this. It’s easy to apply. Just grab a pinch, rub it between two fingers and apply. You don’t need to use a lot. It has a nice consistency. Not sticky. Not too think or too thick. Doesn’t stain hands or clothing. I wish the scent was a bit stronger but I still love it overall.\nPretty Frank Natural Deodorant Jar- No Aluminum Deodorant\nToyotress Tiana Passion Braid Hair - 18 inch 8 Packs Ombre Blonde Wavy Box Braids Crochet Synthetic Braiding Hair Extensions (18 Inch, T27)\nToyoTress\n{'Brand': 'ToyoTress', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '14.57 x 9.45 x 2.91 inches; 1.45 Pounds'}\nIt’s faulty soft and lightweight. Easy to install. It’s quality hair. I just don’t like the look of it. The braids are a little too big for my liking right now. The color is pretty. Not as bright as the pic. I like the length. Not too short. Not too long. Overall, I like the hair.\nToyotress Tiana Passion Braid Hair - 18 inch 8 Packs Ombre",
  "profile": "The user displays a strong preference for beauty and personal care products that emphasize quality, convenience, and aesthetics. They prioritize high-quality items in their hair care, valuing manageability, appearance, and comfort, particularly favoring lightweight options for extended wear. A natural look is essential, as they seek products that enhance their overall aesthetic while avoiding unpleasant odors.\n\nRecently, the user has shown an interest in versatile beauty tools, including a nail kit, demonstrating a desire for practicality alongside aesthetic appeal. Their reviews reflect a strong appreciation for functionality in their beauty routine, allowing for both professional and DIY applications.\n\nIn their latest interaction, the user purchased synthetic braiding hair, praising its softness, lightweight feel, and ease of installation while expressing some dissatisfaction with its appearance and size of the braids. This highlights their ongoing quest for products that align with their aesthetic preferences, as they seek a balance between quality and personal style.\n\nOverall, the user is focused on acquiring high-quality, easy-to-manage products that enhance their beauty experience, ensuring a fresh, natural, and visually appealing look across multiple aspects of personal care. Their holistic approach to beauty reflects a commitment to finding items that seamlessly blend functionality with aesthetic value.",
  "metrics": {
    "rouge1_f": 0.21276595744680854,
    "rouge2_f": 0.01991465149359886,
    "rougeL_f": 0.09078014184397162,
    "meteor": 0.098995100373761,
    "bleu1": 0.049859890727087006,
    "bleu2": 0.009443274723809363,
    "bleu3": 0.0037656703895558533,
    "bleu4": 0.0013386945564729928,
    "bertscore_precision": 0.3328401446342468,
    "bertscore_recall": 0.4105512499809265,
    "bertscore_f1": 0.3676339089870453
  }
}