{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Redemption of Henry Myers\nReview Date: 2015/02/10\nStore: Drew Waters  (Actor),     Erin Bethea  (Actor),     Clayton Miller  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts\nProduct Description: [\"An outlaw beyond all hope. A love beyond all limits. Henry Myers (Drew Waters from Breaking Bad, Friday Night Lights, The Hit List, Cowgirls 'n Angels) lives a hard life. Getting through life on the frontier however he can' even if it means robbing a bank. After his latest heist goes wrong and his partners betray him and leave him for dead, Henry is surprised to find extraordinary kindness from a widow named Marilyn (Erin Bethea from Fireproof, Facing The Giants, Letters To God) and her children. With the influence of this family, Henry begins to question the choices he's made in his life. Just when things begin to make sense again, it's all ripped away from him when his old partners show up. Will he seek the revenge he desires or finally find his redemption'\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Westerns', 'Format': 'Multiple Formats, Color, Subtitled, NTSC', 'Contributor': 'Clayton Miller, Drew Waters, Erin Bethea', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '128934', 'Director': 'Clayton Miller', 'Media Format': 'Multiple Formats, Color, Subtitled, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 10, 2014', 'Actors': 'Drew Waters, Erin Bethea', 'Subtitles': 'English', 'Studio': 'Echolight Studios', 'Number of discs': '1'}\nReview Text: This is a masterfully made western movie with every attention to detail to make it look authentic to the time being depicted.  Truly touching with a Christ-centered theme of the Lord's willingness to forgive, save and transform every person, no matter what their background or what they've done in their lives. A beautiful story for the entire family, with some really funny moments, and a wonderful twist!  Don't miss it!\nReview Title: Excellent, first-class movie all the way!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Barchester Chronicles\nAlan Rickman  (Actor),     Nigel Hawthorne  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', \"The cozy community of Barchester is rocked from its complacency when a crusade against the Church of England's practice of self-enrichment misfires. Overnight, Septimus Harding (Donald Pleasence) becomes the pawn in a political battle begun by his younger daughter's beau, John Bold, and kept kindled by his older daughter's husband, Archdeacon Grantly (Nigel Hawthorne).\", 'Amazon.com', 'The first two episodes of this BBC miniseries only hint at the delights to come. A lawsuit aimed at church reform in the town of Barchester forces a decent middle-aged clergyman (the august Donald Pleasence, best known in the U.S. for the', 'Halloween', 'movies) into a moral crisis and a conflict with his son-in-law, a pompous archdeacon (Nigel Hawthorne,', 'The Madness of King George', '). The gracefully written and acted narrative shows glimpses of dry wit--but in episode 3, the arrival of a new bishop (Clive Swift,', 'Keeping Up Appearances', '), his imperious wife (Geraldine McEwan,', 'The Magdalene Sisters', '), and his devious chaplain (Alan Rickman,', 'Truly Madly Deeply', ', the', 'Harry Potter', 'movies) launches', 'The Barchester Chronicles', 'into a satirical power struggle all the more mesmerizing because of the smallness of the territory. The scheming of the citizens and clergy of this British town is both Byzantine and wonderfully comic as the tempestuous personalities claw and dig at each other.', \"Rickman, in one of his first film or television roles, turns in a tour de force of oily ambition. McEwan's ferocious machinations are downright terrifying, while the sputtering Hawthorne (\", 'The Madness of King George', ') seems constantly in danger of bursting a vein. At the center of it all is Pleasence. Making goodness compelling has always been difficult, since wickedness is always more dramatic; but Pleasence brings a deep and stirring passion to his role that proves as engaging as all the back-biting that surrounds him. And these are just the more familiar faces; a host of lesser-known actors give equally superb performances. The final episode (of seven) will have you on pins and needles.', 'The Barchester Chronicles', ', adapted from two novels by Anthony Trollope, is one of those marvels of British television, a skillful production that proves intelligent fare can be hugely entertaining.', '--Bret Fetzer']\n{'Genre': 'Classics, Art House & International/Period Piece, Drama', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Original recording remastered', 'Contributor': 'Susan Hampshire, Donald Pleasence, Alan Rickman, Geraldine McEwan, Nigel Hawthorne', 'Language': 'Unqualified, English (Mono)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.52 Ounces', 'Item model number': '794051211125', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Original recording remastered', 'Run time': '6 hours and 25 minutes', 'Release date': 'May 16, 2006', 'Actors': 'Alan Rickman, Nigel Hawthorne, Susan Hampshire, Donald Pleasence, Geraldine McEwan', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReally enjoy this series; the costumes and cast are fantastic, and the scenery is incredible.  Will enjoy again and again.\nVery enjoyable!\nFollow the River / The Inheritance / What I Did for Love / Bonus CD\nSheryl Lee  (Actor),     Ellen Burstyn  (Actor),     3 Features with Bonus CD  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['FOLLOW THE RIVER', '<BR> The tumultuous settlement of the New World and the crossing of its two cultures form the backdrop for this sweeping saga of a courageous pioneer woman. Mary Ingles (', 'Sheryl Lee', \") is pregnant when she and her young son are captured from their homestead in Virginia's Blue Ridge Mountains by Shawnee Indians. After giving birth, Mary finds herself falling for Wildcat, the Shawnee chief, but is determined to return home to her husband. Separated from her children after being sold, Mary convinces a fellow captive (\", 'Ellen Burstyn', ') to escape with her; and with unwavering resolve, she leads them on the journey of a lifetime--a journey home. <BR><BR>', 'WHAT I DID FOR LOVE', \"<BR> Call him a city slicker. Call him a tenderfoot. But don't call him a member of the family--yet. Rising L.A. lawyer James White (\", 'Jeremy London', \") is going home for the holidays with his fiancée, Sadie Ryder, to finally meet her family in rural Pine Gap. After blundering through a bad first impression, James attempts to win over Sadie's lawyer-loathing father Karl (\", 'James Gammon', \") by pretending to be a horse-riding, hay-baling, game-hunting, seasoned square dancer. But a pair of worn jeans and a ten-gallon hat don't make a cowboy, and it's going to take more than mere posturing to charm Mr. Ryder…in fact, it just may take a miracle. <BR><BR>\", 'THE INHERITANCE', '<BR> At the lush Evenswood estate in Concord, Massachusetts, Edith Adelon (', 'Cari Shayne', '), a beautiful orphan, lives as the paid companion to the daughter of the wealthy Hamilton family, although they regard her as one of their own. Years ago, Henry Hamilton (', 'Tom Conti', \") saved Edith from an Italian orphanage at the request of his long-deceased brother. Now, Edith is his daughter Amy's (\", 'Brigitta Dau', ') prized friend and confidante. As the Hamiltons await a trio of visitors for the annual Greens Cup horse race, Beatrice Hamilton (', 'Meredith Baxter', \") asks for Edith's help in finding a suitable husband for a cousin, Ida Glenshaw (\", 'Brigid Walsh Brannagh', '), with one of two visiting eligible bachelors. But when it becomes clear that both the young men have affection for Edith and not Ida, jealousy soon develops, leading to malicious conniving and brutal backstabbing. Despite the growing love between Edith and one of the young suitors, because of their conflicting social classes, the couple is reminded time and again that their love can never be.', 'The Inheritance', \"is a story that centers on an innocent young woman's struggle to make sense of her position within the Hamilton household and in society, and the love she feels for her patrons, as well as for a young man she can never marry. <BR> <BR> Includes BONUS Music CD! <BR>\", 'GENTLE RAIN', '<BR> The soothing sounds of birds amidst the tranquil country rainfall will enhance the spirit and the soul, transforming you into a world of relaxation.']\n{'Genre': 'Romance', 'Format': 'NTSC', 'Contributor': 'Ellen Burstyn, Meredith Baxter, James Gammon, Sheryl Lee, Tom Conti, Dorie Barton, Jonny Acker, 3 Features with Bonus CD, Jeremy LondonEllen Burstyn, Meredith Baxter, James Gammon, Sheryl Lee, Tom Conti, Dorie Barton, Jonny Acker, 3 Features with Bonus CD, Jeremy London  See more', 'Language': 'Unqualified', 'Runtime': '4 hours and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': '3 Features with Bonus CD', 'Media Format': 'NTSC', 'Run time': '4 hours and 34 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Sheryl Lee, Ellen Burstyn, Meredith Baxter, Tom Conti, Jonny Acker', 'Studio': 'Echo Bridge', 'Number of discs': '2'}\nWhile The Inheritance was an enjoyable movie, the other two were pretty cheesy.  Sold it on eBay the following week.\nCheesy\nKillers\nKatherine Heigl  (Actor),     Ashton Kutcher  (Actor),     Robert Luketic  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'He’s tall, dark and handsome with a hint of mystery. What more does Jen (Katherine Heigl) need to know about Spencer (Ashton Kutcher), the man who’s just swept her off her feet down in the French Riviera? Well, maybe that he’s a professional spy whose special talent is assassination. But no matter, neither bullets nor bombs nor bad guys with big guns can keep these two from living happily ever after – if they can get through the day alive – in the outrageous romantic hit comedy that will slay you.', 'Amazon.com', 'Killers', 'has been murdered by most film critics, and the box-office receipts haven\\'t been too impressive either. But that\\'s kind of a bad rap. Granted, it isn\\'t likely to make many year\\'s best (or even month\\'s best) lists, but this is an entertaining little diversion that at the very least offers an appealing cast, a few laughs, and some cool chase scenes. Katherine Heigl plays Jen, who, having recently been dumped by her boyfriend, is vacationing in Nice with her parents (Tom Selleck and Catherine O\\'Hara). Enter Spencer (Ashton Kutcher), a hired assassin (hey, it\\'s a comedy) who happens to be on the scene for a job. The couple\\'s cutesy flirting turns into a romantic dinner, which leads to some heavy drinking… and before you know it, Spencer has renounced the killing gig, married Jen, and moved back to her hometown in the States, where he becomes a \"corporate consultant.\" Three years later his past catches up to him, as we knew it would, and a seemingly limitless array of hired guns emerges from the woodwork, intent on collecting the $20 million bounty that\\'s been put on Spencer\\'s head. Exactly why this is, and who\\'s responsible for it, are secrets revealed only at the end, although perspicacious viewers will no doubt have seen it coming. In the meantime, Spencer\\'s revelation of who he really is and Jen\\'s reaction to it are mildly reminiscent of the Arnold Schwarzenegger-Jamie Lee Curtis relationship in', 'True Lies', \", as issues of trust, safety, and Jen's newly discovered pregnancy complicate Spencer's attempts to keep the two of them alive while he tries to figure out what's going on. Director Robert Luketic displays a sure hand during the action sequences, but he's working with a thin script and a pair of attractive young actors whose chemistry doesn't exactly burn up the screen. Those are serious drawbacks, but all in all, there are far worse ways to kill a couple of hours than watching\", 'Killers', '.', '--Sam Graham']\n{'Genre': 'Comedy', 'Format': 'AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Multiple Formats', 'Contributor': 'Ashton Kutcher, Katherine Heigl, Robert Luketic', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'LGT28895DVD', 'Director': 'Robert Luketic', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Multiple Formats', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Katherine Heigl, Ashton Kutcher', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nWe have watched this movie multiplied times, and always enjoy it.  The plot is great, and the casting is perfect.  Really funny!\nVery funny\nHoratio Hornblower: Collector's Edition [DVD]\nIoan Gruffudd  (Actor),     Andrew Grieve  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, A&E Home Video, All A&E Titles\n[\"From midshipman to commander, experience the thrilling escapades of the ultimate high-seas hero with the HORATIO HORNBLOWER COLLECTOR'S EDITION, an eight-volume treasure chest of sweeping naval adventure and lavish historical drama. Joining the British Royal Navy at the outset of the Napoleonic Wars, the enterprising Horatio Hornblower rises quickly from raw recruit to seasoned sailor, charting a course from the West Indies to the coast of Africa in the name of the Crown. Along the way he encounters roiling sea battles, mutiny, plague and love, but always proves himself equal to the task. Gorgeously filmed and richly produced, A&E's Emmy®-winning adaptations of C.S. Forester's classic novels star Ioan Gruffudd (Fantastic Four, Black Hawk Down) and a stellar supporting cast that includes Robert Lindsay (Wimbledon), Jamie Bamber (Band of Brothers) and Paul Copley (Queer as Folk). The HORATIO HORNBLOWER COLLECTOR'S EDITION contains all eight feature-length Hornblower films (with many a bonus material below deck): The Duel, The Fire Ships, The Duchess and the Devil, The Wrong War, The Mutiny, Retribution, Loyalty, DutyDVD Features: Exclusive Interview with Ioan Gruffudd; Filmmaker Commentary on Loyalty and Duty ; 3 Bonus Programs: England s Royal Warships, Sail 2000: Aboard the Eagle, and The Making of Horatio Hornblower ; About C.S. Forester; Nautical Terms and Definitions; Interactive 3D Naval Cannon; Guide to Royal Warships; C.S. Forester Biography; Cast and Crew Biographies; Photo Gallery; Interactive Menus; Scene Selection\"]\n{'Genre': 'Military & War', 'Format': \"Box set, Collector's Edition, Color, DVD, NTSC\", 'Contributor': 'Ioan Gruffudd, Andrew Grieve', 'Language': 'Unqualified', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.5 inches; 15.04 Ounces', 'Item model number': 'AAAE116930', 'Director': 'Andrew Grieve', 'Media Format': \"Box set, Collector's Edition, Color, DVD, NTSC\", 'Run time': '13 hours and 20 minutes', 'Release date': 'September 23, 2008', 'Actors': 'Ioan Gruffudd', 'Studio': 'A&E Home Video', 'Number of discs': '8'}\nBoth my husband and I thoroughly enjoyed the entire 8 disc set!  Every disc was a feature-length film, and every film had you on the edge of your seat, and we could hardly wait to see the next one!<br />So much focus on honor, honesty, loyalty, dignity, integrity...the acting, costumes, incredible sets; everything was superb...truly a gem of a find compared to the pathetic offerings of hollywood these days.<br />We will enjoy this series many more times, and we both recommend it without hesitation.\nSuperb in every way!\nSecondhand Lions (2003)\nMichael Caine  (Actor),     Robert Duvall  (Actor),     Tim McCanlies  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Secondhand Lions (DVD) (WS/FS)', \"Over one unpredictable Central Texas summer in the early 1960s, everything in the lives of a family of strangers is about to change forever... For 14-year old Walter (Haley Joel Osment), his great uncles' farm in rural Texas is the last place on earth he wants to spend the summer. Eccentric and gruff Hub and Garth McCaan (Robert Duvall and Michael Caine) are rumored to have been bank robbers, mafia hit men and/or war criminals in their younger days. But little by little, through stories spun against a backdrop of the dusty Texas night, an amazing tale comes to life via Walter's vivid, colorful imaginings--a tale set in a long-ago exotic, mysterious place where men rode stallions and fought with swords; where beautiful princesses tangled with treacherous sheiks; and where the two unlikely heroes lived an adventure of which most people only dream.\", ']]>']\n{'Genre': 'Drama, Comedy, Mystery & Suspense', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Anamorphic, Dolby, NTSC, Subtitled, Full Screen, WidescreenMultiple Formats, AC-3, Closed-captioned, Color, Anamorphic, Dolby, NTSC, Subtitled, Full Screen, Widescreen  See more', 'Contributor': \"Kyra Sedgwick, Michael Caine, Nicky Katt, Eric Balfour, Robert Duvall, Mark Kaufman, Michael O'Neill, Tim McCanlies, Kevin Cooper, Scott Ross, David Kirschner, Corey Sienega, Haley Joel Osment, Janis Rothbard Chaskin, Christian Kane, Karen Loop, Deirdre O'Connell, Emmanuelle Vaugier, Toby EmmerichKyra Sedgwick, Michael Caine, Nicky Katt, Eric Balfour, Robert Duvall, Mark Kaufman, Michael O'Neill, Tim McCanlies, Kevin Cooper, Scott Ross, David Kirschner, Corey Sienega, Haley Joel Osment, Janis Rothbard Chaskin, Christian Kane, Karen Loop, Deirdre O'Connell, Emmanu…  See more\", 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, English (Dolby Digital 5.1 EX)', 'Number Of Discs': '1', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '794043690426', 'Director': 'Tim McCanlies', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Anamorphic, Dolby, NTSC, Subtitled, Full Screen, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'September 12, 2006', 'Actors': 'Michael Caine, Robert Duvall, Haley Joel Osment, Nicky Katt, Kyra Sedgwick', 'Subtitles': 'English, Spanish', 'Producers': 'Toby Emmerich, David Kirschner, Mark Kaufman, Scott Ross, Corey Sienega', 'Studio': 'WarnerBrothers', 'Writers': 'Tim McCanlies', 'Number of discs': '1'}\nWe love this movie, and bought this copy to send to a friend.  He and his wife loved it and shared it with their friends.  A truly great cast and a very fun and original story-line.  Highly recommend this movie!\nWhat a classic!\nDear Frankie\nEmily Mortimer  (Actor),     Jack McElhone  (Actor),     Shona Auerbach  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n{'Genre': 'Action & Adventure', 'Format': 'Widescreen, Dolby, Color, Closed-captioned, NTSC, Digital Sound', 'Contributor': 'Rony Bridges, François Ivernel, Caroline Wood, Andrea Gibb, Katy Murphy, Gerard Butler, Angus Finney, Sharon Small, Sean Brown, Jayd Johnson, Anna Hepburn, Jack McElhone, Mary Riggans, Cameron McCracken, Shona Auerbach, Duncan Reid, Brian Kaczynski, Sophie Main, Emily Mortimer, Douglas Stewart WallaceRony Bridges, François Ivernel, Caroline Wood, Andrea Gibb, Katy Murphy, Gerard Butler, Angus Finney, Sharon Small, Sean Brown, Jayd Johnson, Anna Hepburn, Jack McElhone, Mary Riggans, Cameron McCracken, Shona Auerbach, Duncan Reid, Brian Kaczynski, Sop…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '7.56 x 5.31 x 0.55 inches; 3.84 Ounces', 'Director': 'Shona Auerbach', 'Media Format': 'Widescreen, Dolby, Color, Closed-captioned, NTSC, Digital Sound', 'Run time': '1 hour and 45 minutes', 'Actors': 'Emily Mortimer, Jack McElhone, Gerard Butler, Mary Riggans, Sharon Small', 'Subtitles': 'Spanish', 'Producers': 'Angus Finney, Brian Kaczynski, Cameron McCracken, Caroline Wood, Duncan Reid', 'Studio': 'Miramax', 'Writers': 'Andrea Gibb', 'Number of discs': '1'}\nEmily Mortimer, Gerard Butler, and all the rest of the cast do a superb job in making this story feel so very sweet and real!  A unique story-line, when other films are becoming so run-of-the-mill in 'same-ness'.<br />If you're looking for something with more of a 'reality' quality to it than the flashy, fleshy offerings of today's movies, get it.\nSuch a sweet film!\nThe Impossible (Dvd,2012)\nFormat: DVD\nMovies & TV, Featured Categories, DVD\n{}\nTruly a miraculous story, of just one of the many many many families affected and changed forever by that devastating event.\nIncredible.\nLost in Austen\nJemima Rooper  (Actor),     Gemma Arterton  (Actor),     Dan Zeff  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Jane Austen on DVD Store, All Titles\n[\"Amanda Price is sick of the modern world. She yearns for the romance and elegance found in the books by her favorite author, Jane Austen. But she's about to get a rude awakening as one fateful evening, she is propelled into the scheming 19th century world of Pride and Prejudice while that book's Elizabeth Bennet is hurled into hers. As the book's familiar plot unfolds, Amanda triggers new romantic twists and turns within the Bennet family circle as she clumsily tries to help the sisters nab husbands and even captivates the tantalizing Mr. Darcy herself. But what about Elizabeth...and what will become of one of the world's greatest love stories?\", 'Stills from', 'Lost in Austen', '(Click for larger image)']\n{'Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Gemma Arterton, Christina Cole, Tom Mison, Jemima Rooper, Alex Kingston, Morven Christie, Hugh Bonneville, Ruby Bentall, Perdita Weeks, Guy Henry, Dan Zeff, Tom Riley, Florence Hoath, Elliot CowanGemma Arterton, Christina Cole, Tom Mison, Jemima Rooper, Alex Kingston, Morven Christie, Hugh Bonneville, Ruby Bentall, Perdita Weeks, Guy Henry, Dan Zeff, Tom Riley, Florence Hoath, Elliot Cowan  See more', 'Language': 'Unqualified', 'Runtime': '3 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 3.2 Ounces', 'Director': 'Dan Zeff', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '3 hours', 'Release date': 'April 14, 2009', 'Actors': 'Jemima Rooper, Gemma Arterton, Elliot Cowan, Hugh Bonneville, Florence Hoath', 'Subtitles': 'English, Spanish', 'Studio': 'Image Entertainment', 'Number of discs': '1'}\nThis has become a favorite with both my husband and I! Very creative, original, funny, charming, surprising, heartwarming...excellent!\nExceeded our expectations!\nAustenland\nKeri Russell  (Actor),     JJ Field  (Actor),     Jerusha Hess  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Jane Hayes’s (Keri Russell) adoration of all things Jane Austen is complicating her love life. Determined to be the heroine of her own story, Jane spends her life savings on a trip to Austenland, an eccentric resort where guests experience complete immersion in the Regency era. Armed with her bonnet, corset and needlepoint, Jane strives to avoid spinsterhood … but has a difficult time determining where fantasy ends and real life—and maybe even love—begins. Jennifer Coolidge (Legally Blonde) and Jane Seymour (Wedding Crashers) also star in this charming romantic comedy.']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'JJ Field, Jennifer Coolidge, Keri Russell, Jerusha Hess', 'Language': 'English', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '28930037', 'Director': 'Jerusha Hess', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'February 11, 2014', 'Actors': 'Keri Russell, JJ Field, Jennifer Coolidge', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a fun, silly, flaky film, that surprisingly to me, my husband really enjoyed!  Our favorite of these types of modern-chick-in-love-with-Jane-Austen movies is &#34;Lost In Austen&#34; but this is a close second.\nFun!\nAgatha Christie's Poirot, Series 7 & 8\nDavid Suchet  (Actor),     Hugh Fraser  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n['As seen on A&E  Agatha Christie’s beloved detective solves complex cases with flair and finesse in these four feature-length mysteries from the hit series. Set amid the unparalleled elegance of the Art Deco era, these beautifully remastered adaptations star David Suchet as Poirot, Hugh Fraser (', 'Sharpe', ') as Captain Hastings, Philip Jackson (', 'Little Voice', ') as Chief Inspector Japp, and Pauline Moran as Miss Lemon. Guest stars include Russell Tovey (', 'Little Dorrit', ') and Jamie Bamber (', 'Battlestar Galactica', ').  THE MYSTERIESOriginal U.K. broadcast order', 'The Murder of Roger Ackroyd', '—Poirot’s much-needed retreat to the countryside is interrupted by the murder of a prosperous industrialist.', 'Lord Edgware Dies', '—Following the death of a loathsome aristocrat, Poirot is stymied by his suspects’ ironclad alibis.', 'Murder in Mesopotamia', '—The detective travels to Iraq and finds himself embroiled in a web of rivalries, jealousy, and murder at an archaeological dig.', 'Evil Under the Sun', '—A sojourn in Devon turns into an investigation for Poirot after the body of a beautiful young woman is found on the beach.']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Pauline Moran, David Suchet, Philip Jackson, Hugh Fraser', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Item model number': 'unknown', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 52 minutes', 'Release date': 'October 1, 2013', 'Actors': 'David Suchet, Hugh Fraser, Philip Jackson, Pauline Moran', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Number of discs': '1'}\nWe so enjoy all of the Poirot we've watched with David Suchet as the lead!  All of the acting is superb, and the costumes, sets, and mysteries are interesting and will hold your attention.\nExcellent!\nAgatha Christie's Poirot, Series 9\nDavid Suchet  (Actor),     Hugh Fraser  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n['Now remastered & in original U.K. broadcast order Mysteries previously released on DVD.  As seen on A&E  Agatha Christie’s astute Belgian detective is on the case in these four feature-length mysteries from the hit series. Beautifully remastered, these definitive adaptations capture the unrivaled elegance of the Art Deco era. David Suchet stars as “a near-perfect Poirot” (', 'USA Today', '), with guest stars including Toby Stephens, Aidan Gillen, Edward Fox, Phyllis Logan, Barbara Flynn, Judy Parfitt, Marc Warren, JJ Feild, Paul McGann, Gemma Jones, and Emily Blunt.  THE MYSTERIES (original U.K. broadcast order)', 'Five Little Pigs', '—Fourteen years after Caroline Crale was executed for murdering her husband, Lucy Crale asks Poirot to prove her mother’s innocence.', 'Sad Cypress', '—A beautiful young socialite stands convicted of murder, and Poirot races to reinvestigate before her sentence is carried out.', 'Death on the Nile', '—Poirot intervenes when a jilted woman harasses a newlywed couple, but their honeymoon river cruise turns deadly nonetheless.', 'The Hollow', '—Invited for a weekend in the country with the Angkatell clan, Poirot untangles the family’s love affairs in the quest for a killer.']\n{'Genre': 'Television/British Television, Television/Crime', 'Format': 'Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Pauline Moran, David Suchet, Philip Jackson, Hugh Fraser', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '2', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '27621865', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 32 minutes', 'Release date': 'October 29, 2013', 'Actors': 'David Suchet, Hugh Fraser, Philip Jackson, Pauline Moran', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Number of discs': '2'}\nWe purchased &#34;Poirot: The Early Cases&#34; a year or so ago, and became hopelessly addicted to Poirot mysteries! We have since acquired some of these later series, and they are still of such high quality and character that we watch them over and over again.<br />One thing I've sadly noticed on these later offerings is the insertion of bad language here and there, and some bedroom scenes that really aren't necessary.<br />Otherwise, David Suchet 's portrayal of Poirot is still so perfectly played, and once in awhile Capt. Hastings and Ms. Lemon even show up, adding to the sparkle and fun of these wonderful series.<br />Can't wait to watch series 13 when we are able to acquire it!\nSo utterly enjoyable!\nAgatha Christie's Poirot, Series 10\nDavid Suchet  (Actor),     Hugh Fraser  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Now remastered & in original U.K. broadcast order.  As seen on A&E  Agatha Christie’s famous Belgian detective puts his “little grey cells” to work in these four feature-length mysteries from the hit series. These definitive adaptations have been beautifully remastered to capture all the sparkling details of the Art Deco era. David Suchet “is pure Poirot” (', 'The New York Times', '), with guest stars including Michael Fassbender, Elliott Gould, Lindsay Duncan, Alice Eve, Honeysuckle Weeks, Lucy Punch, James D’Arcy, and Zoë Wanamaker as Ariadne Oliver.  THE MYSTERIES (original U.K. broadcast order)', 'The Mystery of the Blue Train', '—When a wealthy woman is brutally murdered aboard a train, Poirot searches both for the killer and the victim’s priceless jewel.', 'Cards on the Table', '—A mysterious man invites Poirot to a dinner party—only to wind up dead during a bridge game.', 'After the Funeral', '—Poirot visits Enderby Hall to investigate the Abernethie family after two siblings die in short order.', 'Taken at the Flood', '—Poirot becomes involved with the wealthy Cloade family, whose past tragedies still haunt them.  Mysteries previously released on DVD.']\n{'Genre': 'Television/British Television, Television/Crime', 'Format': 'Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Pauline Moran, David Suchet, Philip Jackson, Hugh Fraser', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '28131051', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 28 minutes', 'Release date': 'November 26, 2013', 'Actors': 'David Suchet, Hugh Fraser, Philip Jackson, Pauline Moran', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Number of discs': '2'}\nWe purchased &#34;Poirot: The Early Cases&#34; a year or so ago, and became hopelessly addicted to Poirot mysteries! We have since acquired some of these later series, and they are still of such high quality and character that we watch them over and over again.<br />One thing I've sadly noticed on these later offerings is the insertion of bad language here and there, and some bedroom scenes that really aren't necessary.<br />Otherwise, David Suchet 's portrayal of Poirot is still so perfectly played, and once in awhile Capt. Hastings and Ms. Lemon even show up, adding to the sparkle and fun of these wonderful series.<br />Can't wait to watch series 13 when we are able to acquire it!\nSo enjoyable!\nThe Redemption of Henry Myers\nDrew Waters  (Actor),     Erin Bethea  (Actor),     Clayton Miller  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Musicals & Performing Arts\n[\"An outlaw beyond all hope. A love beyond all limits. Henry Myers (Drew Waters from Breaking Bad, Friday Night Lights, The Hit List, Cowgirls 'n Angels) lives a hard life. Getting through life on the frontier however he can' even if it means robbing a bank. After his latest heist goes wrong and his partners betray him and leave him for dead, Henry is surprised to find extraordinary kindness from a widow named Marilyn (Erin Bethea from Fireproof, Facing The Giants, Letters To God) and her children. With the influence of this family, Henry begins to question the choices he's made in his life. Just when things begin to make sense again, it's all ripped away from him when his old partners show up. Will he seek the revenge he desires or finally find his redemption'\"]\n{'Genre': 'Westerns', 'Format': 'Multiple Formats, Color, Subtitled, NTSC', 'Contributor': 'Clayton Miller, Drew Waters, Erin Bethea', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '128934', 'Director': 'Clayton Miller', 'Media Format': 'Multiple Formats, Color, Subtitled, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 10, 2014', 'Actors': 'Drew Waters, Erin Bethea', 'Subtitles': 'English', 'Studio': 'Echolight Studios', 'Number of discs': '1'}\nThis is a masterfully made western movie with every attention to detail to make it look authentic to the time being depicted.  Truly touching with a Christ-centered theme of the Lord's willingness to forgive, save and transform every person, no matter what their background or what they've done in their lives. A beautiful story for the entire family, with some really funny moments, and a wonderful twist!  Don't miss it!\nExcellent, first-class movie all the way!",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user has a broad appreciation for classic and contemporary dramas, especially Agatha Christie adaptations, while also embracing heartfelt narratives in genres such as Westerns that explore themes of redemption and transformation.\n\n- **Preferred Content Style:** They favor intelligent, humorous writing that weaves together heartfelt drama and comedy, particularly valuing romantic and uplifting storylines that resonate across different contexts.\n\n- **Visual and Production Quality:** High aesthetic appeal remains crucial, as the user seeks visually stunning productions with meticulous attention to detail, enhancing their immersive experience.\n\n- **Actors:** They are attracted to established actors who can evoke emotional connections, emphasizing a preference for performances that enrich the storytelling experience, irrespective of genre.\n\n- **Engagement Level:** The user actively engages with content that delivers an emotional impact, but will quickly disengage from subpar offerings. Their recent interactions indicate an appreciation for narratives that combine authenticity with humor.\n\n- **Rating Behavior:** They consistently assign high ratings to emotionally resonant content, enthusiastically recommending fulfilling narratives across various genres to others.\n\n- **Cultural Appreciation:** The user values well-crafted narratives, enjoying intricate character-driven stories that explore deeper themes, whether in adaptations or original works. Recent reviews reflect their enjoyment of quality storytelling with Christian themes, highlighting an openness to diverse yet meaningful narratives.",
  "metrics": {
    "rouge1_f": 0.04373014389833675,
    "rouge2_f": 0.003365114974761638,
    "rougeL_f": 0.022425714819659878,
    "meteor": 0.01243315755019605,
    "bleu1": 3.7639621070766905e-12,
    "bleu2": 1.026288408750648e-12,
    "bleu3": 3.331527945342872e-13,
    "bleu4": 1.068387786471913e-13,
    "bertscore_precision": 0.3395053744316101,
    "bertscore_recall": 0.5092637538909912,
    "bertscore_f1": 0.4074082672595978
  }
}