{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2011/12/28\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Alfredson'], 'Producers': ['Ole Sandberg', 'Peter Nadermann', 'Jon Mankell', 'Anni Faurbye Fernandez', 'Lone Korslund', 'Jenny Gilbertsson', 'Mikael Wallen'], 'Starring': ['Noomi Rapace', 'Michael Nyqvist', 'Lena Endre']}\nReview Text: I had seen Girl with the Dragon Tattoo and now this one. There was enough carryover explaining the money and a couple of the original questions were resolved i.e. about her father. There is much more that I believe will be disclosed in the third film and I am eager to see that one. I love Amazon Prime even though the only benefit I get from it is the free films but that alone makes it worth while. Films like this series are what it is all about.<br /><br />Having seen the first film with sub-titles which left a lot to be desired in being able to read them, I was glad to find the dubbed version. I felt the dubbing was quite well done and made it far more enjoyable. I read some of the reviews and perhaps if I had read the books I might not have enjoyed this as much. I definitely will try to read them as I believe they will flesh this out with other material not shown in the film.<br /><br />I felt the acting in this, as in the first film, was excellent and Lisbeth is well portrayed. Mikael was a stronger character in the first film but his continued role carries the storyline along. This might actually be better for NOT having read the book as I read that areas were cut out. I personally liked it very much and am eager to see the last film tomorrow night.\nReview Title: Powerful storyline\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Yellow Submarine\nGeorge Dunning (II)  (Actor),     John Clive  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Music Artists, The Beatles, Feature Films\n['Product description', 'Australia released, NTSC/Region 0 DVD: LANGUAGES: English ( Dolby Digital 5.1 ), English ( Mono ), English ( Subtitles ), French ( Subtitles ), WIDESCREEN, SPECIAL FEATURES: Behind the scenes, Booklet, Cast/Crew Interview(s), Commentary, Featurette, Interactive Menu, Remastered, Scene Access, Storyboards, Trailer(s), SYNOPSIS: The Beatles agree to accompany Captain Fred in his Yellow Submarine and go to Pepperland to free it from the music hating Blue Meanies . ...The Beatles - Yellow Submarine', 'Amazon.com', \"This restored, animated valentine to the Beatles offers viewers the rare chance to see a work that's been substantially improved by its technical facelift, not just supersized with extra footage. Recognizing that its song-studded soundtrack alone makes\", 'Yellow Submarine', 'a video annuity, United Artists has lavished a frame-by-frame refurbishment of the original feature, while replacing its original monaural audio tracks with a meticulously reconstructed stereo mix that actually refines legendary original album versions.', \"What emerges is a vivid time capsule of the late '60s and a minor milestone in animation. The music represents the quartet's zenith--\", 'Rubber Soul', ',', 'Revolver', ', and', \"Sgt. Pepper's Lonely Hearts Club Band\", \". The story line, cobbled together by producer Al Brodax and a committee of writers, is a broad, feather-light allegory set in idyllic Pepperland, where the gentle citizens are threatened by the nasty, music-hating Blue Meanies and their surreal arsenal of henchmen, with the Beatles enlisted to thwart the bad guys. Visually, designer Heinz Edelmann mixes the biomorphic squiggles, day-glo palette, and Beardsley-esque portraits of Peter Max with rotoscoped still photographs and film; Edelmann's animated collages also nod to Andy Warhol and Magritte in properly psychedelic fashion, which works wonderfully with such terrific songs.\", \"High orthodox Beatlemaniacs can still grouse that the animated Fab Four are (literally) flat archetypes, but that's missing the sheer bloom of the music or the giddy, campy fun of the visuals. Making sense of the story is second to submerging blissfully in the sights and sounds of this video treat.\", '--Sam Sutherland', 'Additional Features', 'The scope of', 'Yellow Submarine', '\\'s 1999 restoration is idealized on the DVD version, which beyond its slightly letterboxed original aspect adds a stunning 5.1 sound mix that showcases the audio team\\'s wizardry; music fans can hear the entire score without dialogue, the better to focus on such revelations as \"Nowhere Man,\" boasting a gorgeous, full-stereo chorus, and \"Only a Northern Song,\" with a first-time-ever stereo mix that exploits the full surround array for appropriately mind-blowing effect. Other special features include three storyboarded sequences, two of which are not seen in the final film; behind-the-scenes photos and featurette; a full-length audio commentary; and the original theatrical trailer.', '--Sam Sutherland', 'See more']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 3.81 Ounces', 'Media Format': 'Animated, Color, Closed-captioned, Dolby, DVD, NTSC, Letterboxed, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'September 14, 1999', 'Actors': 'George Dunning (II), John Clive, Paul McCartney, Geoffrey Hughes, Ringo Starr', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nI know this film had lousy reviews but I love the graphics and the music so for me it was a good purchase.  My 8 year old granddaughter had a birthday party with under the sea theme so she enjoyed this as well.  Not for everyone though.\nExactly what I expected and wanted.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Alfredson'], 'Producers': ['Ole Sandberg', 'Peter Nadermann', 'Jon Mankell', 'Anni Faurbye Fernandez', 'Lone Korslund', 'Jenny Gilbertsson', 'Mikael Wallen'], 'Starring': ['Noomi Rapace', 'Michael Nyqvist', 'Lena Endre']}\nI had seen Girl with the Dragon Tattoo and now this one. There was enough carryover explaining the money and a couple of the original questions were resolved i.e. about her father. There is much more that I believe will be disclosed in the third film and I am eager to see that one. I love Amazon Prime even though the only benefit I get from it is the free films but that alone makes it worth while. Films like this series are what it is all about.<br /><br />Having seen the first film with sub-titles which left a lot to be desired in being able to read them, I was glad to find the dubbed version. I felt the dubbing was quite well done and made it far more enjoyable. I read some of the reviews and perhaps if I had read the books I might not have enjoyed this as much. I definitely will try to read them as I believe they will flesh this out with other material not shown in the film.<br /><br />I felt the acting in this, as in the first film, was excellent and Lisbeth is well portrayed. Mikael was a stronger character in the first film but his continued role carries the storyline along. This might actually be better for NOT having read the book as I read that areas were cut out. I personally liked it very much and am eager to see the last film tomorrow night.\nPowerful storyline",
  "profile": "**User Profile Summary:**\n\n- **Primary Interests:** The user continues to showcase a clear preference for animated films with music elements but has expanded their interest to include compelling drama films, particularly those that are part of a series, reflecting an appreciation for complex storytelling and character development.\n\n- **Entertainment Style:** Maintains an affinity for vibrant graphics and creative storytelling, now also demonstrating an appreciation for intense narratives and well-crafted characters, as seen in their recent viewing experiences.\n\n- **Social Engagement:** Engages with media alongside family, particularly with a younger audience, while also enjoying more mature content for personal viewing, suggesting a balanced approach to their film choices.\n\n- **Critical Reception Awareness:** Remains aware of critical reception, but prioritizes personal enjoyment, evidenced by positive ratings for films that may not have received widespread acclaim.\n\n- **Format Preferences:** Prefers DVD formats for movies, valuing the physical experience and supplementary features, while also utilizing streaming services for convenience.\n\n- **Rating Behavior:** Consistently rates films positively, reflecting a tendency to seek out and recognize quality experiences, regardless of critical consensus. The user appreciates well-executed dubbing in films, enhancing their overall enjoyment.\n\nThis profile illustrates a user who enjoys a wide range of cinematic experiences—from vibrant animated films to gripping dramas—valuing both artistic merit and family engagement in their media consumption.",
  "metrics": {
    "rouge1_f": 0.16042780748663102,
    "rouge2_f": 0.0125,
    "rougeL_f": 0.07130124777183601,
    "meteor": 0.058998479069890204,
    "bleu1": 0.011901418037988633,
    "bleu2": 0.0036132981479784815,
    "bleu3": 0.00054257260555734,
    "bleu4": 0.00021044386827485608,
    "bertscore_precision": 0.3677735924720764,
    "bertscore_recall": 0.4756161570549011,
    "bertscore_f1": 0.41480007767677307
  }
}