{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/02/16\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Vidano'], 'Producers': ['Frederick A. Larson', 'Adrian Chynoweth'], 'Starring': ['Frederick A. Larson', 'Dr. Jeffrey Miller', 'Lisbeth Splawn'], 'Studio': ['Gravitas Ventures']}\nReview Text: Not professionally presented...used cheap labor!\nReview Title: Excelkent - fascinating but not professional presentation.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Jane Fonda: Prime Time – Fit & Strong\nJane Fonda  (Actor),     Darren Capik  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Product Description', 'Staying active has been my key to aging successfully. Regular exercise not only burns calories, it also dramatically improves both body and brain functions. My', 'Fit & Strong', 'DVD includes two 25-minute workouts that will burn fat, tone and shape every major muscle group and strengthen your core. Make a habit of doing these workouts and you’ll look and feel your best.', 'Amazon.com', 'As Jane Fonda strides into her 70s, she is still focused on and committed to fitness. Her', 'Fit & Strong', 'workout is geared to older exercisers, or those who simply are starting out. There are two 25-minute workouts on this DVD, a Level 1 and a Level 2. Both can be done seated and standing, with light weights (which can be increased for a more challenging workout). These workouts get at nearly every muscle group, gently but thoroughly. There are also excellent stretches included and great tips on daily activities, posture, and the like. What is most endearing and touching about', 'Fit & Strong', \"is not necessarily the workouts--we expect Fonda to deliver and she does. But it's Fonda's supportive tone and discussions at the beginning of the workouts and throughout the movements that set\", 'Fit & Strong', \"apart. Fonda is understanding about the disconnected feeling many people, especially older people, have about their bodies, and how feeling reconnected stimulates not just the body, but the mind and the soul. Fonda says it's OK to be wherever you are in your fitness level--and she takes it from there. It's as supportive an environment as any exerciser could possibly want, and it makes the routines go more quickly. Fonda has become the exerciser's true friend, and in\", 'Fit & Strong', 'that becomes one of the best reasons to keep coming back to do the routines. Anyone of any fitness level can start', 'Fit & Strong', \"immediately and feel results--and that's a great gift, at any age. --\", 'A.T. Hurley']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '440809509', 'Director': 'Darren Capik', 'Media Format': 'Multiple Formats, Color, Closed-captioned, Full Screen, Dolby, NTSC', 'Run time': '50 minutes', 'Release date': 'November 30, 2010', 'Actors': 'Jane Fonda', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nImportant to have in collection.  Well presented! Fonda wears well!  Admire her continued evolution with dedication to basics and awareness, presentation with patience.\nMust for Seniors\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brent G Miller Jr'], 'Studio': ['Ingenuity Films']}\nAccurate‼️\nAccurate!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Film Ideas', 'Inc.'], 'Producers': ['Sharron Hawkes', 'Thebe Medupe', 'Anne Rogers', 'Rachael Thomas', 'Karen Viljoen'], 'Studio': ['Film Ideas', 'Inc.']}\nWorthwhile info‼️\nInformative-fascinating!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['The Great Courses'], 'Starring': ['Amanda H. Podany'], 'Studio': ['The Great Courses']}\nInfo variety!\nEnjoyed history lesson!\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Vidano'], 'Producers': ['Frederick A. Larson', 'Adrian Chynoweth'], 'Starring': ['Frederick A. Larson', 'Dr. Jeffrey Miller', 'Lisbeth Splawn'], 'Studio': ['Gravitas Ventures']}\nNot professionally presented...used cheap labor!\nExcelkent - fascinating but not professional presentation.",
  "profile": "**Updated User Profile Summary:**\n\n- **Fitness and Learning Enthusiast:** The user continues to value fitness and educational content that caters to varied interests and levels, particularly for older adults. They appreciate resources that enhance both physical and mental well-being alongside intellectually stimulating materials.\n\n- **Supportive Environment:** The user seeks engaging workout and educational content presented in a positive tone, favoring instructors who are relatable and understanding—particularly for individuals feeling disconnected from their personal journeys.\n\n- **Commitment to Longevity:** Focusing on staying active and healthy as a means to age successfully, the user demonstrates a dedication to fitness and lifelong learning.\n\n- **Structured and Engaging Content:** The user prefers well-presented, structured formats that integrate diverse areas like strength, flexibility, and informative guidance, maintaining a balanced approach in both fitness and educational pursuits.\n\n- **Discernment in Feedback & Ratings:** The user recently provided a positive review with a rating of 5.0, reflecting their appreciation for content that remains intellectually engaging, despite concerns about the professionalism of its presentation. This contributes to their history of high ratings (typically around 4.9 to 5.0), emphasizing their discerning nature regarding quality and effectiveness.\n\nOverall, the updated profile reveals the user’s ongoing commitment to supportive, accessible fitness programs and enriching educational experiences, while highlighting their critical perspective on presentation quality in the resources they choose to engage with.",
  "metrics": {
    "rouge1_f": 0.2787096774193548,
    "rouge2_f": 0.025873221216041395,
    "rougeL_f": 0.1032258064516129,
    "meteor": 0.08158508158508158,
    "bleu1": 0.04425168247010629,
    "bleu2": 0.010497882750935494,
    "bleu3": 0.0016620190152465478,
    "bleu4": 0.0006619117679937424,
    "bertscore_precision": 0.35617297887802124,
    "bertscore_recall": 0.45500728487968445,
    "bertscore_f1": 0.39956915378570557
  }
}