{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/02/16\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brent G Miller Jr'], 'Studio': ['Ingenuity Films']}\nReview Text: Accurate‼️\nReview Title: Accurate!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Jane Fonda: Prime Time – Fit & Strong\nJane Fonda  (Actor),     Darren Capik  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Product Description', 'Staying active has been my key to aging successfully. Regular exercise not only burns calories, it also dramatically improves both body and brain functions. My', 'Fit & Strong', 'DVD includes two 25-minute workouts that will burn fat, tone and shape every major muscle group and strengthen your core. Make a habit of doing these workouts and you’ll look and feel your best.', 'Amazon.com', 'As Jane Fonda strides into her 70s, she is still focused on and committed to fitness. Her', 'Fit & Strong', 'workout is geared to older exercisers, or those who simply are starting out. There are two 25-minute workouts on this DVD, a Level 1 and a Level 2. Both can be done seated and standing, with light weights (which can be increased for a more challenging workout). These workouts get at nearly every muscle group, gently but thoroughly. There are also excellent stretches included and great tips on daily activities, posture, and the like. What is most endearing and touching about', 'Fit & Strong', \"is not necessarily the workouts--we expect Fonda to deliver and she does. But it's Fonda's supportive tone and discussions at the beginning of the workouts and throughout the movements that set\", 'Fit & Strong', \"apart. Fonda is understanding about the disconnected feeling many people, especially older people, have about their bodies, and how feeling reconnected stimulates not just the body, but the mind and the soul. Fonda says it's OK to be wherever you are in your fitness level--and she takes it from there. It's as supportive an environment as any exerciser could possibly want, and it makes the routines go more quickly. Fonda has become the exerciser's true friend, and in\", 'Fit & Strong', 'that becomes one of the best reasons to keep coming back to do the routines. Anyone of any fitness level can start', 'Fit & Strong', \"immediately and feel results--and that's a great gift, at any age. --\", 'A.T. Hurley']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '440809509', 'Director': 'Darren Capik', 'Media Format': 'Multiple Formats, Color, Closed-captioned, Full Screen, Dolby, NTSC', 'Run time': '50 minutes', 'Release date': 'November 30, 2010', 'Actors': 'Jane Fonda', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nImportant to have in collection.  Well presented! Fonda wears well!  Admire her continued evolution with dedication to basics and awareness, presentation with patience.\nMust for Seniors\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brent G Miller Jr'], 'Studio': ['Ingenuity Films']}\nAccurate‼️\nAccurate!",
  "profile": "**User Profile Summary:**\n\n- **Fitness Enthusiast:** The user values fitness and wellness, particularly for older adults. They appreciate programs that cater to different fitness levels and emphasize both physical and mental well-being.\n\n- **Supportive Environment:** The user prefers workout content that offers encouragement and a positive tone, favoring instructors who are understanding and relatable, especially for those who may feel disconnected from their fitness journey.\n\n- **Commitment to Longevity:** They focus on the importance of staying active as a means to age successfully, indicating a commitment to maintaining health over time.\n\n- **Preference for Structured Workouts:** The user enjoys well-presented, structured workout formats that include a balance of workouts and supportive guidance, highlighting an interest in a comprehensive approach to fitness that integrates both strength and flexibility.\n\n- **Positive Feedback & Ratings:** The user tends to leave enthusiastic reviews, reflecting their satisfaction with content that resonates with their values of inclusivity and effective fitness tracking. Recently, they rated a product 5.0, praising its accuracy, which underscores their preference for high-quality, reliable fitness materials.\n\nOverall, this user profile showcases a genuine appreciation for fitness programs that are accessible, supportive, and tailored to individuals looking to maintain or improve their health as they age. Their commitment to evaluating product quality highlights their discerning approach towards fitness content.",
  "metrics": {
    "rouge1_f": 0.30357142857142855,
    "rouge2_f": 0.03283582089552239,
    "rougeL_f": 0.11011904761904762,
    "meteor": 0.10726981510967364,
    "bleu1": 0.09024083545019283,
    "bleu2": 0.024163000108804206,
    "bleu3": 0.0037836471917308133,
    "bleu4": 0.0014986473950316668,
    "bertscore_precision": 0.3831407129764557,
    "bertscore_recall": 0.46921131014823914,
    "bertscore_f1": 0.42183029651641846
  }
}