{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: YouClean 300 Antibacterial Travel Hand Soap Sheets - Pocket/Purse/Wallet/Backpack -Great for Outdoor Camping or Daily Use (Tea Party) (Tea Party)\nReview Date: 2022/07/23\nStore: YouClean\nProduct Description: ['Brand:', 'YouClean', 'Item Form:', 'Sheet', 'Formulation:', 'Concentrated plant-based soap', 'Scent:', 'Tea Party (Chamomile, Green Tea, Tea Tree)', 'Package Box Size:', '2 x 1 x 1.5 inch', 'www.shopyouclean.com', \"We are changing our packaging. No more small plastic cases!   Our new packaging is 100% biodegradable paper. All 300 sheets are tightly packed in 3 tiny paper boxes (100 sheets/box) which nicely fit in any purse/wallet, handbag, and kids' pack-backs.   Check out our 9 scent collections:   - Tea Party  - Citrus Collection  - Purple Heart  - Pink Pamper  - Red Passion  - Blanca Elegance  - Seaside Vacation  - The Adventure  - The Nonsense (unscented)\"]\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Sheet', 'Skin Type': 'All', 'Brand': 'YouClean', 'Scent': 'Tea Party', 'Material Type Free': 'Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)  See more', 'Product Dimensions': '2 x 1 x 1.25 inches; 2.4 Ounces', 'UPC': '609670421100', 'Manufacturer': 'YouClean'}\nReview Text: These soap sheets are great for traveling. They are easily portable in their little travel cases and are convenient for on the go. The start dissolving immediately when you get them wet, but they did require a little rubbing to get them to dissolve completely, which is great since they help ensure a good job at washing your hands. Each color is a different scent, and most scents are nice. Of course, I like some better than others, but that's a matter of personal preference. One sheet was plenty for washing my hands. They are great for traveling and if you go somewhere that the soap ran out or just isn't available. I love that they help me stay clean while on the go.\nReview Title: Great for traveling\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Dog & Cat Brush, Self Cleaning Slicker Brush for Pet Grooming Brush, Euyona Bee Pet Brush, Cat shedding Brush Gently Removes Loose Undercoat, Mats Tangled Hair Slicker brush for Pet (Dogs Cats Rabbit)\nEuyona\n{'Brand': 'Euyona', 'Shape': 'Oblong', 'Handle Material': 'Metal', 'Special Feature': 'Self Cleaning', 'Product Benefits': 'Smoothing', 'Package Dimensions': '8.35 x 3.39 x 2.83 inches; 5.2 Ounces', 'UPC': '785214618769'}\nI like this brush for my small, short-hair dog. It helps remove his loose hair and he seems to enjoy it when I brush him. I like that I can push a button and it pushes the hair to the ends of the bristles so that I can easily remove the hair. It doesn't get all of the hair, but it is a lot more effective than a normal brush. Overall,  I'm really happy with this brush and would get one like it again.\nNice!\nAOA Studio Collection Makeup Sponge Set Makeup Blender Latex Free and High-definition Set of 5 Makeup Blender For Powder Cream and Liquid, Super Soft Wonder Blender Beauty Cosmetic Beveled\nAOA STUDIO\n{'Brand': 'AOA STUDIO', 'Color': 'Ivory', 'Material': 'Rubber', 'Skin Type': 'Dry', 'Recommended Uses For Product': 'Makeup', 'Package Dimensions': '6.85 x 5.39 x 1.97 inches; 1.45 Ounces', 'UPC': '850022931338'}\nI like these blenders. They help blend my foundation much better than cotton pads or by just using my fingers. I prefer wearing make-up to look more natural, so I appreciate that these blenders help me put on my make-up so that lines, etc aren't noticeable. They seem to clean well, and I am enjoying using them as part of my daily routine.\nGreat\n(YOUMIDI) Brush and Cat Brush-Smooth combing brush for short and long hair-Pet shedding combing brush, which can remove loose hair, mats, tangles (Blue)\nyoumidi\n{'Brand': 'youmidi', 'Color': 'Blue', 'Shape': 'Oblong', 'Unit Count': '1.00 Count', 'Hair Type': 'All', 'Package Dimensions': '10.59 x 5.04 x 2.44 inches; 0.32 Ounces', 'Item model number': '021', 'UPC': '768647685676'}\nThis is a great self-cleaning brush. With the push of a button,  I'm able to push the hair to the end of the bristles for easy removal. The handle fits comfortably in my hand and my dog seems to enjoy the feel of being brushed. The brush doesn't get completely hair free, but it does seem to be much cleaner than if I had to pick the hair off on my own. I feel like this brush is a great value and would get it again.\nVery nice\nLSxia LX1101-3\nLSxia\n{'Brand': 'LSxia', 'Finish Type': 'Glitter,Shimmer,Natural', 'Number of Items': '1', 'Unit Count': '2.00 Count', 'Coverage': 'Light', 'Package Dimensions': '5.28 x 0.94 x 0.71 inches; 0.07 Ounces'}\nI got this eye shadow stick in rose gold and it is very nice. I like the soft, rosy color with its light shimmer. It goes on easily and looks good. Since it is a cream shadow, it doesn't end up looking chalky or dry. It comes with a blender, but I didn't feel like I needed to use it with this particular color. The color lasted all day for me with very minimal wear. I feel like this shadow is a good value and would consider getting it in additional  colors.\nNice color with a light shimmer\nYouClean 300 Antibacterial Travel Hand Soap Sheets - Pocket/Purse/Wallet/Backpack -Great for Outdoor Camping or Daily Use (Tea Party) (Tea Party)\nYouClean\n['Brand:', 'YouClean', 'Item Form:', 'Sheet', 'Formulation:', 'Concentrated plant-based soap', 'Scent:', 'Tea Party (Chamomile, Green Tea, Tea Tree)', 'Package Box Size:', '2 x 1 x 1.5 inch', 'www.shopyouclean.com', \"We are changing our packaging. No more small plastic cases!   Our new packaging is 100% biodegradable paper. All 300 sheets are tightly packed in 3 tiny paper boxes (100 sheets/box) which nicely fit in any purse/wallet, handbag, and kids' pack-backs.   Check out our 9 scent collections:   - Tea Party  - Citrus Collection  - Purple Heart  - Pink Pamper  - Red Passion  - Blanca Elegance  - Seaside Vacation  - The Adventure  - The Nonsense (unscented)\"]\n{'Item Form': 'Sheet', 'Skin Type': 'All', 'Brand': 'YouClean', 'Scent': 'Tea Party', 'Material Type Free': 'Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)  See more', 'Product Dimensions': '2 x 1 x 1.25 inches; 2.4 Ounces', 'UPC': '609670421100', 'Manufacturer': 'YouClean'}\nThese soap sheets are great for traveling. They are easily portable in their little travel cases and are convenient for on the go. The start dissolving immediately when you get them wet, but they did require a little rubbing to get them to dissolve completely, which is great since they help ensure a good job at washing your hands. Each color is a different scent, and most scents are nice. Of course, I like some better than others, but that's a matter of personal preference. One sheet was plenty for washing my hands. They are great for traveling and if you go somewhere that the soap ran out or just isn't available. I love that they help me stay clean while on the go.\nGreat for traveling",
  "profile": "**User Summary:**\n\n- **Pet Ownership**: Owns a small, short-haired dog.\n- **Grooming Tools Preference**: Prefers efficient, user-friendly grooming tools with self-cleaning mechanisms for easy maintenance of pet hygiene.\n- **Grooming Experience**: Values products that effectively remove loose hair and mats, ensuring pet comfort during grooming. The pet enjoys grooming sessions, reflecting the user’s commitment to quality tools.\n- **Product Satisfaction**: Generally satisfied with grooming products and likely to repurchase based on positive experiences. Recently purchased a self-cleaning brush that highlights a preference for practicality and ease of maintenance.\n- **Rating Behavior**: Tends to provide high ratings for products that meet or exceed expectations, showcasing a positive attitude towards product reviews. Recently rated a travel soap product highly due to its convenience and effectiveness, maintaining a trend of satisfaction.\n- **Makeup and Skincare Preferences**: Interested in beauty tools that enhance application techniques for a natural look and seamless blending. Values ease of cleaning, consistent with grooming tool preferences. Recent purchases indicate a preference for lasting quality and good value.\n- **Travel and Hygiene**: Shows a growing interest in portable hygiene solutions, emphasizing convenience, cleanliness on the go, and practical product features.\n\nOverall, the user consistently seeks high-quality, practical, and user-friendly products, whether for pet grooming, personal beauty, or travel, emphasizing convenience, user enjoyment, and positive experiences.",
  "metrics": {
    "rouge1_f": 0.19272727272727275,
    "rouge2_f": 0.030965391621129327,
    "rougeL_f": 0.09454545454545456,
    "meteor": 0.07036672521054184,
    "bleu1": 0.02165964792717977,
    "bleu2": 0.008033738450970827,
    "bleu3": 0.0035676343830763303,
    "bleu4": 0.0009461840764933747,
    "bertscore_precision": 0.38947415351867676,
    "bertscore_recall": 0.49876970052719116,
    "bertscore_f1": 0.43739768862724304
  }
}