{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Eyebrow Stamp and Eyebrow Shaper Kit,One Step Brow Stamp Shaping Kit - Professional Eyebrow Powder Stamp Makeup with 24 Eyebrow Stencils 4 Eyebrow Makeup Brushes\nReview Date: 2022/01/05\nStore: ZDU\nAverage Rating: 2.9\nProduct Details: {'Brand': 'ZDU', 'Item Form': 'Powder', 'Material Feature': 'Natural', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '4.8 x 3.62 x 1.34 inches; 1.76 Ounces'}\nReview Text: I used them on my very thin and sparse eyebrows and it was easy to peel the sticker just took some time to place it well and even on each eyebrow so they match . The Brow stamp works well I didn't 3 times to fill in the Brow and once you peel it off the brows look good I did go in with my pencil just to even up the tails cause that's the hardest part to match because if the shape of the Brow stencil.  Overall I do like this ..but ibdid find that itsninly good for one use.  When ibused it again it didn't stick well at all and was harder to fill the Brow.  Didn't work twice.  They have many shapes but I can't use them all cause not my style.... but as far as using a Brow stamp I like it alot i reccomend\nReview Title: Work well\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Henna Guys Hair Finishing Stick, Frizz Control Hair products, Broken Baby Hair Gel - Hair Wax Stick for Flyaway Hair - Faster & Quickest Solution for Neat Hair Styles (1 Pack)\nThe Henna Guys\n{'Package Information': 'Box', 'Brand': 'The Henna Guys', 'Item Form': 'Gel', 'Hair Type': 'Damaged', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 1.14 x 1.02 inches; 1.34 Ounces'}\nThis is supposed to lay your edges and it keep flyaways down to give your hair a clean look.  I'm sure it works for fine or straight hair ..not kinky or course curly hair.  The gel just isnt string enough.  Its almost seems like its watery ...\nDoesnt work for my hair\nMagnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nEyenjoy\n{'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nNot sure about these lashes they are very much long and thick but the magnetic application is whats throwing me cause I cant get them to sit and stay for long.  A d I'm really good at applying my regular lashes.  The magnetic lash glue kinda sucks I used my regular glue and it worked better for me the magnets work cause when I put them back in the case they clasp on quickly but  not on my eye lids. I dont really like them\nNot the best prefer regular lashes\nNewcally 22MM False Eyelashes Premium Faux Mink Lashes Dramatic Long Fluffy Volume Fake Eye Lashes Pack 5 Pairs\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 4 x 0.5 inches; 0.81 Ounces', 'Item model number': 'F758-2'}\ni really love these lashes and i thought i wouldnt because they are kinda thick and long but once i had them on i never went back i love the length and volume and now when i use other lashes i feel like something is missing they re well made and the strip where the hairs sit is sturdy which is good it allows u to out them on and they site well above ur lashes the flimsy once move and wiggle and make it harder for you to put on these are great and they are reusable to come off well and hold shape i have use mine about 5 times now  the hairs stay on havent ripped or shedded just yet but dont pulled like i did when glue got on the hairs cause it did rip off overall good lashes to have so pretty\nget these now\nHANYUDIE Brown Wigs for Women Short Straight Wig with bangs Mixed Brown Bob Wig Shoulder Length Synthetic wig for Women Daily Party Use(16 inch)\nHANYUDIE\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'HANYUDIE', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.5 x 8.54 x 2.09 inches; 8.15 Ounces'}\n[[VIDEOID:4c9ae3ed9c8e04bce7d695d49cf5ece9]] Ok this wig is nice beautiful color great length great bang I like it but it's shiny. At that kinda makes it look fake I'm going to try and find a way to reduce the shine and also color the part and flatten it cause it bulky and has a white scalp showing .... other than that it's a good one to try as long as your willing to fix it up a big . It has no combs and is big head friendly\nNice but shiny\nVcedas Square Nail Tips White 200PCS Full Cover French Square Shape Short Nails Tip for Acrylic Nails Square DIY French Style With Box\nVcedas\n{'Color': 'Clear,White,Transparent', 'Size': '200 Piece Assortment', 'Material': 'Acrylic', 'Brand': 'Vcedas', 'Style': 'French', 'Product Dimensions': '3.94 x 3.15 x 0.79 inches; 2.89 Ounces'}\nFor a quick nail style that you don't need to last for more than a week this is great.. butbif your like me and have to cook clean and wash dishes on the daily.  This is a no go.  This will start to wear quickly when you spend too much time wetting your hands the nails are thin but no pretty nicer bright white great finish.  Great length and love that it's square.. good for a short time  .luckily you get so many nails you can switch them if they fall or Crack off\nThey're ok\nEyebrow Stamp and Eyebrow Shaper Kit,One Step Brow Stamp Shaping Kit - Professional Eyebrow Powder Stamp Makeup with 24 Eyebrow Stencils 4 Eyebrow Makeup Brushes\nZDU\n{'Brand': 'ZDU', 'Item Form': 'Powder', 'Material Feature': 'Natural', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '4.8 x 3.62 x 1.34 inches; 1.76 Ounces'}\nI used them on my very thin and sparse eyebrows and it was easy to peel the sticker just took some time to place it well and even on each eyebrow so they match . The Brow stamp works well I didn't 3 times to fill in the Brow and once you peel it off the brows look good I did go in with my pencil just to even up the tails cause that's the hardest part to match because if the shape of the Brow stencil.  Overall I do like this ..but ibdid find that itsninly good for one use.  When ibused it again it didn't stick well at all and was harder to fill the Brow.  Didn't work twice.  They have many shapes but I can't use them all cause not my style.... but as far as using a Brow stamp I like it alot i reccomend\nWork well",
  "profile": "**Updated User Profile Summary:**\n\nThe user prioritizes hair care products aimed at controlling frizz and flyaways for her kinky or coarse curly hair, reflecting her discerning interest in performance and reliability. Her critical stance towards product effectiveness is evident in her low to moderate ratings for items that do not meet her high standards. Recent feedback shows a blend of satisfaction and constructive criticism regarding hair accessories, including a wig that, while aesthetically pleasing, required adjustments for a natural look.\n\nHer brand loyalty remains conditional, favoring traditional solutions that deliver results while remaining open to experimenting with beauty enhancements. This is illustrated by her positive experiences with false eyelashes that align with her expectations for ease of use and comfort.\n\nIn her latest interaction, she explored eyebrow products, showing a preference for practical solutions that are reasonably effective, yet noted limitations regarding reusability and adherence over time. She appreciates products that enhance her appearance while fitting into her active lifestyle, highlighting a desire for effective and reliable beauty items that deliver both strong hold and aesthetic appeal. Overall, the user appreciates innovation in her beauty routine but maintains a critical approach to ensure products meet her functional and stylistic needs.",
  "metrics": {
    "rouge1_f": 0.1329923273657289,
    "rouge2_f": 0.008539709649871906,
    "rougeL_f": 0.06820119352088662,
    "meteor": 0.05528157877612267,
    "bleu1": 0.005504186765899139,
    "bleu2": 0.0017230868711445363,
    "bleu3": 0.0005858711085020605,
    "bleu4": 0.00019232774263811206,
    "bertscore_precision": 0.3275555968284607,
    "bertscore_recall": 0.4349081218242645,
    "bertscore_f1": 0.3736744225025177
  }
}