{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Newcally 22MM False Eyelashes Premium Faux Mink Lashes Dramatic Long Fluffy Volume Fake Eye Lashes Pack 5 Pairs\nReview Date: 2021/04/24\nStore: Newcally\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 4 x 0.5 inches; 0.81 Ounces', 'Item model number': 'F758-2'}\nReview Text: i really love these lashes and i thought i wouldnt because they are kinda thick and long but once i had them on i never went back i love the length and volume and now when i use other lashes i feel like something is missing they re well made and the strip where the hairs sit is sturdy which is good it allows u to out them on and they site well above ur lashes the flimsy once move and wiggle and make it harder for you to put on these are great and they are reusable to come off well and hold shape i have use mine about 5 times now  the hairs stay on havent ripped or shedded just yet but dont pulled like i did when glue got on the hairs cause it did rip off overall good lashes to have so pretty\nReview Title: get these now\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Henna Guys Hair Finishing Stick, Frizz Control Hair products, Broken Baby Hair Gel - Hair Wax Stick for Flyaway Hair - Faster & Quickest Solution for Neat Hair Styles (1 Pack)\nThe Henna Guys\n{'Package Information': 'Box', 'Brand': 'The Henna Guys', 'Item Form': 'Gel', 'Hair Type': 'Damaged', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 1.14 x 1.02 inches; 1.34 Ounces'}\nThis is supposed to lay your edges and it keep flyaways down to give your hair a clean look.  I'm sure it works for fine or straight hair ..not kinky or course curly hair.  The gel just isnt string enough.  Its almost seems like its watery ...\nDoesnt work for my hair\nMagnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nEyenjoy\n{'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nNot sure about these lashes they are very much long and thick but the magnetic application is whats throwing me cause I cant get them to sit and stay for long.  A d I'm really good at applying my regular lashes.  The magnetic lash glue kinda sucks I used my regular glue and it worked better for me the magnets work cause when I put them back in the case they clasp on quickly but  not on my eye lids. I dont really like them\nNot the best prefer regular lashes\nNewcally 22MM False Eyelashes Premium Faux Mink Lashes Dramatic Long Fluffy Volume Fake Eye Lashes Pack 5 Pairs\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 4 x 0.5 inches; 0.81 Ounces', 'Item model number': 'F758-2'}\ni really love these lashes and i thought i wouldnt because they are kinda thick and long but once i had them on i never went back i love the length and volume and now when i use other lashes i feel like something is missing they re well made and the strip where the hairs sit is sturdy which is good it allows u to out them on and they site well above ur lashes the flimsy once move and wiggle and make it harder for you to put on these are great and they are reusable to come off well and hold shape i have use mine about 5 times now  the hairs stay on havent ripped or shedded just yet but dont pulled like i did when glue got on the hairs cause it did rip off overall good lashes to have so pretty\nget these now",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Focus:** Prioritizes products aimed at controlling frizz and flyaways, reflecting a strong interest in maintaining neat hairstyles tailored to her kinky or coarse curly hair type. \n- **Product Effectiveness Sensitivity:** Demonstrates a discerning attitude towards product effectiveness, as evident from previous low to moderate ratings for underperforming items.\n- **Dissatisfaction with Formulation:** Expresses specific dissatisfaction with gel formulations lacking strength and recent experiences with virtual beauty solutions that did not meet her standards.\n- **Brand Experience and Preferences:** Engaged with select hair care brands but shows conditional loyalty based on product performance; favors traditional beauty solutions over newer variations that don't align with her expectations.\n- **Positive Experience with Lashes:** The recent positive review of a false eyelash product indicates an openness to effective beauty enhancements that offer impressive volume, sturdiness, and reusability. This demonstrates an appreciation for well-made products that offer ease of use and a reliable experience. The user values eyelash products that provide comfort during wear and ease of application, enhancing her overall beauty routine. \n\nOverall, this user seeks effective hair care and beauty solutions that emphasize strong hold, reliability, and aesthetics, ensuring a polished look that aligns with her specific needs.",
  "metrics": {
    "rouge1_f": 0.17964071856287422,
    "rouge2_f": 0.018018018018018018,
    "rougeL_f": 0.08682634730538921,
    "meteor": 0.08463419221365431,
    "bleu1": 0.07548614301208148,
    "bleu2": 0.016125984049831236,
    "bleu3": 0.0031066192324401896,
    "bleu4": 0.0013649212926043863,
    "bertscore_precision": 0.35875630378723145,
    "bertscore_recall": 0.42434337735176086,
    "bertscore_f1": 0.38880330324172974
  }
}