{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Mel Brooks Collection (Blazing Saddles / Young Frankenstein / Silent Movie / Robin Hood: Men in Tights / To Be or Not to Be / History of the World, Part 1 / The Twelve Chairs / High Anxiety)\nReview Date: 2017/07/10\nStore: Mel Brooks  (Actor, Director),     Gene Wilder  (Actor),     Alan Johnson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'INCLUDES: SILENT MOVIE, ROBIN HOOD-MEN IN TIGHTS, BLAZING SADDLES, HIGH ANXIETY, HISTORY OF THE WORLD PART 1, TO BE OR NOT TO BE, TWELVE CHAIRS, YOUNG FRANKENSTEIN.', 'Amazon.com', 'There are plenty of belly laughs in', 'The Mel Brooks Collection', \", an eight-disc set of most of the director-writer-actor's best-known films. Four of them--\", 'Silent Movie', ',', 'High Anxiety', ',', 'To Be or Not to Be', ', and', 'Robin Hood: Men with Tights', '--are making their debut on DVD, while a fifth,', 'The Twelve Chairs', \", was briefly available as a non-anamorphic DVD from Image Entertainment (all the DVDs in this set are anamorphically enhanced for widescreen TVs). That means you can sample a 23-year stretch of Brooks's outrageous and affectionate spoofing of everything from movies to popular legends to movies to historical figures to, hey! more movies.\", 'The earliest film,', 'The Twelve Chairs', '(1970), is the least known, but is one of the funniest, helped greatly by a good story (adapted from a 1920s Russian tale) and the casting of Ron Moody and Frank Langella as treasure hunters.', 'Young Frankenstein', 'and', 'Blazing Saddles', 'followed in 1974. The former, a spoof of horror films, is easily one of the top two or three funniest movies of all time, and the latter is justly famous for its often-tasteless send-up of Western cliches.', 'Silent Movie', '(1976) is just what the title describes, with its only word of dialogue spoken from the least-likely source, and', 'High Anxiety', '(1977) pays tribute to the work of Alfred Hitchcock.', 'History of the World, Part 1', '(1981) mocks historical events and epics, and', 'To Be or Not to Be', \"(1983) is a remake of Ernst Lubitsch's 1942 classic of the same name (it's also the only film in the set for which Brooks didn't receive writing and directing credit). By this time, Brooks was more actively taking the leading roles himself (rather than the bit parts), and unfortunately relying less on his topnotch ensemble of recurring players, which included Gene Wilder, Madeline Kahn, Cloris Leachman, Harvey Korman, and Dom DeLuise. But he does use a new ensemble (including Cary Elwes and, in his film debut, Dave Chappelle), for\", 'Robin Hood: Men in Tights', '(1993), the feature-length spin on the same hero Brooks had spoofed in his short-lived 1975 television series', 'When Things Were Rotten', '.', 'Bonus features are minor. In addition to an HBO featurette on', 'Men in Tights', \", there's a featurette and interviews on\", 'To Be or Not to Be', 'and all the features (Brooks commentary, deleted scenes, interviews, etc.) that were on the original release of', 'Young Frankenstein', '. Note that while rights issues kept', 'The Producers', ',', 'Spaceballs', \", and other films out of this set, 20th Century Fox was able to use Warner Bros.'\", 'Blazing Saddles', '. The features on that disc, however, are the ones that were on the 1997 DVD release, not the 2004 anniversary reissue. Regardless, the set\\'s price for this many films is low, and because it has so many films new to DVD, Brooks fans will want to pick this up faster than they can say... \"', 'Frau Blücher!', '\"', '--David Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Frank Langella, Ernst Lubitsch, Marty Feldman, Gregory Hines, Alan Johnson, Barry Levinson, Andras Voutsinas, Cleavon Little, Doris Mudie, Mel Brooks, Ron Moody, Dom DeLuise, Anne Bancroft, Cary Elwes, Madeline Kahn, Alan Uger, Andrew Bergman, Edwin Justus Mayer, Gene WilderFrank Langella, Ernst Lubitsch, Marty Feldman, Gregory Hines, Alan Johnson, Barry Levinson, Andras Voutsinas, Cleavon Little, Doris Mudie, Mel Brooks, Ron Moody, Dom DeLuise, Anne Bancroft, Cary Elwes, Madeline Kahn, Alan Uger, Andrew Bergman, Edwin Justus Mayer, Ge…  See more', 'Language': 'Unqualified', 'Runtime': '12 hours and 52 minutes', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.3 Pounds', 'Item model number': 'FOX2226750DVD', 'Director': 'Alan Johnson, Mel Brooks', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '12 hours and 52 minutes', 'Release date': 'April 4, 2006', 'Actors': 'Mel Brooks, Gene Wilder, Madeline Kahn, Marty Feldman, Anne Bancroft', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Alan Uger, Andrew Bergman, Barry Levinson, Doris Mudie, Edwin Justus Mayer', 'Number of discs': '8'}\nReview Text: Another great Dvd.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "John Deere Heaven, Part 1\nJohn Deere Toys & Tractors  (Actor),     Tom McComas  (Director),     Joseph Stachler  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', 'Welcome to John Deere Heaven -where all is mellow and even the cows are green and yellow. We first visited John Deere Heaven in All About John Deere Part 4, and people enjoyed the trip so much we decided to return and stay for an entire show.', 'See John Deere toys come alive in this fanciful, fast-paced mix of toy trains, tractors, and big machines. TMs video magic will thrill and delight young and old alike. See O gauge and Standard gauge John Deere trains zip around elaborately detailed train layouts along with John Deere 1/16th, 1/50th and 1/64th scale tractors, cars, and trucks. Plus ten original songs by our favorite singer/songwriter James Coffey. Otto is in town and his little switch engine is blocking the mainline and here comes the Circus Train! Oh no!', 'Review', 'John Deere Heaven is a DVD in which stop-motion animation makes beloved John Deere toys come alive. Ten original songs by singer and songwriter James Coffey spice up the elaborate miniature train layouts and interactions between exquisitely accurate replicas of machines. Young and old toy collectors alike are sure to enjoy watching 1/16, 1/50, and 1/64 scale tractors, cars, and trucks vroom about in this entertaining show, especially recommended for tractor lovers. --The Midwest Book Review']\n{'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.36 Ounces', 'Director': 'Tom McComas, Joseph Stachler', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen', 'Run time': '45 minutes', 'Release date': 'April 24, 2008', 'Actors': 'John Deere Toys & Tractors', 'Language': 'Unqualified', 'Studio': 'TM Books & Video', 'Number of discs': '1'}\nOur Grandson &#34;loved it&#34;.\nFive Stars\nMafia! [DVD]\nJay Mohr  (Actor),     Christina Applegate  (Actor),     Jim Abrahams  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product description', 'MAFIA!', 'Amazon.com', 'This hapless comedy may actually work a lot better on video than it did in theaters. A parody of contemporary mob movies (with a few sidebars skewering such hits as', 'Forrest Gump', 'and', 'The English Patient', '),', 'Mafia!', 'most closely resembles the first two', 'Godfather', 'films in its generational saga of a gangster family. Lloyd Bridges plays Don Cortino, a native Sicilian who presides over a crime syndicate, and Jay Mohr plays his Michael Corleone-like son. The film is by Jim Abrahams, formerly of the Zucker-Abrahams-Zucker directing team (', 'Airplane!', ',', 'The Naked Gun', '), single- handedly trotting out the old dumb-joke aesthetic that worked wonderfully a lifetime ago but looks a little creaky in the era of', \"There's Something About Mary\", '. Silly allusions to every crime film (', 'GoodFellas', ',', 'Casino', ') produced in the last three decades and featuring at least one wise guy or made man find their way into', 'Mafia!', \"'s gags, but most are arbitrary and shrugged off. The film tanked in theaters for good reason; on the other hand,\", 'Mafia!', \"might have a lot more to offer if you're slumped on your own couch at the end of a long day, ready for brain-dead entertainment and absolutely apathetic about comic integrity. Even a film this instantly stale on the big screen might have its place in video posterity.\", '-- Tom Keogh']\n{'Genre': 'Comedy', 'Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Widescreen, NTSC, Letterboxed', 'Contributor': 'Tony Lo Bianco, Michael McManus, Blake Hammond, Philip Suriano, Christina Applegate, Billy Burke, Pamela Gidley, Vincent Pastore, Jason Fuchs, Lloyd Bridges, Joe Viterelli, Jim Abrahams, Olympia Dukakis, Greg Norberg, Jay MohrTony Lo Bianco, Michael McManus, Blake Hammond, Philip Suriano, Christina Applegate, Billy Burke, Pamela Gidley, Vincent Pastore, Jason Fuchs, Lloyd Bridges, Joe Viterelli, Jim Abrahams, Olympia Dukakis, Greg Norberg, Jay Mohr  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 23 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 3.2 Ounces', 'Director': 'Jim Abrahams', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Widescreen, NTSC, Letterboxed', 'Run time': '1 hour and 23 minutes', 'Release date': 'February 9, 1999', 'Actors': 'Jay Mohr, Christina Applegate, Lloyd Bridges, Billy Burke, Pamela Gidley', 'Subtitles': 'English', 'Studio': 'Walt Disney Video / Mill Creek', 'Writers': 'Greg Norberg, Jim Abrahams, Michael McManus', 'Number of discs': '1'}\nMy Husband love's it.\nFive Stars\nBlast from the Past (DVD)\nBrendan Fraser  (Actor),     Alicia Silverstone  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Blast from the Past (DVD) (Rpkg)', \"After 35 years in a bomb shelter, Adam Webber is finally going outside to play. When a man raised in a 1950s era bomb shelter emerges into the outside world for the first time--to find a nice nonmutant girl with whom to repopulate the earth--meets a savvy, cynical modern woman, sparks fly, opposites attract and the result is a wondrous chain reaction in this romantic comedy for the nuclear age--Blast from the Past. Adam's hapless search in the brave new world of homeless people, adult bookstores and all-night supermarkets leads him directly into Eve. She's suspicious, smart about survival and uncertain of the possibilities of love. Her life has been a series of dead-end jobs, shallow boyfriends and dashed hopes. But the more Eve watches Adam approach the world with wide eyes, comic miscomprehension, joyous delight and a deliciously sweet innocence, the more she begins to find herself falling in love?\", ']]>']\n{'Genre': 'Drama, Romance, Comedy', 'Format': 'Multiple Formats, Dolby, NTSC, Color, Full Screen', 'Contributor': 'Christopher Walken, Brendan Fraser, Sissy Spacek, Renny Harlin, Hugh Wilson, Bill Kelly, Dave Foley, Amanda Stern, Alicia Silverstone, Claire Rudnick Polstein, Sunil PerkashChristopher Walken, Brendan Fraser, Sissy Spacek, Renny Harlin, Hugh Wilson, Bill Kelly, Dave Foley, Amanda Stern, Alicia Silverstone, Claire Rudnick Polstein, Sunil Perkash   See more', 'Initial release date': '2010-11-09', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.98 Ounces', 'Item model number': '164132', 'Director': 'Hugh Wilson', 'Media Format': 'Multiple Formats, Dolby, NTSC, Color, Full Screen', 'Run time': '1 hour and 52 minutes', 'Release date': 'November 9, 2010', 'Actors': 'Brendan Fraser, Alicia Silverstone, Christopher Walken, Sissy Spacek, Dave Foley', 'Producers': 'Amanda Stern, Renny Harlin, Hugh Wilson, Sunil Perkash, Claire Rudnick Polstein', 'Studio': 'Studio Distribution Services', 'Writers': 'Hugh Wilson, Bill Kelly', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy Husband &#34;LOVE'S IT&#34;.\nFive Stars\nBeerfest (Unrated)\nComedy, Adventure, Cerebral, Coarse\n[\"After a humiliating false start in Germany's super-secret beer competition, America's unlikely team vows to risk life, limb and liver to dominate the ultimate beer championship.\"]\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Chandrasekhar'], 'Producers': ['Bill Gerber', 'Richard Perello', 'Erik Stolhanske'], 'Starring': ['Jay Chandrasekhar', 'Kevin Heffernan', 'Steve Lemme']}\nThe Movie is for Adult's, Very FUNNY.\nVery FUNNY.\nForrest Gump (1994)\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Forrest Gump (DVD)', \"Stupid is as stupid does, says Forrest Gump (played by Tom Hanks in an O scar-winning performance) as he discusses his relative level of intelli gence with a stranger while waiting for a bus. Despite his sub-normal IQ , Gump leads a truly charmed life, with a ringsid e seat for many of the most memorable events of the second half of the 20th century. Entirely without trying, Forrest teaches Elvis Presley to dance, becomes a footba ll star, meets John F. Kennedy, serves with honor in Vietnam, meets Lynd on Johnson, speaks at an a nti-war rally at the Washington Monument, han gs out with the Yippies, defeats the Chinese national team in table tenn is, meets Richa rd Nixon, discovers the break-in at the Watergate, opens a profitable shrimping business, becomes an original investor in Apple Comp uters, and decides to run back and forth across the country for sev eral years. Meanwhile, as the remarkable parade of his life goes by, For rest never forgets Jenny (Robin Wright Penn), the girl he loved as a boy , who makes her own journey through the turbulence of the 1960s and 197 0s that is far more troubled than the path Forrest happens upon. Feature d alongside Tom Hanks are Sally Field as F orrest's mother; Gary Sinise as his commanding officer in Vietnam; Mykelti Williamson as his ill-fate d Army buddy who is familiar wi th every recipe that involves shrimp; an d the special effects artists whose digital magic place Forrest amidst a remarkable array of historical events and people.\", ']]>']\n{'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '2 hours and 22 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000526417DVD', 'Director': 'Various', 'Media Format': 'Color, Multiple Formats, Dolby, NTSC', 'Run time': '2 hours and 22 minutes', 'Release date': 'October 21, 2014', 'Actors': 'Various', 'Dubbed': 'French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nFavorite &#34;Movie for The Family&#34;\nFive Stars\nBack to the Future 30th Anniversary Trilogy\nMichael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Experience the future all over again with the Back to the Future 30th Anniversary Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, this unforgettable collection features hours of bonus features and is an unrivaled trilogy that stands the test of time.']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, DVD Movie, BTTF3, Back to the Future, Retour vers le futur 3, BTTF2, Retour vers le futur III, Blu-ray Movie, Back to the Future Trilogy, BTTF 2, BTTF 3, Retour vers le futur partie 2, Back to the Future Part II, Back to the Future Part 2, Retour vers le futur partie II, Back to the Future Part 3, Comedy, Retour vers le futur, Back to the Future Part III, BTTF, Action & Adventure, BTTF TrilogyScience Fiction & Fantasy, Kids & Family, DVD Movie, BTTF3, Back to the Future, Retour vers le futur 3, BTTF2, Retour vers le futur III, Blu-ray Movie, Back to the Future Trilogy, BTTF 2, BTTF 3, Retour vers le futur partie 2, Back to the Future Part II, Back to the Future Part 2,…  See more', 'Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Contributor': 'Christopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harry Carey, Jr., Elisabeth Shue, Casey Siemaszko, Frank Marshall, Bill Varney, Neil Canton, Claudia Wells, Robert Rutledge, Bob Gale, Charles L. CampbellChristopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harr…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.28 Ounces', 'Item model number': '61168891', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Run time': '5 hours and 43 minutes', 'Release date': 'October 20, 2015', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Subtitles': 'French, Spanish', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '5'}\nGreat&#34;DVD, Hubby Watches it A LOT&#34;\nFive Stars\nThe Road Warrior / Mad Max Beyond Thunderdome (Double Feature)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n{'Genre': 'Action & Adventure', 'Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '3 hours and 22 minutes'}\n&#34;We Love the DVD with 2 MOVIES on it, GREAT!&#34; T.Y.\nFive Stars\nIndiana Jones and the Temple of Doom (Special Edition)\nHarrison Ford  (Actor),     Kate Capshaw  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['Product Description', 'The continuing saga of Indiana Jones, occurring chronologically before RAIDERS OF THE LOST ARK, finds Indy venturing into India in search of magical stones. Along the way he tries to save hundreds of children enslaved by a leftover Thugee cult. Of all the series, this one plays most like the Saturday serials to which George Lucas and Steven Spielberg were paying homage. Director Steven Spielberg Star Harrison Ford, Kate Capshaw, Amrish Puri, Roshan Seth, Philip Stone, Ke Huy Quan Special Features: Anamorphic Widescreen Audio: (unspecified) English Runtime: 118 minutes.', 'Amazon.com', 'It\\x92s hard to imagine that a film with worldwide box office receipts topping $300 million worldwide could be labeled a disappointment, but some moviegoers considered', 'Indiana Jones and the Temple of Doom', ', the second installment in Steven Spielberg and George Lucas\\x92 1980s adventure trilogy, to be just that. That doesn\\x92t mean it\\x92s a bad effort; any collaboration between these two cinema giants (Spielberg directed, while Lucas provided the story and was executive producer) is bound to have more than its share of terrific moments, and', 'Temple of Doom', 'is no exception. But in exchanging the very real threat of Nazi Germany for the cartoonish Thuggee cult, it loses some of the heft of its predecessor (', 'Raiders of the Lost Ark', '); on the other hand, it\\x92s also the darkest and most disturbing of the three films, what with multiple scenes of children enslaved, a heart pulled out of a man\\x92s chest, and the immolation of a sacrificial victim, which makes it less fun than either', 'Raiders', 'or', 'The Last Crusade', ', notwithstanding a couple of riotous chase scenes and impressively grand sets. Many fans were also less than thrilled with the new love interest, a spoiled, querulous nightclub singer portrayed by Kate Capshaw, but a cute kid sidekick (\"Short Round,\" played by Ke Huy Quan) and, of course, the ever-reliable Harrison Ford as the cynical-but-swashbuckling hero more than make up for that character\\x92s shortcomings.', 'A six-minute introduction by Lucas and Spielberg is the prime special feature, with both men candidly addressing the film\\x92s good and bad points (Lucas points out that the second', 'Star Wars', 'film,', 'The Empire Strikes Back', ', was also the darkest of the original three; as for Spielberg, the fact that the leading lady would soon become his wife was the best part of the whole trip). Also good are \"The Creepy Crawlies,\" a mini-doc about the thousands of snakes, bugs, rats and other scary critters that populate the trilogy, and \"Travels with Indy,\" a look at some of the films\\x92 cool locations. Storyboards and a photo gallery are included as well.', '--Sam Graham']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Chua Kah Joo, Ric Young, Harrison Ford, Kate Capshaw, Philip Stone, Dan Aykroyd, Frank Olegario, Steven Spielberg, David Yip, D.R. Nanayakkara, Roshan Seth, Rex Ngui, Lorraine Doyle, Jonathan Ke Quan, Roy Chiao, Pat Roach, Michael Yama, Amrish Puri, Philip Tann, Paul BeesonChua Kah Joo, Ric Young, Harrison Ford, Kate Capshaw, Philip Stone, Dan Aykroyd, Frank Olegario, Steven Spielberg, David Yip, D.R. Nanayakkara, Roshan Seth, Rex Ngui, Lorraine Doyle, Jonathan Ke Quan, Roy Chiao, Pat Roach, Michael Yama, Amrish Puri, Philip Tann, Pa…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 58 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '132834', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 58 minutes', 'Release date': 'June 5, 2013', 'Actors': 'Harrison Ford, Kate Capshaw, Jonathan Ke Quan, Amrish Puri, Roshan Seth', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nHe Keeps Watching It over & Over!!\nFive Stars\nIndiana Jones Raiders of the Lost ARK\nAnthony Higgins  (Actor),     Ronald Lacey  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', \"Action-packed and adventure-filled, RAIDERS OF THE LOST ARK is director Steven Spielberg's loving homage to the Saturday matinee cliffhanger serials of his childhood. When the Allies discover the Nazis are planning to use the Lost Ark of the Covenant as a weapon, the U.S. government enlists archaeologist-adventurer Indiana Jones (Harrison Ford) to locate the biblical treasure chest where the remains of the broken tablets of the Ten Commandments were placed. Director Steven Spielberg Star Harrison Ford, Karen Allen, Paul Freeman, Ronald Lacey, John Rhys-Davies, Denholm Elliott, Alfred Molina Special Features: Anamorphic Widescreen Audio: Dolby Digital Stereo English Runtime: 115 minutes.\", 'Amazon.com', 'It’s said that the original is the greatest, and there can be no more vivid proof than', 'Raiders of the Lost Ark', ', the first and indisputably best of the initial three Indiana Jones adventures cooked up by the dream team of Steven Spielberg and George Lucas. Expectations were high for this 1981 collaboration between the two men, who essentially invented the box office blockbuster with ‘70s efforts like', 'Jaws', 'and', 'Star Wars', ', and Spielberg (who directed) and Lucas (who co-wrote the story and executive produced) didn’t disappoint. This wildly entertaining film has it all: non-stop action, exotic locations, grand spectacle, a hero for the ages, despicable villains, a beautiful love interest, humor, horror… not to mention lots of snakes. And along with all the bits that are so familiar by now--Indy (Harrison Ford) running from the giant boulder in a cave, using his pistol instead of his trusty whip to take out a scimitar-wielding bad guy, facing off with a hissing cobra, and on and on--there’s real resonance in a potent storyline that brings together a profound religious-archaeological icon (the Ark of the Covenant, nothing less than \"a radio for speaking to God\") and the 20th century’s most infamous criminals (the Nazis). Now', 'that’s', 'entertainment.', '--Sam Graham', 'Set Contains:', 'This is hardly the first time that', 'Raiders', 'and the other two original Indiana Jones movies have been released on DVD, but a raft of new special features will sweeten the pot for those who already own it. Principal among them are an introduction with Spielberg (who discusses his vision for a globe-trotting, James Bond-style action movie in the mold of an old Republic serial) and Lucas (who came up with the title character); an \"appreciation\" of the trilogy with many of the actors and others who participated in them; a mini-doc detailing the \"melting face\" effect seen in the thrilling ark-opening scene, plus storyboards and a photo gallery. --', 'Sam Graham', 'See more']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Dolby, Special Edition, Subtitled, Widescreen', 'Contributor': 'Harrison Ford, Alfred Molina, Vic Tablian, Wolf Kahler, Steven Spielberg, Ronald Lacey, John Rhys-Davies, Anthony Higgins, Paul Freeman, Denholm Elliott, Frank Marshall, Karen AllenHarrison Ford, Alfred Molina, Vic Tablian, Wolf Kahler, Steven Spielberg, Ronald Lacey, John Rhys-Davies, Anthony Higgins, Paul Freeman, Denholm Elliott, Frank Marshall, Karen Allen   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '132824', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Dolby, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 5, 2013', 'Actors': 'Anthony Higgins, Ronald Lacey, Denholm Elliott, Paul Freeman, Harrison Ford', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nThey Love This Movie\nFive Stars\nYOUNG FRANKENSTEIN\nGene Wilder  (Actor),     Peter Boyle  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"Absurd Dr. Frankenstein visits the family castle in Transylvania and makes a monster. Directed by Mel Brooks. The package may come with a special cardboard cover of 'The Monster'\", 'Amazon.com', \"If you were to argue that Mel Brooks's\", 'Young Frankenstein', \"ranks among the top-ten funniest movies of all time, nobody could reasonably dispute the claim. Spoofing classic horror in the way that Brooks's previous film\", 'Blazing Saddles', \"sent up classic Westerns, the movie is both a loving tribute and a raucous, irreverent parody of Universal's classic horror films\", 'Frankenstein', '(1931) and', 'Bride of Frankenstein', '(1935). Filming in glorious black and white, Brooks re-created the', 'Frankenstein', 'laboratory using the same equipment from the original', 'Frankenstein', \"(courtesy of designer Kenneth Strickfaden), and this loving attention to physical and stylistic detail creates a solid foundation for nonstop comedy. The story, of course, involves Frederick Frankenstein (Gene Wilder) and his effort to resume experiments in re-animation pioneered by his late father. (He's got some help, since dad left behind a book titled\", 'How I Did It.', ') Assisting him is the hapless hunchback Igor (Marty Feldman) and the buxom but none-too-bright maiden Inga (Teri Garr), and when Frankenstein succeeds in creating his monster (Peter Boyle), the stage is set for an outrageous revision of the Frankenstein legend. With comedy highlights too numerous to mention, Brooks guides his brilliant cast (also including Cloris Leachman, Madeline Kahn, Kenneth Mars, and Gene Hackman in a classic cameo role) through scene after scene of inspired hilarity. Indeed,', 'Young Frankenstein', 'is a charmed film, nothing less than a comedy classic, representing the finest work from everyone involved. Not one joke has lost its payoff, and none of the countless gags have lost their zany appeal. From a career that includes some of the best comedies ever made, this is the film for which Mel Brooks will be most fondly remembered. Befitting a classic, the Special Edition DVD includes audio commentary by Mel Brooks, a \"making of\" documentary, interviews with the cast, hilarious bloopers and outtakes, and the original theatrical trailers. No video library should be without a copy of', 'Young Frankenstein', \". And just remember--that's\", 'Fronkensteen', '.', '--Jeff Shannon', 'Beyond', 'Young Frankenstein', 'High Anxiety', 'Spaceballs', 'Blazing Saddles', 'Stills from', 'Young Frankenstein', '(Click for larger image)']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Black & White, Closed-captioned, Dubbed, NTSC, Widescreen, Mono', 'Contributor': 'Teri Garr, Marty Feldman, Peter Boyle, Mel Brooks, Madeline Kahn, Cloris Leachman, Gene Wilder', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.59 x 5.35 x 7.57 inches; 1.76 Ounces', 'Item model number': '2237157', 'Media Format': 'Multiple Formats, Black & White, Closed-captioned, Dubbed, NTSC, Widescreen, Mono', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 5, 2006', 'Actors': 'Gene Wilder, Peter Boyle, Marty Feldman, Madeline Kahn, Cloris Leachman', 'Subtitles': 'English', 'Studio': 'TWENTIETH CENTURY FOX', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThey Laughed So Hard It's a Great Movie!\nFive Stars\nSpaceballs\nMel Brooks  (Actor),     John Candy  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['President Skroob pits evil Dark Helmet against Lone Starr and the half-man, half-dog Barf.']\n{'Genre': 'Comedy', 'Format': 'Closed-captioned, Full Screen, Letterboxed, NTSC, Surround Sound, Dolby', 'Contributor': 'Mel Brooks, Joan Rivers, Bill Pullman, George Wyner, John Candy, Rick Ducommun, Ronny Graham, Daphne Zuniga, Rick Moranis, Dick Van PattenMel Brooks, Joan Rivers, Bill Pullman, George Wyner, John Candy, Rick Ducommun, Ronny Graham, Daphne Zuniga, Rick Moranis, Dick Van Patten  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.84 Ounces', 'Item model number': 'FOXS106386DVD', 'Media Format': 'Closed-captioned, Full Screen, Letterboxed, NTSC, Surround Sound, Dolby', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 7, 2012', 'Actors': 'Mel Brooks, John Candy, Ronny Graham, Rick Moranis, Bill Pullman', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nThey Keep Watching This Movie Also, Again & Again!\nFive Stars\nThree Stooges, the - Ultimate Collection - Set\nMoe Howard  (Actor),     Larry Fine  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Includes 25 years of the Three Stooges unique brand of humor with Moe as boss, Larry the middleman and Curly as their foil. Witness the rise of these comedy icons in this high-spirited collection, which has been re-mastered for the best quality picture and sound. You'll experience the eye-pokes, face slaps, hollow head knocks and knuckle cracks like you've never heard or seen them before.\"]\n{'Genre': 'Comedy/Classic Comedies', 'Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Contributor': 'Larry Fine, Moe Howard, Shemp Howard, Joe Besser, Curly Howard', 'Number Of Discs': '20', 'Runtime': '58 hours and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.6 Pounds', 'Item model number': '509595404', 'Media Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Run time': '58 hours and 52 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Moe Howard, Larry Fine, Curly Howard, Shemp Howard, Joe Besser', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '20'}\nWe love these also.\nFive Stars\nMonty Python's And Now For Something Completely Different: The Best of Monty Python's Flying Circus\nGraham Chapman  (Actor),     John Cleese  (Actor),     Ian MacNaughton  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['A collection of re-filmed sketches from the first and second series of the cult TV comedy show, \"Monty Python\\'s Flying Circus\". Includes such classics as \"Nudge, Nudge\", \"Hell\\'s Grannies\", \"Killer Cars\", \"Dead Parrot\", \"Lumberjack Song\", \"Blackmail\" and \"Upper Class Twit of the Year\".']\n{'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': '01239', 'Director': 'Ian MacNaughton', 'Media Format': 'Anamorphic, Closed-captioned, Color, Full Screen, Multiple Formats, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 3, 1999', 'Actors': 'Graham Chapman, John Cleese, Terry Gilliam, Terry Jones, Eric Idle', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Patricia Casey', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nthis Dvd was great.\nFive Stars\nMonty Python and the Holy Grail (Special Edition)\nGraham Chapman  (Actor),     John Cleese  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"The Monty Python team are at it again in their second movie. This time we follow King Arthur and his knights in their search for the Holy Grail. This isn't your average medieval knights and horses story - for a start, due to a shortage in the kingdom, all the horses have been replaced by servants clopping coconuts together!\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Graham Chapman, Terry Gilliam, Michael Palin, Eric Idle, Terry Jones, Michael White, Michael White Productions; National Film Trustee Company Limited; Python (Monty) Pictures Limited, John Cleese, Mark ForstaterGraham Chapman, Terry Gilliam, Michael Palin, Eric Idle, Terry Jones, Michael White, Michael White Productions; National Film Trustee Company Limited; Python (Monty) Pictures Limited, John Cleese, Mark Forstater  See more', 'Language': 'English (Dolby Digital 5.1), Japanese (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '43396052765', 'Director': 'Terry Jones, Terry Gilliam', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 23, 2001', 'Actors': 'Graham Chapman, John Cleese, Eric Idle, Terry Gilliam, Terry Jones', 'Dubbed': 'Portuguese, French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Mark Forstater, Michael White', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nWe loved the dvd.\nFive Stars\nThe Mel Brooks Collection (Blazing Saddles / Young Frankenstein / Silent Movie / Robin Hood: Men in Tights / To Be or Not to Be / History of the World, Part 1 / The Twelve Chairs / High Anxiety)\nMel Brooks  (Actor, Director),     Gene Wilder  (Actor),     Alan Johnson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'INCLUDES: SILENT MOVIE, ROBIN HOOD-MEN IN TIGHTS, BLAZING SADDLES, HIGH ANXIETY, HISTORY OF THE WORLD PART 1, TO BE OR NOT TO BE, TWELVE CHAIRS, YOUNG FRANKENSTEIN.', 'Amazon.com', 'There are plenty of belly laughs in', 'The Mel Brooks Collection', \", an eight-disc set of most of the director-writer-actor's best-known films. Four of them--\", 'Silent Movie', ',', 'High Anxiety', ',', 'To Be or Not to Be', ', and', 'Robin Hood: Men with Tights', '--are making their debut on DVD, while a fifth,', 'The Twelve Chairs', \", was briefly available as a non-anamorphic DVD from Image Entertainment (all the DVDs in this set are anamorphically enhanced for widescreen TVs). That means you can sample a 23-year stretch of Brooks's outrageous and affectionate spoofing of everything from movies to popular legends to movies to historical figures to, hey! more movies.\", 'The earliest film,', 'The Twelve Chairs', '(1970), is the least known, but is one of the funniest, helped greatly by a good story (adapted from a 1920s Russian tale) and the casting of Ron Moody and Frank Langella as treasure hunters.', 'Young Frankenstein', 'and', 'Blazing Saddles', 'followed in 1974. The former, a spoof of horror films, is easily one of the top two or three funniest movies of all time, and the latter is justly famous for its often-tasteless send-up of Western cliches.', 'Silent Movie', '(1976) is just what the title describes, with its only word of dialogue spoken from the least-likely source, and', 'High Anxiety', '(1977) pays tribute to the work of Alfred Hitchcock.', 'History of the World, Part 1', '(1981) mocks historical events and epics, and', 'To Be or Not to Be', \"(1983) is a remake of Ernst Lubitsch's 1942 classic of the same name (it's also the only film in the set for which Brooks didn't receive writing and directing credit). By this time, Brooks was more actively taking the leading roles himself (rather than the bit parts), and unfortunately relying less on his topnotch ensemble of recurring players, which included Gene Wilder, Madeline Kahn, Cloris Leachman, Harvey Korman, and Dom DeLuise. But he does use a new ensemble (including Cary Elwes and, in his film debut, Dave Chappelle), for\", 'Robin Hood: Men in Tights', '(1993), the feature-length spin on the same hero Brooks had spoofed in his short-lived 1975 television series', 'When Things Were Rotten', '.', 'Bonus features are minor. In addition to an HBO featurette on', 'Men in Tights', \", there's a featurette and interviews on\", 'To Be or Not to Be', 'and all the features (Brooks commentary, deleted scenes, interviews, etc.) that were on the original release of', 'Young Frankenstein', '. Note that while rights issues kept', 'The Producers', ',', 'Spaceballs', \", and other films out of this set, 20th Century Fox was able to use Warner Bros.'\", 'Blazing Saddles', '. The features on that disc, however, are the ones that were on the 1997 DVD release, not the 2004 anniversary reissue. Regardless, the set\\'s price for this many films is low, and because it has so many films new to DVD, Brooks fans will want to pick this up faster than they can say... \"', 'Frau Blücher!', '\"', '--David Horiuchi']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Frank Langella, Ernst Lubitsch, Marty Feldman, Gregory Hines, Alan Johnson, Barry Levinson, Andras Voutsinas, Cleavon Little, Doris Mudie, Mel Brooks, Ron Moody, Dom DeLuise, Anne Bancroft, Cary Elwes, Madeline Kahn, Alan Uger, Andrew Bergman, Edwin Justus Mayer, Gene WilderFrank Langella, Ernst Lubitsch, Marty Feldman, Gregory Hines, Alan Johnson, Barry Levinson, Andras Voutsinas, Cleavon Little, Doris Mudie, Mel Brooks, Ron Moody, Dom DeLuise, Anne Bancroft, Cary Elwes, Madeline Kahn, Alan Uger, Andrew Bergman, Edwin Justus Mayer, Ge…  See more', 'Language': 'Unqualified', 'Runtime': '12 hours and 52 minutes', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.3 Pounds', 'Item model number': 'FOX2226750DVD', 'Director': 'Alan Johnson, Mel Brooks', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '12 hours and 52 minutes', 'Release date': 'April 4, 2006', 'Actors': 'Mel Brooks, Gene Wilder, Madeline Kahn, Marty Feldman, Anne Bancroft', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Alan Uger, Andrew Bergman, Barry Levinson, Doris Mudie, Edwin Justus Mayer', 'Number of discs': '8'}\nAnother great Dvd.\nFive Stars",
  "profile": "The user continues to emphasize their love for family-oriented entertainment, particularly through animated films and comedy. Their recent acquisition of a celebrated collection reflects a deep appreciation for classic comedic styles that resonate across generations, highlighting their dedication to creating enjoyable viewing experiences with family members. This choice underscores their ongoing pursuit of timeless humor that fosters connection and laughter during family movie nights.\n\nTheir tendency to grant high ratings for uplifting films demonstrates a clear preference for entertaining narratives that uplift and unite loved ones. The user's enthusiasm for iconic comedies indicates a desire to curate memorable moments filled with joy and sentiment, further solidifying their focus on lighthearted stories that enhance family relationships. Although they occasionally explore more serious themes, the primary focus remains on enriching and feel-good content that strengthens family bonds.\n\nOverall, the user exemplifies a commitment to nurturing connections through engaging and humorous films. Their consistent behavior patterns reflect a passion for selecting content that not only entertains but also promotes shared experiences, ensuring that cinema remains a cherished tradition in their household.",
  "metrics": {
    "rouge1_f": 0.03607552258934592,
    "rouge2_f": 0.0006745362563237773,
    "rougeL_f": 0.020229265003371546,
    "meteor": 0.008763491164028834,
    "bleu1": 1.6090520805700165e-19,
    "bleu2": 4.6570137302972154e-20,
    "bleu3": 7.161642133432156e-21,
    "bleu4": 2.8121281366280534e-21,
    "bertscore_precision": 0.2887626886367798,
    "bertscore_recall": 0.48253411054611206,
    "bertscore_f1": 0.3613080084323883
  }
}