{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Forrest Gump (1994)\nReview Date: 2015/11/25\nStore: Various  (Actor, Director)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Forrest Gump (DVD)', \"Stupid is as stupid does, says Forrest Gump (played by Tom Hanks in an O scar-winning performance) as he discusses his relative level of intelli gence with a stranger while waiting for a bus. Despite his sub-normal IQ , Gump leads a truly charmed life, with a ringsid e seat for many of the most memorable events of the second half of the 20th century. Entirely without trying, Forrest teaches Elvis Presley to dance, becomes a footba ll star, meets John F. Kennedy, serves with honor in Vietnam, meets Lynd on Johnson, speaks at an a nti-war rally at the Washington Monument, han gs out with the Yippies, defeats the Chinese national team in table tenn is, meets Richa rd Nixon, discovers the break-in at the Watergate, opens a profitable shrimping business, becomes an original investor in Apple Comp uters, and decides to run back and forth across the country for sev eral years. Meanwhile, as the remarkable parade of his life goes by, For rest never forgets Jenny (Robin Wright Penn), the girl he loved as a boy , who makes her own journey through the turbulence of the 1960s and 197 0s that is far more troubled than the path Forrest happens upon. Feature d alongside Tom Hanks are Sally Field as F orrest's mother; Gary Sinise as his commanding officer in Vietnam; Mykelti Williamson as his ill-fate d Army buddy who is familiar wi th every recipe that involves shrimp; an d the special effects artists whose digital magic place Forrest amidst a remarkable array of historical events and people.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '2 hours and 22 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000526417DVD', 'Director': 'Various', 'Media Format': 'Color, Multiple Formats, Dolby, NTSC', 'Run time': '2 hours and 22 minutes', 'Release date': 'October 21, 2014', 'Actors': 'Various', 'Dubbed': 'French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Favorite &#34;Movie for The Family&#34;\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "John Deere Heaven, Part 1\nJohn Deere Toys & Tractors  (Actor),     Tom McComas  (Director),     Joseph Stachler  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', 'Welcome to John Deere Heaven -where all is mellow and even the cows are green and yellow. We first visited John Deere Heaven in All About John Deere Part 4, and people enjoyed the trip so much we decided to return and stay for an entire show.', 'See John Deere toys come alive in this fanciful, fast-paced mix of toy trains, tractors, and big machines. TMs video magic will thrill and delight young and old alike. See O gauge and Standard gauge John Deere trains zip around elaborately detailed train layouts along with John Deere 1/16th, 1/50th and 1/64th scale tractors, cars, and trucks. Plus ten original songs by our favorite singer/songwriter James Coffey. Otto is in town and his little switch engine is blocking the mainline and here comes the Circus Train! Oh no!', 'Review', 'John Deere Heaven is a DVD in which stop-motion animation makes beloved John Deere toys come alive. Ten original songs by singer and songwriter James Coffey spice up the elaborate miniature train layouts and interactions between exquisitely accurate replicas of machines. Young and old toy collectors alike are sure to enjoy watching 1/16, 1/50, and 1/64 scale tractors, cars, and trucks vroom about in this entertaining show, especially recommended for tractor lovers. --The Midwest Book Review']\n{'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.36 Ounces', 'Director': 'Tom McComas, Joseph Stachler', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen', 'Run time': '45 minutes', 'Release date': 'April 24, 2008', 'Actors': 'John Deere Toys & Tractors', 'Language': 'Unqualified', 'Studio': 'TM Books & Video', 'Number of discs': '1'}\nOur Grandson &#34;loved it&#34;.\nFive Stars\nMafia! [DVD]\nJay Mohr  (Actor),     Christina Applegate  (Actor),     Jim Abrahams  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product description', 'MAFIA!', 'Amazon.com', 'This hapless comedy may actually work a lot better on video than it did in theaters. A parody of contemporary mob movies (with a few sidebars skewering such hits as', 'Forrest Gump', 'and', 'The English Patient', '),', 'Mafia!', 'most closely resembles the first two', 'Godfather', 'films in its generational saga of a gangster family. Lloyd Bridges plays Don Cortino, a native Sicilian who presides over a crime syndicate, and Jay Mohr plays his Michael Corleone-like son. The film is by Jim Abrahams, formerly of the Zucker-Abrahams-Zucker directing team (', 'Airplane!', ',', 'The Naked Gun', '), single- handedly trotting out the old dumb-joke aesthetic that worked wonderfully a lifetime ago but looks a little creaky in the era of', \"There's Something About Mary\", '. Silly allusions to every crime film (', 'GoodFellas', ',', 'Casino', ') produced in the last three decades and featuring at least one wise guy or made man find their way into', 'Mafia!', \"'s gags, but most are arbitrary and shrugged off. The film tanked in theaters for good reason; on the other hand,\", 'Mafia!', \"might have a lot more to offer if you're slumped on your own couch at the end of a long day, ready for brain-dead entertainment and absolutely apathetic about comic integrity. Even a film this instantly stale on the big screen might have its place in video posterity.\", '-- Tom Keogh']\n{'Genre': 'Comedy', 'Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Widescreen, NTSC, Letterboxed', 'Contributor': 'Tony Lo Bianco, Michael McManus, Blake Hammond, Philip Suriano, Christina Applegate, Billy Burke, Pamela Gidley, Vincent Pastore, Jason Fuchs, Lloyd Bridges, Joe Viterelli, Jim Abrahams, Olympia Dukakis, Greg Norberg, Jay MohrTony Lo Bianco, Michael McManus, Blake Hammond, Philip Suriano, Christina Applegate, Billy Burke, Pamela Gidley, Vincent Pastore, Jason Fuchs, Lloyd Bridges, Joe Viterelli, Jim Abrahams, Olympia Dukakis, Greg Norberg, Jay Mohr  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 23 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 3.2 Ounces', 'Director': 'Jim Abrahams', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Widescreen, NTSC, Letterboxed', 'Run time': '1 hour and 23 minutes', 'Release date': 'February 9, 1999', 'Actors': 'Jay Mohr, Christina Applegate, Lloyd Bridges, Billy Burke, Pamela Gidley', 'Subtitles': 'English', 'Studio': 'Walt Disney Video / Mill Creek', 'Writers': 'Greg Norberg, Jim Abrahams, Michael McManus', 'Number of discs': '1'}\nMy Husband love's it.\nFive Stars\nBlast from the Past (DVD)\nBrendan Fraser  (Actor),     Alicia Silverstone  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Blast from the Past (DVD) (Rpkg)', \"After 35 years in a bomb shelter, Adam Webber is finally going outside to play. When a man raised in a 1950s era bomb shelter emerges into the outside world for the first time--to find a nice nonmutant girl with whom to repopulate the earth--meets a savvy, cynical modern woman, sparks fly, opposites attract and the result is a wondrous chain reaction in this romantic comedy for the nuclear age--Blast from the Past. Adam's hapless search in the brave new world of homeless people, adult bookstores and all-night supermarkets leads him directly into Eve. She's suspicious, smart about survival and uncertain of the possibilities of love. Her life has been a series of dead-end jobs, shallow boyfriends and dashed hopes. But the more Eve watches Adam approach the world with wide eyes, comic miscomprehension, joyous delight and a deliciously sweet innocence, the more she begins to find herself falling in love?\", ']]>']\n{'Genre': 'Drama, Romance, Comedy', 'Format': 'Multiple Formats, Dolby, NTSC, Color, Full Screen', 'Contributor': 'Christopher Walken, Brendan Fraser, Sissy Spacek, Renny Harlin, Hugh Wilson, Bill Kelly, Dave Foley, Amanda Stern, Alicia Silverstone, Claire Rudnick Polstein, Sunil PerkashChristopher Walken, Brendan Fraser, Sissy Spacek, Renny Harlin, Hugh Wilson, Bill Kelly, Dave Foley, Amanda Stern, Alicia Silverstone, Claire Rudnick Polstein, Sunil Perkash   See more', 'Initial release date': '2010-11-09', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.98 Ounces', 'Item model number': '164132', 'Director': 'Hugh Wilson', 'Media Format': 'Multiple Formats, Dolby, NTSC, Color, Full Screen', 'Run time': '1 hour and 52 minutes', 'Release date': 'November 9, 2010', 'Actors': 'Brendan Fraser, Alicia Silverstone, Christopher Walken, Sissy Spacek, Dave Foley', 'Producers': 'Amanda Stern, Renny Harlin, Hugh Wilson, Sunil Perkash, Claire Rudnick Polstein', 'Studio': 'Studio Distribution Services', 'Writers': 'Hugh Wilson, Bill Kelly', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy Husband &#34;LOVE'S IT&#34;.\nFive Stars\nBeerfest (Unrated)\nComedy, Adventure, Cerebral, Coarse\n[\"After a humiliating false start in Germany's super-secret beer competition, America's unlikely team vows to risk life, limb and liver to dominate the ultimate beer championship.\"]\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Chandrasekhar'], 'Producers': ['Bill Gerber', 'Richard Perello', 'Erik Stolhanske'], 'Starring': ['Jay Chandrasekhar', 'Kevin Heffernan', 'Steve Lemme']}\nThe Movie is for Adult's, Very FUNNY.\nVery FUNNY.\nForrest Gump (1994)\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Forrest Gump (DVD)', \"Stupid is as stupid does, says Forrest Gump (played by Tom Hanks in an O scar-winning performance) as he discusses his relative level of intelli gence with a stranger while waiting for a bus. Despite his sub-normal IQ , Gump leads a truly charmed life, with a ringsid e seat for many of the most memorable events of the second half of the 20th century. Entirely without trying, Forrest teaches Elvis Presley to dance, becomes a footba ll star, meets John F. Kennedy, serves with honor in Vietnam, meets Lynd on Johnson, speaks at an a nti-war rally at the Washington Monument, han gs out with the Yippies, defeats the Chinese national team in table tenn is, meets Richa rd Nixon, discovers the break-in at the Watergate, opens a profitable shrimping business, becomes an original investor in Apple Comp uters, and decides to run back and forth across the country for sev eral years. Meanwhile, as the remarkable parade of his life goes by, For rest never forgets Jenny (Robin Wright Penn), the girl he loved as a boy , who makes her own journey through the turbulence of the 1960s and 197 0s that is far more troubled than the path Forrest happens upon. Feature d alongside Tom Hanks are Sally Field as F orrest's mother; Gary Sinise as his commanding officer in Vietnam; Mykelti Williamson as his ill-fate d Army buddy who is familiar wi th every recipe that involves shrimp; an d the special effects artists whose digital magic place Forrest amidst a remarkable array of historical events and people.\", ']]>']\n{'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '2 hours and 22 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000526417DVD', 'Director': 'Various', 'Media Format': 'Color, Multiple Formats, Dolby, NTSC', 'Run time': '2 hours and 22 minutes', 'Release date': 'October 21, 2014', 'Actors': 'Various', 'Dubbed': 'French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nFavorite &#34;Movie for The Family&#34;\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\nThe user maintains a strong preference for family-oriented entertainment, particularly animated content for children, while their recent activities demonstrate an expanding interest in comedies that appeal to both adults and families. Their latest acquisition, a classic film that blends humor and poignant storytelling, reinforces their commitment to selecting high-quality content that resonates with diverse audiences.\n\nConsistently providing five-star ratings, the user seeks films that promote joy and laughter, enhancing family connections through shared viewing experiences. They are increasingly drawn to narratives that combine humor with heartfelt moments, indicative of their versatile taste in entertainment. Their evolving interests suggest a willingness to appreciate stories that balance lighthearted themes with deeper emotional layers, allowing for both enjoyment and reflection.\n\nThe user’s recent choice highlights their attraction to films that encapsulate the journey of life’s ups and downs while maintaining a relatable and humorous perspective. This evolving taste showcases their adaptive approach to entertainment, as they continue to prioritize films that foster family interactions and produce delightful experiences. Overall, the user remains dedicated to curating enjoyable content that not only entertains but also enriches family dynamics and storytelling experiences across generations.",
  "metrics": {
    "rouge1_f": 0.0865654862282181,
    "rouge2_f": 0.0011254924029262803,
    "rougeL_f": 0.04609331084879145,
    "meteor": 0.025140066082459417,
    "bleu1": 2.5352567436521948e-05,
    "bleu2": 6.650270786495818e-06,
    "bleu3": 1.1573215553757674e-06,
    "bleu4": 4.833513034210875e-07,
    "bertscore_precision": 0.30170294642448425,
    "bertscore_recall": 0.44587042927742004,
    "bertscore_f1": 0.3598855435848236
  }
}