{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 100% PURE Cocoa Coffee Body Scrub Exfoliating Deep Cleanse with Sea Salts & Nourishing Oils Natural Moisturizing Skincare Radiant Skin Restore & Pore Cleanser for Women & Men Vegan - 10oz\nReview Date: 2022/03/23\nStore: 100% PURE\nProduct Description: ['Our invigorating cacao and coffee body scrub buffs away bumps and flakes for radiant, deeply nourished skin. We source the highest quality organic and fair trade Ecuadorian cacao, which contains beneficial tannins, flavonoids, and antioxidants. Natural caffeine from coffee and cacao offers calming benefits to reduce redness, combat the effects of UV damage in skin, and promote a glowing complexion.']\nAverage Rating: 3.1\nProduct Details: {'Brand': '100% PURE', 'Skin Type': 'Dry', 'Product Benefits': 'Nourished', 'Material Feature': 'Certified Organic, Gluten Free, Cruelty Free, Vegan', 'Number of Items': '1', 'Package Dimensions': '3.74 x 3.58 x 1.93 inches; 11.99 Ounces', 'Item model number': '1BCCBS', 'Department': 'mens', 'UPC': '843585108033', 'Manufacturer': '100% PURE'}\nReview Text: The other items in this line I liked a lot. This was unpleasant feeling and snaked more like first than coffee.\nReview Title: Not a fan\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Hand Crafted Ceramic Aromatherapy Essential Oil Diffuser,100ml Fragrant Room Sprays Ultrasonic Aroma Mist Atomizer BPA-Free, Waterless Auto Shut-Off and 7 Color Night Lights for Office Home Study Yoga\nBRNBW\n{'Brand': 'BRNBW', 'Material': 'Ceramic', 'Special Feature': 'Multiple Light Setting, Automatic Shut Off', 'Power Source': 'Corded Electric', 'Capacity': '100 Milliliters', 'Product Dimensions': '3.6 x 3.6 x 6.3 inches; 1.12 Pounds', 'UPC': '665059186312'}\nThis diffuser works well, my room smelled great. The kids enjoyed the soft color scheme as the diffuser was on. The ceramic looks very nice and it blends well with the decor when not in use.\nThe glowing lights are great!\n4 pcs Button Headband Yoga Sports Workout Turban Headwrap Elastic Ear Protection Holder Twisted Running Hair Band for Women Men Adult Kids (Style A)\nFMJYa\n{'Material': 'Polyester', 'Fabric Type': 'Elastic,Polyester,Spandex', 'Item Weight': '80 Grams', 'Brand': 'FMJYa', 'Item Form': 'Wrap', 'Product Dimensions': '10.63 x 9.45 x 0.59 inches; 2.82 Ounces', 'UPC': '602310562591'}\nThe buttons are not sturdily sewed right the headband. I have others with large buttons that support my large banded masks, these did not. The button flopped forward and the mask slipped off. It worked much better with the thin banded masks.\nGood fit, big buttons\n2Pcs silicon body scrubbers, Bath Exfoliating Silicone Body Back Scrubber, Body Wash Silicone Body Scrubber\nCricoli\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.91 x 7.32 x 2.36 inches; 15.66 Ounces', 'UPC': '782931953692'}\nI was interested to try something new, but these did not work as well as the style I’d used previously. They are definitely more durable, but since I end up skipping them altogether, it’s not a saver for us.\nDid not like as much as I hoped to\n5 PCS Big Hair Claw Clips Trendcy Colors- 4.3 Inch Matte Non-slip Material Strong Hold Hair For Women And Girls, 9 PCS Hair Ties- 3 Popular Colors Coil Hair Ties, Phone Cord Hair Ties, Hair Coils,Fashion Hair Accessories\nAceoce\n{'Brand': 'Aceoce', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Style': 'Claw', 'Material': 'Plastic', 'Package Dimensions': '4.76 x 4.76 x 3.74 inches; 6.38 Ounces', 'UPC': '728872436672'}\nThese claw clips worked okay with my thick hair, but not great. The hair ties were too small.\nClaw Clips Okay for Thick Hair\nNODG 6 Pieces Scrunchies for Hair Cute Scrunchies for Women with Pearl Women's Hair Scrunchies Chiffon Flowers Elastic Hair Bands Scrunchy Hair Ties Ropes Scrunchy Hair Scrunchies\nNODG\n{'Color': 'Yellow,Blue,Green,Beige,Pink,Purple', 'Material': 'Pearl,Rubber,Satin,Chiffon', 'Item Form': 'Scrunchie', 'Brand': 'NODG', 'Hair Type': 'Curly', 'Package Dimensions': '5.94 x 4.69 x 2.28 inches; 2.08 Ounces', 'UPC': '770619124069'}\nThese scrunchies have adorable prints. I love them and so does my daughter.\nCute prints\nMaestee 9 Pcs Gel Nail Polish Kit, 6 Colors (8ml) with Base and Top Coat and Matte Top Gel (8ml) Neon Nail Polish Hot Neon City Collection Soak Off Nail Gel Polish Starter Professional Kit Best Mothers Day Gift\nmaestee\n{'Brand': 'maestee', 'Item Form': 'Gel', 'Finish Type': 'Matte,Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '9', 'Number of Pieces': '9', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.69 x 3.66 x 1.42 inches; 14.07 Ounces'}\nMy daughters love these bright and bold colors. Cheerful and they get a ton of compliments on them when they wear.\nNeon\nLordHighting 240 Pieces Halloween Party/ Ball Press on False Nails with Design, 12 Sizes Medium and Long Full Cover Gloss Fake Nails for Woman and Girls\nLordHighting\n{'Size': 'Medium', 'Material': 'Plastic', 'Brand': 'LordHighting', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Product Dimensions': '7.68 x 3.35 x 1.06 inches; 3.84 Ounces'}\nThe sizes were a bit difficult to figure out, but it was cute and easy to use. need your own glue, does not include glue as some sets do.\nFun Halloween Nails\n100% PURE Cocoa Coffee Body Scrub Exfoliating Deep Cleanse with Sea Salts & Nourishing Oils Natural Moisturizing Skincare Radiant Skin Restore & Pore Cleanser for Women & Men Vegan - 10oz\n100% PURE\n['Our invigorating cacao and coffee body scrub buffs away bumps and flakes for radiant, deeply nourished skin. We source the highest quality organic and fair trade Ecuadorian cacao, which contains beneficial tannins, flavonoids, and antioxidants. Natural caffeine from coffee and cacao offers calming benefits to reduce redness, combat the effects of UV damage in skin, and promote a glowing complexion.']\n{'Brand': '100% PURE', 'Skin Type': 'Dry', 'Product Benefits': 'Nourished', 'Material Feature': 'Certified Organic, Gluten Free, Cruelty Free, Vegan', 'Number of Items': '1', 'Package Dimensions': '3.74 x 3.58 x 1.93 inches; 11.99 Ounces', 'Item model number': '1BCCBS', 'Department': 'mens', 'UPC': '843585108033', 'Manufacturer': '100% PURE'}\nThe other items in this line I liked a lot. This was unpleasant feeling and snaked more like first than coffee.\nNot a fan",
  "profile": "**User Profile Summary:**\n\n- **Product Type Preference:** Enjoys home decor and lifestyle products that enhance indoor ambiance, with a growing interest in nail care, particularly vibrant gel polishes for family activities and themed events like Halloween. Recent exploration into skincare indicates openness to new personal care products.\n- **Aesthetics:** Prefers visually appealing designs that integrate seamlessly with home decor and personal items. Engagement with colorful, themed nail products shows an appreciation for lively colors and aesthetics tied to family-centric celebrations.\n- **Functionality:** Values multi-functional items with essential safety features for home use, along with practical accessories for diverse lifestyle needs, including nail and skincare applications. The user emphasizes product performance, with a recent selective approach to effectiveness and satisfaction.\n- **Family-Oriented:** Focused on safe, enjoyable products for children and family, with positive feedback reflecting a desire for engaging solutions. The interest in vibrant, themed items is consistent with creating shared family experiences.\n- **Environment Preference:** Aims to cultivate an inviting atmosphere through thoughtful choices, prioritizing aesthetics and functionality, especially during seasonal celebrations.\n- **Overall Satisfaction:** Generally maintains positive experiences but has become increasingly discerning regarding product effectiveness. Recent interactions suggest a willingness to try new products, although dissatisfaction with certain items highlights the need for ongoing assessment of quality and usability.",
  "metrics": {
    "rouge1_f": 0.14985590778097982,
    "rouge2_f": 0.0038498556304138597,
    "rougeL_f": 0.069164265129683,
    "meteor": 0.057267031993180936,
    "bleu1": 0.012531523069152489,
    "bleu2": 0.002372649491853689,
    "bleu3": 0.00043901320853406527,
    "bleu4": 0.0001890196671464517,
    "bertscore_precision": 0.35633665323257446,
    "bertscore_recall": 0.466917484998703,
    "bertscore_f1": 0.40420037508010864
  }
}