{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Barbie Fairytopia - Magic of the Rainbow\nReview Date: 2010/03/28\nStore: Kelly Sheridan  (Actor),     Lee Tockar  (Actor),     William Lau  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Animation\nProduct Description: ['Product Description', 'Join Barbie as Elina in an all-new Fairytopia adventure! Elina travels with her puffball Bibble to Fairy School at the magnificent Crystal Palace. There, she meets the other fairy apprentices, chosen to learn the annual Flight of Spring and magically create the first rainbow of the season. But when the evil Laverna tries to stop the Flight, threatening to plunge Fairytopia into ten years of bitter winter, Elina and her new friends must learn that \"together we are strong.\" But are they strong enough to defeat Laverna and bring the rainbow to life? And will Bibble, who has a loose tooth, fall in love with the adorable puffball Dizzle?', 'Amazon.com', 'Believing in oneself can be difficult, even with the support of friends. The formerly wingless fairy Elina has saved Fairytopia more than once, proving herself against Fungus Maximus and turning the evil Laverna into a frog in', 'Barbie Fairytopia', 'and', 'Barbie Fairytopia--Mermaidia', \", but she still questions her own abilities when Guardian Azura selects her to become her apprentice and learn the all-important flight of spring--a ritual which ensures another year of vitality in Fairytopia. The taunts and snobby attitudes of her fellow apprentices serve to further undercut Elina's self-esteem, but she vows to do her best to master the flight of spring and soon proves worthy of her appointment. When the trickery of Laverna threatens to stop the flight of spring and destroy Fairytopia forever, it falls to the new apprentices to save Fairytopia. Of course, Elina will play a pivotal role in the group's eventual success or failure. Prepubescent attitudes and shallowness reign among most of the apprentices, but most eventually see the error of their ways and the clear message is the importance of believing in oneself. (Ages 3 to 9)\", '--Tami Horiuchi']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, DVD Movie, Barbie: Fairytopia, Animation, Mattel, Blu-ray Movie, Action & AdventureKids & Family, DVD Movie, Barbie: Fairytopia, Animation, Mattel, Blu-ray Movie, Action & Adventure  See more', 'Format': 'Multiple Formats, Animated, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Contributor': 'Elise Allen, Lee Tockar, Tabitha St. Germain, Kathleen Barr, William Lau, Luke Carroll, Christopher Gaze, Kelly SheridanElise Allen, Lee Tockar, Tabitha St. Germain, Kathleen Barr, William Lau, Luke Carroll, Christopher Gaze, Kelly Sheridan  See more', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 15 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.81 x 5.43 x 7.54 inches; 1.6 Ounces', 'Director': 'William Lau', 'Media Format': 'Multiple Formats, Animated, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 15 minutes', 'Release date': 'August 28, 2011', 'Actors': 'Kelly Sheridan, Lee Tockar, Kathleen Barr, Christopher Gaze, Tabitha St. Germain', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Luke Carroll', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Elise Allen', 'Number of discs': '1'}\nReview Text: My 3 yr & 6 yr old grand daughters love this move, as with most of the Barbie movies. I wasn't really looking for life's lessons in a Barbie movie, so I wasn't disappointed.  There is always some good, some bad & lots of magic. Spending time listening to my grand daughters school me on Barbie - that's all the life's lessons I need. It holds their interest. I think the movie has met it's expectations. I would recommend this movie & series to those that are new to the Barbie series. If you're not new to these movies, you know what to expect.\nReview Title: Fairytopia - more magic\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Toy Story & Toy Story 2 (2 Pack)\nRated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product description', 'Toy Story & Toy Story 2 (2 Pack', 'Amazon.com', 'Toy Story', 'There is greatness in film that can be discussed, dissected, and talked about late into the night. Then there is genius that is right in front of our faces--we smile at the spell it puts us into and are refreshed, and nary a word needs to be spoken. This kind of entertainment is what they used to call \"movie magic,\" and there is loads of it in this irresistible computer animation feature. Just a picture of these bright toys on the cover of', 'Toy Story', \"looks intriguing, reawakening the kid in us. Filmmaker John Lasseter's shorts (namely\", 'Knickknack', 'and', 'Tin Toy', ', which can be found on the Pixar video', 'Tiny Toy Stories', ') illustrate not only a technical brilliance but also a great sense of humor--one in which the pun is always intended. Lasseter thinks of himself as a storyteller first and an animator second, much like another film innovator, Walt Disney.', \"Lasseter's story is universal and magical: what do toys do when they're not played with? Cowboy Woody (voiced by Tom Hanks), Andy's favorite bedroom toy, tries to calm the other toys (some original, some classic) during a wrenching time of year--the birthday party, when newer toys may replace them. Sure enough, Space Ranger Buzz Lightyear (Tim Allen) is the new toy that takes over the throne. Buzz has a crucial flaw, though--he believes he's the real Buzz Lightyear, not a toy. Bright and cheerful,\", 'Toy Story', 'is much more than a 90-minute commercial for the inevitable bonanza of Woody and Buzz toys. Lasseter further scores with perfect voice casting, including Don Rickles as Mr.\\xa0Potato Head and Wallace Shawn as a meek dinosaur. The director-animator won a special Oscar for \"the development and inspired application of techniques that have made possible the first feature-length computer-animated film.\" In other words, the movie is great.', '--Doug Thomas', 'Toy Story 2', 'John Lasseter and his gang of high-tech creators at Pixar create another entertainment for the ages. Like the few great movie sequels,', 'Toy Story\\xa02', \"comments on why the first one was so wonderful while finding a fresh angle worthy of a new film. The craze of toy collecting becomes the focus here, as we find out Woody (voiced by Tom Hanks) is not only a beloved toy to Andy but also a rare doll from a popular '60s children's show. When a greedy collector takes Woody, Buzz Lightyear (Tim Allen) launches a rescue mission with Andy's other toys. To say more would be a crime because this is one of the most creative and smile-inducing films since, well, the first\", 'Toy Story', '.', \"Although the toys look the same as in the 1994 feature, Pixar shows how much technology has advanced: the human characters look more human, backgrounds are superior, and two action sequences that book-end the film are dazzling. And it's a hoot for kids and adults. The film is packed with spoofs, easily accessible in-jokes, and inspired voice casting (with newcomer Joan Cusack especially a delight as Cowgirl Jessie). But as the Pixar canon of films illustrates, the filmmakers are storytellers first. Woody's heart-tugging predicament can easily be translated into the eternal debate of living a good life versus living forever.\", 'Toy Story\\xa02', 'also achieved something in the U.S. two other outstanding 1999 animated features (', 'The Iron Giant', ',', 'Princess Mononoke', ') could not: it became a huge box-office hit.', '--Doug Thomas']\n{'Format': 'Color, Widescreen, NTSC', 'Contributor': 'Toy Story 2pak', 'Language': 'English (Dolby Digital 5.1 EX), English (THX Surround EX)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 1 inches; 6.4 Ounces', 'Media Format': 'Color, Widescreen, NTSC', 'Release date': 'October 17, 2000', 'Actors': 'Toy Story 2pak', 'Studio': 'Disney/Pixar', 'Number of discs': '2'}\nThis is hands down the best Disney Movie. This movie appeals to my Mother, my son, myself, and my grandchildren. What more can you ask from what will be a timeless classic. If you can get these movies - get them.\nToy Stories\nBarbie and the Magic of Pegasus\nKelly Sheridan  (Actor),     Kathleen Barr  (Actor),     Greg Richardson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Barbie™ takes flight in her first original princess fairy tale movie, Barbie™ and the Magic of Pegasus. Princess Annika (Barbie™) discovers adventure when she is befriended by Brietta – a magnificent winged horse – that flies her to the beautiful Cloud Kingdom. Annika has only three days to break the spell of Wenlock, an evil wizard who has turned her family to stone. On her quest to defeat Wenlock, Annika meets new friends and together they travel to forbidden forests, skate through icy caverns and fly above the clouds as they attempt to build a magical wand of light. The score includes soaring themes from Beethoven’s Sixth Symphony. Fly with Barbie™ on her most amazing adventure ever!']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Kids & Family/10-12 YearsScience Fiction & Fantasy, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Kids & Family/10-12 Years   See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Brian Drummond, Greg Richardson, Russell Arons, Mark Hildreth, John DeSantis, Chantal Strand, Luke Carroll, Stevie Vallance, Russell Roberts, Colin Murdock, Kathleen Barr, Jessica Amlee, Lalania Lindbjerg, Kelly Sheridan, Jesyca C. Durchin, Cliff Ruby, Andrea Libman, Elana LesserBrian Drummond, Greg Richardson, Russell Arons, Mark Hildreth, John DeSantis, Chantal Strand, Luke Carroll, Stevie Vallance, Russell Roberts, Colin Murdock, Kathleen Barr, Jessica Amlee, Lalania Lindbjerg, Kelly Sheridan, Jesyca C. Durchin, Cliff Ruby, Andrea Libman, Elana…   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'Greg Richardson', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'January 5, 2010', 'Actors': 'Kelly Sheridan, Kathleen Barr, Lalania Lindbjerg, Colin Murdock, Mark Hildreth', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Luke Carroll, Jesyca C. Durchin', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nI don't find the movie inappropriate for my 3 & 6 yr old grand daughters. They enjoy the color and the simple story. Any questions about behavior have simple explanations. I have purchased most of the Barbie Movies. The music is soothing, nice, calm - the girls pretend with their ballet. I would recommend to anyone who has little girls who are interested in dolls!!\nBarbie's Tales\nBarbie of Swan Lake\nKelly Sheridan  (Actor),     Mark Hildreth  (Actor),     Owen Hurley  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Barbie stars in this tale about a young princess who is transformed into a swan.', 'Genre:', \"Children's Video\", 'Rating:', 'G', 'Release Date:', '22-AUG-2006', 'Media Type:', 'DVD']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC, Anamorphic', 'Contributor': 'Brian Drummond, Mark Hildreth, Kelsey Grammer, Venus Terzo, Michael Dobson, Owen Hurley, Chantal Strand, Maggie Wheeler, Nicole Oliver, Kathleen Barr, Gina Stockdale, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana LesserBrian Drummond, Mark Hildreth, Kelsey Grammer, Venus Terzo, Michael Dobson, Owen Hurley, Chantal Strand, Maggie Wheeler, Nicole Oliver, Kathleen Barr, Gina Stockdale, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana Lesser   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.48 Ounces', 'Director': 'Owen Hurley', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC, Anamorphic', 'Run time': '1 hour and 21 minutes', 'Release date': 'September 30, 2003', 'Actors': 'Kelly Sheridan, Mark Hildreth, Kelsey Grammer, Maggie Wheeler, Venus Terzo', 'Studio': 'Lions Gate', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nThis is a movie that I don't mind watching every week. The music is calm; the movie is one of my grand daughters favorites. When questions come up, simple explanations of consequences & actions is all that is needed. I enjoy these movies. My grand daughters are 3 & 6 & they love this movie.\nBarbie & the magic of Swan lake\nBarbie as Rapunzel [DVD]\nKelly Sheridan  (Actor),     Anjelica Huston  (Actor),     Owen Hurley  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n{'Genre': 'Kids & Family', 'Format': 'Anamorphic, Animated, Color, DVD, NTSC, Closed-captioned, Full Screen', 'Contributor': 'Anjelica Huston, Mark Hildreth, Owen Hurley, Chantal Strand, Christopher Gaze, Danny McKinnon, Cree Summer, Russell Roberts, David Kaye, Peter Kelamis, Terry Klassen, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana LesserAnjelica Huston, Mark Hildreth, Owen Hurley, Chantal Strand, Christopher Gaze, Danny McKinnon, Cree Summer, Russell Roberts, David Kaye, Peter Kelamis, Terry Klassen, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana Lesser  See more', 'Language': 'English', 'Number Of Discs': '1'}\nMy 3 & 6 yr old grand daughters really enjoy these Barbie movies. Interesting, calm, colorful. Enjoyable enough that I don't mind watching it weekly with them. You won't be disappointed.\nBarbie Fantasies\nBarbie as The Island Princess\nKelly Sheridan  (Actor),     Melissa Lyons  (Actor),     Greg Richardson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n['Product Description', \"It's time to set sail with Barbie as The Island Princess in this full-length, original musical featuring nine fantastic songs. After being shipwrecked on an island as a little girl, Rosella (Barbie) grows up learning to talk and sing with a family of loving animals: the red panda Sagi, the peacock Azul and the baby elephant Tika. But when Prince Antonio discovers their tropical paradise, curiosity about her past leads Rosella to journey with the prince to his castle. As she and her animal friends explore civilization, they uncover an evil plot to take over the kingdom! Through its heart-warming ending, Barbie as the Island Princess shows that when love guides you, miracles may be closer than you know.\", 'Amazon.com', \"Sometimes it's difficult finding one's place in the world and, while a young shipwrecked girl named Ro couldn't ask for better friends than the animals that raised her on a South Seas island, she wonders about her parents and where she came from. When avid explorer Prince Antonio discovers the island, he offers Ro a chance to return to civilization and Ro convinces her friends Tika the elephant, Sagi the red panda, and Azul the peacock to accompany her. Once in the Prince's kingdom, Ro and her friends feel hopelessly out of place and fall prey to the tricks of a scheming traitor. Just when it seems that Ro may never find her parents, feel comfortable in the civilized world, nor realize her love for the Prince, Ro gets a hint of her mother's identity and finds an opportunity to prove her goodness to the royal family. This CGI animated musical stars Barbie and features nine very nice original songs. The animation is adequate, if not particularly realistic, and the story, though it's certainly been told before, holds the interest of children ages 3 to 7 years. - -\", 'Tami Horiuchi', 'Beyond', 'Barbie as the Island Princess', 'on DVD', 'More Barbie on DVD', 'Barbie as the Island Princess in Spanish', 'The Barbie Store', 'Stills from', 'Barbie as the Island Princess', '(click for larger image)']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MHV63100385DVD', 'Director': 'Greg Richardson', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'January 17, 2010', 'Actors': 'Kelly Sheridan, Melissa Lyons, Alessandro Juliani, Christopher Gaze, Steve Marvel', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Jesyca C. Durchin, Jennifer Twiner McCarron, Shea Wageman', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nThis Barbie movie is colorful, calm, the music is enjoyable, the story is fun. My grand daughter of 3yrs, & 6 yrs enjoy this movie. They enjoy singing along with them. They enjoy the out takes, and the features that allow them to sing along with Barbie. An enjoyable movie that I don't mind sitting thru. I don't try to analyze simple movies. If they are age appropriate, enjoyable, the children enjoy them - then the movie has met it's goal. Life's too short to not just sit with the kids, a bucket of popcorn and sing along with Barbie. Enjoy.\nBarbie  on the Islands\nBarbie and the Diamond Castle\nKelly Sheridan  (Actor),     Melissa Lyons  (Actor),     Gino Nichele  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n['Product Description', 'Barbie™ and Teresa™ tell us the fairy tale story of Liana™ and Alexa™, best friends who shared everything including their love of music. One day their simple lives change when they are given an enchanted mirror and befriend the girl trapped inside! To save their new friend, Liana™ and Alexa™ embark on a dangerous journey to the hidden Diamond Castle that will put their friendship to the test. But through the power of song and with the companionship of two adorable puppies, the girls face their challenges together and learn that friendship is the true treasure.', 'Bonus Content:', 'Bloopers', 'Bloopers', 'Magical Music Video: \"Connected\"', 'Magical Music Video: \"Connected\"', 'Sneak Peek of Barbie in A Christmas Carol', 'Sneak Peek of Barbie in A Christmas Carol', ']]>', 'Amazon.com', 'A musical story about the power of friendship and believing in oneself,', 'Barbie and the Diamond Castle', \"opens with Barbie and her friend Teresa singing, playing guitar, and relating a story about friendship to Stacy who's just had a disagreement with her best friend Courtney. In the story, friends Alexa and Liana loose everything but each other in a terrible storm. A chance meeting with an old woman brings them a new friend Melody, who shares their love of music, but is locked inside an enchanted mirror. It turns out that Melody is an apprentice muse who holds the secret key to the diamond castle and embodies the last chance to defeat the selfish muse Lydia and preserve music for the entire world. Alexa and Liana help Melody journey to the diamond castle, overcoming enormous obstacles conjured by Lydia and her serpent Slider as well as rising above a disagreement between themselves. This CGI animated program is colorful and bright, if not particularly realistic, and the pop music is appealing, but oddly out of sink with the renaissance style costuming. While the Barbie versions of classic stories like\", 'Barbie of Swan Lake', 'or', 'Barbie Prince and the Pauper', 'generally offer better storylines, young Barbie fans will nonetheless enjoy this quest to save music while getting a sense of the importance of friendship and believing in oneself. (Ages 3 to 9)', '--Tami Horiuchi', 'Beyond', 'Barbie and the Diamond Castle', 'on DVD', 'More Barbie on DVD', 'Barbie and the Diamond Castle', 'in Spanish', 'The Barbie Store', 'Stills from', 'Barbie and the Diamond Castle', '(click for larger image)']\n{'Genre': 'Musicals & Performing Arts/Musicals, Kids & Family, DVD Movie, Animation, Blu-ray Movie', 'Format': 'Animated, Multiple Formats, Color, AC-3, NTSC, Dolby, Dubbed, Subtitled, Widescreen', 'Contributor': 'Scott McNeil, Noel Johansen, Veena Sood, Gino Nichele, Chantal Strand, Melissa Lyons, Jennifer Twiner McCarron, Maryke Hendrikse, Shelley Dvi Vardhana, Kathleen Barr, Mark Acheson, Lara Janine, Jeremy From, Kelly Sheridan, Cliff Ruby, Elana Lesser, Cassidy LaddenScott McNeil, Noel Johansen, Veena Sood, Gino Nichele, Chantal Strand, Melissa Lyons, Jennifer Twiner McCarron, Maryke Hendrikse, Shelley Dvi Vardhana, Kathleen Barr, Mark Acheson, Lara Janine, Jeremy From, Kelly Sheridan, Cliff Ruby, Elana Lesser, Cassidy Ladden  See more', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 19 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Director': 'Gino Nichele', 'Media Format': 'Animated, Multiple Formats, Color, AC-3, NTSC, Dolby, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 19 minutes', 'Release date': 'April 25, 2010', 'Actors': 'Kelly Sheridan, Melissa Lyons, Cassidy Ladden, Chantal Strand, Maryke Hendrikse', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Shelley Dvi Vardhana, Jennifer Twiner McCarron', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '2'}\nAgain, if the movie is age appropriate, & you like Barbie, then just enjoy the movie. My 3 yr & 6 yr old grand daughers enjoy this movie so much. I find if you watch the outtakes with them, then slider loses his ability to scare. My 3 year was hesitant with slider until she watched the outtakes. (yes, at age 3, outtakes seem to make sense.)It puts it all into perspective. The movies are colorful, calm and the music is not annoying. Take the time to get a bucket of popcorn & just enjoy the time with your kids.\nBarbie on another adventure\nBarbie and the Three Musketeers\nKelly Sheridan  (Actor),     Tim Curry  (Actor),     William Lau  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Product Description', 'It’s “All for One and One for All” as Barbie and her friends co-star in Barbie and The Three Musketeers! Join Barbie as Corinne, a young country girl headed to Paris to pursue her big dream – to become a female musketeer! Never could she imagine she would meet three other girls who secretly share the same dream! Using their special talents, the girls work together as a team to foil a plot and save the prince. Come along on an action-filled adventure that dares you to dream as never before.', 'Amazon.com', 'A girl can be anything she wants to be if she works hard, but in the days of the musketeers, certain professions were simply off-limits. Corinne (Barbie) is the daughter of a Musketeer and grew up wanting to become a musketeer and training hard to become an excellent swordsperson. When she sets off for Paris to join the musketeers, even her letter of introduction earns nothing but laughs from Captain Treville and the all-male musketeers. Forced to take a job as a castle housekeeper, Corinne soon discovers that her three fellow housekeepers have also dreamed and trained to become musketeers. Even more amazing is that the senior housekeeper had similar dreams as a child. This elder housekeeper provides further training for the three girls, encouraging them to strive to achieve what was an absolute impossibility for her generation. Just as the prince is about to become king, strange accidents begin to occur around the castle--accidents that the men musketeers seem unable to prevent. Could these unfortunate events provide an opportunity for Corinne and her friends to showcase their extraordinary swordsmanship? While the concept of Barbie as a sword-wielding musketeer may initially seem rather odd, the film is just as believable as other Barbie productions and it is refreshing to see Barbie in a somewhat less overtly-feminine role. Barbie\\'s final quotation sums it all up nicely: \"True courage is pursuing your dream, even when everyone else says it\\'s impossible.\" (Ages 3 to 7)', '--Tami Horiuchi']\n{'Genre': 'Kids & Family/7-9 Years, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Action & Adventure, Kids & Family/10-12 YearsKids & Family/7-9 Years, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Action & Adventure, Kids & Family/10-12 Years  See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Tim Curry, William Lau, Willow Johnson, Dorla Bell, Kelly Sheridan, Kira Tozer', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'William Lau', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'September 15, 2009', 'Actors': 'Kelly Sheridan, Tim Curry, Kira Tozer, Willow Johnson, Dorla Bell', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nCute movie; this review is based upon the likes of my 3yr & 6yr old grand daughers. If you like Barbie, you will enjoy the movie. Again, don't look for life's lessons in every Barbie movie. The music is calm, the characters likeable. Get some popcorn, put your feet up and let the kids enjoy. I don't mind watching this movie. It seems we watch it every week. The girls love it. And don't forget the outtakes. The girls think these are just great. Enjoy.\nBarbie as a Musketeer!!\nBarbie in A Christmas Carol\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Product Description', 'Barbie in A Christmas Carol is a heartwarming adaptation of the classic Dickens story filled with cherished Christmas carols, fabulous fashions and lots of laughs! The tale stars Barbie as Eden Starling the glamorous singing diva of a theatre in Victorian London. Along with her snooty cat, Chuzzlewit, Eden selfishly plans to make all the theatre performers stay and rehearse on Christmas Day! Not even Eden’s costume designer and childhood friend, Catherine can talk Eden out of her self-centered tantrum. It’s up to three very unusual Christmas Spirits to take Eden on a fantastical holiday journey that will open her heart to the spirit of the season and the joy of giving. Barbie in A Christmas Carol is a family favorite to enjoy every holiday season!Bonus Content:', 'Barbie Sing Along', 'Barbie Sing Along', 'Barbie & The Diamond Castle Secret Scene', 'Barbie & The Diamond Castle Secret Scene', 'Christmas Carol-oke Party', 'Christmas Carol-oke Party', 'Chuzzlewit\\'s \"Jingle Bells\" Music Video', 'Chuzzlewit\\'s \"Jingle Bells\" Music Video', 'Collecting Dreams: Making of the Barbie Holiday Doll', 'Collecting Dreams: Making of the Barbie Holiday Doll', 'Trailers', 'Trailers', \"Chuzzlewit's Favorite Charities\", \"Chuzzlewit's Favorite Charities\", 'Amazon.com', \"The classic Dickens' tale\", 'A Christmas Carol', 'gets a Barbie makeover in this animated holiday program about the evils of selfishness. As Barbie and Kelly are preparing for a Christmas Eve charity fundraiser, Kelly complains that the new event is interfering with the family\\'s Christmas Eve traditions. Barbie takes the opportunity to tell her sister an important Christmas story set in Victorian England. The story is in essence the classic story of Ebenezer Scrooge, but with Eden Starling (Barbie) standing in for Scrooge, Catherine for Bob Cratchit, and young orphan Tammy for Tiny Tim. Eden is a self-centered star whose new stage show is about to open and who lives her life by the decree that \"In a selfish world, the selfish succeed.\" Completely lacking in Christmas spirit, Eden insists that her best friend and costume designer Catherine, as well as her other co-stars, cancel their holiday plans to work on Christmas day. Eden\\'s peaceful Christmas Eve slumber is interrupted by visits from the spirits of Christmas past, Christmas present, and Christmas future and each brings visions of misery and despair. Finally realizing that her own actions have a direct impact on the future happiness of herself and others, Eden reconsiders her selfish ways and commits to a more caring and generous way of life. While some traditionalists may cringe at the liberties taken with Dickens\\' well-known story,', 'Barbie in A Christmas Carol', 'is a powerful program that encourages the virtues of caring and compassion in children ages three and older.', '--Tami Horiuchi', 'Beyond', 'Barbie in a Christmas Carol', 'on DVD', 'More Barbie on DVD', 'Barbie in a Christmas Carol', 'in Spanish', 'The Barbie Store', 'Stills from', 'Barbie in a Christmas Carol', '(click for larger image)']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Director': 'Various', 'Media Format': 'AC-3, Animated, Multiple Formats, Dolby, Color, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 16 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Various', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1), Spanish (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nThis is an enjoyable Barbie Christmas movie. If one has not seen a Christmas Carol in one version or another, this is just as good as the adult versions, without the ghosts!! The colors are great; the music calm. My granddaughers are 3 & 6; during Christmas, they watched this every other day. They probable still would be watching it, but I put it up. I enjoy the movie, they enjoy the movie...so the movie met it's goal. You won't be disappointed. I recommend.\nAnother christmas classic\nBarbie in The 12 Dancing Princesses\nKelly Sheridan  (Actor),     Catherine O'Hara  (Actor),     Greg Richardson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n['Product Description', 'In Barbie in the 12 Dancing Princesses, Barbie will dance her way into your heart in this fun and enchanting all-new adventure. Join Barbie as the beautiful Princess Genevieve and her eleven dancing princess sisters as they discover a secret entrance to an amazing, magical world where wishes come true! But when their dad is in danger of losing his kingdom, Princess Genevieve and her sisters must work together in order to save the day and their dad. They learn that the power of family can overcome all obstacles!', 'Bonus Content:', 'The Merry Memory Ballet', 'The Merry Memory Ballet', '\"Shine\" Music Video', '\"Shine\" Music Video', 'Trailer Gallery', 'Trailer Gallery', ']]>', 'Amazon.com', 'While every princess should learn and demonstrate proper etiquette, twelve young princesses learn the importance of doing good deeds and following their hearts in', 'Twelve Dancing Princesses', \". When an overwhelmed King Randolph seeks the aid of his cousin the Duchess Rowena in acquainting his twelve young daughters with appropriate princess etiquette, the overly strict Duchess forbids dancing, singing and anything that makes the girls happy. The girls' misery increases when their father suddenly becomes ill and the future looks bleak until the princesses discover that twelve special books bequeathed to them by their late mother open the gateway to a magical world where wishes are granted and dancing is celebrated. Eventually, maturity demands that the twelve princesses return to the real world and confront Duchess Rowena in order to save their father and his kingdom. This CGI animated production features music by Felix Mendelssohn, ballet choreography by the New York City Ballet, and wholesome messages about morality and the power of family. (Ages 3 to 9)\", '--Tami Horiuchi']\n{'Genre': 'Barbie movie, Rent movie, Kids & Family, Family movie, DVD movie, Mattel movie, Blu-ray movie, Movie night, Animated movie, Animation, Buy movie, Tween movie, Digital movieBarbie movie, Rent movie, Kids & Family, Family movie, DVD movie, Mattel movie, Blu-ray movie, Movie night, Animated movie, Animation, Buy movie, Tween movie, Digital movie  See more', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Animated, Subtitled, Widescreen', 'Contributor': \"Greg Richardson, Jennifer Twiner McCarron, Nicole Oliver, Jennifer Copping, Lalania Lindbjerg, Catherine O'Hara, Kelly Sheridan, Jesyca C. Durchin, Cliff Ruby, Shea Wageman, Elana LesserGreg Richardson, Jennifer Twiner McCarron, Nicole Oliver, Jennifer Copping, Lalania Lindbjerg, Catherine O'Hara, Kelly Sheridan, Jesyca C. Durchin, Cliff Ruby, Shea Wageman, Elana Lesser  See more\", 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0), French (Dolby Digital 2.0), Spanish (Dolby Digital 2.0)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.25 x 0.3 x 5.25 inches; 2.4 Ounces', 'Director': 'Greg Richardson', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Animated, Subtitled, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'April 25, 2010', 'Actors': \"Kelly Sheridan, Catherine O'Hara, Nicole Oliver, Jennifer Copping, Lalania Lindbjerg\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Jesyca C. Durchin, Jennifer Twiner McCarron, Shea Wageman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nMy 3yr & 6 yr old grand daughters love this movie - as most of the Barbie movies. I feel the movie has met it's expectations when little girls get up and dance & sing and enjoy the movie. the music is nice, calm, the dance steps easy to watch & follow. If you don't care for Barbie, no amount of reviews will make you change your mind. But if your little girls like singing, dancing, colorful images, this is another movie to add to your collection. Life is short; get your popcorn & lemonade and take time for the little ones.\nBarbie - Dancing again!!\nBarbie Fairytopia - Magic of the Rainbow\nKelly Sheridan  (Actor),     Lee Tockar  (Actor),     William Lau  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n['Product Description', 'Join Barbie as Elina in an all-new Fairytopia adventure! Elina travels with her puffball Bibble to Fairy School at the magnificent Crystal Palace. There, she meets the other fairy apprentices, chosen to learn the annual Flight of Spring and magically create the first rainbow of the season. But when the evil Laverna tries to stop the Flight, threatening to plunge Fairytopia into ten years of bitter winter, Elina and her new friends must learn that \"together we are strong.\" But are they strong enough to defeat Laverna and bring the rainbow to life? And will Bibble, who has a loose tooth, fall in love with the adorable puffball Dizzle?', 'Amazon.com', 'Believing in oneself can be difficult, even with the support of friends. The formerly wingless fairy Elina has saved Fairytopia more than once, proving herself against Fungus Maximus and turning the evil Laverna into a frog in', 'Barbie Fairytopia', 'and', 'Barbie Fairytopia--Mermaidia', \", but she still questions her own abilities when Guardian Azura selects her to become her apprentice and learn the all-important flight of spring--a ritual which ensures another year of vitality in Fairytopia. The taunts and snobby attitudes of her fellow apprentices serve to further undercut Elina's self-esteem, but she vows to do her best to master the flight of spring and soon proves worthy of her appointment. When the trickery of Laverna threatens to stop the flight of spring and destroy Fairytopia forever, it falls to the new apprentices to save Fairytopia. Of course, Elina will play a pivotal role in the group's eventual success or failure. Prepubescent attitudes and shallowness reign among most of the apprentices, but most eventually see the error of their ways and the clear message is the importance of believing in oneself. (Ages 3 to 9)\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family, DVD Movie, Barbie: Fairytopia, Animation, Mattel, Blu-ray Movie, Action & AdventureKids & Family, DVD Movie, Barbie: Fairytopia, Animation, Mattel, Blu-ray Movie, Action & Adventure  See more', 'Format': 'Multiple Formats, Animated, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Contributor': 'Elise Allen, Lee Tockar, Tabitha St. Germain, Kathleen Barr, William Lau, Luke Carroll, Christopher Gaze, Kelly SheridanElise Allen, Lee Tockar, Tabitha St. Germain, Kathleen Barr, William Lau, Luke Carroll, Christopher Gaze, Kelly Sheridan  See more', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 15 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.81 x 5.43 x 7.54 inches; 1.6 Ounces', 'Director': 'William Lau', 'Media Format': 'Multiple Formats, Animated, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 15 minutes', 'Release date': 'August 28, 2011', 'Actors': 'Kelly Sheridan, Lee Tockar, Kathleen Barr, Christopher Gaze, Tabitha St. Germain', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Luke Carroll', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Elise Allen', 'Number of discs': '1'}\nMy 3 yr & 6 yr old grand daughters love this move, as with most of the Barbie movies. I wasn't really looking for life's lessons in a Barbie movie, so I wasn't disappointed.  There is always some good, some bad & lots of magic. Spending time listening to my grand daughters school me on Barbie - that's all the life's lessons I need. It holds their interest. I think the movie has met it's expectations. I would recommend this movie & series to those that are new to the Barbie series. If you're not new to these movies, you know what to expect.\nFairytopia - more magic",
  "profile": "The user has a strong affinity for animated family films, particularly those from Disney and Pixar, emphasizing engaging narratives that appeal to young children aged 3 to 6. Their recent interactions highlight a growing interest in films featuring strong female leads, showcasing themes of friendship, adventure, selflessness, and teamwork, which enhance family connections during viewing with their granddaughters. The user values vibrant visuals, captivating storytelling, soothing music, and educational elements that promote imaginative play.\n\nIn their latest interaction, the user expressed particular enjoyment of a film that emphasizes positive themes resonating with young viewers, such as the importance of family and the consequences of one’s actions. They appreciate narratives that encourage dancing and singing, aligning with their granddaughters' interests. Notably, the user enjoys holiday-themed films that foster a warm familial atmosphere.\n\nAdditionally, the user's dedication to selecting high-quality animated films reflects their commitment to providing enriching and nurturing experiences for young viewers. They engage in fun and meaningful family movie nights, appreciating content that entertains while also imparting valuable life lessons and promoting joyful, shared moments. Their enduring pursuit of wholesome, musical content is consistent with their role as a caregiver focused on enhancing the enjoyment and development of their grandchildren.",
  "metrics": {
    "rouge1_f": 0.04874699622382424,
    "rouge2_f": 0.008928571428571428,
    "rougeL_f": 0.02849296258153107,
    "meteor": 0.013654368028843837,
    "bleu1": 7.738926352627356e-15,
    "bleu2": 3.431861187856626e-15,
    "bleu3": 8.630873483010773e-16,
    "bleu4": 2.4366343234204847e-16,
    "bertscore_precision": 0.3335927128791809,
    "bertscore_recall": 0.5432519912719727,
    "bertscore_f1": 0.4133569300174713
  }
}