{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Barbie as The Island Princess\nReview Date: 2010/03/26\nStore: Kelly Sheridan  (Actor),     Melissa Lyons  (Actor),     Greg Richardson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Animation\nProduct Description: ['Product Description', \"It's time to set sail with Barbie as The Island Princess in this full-length, original musical featuring nine fantastic songs. After being shipwrecked on an island as a little girl, Rosella (Barbie) grows up learning to talk and sing with a family of loving animals: the red panda Sagi, the peacock Azul and the baby elephant Tika. But when Prince Antonio discovers their tropical paradise, curiosity about her past leads Rosella to journey with the prince to his castle. As she and her animal friends explore civilization, they uncover an evil plot to take over the kingdom! Through its heart-warming ending, Barbie as the Island Princess shows that when love guides you, miracles may be closer than you know.\", 'Amazon.com', \"Sometimes it's difficult finding one's place in the world and, while a young shipwrecked girl named Ro couldn't ask for better friends than the animals that raised her on a South Seas island, she wonders about her parents and where she came from. When avid explorer Prince Antonio discovers the island, he offers Ro a chance to return to civilization and Ro convinces her friends Tika the elephant, Sagi the red panda, and Azul the peacock to accompany her. Once in the Prince's kingdom, Ro and her friends feel hopelessly out of place and fall prey to the tricks of a scheming traitor. Just when it seems that Ro may never find her parents, feel comfortable in the civilized world, nor realize her love for the Prince, Ro gets a hint of her mother's identity and finds an opportunity to prove her goodness to the royal family. This CGI animated musical stars Barbie and features nine very nice original songs. The animation is adequate, if not particularly realistic, and the story, though it's certainly been told before, holds the interest of children ages 3 to 7 years. - -\", 'Tami Horiuchi', 'Beyond', 'Barbie as the Island Princess', 'on DVD', 'More Barbie on DVD', 'Barbie as the Island Princess in Spanish', 'The Barbie Store', 'Stills from', 'Barbie as the Island Princess', '(click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MHV63100385DVD', 'Director': 'Greg Richardson', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'January 17, 2010', 'Actors': 'Kelly Sheridan, Melissa Lyons, Alessandro Juliani, Christopher Gaze, Steve Marvel', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Jesyca C. Durchin, Jennifer Twiner McCarron, Shea Wageman', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nReview Text: This Barbie movie is colorful, calm, the music is enjoyable, the story is fun. My grand daughter of 3yrs, & 6 yrs enjoy this movie. They enjoy singing along with them. They enjoy the out takes, and the features that allow them to sing along with Barbie. An enjoyable movie that I don't mind sitting thru. I don't try to analyze simple movies. If they are age appropriate, enjoyable, the children enjoy them - then the movie has met it's goal. Life's too short to not just sit with the kids, a bucket of popcorn and sing along with Barbie. Enjoy.\nReview Title: Barbie  on the Islands\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Toy Story & Toy Story 2 (2 Pack)\nRated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product description', 'Toy Story & Toy Story 2 (2 Pack', 'Amazon.com', 'Toy Story', 'There is greatness in film that can be discussed, dissected, and talked about late into the night. Then there is genius that is right in front of our faces--we smile at the spell it puts us into and are refreshed, and nary a word needs to be spoken. This kind of entertainment is what they used to call \"movie magic,\" and there is loads of it in this irresistible computer animation feature. Just a picture of these bright toys on the cover of', 'Toy Story', \"looks intriguing, reawakening the kid in us. Filmmaker John Lasseter's shorts (namely\", 'Knickknack', 'and', 'Tin Toy', ', which can be found on the Pixar video', 'Tiny Toy Stories', ') illustrate not only a technical brilliance but also a great sense of humor--one in which the pun is always intended. Lasseter thinks of himself as a storyteller first and an animator second, much like another film innovator, Walt Disney.', \"Lasseter's story is universal and magical: what do toys do when they're not played with? Cowboy Woody (voiced by Tom Hanks), Andy's favorite bedroom toy, tries to calm the other toys (some original, some classic) during a wrenching time of year--the birthday party, when newer toys may replace them. Sure enough, Space Ranger Buzz Lightyear (Tim Allen) is the new toy that takes over the throne. Buzz has a crucial flaw, though--he believes he's the real Buzz Lightyear, not a toy. Bright and cheerful,\", 'Toy Story', 'is much more than a 90-minute commercial for the inevitable bonanza of Woody and Buzz toys. Lasseter further scores with perfect voice casting, including Don Rickles as Mr.\\xa0Potato Head and Wallace Shawn as a meek dinosaur. The director-animator won a special Oscar for \"the development and inspired application of techniques that have made possible the first feature-length computer-animated film.\" In other words, the movie is great.', '--Doug Thomas', 'Toy Story 2', 'John Lasseter and his gang of high-tech creators at Pixar create another entertainment for the ages. Like the few great movie sequels,', 'Toy Story\\xa02', \"comments on why the first one was so wonderful while finding a fresh angle worthy of a new film. The craze of toy collecting becomes the focus here, as we find out Woody (voiced by Tom Hanks) is not only a beloved toy to Andy but also a rare doll from a popular '60s children's show. When a greedy collector takes Woody, Buzz Lightyear (Tim Allen) launches a rescue mission with Andy's other toys. To say more would be a crime because this is one of the most creative and smile-inducing films since, well, the first\", 'Toy Story', '.', \"Although the toys look the same as in the 1994 feature, Pixar shows how much technology has advanced: the human characters look more human, backgrounds are superior, and two action sequences that book-end the film are dazzling. And it's a hoot for kids and adults. The film is packed with spoofs, easily accessible in-jokes, and inspired voice casting (with newcomer Joan Cusack especially a delight as Cowgirl Jessie). But as the Pixar canon of films illustrates, the filmmakers are storytellers first. Woody's heart-tugging predicament can easily be translated into the eternal debate of living a good life versus living forever.\", 'Toy Story\\xa02', 'also achieved something in the U.S. two other outstanding 1999 animated features (', 'The Iron Giant', ',', 'Princess Mononoke', ') could not: it became a huge box-office hit.', '--Doug Thomas']\n{'Format': 'Color, Widescreen, NTSC', 'Contributor': 'Toy Story 2pak', 'Language': 'English (Dolby Digital 5.1 EX), English (THX Surround EX)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 1 inches; 6.4 Ounces', 'Media Format': 'Color, Widescreen, NTSC', 'Release date': 'October 17, 2000', 'Actors': 'Toy Story 2pak', 'Studio': 'Disney/Pixar', 'Number of discs': '2'}\nThis is hands down the best Disney Movie. This movie appeals to my Mother, my son, myself, and my grandchildren. What more can you ask from what will be a timeless classic. If you can get these movies - get them.\nToy Stories\nBarbie and the Magic of Pegasus\nKelly Sheridan  (Actor),     Kathleen Barr  (Actor),     Greg Richardson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Barbie™ takes flight in her first original princess fairy tale movie, Barbie™ and the Magic of Pegasus. Princess Annika (Barbie™) discovers adventure when she is befriended by Brietta – a magnificent winged horse – that flies her to the beautiful Cloud Kingdom. Annika has only three days to break the spell of Wenlock, an evil wizard who has turned her family to stone. On her quest to defeat Wenlock, Annika meets new friends and together they travel to forbidden forests, skate through icy caverns and fly above the clouds as they attempt to build a magical wand of light. The score includes soaring themes from Beethoven’s Sixth Symphony. Fly with Barbie™ on her most amazing adventure ever!']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Kids & Family/10-12 YearsScience Fiction & Fantasy, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Kids & Family/10-12 Years   See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Brian Drummond, Greg Richardson, Russell Arons, Mark Hildreth, John DeSantis, Chantal Strand, Luke Carroll, Stevie Vallance, Russell Roberts, Colin Murdock, Kathleen Barr, Jessica Amlee, Lalania Lindbjerg, Kelly Sheridan, Jesyca C. Durchin, Cliff Ruby, Andrea Libman, Elana LesserBrian Drummond, Greg Richardson, Russell Arons, Mark Hildreth, John DeSantis, Chantal Strand, Luke Carroll, Stevie Vallance, Russell Roberts, Colin Murdock, Kathleen Barr, Jessica Amlee, Lalania Lindbjerg, Kelly Sheridan, Jesyca C. Durchin, Cliff Ruby, Andrea Libman, Elana…   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'Greg Richardson', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'January 5, 2010', 'Actors': 'Kelly Sheridan, Kathleen Barr, Lalania Lindbjerg, Colin Murdock, Mark Hildreth', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Luke Carroll, Jesyca C. Durchin', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nI don't find the movie inappropriate for my 3 & 6 yr old grand daughters. They enjoy the color and the simple story. Any questions about behavior have simple explanations. I have purchased most of the Barbie Movies. The music is soothing, nice, calm - the girls pretend with their ballet. I would recommend to anyone who has little girls who are interested in dolls!!\nBarbie's Tales\nBarbie of Swan Lake\nKelly Sheridan  (Actor),     Mark Hildreth  (Actor),     Owen Hurley  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Barbie stars in this tale about a young princess who is transformed into a swan.', 'Genre:', \"Children's Video\", 'Rating:', 'G', 'Release Date:', '22-AUG-2006', 'Media Type:', 'DVD']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC, Anamorphic', 'Contributor': 'Brian Drummond, Mark Hildreth, Kelsey Grammer, Venus Terzo, Michael Dobson, Owen Hurley, Chantal Strand, Maggie Wheeler, Nicole Oliver, Kathleen Barr, Gina Stockdale, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana LesserBrian Drummond, Mark Hildreth, Kelsey Grammer, Venus Terzo, Michael Dobson, Owen Hurley, Chantal Strand, Maggie Wheeler, Nicole Oliver, Kathleen Barr, Gina Stockdale, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana Lesser   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.48 Ounces', 'Director': 'Owen Hurley', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC, Anamorphic', 'Run time': '1 hour and 21 minutes', 'Release date': 'September 30, 2003', 'Actors': 'Kelly Sheridan, Mark Hildreth, Kelsey Grammer, Maggie Wheeler, Venus Terzo', 'Studio': 'Lions Gate', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nThis is a movie that I don't mind watching every week. The music is calm; the movie is one of my grand daughters favorites. When questions come up, simple explanations of consequences & actions is all that is needed. I enjoy these movies. My grand daughters are 3 & 6 & they love this movie.\nBarbie & the magic of Swan lake\nBarbie as Rapunzel [DVD]\nKelly Sheridan  (Actor),     Anjelica Huston  (Actor),     Owen Hurley  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n{'Genre': 'Kids & Family', 'Format': 'Anamorphic, Animated, Color, DVD, NTSC, Closed-captioned, Full Screen', 'Contributor': 'Anjelica Huston, Mark Hildreth, Owen Hurley, Chantal Strand, Christopher Gaze, Danny McKinnon, Cree Summer, Russell Roberts, David Kaye, Peter Kelamis, Terry Klassen, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana LesserAnjelica Huston, Mark Hildreth, Owen Hurley, Chantal Strand, Christopher Gaze, Danny McKinnon, Cree Summer, Russell Roberts, David Kaye, Peter Kelamis, Terry Klassen, Kelly Sheridan, Cliff Ruby, Ian James Corlett, Elana Lesser  See more', 'Language': 'English', 'Number Of Discs': '1'}\nMy 3 & 6 yr old grand daughters really enjoy these Barbie movies. Interesting, calm, colorful. Enjoyable enough that I don't mind watching it weekly with them. You won't be disappointed.\nBarbie Fantasies\nBarbie as The Island Princess\nKelly Sheridan  (Actor),     Melissa Lyons  (Actor),     Greg Richardson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n['Product Description', \"It's time to set sail with Barbie as The Island Princess in this full-length, original musical featuring nine fantastic songs. After being shipwrecked on an island as a little girl, Rosella (Barbie) grows up learning to talk and sing with a family of loving animals: the red panda Sagi, the peacock Azul and the baby elephant Tika. But when Prince Antonio discovers their tropical paradise, curiosity about her past leads Rosella to journey with the prince to his castle. As she and her animal friends explore civilization, they uncover an evil plot to take over the kingdom! Through its heart-warming ending, Barbie as the Island Princess shows that when love guides you, miracles may be closer than you know.\", 'Amazon.com', \"Sometimes it's difficult finding one's place in the world and, while a young shipwrecked girl named Ro couldn't ask for better friends than the animals that raised her on a South Seas island, she wonders about her parents and where she came from. When avid explorer Prince Antonio discovers the island, he offers Ro a chance to return to civilization and Ro convinces her friends Tika the elephant, Sagi the red panda, and Azul the peacock to accompany her. Once in the Prince's kingdom, Ro and her friends feel hopelessly out of place and fall prey to the tricks of a scheming traitor. Just when it seems that Ro may never find her parents, feel comfortable in the civilized world, nor realize her love for the Prince, Ro gets a hint of her mother's identity and finds an opportunity to prove her goodness to the royal family. This CGI animated musical stars Barbie and features nine very nice original songs. The animation is adequate, if not particularly realistic, and the story, though it's certainly been told before, holds the interest of children ages 3 to 7 years. - -\", 'Tami Horiuchi', 'Beyond', 'Barbie as the Island Princess', 'on DVD', 'More Barbie on DVD', 'Barbie as the Island Princess in Spanish', 'The Barbie Store', 'Stills from', 'Barbie as the Island Princess', '(click for larger image)']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MHV63100385DVD', 'Director': 'Greg Richardson', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'January 17, 2010', 'Actors': 'Kelly Sheridan, Melissa Lyons, Alessandro Juliani, Christopher Gaze, Steve Marvel', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Jesyca C. Durchin, Jennifer Twiner McCarron, Shea Wageman', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cliff Ruby, Elana Lesser', 'Number of discs': '1'}\nThis Barbie movie is colorful, calm, the music is enjoyable, the story is fun. My grand daughter of 3yrs, & 6 yrs enjoy this movie. They enjoy singing along with them. They enjoy the out takes, and the features that allow them to sing along with Barbie. An enjoyable movie that I don't mind sitting thru. I don't try to analyze simple movies. If they are age appropriate, enjoyable, the children enjoy them - then the movie has met it's goal. Life's too short to not just sit with the kids, a bucket of popcorn and sing along with Barbie. Enjoy.\nBarbie  on the Islands",
  "profile": "The user continues to exhibit a strong appreciation for animated family films, particularly those from Disney and Pixar, known for their timeless storytelling and generational appeal. Their recent interaction reflects an expanded interest in films designed for young viewers aged 3 to 6, highlighting themes of friendship, adventure, and accessible narratives. They prioritize engaging content that is colorful and promotes positive behavior, often seeking movies that provide meaningful lessons while fostering imaginative play.\n\nThe user values captivating storytelling combined with soothing music, particularly in films that allow for straightforward explanations of consequences for young audiences. Their grandchildren, aged 3 and 6, play a pivotal role in shaping their preferences, as the user seeks enriching cinematic experiences that can entertain both their grandchildren and themselves. \n\nThis recent interaction reinforces their criterion for selecting animated content: enjoyment for their grandchildren, educational value, and alignment with their discerning taste as a caregiver. They embrace the joy of experiencing lighthearted films together, ensuring that narrative simplicity does not detract from the enjoyment and connection shared during these viewings. Overall, the user remains committed to high-quality animated content that embodies family-centric themes and nurturing experiences.",
  "metrics": {
    "rouge1_f": 0.08453016003282725,
    "rouge2_f": 0.013141683778234086,
    "rougeL_f": 0.044316782929831766,
    "meteor": 0.02502543994382471,
    "bleu1": 6.52162923001986e-07,
    "bleu2": 2.644343600101686e-07,
    "bleu3": 7.479951461164836e-08,
    "bleu4": 2.2397782178328824e-08,
    "bertscore_precision": 0.3212350308895111,
    "bertscore_recall": 0.4951006770133972,
    "bertscore_f1": 0.38965266942977905
  }
}