{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Senegalese Twist Crochet Hair Extensions Ombre-Brown - 32inch 8Packs Synthetic Crochet Braids Pre Looped Crochet Hair Synthetic Braiding Hair (32 inch, T30)\nReview Date: 2020/08/08\nStore: ToyoTree\nAverage Rating: 3.3\nProduct Details: {'Package Dimensions': '16.5 x 7.2 x 2.1 inches; 1.6 Pounds', 'UPC': '781827816141'}\nReview Text: [[VIDEOID:a3e393606a2e6dcef86b83ecc97fa694]] These are a very nice quality synthetic hair but they are small so I’d you’re going for a more fuller look I suggest getting more but if you’re going to space your crochets quite a bit or do individuals with these you should be okay. Very long too, but it’s great they give you a free gift of the crochet needle and jewels so no need for a store trip!\nReview Title: Nice Quality Twist But May Need More Packs!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nCOSYMAY\n{'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\n[[VIDEOID:9118ad20b0e9a447f9b3a276479f331c]] Wow! This hair is gorgeous! Very nice thickness for a 20 inch and silky to the touch with so much body. The closure is perfect on this wig as well! Just to give you guys an idea of the body of this hair I uploaded videos but excuse me for still having my edges wrapped up lol\nSilky and Quality Hair!\nSenegalese Twist Crochet Hair Extensions Ombre-Brown - 32inch 8Packs Synthetic Crochet Braids Pre Looped Crochet Hair Synthetic Braiding Hair (32 inch, T30)\nToyoTree\n{'Package Dimensions': '16.5 x 7.2 x 2.1 inches; 1.6 Pounds', 'UPC': '781827816141'}\n[[VIDEOID:a3e393606a2e6dcef86b83ecc97fa694]] These are a very nice quality synthetic hair but they are small so I’d you’re going for a more fuller look I suggest getting more but if you’re going to space your crochets quite a bit or do individuals with these you should be okay. Very long too, but it’s great they give you a free gift of the crochet needle and jewels so no need for a store trip!\nNice Quality Twist But May Need More Packs!",
  "profile": "**User Profile Summary:**\n\n- **Product Type Preference:** Strong interest in wigs, particularly those that are long, straight, and feature bangs, with a recent expansion into crochet hair extensions.\n- **Quality Expectations:** High regard for hair quality, focusing on silkiness, thickness, and body; appreciates good quality synthetic options as well.\n- **Brand Familiarity:** Positive experience with specific brands, indicating brand loyalty; recent purchase from ToyoTree showcases openness to exploring new brands.\n- **Visual Engagement:** Enjoys sharing multimedia content (videos) to express satisfaction and provide visual feedback on products, showcasing a commitment to sharing the user experience.\n- **Attention to Detail:** Appreciates product specifics such as closure type and overall appearance; recent review highlights practical aspects of product quantity for aesthetic fulfillment.\n- **User Engagement Style:** Enthusiastic and expressive in reviews, providing a personal touch to feedback, and effectively communicating product use tips.\n- **Rating Trends:** Indicates a tendency to rate products positively when they meet or exceed expectations, as reflected by a favorable rating for a recently purchased hair product.\n\nOverall, the user demonstrates a clear preference for high-quality, aesthetically pleasing hair options while actively engaging with their purchasing experience through detailed reviews and visual sharing, signaling an evolving engagement with diverse hair products.",
  "metrics": {
    "rouge1_f": 0.24367816091954023,
    "rouge2_f": 0.023094688221709007,
    "rougeL_f": 0.10574712643678161,
    "meteor": 0.13927576601671313,
    "bleu1": 0.22789170451590549,
    "bleu2": 0.04867656682116383,
    "bleu3": 0.009375918504296855,
    "bleu4": 0.00411874720619406,
    "bertscore_precision": 0.3809162974357605,
    "bertscore_recall": 0.4236530363559723,
    "bertscore_f1": 0.40114960074424744
  }
}