{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 8 Oz Deep Cleansing, Vitamin Rich, Face Cleanser Gel\nReview Date: 2016/01/15\nAverage Rating: 3.2\nProduct Details: {'Package Dimensions': '6 x 3 x 3 inches; 2.82 Ounces'}\nReview Text: Pros:<br />+ 8 ounce container<br />+ Pump top dispenser<br />+ Amazing scent<br />+ Premium natural ingredients<br />+ Vitamins A,C,E, F, rosehip<br />+ Deep cleans and quickly rinses<br />+ Reasonable price for an extra large bottle<br />+ Made in USA by a trusted brand<br />+ Satisfaction guarantee<br />Cons:<br /> - None<br />So happy with this cleanser by Isabel Fay.  It comes in a high quality pump top bottle that can be reused, smells beautiful and most importantly doesn't aggravate my adult acne.  Plus it thoroughly cleans my face and doesn't take an eternity to rinse off in the shower. Two pumps is sufficient for full face and neck coverage so I'm expecting this giant bottle to last several months. I also have the Isabel Fay toner and hyaluronic acid cream and they're just as wonderful as the rosehip cleanser.  Wish they had a retinol serum and a night cream. Highly recommended<br />&#60; Discount provided for evaluation and review\nReview Title: Love Isabel Fay\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Gio Naturals Organic Moroccan Argan Oil, 4 oz - 100% Pure and USDA Certified for Face, Hair, Skin and Nails\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6 x 2.2 x 2.1 inches; 8.16 Ounces', 'UPC': '820103119702'}\nThis is 100% pure organic argan oil.  Nothing added. Excellent quality and effective on our hair and nails.  Most of the other brands that claim to be 100% pure argan oil actually add fragrance and preservatives.  If you're using this on your face or hair,  those extras can cause irritation and clogged pores. My wife and I especially like this pump top dispenser. You can precisely control how much you use.  The greatest part,though, has to be the rock bottom price.  We've seen this stuff top $20 per ounce. Here you get 4 ounces of cold pressed organic argan oil for 16 bucks. Recommend<br />&#60;discount provided for evaluation and review\nNaturally powerful\nEyelash Growth Serum for Long Eyelashes From Uptown Cosmeceuticals Contains Stem Cell & Myristoyl Pentapeptide-17, Dermatologist Lab Tested Lash & Eyebrow Growth Formula, 4 Months Supply, 3.5ml\nUptown Cosmeceuticals\n{'Color': 'Multicolor', 'Brand': 'Uptown Cosmeceuticals', 'Skin Type': 'All', 'Package Type': 'Box', 'Unit Count': '1.00 Count', 'Package Dimensions': '5 x 3 x 0.7 inches; 0.35 Ounces', 'UPC': '685987989168', 'Manufacturer': 'RightChoiceMarket'}\nThis serum works.  My eyelashes are slightly darker and healthier after only a few applications.  I use it at night and, while they aren't longer or thicker, they do look younger.  Hopefully the results will last.  No irritation or redness so far.  Recommend<br />&#60;discount provided for evaluation and review\nSome improvement\nRegenFX Skincare Anti Aging Moisturizer Cream with Vitamin C, Vitamin E, Green Tea Extracts and Hyaluronic Acid. Potent Anti-Aging, Anti-Wrinkle Treatment, Skin Tightening, and Collagen Stimulation. Net Wt 1.0 oz/ 30 ml\nRegenFX Skincare\n[\"Reset the clock and recover your skin's youth with this nourishing, sculpting, and firming cream that is infused with an energetic blend of essential oils. Formulated with RegenFX complex, this anti aging cream helps restore skins natural younger form, addressing and reversing sagging skin and loss of volume, elasticity, density and wrinkles. This all-in-one highly active energetic anti aging moisturizer focuses on cellular regeneration, lifting and wrinkles with the latest targeted peptide complexes. A joyous and energetic blend of proprietary ingredients that creates a therapeutic aromatherapy effect.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 7 inches; 1.12 Ounces', 'Item model number': 'FXMOIS-1', 'UPC': '641061984320', 'Manufacturer': 'Eureka Brands LLC'}\nThis moisturizer arrived with a defective pump top dispenser. I tried running it under hot water and still couldn't get it to work. I understand that problems happen from time to time and contacted the seller to kindly inform them of my problem with this item.  No response. I contacted the seller twice more over the next four days to arrange for an exchange and still have never heard one single reply.<br />&#60; Discount provided for evaluation and review\nDefective product\nGenesea Perfecting Serum for Face for a Tightening, Optimally Hydrating Sensation - Innovative Anti Aging Beauty Facial Serum - Promotes Youthful, Glowing Looking, Lifted Skin Appearance - 1.1 Ounce\n{'Package Dimensions': '6.5 x 1.6 x 1.6 inches; 1.6 Ounces'}\nPros:<br />+ Natural ingredients sourced and imported from the Dead Sea<br />+ One of the few serums that contains Dunaliella salina<br />+ Botanical squalane, jojoba, wheat derived amino acids<br />+ Highly effective formula softens and smooths dry patches immediately<br />+ No chemicals, toxins, or pore clogging fillers<br />+ No palm oil<br />+ Efficient 1.1 ounce pump top container<br />+ Trusted brand / Family friendly ingredients<br />Cons:<br /> - None<br />This is the best age fighting serum on the market.  You only need a dime sized application  for full coverage so the 1.1 ounce container should last.  It's nearly impossible to find moisturizers or serums like Genesea's that include Dunaliella salina... a micro algae that survives in salt by producing massive amounts of carotenoids.  Dunaliella salina is a natural anti ageing powerhouse and a weapon against oxidation and free radical formation.  Highly recommended<br />&#60; Discount provided for evaluation and review\nPremium, powerful, natural ingredients that you won't find in other serums\n8 Oz Deep Cleansing, Vitamin Rich, Face Cleanser Gel\n{'Package Dimensions': '6 x 3 x 3 inches; 2.82 Ounces'}\nPros:<br />+ 8 ounce container<br />+ Pump top dispenser<br />+ Amazing scent<br />+ Premium natural ingredients<br />+ Vitamins A,C,E, F, rosehip<br />+ Deep cleans and quickly rinses<br />+ Reasonable price for an extra large bottle<br />+ Made in USA by a trusted brand<br />+ Satisfaction guarantee<br />Cons:<br /> - None<br />So happy with this cleanser by Isabel Fay.  It comes in a high quality pump top bottle that can be reused, smells beautiful and most importantly doesn't aggravate my adult acne.  Plus it thoroughly cleans my face and doesn't take an eternity to rinse off in the shower. Two pumps is sufficient for full face and neck coverage so I'm expecting this giant bottle to last several months. I also have the Isabel Fay toner and hyaluronic acid cream and they're just as wonderful as the rosehip cleanser.  Wish they had a retinol serum and a night cream. Highly recommended<br />&#60; Discount provided for evaluation and review\nLove Isabel Fay",
  "profile": "**Updated User Summary:**\n\n- **Product Preference**: The user remains steadfast in their preference for organic and natural personal care products, showing particular enthusiasm for cleansers and skincare treatments that utilize premium natural ingredients.\n\n- **Quality Conscious**: The user's commitment to authenticity and purity is reinforced by their recent purchase, which highlights their appreciation for effective formulations that support their skin health without aggravating issues like adult acne.\n\n- **Pricing Sensitivity**: While the user values reasonable pricing, their recent positive experience with a larger cleanser indicates a willingness to invest in high-quality products that offer significant volume and performance, reflecting an ongoing balance between cost and superior results.\n\n- **Convenience Features**: The preference for user-friendly designs is particularly emphasized through the satisfaction with pump dispensers, which enhance product usability. The user's latest choice continues to prioritize practical and effective packaging.\n\n- **Positive Feedback**: The user expresses growing confidence in providing feedback, as shown by their enthusiastic review of the cleanser. This suggests an increased scrutiny of product performance and a desire for effective communication with sellers.\n\nOverall, the user actively seeks effective, high-quality organic products that deliver both value and authenticity. Their heightened awareness of quality and convenience continues to shape their purchasing decisions, complemented by a growing inclination to share their experiences.",
  "metrics": {
    "rouge1_f": 0.17399103139013455,
    "rouge2_f": 0.019766397124887692,
    "rougeL_f": 0.07713004484304932,
    "meteor": 0.06692030661320865,
    "bleu1": 0.011596629530412328,
    "bleu2": 0.00400490401067771,
    "bleu3": 0.0012288744796461447,
    "bleu4": 0.00038316305571914035,
    "bertscore_precision": 0.3711942136287689,
    "bertscore_recall": 0.4774220585823059,
    "bertscore_f1": 0.4176594614982605
  }
}