{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/06/23\nAverage Rating: 4.1\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Barbara Kopple'], 'Producers': ['Carla Woods', 'Barbara Kopple', 'Glenn Rigberg', 'Hilary Birmingham'], 'Starring': ['Garo Armen', 'Steven Walker'], 'Studio': ['Gravitas']}\nReview Text: This was a great documentary. It really focused on how the FDA could play a vital role in saving lives, but instead is chooses to let people suffer. It's hard to believe that our country is so heartless and where the line blurs from helpful to harmful. This is a great documentary for everyone to watch, it really will open your eyes to how the government would rather let drugs that will save or help people sit forever instead of taking a stand to work with these families.\nReview Title: A MUST WATCH! Don't be fooled\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mullti Media Arts Limited'], 'Starring': ['Sir Ian Holm'], 'Studio': ['Janson Media']}\nThis documentary had a lot of great information and really covered some interesting ideas and where the ideas for the series originated from.\nInformative\n{'Subtitles': ['None available'], 'Directors': [\"Geoff D'Eon\"], 'Producers': ['Edward Peill'], 'Studio': ['Syndicado']}\nA really good eye opener on how counterfeit merchandise can kill and how serious this crime really is.\nA really good eye opener\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Marjane Satrapi'], 'Producers': ['Adi Shankar', 'Matthew Rhodes', 'Roy Lee', 'Spencer Silna'], 'Starring': ['Ryan Reynolds', 'Gemma Arterton', 'Anna Kendrick'], 'Studio': ['LIONSGATE']}\nRyan Reynolds rocks in this movie! A must watch for those who like a good brutal comedy!\nSo funny!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English (US)', 'English (UK) [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Peyton Reed'], 'Producers': ['Richard D. Zanuck', 'David Heyman'], 'Starring': ['Jim Carrey', 'Zooey Deschanel', 'Bradley Cooper'], 'Studio': ['Warner Bros.']}\nCome on and live a little, this movie will inspire you to say YES!\nYes sir this movie is great!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jared Hess'], 'Producers': ['Jeremy Coon', 'Chris Wyatt', 'Sean Covel', 'Jory Weitz'], 'Starring': ['Jon Heder', 'Jon Gries', 'Aaron Ruell'], 'Studio': ['Crowd Pleasers']}\nBest Movie Ever!\nBest Movie Ever!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['David Michôd'], 'Producers': ['Liz Watts', 'David Linde', 'David Michôd'], 'Starring': ['Robert Pattinson', 'Guy Pearce', 'Scoot McNairy']}\nDisgusting! I couldn't even make it past the first 20mins. It was fine until this lady offered (Guy Pierce) to have sex with a young teenage boy. The way she said it was enough to make you want to puke. I will not be finishing this film.\nDisgusting!\nDreams From My Real Father: A Story of Reds and Deception\nDocumentary\n[\"Dreams from My Real Father chronicles Barack Obama's life journey in socialism starting with evidence that Obama's real father was Frank Marshall Davis, a Communist Party USA propagandist who indoctrinated Obama into a Marxist ideology during his formative years. Was the goat herding Kenyan father only a fairy tale to obscure a Marxist agenda, irreconcilable with American values?\"]\n{'Subtitles': ['None available'], 'Directors': ['Joel Gilbert'], 'Producers': ['Joel Gilbert'], 'Starring': ['Barack Obama']}\nExcellent documentary and features documents and other evidence to support their findings. Scary to think this very well could be what is going on in our White House.\nA must watch!!!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Thomas Lucas'], 'Producers': ['Thomas Lucas', 'Johnny Friday', 'Alfredo Barroso', 'Jonathan Green'], 'Studio': ['MagellanTV']}\nAmazing footage of marine life and excellent information on sharks\nBeautifully done\n{'Subtitles': ['None available'], 'Directors': ['Sebastian Howard'], 'Producers': ['Batch Howard', 'Claude Barnes', 'Edith Dandenault', 'Anna Chen'], 'Studio': ['Syndicado']}\nWow what a challenging question. I had heard some of the arguments against milk before, but this was a great documentary. It still leaves the question, should we drink milk?\nGreat information!\n{'Subtitles': ['None available'], 'Directors': ['Barbara Kopple'], 'Producers': ['Carla Woods', 'Barbara Kopple', 'Glenn Rigberg', 'Hilary Birmingham'], 'Starring': ['Garo Armen', 'Steven Walker'], 'Studio': ['Gravitas']}\nThis was a great documentary. It really focused on how the FDA could play a vital role in saving lives, but instead is chooses to let people suffer. It's hard to believe that our country is so heartless and where the line blurs from helpful to harmful. This is a great documentary for everyone to watch, it really will open your eyes to how the government would rather let drugs that will save or help people sit forever instead of taking a stand to work with these families.\nA MUST WATCH! Don't be fooled",
  "profile": "**User Summary Update:**\n\nThe user continues to exhibit a strong interest in documentaries that tackle complex societal issues, particularly those related to crime and politics, favoring narratives that are both thought-provoking and evidence-based. Their recent interaction, where they expressed a passionate endorsement for a documentary highlighting systemic failures in healthcare, reflects their ongoing commitment to critical themes that prompt deeper reflection on governmental roles and responsibilities.\n\nIn addition to their established interests, the user has expanded their documentary preferences to encompass marine life, seeking visually captivating content that provides educational insights but remains sensitive to explicit themes and graphic content. Their aversion to violence and sexual themes is evident in their continued preference for material that balances depth with appropriateness.\n\nAlthough they have occasionally shown an openness to lighter content, their recent reviews reinforce a strong inclination towards serious storytelling that offers educational value and meaningful insights. The user consistently opts for English audio and subtitles to enhance clarity in their viewing experiences.\n\nOverall, their viewing habits indicate a thoughtful approach to understanding significant societal and environmental issues, while remaining mindful of their boundaries regarding explicit material. This suggests an evolving documentary engagement that embraces diverse themes while staying true to their core values and sensitivities.",
  "metrics": {
    "rouge1_f": 0.16864608076009502,
    "rouge2_f": 0.0047619047619047615,
    "rougeL_f": 0.07363420427553444,
    "meteor": 0.04852927396141151,
    "bleu1": 0.0066352012017954175,
    "bleu2": 0.001329960024395691,
    "bleu3": 0.00025086041624532016,
    "bleu4": 0.00010907127614497936,
    "bertscore_precision": 0.3171229362487793,
    "bertscore_recall": 0.44525861740112305,
    "bertscore_f1": 0.37042272090911865
  }
}