{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/06/22\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Marjane Satrapi'], 'Producers': ['Adi Shankar', 'Matthew Rhodes', 'Roy Lee', 'Spencer Silna'], 'Starring': ['Ryan Reynolds', 'Gemma Arterton', 'Anna Kendrick'], 'Studio': ['LIONSGATE']}\nReview Text: Ryan Reynolds rocks in this movie! A must watch for those who like a good brutal comedy!\nReview Title: So funny!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mullti Media Arts Limited'], 'Starring': ['Sir Ian Holm'], 'Studio': ['Janson Media']}\nThis documentary had a lot of great information and really covered some interesting ideas and where the ideas for the series originated from.\nInformative\n{'Subtitles': ['None available'], 'Directors': [\"Geoff D'Eon\"], 'Producers': ['Edward Peill'], 'Studio': ['Syndicado']}\nA really good eye opener on how counterfeit merchandise can kill and how serious this crime really is.\nA really good eye opener\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Marjane Satrapi'], 'Producers': ['Adi Shankar', 'Matthew Rhodes', 'Roy Lee', 'Spencer Silna'], 'Starring': ['Ryan Reynolds', 'Gemma Arterton', 'Anna Kendrick'], 'Studio': ['LIONSGATE']}\nRyan Reynolds rocks in this movie! A must watch for those who like a good brutal comedy!\nSo funny!",
  "profile": "**User Summary:**\n\n- **Content Interests:** Engages with documentaries that explore intriguing ideas and the origins of concepts, particularly those that illuminate serious societal issues. Values informative content and appreciates in-depth discussions, especially about topics such as crime and its implications. Recently showed interest in a brutal comedy, suggesting a potential openness to humor with less serious themes, though still within their established interests.\n\n- **Content Sensitivity:** Maintains a clear awareness of content warnings, with specific preferences against violence, alcohol use, foul language, and sexual content. The recent interaction indicates a tolerance for brutal comedy but highlights a potentially conflicting sensitivity towards explicit themes.\n\n- **Language Preferences:** Prefers English audio and subtitles, emphasizing clarity and comprehension in media consumption.\n\n- **Overall Engagement:** Tends to provide moderate ratings, favoring a balanced perspective on quality and content. The user recently appreciated a documentary showcasing the severity of counterfeit merchandise crime, indicating preference for thought-provoking and educational material. However, the shift towards rating a comedy suggests flexibility in their viewership.\n\n- **Decision-Making Factors:** Focuses on the depth of information and overall concept rather than just production quality. Strong content is seen as necessary for enhancing viewing experiences, as reflected in their higher average rating despite production imperfections.\n\nThe user continues to demonstrate a preference for educational and thought-provoking documentaries while showing some willingness to explore varied genres, highlighting evolving interests in content consumed.",
  "metrics": {
    "rouge1_f": 0.24456521739130435,
    "rouge2_f": 0.049180327868852465,
    "rougeL_f": 0.1467391304347826,
    "meteor": 0.11728398889293497,
    "bleu1": 0.17192982456140352,
    "bleu2": 0.04920921483633426,
    "bleu3": 0.009493699445991646,
    "bleu4": 0.004173633713700243,
    "bertscore_precision": 0.3929843306541443,
    "bertscore_recall": 0.41157740354537964,
    "bertscore_f1": 0.40206605195999146
  }
}