{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/07/02\nAverage Rating: 3.5\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Anja Dalhoff'], 'Producers': ['Gitte Randlov'], 'Starring': ['Michelle Mildwater']}\nReview Text: The impact that organ transplant makes in the world is really important. But you never really think about how thieves could convince you out of a kidney. Excellent documentary, great eye opener.\nReview Title: A must watch!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mullti Media Arts Limited'], 'Starring': ['Sir Ian Holm'], 'Studio': ['Janson Media']}\nThis documentary had a lot of great information and really covered some interesting ideas and where the ideas for the series originated from.\nInformative\n{'Subtitles': ['None available'], 'Directors': [\"Geoff D'Eon\"], 'Producers': ['Edward Peill'], 'Studio': ['Syndicado']}\nA really good eye opener on how counterfeit merchandise can kill and how serious this crime really is.\nA really good eye opener\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Marjane Satrapi'], 'Producers': ['Adi Shankar', 'Matthew Rhodes', 'Roy Lee', 'Spencer Silna'], 'Starring': ['Ryan Reynolds', 'Gemma Arterton', 'Anna Kendrick'], 'Studio': ['LIONSGATE']}\nRyan Reynolds rocks in this movie! A must watch for those who like a good brutal comedy!\nSo funny!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English (US)', 'English (UK) [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Peyton Reed'], 'Producers': ['Richard D. Zanuck', 'David Heyman'], 'Starring': ['Jim Carrey', 'Zooey Deschanel', 'Bradley Cooper'], 'Studio': ['Warner Bros.']}\nCome on and live a little, this movie will inspire you to say YES!\nYes sir this movie is great!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jared Hess'], 'Producers': ['Jeremy Coon', 'Chris Wyatt', 'Sean Covel', 'Jory Weitz'], 'Starring': ['Jon Heder', 'Jon Gries', 'Aaron Ruell'], 'Studio': ['Crowd Pleasers']}\nBest Movie Ever!\nBest Movie Ever!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['David Michôd'], 'Producers': ['Liz Watts', 'David Linde', 'David Michôd'], 'Starring': ['Robert Pattinson', 'Guy Pearce', 'Scoot McNairy']}\nDisgusting! I couldn't even make it past the first 20mins. It was fine until this lady offered (Guy Pierce) to have sex with a young teenage boy. The way she said it was enough to make you want to puke. I will not be finishing this film.\nDisgusting!\nDreams From My Real Father: A Story of Reds and Deception\nDocumentary\n[\"Dreams from My Real Father chronicles Barack Obama's life journey in socialism starting with evidence that Obama's real father was Frank Marshall Davis, a Communist Party USA propagandist who indoctrinated Obama into a Marxist ideology during his formative years. Was the goat herding Kenyan father only a fairy tale to obscure a Marxist agenda, irreconcilable with American values?\"]\n{'Subtitles': ['None available'], 'Directors': ['Joel Gilbert'], 'Producers': ['Joel Gilbert'], 'Starring': ['Barack Obama']}\nExcellent documentary and features documents and other evidence to support their findings. Scary to think this very well could be what is going on in our White House.\nA must watch!!!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Thomas Lucas'], 'Producers': ['Thomas Lucas', 'Johnny Friday', 'Alfredo Barroso', 'Jonathan Green'], 'Studio': ['MagellanTV']}\nAmazing footage of marine life and excellent information on sharks\nBeautifully done\n{'Subtitles': ['None available'], 'Directors': ['Sebastian Howard'], 'Producers': ['Batch Howard', 'Claude Barnes', 'Edith Dandenault', 'Anna Chen'], 'Studio': ['Syndicado']}\nWow what a challenging question. I had heard some of the arguments against milk before, but this was a great documentary. It still leaves the question, should we drink milk?\nGreat information!\n{'Subtitles': ['None available'], 'Directors': ['Barbara Kopple'], 'Producers': ['Carla Woods', 'Barbara Kopple', 'Glenn Rigberg', 'Hilary Birmingham'], 'Starring': ['Garo Armen', 'Steven Walker'], 'Studio': ['Gravitas']}\nThis was a great documentary. It really focused on how the FDA could play a vital role in saving lives, but instead is chooses to let people suffer. It's hard to believe that our country is so heartless and where the line blurs from helpful to harmful. This is a great documentary for everyone to watch, it really will open your eyes to how the government would rather let drugs that will save or help people sit forever instead of taking a stand to work with these families.\nA MUST WATCH! Don't be fooled\n{'Subtitles': ['None available'], 'Directors': ['Bertram Verhaag'], 'Producers': ['Bertram Verhaag'], 'Starring': ['Percy Schmeiser'], 'Studio': ['Syndicado']}\nCorporations are out of control and it's hard to believe how they are destroying so many industries, especially agriculture. This documentary is a great insight into the struggle to keep GMO out of our food and the hardship farmers are feeling because of it.\nExcellent documentary\n{'Subtitles': ['None available'], 'Directors': ['Anja Dalhoff'], 'Producers': ['Gitte Randlov'], 'Starring': ['Michelle Mildwater']}\nThe impact that organ transplant makes in the world is really important. But you never really think about how thieves could convince you out of a kidney. Excellent documentary, great eye opener.\nA must watch!",
  "profile": "**User Summary Update:**\n\nThe user maintains a strong interest in documentaries that delve into complex societal issues, particularly focusing on crime, politics, agriculture, and now health-related themes. Their recent endorsement of a documentary exploring organ transplants indicates an expanding curiosity about the ethical implications surrounding health and medical practices. This aligns with their commitment to seeking thought-provoking content that challenges perceptions and encourages critical thinking about systemic issues.\n\nIn addition to their established interests, the user now exhibits a keen interest in documentaries that tackle health, such as the ethics of organ donation, while still favoring educational and visually engaging material. They continue to prefer content that avoids explicit themes and graphic content, reinforcing their aversion to violence and sexual themes in favor of depth and appropriateness.\n\nThough they occasionally engage with lighter content, the user's reviews confirm a predominant inclination toward serious storytelling that delivers meaningful insights. They consistently favor English audio and subtitles to enhance their viewing experience.\n\nOverall, the user’s documentary engagement reflects a thoughtful approach to understanding significant societal, health, and environmental matters while respecting their boundaries regarding explicit material. This highlights a dynamic interest in a variety of themes, emphasizing a commitment to educational value and critical reflection.",
  "metrics": {
    "rouge1_f": 0.16859852476290835,
    "rouge2_f": 0.010559662090813094,
    "rougeL_f": 0.07586933614330875,
    "meteor": 0.04850569180143349,
    "bleu1": 0.003907459408702186,
    "bleu2": 0.0007356641754413421,
    "bleu3": 0.0001358916907276413,
    "bleu4": 5.846831595404905e-05,
    "bertscore_precision": 0.324354887008667,
    "bertscore_recall": 0.456084668636322,
    "bertscore_f1": 0.379102498292923
  }
}