{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Galaxy Quest [Blu-ray]\nReview Date: 2011/04/12\nStore: Tim Allen  (Actor),     Sigourney Weaver  (Actor),     Dean Parisot  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['For four years, the courageous crew of the NSEA protector - \"Commander Peter Quincy Taggart\" (Tim Allen), \"Lt. Tawny Madison (Sigourney Weaver) and \"Dr.Lazarus\" (Alan Rickman) - set off on a thrilling and often dangerous mission in space...and then their series was cancelled! Now, twenty years later, aliens under attack have mistaken the Galaxy Quest television transmissions for \"historical documents\" and beam up the crew of has-been actors to save the universe. With no script, no director and no clue, the actors must turn in the performances of their lives.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction', 'Format': 'AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jerzy Zielinski, Dean Parisot, Enrico Colantoni, Robin Sachs, Sam Rockwell, Missi Pyle, David Newman, Tim Allen, Alan Rickman, Daryl Mitchell, Sigourney Weaver, Tony ShalhoubJerzy Zielinski, Dean Parisot, Enrico Colantoni, Robin Sachs, Sam Rockwell, Missi Pyle, David Newman, Tim Allen, Alan Rickman, Daryl Mitchell, Sigourney Weaver, Tony Shalhoub  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.5 x 5.25 x 0.25 inches; 4 Ounces', 'Director': 'Dean Parisot', 'Media Format': 'AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 17, 2009', 'Actors': 'Tim Allen, Sigourney Weaver, Alan Rickman, Tony Shalhoub, Sam Rockwell', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: While, as the Amazon description says, it's helpful to be a STAR TREK fan or at least know about the series while watching this film, since inside jokes like \"I see you got your shirt off\" may make little sense if you don't, one really doesn't even have to be a science-fiction fan to get a kick out of this movie. It is representative of fandom for any popular cultural icon, going back to when 19th century \"fan fiction\" sequels were written to Jane Austen novels, girls re-enacted memorable romantic poetry scenes (think the \"Lady of Shalott\" sequence in ANNE OF GREEN GABLES), and radio listeners sent baby booties and wedding gifts whenever a birth or marriage happened on their favorite soap opera.<br /><br />The characters, of course, are strong TREK/SF archetypes: the stalwart commander (who in real life is a ham actor who realizes how much of his present life is a shambles), the genius alien, the miraculous engineer who can fix anything, the obligatory sex symbol, the precocious kid, and the nervous extra who realizes that if life imitates art his life is forfeit.<br /><br />Tim Allen lends a poignant note to Jason Nesmith when he realizes his has-been status, and does a creditable turn as an (albeit bumbling) action hero. Alan Rickman is perfect as the exasperated Brit whose alien character is beloved, but who always will be second fiddle to Nesmith's charisma, and Sigourney Weaver fun as the \"eye candy\" crewman who wishes she had had more intelligent things to do on the ship but flash her boobs and talk to the computer. Robin Sachs, the creepy \"Ethan\" on the BUFFY series, turns in a bravura performance as the menacing Sarris. Daryl Mitchell as the grown-up child actor and Sam Rockwell as the gonzo extra Guy Fleegman also turn in great performances, Enrico Colatoni is delightful as Mathazar, leader of the alien Thermians pleading for help from Nesmith and his crew, Justin Long had the right combination of smarts and geekiness as the fannish Brandon, but my favorite character in this hilarious sendup is Fred Kwan, played by Tony Shaloub. He never loses his cool (well, except once), and faces ray guns, space ships, and aliens (even one with tentacles and a big smile) with phlegmatic aplomb.<br /><br />This film was the reason we went out and bought our original DVD player, and now the Blu-Ray version of GALAXY QUEST is better than ever, stunning, crisp picture and even better sound than was on the original DVD release. This film is a must for every SF fan, or even for anyone who's found himself as part of any fandom.\nReview Title: \"Never Give Up! Never Surrender!\"\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Mothers-in-Law: The Complete Series\nEve Arden  (Actor),     Kaye Ballard  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Product Description', \"It's a funny family feud from Desi Arnaz and the writers of I Love Lucy. Set in the swinging late 1960s, the Mothers-In-Law centers on the laugh-filled misadventures of longtime neighbors in suburban Los Angeles who become related to each other when their children suddenly get married. Legendary actress Eve Arden (Our Miss Brooks, Grease) stars as Eve Hubbard, the sophisticated wife of straight-laced lawyer Herb Hubbard (Herbert Rudley). Veteran comedienne Kaye Ballard plays Kaye Buell, the outspoken wife of bombastic television writer Roger Buell (Roger C. Carmel and Richard Deacon). to the dismay of their hapless husbands, the strong-willed mothers are determined to meddle in the lives of newlyweds Jerry (Jerry Fogel) and Suzie Hubbard (Deborah Walley).\", 'Amazon.com', 'The Mothers-in-Law', 'is one of those \"You had to be there\" shows, best appreciated by those who dimly but fondly remember this short-lived series. This was Desi Arnaz\\'s last TV series as a producer. As a swan song, it\\'s more \"We\\'re Having a Baby, My Baby and Me\" than \"Cuban Pete,\" but for a show that was hopelessly square even back in 1967 (as witness the cringe-worthy episode featuring the one-hit wonder band the Seeds, who perform said one hit, \"Pushin\\' Too Hard\"), it rates as a found treasure thanks to the crack timing and expert clowning of its stars. Show biz troupers Eve Arden and Kaye Ballard star as reserved and sophisticated Eve Hubbard and histrionic and overly emotional Kaye Buell. They are neighbors with an odd-couple friendship whose lives become further bound when their children, Eve\\'s daughter Susie (Deborah Walley) and Kaye\\'s son Jerry (Jerry Fogel), get married and move in to the Hubbards\\' garage. Arnaz did not attempt to reinvent the wheel with', 'The Mothers-in-Law', '. Created and written primarily by', 'I Love Lucy', 'scribes Bob Carroll Jr. and Madelyn Davis, the series takes several pages from the', 'Lucy', \"playbook. Arden and Ballard have a Lucy-Ethel chemistry. Arnaz, who directed many of the episodes, deftly stages the ladies' slapstick shenanigans. And just as Lucy never stopped plotting to get into husband Ricky's act, so do Eve and Kaye insist on meddling in their children's lives, much to the eye-rolling annoyance of their long-suffering husbands (Herbert Rudley and Roger C. Carmel). Several episodes also manage to work in comical production numbers to showcase the cast's talents. Fan-favorite episodes include those in which Arnaz guest stars as matador Raphael Del Gado from Barcelona. Other memorable guest stars include Don Rickles, Ozzie Nelson, Paul Lynde, and a pre-\", 'All in the Family', \"Rob Reiner. Despite being sandwiched between Disney's\", 'The Wonderful World of Color', 'and', 'Bonanza', ',', 'The Mothers-in-Law', 'was not a ratings smash. In season 2, Carmel left the show in a salary dispute and was replaced Darrin-style with Richard Deacon, and not even the addition of grandchildren to the family mix could save the series. The extras on this eight-disc set are impressive. Baby boomers will get a nostalgic kick out of seeing the NBC peacock unfurl its feathers in \"living color,\" as well as period commercials. There is a newly filmed interview with the gracious Ms. Ballard, the original unaired pilot featuring Kay Cole as Susie, two failed Arnaz series pilots for', 'The Carol Channing Show', 'and', 'Lands End', ', and solo variety show performance clips featuring Arden and Ballard. Unlike the intrusive Mrs. Hubbard and Mrs. Buell, TV buffs should welcome', 'The Mothers-in-Law', 'into their homes.', '--Donald Liebenson']\n{'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Roger C. Carmel, Kaye Ballard, Jerry Fogel, Eve Arden, Herb Rudley, Richard Deacon', 'Language': 'Unqualified', 'Number Of Discs': '8', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.82 Ounces', 'Item model number': '7487425', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '27 hours', 'Release date': 'July 27, 2010', 'Actors': 'Eve Arden, Kaye Ballard, Herb Rudley, Roger C. Carmel, Richard Deacon', 'Studio': 'Mpi Home Video', 'Country of Origin': 'USA', 'Number of discs': '8'}\nI watched this series during its original run and am looking forward to it being on DVD, although I must state that second season was not as good as the first due to Roger C. Carmel's departure from the show. Richard Deacon did his usual good job, but he basically played Roger Buell the same way he played Mel Cooley, which completely changed Roger's personality and his relationship with wife Kaye. Ballard and Arden are quite funny together and some of the best episodes have an old-time radio flavor with delightful wordplay, such as the episode where the kids have a fight and eventually the entire group isn't speaking to each other. I enjoyed that episode so much I made an audio tape of it, and it held up quite well as an audio presentation.<br /><br />Everyone likens this series to I LOVE LUCY and it has certain LUCY riffs, but I also think of it as being a bit like the British series THE GOOD LIFE (a.k.a. GOOD NEIGHBORS) if the Ledbetters and the Goods had had children who married. The more conventional Hubbards are like the Ledbetters, and the Buells are as odd in their own way as the Goods.<br /><br />I hope some of the more classic 1960s and 1970s series will come to DVD, including the brillant HE AND SHE and MY WORLD AND WELCOME TO IT. I've heard a rumor that the 1975 ELLERY QUEEN series may be due out soon as well. These would be a great tonic to the \"reality show\" trend that infests our network broadcasts these days.\nPerhaps Not a \"Classic,\" But Still a Funny Series\nThe Horse Without A Head\nJean-Pierre Aumont  (Actor),     Herbert Lom  (Actor),     Don Chaffey  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['When a kindly junk dealer gives a group of poor French children a headless toy horse, the kids dub themselves \"The Knights Of The Headless Horse.\" The broken toy becomes their only source of fun as they race down the narrow streets of their village. But suddenly the horse becomes the pawn in another game -- a deadly race against time between a ruthless gang of train robbers (led by Herbert Lom) and the town\\'s honest police inspector (Jean-Pierre Aumont). The stakes are high: A hundred million francs ... and the lives of five innocent children!']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Don Chaffey', 'Media Format': 'Full Screen', 'Run time': '1 hour and 29 minutes', 'Release date': 'January 16, 2006', 'Actors': 'Jean-Pierre Aumont, Herbert Lom, Leo McKern, Pamela Franklin, Vincent Winter', 'Language': 'English (Dolby Digital 5.1), English (Dolby Surround)', 'Studio': 'Disney', 'Writers': 'T.E.B. Clarke', 'Number of discs': '1'}\nI saw this story first on WALT DISNEY'S WONDERFUL WORLD OF COLOR in the 1960s and still enjoy it immensely. Five poor children have only one toy, a large wooden headless hobbyhorse that the eldest boy's father found in an abandoned house. The children use it as sort of a \"thrill-ride\" down the steep streets of their town. In the meantime, a gang of thieves are planning to steal a bank shipment from the train that must slow down on a nearby curve, enlisting the help of a local peddler, who hides the key to the place the loot is stashed in the kids' horse. When they discover this, the thieves steal the horse and of course the children try to find it. Jean Pierre Aumont co-stars as the good-natured police inspector trying to find the thieves and the cash. The highlight of this movie is Pamela Franklin, who plays Marion. Marion has a special way with dogs; she cares for any stray she finds, then gives them homes, but before they leave her, they are taught to respond to her whistle. Needless to say, whenever the kids are in trouble, Marion's whistle brings a rescue pack of dogs in some very funny sequences. Franklin is bright and ingenuous in the role, foreshadowing her future lively performance in THE PRIME OF MISS JEAN BRODIE.<br /><br />The film was based on a book by Paul Berna, and three sequels were written about the characters.\nFive Kids, a Hobbyhorse...and, Oh Yes, the Dogs!\nMercy Mission/Nowhere to Land [DVD]\nScott Bakula  (Actor),     Robert Loggia  (Actor),     Roger Young  (Director),     Armand Mastroianni  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Nowhere to Land, A pilot must safely land a 747 on which deadly nerve gas has been planted. Mercy Mission: The Rescue of Flight 771, This is the story of a brave single-engine aircraft pilot lost over stormy seas and the veteran commercial airline captain who, along with a plane full of passengers, guides him to safety.']\n{'Genre': 'Action & Adventure', 'Format': 'Color, DVD, Widescreen, NTSC', 'Contributor': 'Scott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand MastroianniScott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand Mastroianni  See more', 'Language': 'English', 'Runtime': '3 hours and 3 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 1 Pounds', 'Director': 'Roger Young, Armand Mastroianni', 'Media Format': 'Color, DVD, Widescreen, NTSC', 'Run time': '3 hours and 3 minutes', 'Release date': 'August 28, 2007', 'Actors': 'Scott Bakula, Robert Loggia, Rebecca Rigg, Jack Wagner, Christine Elise', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nPlease note that I am only reviewing this DVD for the film MERCY MISSION. I have been wanting this movie on professional DVD for some years now, having relied on a VHS copy for so many years. This has been a Christmas favorite at our home since it was broadcast on NBC. However, don't worry, it doesn't contain cute elves, warm Santas, or bathotic family reunions; it just takes place at Christmas.<br /><br />Jay Parkins is a young pilot to whom flying takes first place, even to his responsibilities at home and his pregnant wife. After he's fired from a job for deliberately annoying the client, he and a fellow pilot agree to fly two crop dusting planes to Norfolk Island, deep in the Pacific Ocean. The plane his friend is flying malfunctions as they leave Pago Pago, but Jay continues, knowing he will need the fee for ferrying the plane when his son is born. Unfortunately his navigation equipment fouls, leaving him with no idea where he is, alone with the vast Pacific below. A nearby Air New Zealand commercial flight offers to help find him.<br /><br />If this all sounds tedious, it isn't. Scott Bakula as Parkins and Robert Loggia as senior Air New Zealand pilot Gordon Vette brilliantly carry this tense film, as Vette uses all his aviation wiles to locate Parkins' tiny plane, and both men form an emotional bond via anxious radio calls. Supporting characters such as Vette's cockpit crew, the head stewardess, Parkins' flying partner, and a planeful of New Zealanders returning from holiday all enhance the story and the tension until the gripping conclusion. If you like good character pieces this film is highly recommended; aviation buffs will probably love it, too.\nA Small Plane, A Large Ocean, and a Determined Pilot\nGalaxy Quest [Blu-ray]\nTim Allen  (Actor),     Sigourney Weaver  (Actor),     Dean Parisot  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['For four years, the courageous crew of the NSEA protector - \"Commander Peter Quincy Taggart\" (Tim Allen), \"Lt. Tawny Madison (Sigourney Weaver) and \"Dr.Lazarus\" (Alan Rickman) - set off on a thrilling and often dangerous mission in space...and then their series was cancelled! Now, twenty years later, aliens under attack have mistaken the Galaxy Quest television transmissions for \"historical documents\" and beam up the crew of has-been actors to save the universe. With no script, no director and no clue, the actors must turn in the performances of their lives.']\n{'Genre': 'Science Fiction', 'Format': 'AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jerzy Zielinski, Dean Parisot, Enrico Colantoni, Robin Sachs, Sam Rockwell, Missi Pyle, David Newman, Tim Allen, Alan Rickman, Daryl Mitchell, Sigourney Weaver, Tony ShalhoubJerzy Zielinski, Dean Parisot, Enrico Colantoni, Robin Sachs, Sam Rockwell, Missi Pyle, David Newman, Tim Allen, Alan Rickman, Daryl Mitchell, Sigourney Weaver, Tony Shalhoub  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.5 x 5.25 x 0.25 inches; 4 Ounces', 'Director': 'Dean Parisot', 'Media Format': 'AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 17, 2009', 'Actors': 'Tim Allen, Sigourney Weaver, Alan Rickman, Tony Shalhoub, Sam Rockwell', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '1'}\nWhile, as the Amazon description says, it's helpful to be a STAR TREK fan or at least know about the series while watching this film, since inside jokes like \"I see you got your shirt off\" may make little sense if you don't, one really doesn't even have to be a science-fiction fan to get a kick out of this movie. It is representative of fandom for any popular cultural icon, going back to when 19th century \"fan fiction\" sequels were written to Jane Austen novels, girls re-enacted memorable romantic poetry scenes (think the \"Lady of Shalott\" sequence in ANNE OF GREEN GABLES), and radio listeners sent baby booties and wedding gifts whenever a birth or marriage happened on their favorite soap opera.<br /><br />The characters, of course, are strong TREK/SF archetypes: the stalwart commander (who in real life is a ham actor who realizes how much of his present life is a shambles), the genius alien, the miraculous engineer who can fix anything, the obligatory sex symbol, the precocious kid, and the nervous extra who realizes that if life imitates art his life is forfeit.<br /><br />Tim Allen lends a poignant note to Jason Nesmith when he realizes his has-been status, and does a creditable turn as an (albeit bumbling) action hero. Alan Rickman is perfect as the exasperated Brit whose alien character is beloved, but who always will be second fiddle to Nesmith's charisma, and Sigourney Weaver fun as the \"eye candy\" crewman who wishes she had had more intelligent things to do on the ship but flash her boobs and talk to the computer. Robin Sachs, the creepy \"Ethan\" on the BUFFY series, turns in a bravura performance as the menacing Sarris. Daryl Mitchell as the grown-up child actor and Sam Rockwell as the gonzo extra Guy Fleegman also turn in great performances, Enrico Colatoni is delightful as Mathazar, leader of the alien Thermians pleading for help from Nesmith and his crew, Justin Long had the right combination of smarts and geekiness as the fannish Brandon, but my favorite character in this hilarious sendup is Fred Kwan, played by Tony Shaloub. He never loses his cool (well, except once), and faces ray guns, space ships, and aliens (even one with tentacles and a big smile) with phlegmatic aplomb.<br /><br />This film was the reason we went out and bought our original DVD player, and now the Blu-Ray version of GALAXY QUEST is better than ever, stunning, crisp picture and even better sound than was on the original DVD release. This film is a must for every SF fan, or even for anyone who's found himself as part of any fandom.\n\"Never Give Up! Never Surrender!\"",
  "profile": "The user continues to demonstrate a strong appreciation for classic television comedies from the 1960s and 1970s, valuing rich character dynamics and clever humor. Their love for nostalgia is reflected in their collection of vintage media, especially as these classic series are now available in modern formats like Blu-ray. Recently, they purchased a beloved film that resonates with their childhood experiences, reinforcing their preference for engaging and character-driven narratives that seamlessly blend humor with emotional depth.\n\nIn a recent review, they emphasized their admiration for well-crafted storytelling, particularly in character pieces that explore emotional bonds within plots. While the user actively seeks media that reflects their fond memories, they maintain a critical stance toward contemporary trends like reality television, instead favoring remastered or archived content that aligns with their nostalgic roots. The recent interaction highlights their enthusiasm for stories that celebrate fandom and features strong ensemble casts, further cementing their preference for quality storytelling over modern offerings. Overall, the user immerses themselves in experiences that evoke cherished past memories and uphold classic storytelling values, eagerly exploring new acquisitions that resonate with their long-standing admiration for character-driven narratives.",
  "metrics": {
    "rouge1_f": 0.07481815032906132,
    "rouge2_f": 0.006932409012131715,
    "rougeL_f": 0.03463803255975061,
    "meteor": 0.02095894251026631,
    "bleu1": 6.739660206187723e-08,
    "bleu2": 2.1051412229480744e-08,
    "bleu3": 8.366625994954901e-09,
    "bleu4": 2.4972589812630036e-09,
    "bertscore_precision": 0.31926190853118896,
    "bertscore_recall": 0.49808189272880554,
    "bertscore_f1": 0.38911059498786926
  }
}