{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 1776 [Blu-ray]\nReview Date: 2017/06/20\nStore: William Daniels  (Actor),     Howard DaSilva  (Actor),     Peter Hunt  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Musicals\nProduct Description: ['1776', 'is a musical celebration of the founding of the United States of America based on the award-winning Broadway production. The story centers around familiar historical characters as they organize a movement for independence from Mother England: the tough and unyielding John Adams (William Daniels); the charming and pragmatic Benjamin Franklin (Howard Da Silva); the brilliant Thomas Jefferson (Ken Howard) who is chosen to write the Declaration of Independence even as he longs for the company of his new bride Martha (Blythe Danner); and the rest of the Continental Congress. All events lead up to that most significant date of July 4, 1776 when the Declaration was signed. Now fully restored for its high definition debut on Blu-ray,', '1776', 'looks and sounds better than ever.', 'Exclusive Blu-ray Bonus Features Include:', '§ All-new commentary with director Peter H. Hunt, William Daniels, Ken Howard, and Peter Stone', '§ Extended cut of the film via seamless branching', '§ Deleted and alternate scenes with filmmaker commentary', '§ Four never-before-seen screen tests including archival footage', '§ Original theatrical teaser and trailer']\nAverage Rating: 4.7\nProduct Details: {'Digital Copy Expiration Date': 'December 31, 2018', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': '33951303', 'Director': 'Peter Hunt', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 45 minutes', 'Release date': 'June 2, 2015', 'Actors': 'William Daniels, Howard DaSilva, Ken Howard, Blythe Danner', 'Subtitles': 'English, French', 'Producers': 'Jack L. Warner', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is one of my husband's and my favorite movies, and the moment we saw it available on Blu-Ray we ordered it. We had the DVD of the Director's Cut, but this has even more restored scenes (William Daniels' &#34;Philadelphia&#34; song, for instance, is completely restored, where it wasn't in the DVD version) and the picture and sound is outstanding.<br /><br />For the uninitiated, this is a musical look at the signing of the Declaration of Independence. Yes, many liberties are taken (Martha Jefferson did not come to Philadelphia, Richard Henry Lee was not a grinning buffoon), but the idea was to show the public that the signers of the Declaration were not 2-dimensional gods who signed a historic piece of paper, but just ordinary men who loved, lusted, ate to excess, argued, philosophized, and debated. There are some rousing good songs like &#34;The Lees of Old Virginia&#34; and &#34;The Egg,&#34; the sentimental and prophetic &#34;He Plays the Violin,&#34; and the showstopper &#34;Molasses to Rum to Slaves&#34; which chillingly reminds us of the dreadful &#34;Triangle Trade&#34; in slaves. William Daniels, Howard da Silva, and the rest of the cast give bravura performances.<br /><br />An Independence Day staple at our home!\nReview Title: Finally on Blu-Ray\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Mothers-in-Law: The Complete Series\nEve Arden  (Actor),     Kaye Ballard  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Product Description', \"It's a funny family feud from Desi Arnaz and the writers of I Love Lucy. Set in the swinging late 1960s, the Mothers-In-Law centers on the laugh-filled misadventures of longtime neighbors in suburban Los Angeles who become related to each other when their children suddenly get married. Legendary actress Eve Arden (Our Miss Brooks, Grease) stars as Eve Hubbard, the sophisticated wife of straight-laced lawyer Herb Hubbard (Herbert Rudley). Veteran comedienne Kaye Ballard plays Kaye Buell, the outspoken wife of bombastic television writer Roger Buell (Roger C. Carmel and Richard Deacon). to the dismay of their hapless husbands, the strong-willed mothers are determined to meddle in the lives of newlyweds Jerry (Jerry Fogel) and Suzie Hubbard (Deborah Walley).\", 'Amazon.com', 'The Mothers-in-Law', 'is one of those \"You had to be there\" shows, best appreciated by those who dimly but fondly remember this short-lived series. This was Desi Arnaz\\'s last TV series as a producer. As a swan song, it\\'s more \"We\\'re Having a Baby, My Baby and Me\" than \"Cuban Pete,\" but for a show that was hopelessly square even back in 1967 (as witness the cringe-worthy episode featuring the one-hit wonder band the Seeds, who perform said one hit, \"Pushin\\' Too Hard\"), it rates as a found treasure thanks to the crack timing and expert clowning of its stars. Show biz troupers Eve Arden and Kaye Ballard star as reserved and sophisticated Eve Hubbard and histrionic and overly emotional Kaye Buell. They are neighbors with an odd-couple friendship whose lives become further bound when their children, Eve\\'s daughter Susie (Deborah Walley) and Kaye\\'s son Jerry (Jerry Fogel), get married and move in to the Hubbards\\' garage. Arnaz did not attempt to reinvent the wheel with', 'The Mothers-in-Law', '. Created and written primarily by', 'I Love Lucy', 'scribes Bob Carroll Jr. and Madelyn Davis, the series takes several pages from the', 'Lucy', \"playbook. Arden and Ballard have a Lucy-Ethel chemistry. Arnaz, who directed many of the episodes, deftly stages the ladies' slapstick shenanigans. And just as Lucy never stopped plotting to get into husband Ricky's act, so do Eve and Kaye insist on meddling in their children's lives, much to the eye-rolling annoyance of their long-suffering husbands (Herbert Rudley and Roger C. Carmel). Several episodes also manage to work in comical production numbers to showcase the cast's talents. Fan-favorite episodes include those in which Arnaz guest stars as matador Raphael Del Gado from Barcelona. Other memorable guest stars include Don Rickles, Ozzie Nelson, Paul Lynde, and a pre-\", 'All in the Family', \"Rob Reiner. Despite being sandwiched between Disney's\", 'The Wonderful World of Color', 'and', 'Bonanza', ',', 'The Mothers-in-Law', 'was not a ratings smash. In season 2, Carmel left the show in a salary dispute and was replaced Darrin-style with Richard Deacon, and not even the addition of grandchildren to the family mix could save the series. The extras on this eight-disc set are impressive. Baby boomers will get a nostalgic kick out of seeing the NBC peacock unfurl its feathers in \"living color,\" as well as period commercials. There is a newly filmed interview with the gracious Ms. Ballard, the original unaired pilot featuring Kay Cole as Susie, two failed Arnaz series pilots for', 'The Carol Channing Show', 'and', 'Lands End', ', and solo variety show performance clips featuring Arden and Ballard. Unlike the intrusive Mrs. Hubbard and Mrs. Buell, TV buffs should welcome', 'The Mothers-in-Law', 'into their homes.', '--Donald Liebenson']\n{'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Roger C. Carmel, Kaye Ballard, Jerry Fogel, Eve Arden, Herb Rudley, Richard Deacon', 'Language': 'Unqualified', 'Number Of Discs': '8', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.82 Ounces', 'Item model number': '7487425', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '27 hours', 'Release date': 'July 27, 2010', 'Actors': 'Eve Arden, Kaye Ballard, Herb Rudley, Roger C. Carmel, Richard Deacon', 'Studio': 'Mpi Home Video', 'Country of Origin': 'USA', 'Number of discs': '8'}\nI watched this series during its original run and am looking forward to it being on DVD, although I must state that second season was not as good as the first due to Roger C. Carmel's departure from the show. Richard Deacon did his usual good job, but he basically played Roger Buell the same way he played Mel Cooley, which completely changed Roger's personality and his relationship with wife Kaye. Ballard and Arden are quite funny together and some of the best episodes have an old-time radio flavor with delightful wordplay, such as the episode where the kids have a fight and eventually the entire group isn't speaking to each other. I enjoyed that episode so much I made an audio tape of it, and it held up quite well as an audio presentation.<br /><br />Everyone likens this series to I LOVE LUCY and it has certain LUCY riffs, but I also think of it as being a bit like the British series THE GOOD LIFE (a.k.a. GOOD NEIGHBORS) if the Ledbetters and the Goods had had children who married. The more conventional Hubbards are like the Ledbetters, and the Buells are as odd in their own way as the Goods.<br /><br />I hope some of the more classic 1960s and 1970s series will come to DVD, including the brillant HE AND SHE and MY WORLD AND WELCOME TO IT. I've heard a rumor that the 1975 ELLERY QUEEN series may be due out soon as well. These would be a great tonic to the \"reality show\" trend that infests our network broadcasts these days.\nPerhaps Not a \"Classic,\" But Still a Funny Series\nThe Horse Without A Head\nJean-Pierre Aumont  (Actor),     Herbert Lom  (Actor),     Don Chaffey  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['When a kindly junk dealer gives a group of poor French children a headless toy horse, the kids dub themselves \"The Knights Of The Headless Horse.\" The broken toy becomes their only source of fun as they race down the narrow streets of their village. But suddenly the horse becomes the pawn in another game -- a deadly race against time between a ruthless gang of train robbers (led by Herbert Lom) and the town\\'s honest police inspector (Jean-Pierre Aumont). The stakes are high: A hundred million francs ... and the lives of five innocent children!']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Don Chaffey', 'Media Format': 'Full Screen', 'Run time': '1 hour and 29 minutes', 'Release date': 'January 16, 2006', 'Actors': 'Jean-Pierre Aumont, Herbert Lom, Leo McKern, Pamela Franklin, Vincent Winter', 'Language': 'English (Dolby Digital 5.1), English (Dolby Surround)', 'Studio': 'Disney', 'Writers': 'T.E.B. Clarke', 'Number of discs': '1'}\nI saw this story first on WALT DISNEY'S WONDERFUL WORLD OF COLOR in the 1960s and still enjoy it immensely. Five poor children have only one toy, a large wooden headless hobbyhorse that the eldest boy's father found in an abandoned house. The children use it as sort of a \"thrill-ride\" down the steep streets of their town. In the meantime, a gang of thieves are planning to steal a bank shipment from the train that must slow down on a nearby curve, enlisting the help of a local peddler, who hides the key to the place the loot is stashed in the kids' horse. When they discover this, the thieves steal the horse and of course the children try to find it. Jean Pierre Aumont co-stars as the good-natured police inspector trying to find the thieves and the cash. The highlight of this movie is Pamela Franklin, who plays Marion. Marion has a special way with dogs; she cares for any stray she finds, then gives them homes, but before they leave her, they are taught to respond to her whistle. Needless to say, whenever the kids are in trouble, Marion's whistle brings a rescue pack of dogs in some very funny sequences. Franklin is bright and ingenuous in the role, foreshadowing her future lively performance in THE PRIME OF MISS JEAN BRODIE.<br /><br />The film was based on a book by Paul Berna, and three sequels were written about the characters.\nFive Kids, a Hobbyhorse...and, Oh Yes, the Dogs!\nMercy Mission/Nowhere to Land [DVD]\nScott Bakula  (Actor),     Robert Loggia  (Actor),     Roger Young  (Director),     Armand Mastroianni  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Nowhere to Land, A pilot must safely land a 747 on which deadly nerve gas has been planted. Mercy Mission: The Rescue of Flight 771, This is the story of a brave single-engine aircraft pilot lost over stormy seas and the veteran commercial airline captain who, along with a plane full of passengers, guides him to safety.']\n{'Genre': 'Action & Adventure', 'Format': 'Color, DVD, Widescreen, NTSC', 'Contributor': 'Scott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand MastroianniScott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand Mastroianni  See more', 'Language': 'English', 'Runtime': '3 hours and 3 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 1 Pounds', 'Director': 'Roger Young, Armand Mastroianni', 'Media Format': 'Color, DVD, Widescreen, NTSC', 'Run time': '3 hours and 3 minutes', 'Release date': 'August 28, 2007', 'Actors': 'Scott Bakula, Robert Loggia, Rebecca Rigg, Jack Wagner, Christine Elise', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nPlease note that I am only reviewing this DVD for the film MERCY MISSION. I have been wanting this movie on professional DVD for some years now, having relied on a VHS copy for so many years. This has been a Christmas favorite at our home since it was broadcast on NBC. However, don't worry, it doesn't contain cute elves, warm Santas, or bathotic family reunions; it just takes place at Christmas.<br /><br />Jay Parkins is a young pilot to whom flying takes first place, even to his responsibilities at home and his pregnant wife. After he's fired from a job for deliberately annoying the client, he and a fellow pilot agree to fly two crop dusting planes to Norfolk Island, deep in the Pacific Ocean. The plane his friend is flying malfunctions as they leave Pago Pago, but Jay continues, knowing he will need the fee for ferrying the plane when his son is born. Unfortunately his navigation equipment fouls, leaving him with no idea where he is, alone with the vast Pacific below. A nearby Air New Zealand commercial flight offers to help find him.<br /><br />If this all sounds tedious, it isn't. Scott Bakula as Parkins and Robert Loggia as senior Air New Zealand pilot Gordon Vette brilliantly carry this tense film, as Vette uses all his aviation wiles to locate Parkins' tiny plane, and both men form an emotional bond via anxious radio calls. Supporting characters such as Vette's cockpit crew, the head stewardess, Parkins' flying partner, and a planeful of New Zealanders returning from holiday all enhance the story and the tension until the gripping conclusion. If you like good character pieces this film is highly recommended; aviation buffs will probably love it, too.\nA Small Plane, A Large Ocean, and a Determined Pilot\nGalaxy Quest [Blu-ray]\nTim Allen  (Actor),     Sigourney Weaver  (Actor),     Dean Parisot  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['For four years, the courageous crew of the NSEA protector - \"Commander Peter Quincy Taggart\" (Tim Allen), \"Lt. Tawny Madison (Sigourney Weaver) and \"Dr.Lazarus\" (Alan Rickman) - set off on a thrilling and often dangerous mission in space...and then their series was cancelled! Now, twenty years later, aliens under attack have mistaken the Galaxy Quest television transmissions for \"historical documents\" and beam up the crew of has-been actors to save the universe. With no script, no director and no clue, the actors must turn in the performances of their lives.']\n{'Genre': 'Science Fiction', 'Format': 'AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jerzy Zielinski, Dean Parisot, Enrico Colantoni, Robin Sachs, Sam Rockwell, Missi Pyle, David Newman, Tim Allen, Alan Rickman, Daryl Mitchell, Sigourney Weaver, Tony ShalhoubJerzy Zielinski, Dean Parisot, Enrico Colantoni, Robin Sachs, Sam Rockwell, Missi Pyle, David Newman, Tim Allen, Alan Rickman, Daryl Mitchell, Sigourney Weaver, Tony Shalhoub  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.5 x 5.25 x 0.25 inches; 4 Ounces', 'Director': 'Dean Parisot', 'Media Format': 'AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 17, 2009', 'Actors': 'Tim Allen, Sigourney Weaver, Alan Rickman, Tony Shalhoub, Sam Rockwell', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '1'}\nWhile, as the Amazon description says, it's helpful to be a STAR TREK fan or at least know about the series while watching this film, since inside jokes like \"I see you got your shirt off\" may make little sense if you don't, one really doesn't even have to be a science-fiction fan to get a kick out of this movie. It is representative of fandom for any popular cultural icon, going back to when 19th century \"fan fiction\" sequels were written to Jane Austen novels, girls re-enacted memorable romantic poetry scenes (think the \"Lady of Shalott\" sequence in ANNE OF GREEN GABLES), and radio listeners sent baby booties and wedding gifts whenever a birth or marriage happened on their favorite soap opera.<br /><br />The characters, of course, are strong TREK/SF archetypes: the stalwart commander (who in real life is a ham actor who realizes how much of his present life is a shambles), the genius alien, the miraculous engineer who can fix anything, the obligatory sex symbol, the precocious kid, and the nervous extra who realizes that if life imitates art his life is forfeit.<br /><br />Tim Allen lends a poignant note to Jason Nesmith when he realizes his has-been status, and does a creditable turn as an (albeit bumbling) action hero. Alan Rickman is perfect as the exasperated Brit whose alien character is beloved, but who always will be second fiddle to Nesmith's charisma, and Sigourney Weaver fun as the \"eye candy\" crewman who wishes she had had more intelligent things to do on the ship but flash her boobs and talk to the computer. Robin Sachs, the creepy \"Ethan\" on the BUFFY series, turns in a bravura performance as the menacing Sarris. Daryl Mitchell as the grown-up child actor and Sam Rockwell as the gonzo extra Guy Fleegman also turn in great performances, Enrico Colatoni is delightful as Mathazar, leader of the alien Thermians pleading for help from Nesmith and his crew, Justin Long had the right combination of smarts and geekiness as the fannish Brandon, but my favorite character in this hilarious sendup is Fred Kwan, played by Tony Shaloub. He never loses his cool (well, except once), and faces ray guns, space ships, and aliens (even one with tentacles and a big smile) with phlegmatic aplomb.<br /><br />This film was the reason we went out and bought our original DVD player, and now the Blu-Ray version of GALAXY QUEST is better than ever, stunning, crisp picture and even better sound than was on the original DVD release. This film is a must for every SF fan, or even for anyone who's found himself as part of any fandom.\n\"Never Give Up! Never Surrender!\"\nEllery Queen Mysteries\nJim Hutton  (Actor),     David Wayne  (Actor),     David Greene  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Mystery & Suspense\n['Product Description', 'From the creators of', 'Columbo', 'and', 'Murder, She Wrote', '… Match wits with Ellery Queen (Jim Hutton) in all 22 digitally restored, uncut and unedited episodes of this classic NBC series following the exploits of the famed writer as he assists his father, Inspector Richard Queen (David Wayne), in solving the mysteries that baffle the New York City police force.', \"Guest Stars include: Don Ameche, Dana Andrews, Tom Bosley, George Burns, Joan Collins, Troy Donahue, Anne Francis, Eva Gabor, Larry Hagman, June Lockhart, Robert Loggia, Roddy McDowall, Ed McMahon, Sal Mineo, Donald O'Connor, Dean Stockwell, Dick Van Patten, Vincent Price, Cesar Romero, Betty White, and many more!\", 'Amazon.com', 'The case of the missing TV series has finally been cracked, but why', 'Ellery Queen', 'lasted only one season (1975-76) and fell into obscurity is a real mystery. Based on the evidence in this six-disc set, this loving homage to the classic murder mystery created by Richard Levinson and William Link was, like their', 'Columbo', 'and', 'Murder, She Wrote', ', nonviolent and intelligent television of the first order. Set in the 1940s,', 'Ellery Queen', 'stars boyishly charming Jim Hutton, one of the screen\\'s most likable leading men, as the famed mystery writer and sleuth who helps his father, Inspector Richard Queen (David Wayne), solve the most baffling of cases. The pleasures this series affords are anything but guilty. Each intriguing episode begins with the preview of a murder, a roundup of the suspects (Was it the jealous wife? The dictatorial director?), and an irresistible challenge to viewers to \"match wits with Ellery Queen and see if you can guess whodunit.\" Before revealing the killer, Ellery breaks the fourth wall to ask if we amateur sleuths at home have the mystery figured out, offering last-minute clues such as, \"Once you figure out how, you\\'ll know who.\" As with', \"Burke's Law\", ', each episode of', 'Ellery Queen', 'is packed with enough Hollywood legends, venerable character actors, and TV faves to fill', 'The Love Boat', '. \"The Adventure of Veronica\\'s Veils\" features George Burns as the victim (\"I didn\\'t die of natural causes,\" he announces via a filmed presentation following his demise), William Demarest, Don Porter, comedian Jack Carter, Hayden Rorke (Dr. Bellows on', 'I Dream of Jeannie', '), and John Hillerman in his recurring role as radio detective Simon Brimmer, forever trying to one-up Queen. Queen himself makes it a point \"to be observant and pay attention to details,\" particularly for that \"dying clue which makes absolutely no sense.\" You\\'d be advised to do the same. The intricately plotted stories turn on the most arcane of clues and circumstances, as in the pilot episode \"Too Many Suspects,\" in which solving a fashion designer\\'s murder hinges on the reenactment of a TV news broadcast (maybe that explains the one-season run). An interview with Link, not very lively, but interesting, is included as a bonus feature.', '--Donald Liebenson']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.65 x 1.34 x 7.56 inches; 12.32 Ounces', 'Item model number': 'E1E-DV-6755', 'Director': 'David Greene', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '19 hours and 36 minutes', 'Release date': 'September 28, 2010', 'Actors': 'Jim Hutton, David Wayne, Tom Reese, John Hillerman, Nina Roman', 'Subtitles': 'English', 'Language': 'Unqualified, English (Mono)', 'Studio': 'Entertainment One', 'Number of discs': '6'}\nI was eighteen when the pilot movie for this series aired. As a 1940s and OTR buff, this series was tailor-made for me, not to mention that one of my favorite character actors, David Wayne, was portraying Inspector Richard Queen. Jim Hutton, who I was familiar with from THE GREEN BERETS and THE HORIZONTAL LIEUTENANT, played a loveable, absent-minded, but sharp Ellery. (I found out later that the Dannay/Lee families said that Hutton's portrayal was very close to the actual personality of one of the authors.) Week after week I would \"match wits\" with Ellery and try to guess the identity of the murderer. (I even kept score in my journal; alas, in the end Ellery \"out-sleuthed\" me.) I liked best the stories where knowing a certain word or concept would give you the clue to the killer's identity.<br /><br />The guest cast was filled with delightful character actors, from the 1970s regulars of the \"Universal Studios repertory group\" as I called them, to veteran performers who went back to radio and vaudeville, like George Burns, William Frawley, Eve Arden, and Eddie Bracken, and all the 1940s settings and references were equally delightful. Along the way QUEEN satirized a number of subjects, such as Hollywood changing writers' scripts and the movie scene; addressed hot subjects of the 1940s, such as the early payola scandals and war crimes; and even presaged the comic book violence controversy of the 1950s.<br /><br />A particular delight of the series was John Hillerman's portrayal of Simon Brimmer, an unctious radio mystery story star who fancied himself a sleuth. Brimmer would somehow always come up with the wrong suspect, only to be corrected by Ellery in the climactic scene. Indeed, radio stories played a part in several of the mysteries, and many times the wordplay of the structure of the episodes themselves harked back to radio. Ken Swofferd is also fun as Frank Flannigan, a bombastic hack reporter.<br /><br />This is a nice, solid release of the series which includes the pilot film TOO MANY SUSPECTS. The episodes are sharp and crisp, with typical television sound of the time, which is not unpleasant. Definitely for classic mystery fans who don't mind a bit of whimsy, 1940s fans, and those who enjoy classic radio mystery stories.\nOne of the Best Series of the 1970s Comes to DVD\nLittle Women\nMeredith Baxter Birney  (Actor),     Susan Dey  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['The classic LITTLE WOMEN, which is based on the novel by Louisa May Alcott, follows four sisters who live in New England during the Civil War. With their father absent, the girls must learn to fend for themselves. This two-part presentation features appea']\n{'Genre': 'Drama, Family, Romance', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Robert Young, Dorothy McGuire, William Schallert, William Shatner, Greer Garson, David Lowell Rich, Eve Plumb, Meredith Baxter Birney, Cliff Potts, Richard Gilliland, Ann Dusenberry, Susan DeyRobert Young, Dorothy McGuire, William Schallert, William Shatner, Greer Garson, David Lowell Rich, Eve Plumb, Meredith Baxter Birney, Cliff Potts, Richard Gilliland, Ann Dusenberry, Susan Dey   See more', 'Language': 'Unqualified', 'Runtime': '3 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Item model number': '3344507', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '3 hours and 14 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Meredith Baxter Birney, Susan Dey, Ann Dusenberry, Eve Plumb, Dorothy McGuire', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nI remember thinking when this aired that it was not a bad version, although I've never been satisfied with any of the adaptations. This 1970s version is clearly 70s vintage: the look, the music, the way the girls wander about, just like in LITTLE HOUSE ON THE PRAIRIE, with their hair streaming down their backs instead of in braids, or braided and coiled when older. (Speaking of hair, why does Jo's never grow back?) Events that happen singly in the book are doubled up in the miniseries, so that Jo's story publication, Marmee's letter saying Father is better, and Beth getting sick all happen pell-mell in a single scene; Meg's \"dressing up\" happens at the same party where Jo and Laurie first meet, and the news of Mr. March's illness arrives in summer rather than November, smack in the middle of Laurie's picnic, where Amy is suddenly old enough to be flirting with Fred Vaughn.<br /><br />Little things are irritating: the March girls clearly wear 1970s rubber boots, lines are read in a stilted manner in many scenes, the house is much too upscale for the impoverished Marches. The opening 40 minutes of the story seem to take place in a couple of days immediately after Christmas, then suddenly it's two years later. The Hummels are added in as an afterthought just before Marmee leaves for Washington, DC, as the whole famous Yuletide opening of the story where the girls forgo their own gifts to buy ones for Marmee and then give up their breakfast for the poor Hummels, is completely omitted. The overwrought minute or two where everyone thinks Beth has died is a froth of tears and overly loud, irritatingly plaintive violin music. (And where the heck did Amy come from? Wasn't she sequestered at Aunt March's house?)<br /><br />Worst of all is Ann Dusenberry, who begins to improve as Amy ages, but her portrayal of young Amy is startlingly bad. To play spoilt Amy in the earliest part of the story, she seems to spend almost every scene with her upper lip humped up like a disturbed rabbit. The literary Amy is a pest at that point, but Dusenberry turns her into a witch. You almost wish Jo and Laurie had let her drown. The later adult Amy returns to being very unpleasant. I couldn't put my finger on why she was so unlikeable in the first part, but by the second part I understood. In the book, Amy has her moments of brattiness, as when she burns Jo's manuscript, and silliness, when she uses ridiculous vocabulary to make herself sound older, but she is determined to be a well-bred lady and, as she ages, tries to cultivate herself that way, to be gracious and polite, with a soft voice and a pleasant manner. Dusenberry's Amy is, in Benjamin Franklin's words in 1776, a Boston fishwife. Her diction is often coarse and loud. And she's still doing that rabbit thing with her upper lip.<br /><br />The brightest spot in the story is Greer Garson as Aunt March. She plays the imperious old woman for all she's worth. Dorothy Maguire is a perfect Marmee and Robert Young is very charming as Mr.  Laurence. Susan Dey really did do a nice job as Jo, and in this version they did show the affecting sequence where Jo takes Beth to the seashore, which played very well.<br /><br />Many people love this version because they show some of the scenes that are usually left out of the other films for time, like the seashore sequence. This version also includes the episode where Meg pays $50 for silk material for a dress and then sends it back so John can buy a new overcoat. In the book, this is part of a longer sequence where Meg has to adhere to a budget and complains to John about being poor, but all that is omitted, so the dress/overcoat sequence has little meaning. In another interesting sequence not in the book, Mr. March and John Brooke salute the birth of the twins with wine. Except it's very clear in the book that the Marches are teetotalers. Jo even makes Laurie promise not to drink at college.<br /><br />William Shatner's Professor Bhaer is...interesting. He has the fun inherent in the part, and thankfully doesn't take Jo to the opera or kiss her on the neck; instead he tries to teach her German, as in the book (if later on they did climb trees together). But again, no one ever casts Bhaer as he is written, in his late thirties, already greying, stout, and with a beard, except for the very static and stagy British television production from the 1970s.<br /><br />Amy and Laurie's romance is unbelievably truncated. Jo refuses Laurie's proposal, he goes to Europe. Amy finds out he is there and asks him to visit. He turns up, drunk, in her room the night before she is leaving, and she tells him off for his condition. He goes to Vienna to study music, realizes he hasn't the talent to be a composer, and returns to Amy when he learns of Beth's death. All of a sudden he is in love with her, she with him, with no chance to be together and fall in love as they do in the book, and they get married.<br /><br />The miniseries moves full-circle and, as it concludes, once again it is Christmas. The \"under the umbrella\" scene with Jo and Professor Bhaer thus not only occurs at Christmas, but it quits raining and of course starts snowing (since it snows everywhere on television on Christmas Eve). Another clich&eacute; heard from.<br /><br />There is one really odd thing about this version. In the book, two of Mr. Laurence's children are mentioned. One is a girl who died when she was young. It is her piano that is given to Beth. The other child is Laurie's father, who chafed under his father's strict ways, went to Italy, and married an Italian concert pianist. This is why he objected to Laurie's piano-playing. In this mini-series version, the daughter who loved music and died is combined as a character with Laurie's mother, who married an Italian concert pianist. Laurie tells Jo that his real name is \"Theodore Laurence Cerrito\" (I think that was the name) and his grandfather won't let him use it. Very strange!<br /><br />Good points: Dey and the older members of the cast, scenes from the book not in other productions.<br /><br />Bad points: 1970s production values, Ann Dusenberry, yet another ho-hum Laurie.<br /><br />Summary: some very touching moments, but definitely not the best LITTLE WOMEN ever made.\nA Version from--and For--the 1970s\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Scheerer'], 'Producers': ['Perry Lafferty'], 'Starring': ['Danny Kaye', 'Mary Tyler Moore', 'Nat King Cole'], 'Studio': ['Inception Media Group']}\nThey don't make 'em like this anymore. An episode of Kaye's variety show broadcast on Christmas Day 1963 (remember when TV networks had first-run programming on Christmas Eve and Christmas Day?), a year when some levity was very much needed in the US (President Kennedy had been assassinated only one month earlier). Great to see Mary Tyler Moore and Nat \"King\" Cole, the latter singing his classic version of \"The Christmas Song.\" Later, watch young Harvey Korman and Jamie Farr open a spoof of comic operettas.<br /><br />I've seen some reviewers complaining about these older programs because not all of the music is Christmas-oriented. Surprise! That's how it was done in those days--about half the show would be Christmas songs and the other half would be current hits or popular songs. The guest star might sing his or her latest hit, and there would be skits not having to do with Christmas. I saw one review that complained and then said to watch the Andy Williams special. The special you see on DVD is a compilation of several years of shows. The actual Andy Williams Christmas specials would have had non-Christmas content, too.<br /><br />This is the real thing: no fancy graphics, no frenetic editing, just talented people performing in a low-key, friendly manner. Enjoy!\nThey don't make 'em like this anymore\nFamily Classics: Addie and the King of Hearts / The Easter Promise\nJoseph Hardy  (Director),     Paul Bogart  (Director),     Jason Robards Jr.  (Actor),     Lisa Lucas  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Enjoy two inspiring tales of tradition with this Mills family double feature! Addie Mills (Lisa Lucas) is a spunky and sharp-minded young girl who takes life’s lessons to heart and enjoys adding fun and variety to the lives of her stern and serious father James (Jason Robards) and her quirky Grandma (Mildred Natwick). In The Easter Promise, Addie befriends a famous but down-on-her-luck actress (played by Jean Simmons) and encourages her to give back to the community by hosting the school fashion show and having dinner with one of her old schoolmates – James! Love is in the air in Addie and the King of Hearts, as Addie copes with her father’s new girlfriend and develops a crush of her own during the Valentine’s Day dance. With each heartwarming adventure in this Dove Family-Approved collection, Addie, James, and Grandma Mills remind us of the importance of kindness, community, and family.']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Color, Multiple Formats, Full Screen, NTSC', 'Contributor': 'Mildred Natwick, Michael Morgan, Paul Bogart, Franny Michael, Richard Hatch, Elizabeth Wilson, Jason Robards Jr., Joseph Hardy, Diane Ladd, Lisa Lucas, Lori Ann Rutherford, Hope Alexander Willis, Jean Simmons, Vicki Schreck, Christina HartMildred Natwick, Michael Morgan, Paul Bogart, Franny Michael, Richard Hatch, Elizabeth Wilson, Jason Robards Jr., Joseph Hardy, Diane Ladd, Lisa Lucas, Lori Ann Rutherford, Hope Alexander Willis, Jean Simmons, Vicki Schreck, Christina Hart   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '31571257', 'Director': 'Joseph Hardy, Paul Bogart', 'Media Format': 'Color, Multiple Formats, Full Screen, NTSC', 'Run time': '2 hours and 4 minutes', 'Release date': 'February 10, 2015', 'Actors': 'Jason Robards Jr., Lisa Lucas, Mildred Natwick, Diane Ladd, Jean Simmons', 'Studio': 'Paramount', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI am giving this set a mixed review because however much I love the character of Addie Mills, the third and fourth specials are not as good as the first two. Please do not let that stop you from buying them, because anything about Addie is better than no Addie at all!<br /><br />In THE EASTER PROMISE, twelve year old Addie Mills is thrilled to learn that Constance Payne, a famous stage actress, is returning to Clear River to sell her late mother's house and is eager to meet her because of the glamour associated with her being on stage. She and her friends take the woman flowers to welcome her home. But Constance Payne has problems that the girls don't understand and Addie will have the friendship tested by the end of the story. I do love the sleepover scene with Addie and her friends (and the subsequent scenes when they are decorating the Easter eggs and teasing Terry, and the humorous parts of the Style Show), and also the scene on the worksite where Addie brings her dad the cake and lemonade and they talk about Constance's father.<br /><br />One of the bigger disappointments is the setting itself. In the first two specials CBS also allowed the story to be filmed &#34;on location,&#34; if not in Nebraska, at least on the prairies, the Canadian prairies, and in a little town in Ontario, Uxbridge, that looked a lot like Nebraska must have looked back then. You didn't have the LITTLE HOUSE ON THE PRAIRIE effect with &#34;Minnesota&#34; looking like the southern California hills and it lent much to the verisimilitude of the story. The exteriors for THE EASTER PROMISE are filmed on a stage set and it shows very, very badly on videotape, especially a scene where Addie arrives when James and Grandma are working in the vegetable garden and also in the scenes where Constance's house is visited. The situation which has been so carefully crafted previously is jolted by the glaring sets and for me, at least, the illusion was ruined. One scene has Addie visiting James on the job and he is using his crane near a wooden bridge that has been used in so many television shows that it sticks out like that proverbial sore thumb in the background.<br /><br />They couldn't even be bothered to try to duplicate the &#34;Clear River&#34; scenes of the first two stories and it diverges wildly from Addie's original opening narration to HOUSE WITHOUT A CHRISTMAS TREE where she declares that Clear River is so small there are no buildings over three stories tall and the town has no traffic light because none is needed. The closing scene clearly shows a downtown that is a lot larger (and taller) than Addie described.<br /><br />Every time I watch ADDIE AND THE KING OF HEARTS I am disappointed that the series of stories ended on such a low note. Everything in the story is by-the-numbers: Addie's jealousy, her crush, James' involvement with a woman totally unlike his first wife, the handsome teacher who encourages Addie but turns out to be engaged to be married. No one seems to have his/her heart in the performance, especially Jason Robards, who was so magnificent as the grieving man of the first story. This touches on a lot of emotional issues with Addie reacting to her dad paying attention to another woman after thirteen years and her very real and eventually hurtful crush on her substitute teacher, but none of the emotions seem real. Diane Ladd's performance is the most lively, but slightly overdone. I wish they had used the story the way the book arranged it--except for including Irene's story of her past from the television version, which was superior to the book version, and also the corsage scene from the television version--and recast the roles of Cora Sue and Billy Wild (especially since Addie seemed at a loss without a best friend to bounce her emotions off). And the sets look cheap; if you notice, the door to the living room is always half-closed because they never rebuilt the actual room, and even the school cloakroom lacks the richness of the one in the first story. Not the best send-off for an otherwise excellent set of films.\nMore Addie Tales\n23 Paces to Baker Street [Blu-ray]\nVan Johnson  (Actor),     Vera Miles  (Actor),     Henry Hathaway  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Van Johnson, Vera Miles. A thrilling mystery unfolds when a blind playwright overhears a conversation about a plot to kidnap a young child. The problem is no one believes him and when authorities dismiss his story, he decides to unravel the mystery by himself with help from his fiancé and his butler. Directed by Henry Hathaway. 1956/color/102 min/NR/fullscreen.']\n{'Genre': 'Mystery & Suspense', 'Format': 'Anamorphic, NTSC, Widescreen', 'Contributor': 'Van Johnson, Cecil Parker, Estelle Winwood, Patricia Laffan, Vera Miles, Henry Hathaway', 'Language': 'English', 'Runtime': '1 hour and 46 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '43449519', 'Director': 'Henry Hathaway', 'Media Format': 'Anamorphic, NTSC, Widescreen', 'Run time': '1 hour and 46 minutes', 'Release date': 'February 14, 2017', 'Actors': 'Van Johnson, Vera Miles, Cecil Parker, Patricia Laffan, Estelle Winwood', 'Subtitles': 'English', 'Studio': 'Kl Studio Classics', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI'm sorry that Amazon does not separate out different media releases of films and television shows. Most of the low reviews you see for this film are due to 20th Century Fox's previous releases of this beautifully shot Cinemascope movie in pan-and-scan unrestored versions. Please note that this review is for the February 2017 Blu-Ray full HD release.<br /><br />Taking place in 1950s England, the story concerns Philip Hannon, an embittered playwright living in a London flat and completing minor revisions to his hit US play for the British stage. Hannon was blinded some time before the film begins (the details are never specified), but although he gets around quite well with the help of a cane and certain other aids for the blind (a chiming watch, a tape recorder to dictate his plays), he has let the accident change him and break up his romance with his secretary Jean Lennox. For day-to-day ordinary tasks he has hired a factotum, Bob Matthews, an older man who silently accepts Hannon's bad attitude as &#34;part of the job.&#34; One day Jean visits; while Hannon initially seems interested, he is eventually dismissive of her because he's no longer a &#34;whole man.&#34; To walk off his frustration, he goes to a nearby pub, and while nursing a drink overhears some, but not all, of a conversation from the Ladies' Bar behind him, and what he hears galvanizes him enough for him to call the police: it sounds as if the man and the woman in the next room are planning to kidnap a child!<br /><br />Since the police listen to his recreation of the conversation with little interest, Hannon begins to inquire into the possible crime himself, with Jean and a reluctant Bob as his allies, using the overheard conversation and the scent of a distinctive perfume used by the woman at the pub to guide him. What the police refuse to believe, however, really is going to take place, and by inquiring Hannon sets himself up for a great deal of danger.<br /><br />This is not an action movie, but initially slow-moving and then more desperate as time progresses, like an early Hitchcock film or a British-made Agatha Christie presentation, with several instances of great peril to certain characters. The exteriors were filmed in London to add verisimilitude to the story and the Cinemascope lends itself to beautiful vistas of the Thames from Hannon's windows and the spooky lengths of fog-shrouded streets. The starring cast fits their roles well: Van Johnson as the moody Hannon, who comes alive when he realizes a blind man might be able to make a difference; Vera Miles as steadfast Jean, who throws herself into the investigation, happy to see that Hannon has found a purpose; and Cecil Parker as pragmatic Bob, who has an absolutely wonderful comic scene where he returns dripping wet from following a suspect and proceeds to give Hannon his report while pointedly commenting on the drenching he received during the surveillance.<br /><br />I can't comment in audiophile terms about the soundtrack; it's Dolby 5.1, I believe, and to these old ears sounds crisp and clean, if perhaps the opening theme being a bit loud. The picture is GORGEOUS; I doubt it looked that good in some of the old-style movie theaters which hurriedly converted their screens for widescreen presentation in the 1950s. The color is so bright and crisp that I made out details in scenes I'd never noticed before and the panorama shots of the Thames are beautiful.<br /><br />There is a commentary track by film historian Kent Jones, who undoubtedly knows his Henry Hathaway films and other classic movies as well; many interesting facts are presented, but his presentation is very dry, and his voice rather soft. While I'm glad it was included, I probably won't listen to it again. Pity that some remarks could not have been gleaned from Ms. Miles, but as she is in her late 80s, I have no idea if her health would have even allowed her to do so.<br /><br />If you are a fan of this film and have never seen it in widescreen, you are indeed in for a treat! This is the release we've all been dreaming of. Indeed, the only bad thing about it is the cover, which portrays a scene that never happens in the movie: no woman in a low-cut red gown is ever grabbed from behind!\nThe Release We Dreamed Of!\n1776 [Blu-ray]\nWilliam Daniels  (Actor),     Howard DaSilva  (Actor),     Peter Hunt  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Musicals\n['1776', 'is a musical celebration of the founding of the United States of America based on the award-winning Broadway production. The story centers around familiar historical characters as they organize a movement for independence from Mother England: the tough and unyielding John Adams (William Daniels); the charming and pragmatic Benjamin Franklin (Howard Da Silva); the brilliant Thomas Jefferson (Ken Howard) who is chosen to write the Declaration of Independence even as he longs for the company of his new bride Martha (Blythe Danner); and the rest of the Continental Congress. All events lead up to that most significant date of July 4, 1776 when the Declaration was signed. Now fully restored for its high definition debut on Blu-ray,', '1776', 'looks and sounds better than ever.', 'Exclusive Blu-ray Bonus Features Include:', '§ All-new commentary with director Peter H. Hunt, William Daniels, Ken Howard, and Peter Stone', '§ Extended cut of the film via seamless branching', '§ Deleted and alternate scenes with filmmaker commentary', '§ Four never-before-seen screen tests including archival footage', '§ Original theatrical teaser and trailer']\n{'Digital Copy Expiration Date': 'December 31, 2018', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': '33951303', 'Director': 'Peter Hunt', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 45 minutes', 'Release date': 'June 2, 2015', 'Actors': 'William Daniels, Howard DaSilva, Ken Howard, Blythe Danner', 'Subtitles': 'English, French', 'Producers': 'Jack L. Warner', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of my husband's and my favorite movies, and the moment we saw it available on Blu-Ray we ordered it. We had the DVD of the Director's Cut, but this has even more restored scenes (William Daniels' &#34;Philadelphia&#34; song, for instance, is completely restored, where it wasn't in the DVD version) and the picture and sound is outstanding.<br /><br />For the uninitiated, this is a musical look at the signing of the Declaration of Independence. Yes, many liberties are taken (Martha Jefferson did not come to Philadelphia, Richard Henry Lee was not a grinning buffoon), but the idea was to show the public that the signers of the Declaration were not 2-dimensional gods who signed a historic piece of paper, but just ordinary men who loved, lusted, ate to excess, argued, philosophized, and debated. There are some rousing good songs like &#34;The Lees of Old Virginia&#34; and &#34;The Egg,&#34; the sentimental and prophetic &#34;He Plays the Violin,&#34; and the showstopper &#34;Molasses to Rum to Slaves&#34; which chillingly reminds us of the dreadful &#34;Triangle Trade&#34; in slaves. William Daniels, Howard da Silva, and the rest of the cast give bravura performances.<br /><br />An Independence Day staple at our home!\nFinally on Blu-Ray",
  "profile": "The user continues to be a devoted admirer of classic television comedies and mysteries from the 1960s and 1970s, showcasing a strong appreciation for intricate character dynamics and compelling narratives. Recently, they've expressed enthusiasm for vintage family dramas that blend warmth, humor, and historical authenticity, underscoring their commitment to storytelling integrity. Their critical viewpoint on adaptations of literary works highlights the importance they place on production quality and narrative coherence. \n\nTheir latest interaction reveals a deep appreciation for historical musicals, with a focus on how character portrayal and historical context are woven into the narrative. This aligns with their established preference for emotional resonance and ensemble casts that demonstrate genuine artistry. In their recent review, they provided an insightful critique of a well-known musical, praising its restored elements and the performances of its cast, while acknowledging the historical liberties taken in its storytelling. This indicates their continued engagement with nostalgia through a discerning lens, recognizing flaws while celebrating artistry in classic works. Overall, the user's profile illustrates a profound dedication to classic storytelling, intertwined with an informed and critical engagement with both vintage and contemporary interpretations of media narratives.",
  "metrics": {
    "rouge1_f": 0.030366621404764843,
    "rouge2_f": 0.004938881343375726,
    "rougeL_f": 0.01876311566473275,
    "meteor": 0.008442217709896706,
    "bleu1": 3.428338204393406e-21,
    "bleu2": 1.499807727668475e-21,
    "bleu3": 6.760261364110029e-22,
    "bleu4": 1.7088568103680197e-22,
    "bertscore_precision": 0.329647421836853,
    "bertscore_recall": 0.5352392792701721,
    "bertscore_f1": 0.40800777077674866
  }
}