{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/06/27\nAverage Rating: 3.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jake Oelman'], 'Producers': ['Ford Oelman', 'Jake Oelman', 'Jake Limbert'], 'Starring': ['Joe Mazzello', 'Michelle Forbes', 'Josh Fadem'], 'Studio': ['Kinonation']}\nReview Text: This movie went nowhere really really fast.  The main character's personality is so stiff and dry is not even funny.  I was fooled  after having seen the preview.  A real disappointment.\nReview Title: The main character's personality is so stiff and dry is not even funny. I was fooled after having seen the preview\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Sebastian Borensztein'], 'Producers': ['Unavailable'], 'Starring': ['Ricardo Darin', 'Muriel Santa Ana', 'Ignacio Huang'], 'Studio': ['FilmRise']}\nA gem!\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Spierig', 'Peter Spierig'], 'Producers': ['Patrick McDonald', 'Tim McGahan'], 'Starring': ['Ethan Hawke', 'Sarah Snook', 'Noah Taylor'], 'Studio': ['Vertical Entertainment']}\nDamn!  That's all I was able to say just right now as I finished watching.  Great take in cause/effect, choices, and indeed the question if we are pre-destined to a fate. I have to say, soon after the film starts there's like 45minutes or so that can feel like an eternity as it's very slow while a very long conversation b/w the characters takes place, but it sets up the rest beautifully.  Totally worth it.  Ethan Hawke gave a great performance.  Hats off to him.\nHats off to Ethan Hawke\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tim Bartell'], 'Producers': ['Justin Hogan', 'Cameron McIntyre', 'Tim Bartell'], 'Starring': ['Ricky Mabe', 'Jordan Monaghan', 'Conor Leslie'], 'Studio': ['Indie Rights']}\n1 1/2 stars at best.  It showed a lot of promise within the first few minutes but once it gets into the story line, it absolutely tanks.  Gotta wonder about who wrote those 5 stars reviews, that coincidentally were all written within a day or two of each other.\nTotally tanks\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jake Oelman'], 'Producers': ['Ford Oelman', 'Jake Oelman', 'Jake Limbert'], 'Starring': ['Joe Mazzello', 'Michelle Forbes', 'Josh Fadem'], 'Studio': ['Kinonation']}\nThis movie went nowhere really really fast.  The main character's personality is so stiff and dry is not even funny.  I was fooled  after having seen the preview.  A real disappointment.\nThe main character's personality is so stiff and dry is not even funny. I was fooled after having seen the preview",
  "profile": "User Profile Summary:\n\n- **Rating Tendencies:** The user maintains a high average rating of 4.6 but has recently intensified their critical perspective, as evidenced by a new purchase rated 1.0. This indicates a growing demand for compelling character development and narrative satisfaction.\n\n- **Content Preferences:** The user has a continued interest in films with mature themes, including violence and sexual content. However, the latest interaction highlights a significant dissatisfaction with narratives that fail to engage and develop their characters, suggesting a shift towards greater scrutiny of storytelling quality.\n\n- **Language Barrier:** While the user prefers content without subtitles, their willingness to engage with English subtitles shows a level of adaptability, though they still favor materials in their native language.\n\n- **Genre Affinity:** Drama and character-driven narratives remain the user's primary interests, yet recent frustrations with narrative execution reflect a heightened focus on storyline coherence and character depth.\n\n- **Director Influence:** The user's respect for filmmakers is increasingly contingent upon strong scripts and effective narratives, as demonstrated by their impactful critiques.\n\n- **Positive Attitude:** The user retains enthusiasm for powerful storytelling but now approaches reviews with a more analytical lens, emphasizing critical engagement over passive enjoyment.\n\nOverall, the user is evolving into a more discerning viewer, prioritizing high-quality storytelling and character development while expecting narratives to meet their initial promise.",
  "metrics": {
    "rouge1_f": 0.2065217391304348,
    "rouge2_f": 0.01090909090909091,
    "rougeL_f": 0.10507246376811594,
    "meteor": 0.07749077490774908,
    "bleu1": 0.08297337236057592,
    "bleu2": 0.003187748808525157,
    "bleu3": 0.001076963664796217,
    "bleu4": 0.0006265596188612301,
    "bertscore_precision": 0.344355046749115,
    "bertscore_recall": 0.39840638637542725,
    "bertscore_f1": 0.3694140315055847
  }
}