{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Life and Times of Judge Roy Bean\nReview Date: 2020/06/06\nStore: John Huston  (Director, Actor),     Paul Newman  (Actor),     Jacqueline Bisset  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Director John Huston (\"The African Queen,\" \"The Maltese Falcon\") and a powerhouse cast make magic in this tongue-in-cheek Western saga. Academy Award-winner Paul Newman (\"Nobody\\'s Fool,\" \"The Sting\") shines as the real life, self-appointed judge. All-star supporting cast includes Academy Award-nominees Anthony Perkins (\"Psycho\") and Ava Gardner (\"The Sun Also Rises\"), Jacqueline Bisset (\"Rich and Famous\"), Roddy McDowell (\"Planet of the Apes\"), Tab Hunter (\"Grease 2\"), Ned Beatty (\"Roseanne\"), and then-newcomer Victoria Principal (\"Dallas\") in her feature film debut. Written by John Milius (\"Clear and Present Danger,\" \"Apocalypse Now\").']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy, Westerns', 'Format': 'NTSC', 'Contributor': 'Victoria Principal, Jacqueline Bisset, Tab Hunter, Paul Newman, Roddy Mcdowall, Anthony Zerbe, Stacy Keach, Anthony Perkins, Ava Gardner, John HustonVictoria Principal, Jacqueline Bisset, Tab Hunter, Paul Newman, Roddy Mcdowall, Anthony Zerbe, Stacy Keach, Anthony Perkins, Ava Gardner, John Huston   See more', 'Language': 'English', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '298886', 'Director': 'John Huston', 'Media Format': 'NTSC', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 6, 2012', 'Actors': 'Paul Newman, Jacqueline Bisset, Tab Hunter, John Huston, Stacy Keach', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The package arrived early so kudos to that. Unfortunately the teeth(?) that hold the actual dvd inside the case had broken so the dvd was rolling around inside the the case and thus suffered some scratching on the playing surface. Thankfully the scratches did not affect the performance and my wife and I enjoyed ol' Paul emoting.\nReview Title: A Paul Newman golden oldie.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Sapphire Collection (Braveheart/Gladiator/Saving Private Ryan) [Blu-ray]\nMel Gibson  (Actor, Director),     Russell Crowe  (Actor),     Ridley Scott  (Director),     Steven Spielberg  (Director)    &                   1                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Three of the most critically acclaimed and influential movies of our time in one Blu-ray collection. With 15 Oscar wins between them - This is the set that should be part of everyone's collection. The Sapphire Collection includes: Gladiator, Saving Private Ryan and Braveheart.\"]\n{'Format': 'Widescreen', 'Contributor': 'Tom Hanks, Sapphire Collection, Russell Crowe, Matt Damon, Mel Gibson, Ridley Scott, Steven Spielberg, Edward BurnsTom Hanks, Sapphire Collection, Russell Crowe, Matt Damon, Mel Gibson, Ridley Scott, Steven Spielberg, Edward Burns  See more', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.5 x 5.25 x 0.25 inches; 2.4 Ounces', 'Director': 'Mel Gibson, Ridley Scott, Steven Spielberg', 'Media Format': 'Widescreen', 'Release date': 'September 11, 2012', 'Actors': 'Mel Gibson, Russell Crowe, Tom Hanks, Edward Burns, Matt Damon', 'Studio': 'Paramount'}\nThree great movies for a low price.\nGood buy for the price.\nSearchers / Wild Bunch / How the West Was Won (Triple-Feature) [Blu-ray]\nRated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['SEARCHERS, THE / WILD BUNCH, THE / HOW THE WEST WAS WON', 'The West At Its Best', ']]>']\n{'Genre': 'Westerns', 'Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Initial release date': '2012-01-03', 'Language': 'English', 'Studio': 'Studio Distribution Services', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'WHV1000261643BR', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Release date': 'January 3, 2012', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI got this for the \"Wild Bunch\", the fact that two other classic westerns were included was icing on the cake.\nGreat buy for the money.\nJudge Dredd [Blu-ray]\nSylvester Stallone  (Actor),     Diane Lane  (Actor),     Danny Cannon  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Prepare yourself for the nonstop, action-adventure thrill ride JUDGE DREDD -- exploding onto Blu-ray for the first time, featuring an all-new digital restoration with enhanced picture and sound. Academy Award(R) nominees Sylvester Stallone (Best Actor, 1976, ROCKY) and Diane Lane (Best Actress, 2002, UNFAITHFUL bring the story of a legendary comic book hero to life. In a time when all-powerful \"judges\" act with supreme authority of both the police force and legal system, Judge Dredd is the most feared law enforcer of them all. When a former judge devises a sinister plot to bring him down, Dredd with stop at nothing to even the scales of justice!']\n{'Genre': 'DREDD, SYLVESTER, STALLONE, Action/Adventure, JUDGE', 'Format': 'Multiple Formats, Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Armand Assante, Max Von Sydow, Danny Cannon, Rob Schneider, Sylvester Stallone, Diane Lane, Jurgen ProchnowArmand Assante, Max Von Sydow, Danny Cannon, Rob Schneider, Sylvester Stallone, Diane Lane, Jurgen Prochnow  See more', 'Language': 'French (Dolby Digital 5.1), English (DTS-HD High Res Audio), Spanish (Dolby Digital 2.0)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': '25524900', 'Director': 'Danny Cannon', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'September 18, 2012', 'Actors': 'Sylvester Stallone, Diane Lane, Armand Assante, Jurgen Prochnow, Rob Schneider', 'Subtitles': 'French, Spanish, English', 'Studio': 'HOLLYWOOD PICTURES', 'Number of discs': '1'}\nWhat can I say? It's Stallone...with Armand Assante, Joan Chen (hubba, hubba) and Rob Schneider, et al. For me, the scene where Schneider is mimicking Stallone on the way to the penitentiary-\"I am the law\", still has me rolling on the floor. Cheap thrills, but, I like it.\nThis one was a \"guilty\" pleasure for me.\nDemolition Man (BD) [Blu-ray]\nSylvester Stallone  (Actor),     Wesley Snipes  (Actor),     Marco Brambilla  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Sylvester Stallone and Wesley Snipes go at it amid a dazzling cyber-future in this explosive hit. In 2032 archcriminal Simon Phoenix (Snipes) awakens from a 35-year deep freeze in CryoPrision to find a serene, non-violent Los Angeles ready for the taking. Unable to deal with Phoenix’s brutal 1990s style, officials seek an old-fashioned cop to fight old-fashioned crime. They revive Sgt. John Spartan (Stallone), unjustly serving a CryoPrison sentence because of his last encounter with Phoenix. Sandra Bullock, Benjamin Bratt and Denis Leary also play rough and tough in this “terrific mix of action and humor” (Joel Siegel, Good Morning America/ABC-TV).']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Contributor': 'Faye Schwab, Marco Brambilla, Robert Reneau, Grand Bush, Howard Kazanjian, Denis Leary, Sandra Bullock, Glenn Shadix, Joel Silver, Daniel Waters, Benjamin Bratt, Wesley Snipes, Sylvester Stallone, Peter M. Lenkov, Brit EklandSteven Bratter, Michael Levy, Bob Gunton, Nigel HawthorneFaye Schwab, Marco Brambilla, Robert Reneau, Grand Bush, Howard Kazanjian, Denis Leary, Sandra Bullock, Glenn Shadix, Joel Silver, Daniel Waters, Benjamin Bratt, Wesley Snipes, Sylvester Stallone, Peter M. Lenkov, Brit EklandSteven Bratter, Michael Levy, Bob Gunton,…   See more', 'Initial release date': '2011-08-16', 'Language': 'English (Dolby Digital 5.1 ES Matrix)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'WHV1000195635BR', 'Director': 'Marco Brambilla', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'August 16, 2011', 'Actors': 'Sylvester Stallone, Wesley Snipes, Sandra Bullock, Nigel Hawthorne, Benjamin Bratt', 'Subtitles': 'Spanish, French, English', 'Producers': 'Brit EklandSteven Bratter, Joel Silver, Faye Schwab, Michael Levy, Howard Kazanjian', 'Studio': 'Studio Distribution Services', 'Writers': 'Daniel Waters, Robert Reneau, Peter M. Lenkov', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSly in another great escapist flick. Mr. Snipes, Ms. Bullock and Mr. Bratt ain't bad either.\nAhhh! Stallone again.\nSoylent Green [Blu-ray]\nCharlton Heston  (Actor),     Edward G. Robinson  (Actor),     Richard Fleischer  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Science Fiction & Fantasy, Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Blu-ray, Dolby, NTSC, AC-3, Subtitled, Widescreen', 'Contributor': 'Charlton Heston, Edward G. Robinson, Richard Fleischer', 'Initial release date': '2011-03-29', 'Language': 'English'}\nI love this movie as an old man. We are not yet at the end times as portrayed in the movie, but, we are rapidly approaching the point of no return.\nI loved this movie as a young man.\nHannibal Rising [Blu-ray]\nGaspard Ulliel  (Actor),     Rhys Ifans  (Actor),     Peter Webber  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Import Blu-ray/Region A pressing. Directed by Peter Webber. Hannibal Rising is the terrifying Silence of the Lambs prequel that reveals the history of the infamous Hannibal and how he came to be a cannibalistic murderer. After young Hannibal is forced to watch his little sister, Mischa, devoured by starving soldiers in his homeland Lithuania, Hannibal vows to avenge his sister's death by slaying those who committed not only war crimes against the Lecters, but also against other families during WW II. In detailing Hannibal's revenge plan, the film investigates the psychological implications of witnessing cannibalism to justify Hannibal's insatiable appetite for human flesh.\", 'Review', \"Though Hannibal Rising's Lecter (Gaspard Ulliel) is a pussycat compared to Anthony Hopkins in Silence of the Lambs, this sequel's story of revenge is grizzly enough to satisfy lovers of Thomas Harris's epic tale. After young Hannibal (Aaron Thomas) is forced to watch his little sister, Mischa (Helena Lia Tachovska), devoured by starving soldiers in his homeland Lithuania, Hannibal vows to avenge his sister's death by slaying those who committed not only war crimes against the Lecters, but also against other families during WW II. In detailing Hannibal's revenge plan, the film investigates the psychological implications of witnessing cannibalism to justify Hannibal's insatiable appetite for human flesh. The most interesting aspect of Hannibal Rising its analytical connections drawn between Hannibal's childhood traumas and his murderous adult obsessions is also the film's weak point. The links oversimplify Lecter's complex character. For example, though titillating to see flashbacks of Lecter's sister hacked up and boiled while Lecter visits a Parisian meat market, the reference is too obvious. One learns why he excels in his medical school classes dissecting cadavers, and we're given explicit explanation for why he slices off and eats his victims' cheeks. The story only complicates when Hannibal interacts with his sexy Aunt, Lady Murasaki (Gong Li). When Murasaki educates him in the art of beheading, the viewer sees Hannibal's sword fetish as a manifestation of physical lust. --Trinie Dalton --Amazon.com\"]\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Blu-ray, Import, NTSC, Widescreen', 'Contributor': 'Gaspard Ulliel, Rhys Ifans, Aaran Thomas, Peter Webber, Helena-Lia Tachovská, Li Gong', 'Language': 'English, French', 'Runtime': '2 hours and 1 minute', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.5 x 5.25 x 0.25 inches; 2.88 Ounces', 'Director': 'Peter Webber', 'Media Format': 'Multiple Formats, Blu-ray, Import, NTSC, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'April 6, 2010', 'Actors': 'Gaspard Ulliel, Rhys Ifans, Li Gong, Aaran Thomas, Helena-Lia Tachovská', 'Subtitles': 'English', 'Studio': 'Alliance', 'Number of discs': '1'}\nSadly, the standard definition dvd has a few more additional minutes than the blu ray. So, to me anyway, the blu ray is lacking.\nYoung Hannibal in blu ray.\nTerminator 2: Judgement Day 4K Ultra Hd 4K UHD\nArnold Schwarzenegger  (Actor),     Linda Hamilton  (Actor),     James Cameron  (Director, Producer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"The action epic that revolutionized filmmaking forever comes out on amazing 4K ultra HD for the first time. Arnold Schwarzenegger returns as the Terminator in this explosive action adventure spectacle. Now he's one of the good guys, sent back in time to protect John Connor, the boy destined to lead the freedom fighters of the future. Linda Hamilton reprises her role as Sarah Connor, John's mother, a quintessential survivor who has been institutionalized for her warning of the nuclear holocaust she knows is inevitable. Together, the threesome must find a way to stop the ultimate enemy: The T 1000, the most lethal terminator ever created. Co-written, produced, and directed by James Cameron (the terminator, aliens, titanic), this visual tour de force is also a touching human story of survival. ;Special Features:Deleted scenes with audio commentary3 versions of the film2 commentaries and more --Lionsgate --Lionsgate.\", 'Review', 'Special Features:Deleted scenes with audio commentary3 versions of the film2 commentaries and more --Lionsgate --Lionsgate']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Item model number': 'B074486NBN', 'Director': 'James Cameron', 'Media Format': '4K', 'Run time': '2 hours and 32 minutes', 'Release date': 'December 26, 2017', 'Actors': 'Arnold Schwarzenegger, Linda Hamilton, Edward Furlong, Robert Patrick', 'Subtitles': 'French, Spanish', 'Producers': 'James Cameron', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\n\"Ahnold\" in 4K no less.\nOldie, but a goodie at a great price.\nThe Wedding Singer (Totally Awesome Edition) [Blu-ray]\nFrank Coraci  (Director),     Adam Sandler  (Actor),     Drew Barrymore  (Actor)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Wedding Singer, The: Totally Awesome Edition (BD)', 'Robbie works the crowd. Julia works the floor. He (Adam Sandler) is a wedding singer, able to charm even the most reluctant Aunt Tilly into a dance. She (Drew Barrymore) is a waitress at parties where Robbie sings. Both are involved with others. Both are right for each other. Enjoy while Cupid works this out. The Wedding Singer has its heart on its sleeve and a goofy charm everywhere that includes its throwback look at the styles and sounds of the 80s. But a romance and a movie like this is made to last.', ']]>']\n{'Genre': 'Comedy/Romantic Comedies', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more', 'Contributor': 'Jon Lovitz, Billy Idol, Steve Buscemi, Ellen Albertini Dow, Christine Taylor, Christina Pickles, Richard Brener, Alexis Arquette, Allen Covert, Matthew Glave, Kevin Nealon, Adam Sandler, Sandy Wernick, Jack Giarraputo, Drew Barrymore, Angela Featherstone, Brad Grey, Tim Herlihy, Frank Coraci, Robert SimondsJon Lovitz, Billy Idol, Steve Buscemi, Ellen Albertini Dow, Christine Taylor, Christina Pickles, Richard Brener, Alexis Arquette, Allen Covert, Matthew Glave, Kevin Nealon, Adam Sandler, Sandy Wernick, Jack Giarraputo, Drew Barrymore, Angela Featherstone, Brad Grey, Tim Her…  See more', 'Initial release date': '2009-04-07', 'Language': 'English', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.3 inches; 0.01 Ounces', 'Item model number': '794043128202', 'Director': 'Frank Coraci', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Adam Sandler, Drew Barrymore, Christine Taylor, Allen Covert, Matthew Glave', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Simonds, Brad Grey, Sandy Wernick, Jack Giarraputo, Richard Brener', 'Studio': 'Studio Distribution Services', 'Writers': 'Tim Herlihy', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was a Christmas present for my daughter. Her copy was \"loaned\" out and never came back. Bet she doesn't let this one go.\nFor my daughter.\nAtomic Blonde\nCharlize Theron  (Actor, Producer),     James McAvoy  (Actor),     David Leitch  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"Oscar®-winner Charlize Theron stars as elite MI6's most lethal assassin and the crown jewel of her Majesty's secret intelligence service, Lorraine Broughton. When she's sent on a covert mission into Cold War Berlin, she must use all of the spycraft, sensuality and savagery she has to stay alive in the ticking time bomb of a city simmering with revolution and double-crossing hives of traitors. Broughton must navigate her way through a deadly game of spies to recover a priceless dossier while fighting ferocious killers along the way in this breakneck action-thriller from director David Leitch (John Wick).\"]\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.51 x 5.39 x 6.77 inches; 3.36 Ounces', 'Director': 'David Leitch', 'Media Format': '4K', 'Run time': '1 hour and 55 minutes', 'Release date': 'November 14, 2017', 'Actors': 'Charlize Theron, James McAvoy, John Goodman, Til Schweiger, Eddie Marsan', 'Subtitles': 'Portuguese, Dutch, French, Spanish', 'Producers': 'Eric Gitter, Peter Schwerin, Kelly McCormick, Charlize Theron, A.J. Dix', 'Language': 'Portuguese (DTS 5.1), French (DTS 5.1), French Canadian (DTS 5.1), Spanish (DTS 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Kurt Johnstad', 'Country of Origin': 'USA', 'Number of discs': '2'}\nMs. Theron is amazing in this spy movie. Great movie for the price.\nGuilty pleasure for me.\nStardust\nMichelle Pfeiffer  (Actor),     Charlie Cox  (Actor),     Matthew Vaughn  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Based on Neil Gaiman's novel, this fantasy follows young Tristan (Charlie Cox) as he travels to a wondrous land to retrieve a fallen star. After discovering that the star has transformed into the beautiful Yvaine (Claire Danes), Tristan must contend with some witches and would-be kings seeking to possess her magic, while he meets such rogues as the pirate Captain Shakespeare (Robert de Niro). With Michelle Pfeiffer, Peter O'Toole, Ricky Gervais\"]\n{'Genre': 'Kids & Family, Action & Adventure', 'Format': 'Subtitled', 'Contributor': 'Claire Danes, Robert De Niro, Michelle Pfeiffer, Sienna Miller, Charlie Cox, Matthew Vaughn', 'Language': 'English', 'Runtime': '2 hours and 7 minutes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'BR59191159', 'Director': 'Matthew Vaughn', 'Media Format': 'Subtitled', 'Run time': '2 hours and 7 minutes', 'Release date': 'September 12, 2017', 'Actors': 'Michelle Pfeiffer, Charlie Cox, Sienna Miller, Claire Danes, Robert De Niro', 'Dubbed': 'French, German, Italian', 'Subtitles': 'Swedish, Norwegian, German, Italian, French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nShe tried to kidnap my copy so I bought her one. Leave mine alone!\nThis was for my daughter.\nThe Shadow [Blu-ray]\nAlec Baldwin  (Actor),     Penelope Ann Miller  (Actor),     Russell Mulcahy  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Alec Baldwin stars as the legendary crimefighting superhero in The Shadow, \"A spellbinding runaway entertainment ride\" (NBC News). Donning his sweeping black cape and disguise, The Shadow takes on his most dangerous nemesis yet: the last descendant of the great Genghis Khan whose weapon of choice is an atomic bomb. With the fate of humanity hanging in the balance, they square off for a spectacular battle in a dazzling mixture of mind-blowing special effects, humor and a dose of the macabre that will hold you spellbound!', 'Bonus Content:', 'My Scenes', 'My Scenes', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'Color, Blu-ray, NTSC, Widescreen, Subtitled', 'Contributor': 'Jonathan Winters, Alec Baldwin, John Lone, Penelope Ann Miller, Peter Boyle, Willi Baer, Martin Bregman, Russell Mulcahy, Tim Curry, Michael Bregman, David Koepp, Ian McKellenJonathan Winters, Alec Baldwin, John Lone, Penelope Ann Miller, Peter Boyle, Willi Baer, Martin Bregman, Russell Mulcahy, Tim Curry, Michael Bregman, David Koepp, Ian McKellen  See more', 'Initial release date': '2013-06-04', 'Language': 'French (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.61 Ounces', 'Item model number': 'BR61112381', 'Director': 'Russell Mulcahy', 'Media Format': 'Color, Blu-ray, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 48 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Alec Baldwin, Penelope Ann Miller, John Lone, Tim Curry, Peter Boyle', 'Subtitles': 'Spanish', 'Producers': 'Martin Bregman, Willi Baer, Michael Bregman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'David Koepp', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAlex and Tim Curry in their prime.  Good stuff.\nAhhh, an oldie, but, a goodie.\nHoward the Duck [Blu-ray]\nLea Thompson  (Actor),     Jeffrey Jones  (Actor),     Willard Huyck  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['From executive producer George Lucas and the pages of Marvel Comics comes Howard the Duck, an unbelievably funny comedy about a fast-talking, cigar-chomping, beer-loving duck from a parallel universe who crashes to Earth and somehow winds up in Cleveland. As Howard attempts to return to his own planet, he falls in love with rock singer Beverly Switzler (Lea Thompson, Back to the Future) and must battle an evil invader known as the Dark Overlord. This wacky, elaborately produced spoof of life, love, comic books and horror movies featuring out-of-this-world special effects is a treasure the whole family can enjoy.', 'Bonus Content:', 'A Look Back at Howard the Duck', 'A Look Back at Howard the Duck', 'Releasing The Duck', 'Releasing The Duck', 'News Featurette', 'News Featurette', 'The Stunts of Howard the Duck', 'The Stunts of Howard the Duck', 'The Special Effects of Howard the Duck', 'The Special Effects of Howard the Duck', 'The Music of Howard the Duck', 'The Music of Howard the Duck', 'Teaser Trailers', 'Teaser Trailers', ']]>']\n{'Genre': 'Fantasy, Comedy, Science Fiction', 'Format': 'Blu-ray, NTSC, Subtitled', 'Contributor': 'Steve Sleap, Lisa Sturz, Ed Gale, Jordan Prentice, Tim Robbins, Gloria Katz, George Lucas, Tim Rose, Lea Thompson, Chip Zien, Mary Wells, Willard Huyck, Peter Baird, Jeffrey Jones, Paul GuilfoyleSteve Sleap, Lisa Sturz, Ed Gale, Jordan Prentice, Tim Robbins, Gloria Katz, George Lucas, Tim Rose, Lea Thompson, Chip Zien, Mary Wells, Willard Huyck, Peter Baird, Jeffrey Jones, Paul Guilfoyle  See more', 'Initial release date': '2016-03-08', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '35222925', 'Director': 'Willard Huyck', 'Media Format': 'Blu-ray, NTSC, Subtitled', 'Run time': '1 hour and 51 minutes', 'Release date': 'March 8, 2016', 'Actors': 'Lea Thompson, Jeffrey Jones, Tim Robbins, Ed Gale, Chip Zien', 'Producers': 'Gloria Katz, George Lucas', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Willard Huyck, Gloria Katz', 'Number of discs': '1'}\nFor my grandson. Guilty pleasure for me.\nFor my grandson.\nAlien 40th Anniversary [4K UHD]\nTom Skerritt  (Actor),     Sigourney Weaver  (Actor),     Ridley Scott  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Your Digital Copy redemption code is printed on an insert inside your Blu-ray/DVD package.A Digital Copy is a digital version of the full-length movie that you get when you own specially-marked Blu-ray/DVD discs bearing the “Digital” logo. Owning the digital version of the movie extends your enjoyment because it enables you to download or stream your movie to a computer, mobile device, internet-connected TV, Blu-ray player, or set-top box.']\n{'Genre': 'Science Fiction & Fantasy', 'Format': '4K, NTSC', 'Contributor': 'Tom Skerritt, Ridley Scott, Veronica Cartwright, Yaphet Kotto, John Hurt, Henry Dean Stanton, Sigourney Weaver, Ian HolmTom Skerritt, Ridley Scott, Veronica Cartwright, Yaphet Kotto, John Hurt, Henry Dean Stanton, Sigourney Weaver, Ian Holm  See more', 'Language': 'Italian (DTS 5.1), German (DTS 5.1), English (DTS 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Director': 'Ridley Scott', 'Media Format': '4K, NTSC', 'Release date': 'April 23, 2019', 'Actors': 'Tom Skerritt, Sigourney Weaver, Veronica Cartwright, Henry Dean Stanton, John Hurt', 'Subtitles': 'Polish, English, German', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '2'}\nGreat deal for the money.\nGreat movie at a great price.\nThe Hitchhiker's Guide to the Galaxy [Blu-ray]\nMartin Freeman  (Actor),     Stephen Fry  (Actor),     Garth Jennings  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Climb aboard for wacky, irreverent fun with THE HITCHHIKER\\'S GUIDE TO THE GALAXY on Blu-ray\\'s High Definition Disc. Based on Douglas Adams\\' best-selling novel, this \"fascinating, funny and relentlessly awe-inspiring\" (UPN-TV) movie soars to cosmic heights! Seconds before Earth is destroyed, mild-mannered Arthur Dent is whisked into space by a friendly alien in human form to search for answers to the mystery of life, the universe and everything. Experience thrilling special effects and intergalactic misadventures in astonishing 1080p, and feel the impact of every supernova with 5.1 58 kHz, 16-bit uncompressed audio. It\\'s a wild, out-of-this-world ride with Blu-ray High Definition!']\n{'Genre': 'Family Entertainment', 'Format': 'Blu-ray, Blu-ray, Color, NTSC, Subtitled', 'Contributor': 'Albie Woodington, John Malkovich, Sam Rockwell, Richard Griffiths, Garth Jennings, Kelly MacDonald, Martin Freeman, Ian McNeice, Simon Jones, Helen Mirren, Alan Rickman, Mak Wilson, Anna Chancellor, Martine Dawson, Bill Nighy, Stephen FryAlbie Woodington, John Malkovich, Sam Rockwell, Richard Griffiths, Garth Jennings, Kelly MacDonald, Martin Freeman, Ian McNeice, Simon Jones, Helen Mirren, Alan Rickman, Mak Wilson, Anna Chancellor, Martine Dawson, Bill Nighy, Stephen Fry  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Item model number': '5353000', 'Director': 'Garth Jennings', 'Media Format': 'Blu-ray, Blu-ray, Color, NTSC, Subtitled', 'Run time': '1 hour and 49 minutes', 'Release date': 'January 23, 2007', 'Actors': 'Martin Freeman, Stephen Fry, Richard Griffiths, Simon Jones, John Malkovich', 'Subtitles': 'English', 'Studio': 'Buena Vista Home Entertainment / Touchstone', 'Number of discs': '1'}\nAnother oldie but goodie.\nI'd wanted this for a while, so I finally got it.\nVenom [Blu-ray] [DVD]\nTom Hardy  (Actor),     Michelle Williams  (Actor),     Ruben Fleischer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['The evolution story of Marvelandrsquo;s most enigmatic, complex and badass character andndash; Venom! Eddie Brock (Tom Hardy) is a broken man after he loses everything including his job and fiancandeacute;e. Just when his life is at its lowest, he becomes host to an alien symbiote which results in extraordinary superpowers - transforming him into Venom. Will these powers be enough for this new lethal protector to defeat great evil forces, especially against the far stronger and more weaponized symbiote rival, Riot? A Digital Copy is a digital version of the full-length movie that you get when you own specially-marked Blu-ray/DVD discs bearing the andldquo;Digitalandrdquo; logo. Owning the digital version of the movie extends your enjoyment because it enables you to download or stream your movie to a computer, mobile device, internet-connected TV, Blu-ray player, or set-top box.']\n{'Digital Copy Expiration Date': 'December 31, 2020', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Audio Description': 'English', 'Director': 'Ruben Fleischer', 'Media Format': 'Blu-ray, DVD, Digital_copy', 'Run time': '1 hour and 52 minutes', 'Release date': 'December 18, 2018', 'Actors': 'Tom Hardy, Michelle Williams, Riz Ahmed, Scott Haze, Reid Scott', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Amy Pascal, Matt Tolmach, Avi Arad', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nMy daughter was visiting us from Baltimore last week and she put this Blu ray on. She said she didn't have it in her collection. Now she does.\nFor my daughter.\nThe Last Mimzy (Widescreen Infinifilm Edition) [DVD]\nJoely Richardson  (Actor),     Timothy Hutton  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', 'Last Mimzy, The (DVD) (WS)', 'Based on the acclaimed sci-fi short story by Lewis Padgett, The Last Mimzy tells the story of two children who discover a mysterious box containing strange devices they think are toys. As the siblings explore the unique objects, they begin to display higher and higher intelligence levels -- growing far beyond genius. Realizing that something extraordinary is happening, the children embark on a mission to save our future before time runs out and things quickly spin wildly out of control.', ']]>', 'Amazon.com', 'Comparisons with', 'E.T.', 'are inevitable, but the more modest', 'The Last Mimzy', 'is based on the classic short story \"Mimzy Were the Borogoves,\" by Lewis Padgett (a pseudonym for husband-and-wife writing team Henry Kuttner and C.L. Moore), that anticipated Steven Spielberg\\'s extraterrestrial fantasy by nearly four decades. Chris O\\'Neil and Rhiannon Leigh Wryn give winning, naturalistic performances as siblings Noah and Emma, whose lives are transformed by a box of mysterious objects they find on the beach outside the family\\'s Seattle vacation home. Among its contents is a stuffed rabbit that Emma names Mimzy and becomes quite attached. Noah and Emma are your typical outsiders. He is not good at sports, and she is interested in astronomy and plays the violin. But the objects work wonders on them. Their brainpower increases exponentially, Noah is able to drive a golf ball hundreds of yards, and Emma begins to communicate telepathically with Mimzy, who reveals his true identity and purpose. Rainn Wilson of', 'The Office', 'displays an off-center charm as Mr. White, Noah\\'s New Age-y science teacher, who discovers similarities between Noah\\'s intricate notebook doodlings and ancient renderings of the universe (\"This is so out of my league,\" he marvels at one point), and becomes involved in Mimzy\\'s back-to-the-future quest. Timothy Hutton and Joely Richardson are solid as the understandably confounded and increasingly concerned parents. Michael Clarke Duncan is a menacing FBI agent who, invoking the Patriot Act, arrests the family after Noah inadvertently causes a citywide blackout with one of the futuristic objects.', 'The Last Mimzy', 'may not reach', 'E.T.', \"'s spectacular heights, but as thoughtfully adapted for the screen by Bruce Joel Rubin (\", 'Ghost', ') and Toby Emmerich (', 'Frequency', '), it is a transporting, idea-rich family film that is free of gratuitous coarse language (save for Mr. White\\'s offhand classroom use of the word \"screw\") or bathroom humor.', '--Donald Liebenson']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '794043109164', 'Director': 'Robert Shaye', 'Media Format': 'Closed-captioned, NTSC, Color, Widescreen, DVD', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 8, 2008', 'Actors': \"Joely Richardson, Timothy Hutton, Michael Clarke Duncan, Rainn Wilson, Chris O'Neil\", 'Producers': 'Michael Phillips, Justis Greene, Robert Shaye, Sara Risher', 'Language': 'Unqualified', 'Studio': 'Studio Distribution Services', 'Writers': 'Bruce Joel Rubin, Toby Emmerich, James V. Hart, Carol Skilken', 'Number of discs': '1'}\nThis movie can be seen by the whole family. Yes, it's speculative sci fi and yes, it has great visuals it also has a message.\nGreat movie.\nThe Life and Times of Judge Roy Bean\nJohn Huston  (Director, Actor),     Paul Newman  (Actor),     Jacqueline Bisset  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Director John Huston (\"The African Queen,\" \"The Maltese Falcon\") and a powerhouse cast make magic in this tongue-in-cheek Western saga. Academy Award-winner Paul Newman (\"Nobody\\'s Fool,\" \"The Sting\") shines as the real life, self-appointed judge. All-star supporting cast includes Academy Award-nominees Anthony Perkins (\"Psycho\") and Ava Gardner (\"The Sun Also Rises\"), Jacqueline Bisset (\"Rich and Famous\"), Roddy McDowell (\"Planet of the Apes\"), Tab Hunter (\"Grease 2\"), Ned Beatty (\"Roseanne\"), and then-newcomer Victoria Principal (\"Dallas\") in her feature film debut. Written by John Milius (\"Clear and Present Danger,\" \"Apocalypse Now\").']\n{'Genre': 'Comedy, Westerns', 'Format': 'NTSC', 'Contributor': 'Victoria Principal, Jacqueline Bisset, Tab Hunter, Paul Newman, Roddy Mcdowall, Anthony Zerbe, Stacy Keach, Anthony Perkins, Ava Gardner, John HustonVictoria Principal, Jacqueline Bisset, Tab Hunter, Paul Newman, Roddy Mcdowall, Anthony Zerbe, Stacy Keach, Anthony Perkins, Ava Gardner, John Huston   See more', 'Language': 'English', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '298886', 'Director': 'John Huston', 'Media Format': 'NTSC', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 6, 2012', 'Actors': 'Paul Newman, Jacqueline Bisset, Tab Hunter, John Huston, Stacy Keach', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe package arrived early so kudos to that. Unfortunately the teeth(?) that hold the actual dvd inside the case had broken so the dvd was rolling around inside the the case and thus suffered some scratching on the playing surface. Thankfully the scratches did not affect the performance and my wife and I enjoyed ol' Paul emoting.\nA Paul Newman golden oldie.",
  "profile": "**Updated User Profile Summary:**\n\nThe user continues to demonstrate a strong affinity for historical and war-themed comedies, romantic comedies, and action films that combine humor with engaging narratives. Their cinematic tastes remain diverse, encompassing psychological horror, classic science fiction, and drama. Recent acquisitions reveal a commitment to high-quality formats like Blu-ray and 4K UHD, reflecting an appreciation for superior viewing experiences. \n\nTheir latest purchase, highlighting a shared enjoyment of classic cinema, indicates an ongoing interest in family-friendly films and reinforces the user’s values of family bonding during movie nights. Their preferences further emphasize a liking for whimsical narratives with emotional depth, suitable for all ages.\n\nThe user admires influential directors such as Mel Gibson, Ridley Scott, and Spielberg, and has a fondness for actors including Martin Freeman and Stephen Fry, alongside classic stars like Tom Skerritt and Sylvester Stallone. \n\nThis evolving taste illustrates a balance of nostalgia and a desire for meaningful storytelling, as the user seeks out films with universal themes that can resonate with both adults and children alike. Their focus on family-oriented narratives fosters a cinematic experience that emphasizes enjoyment, connection, and shared memories with loved ones, while continuing to explore the rich tapestry of film across genres.",
  "metrics": {
    "rouge1_f": 0.04787136853645167,
    "rouge2_f": 0.006580149881191738,
    "rougeL_f": 0.026676411474511233,
    "meteor": 0.012303574396887418,
    "bleu1": 8.26626304850458e-15,
    "bleu2": 3.748245280474391e-15,
    "bleu3": 1.6645307291632344e-15,
    "bleu4": 9.77310518251725e-16,
    "bertscore_precision": 0.3398200273513794,
    "bertscore_recall": 0.5268125534057617,
    "bertscore_f1": 0.41314271092414856
  }
}