{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Nightmare Before Christmas (Two-Disc Collector's Edition)\nReview Date: 2009/10/14\nStore: L. Peter Callender  (Actor),     Randy Crenshaw  (Actor),     Henry Selick  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Now digitally restored and remastered with state-of-the-art technology, THE NIGHTMARE BEFORE CHRISTMAS is deeper, darker and more brilliant than ever just as Tim Burton originally envisioned it. Can Christmas be saved? Bored with the same old scare-and-scream routine, Jack Skellington, the Pumpkin King of Halloween Town, longs to spread the joy of Christmas. But his merry mission puts Santa in jeopardy and creates a nightmare for good little boys and girls everywhere! Bonus Features  THE NIGHTMARE BEFORE CHRISTMAS is the first full-length stop-motion animated film ever created. The movie contains more than 227 animated characters. Santa Claus\\' head has more than 50 different working parts, and Jack has more than 400 separate interchangeable heads, each handcrafted with a different facial expression. The smallest working puppet in the movie is a doll from the \"real world\" Jack visits that is only one inch long. Sally is wearing a real miniature dress laid on top of foam latex so that the fabric doesn\\'t move too much on screen. At the height of production, the animators produced only 70 seconds of finished film per week. To create Halloweentown\\'s twisted look, the design artists often made their sketches using their nondrawing hand. What\\'s This? Jack\\'s Haunted Mansion Holiday Tour Original Theatrical Trailers And Posters FRANKENWEENIE (Uncut Version) With New Introduction By Tim Burton VINCENT -- Short Film Tim Burton\\'s Original Poem Narrated By Christopher Lee All-New Audio Commentary By Tim Burton, Director Henry Selick And Musical Designer Danny Elfman Behind-The-Scenes Making Of Tim Burton\\'s THE NIGHTMARE BEFORE CHRISTMASThe Worlds Of Tim Burton\\'s THE NIGHTMARE BEFORE CHRISTMAS Halloween Town; Christmas Town; The Real World Deleted Scenes Storyboard To Film Comparison']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family', 'Format': \"Multiple Formats, AC-3, Animated, Box set, Collector's Edition, Color, Dolby, Dubbed, NTSC, Widescreen, Original recording remasteredMultiple Formats, AC-3, Animated, Box set, Collector's Edition, Color, Dolby, Dubbed, NTSC, Widescreen, Original recording remastered  See more\", 'Contributor': \"Judi M. Durand, Paul Reubens, William Hickey, Doris Hess, Gary Schwartz, Catherine O'Hara, Henry Selick, Carmen Twillie, Ken Page, Chris Sarandon, Edward Ivory, Sherwood Ball, Mary Gail Artz, Glenn Shadix, Greg Proops, Gary Raff, Barbara Cohen, Danny Elfman, David McCharen, Randy Crenshaw, L. Peter CallenderJudi M. Durand, Paul Reubens, William Hickey, Doris Hess, Gary Schwartz, Catherine O'Hara, Henry Selick, Carmen Twillie, Ken Page, Chris Sarandon, Edward Ivory, Sherwood Ball, Mary Gail Artz, Glenn Shadix, Greg Proops, Gary Raff, Barbara Cohen, Danny Elfman, David McC…  See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 16 minutes', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 5.6 Ounces', 'Director': 'Henry Selick', 'Media Format': \"Multiple Formats, AC-3, Animated, Box set, Collector's Edition, Color, Dolby, Dubbed, NTSC, Widescreen, Original recording remastered\", 'Run time': '1 hour and 16 minutes', 'Release date': 'August 26, 2008', 'Actors': 'L. Peter Callender, Randy Crenshaw, Judi M. Durand, William Hickey, Edward Ivory', 'Dubbed': 'French, Spanish', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Number of discs': '3'}\nReview Text: Update on this movie.  Because of the negative comments posted to my original review, I decided to watch the movie again, on Showtime, in HD-Big screen.  I thought that maybe I missed something.  My opinion has not changed.  I think it's an absolutely terrible movie, and I was a little too generous giving it a second star.  By the way, in this class of movie, I like Coraline the best.<br /><br />Original review:  I watched this via streaming.  The detail was outstanding.  The problem was that as much as I liked Corpse Bride, I disliked this movie.  In Corpse Bride, the characters seemed genuine, and I really sympathized with the two brides.  Loved the dog.  In Nightmare, all the characters were shallow, not developed, and not lovable at all.  Even the dog failed to give me any emotion. Totally bored throughout.  Waited for it to get better, and it never did.  Corpse Bride gave us a detestable evil character, and a surprise ending, Nightmare gave us neither.\nReview Title: Very dissapointing after Corpse Bride.\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Arrested Development: The Complete Series\nRated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Product Description', 'Season two', \"In this five-time Emmy®-winning comedy's hilarious second season, Michael Bluth, once again determined to be free of his dysfunctional family, packs up the car and his son George-Michael and heads for Arizona. But he's soon pulled over by the police who tell him that his father, George Sr., has broken out of prison. Due to the company's shady business deal with Iraq, Michael could face prison time, so he returns home to clear his name even as George Sr. secretly flees to Mexico, Tobias decides to be an understudy for the Blue Man Group, and Lucille begins a torrid affair with her husband's twin brother, Oscar.\", 'Season three', \"In this Emmy®-winning comedy's hilarious third season, Michael Bluth finally realizes that it's his Uncle Oscar serving time in prison, not his father. Reluctant to spring Oscar due to the effect it may have on the family business, Michael decides that the only fair thing to do is to find his father and place him under house arrest. Yet once found, George Sr. insists he was tricked into working with the Iraqis, leaving Michael no choice but to investigate his father's outrageous claim. But it isn't until Michael and Buster go to Iraq on a rescue mission to save Gob that the depth of the devious plot is revealed...and Michael learns which family member is the real brains behind all the madness.\", 'Amazon.com', 'Season One:', 'Winner of the Outstanding Comedy Series Emmy its first year out,', 'Arrested Development', \"is the kind of sitcom that gives you hope for television. A mockumentary-style exploration of the beleaguered Bluth family, it's one of those idiosyncratic shows that doesn't rely on a laugh track or a studio audience; it's shot more like a TV drama, albeit with an omniscient narrator (executive producer Ron Howard) overseeing the proceedings. Holding the Bluths together just barely is son Michael Bluth (Jason Bateman), the only normal guy in a family that's chock full of nuts. Hardworking and sensible, Michael's certain he's going to be given control of his family's Enron-style corporation upon the retirement of his father (Jeffrey Tambor). The fact that he's passed over instead for his mother (Jessica Walter) is only a blip when compared to his father's immediate arrest for dubious accounting practices, and the resulting freeze on the family's previously limitless wealth.\", \"Bereft of money, and even less family love, the Bluths have to band together in their moment of need--not easy when everyone's looking out for number 1. In addition to his scabrous parents, Michael has to contend with his lothario older brother (Will Arnett), his basically useless younger brother (Tony Hale), his greedy twin sister (Portia DeRossi), and her sexually ambiguous husband (David Cross). Michael's only comrade in sanity is his son George Michael (Michael Cera), but then again, the teenage boy harbors a secret crush on his cousin (Alia Shawkat). A peerless ensemble led by the brilliant Bateman (who ever knew he could be this good?), all the actors are pitch-perfect in their roles, delivering the dryly funny, sometimes absurdist dialogue with the speed and flair of classic farce. The unusual tone of\", 'Arrested Development', \"takes a bit of getting used to--it's far different from anything you'll see on TV, even HBO--but once you buy in to the Bluths' innumerable dysfunctions, you'll be laughing your head off for hours.--\", 'Mark Englehart', 'Season Two:', 'The axe of cancellation dangled perilously over', 'Arrested Development', \"during its second season, but the award-winning comedy fought against fate to deliver a hilarious if scattershot 18 episodes (reduced from the original show order of 22), and stayed alive for the beginning of a third season. Most likely, the creators and actors knew the clock was ticking down, so they didn't hesitate to throw their all into these manic, hilarious episodes, which have only the thinnest of plot arcs but an electrifying energy that makes them hard to resist. Some of the story antics were more of the same: good son Michael (Jason Bateman) tries to keep his company afloat, but is often foiled by older brother Gob (Will Arnett); the precarious marriage of Lindsay (Portia de Rossi) and Tobias (David Cross) undergoes a trial separation; and young George-Michael (Michael Cera) fights his attraction to his cousin Maeby (Alia Shawkat). Other show developments, though, were new and stunningly, uproariously bizarre: Buster (Tony Hale) joins the army, but later finds his hand bitten off by a seal (yes, a real seal), and Oscar (Jeffrey Tambor), the hippie brother of jailed George Sr. (also Tambor), rekindles an affair with sister-in-law Lucille (Jessica Walter), which may have resulted in Buster's conception years ago.\", 'Jokes flew fast and furious, as did guest stars--Ben Stiller, Julia Louis-Dreyfuss, Christine Taylor, Thomas Jane, Ed Begley Jr., Ione Skye, and Zach Braff among them--making it hard to keep straight who was doing what and why. No matter, as each of the episodes was in and of itself was a perfect gem of comedy, strung together by sharp writing and fantastic performances. In addition to the regular cast, both Liza Minnelli, reprising her role as \"Lucille Two,\" and Martin Short, as an, um, eccentric family friend, deserve special mention, with the episode both appeared in, \"Ready, Aim, Marry Me,\" a frenetic exercise in slapstick farce. Typical examples of the show\\'s offbeat humor were found in \"Afternoon Delight,\" in which various members of the Bluth family discover the true meaning of the \\'70s ballad, \"Meet the Veals,\" wherein the Bluths encounter the conservative parents of George Michael\\'s girlfriend, and \"Motherboy XXX,\" surrounding an unsettling mother-son traditional dance. The entire cast cohered perfectly through this season, and their give and take provided a perfect balance among the actors, all of whom were even better than the previous year. However, it\\'s Bateman who should be singled out as the show\\'s anchor, mixing dry sarcasm with impeccable comic timing. Despite plummeting ratings,', 'Arrested Development', \"didn't just keep its head above water, it swam with grace and hilarity. --\", 'Mark Englehart', 'Season Three:', 'Arrested Development', '--one of the greatest comedies in the history of television--went out in a blaze of glory. The truncated final season packed more biting humor per minute than ever before. In only 13 episodes, dozens of intertwining storylines spun in all directions: In addition to the overarching story about the fractious infighting of the Bluth family and the family\\'s housing development company being investigated for treason in Iraq (a plot arc that comes to a dazzlingly surreal conclusion), the put-upon \"good son\" Michael Bluth (Jason Bateman,', 'Teen Wolf Too', ') pursues romance with a lovely British woman (Charlize Theron,', 'Monster', ') who turns out to be woefully inappropriate; swaggering magician Gob (Will Arnett,', 'Monster-In-Law', ') flees from his newly-discovered teenage son while still pandering for the affection of his self-absorbed father (Jeffrey Tambor,', 'The Larry Sanders Show', '); flighty Lindsay (Portia de Rossi,', 'Ally McBeal', ') and her sexually blurry husband Tobias (David Cross,', 'Mr. Show', \") both get the hots for the family's new lawyer, Bob Loblaw (Scott Baio,\", 'Charles in Charge', \"); and much, much more. It's difficult to describe what makes\", 'Arrested Development', 'so brilliant. The ensemble is uniformly superb (Jessica Walter, as the family\\'s boozing, scheming matriarch, is particularly devastating this season) and the surprising guest stars (including Andy Richter, James Lipton, Justine Bateman, and many others) are perfectly cast; the characters\\' abominable behavior defies conventional television notions of \"likability\", yet they only grow more endearing the more you watch; the humor embraces wild slapstick and sharp satire, often within a single scene; and the nimble documentary style allows for sly glancing references to jokes and scenes from long-past episodes, rewarding devoted fans. But the key is that, no matter how screwball', 'Arrested Development', 'becomes, the show offers a rich, textured, and wonderfully coherent world in which these characters feel genuine, a world completely unlike the flat, plastic simulacrum offered by the average sitcom.', 'Arrested Development', 'was true to itself to the end. Its followers will cherish it forever. --', 'Bret Fetzer']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.7 x 5.4 x 1.9 inches; 2 Pounds', 'Media Format': 'NTSC, Widescreen', 'Release date': 'November 14, 2006', 'Dubbed': 'English', 'Subtitles': 'English, French, Spanish', 'Number of discs': '8'}\nI never watched this comedy when it was on.  Went for the lightning deal.  It's an excellent fast paced comedy.<br /><br />One person criticized the DVD.  The quality on this DVD is outstanding.  The reviewer must have other issues. Possibly a bad connection.\nGood comedy.  Fast paced.  Excellent quality.\nTell Me You Love Me: Season 1\nMichelle Borth  (Actor),     Tim DeKay  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'Tell Me You Love Me: The Complete First Season (DVD)', \"Sex. Life. This is the story of three couples trying to stay afloat - and one woman's efforts to show them how to do it. HBO's newest adult drama series explores issues of intimacy - through the point of view of a 20-something couple, prenumpital concerns and fidelity are examined, while the series' 30-something couple confront their failed attempts to start a family, coping with the effects it has on their sex life. And after two kids and 12 years of marriage, a couple in their early 40s question why their love and devotion hasn't translated into physical intimacy in nearly a year. Tell Me You Love Me explores the telling, everyday moments that can make or break a couple's commitment to one another, both emotionally and physically.\", ']]>', 'Amazon.com', \"This 10-episode first season of HBO's drama,\", 'Tell Me You Love Me', \", is a semi-sexy romp into the world of coupledom, though in total it casts a depressed glow on the possibility of long-term connection. In it, three couples plus their endearing shared therapist, May (Jane Alexander), feud over various issues arisen due to marriage, aging, differing sexual desires, and sheer boredom. Episodes rotate couples' scenarios and are spliced with scenes showing each seeking refuge in May's office. The youngest pair, sous chef Jaime (Michelle Borth) and her fiancé Hugo (Luke Ferrell Kirby), break their engagement over feared infidelity, while Jaime lands pretty boy Nick (Ian Somerhalder) to temporarily ease her pain over the broken commitment. Thirty-somethings, Pawlik (Adam Scott) and Carolyn (Sonya Walger), struggle to get pregnant. As their situation escalates they detest what they recognize in each other as parental traits they've both worked so hard to avoid. The most riveting and mature situation develops as Dave (Tim DeKay) and Katie (Ally Parker) realize that after 13 years of marriage and kids they're incapable of having sex. DeKay and Parker make an eerily convincing acting team, mirroring oodles of couples who lack passion but don't know how to fix it. Dave and Katie most successfully ask the core question of whether or not marriage can truly work. Here, sex and love are separated into two distinct categories. Failed intimacy abounds as emotional overload and stress sets in for each team of lovers. The first several episodes set up the dilemmas and are rife with fighting and despair; midway through, relief comes as Dave and Katie take their therapist's advice and have some nights alone with no kids. Similarly, Jaime gives Hugo a break after he nearly overdoses. Episodes nine and ten are the juiciest, as one begins to wonder who will stay split up and who will weather the desperation. Carolyn reconsiders her anxiety-inducing job, while we see Katie and Dave still crumbling under tension as they remodel their already-perfect house yet again. Throughout, sex scenes amongst the two sexually active couples provide some respite from the bickering, though they mostly illustrate how sex serves as both sanctuary and escape.\", 'Tell Me You Love Me', 'shows marriage as an uphill battle, though seemingly this means to inspire viewers to assess their own relationships for preservation. --', 'Trinie Dalton']\n{'Genre': 'Drama/Television, Drama', 'Format': 'Box set, NTSC, Widescreen, Multiple Formats, Color, Closed-captioned', 'Contributor': 'David Selby, Tim DeKay, Michelle Borth, Sonya Walger, Adam Scott', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 2.0 Surround)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '8 x 5.75 x 0.75 inches; 7.2 Ounces', 'Item model number': 'HBOD35866D', 'Media Format': 'Box set, NTSC, Widescreen, Multiple Formats, Color, Closed-captioned', 'Run time': '10 hours', 'Release date': 'October 21, 2014', 'Actors': 'Michelle Borth, Tim DeKay, Adam Scott, David Selby, Sonya Walger', 'Studio': 'HBO Studios', 'Number of discs': '4'}\nSome nice acting, decent story, erotic scenes.  Pretty spicy for an HBO series. I buy quite a few DVD series on Amazon, and usually finish a year on one, before proceeding to another.  I've put this on hold after watching 3 episodes. Eventually, I will watch all episodes. It is on the slow side.  If you don't mind that, a 4 or 5 star rating is understandable.\nOkay but slow.\nSlumdog Millionaire [Blu-ray]\nDev Patel  (Actor),     Freida Pinto  (Actor),     Danny Boyle  (Director),     Loveleen Tandan  (Director)    &                   1                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Jamal Malik (Dev Patel) is just one question away from winning a fortune on India\\'s version of \"Who Wants To Be A Millionaire?\" But how has this uneducated young man from the slums succeeded in providing correct responses to questions that have stumped countless scholars before him? And will he ultimately win it all or lose everything, including his true love?', 'Amazon.com', 'Danny Boyle (', 'Sunshine', ') directed this wildly energetic, Dickensian drama about the desultory life and times of an Indian boy whose bleak, formative experiences lead to an appearance on his country\\'s version of \"Who Wants to Be a Millionaire?\" Jamal (played as a young man by Dev Patel) and his brother are orphaned as children, raising themselves in various slums and crime-ridden neighorhoods and falling in, for a while, with a monstrous gang exploiting children as beggars and prostitutes. Driven by his love for Latika (Freida Pinto), Jamal, while a teen, later goes on a journey to rescue her from the gang\\'s clutches, only to lose her again to another oppressive fate as the lover of a notorious gangster.', 'Running parallel with this dark yet irresistible adventure, told in flashback vignettes, is the almost inexplicable sight of Jamal winning every challenge on \"Who Wants to Be a Millionaire?,\" a strong showing that leads to a vicious police interrogation. As Jamal explains how he knows the answer to every question on the show as the result of harsh events in his knockabout life, the chaos of his existence gains shape, perspective and soulfulness. The film\\'s violence is offset by a mesmerizing exotica shot and edited with a great whoosh of vitality. Boyle successfully sells the story\\'s most unlikely elements with nods to literary and cinematic conventions that touch an audience\\'s heart more than its head.', '--Tom Keogh', 'Stills from', 'Slumdog Millionaire', '(Click for larger image)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen, DubbedMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen, Dubbed  See more', 'Contributor': 'Mahesh Manjrekar, Vikas Swarup, Rajendranath Zutshi, Ayush Mahesh Khedekar, Sheikh Wali, Freida Pinto, Dev Patel, Simon Beaufoy, Jira Banjara, Saurabh Shukla, Irrfan Khan, Loveleen Tandan, Anil Kapoor, Jeneva Talwar, Azharuddin Mohammed Ismail, Danny BoyleMahesh Manjrekar, Vikas Swarup, Rajendranath Zutshi, Ayush Mahesh Khedekar, Sheikh Wali, Freida Pinto, Dev Patel, Simon Beaufoy, Jira Banjara, Saurabh Shukla, Irrfan Khan, Loveleen Tandan, Anil Kapoor, Jeneva Talwar, Azharuddin Mohammed Ismail, Danny Boyle  See more', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD)', 'Runtime': '2 hours', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.2 Ounces', 'Item model number': 'FXSE2273239BR', 'Director': 'Danny Boyle, Loveleen Tandan', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '2 hours', 'Release date': 'March 31, 2009', 'Actors': 'Dev Patel, Freida Pinto, Saurabh Shukla, Anil Kapoor, Rajendranath Zutshi', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Simon Beaufoy, Vikas Swarup', 'Number of discs': '2'}\nBlue Ray quality was excellent, with great sound track.<br /><br />This movie is brutal.  If I was from India, I would be livid at having my country portrayed like this.  That said, I researched on Google, and found that the movie does reflect the real India. The most brutal part was the blinding of homeless children, so they could make more money begging (money for their captors).  I'll pass on my plans to travel there.  I travel extensively, and it was on my list.  No more.  Excellent acting throughout.  Great story.  Disjointed in the beginning, but if you stay with it, it all comes together.  Great impact. Glad to be an American.\nBlue Ray Version.  Brutal.  Absolutely brutal.\nThe Curious Case Of Benjamin Button (The Criterion Collection) [Blu-ray]\nBrad Pitt  (Actor),     Cate Blanchett  (Actor),     David Fincher  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', '“I was born under unusual circumstances.” And so begins', 'The Curious Case of Benjamin Button', ', adapted from the 1920s story by F. Scott Fitzgerald about a man who is born in his eighties and ages backwards: a man, like any of us, who is unable to stop time. We follow his story, set in New Orleans, from the end of World War I in 1918 into the 21st century, following his journey that is as unusual as any man’s life can be. Directed by David Fincher and starring Brad Pitt and Cate Blanchett with Taraji P. Henson, Tilda Swinton, Jason Flemyng, Elias Koteas and Julia Ormond, “Benjamin Button,” is a grand tale of a not-so-ordinary man and the people and places he discovers along the way, the loves he finds, the joys of life and the sadness of death, and what lasts beyond time.', 'Amazon.com', 'The technical dazzle of', 'The Curious Case of Benjamin Button', \"is a truly astonishing thing to behold: this story of a man who ages backwards requires Brad Pitt to begin life as a tiny elderly man, then blossom into middle age, and finally, wisely, become young. How director David Fincher--with makeup artists, special-effects wizards, and body doubles--achieves this is one of the main sources of fascination in the early reels of the movie. The premise is loosely borrowed from an F. Scott Fitzgerald story (and bears an even stronger resemblance to Andrew Sean Greer's novel The Confessions of Max Tivoli), with young/old Benjamin growing up in New Orleans, meeting the girl of his dreams (Cate Blanchett), and sharing a few blissful years with her until their different aging agendas send them in opposite directions. The love story takes over the second half of the picture, as Eric Roth's script begins to resemble his work on Forrest Gump. This is too bad, because Benjamin's early life is a wonderfully picaresque journey, especially a set of midnight liaisons with a Russian lady (Tilda Swinton) in an atmospheric hotel. Fincher observes all this with an entomologist's eye, cool and exacting, which keeps the material from getting all gooey. Still, the Hurricane Katrina framing story feels put-on, and the movie lets Benjamin slide offscreen during its later stages--curious indeed.\", '--Robert Horton', 'Stills from', 'The Curious Case of Benjamin Button', '(Click for larger image)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Mahershalalhashbaz Ali, Lois Hall, Cate Blanchett, Rampai Mohadi, Alexandre Desplat, Julia Ormond, Jason Flemyng, Lance E. Nichols, Taraji P. Henson, Robert Towers, Brad Pitt, Ed Metzger, David Fincher, Elias Koteas, Tilda Swinton, Claudio Miranda, Madisen Beaty, Peter D. Badalamenti, Elle Fanning, Phyllis SomervilleMahershalalhashbaz Ali, Lois Hall, Cate Blanchett, Rampai Mohadi, Alexandre Desplat, Julia Ormond, Jason Flemyng, Lance E. Nichols, Taraji P. Henson, Robert Towers, Brad Pitt, Ed Metzger, David Fincher, Elias Koteas, Tilda Swinton, Claudio Miranda, Madisen Beaty, Peter…  See more', 'Language': 'English, French, Spanish', 'Runtime': '2 hours and 46 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.25 x 5.25 x 0.3 inches; 3.68 Ounces', 'Director': 'David Fincher', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '2 hours and 46 minutes', 'Release date': 'May 5, 2009', 'Actors': 'Brad Pitt, Cate Blanchett, Elias Koteas, Julia Ormond, Phyllis Somerville', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nHad an 11 minute freeze, which was probably caused by my Panasonic BD 60 Blue Ray.  Otherwise, quality was excellent.<br /><br />The movie was too long.  About 2:45.  Took off 1 star for excessive length.<br /><br />The movie was flat out very enjoyable.  My perspective affects my opinion.  I am retired.  My mother died this year at 101, and spent the last several years in a nursing home.  My mother in law is 90.  I could really identify with a movie that spent a fair amount of time at a retirement home.  Realistic and sad.  If I was much younger, I probably would not have enjoyed it.<br /><br />The main plot was not realistic, but was so well done.  It's easy for me to understand why this movie received Oscar nominations.  I thought Brad Pitt, played a great role.  Cate Blanchett and Tilda Swinton were also excellent.  For a person of my age and backround, the movie can best be described as bittersweeet.\nBlueray version.  Bad freeze.  Excellent.  A little too long.\nTim Burton's Corpse Bride\nJohnny Depp  (Actor),     Helena Bonham Carter  (Actor),     Mike Johnson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n[\"Tim Burton's Corpse Bride (DVD) (FS)\", \"Returning to the painstaking stop-motion animation he employed with amazing success in The Nightmare Before Christmas, Tim Burton presents a hair-raising legend based on a 19th-century Russian folktale, in which a young man mistakenly weds a corpse while on a two-day trek to the village of his real bride-to-be. It is up to the groom's flesh-and-blood fiancée, who has been pining for the arrival of her intended, to face her wraith-like rival and make peace with her by promising to live her dreams for her and by vowing to remember her always. Only then are the living bride and groom free to proceed with their own wedding ceremony in the warmhearted fable Tim Burton's Corpse Bride.\", ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '12569593503', 'Director': 'Mike Johnson, Tim Burton', 'Media Format': 'Full Screen, Color, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 17 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Johnny Depp, Helena Bonham Carter, Emily Watson, Tracey Ullman, Paul Whitehouse', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Jeffrey Auerbach, Tim Burton, Joe Ranft, Allison Abbate', 'Language': 'Unqualified, English (Dolby Digital 5.1 EX), Spanish (Dolby Digital 5.1 EX)', 'Studio': 'WarnerBrothers', 'Writers': 'John August, Caroline Thompson, Pamela Pettler', 'Number of discs': '1'}\nBased on the favorable reviews, I watched this via streaming through my computer.  Even with streaming, the level of clarity and detail was amazing.  The story was very entertaining, and definitely an adult movie.  Adult only because I don't think a child could appreciate what we have here.  This was a love story.<br /><br />The singing, really didn't add much entertainment value, but the piano scene was delightful. Fortunately, the singing was a very small part of the movie. The ending was a delightful surprise. A lot of the movie lacked color, but the grey and white scenery did fit perfectly into those scenes. I plan on watching more of these movies, starting with Nightmare and Coraline.\nMy introduction to this type of movie.  Delighted.\nThe Nightmare Before Christmas (Two-Disc Collector's Edition)\nL. Peter Callender  (Actor),     Randy Crenshaw  (Actor),     Henry Selick  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Now digitally restored and remastered with state-of-the-art technology, THE NIGHTMARE BEFORE CHRISTMAS is deeper, darker and more brilliant than ever just as Tim Burton originally envisioned it. Can Christmas be saved? Bored with the same old scare-and-scream routine, Jack Skellington, the Pumpkin King of Halloween Town, longs to spread the joy of Christmas. But his merry mission puts Santa in jeopardy and creates a nightmare for good little boys and girls everywhere! Bonus Features  THE NIGHTMARE BEFORE CHRISTMAS is the first full-length stop-motion animated film ever created. The movie contains more than 227 animated characters. Santa Claus\\' head has more than 50 different working parts, and Jack has more than 400 separate interchangeable heads, each handcrafted with a different facial expression. The smallest working puppet in the movie is a doll from the \"real world\" Jack visits that is only one inch long. Sally is wearing a real miniature dress laid on top of foam latex so that the fabric doesn\\'t move too much on screen. At the height of production, the animators produced only 70 seconds of finished film per week. To create Halloweentown\\'s twisted look, the design artists often made their sketches using their nondrawing hand. What\\'s This? Jack\\'s Haunted Mansion Holiday Tour Original Theatrical Trailers And Posters FRANKENWEENIE (Uncut Version) With New Introduction By Tim Burton VINCENT -- Short Film Tim Burton\\'s Original Poem Narrated By Christopher Lee All-New Audio Commentary By Tim Burton, Director Henry Selick And Musical Designer Danny Elfman Behind-The-Scenes Making Of Tim Burton\\'s THE NIGHTMARE BEFORE CHRISTMASThe Worlds Of Tim Burton\\'s THE NIGHTMARE BEFORE CHRISTMAS Halloween Town; Christmas Town; The Real World Deleted Scenes Storyboard To Film Comparison']\n{'Genre': 'Kids & Family', 'Format': \"Multiple Formats, AC-3, Animated, Box set, Collector's Edition, Color, Dolby, Dubbed, NTSC, Widescreen, Original recording remasteredMultiple Formats, AC-3, Animated, Box set, Collector's Edition, Color, Dolby, Dubbed, NTSC, Widescreen, Original recording remastered  See more\", 'Contributor': \"Judi M. Durand, Paul Reubens, William Hickey, Doris Hess, Gary Schwartz, Catherine O'Hara, Henry Selick, Carmen Twillie, Ken Page, Chris Sarandon, Edward Ivory, Sherwood Ball, Mary Gail Artz, Glenn Shadix, Greg Proops, Gary Raff, Barbara Cohen, Danny Elfman, David McCharen, Randy Crenshaw, L. Peter CallenderJudi M. Durand, Paul Reubens, William Hickey, Doris Hess, Gary Schwartz, Catherine O'Hara, Henry Selick, Carmen Twillie, Ken Page, Chris Sarandon, Edward Ivory, Sherwood Ball, Mary Gail Artz, Glenn Shadix, Greg Proops, Gary Raff, Barbara Cohen, Danny Elfman, David McC…  See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 16 minutes', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 5.6 Ounces', 'Director': 'Henry Selick', 'Media Format': \"Multiple Formats, AC-3, Animated, Box set, Collector's Edition, Color, Dolby, Dubbed, NTSC, Widescreen, Original recording remastered\", 'Run time': '1 hour and 16 minutes', 'Release date': 'August 26, 2008', 'Actors': 'L. Peter Callender, Randy Crenshaw, Judi M. Durand, William Hickey, Edward Ivory', 'Dubbed': 'French, Spanish', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Number of discs': '3'}\nUpdate on this movie.  Because of the negative comments posted to my original review, I decided to watch the movie again, on Showtime, in HD-Big screen.  I thought that maybe I missed something.  My opinion has not changed.  I think it's an absolutely terrible movie, and I was a little too generous giving it a second star.  By the way, in this class of movie, I like Coraline the best.<br /><br />Original review:  I watched this via streaming.  The detail was outstanding.  The problem was that as much as I liked Corpse Bride, I disliked this movie.  In Corpse Bride, the characters seemed genuine, and I really sympathized with the two brides.  Loved the dog.  In Nightmare, all the characters were shallow, not developed, and not lovable at all.  Even the dog failed to give me any emotion. Totally bored throughout.  Waited for it to get better, and it never did.  Corpse Bride gave us a detestable evil character, and a surprise ending, Nightmare gave us neither.\nVery dissapointing after Corpse Bride.",
  "profile": "User Profile Summary:\n\n- **Content Preference**: The user enjoys comedy and ensemble-driven sitcoms, along with unique storytelling formats such as mockumentaries. Their interest in drama reflects a growing appreciation for complex narratives centered around intimacy and relationships, favoring slower-paced storytelling. They also have a preference for bittersweet themes that evoke reflection and emotional resonance. Recent interactions suggest a critical stance towards character depth, particularly when characters appear shallow or lack genuine development.\n\n- **Format**: The user continues to favor physical media, especially Blu-ray, demonstrating a commitment to high-quality presentations and tangible collections.\n\n- **Engagement**: They seek critically acclaimed films and series characterized by strong narratives and emotional depth. The user is discerning as they become increasingly selective, prioritizing quality over quantity and expressing concerns regarding pacing and character development.\n\n- **Consumer Behavior**: While still searching for value during promotions, the user's selective approach emphasizes impactful storytelling over mere enjoyment. They hold mixed sentiments toward certain animated films, indicating an openness to diverse genres but also a critique of execution.\n\n- **Rating Attitude**: The user consistently employs critical evaluation in assessing performances and narratives, expressing disappointment when films do not meet their expectation for character engagement and depth. Their overall taste leans toward thought-provoking narratives that resonate on a personal level.",
  "metrics": {
    "rouge1_f": 0.05282870096589789,
    "rouge2_f": 0.0027607966870439754,
    "rougeL_f": 0.025625862408831065,
    "meteor": 0.014742590787907595,
    "bleu1": 2.0538591942015304e-11,
    "bleu2": 5.732043870099163e-12,
    "bleu3": 8.369667601050043e-13,
    "bleu4": 3.201357527414819e-13,
    "bertscore_precision": 0.3400385081768036,
    "bertscore_recall": 0.5042010545730591,
    "bertscore_f1": 0.40615904331207275
  }
}