{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nReview Date: 2022/09/02\nStore: MilyBest\nAverage Rating: 4.1\nProduct Details: {'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nReview Text: These eyelashes are everything!!!\nReview Title: The best!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "13X6 Lace Front Wigs Human Hair Pre Plucked With Baby Hair Brazilian Virgin Hair Kinky Straight Human Hair Wigs For Women Deep Part Space 13 By 6 Wigs Wet And Wavy 100% Human Hair 9A Grade 20 Inch\nIsufer\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'Isufer', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.69 x 6.85 x 0.94 inches; 12.35 Ounces'}\n[[VIDEOID:3de2bb88b3773ef8a1507ffa36dfd57c]] This whole wig is a scam. I’m really trying to understand where all of these great reviews came from.<br />This is worth Nowhere near the amount of money that I paid for this. The hairline was not pre-plucked, the knots were not bleached, and the frontal part is not the same length as the rest of the hair. I ordered a 20 inch and the frontal part is maybe 10 inches long.<br />I have included pictures. This will be going back today.\nSo disappointed\nPersephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch\nPersephone\n['Persephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch']\n{'Color': 'curly headband', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Brand': 'Persephone', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.7 x 9.1 x 1.4 inches; 6.07 Ounces'}\n[[VIDEOID:d0c52af0efb43e01223c088eae46c351]] This is definitely a wig that you will have to play with to get it where you want it. But no complaints for me. No weird smell and the hair curls nicely.\nIt’s cute but you have to play with it…\nLVWIGXE Short Wigs China Virgin Hair with Baby Hair 13X4X1 T Part Hairline Silky Straight Bob Wigs for Black Women 180% Density Lace Front Wigs Human Hair 14 Inch, Orange (T Part )\nLvwigxe\n{'Color': 'Orange', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Lvwigxe', 'Package Dimensions': '13.35 x 8.15 x 2.2 inches; 8.78 Ounces', 'Manufacturer': 'Lvwigxe'}\nI’m pleasantly surprised with this wig. It’s soft, doesn’t shed, and is exactly as described. There are some short hairs in the way but it’s nothing major. The lace is not harsh at all. If you’re into colored hair, I would definitely recommend this.\nIt’s cute…\nZILING Body Wave 13x4 Lace Front Wigs Human Hair for Black Women Pre Plucked with Baby Hair 150% Density Brazilian Body Wave Human Hair Lace Front Wigs 16 Inch\nZILING\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'ZILING', 'Package Dimensions': '11.26 x 9.76 x 1.65 inches; 6.38 Ounces'}\nIt’s a nice wig for the most part. The hair doesn’t fall the same way it does in the pictures. Also the knots are very big on this unit. They look like ants to be honest. It is not preplucked.\nBasic unit…nothing that stands out\nYILITE Blue Tape in Hair Extensions Human Hair 10pcs 20g Tape in Human Hair Extensions Blue Tape Hair Extensions 14 inches\nYILITE\n{'Brand': 'YILITE', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Package Dimensions': '11.73 x 2.64 x 0.59 inches; 1.13 Ounces', 'UPC': '737353301699'}\n[[VIDEOID:a60247ffbd9b2dafeea155a50c4972d7]] They pulled off the greatest heist with this one. 😂<br />This is not the same color that is posted. Do not waste your money.<br /><br />Update: The seller updated the color. If you look at my video, the color that was posted was a dark blue. After my review, they updated the color to show light blue.\nNot the same color. I wouldn’t buy it\n13x6 Straight Lace Front Wigs Human Hair Pre Plucked Bleached Knots HD Transparent Human Hair Lace Front Wigs 160% Density Glueless Lace Frontal Human Hair Wigs for Women Natural Hairline (18 Inch)\nGelbive\n{'Material': 'Human', 'Hair Type': 'Straight', 'Special Feature': 'Glueless', 'Brand': 'Gelbive', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.28 x 10.91 x 3.07 inches; 8.47 Ounces', 'UPC': '746555819598'}\n[[VIDEOID:84b767f90d17c2a1b68e9f37f8dbc402]] It has potential but it depends on how you are with wigs. Straight out of the pack, it looks really nice. It had great parting space . Once I started combing through it, I realized that the hair on the lace part is shorter than the rest of the hair. Because of that, it makes the hair look very damaged. It has a ton of short hairs. You cannot straighten those to look smooth. Even with a wax stick, it didn’t help them.\nNot the best\n13x4 Body Wave HD Lace Front Wigs Human Hair Wigs for Black Women Pre Plucked with Baby Hair 180% Density Natural Hairline Body Wave Transparent Lace Frontal Wigs Natural Color (18 Inch, natural color)\nGRACE PLUS\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Special Feature': 'Tangle Free', 'Brand': 'GRACE PLUS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.31 x 8.15 x 3.43 inches; 9.91 Ounces'}\nSheds way too much. Throwing away\nSheds terrible\nBob Wig Human Hair Lace Front Wigs Human Hair Bob Wigs for Black Women 10 Inch Bob 13X4 Lace Frontal Wigs Human Hair 150% Density Pre Plucked Natural Color\nFunky girl\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Brand': 'Funky girl', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.1 x 9.65 x 2.4 inches; 7.37 Ounces'}\nTurned out better than the other ones I reviewed. Very soft and well constructed. Would recommend!\nVery pretty\nMilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nMilyBest\n{'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nThese eyelashes are everything!!!\nThe best!",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user has expanded their focus to include beauty accessories, specifically false eyelashes, while maintaining their dedication to high-quality products. They continue to appreciate vibrant aesthetics and a realistic appearance, showcasing an evolving interest in makeup enhancements alongside their primary focus on wigs and extensions.\n\n- **Quality Expectation:** Their standards for product performance remain stringent, with a clear focus on accuracy and durability. The recent interaction indicates that they are willing to embrace and endorse products that excel in quality, as reflected in their enthusiastic review of the eyelashes.\n\n- **Adaptability:** The user shows a growing openness to various beauty products, indicating a willingness to explore complementary items, provided they meet their rigorous quality expectations.\n\n- **Attention to Detail:** Their meticulous nature continues to shine through, evidenced by their keen appreciation for well-made products. Positive feedback suggests they expect consistency across product categories, not just in hair choices.\n\n- **Value Perception:** The user maintains a balanced approach to satisfaction and critique, recognizing high-quality performance in both wigs and beauty accessories. Their feedback highlights a growing acknowledgment of the importance of functionality in all beauty purchases.\n\n- **Communication Style:** They remain articulate in expressing their experiences, emphasizing transparency and celebrating products that impress them, indicating a positive engagement with the beauty community.\n\nOverall, the user embodies a discerning buyer committed to quality across all aspects of their beauty regimen while prioritizing functionality and authenticity.",
  "metrics": {
    "rouge1_f": 0.12398042414355627,
    "rouge2_f": 0.008169934640522876,
    "rougeL_f": 0.05546492659053833,
    "meteor": 0.0526777705703107,
    "bleu1": 0.009669670995020809,
    "bleu2": 0.00250088389781348,
    "bleu3": 0.00040746501800864403,
    "bleu4": 0.0001646095066746303,
    "bertscore_precision": 0.3428783714771271,
    "bertscore_recall": 0.4396775960922241,
    "bertscore_f1": 0.3852911591529846
  }
}