{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 13x4 Body Wave HD Lace Front Wigs Human Hair Wigs for Black Women Pre Plucked with Baby Hair 180% Density Natural Hairline Body Wave Transparent Lace Frontal Wigs Natural Color (18 Inch, natural color)\nReview Date: 2022/07/13\nStore: GRACE PLUS\nAverage Rating: 3.6\nProduct Details: {'Material': 'Human', 'Hair Type': 'Wavy', 'Special Feature': 'Tangle Free', 'Brand': 'GRACE PLUS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.31 x 8.15 x 3.43 inches; 9.91 Ounces'}\nReview Text: Sheds way too much. Throwing away\nReview Title: Sheds terrible\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "13X6 Lace Front Wigs Human Hair Pre Plucked With Baby Hair Brazilian Virgin Hair Kinky Straight Human Hair Wigs For Women Deep Part Space 13 By 6 Wigs Wet And Wavy 100% Human Hair 9A Grade 20 Inch\nIsufer\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'Isufer', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.69 x 6.85 x 0.94 inches; 12.35 Ounces'}\n[[VIDEOID:3de2bb88b3773ef8a1507ffa36dfd57c]] This whole wig is a scam. I’m really trying to understand where all of these great reviews came from.<br />This is worth Nowhere near the amount of money that I paid for this. The hairline was not pre-plucked, the knots were not bleached, and the frontal part is not the same length as the rest of the hair. I ordered a 20 inch and the frontal part is maybe 10 inches long.<br />I have included pictures. This will be going back today.\nSo disappointed\nPersephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch\nPersephone\n['Persephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch']\n{'Color': 'curly headband', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Brand': 'Persephone', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.7 x 9.1 x 1.4 inches; 6.07 Ounces'}\n[[VIDEOID:d0c52af0efb43e01223c088eae46c351]] This is definitely a wig that you will have to play with to get it where you want it. But no complaints for me. No weird smell and the hair curls nicely.\nIt’s cute but you have to play with it…\nLVWIGXE Short Wigs China Virgin Hair with Baby Hair 13X4X1 T Part Hairline Silky Straight Bob Wigs for Black Women 180% Density Lace Front Wigs Human Hair 14 Inch, Orange (T Part )\nLvwigxe\n{'Color': 'Orange', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Lvwigxe', 'Package Dimensions': '13.35 x 8.15 x 2.2 inches; 8.78 Ounces', 'Manufacturer': 'Lvwigxe'}\nI’m pleasantly surprised with this wig. It’s soft, doesn’t shed, and is exactly as described. There are some short hairs in the way but it’s nothing major. The lace is not harsh at all. If you’re into colored hair, I would definitely recommend this.\nIt’s cute…\nZILING Body Wave 13x4 Lace Front Wigs Human Hair for Black Women Pre Plucked with Baby Hair 150% Density Brazilian Body Wave Human Hair Lace Front Wigs 16 Inch\nZILING\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'ZILING', 'Package Dimensions': '11.26 x 9.76 x 1.65 inches; 6.38 Ounces'}\nIt’s a nice wig for the most part. The hair doesn’t fall the same way it does in the pictures. Also the knots are very big on this unit. They look like ants to be honest. It is not preplucked.\nBasic unit…nothing that stands out\nYILITE Blue Tape in Hair Extensions Human Hair 10pcs 20g Tape in Human Hair Extensions Blue Tape Hair Extensions 14 inches\nYILITE\n{'Brand': 'YILITE', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Package Dimensions': '11.73 x 2.64 x 0.59 inches; 1.13 Ounces', 'UPC': '737353301699'}\n[[VIDEOID:a60247ffbd9b2dafeea155a50c4972d7]] They pulled off the greatest heist with this one. 😂<br />This is not the same color that is posted. Do not waste your money.<br /><br />Update: The seller updated the color. If you look at my video, the color that was posted was a dark blue. After my review, they updated the color to show light blue.\nNot the same color. I wouldn’t buy it\n13x6 Straight Lace Front Wigs Human Hair Pre Plucked Bleached Knots HD Transparent Human Hair Lace Front Wigs 160% Density Glueless Lace Frontal Human Hair Wigs for Women Natural Hairline (18 Inch)\nGelbive\n{'Material': 'Human', 'Hair Type': 'Straight', 'Special Feature': 'Glueless', 'Brand': 'Gelbive', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.28 x 10.91 x 3.07 inches; 8.47 Ounces', 'UPC': '746555819598'}\n[[VIDEOID:84b767f90d17c2a1b68e9f37f8dbc402]] It has potential but it depends on how you are with wigs. Straight out of the pack, it looks really nice. It had great parting space . Once I started combing through it, I realized that the hair on the lace part is shorter than the rest of the hair. Because of that, it makes the hair look very damaged. It has a ton of short hairs. You cannot straighten those to look smooth. Even with a wax stick, it didn’t help them.\nNot the best\n13x4 Body Wave HD Lace Front Wigs Human Hair Wigs for Black Women Pre Plucked with Baby Hair 180% Density Natural Hairline Body Wave Transparent Lace Frontal Wigs Natural Color (18 Inch, natural color)\nGRACE PLUS\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Special Feature': 'Tangle Free', 'Brand': 'GRACE PLUS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.31 x 8.15 x 3.43 inches; 9.91 Ounces'}\nSheds way too much. Throwing away\nSheds terrible",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user remains focused on high-quality human hair wigs and extensions, valuing vibrant colors, realism, and comfort. However, their recent experience has underscored the importance of product durability alongside aesthetic appeal.\n\n- **Quality Expectation:** Elevated scrutiny regarding product accuracy has intensified, particularly concerning shedding issues that detract from overall satisfaction. The difference between advertised attributes and actual performance is becoming increasingly significant to them.\n\n- **Adaptability:** While still open to styling changes, the user has grown more cautious with products that fail to meet their rigorous standards, especially regarding hair maintenance and longevity.\n\n- **Attention to Detail:** Their careful attention to detail continues, leading to reduced tolerance for imperfections that adversely affect appearance. The demand for products aligning closely with top-quality benchmarks is paramount.\n\n- **Value Perception:** The balance between satisfaction and critique remains evident, with strong emphasis on both performance and visual appeal. The recent negative experience has heightened their sensitivity to any shortcomings.\n\n- **Communication Style:** The user offers nuanced feedback, bearing in mind strengths and weaknesses. Their commitment to transparency in product representation is vital in shaping future interactions and evaluations.\n\nOverall, the user is a discerning buyer committed to quality and authenticity, maintaining a vigilant eye on both new styles and adherence to promotional claims while prioritizing product functionality and durability.",
  "metrics": {
    "rouge1_f": 0.10909090909090911,
    "rouge2_f": 0.005752636625119847,
    "rougeL_f": 0.06507177033492824,
    "meteor": 0.05248834460342253,
    "bleu1": 0.014614065914747353,
    "bleu2": 0.004749888373817904,
    "bleu3": 0.0007588258744541385,
    "bleu4": 0.0003035717447289926,
    "bertscore_precision": 0.3473473787307739,
    "bertscore_recall": 0.43263038992881775,
    "bertscore_f1": 0.38532641530036926
  }
}