{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: LVWIGXE Short Wigs China Virgin Hair with Baby Hair 13X4X1 T Part Hairline Silky Straight Bob Wigs for Black Women 180% Density Lace Front Wigs Human Hair 14 Inch, Orange (T Part )\nReview Date: 2022/06/10\nStore: Lvwigxe\nAverage Rating: 3.9\nProduct Details: {'Color': 'Orange', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Lvwigxe', 'Package Dimensions': '13.35 x 8.15 x 2.2 inches; 8.78 Ounces', 'Manufacturer': 'Lvwigxe'}\nReview Text: I’m pleasantly surprised with this wig. It’s soft, doesn’t shed, and is exactly as described. There are some short hairs in the way but it’s nothing major. The lace is not harsh at all. If you’re into colored hair, I would definitely recommend this.\nReview Title: It’s cute…\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "13X6 Lace Front Wigs Human Hair Pre Plucked With Baby Hair Brazilian Virgin Hair Kinky Straight Human Hair Wigs For Women Deep Part Space 13 By 6 Wigs Wet And Wavy 100% Human Hair 9A Grade 20 Inch\nIsufer\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'Isufer', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.69 x 6.85 x 0.94 inches; 12.35 Ounces'}\n[[VIDEOID:3de2bb88b3773ef8a1507ffa36dfd57c]] This whole wig is a scam. I’m really trying to understand where all of these great reviews came from.<br />This is worth Nowhere near the amount of money that I paid for this. The hairline was not pre-plucked, the knots were not bleached, and the frontal part is not the same length as the rest of the hair. I ordered a 20 inch and the frontal part is maybe 10 inches long.<br />I have included pictures. This will be going back today.\nSo disappointed\nPersephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch\nPersephone\n['Persephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch']\n{'Color': 'curly headband', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Brand': 'Persephone', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.7 x 9.1 x 1.4 inches; 6.07 Ounces'}\n[[VIDEOID:d0c52af0efb43e01223c088eae46c351]] This is definitely a wig that you will have to play with to get it where you want it. But no complaints for me. No weird smell and the hair curls nicely.\nIt’s cute but you have to play with it…\nLVWIGXE Short Wigs China Virgin Hair with Baby Hair 13X4X1 T Part Hairline Silky Straight Bob Wigs for Black Women 180% Density Lace Front Wigs Human Hair 14 Inch, Orange (T Part )\nLvwigxe\n{'Color': 'Orange', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Lvwigxe', 'Package Dimensions': '13.35 x 8.15 x 2.2 inches; 8.78 Ounces', 'Manufacturer': 'Lvwigxe'}\nI’m pleasantly surprised with this wig. It’s soft, doesn’t shed, and is exactly as described. There are some short hairs in the way but it’s nothing major. The lace is not harsh at all. If you’re into colored hair, I would definitely recommend this.\nIt’s cute…",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to favor high-quality human hair wigs, now also showing interest in vibrant colors, indicating an openness to experimenting with bolder styles.\n\n- **Quality Expectation:** The user maintains high standards for product quality, focusing on realism, comfort, and durability. Their recent positive experiences reinforce this expectation.\n\n- **Adaptability:** The user's review reflects a positive attitude towards minor adjustments in product styling, showcasing their flexibility and willingness to embrace new hair colors and styles.\n\n- **Attention to Detail:** The user remains detail-oriented yet has adopted a more forgiving approach, appreciating products that might require slight adjustments, as long as they align with their quality standards.\n\n- **Value Perception:** Their latest purchase demonstrates a heightened satisfaction level, emphasizing that they value both product performance and aesthetic appeal, even influencing the overall rating positively.\n\n- **Communication Style:** The user continues to express appreciation openly, providing nuanced feedback that acknowledges both strengths and minor issues, underlining their commitment to transparency in product representation.\n\nOverall, the user is a discerning buyer who values quality, versatility, and transparency, particularly in beauty and hair care. They adapt their expectations based on individual product performance and embrace the opportunity to explore diverse styles while remaining vigilant about consistency in quality.",
  "metrics": {
    "rouge1_f": 0.140893470790378,
    "rouge2_f": 0.010344827586206896,
    "rougeL_f": 0.07903780068728522,
    "meteor": 0.09145106444748491,
    "bleu1": 0.09988340417177728,
    "bleu2": 0.02562466639466697,
    "bleu3": 0.004766815689364339,
    "bleu4": 0.0020578622534930414,
    "bertscore_precision": 0.35089024901390076,
    "bertscore_recall": 0.40113165974617004,
    "bertscore_f1": 0.3743326961994171
  }
}