{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: ZILING Body Wave 13x4 Lace Front Wigs Human Hair for Black Women Pre Plucked with Baby Hair 150% Density Brazilian Body Wave Human Hair Lace Front Wigs 16 Inch\nReview Date: 2022/06/15\nStore: ZILING\nAverage Rating: 4.0\nProduct Details: {'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'ZILING', 'Package Dimensions': '11.26 x 9.76 x 1.65 inches; 6.38 Ounces'}\nReview Text: It’s a nice wig for the most part. The hair doesn’t fall the same way it does in the pictures. Also the knots are very big on this unit. They look like ants to be honest. It is not preplucked.\nReview Title: Basic unit…nothing that stands out\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "13X6 Lace Front Wigs Human Hair Pre Plucked With Baby Hair Brazilian Virgin Hair Kinky Straight Human Hair Wigs For Women Deep Part Space 13 By 6 Wigs Wet And Wavy 100% Human Hair 9A Grade 20 Inch\nIsufer\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'Isufer', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.69 x 6.85 x 0.94 inches; 12.35 Ounces'}\n[[VIDEOID:3de2bb88b3773ef8a1507ffa36dfd57c]] This whole wig is a scam. I’m really trying to understand where all of these great reviews came from.<br />This is worth Nowhere near the amount of money that I paid for this. The hairline was not pre-plucked, the knots were not bleached, and the frontal part is not the same length as the rest of the hair. I ordered a 20 inch and the frontal part is maybe 10 inches long.<br />I have included pictures. This will be going back today.\nSo disappointed\nPersephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch\nPersephone\n['Persephone Curly Headband Wig Human Hair Pixie Cut Wigs for Black Women Natural Color 8 Inch']\n{'Color': 'curly headband', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Brand': 'Persephone', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.7 x 9.1 x 1.4 inches; 6.07 Ounces'}\n[[VIDEOID:d0c52af0efb43e01223c088eae46c351]] This is definitely a wig that you will have to play with to get it where you want it. But no complaints for me. No weird smell and the hair curls nicely.\nIt’s cute but you have to play with it…\nLVWIGXE Short Wigs China Virgin Hair with Baby Hair 13X4X1 T Part Hairline Silky Straight Bob Wigs for Black Women 180% Density Lace Front Wigs Human Hair 14 Inch, Orange (T Part )\nLvwigxe\n{'Color': 'Orange', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Lvwigxe', 'Package Dimensions': '13.35 x 8.15 x 2.2 inches; 8.78 Ounces', 'Manufacturer': 'Lvwigxe'}\nI’m pleasantly surprised with this wig. It’s soft, doesn’t shed, and is exactly as described. There are some short hairs in the way but it’s nothing major. The lace is not harsh at all. If you’re into colored hair, I would definitely recommend this.\nIt’s cute…\nZILING Body Wave 13x4 Lace Front Wigs Human Hair for Black Women Pre Plucked with Baby Hair 150% Density Brazilian Body Wave Human Hair Lace Front Wigs 16 Inch\nZILING\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'ZILING', 'Package Dimensions': '11.26 x 9.76 x 1.65 inches; 6.38 Ounces'}\nIt’s a nice wig for the most part. The hair doesn’t fall the same way it does in the pictures. Also the knots are very big on this unit. They look like ants to be honest. It is not preplucked.\nBasic unit…nothing that stands out",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to favor high-quality human hair wigs, now showing an interest in vibrant colors, indicating a willingness to explore bolder styles while also maintaining a focus on realism and comfort.\n\n- **Quality Expectation:** The user's high standards for product quality persist, as highlighted by their latest purchase. They expect durability and aesthetic appeal but are becoming more discerning about product details and consistency with product imagery.\n\n- **Adaptability:** The user demonstrates flexibility in embracing minor styling adjustments, yet remains cautious, particularly when products do not align with advertised features, such as being pre-plucked.\n\n- **Attention to Detail:** The user is still detail-oriented but has developed a more discerning tolerance for imperfections, appreciating products that generally meet their quality standards despite some discrepancies.\n\n- **Value Perception:** Their recent purchase reflects a satisfaction level balanced with critical observations. The user values both performance and aesthetic appeal, which impacts their overall ratings.\n\n- **Communication Style:** The user continues to provide nuanced feedback that recognizes both strengths and shortcomings in the products, upholding their commitment to transparency and informative reviews.\n\nOverall, the user is a discerning buyer who values quality, versatility, and transparency, maintaining a careful balance of openness to new styles while remaining vigilant about consistency in product representation and quality.",
  "metrics": {
    "rouge1_f": 0.16426512968299714,
    "rouge2_f": 0.014450867052023121,
    "rougeL_f": 0.07780979827089338,
    "meteor": 0.0854370383130682,
    "bleu1": 0.0720456843016702,
    "bleu2": 0.02098193257270085,
    "bleu3": 0.0035568881969382945,
    "bleu4": 0.0014658212510224086,
    "bertscore_precision": 0.35004550218582153,
    "bertscore_recall": 0.41009819507598877,
    "bertscore_f1": 0.37769973278045654
  }
}