{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/05/18\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Matthew Robinson', 'Ron Jones', 'Sarah Hellings', 'Peter Moffatt', 'Pennant Roberts', 'Graeme Harper'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Colin Baker', 'Nicola Bryant']}\nReview Text: I enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nReview Title: Enjoyable\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Getting Into the Vortex: The Law of Attraction in Action, Episode XII\nEsther Hicks  (Actor),     Jerry Hicks  (Actor, Director)    Rated:    PG    Format: DVD-ROM  This title is manufactured on demand using DVD-R, when sold by Amazon.com.  Learn more   What's this?\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', '2-DVD set', \"“You didn’t come to ‘get it done'. You came for the thrill of the ride.”\", 'New questions on\\xa0: staying positive around a negative friend, why bad things can happen when you’re feeling good, death\\xa0- of\\xa0- a\\xa0- child issues, she’s lost her trust in men, why are we all here, do we ultimately pay for harming others? And – how to hear your own Inner Voice!', 'Plus: Abraham issues a call-out to society:\\xa0 “To the leaders of your world, to the leaders of your organizations, to the doctors and scientists and psychologists and psychiatrists, to the teachers… to anyone who wants to help anyone…”\\xa0– Abraham delivers!', 'About the Actor', 'All your power is in your Now. And what Now is the reason that Now is Now its whole power and potential is that Now is where you meet You. It is where the vibration of your current offering and the vibration of You, meet. And your emotions tell you how the meeting is going.\\xa0 For tons of free material along with the latest books, CDs,\\xa0and DVDs, visit their website.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.38 x 7.45 inches; 4 Ounces', 'Director': 'Jerry Hicks', 'Media Format': 'NTSC', 'Run time': '3 hours and 20 minutes', 'Release date': 'April 15, 2010', 'Actors': 'Esther Hicks, Jerry Hicks', 'Studio': 'Hay House', 'Number of discs': '2'}\nI enjoyed it very much. The meditations were great and I was able to do them easily. Very helpful. I hope Amazon gets more in soon, I have people I want to send it to.\nGreat I loved it.\n{'Subtitles': ['None available'], 'Directors': ['Fiona Cumming', 'John Black', 'Peter Grimwade', 'Peter Moffatt', 'Ron Jones'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Peter Davison', 'Matthew Waterhouse', 'Sarah Sutton'], 'Studio': ['BBC America']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nPure fun!!\n{'Subtitles': ['None available'], 'Directors': ['Matthew Robinson', 'Ron Jones', 'Sarah Hellings', 'Peter Moffatt', 'Pennant Roberts', 'Graeme Harper'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Colin Baker', 'Nicola Bryant']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nEnjoyable",
  "profile": "**Updated User Profile Summary:**\n\nThis user maintains a robust interest in self-help and personal development, focusing on positive thinking and the Law of Attraction. Their recent engagement with classic television series further enriches their media consumption, blending nostalgia with entertainment, and reflecting a desire for joy and inspiration in the content they explore. \n\nTheir recent review of a beloved classic series highlights a deep appreciation for older productions, showcasing a preference for the charm and substance of past eras, which they feel is lacking in contemporary offerings. This experience illustrates their enthusiasm for content that evokes positive emotions and cherished memories. \n\nThe person's penchant for sharing resources underscores their communal approach to learning and connectivity. They value interactive and meditative experiences, revealing an alignment with their spiritual journey toward personal growth. \n\nTheir trend of giving high ratings to products that resonate with their interests emphasizes a pursuit of quality and meaningful engagement. Overall, the user embraces a diverse range of motivational, inspirational, and nostalgic content, demonstrating a holistic approach to emotional well-being while cherishing the fun of classic entertainment. This balance of personal development and enjoyment further showcases their commitment to self-discovery and a fulfilling life experience.",
  "metrics": {
    "rouge1_f": 0.20771513353115728,
    "rouge2_f": 0.01488095238095238,
    "rougeL_f": 0.09495548961424334,
    "meteor": 0.07804665900875234,
    "bleu1": 0.043315490150510394,
    "bleu2": 0.011361800404549349,
    "bleu3": 0.004259725947198969,
    "bleu4": 0.0014683972167560972,
    "bertscore_precision": 0.33549371361732483,
    "bertscore_recall": 0.42678821086883545,
    "bertscore_f1": 0.3756740689277649
  }
}