{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/07/05\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Jean Yarbrough'], 'Producers': ['Synergy Entertainment'], 'Starring': [\"Dave O'Brien\", 'Bela Lugosi', 'Suzanne Kaaren'], 'Studio': ['The Film Detective']}\nReview Text: I like old movies and this was well done. Good acting, directing, and story. I recommend this movie if you like old ones.\nReview Title: Very Enjoyable\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Getting Into the Vortex: The Law of Attraction in Action, Episode XII\nEsther Hicks  (Actor),     Jerry Hicks  (Actor, Director)    Rated:    PG    Format: DVD-ROM  This title is manufactured on demand using DVD-R, when sold by Amazon.com.  Learn more   What's this?\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', '2-DVD set', \"“You didn’t come to ‘get it done'. You came for the thrill of the ride.”\", 'New questions on\\xa0: staying positive around a negative friend, why bad things can happen when you’re feeling good, death\\xa0- of\\xa0- a\\xa0- child issues, she’s lost her trust in men, why are we all here, do we ultimately pay for harming others? And – how to hear your own Inner Voice!', 'Plus: Abraham issues a call-out to society:\\xa0 “To the leaders of your world, to the leaders of your organizations, to the doctors and scientists and psychologists and psychiatrists, to the teachers… to anyone who wants to help anyone…”\\xa0– Abraham delivers!', 'About the Actor', 'All your power is in your Now. And what Now is the reason that Now is Now its whole power and potential is that Now is where you meet You. It is where the vibration of your current offering and the vibration of You, meet. And your emotions tell you how the meeting is going.\\xa0 For tons of free material along with the latest books, CDs,\\xa0and DVDs, visit their website.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.38 x 7.45 inches; 4 Ounces', 'Director': 'Jerry Hicks', 'Media Format': 'NTSC', 'Run time': '3 hours and 20 minutes', 'Release date': 'April 15, 2010', 'Actors': 'Esther Hicks, Jerry Hicks', 'Studio': 'Hay House', 'Number of discs': '2'}\nI enjoyed it very much. The meditations were great and I was able to do them easily. Very helpful. I hope Amazon gets more in soon, I have people I want to send it to.\nGreat I loved it.\n{'Subtitles': ['None available'], 'Directors': ['Fiona Cumming', 'John Black', 'Peter Grimwade', 'Peter Moffatt', 'Ron Jones'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Peter Davison', 'Matthew Waterhouse', 'Sarah Sutton'], 'Studio': ['BBC America']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nPure fun!!\n{'Subtitles': ['None available'], 'Directors': ['Matthew Robinson', 'Ron Jones', 'Sarah Hellings', 'Peter Moffatt', 'Pennant Roberts', 'Graeme Harper'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Colin Baker', 'Nicola Bryant']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nEnjoyable\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Harold Snoad'], 'Producers': ['Harold Snoad'], 'Starring': ['Patricia Routledge', 'Clive Swift', 'Judy Cornwell'], 'Studio': ['BBC America']}\nVery funny reminds me of All in the family the way they make fun of something else, by being that something.\nExcellent show!!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Albert Band'], 'Producers': ['Albert Band', 'Louis Garfinkle'], 'Starring': ['Richard Boone', 'Tehodore Bikel', 'Peggy Maurer'], 'Studio': ['Reel Enterprises']}\nExcellent acting and storyline. Lives a mysterious feeling behind when finished watching. Highly recommend if you are into older movies.\nVery good.\nPlanet of the Vampires\nScience Fiction, Horror, Adventure, Action\n['Get sucked into a chilling black hole of cosmic creepiness when an evil alien race zeroes in on a crew of unsuspecting astronauts, turning them into zombies!']\n{'Content advisory': ['Violence'], 'Subtitles': ['None available'], 'Directors': ['Mario Bava'], 'Producers': ['Samuel Z. Arkoff', 'Salvatore Billitteri', 'Fulvio Lucisano', 'James H. Nicholson'], 'Starring': ['Barry SullivanEvi Marandi', 'Norma Bengell', 'Angel Aranda']}\nThis is certainly not the best B movie made not is it the worst. If you were doing a A-F scale, I would give this a C. The acting left alot to be desired, the story line was okay but could have used some creative help.\nokay for a b movie\n{'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Jean Yarbrough'], 'Producers': ['Synergy Entertainment'], 'Starring': [\"Dave O'Brien\", 'Bela Lugosi', 'Suzanne Kaaren'], 'Studio': ['The Film Detective']}\nI like old movies and this was well done. Good acting, directing, and story. I recommend this movie if you like old ones.\nVery Enjoyable",
  "profile": "**Updated User Profile Summary:**\n\nThe user maintains a strong interest in self-help and personal development, emphasizing positive thinking and the Law of Attraction. Their appreciation for classic television and cinema continues to serve as a source of nostalgia and inspiration. Recent interactions showcase their enthusiasm for older films, reflecting a fondness for well-executed narratives, quality performances, and thoughtful storytelling. This commitment to classic cinema is evident in their ratings and reviews, which convey discernment and a preference for higher standards.\n\nAn exploration of diverse genres, particularly science fiction and horror, indicates an openness to varied cinematic expressions; however, the user remains discerning, choosing content that resonates emotionally and invites reflection. They actively seek media that fosters deep feelings and aligns with their holistic approach to emotional wellness.\n\nTheir community-oriented sharing of resources mirrors their ongoing spiritual journey toward personal growth, emphasizing interactive and mindfulness-promoting experiences. This balance of nostalgia with inquisitiveness continues to enhance their engagement with media, reinforcing their dedication to quality and personal development.\n\nOverall, the user's nuanced perspective enriches their life experiences, blending cherished memories with self-discovery and emotional well-being, as they navigate their evolving tastes within the realm of classic and contemporary content.",
  "metrics": {
    "rouge1_f": 0.15021459227467812,
    "rouge2_f": 0.010752688172043008,
    "rougeL_f": 0.07939914163090128,
    "meteor": 0.05034885959288519,
    "bleu1": 0.006664419217388315,
    "bleu2": 0.0016910588355090739,
    "bleu3": 0.0006270124438916333,
    "bleu4": 0.00021494062436879663,
    "bertscore_precision": 0.3258928060531616,
    "bertscore_recall": 0.43641966581344604,
    "bertscore_f1": 0.37314364314079285
  }
}