{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/06/20\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Albert Band'], 'Producers': ['Albert Band', 'Louis Garfinkle'], 'Starring': ['Richard Boone', 'Tehodore Bikel', 'Peggy Maurer'], 'Studio': ['Reel Enterprises']}\nReview Text: Excellent acting and storyline. Lives a mysterious feeling behind when finished watching. Highly recommend if you are into older movies.\nReview Title: Very good.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Getting Into the Vortex: The Law of Attraction in Action, Episode XII\nEsther Hicks  (Actor),     Jerry Hicks  (Actor, Director)    Rated:    PG    Format: DVD-ROM  This title is manufactured on demand using DVD-R, when sold by Amazon.com.  Learn more   What's this?\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', '2-DVD set', \"“You didn’t come to ‘get it done'. You came for the thrill of the ride.”\", 'New questions on\\xa0: staying positive around a negative friend, why bad things can happen when you’re feeling good, death\\xa0- of\\xa0- a\\xa0- child issues, she’s lost her trust in men, why are we all here, do we ultimately pay for harming others? And – how to hear your own Inner Voice!', 'Plus: Abraham issues a call-out to society:\\xa0 “To the leaders of your world, to the leaders of your organizations, to the doctors and scientists and psychologists and psychiatrists, to the teachers… to anyone who wants to help anyone…”\\xa0– Abraham delivers!', 'About the Actor', 'All your power is in your Now. And what Now is the reason that Now is Now its whole power and potential is that Now is where you meet You. It is where the vibration of your current offering and the vibration of You, meet. And your emotions tell you how the meeting is going.\\xa0 For tons of free material along with the latest books, CDs,\\xa0and DVDs, visit their website.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.38 x 7.45 inches; 4 Ounces', 'Director': 'Jerry Hicks', 'Media Format': 'NTSC', 'Run time': '3 hours and 20 minutes', 'Release date': 'April 15, 2010', 'Actors': 'Esther Hicks, Jerry Hicks', 'Studio': 'Hay House', 'Number of discs': '2'}\nI enjoyed it very much. The meditations were great and I was able to do them easily. Very helpful. I hope Amazon gets more in soon, I have people I want to send it to.\nGreat I loved it.\n{'Subtitles': ['None available'], 'Directors': ['Fiona Cumming', 'John Black', 'Peter Grimwade', 'Peter Moffatt', 'Ron Jones'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Peter Davison', 'Matthew Waterhouse', 'Sarah Sutton'], 'Studio': ['BBC America']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nPure fun!!\n{'Subtitles': ['None available'], 'Directors': ['Matthew Robinson', 'Ron Jones', 'Sarah Hellings', 'Peter Moffatt', 'Pennant Roberts', 'Graeme Harper'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Colin Baker', 'Nicola Bryant']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nEnjoyable\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Harold Snoad'], 'Producers': ['Harold Snoad'], 'Starring': ['Patricia Routledge', 'Clive Swift', 'Judy Cornwell'], 'Studio': ['BBC America']}\nVery funny reminds me of All in the family the way they make fun of something else, by being that something.\nExcellent show!!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Albert Band'], 'Producers': ['Albert Band', 'Louis Garfinkle'], 'Starring': ['Richard Boone', 'Tehodore Bikel', 'Peggy Maurer'], 'Studio': ['Reel Enterprises']}\nExcellent acting and storyline. Lives a mysterious feeling behind when finished watching. Highly recommend if you are into older movies.\nVery good.",
  "profile": "**Updated User Profile Summary:**\n\nThis user maintains a robust interest in self-help and personal development, particularly within positive thinking and the Law of Attraction. Their fondness for classic television and film continues to provide a rich source of nostalgia and entertainment, aligning with their pursuit of joy and inspiration.\n\nThe recent review highlights their appreciation for compelling narratives and quality acting in older films, reflecting a preference for content that evokes deep feelings and thought. Their enjoyment of stories that leave a lingering impression showcases their engagement with media that not only entertains but also invites reflection, emphasizing their holistic approach to emotional wellness.\n\nThe user consistently rates content with thoughtful reflections, indicating a dedication to quality engagement and a desire for both entertainment and insight. Their community-oriented sharing of resources mirrors their spiritual journey towards personal growth, and their preference for interactive, meditative experiences reinforces this journey.\n\nOverall, the user successfully balances their love for motivational and nostalgic content, showcasing a commitment to self-discovery, emotional well-being, and the delight of classic storytelling. This nuanced perspective enhances their fulfilling life experience, weaving together cherished memories and ongoing personal development.",
  "metrics": {
    "rouge1_f": 0.16116248348745046,
    "rouge2_f": 0.010596026490066225,
    "rougeL_f": 0.07661822985468957,
    "meteor": 0.054667102990722714,
    "bleu1": 0.015298890272614442,
    "bleu2": 0.004189137501067236,
    "bleu3": 0.0015933239717347038,
    "bleu4": 0.0005532318552112349,
    "bertscore_precision": 0.3072378635406494,
    "bertscore_recall": 0.41468632221221924,
    "bertscore_f1": 0.35296598076820374
  }
}