{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/06/20\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Harold Snoad'], 'Producers': ['Harold Snoad'], 'Starring': ['Patricia Routledge', 'Clive Swift', 'Judy Cornwell'], 'Studio': ['BBC America']}\nReview Text: Very funny reminds me of All in the family the way they make fun of something else, by being that something.\nReview Title: Excellent show!!!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Getting Into the Vortex: The Law of Attraction in Action, Episode XII\nEsther Hicks  (Actor),     Jerry Hicks  (Actor, Director)    Rated:    PG    Format: DVD-ROM  This title is manufactured on demand using DVD-R, when sold by Amazon.com.  Learn more   What's this?\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', '2-DVD set', \"“You didn’t come to ‘get it done'. You came for the thrill of the ride.”\", 'New questions on\\xa0: staying positive around a negative friend, why bad things can happen when you’re feeling good, death\\xa0- of\\xa0- a\\xa0- child issues, she’s lost her trust in men, why are we all here, do we ultimately pay for harming others? And – how to hear your own Inner Voice!', 'Plus: Abraham issues a call-out to society:\\xa0 “To the leaders of your world, to the leaders of your organizations, to the doctors and scientists and psychologists and psychiatrists, to the teachers… to anyone who wants to help anyone…”\\xa0– Abraham delivers!', 'About the Actor', 'All your power is in your Now. And what Now is the reason that Now is Now its whole power and potential is that Now is where you meet You. It is where the vibration of your current offering and the vibration of You, meet. And your emotions tell you how the meeting is going.\\xa0 For tons of free material along with the latest books, CDs,\\xa0and DVDs, visit their website.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.38 x 7.45 inches; 4 Ounces', 'Director': 'Jerry Hicks', 'Media Format': 'NTSC', 'Run time': '3 hours and 20 minutes', 'Release date': 'April 15, 2010', 'Actors': 'Esther Hicks, Jerry Hicks', 'Studio': 'Hay House', 'Number of discs': '2'}\nI enjoyed it very much. The meditations were great and I was able to do them easily. Very helpful. I hope Amazon gets more in soon, I have people I want to send it to.\nGreat I loved it.\n{'Subtitles': ['None available'], 'Directors': ['Fiona Cumming', 'John Black', 'Peter Grimwade', 'Peter Moffatt', 'Ron Jones'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Peter Davison', 'Matthew Waterhouse', 'Sarah Sutton'], 'Studio': ['BBC America']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nPure fun!!\n{'Subtitles': ['None available'], 'Directors': ['Matthew Robinson', 'Ron Jones', 'Sarah Hellings', 'Peter Moffatt', 'Pennant Roberts', 'Graeme Harper'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Colin Baker', 'Nicola Bryant']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nEnjoyable\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Harold Snoad'], 'Producers': ['Harold Snoad'], 'Starring': ['Patricia Routledge', 'Clive Swift', 'Judy Cornwell'], 'Studio': ['BBC America']}\nVery funny reminds me of All in the family the way they make fun of something else, by being that something.\nExcellent show!!!",
  "profile": "**Updated User Profile Summary:**\n\nThis user continues to showcase a strong interest in self-help and personal development, particularly in the realms of positive thinking and the Law of Attraction. Their affinity for classic television series persists, providing a delightful blend of nostalgia and entertainment that reinforces their quest for joy and inspiration. \n\nThe recent review reflects their deep appreciation for humor in classic shows, likening them to other beloved productions that cleverly critique societal norms. This enjoyment illustrates their preference for content that elicits positive emotions and cherished memories, highlighting a nostalgic yet critical engagement with classic media.\n\nAdditionally, the user's practice of rating content with thoughtful reflections demonstrates a commitment to quality and meaningful engagement, reinforcing their desire for both entertainment and insight. Their community-oriented approach to sharing resources aligns with their spiritual journey of personal growth, and their enjoyment of interactive, meditative experiences emphasizes their holistic view on emotional wellness.\n\nOverall, they balance the pursuit of motivational and nostalgic content, showcasing a commitment to self-discovery, emotional well-being, and the fun of classic entertainment. This nuanced perspective enhances their fulfilling life experience, blending past joys with ongoing personal development.",
  "metrics": {
    "rouge1_f": 0.1879382889200561,
    "rouge2_f": 0.016877637130801686,
    "rougeL_f": 0.08695652173913043,
    "meteor": 0.06826823308910489,
    "bleu1": 0.02766036208896233,
    "bleu2": 0.007841620956382854,
    "bleu3": 0.0028392906636796928,
    "bleu4": 0.0009618736558771606,
    "bertscore_precision": 0.31999537348747253,
    "bertscore_recall": 0.4151340126991272,
    "bertscore_f1": 0.36140838265419006
  }
}