{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/05/18\nAverage Rating: 3.9\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Fiona Cumming', 'John Black', 'Peter Grimwade', 'Peter Moffatt', 'Ron Jones'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Peter Davison', 'Matthew Waterhouse', 'Sarah Sutton'], 'Studio': ['BBC America']}\nReview Text: I enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nReview Title: Pure fun!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Getting Into the Vortex: The Law of Attraction in Action, Episode XII\nEsther Hicks  (Actor),     Jerry Hicks  (Actor, Director)    Rated:    PG    Format: DVD-ROM  This title is manufactured on demand using DVD-R, when sold by Amazon.com.  Learn more   What's this?\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', '2-DVD set', \"“You didn’t come to ‘get it done'. You came for the thrill of the ride.”\", 'New questions on\\xa0: staying positive around a negative friend, why bad things can happen when you’re feeling good, death\\xa0- of\\xa0- a\\xa0- child issues, she’s lost her trust in men, why are we all here, do we ultimately pay for harming others? And – how to hear your own Inner Voice!', 'Plus: Abraham issues a call-out to society:\\xa0 “To the leaders of your world, to the leaders of your organizations, to the doctors and scientists and psychologists and psychiatrists, to the teachers… to anyone who wants to help anyone…”\\xa0– Abraham delivers!', 'About the Actor', 'All your power is in your Now. And what Now is the reason that Now is Now its whole power and potential is that Now is where you meet You. It is where the vibration of your current offering and the vibration of You, meet. And your emotions tell you how the meeting is going.\\xa0 For tons of free material along with the latest books, CDs,\\xa0and DVDs, visit their website.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.38 x 7.45 inches; 4 Ounces', 'Director': 'Jerry Hicks', 'Media Format': 'NTSC', 'Run time': '3 hours and 20 minutes', 'Release date': 'April 15, 2010', 'Actors': 'Esther Hicks, Jerry Hicks', 'Studio': 'Hay House', 'Number of discs': '2'}\nI enjoyed it very much. The meditations were great and I was able to do them easily. Very helpful. I hope Amazon gets more in soon, I have people I want to send it to.\nGreat I loved it.\n{'Subtitles': ['None available'], 'Directors': ['Fiona Cumming', 'John Black', 'Peter Grimwade', 'Peter Moffatt', 'Ron Jones'], 'Producers': ['John Nathan-Turner'], 'Starring': ['Peter Davison', 'Matthew Waterhouse', 'Sarah Sutton'], 'Studio': ['BBC America']}\nI enjoy all the Dr. Who series even the really old ones. I especially enjoy Jon Pertwee, Peter Davison and Tom Baker. The new ones are okay but they are missing something that the older ones have.\nPure fun!!",
  "profile": "**Updated User Profile Summary:**\n\nThis user continues to demonstrate a strong interest in self-help and personal development through media that promotes positive thinking and the Law of Attraction. Their recent engagement with classic television indicates a broadened media consumption that seamlessly blends enjoyment with nostalgia, reflecting a preference for content that not only inspires but also entertains. \n\nTheir enthusiasm for sharing resources is evident, showcasing a communal approach to learning. The user appreciates interactive and meditative experiences, suggesting a deep engagement with material that aligns with their spiritual and personal growth journey. \n\nThe user's willingness to rate products highly, particularly those that resonate with their interests, highlights their pursuit of quality content. Their recent review, celebrating classic entertainment, indicates a joy in revisiting cherished media, further emphasizing their appreciation for experiences that evoke positive emotions and memories.\n\nOverall, the user embraces a diverse array of content, focused on motivation, inspiration, and mindfulness, while also cherishing the fun and nostalgia that comes with classic shows. Their exploration of both self-development and entertainment showcases a holistic approach to personal discovery and emotional well-being.",
  "metrics": {
    "rouge1_f": 0.18823529411764708,
    "rouge2_f": 0.013490725126475547,
    "rougeL_f": 0.09411764705882354,
    "meteor": 0.07130793769938075,
    "bleu1": 0.05594085759231068,
    "bleu2": 0.015434360829788328,
    "bleu3": 0.005885538420294115,
    "bleu4": 0.0020462717749679758,
    "bertscore_precision": 0.33482933044433594,
    "bertscore_recall": 0.4225652813911438,
    "bertscore_f1": 0.37361568212509155
  }
}