{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/09/29\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Flashing lights', 'nudity', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Alex Rudzinski'], 'Producers': ['Robyn Rihanna Fenty', 'Laurence \"Jay\" Brown', 'Jennifer Rosales Davis', 'Michael Antinoro', 'David Chamberlin', 'Izzie Pick Ibarra', 'Chris Wagner'], 'Starring': ['Rihanna', 'Nas', 'Daddy Yankee']}\nReview Text: I feel like a lot of the negative reviews are coming from people who can’t get a grip on the fact that diversity is awesome, and that beautiful comes in every shape, size, race, and gender.<br />Amazing choreographies, wonderfully inclusive, so so sexy. This is an amazing show.\nReview Title: Amazing choreographies, wonderfully inclusive, so so sexy\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Charlie and the Chocolate Factory\nJohnny Depp  (Actor),     Freddie Highmore  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Willy Wonka, the eccentric owner of a candy factory, decides to open up his factory to five lucky kids who won a contest by finding golden tickets in his candy bars. As the tour progresses, each kid succumbs to a temptation of their weaknesses except for Charlie Bucket, an innocent child whose family has grown up in poverty in the shadow Willy Wonka's monstrous factory.\", 'Amazon.com', \"Mixed reviews and creepy comparisons to Michael Jackson notwithstanding, Tim Burton's splendidly imaginative adaptation of\", 'Charlie and the Chocolate Factory', \"would almost surely meet with Roald Dahl's approval. The celebrated author of darkly offbeat children's books vehemently disapproved of 1971's\", 'Willy Wonka and the Chocolate Factory', \"(hence the change in title), so it's only fitting that Burton and his frequent star/collaborator, Johnny Depp, should have another go, infusing the enigmatic candyman's tale with their own unique brand of imaginative oddity. Depp's pale, androgynous Wonka led some to suspect a partial riff on that most controversial of eternal children, Michael Jackson, but Burton's film is too expansively magnificent to be so narrowly defined. While preserving Dahl's morality tale on the hazards of indulgent excess, Burton's riotous explosion of color provides a wondrous setting for the lessons learned by Charlie Bucket (played by Freddie Highmore, Depp's delightful costar in\", 'Finding Neverland', \"), as he and other, less admirable children enjoy a once-in-a-lifetime tour of Wonka's confectionary wonderland. Elaborate visual effects make this an eye-candy overdose (including digitally multiplied Oompa-Loompas, all played by diminutive actor Deep Roy), and the film's underlying weirdness is exaggerated by Depp's admirably risky but ultimately off-putting performance. Of course, none of this stops Burton's Charlie from being the must-own family DVD of 2005's holiday season, perhaps even for those who staunchly defend Gene Wilder's portrayal of Wonka from 34 years earlier.\", '--Jeff Shannon', 'DVD features', 'The second disc is filled with a number of distinctive featurettes. The likely crowd-pleaser in most households is \"Attack of the Squirrels,\" which recounts how those fuzzy little creatures (a combination of hard-to-train live animals, animatronics, and computer graphics) can be ornery in their own right. \"The Fantastic Mr. Dahl\" is a 17-minute look at author Roald Dahl through vintage footage and new interviews with family, friends, and colleagues. \"Becoming Oompa-Loompa\" follows Deep Roy as he is filmed over and over again through his dance steps and music performances.', 'Roy is a constant throughout the kids\\' activities as well. You can follow him to learn two different dance steps \"Augustus Gloop\" and \"Violet Beauregarde,\" and make him taste weird candy inventions in a simple game. \"Search for the Golden Ticket\" is a five-part challenge that tests your remote-control fingers, your deductive abilities, or your luck. Finally, if you just want basic behind-the-scenes information, \"Making the Mix\" is a collection of featurettes (around 40 minutes total) covering the film\\'s casting, music, production design, and special effects.', '--David Horiuchi']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 5.6 Ounces', 'Item model number': '12569743151', 'Director': 'Tim Burton', 'Media Format': 'Dolby, Closed-captioned, Full Screen, NTSC, Dubbed, Subtitled', 'Run time': '1 hour and 55 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Johnny Depp, Freddie Highmore, David Kelly, Helena Bonham Carter, Noah Taylor', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Brad Grey, Bruce Berman, Derek Frey, Graham Burke, Katterli Frauenfelder', 'Language': 'English (Dolby Digital 5.1 EX), French (Dolby Digital 5.1 EX), Spanish (Dolby Digital 5.1 EX)', 'Studio': 'Warner Bros. Pictures', 'Writers': 'John August, Roald Dahl', 'Number of discs': '2'}\nThe newest adaptation is nothing like the book; if anything, try the Gene Wilder one, which better captures the fun-loving nature of Wonka and the silly laughs resulting from the rotten kids visiting the delicious funhouse. That screenplay, as it happens, was written by Dahl, so you know it is true to his intentions. That, and the music is more fun and catchy, whereas this one fails to impress.<br /><br />The visuals are typical for Tim Burton: beautifully dark, twisted, and a little scary. The humor is there at times, but is overshadowed by the overwhelming artistic vision and really unpleasant version of the oompa loompas. The various elements are mostly exciting, but don't quite add up to an engaging film. Nice try, but not the best.\nnot as good as the Gene Wilder version\nMatilda (Special Edition)\nMara Wilson  (Actor),     Danny DeVito  (Actor, Director, Producer)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"See the world from a kid's-eye view with MATILDA, a modern fairytale that mixes hilarious humor with the magical message of love. Mrs. Doubtfire's Mara Wilson stars as Matilda, a super-smart little girl who's woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother, and anevil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn't have to get mad to get even. 2013 BD Release: From best-selling author Roald Dahl and the unique vision of Danny DeVito comes Matilda, remastered in high definition! This modern-day fairy tale mixes hilarious humor with a magical message of love. Mrs. Doubtfire’s Mara Wilson stars as Matilda, a super-smart little girl who’s woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother and an evil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn’t have to get mad to get even. 2016 Refresh Fro\"]\n{'Genre': 'Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Contributor': 'Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)  See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 5.3 x 7.4 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 98 min', 'Director': 'Danny DeVito', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 17, 2006', 'Actors': 'Mara Wilson, Danny DeVito, Rhea Perlman, Embeth Davidtz, Pam Ferris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Stacey Sher, Liccy Dahl, Danny DeVito, Michael Shamberg', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a great story about a brilliant young girl who overcomes the cruelty of a family that does not treat her as she deserves. The villains are her parents and her teacher, Mrs Trunchbull. With the help of the kind teacher, Ms Honey, and her own magical powers, she manages to get adopted by her mentor and get rid of the villainous teacher who killed Ms Honey's parents. Not only does the book make some interesting statements about education and family, but the strong female protagonist is a neat role model for young girls. I loved it as a kid, and still appreciate it a great deal; also, the film version captures the imagery and intent nicely.<br /><br />As for the widescreen issue, it's a shame. It could have been kept the way we saw it in theatres...oh well.\nGreat adaptation!\nPaper Heart\nCharlyne Yi  (Actor, Composer),     Michael Cera  (Actor, Composer),     Nicholas Jasenovec  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', \"Charlyne Yi embarks on a quest across America to make a documentary about the one subject she doesn't fully understand: Love.\", 'Amazon.com', 'A creatively self-conscious comedy that is part real documentary and part, well, something else,', 'Paper Heart', \"begins as an inquiry by artist and comedian Charlyne Yi into the nature of love. Working closely with pal and director Nicholas Jasenovec, Yi travels the U.S. looking for anyone who will talk to her about their experiences with or perspectives about love. Along the way, she meets some wonderful people, including older folks, children, and even a celebrity (Seth Rogen) or two. But nothing shakes Yi's skepticism that there is such a thing as permanent, romantic love until actor Michael Cera (\", 'Juno', \") stumbles into her on-camera life. Shy but curious about one another, Cera and Yi cautiously hook up, troubled by the omnipresence of Jasenovec and his crew but unable to get free of Yi's agreement to allow everything to be filmed. The very pressure under which they try to make their simmering relationship work becomes the test Yi needs to believe that love is real--or, at least, cleverly scripted. It's hard to know exactly where the line is between documentary and fiction in this film, but in a way it doesn't matter. A point or two is made, and the audience gets to enjoy Yi's cardboard-cutout puppetry.\", '--Tom Keogh', 'Stills from', 'Paper Heart', '(Click for larger image)']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.63 x 5.4 x 7.65 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '6540672', 'Director': 'Nicholas Jasenovec', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'June 29, 2010', 'Actors': 'Charlyne Yi, Michael Cera, Seth Rogen, Martin Starr, Derek Waters', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nThis is an indie mockumentary about love with some amazing performers and a very naturalistic script. The pace is a little slow for my taste, and it's not my favorite genre of movie, but I appreciated it for what it was. Considering it should fall away from the beaten path of Hollywood romances, it does come across as a little trite at times, with the obvious love interest between Charlyne Yi and Michael Sera. Still, it is endearing and ok for a low-key evening.\nif you like this kind of movie, then this is good\nElement: Targeted Toning Pilates for Beginners\nElizabeth Ordway  (Actor),     Andrea Ambandos  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Filmed in a lush garden overlooking the Pacific Ocean, these three powerful 20-minute programs are designed to reach even the hardest to access muscles-which is the key to creating a slim, balanced body and achieving dramatic results. The Long Lean Waistline program stretches and tones your core muscles simultaneously to create firm, flat abs and sculpted waistline. The Lower Body Lift and Sculpt workout uses a dynamic leg series and focused \"seat lifters\" to shape and firm the entire lower half of the body. The efficient Total Body program tones and defines all of the major muscle groups in just 20 minutes for maximum full-body benefits. As a bonus, this DVD includes a 10-minute core strengthener featuring signature moves to tighten your midsection and create beautiful curves along your waistline. Each of these specially-designed programs utilizes the dynamic of working in opposition to create long, lean muscles and sculpt a strong and graceful Pilates physique.']\n{'Genre': 'Fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Elizabeth Ordway, Andrea Ambandos', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': '27576233', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 19 minutes', 'Release date': 'October 1, 2013', 'Actors': 'Elizabeth Ordway', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nI wasn't sure what to expect from this beyond some yoga-like movements that might trim some fat and build muscle, but I really liked this DVD. I am a dancer and have a once-a-week personal trainer, so I am in pretty good shape, but I don't stretch as much as I should, and my back, glutes, and legs can sometimes get a little messed up from overworking without warming up. This DVD was perfect for me because, while the &#34;exercise&#34; component wasn't really there for me (very easy), the movements had a therapeutic quality to them.<br /><br />The instructor actually did a great job explaining pilates both conceptually and in terms of how different movements could achieve different results. The demonstration of those movements was clear and easy to follow, as well, so there was no getting lost and feeling silly the way that some workout videos can do.<br /><br />Don't expect some crazy cardio-burning workout with high intensity movements. This is a Beginner's DVD that shows some basic pilates movements and will help Start your muscles moving and stretching. Good stuff!\nfeel-good, low-impact activity; great for beginners!\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Joey Soloway', 'Andrea Arnold', 'Nisha Ganatra', 'Silas Howard', 'Jim Frohna', 'Stacie Passon', 'Marta Cunningham', 'Allison Liddi-Brown', 'Marielle Heller', 'So Yong Kim'], 'Producers': ['Joey Soloway', 'Nisha Ganatra', 'Andrea Sperling', 'Victor Hsu', 'Bridget Bedard', 'Rick Rosenthal', 'Jennifer Corey'], 'Starring': ['Jeffrey Tambor', 'Gaby Hoffmann', 'Jay Duplass'], 'Studio': ['Amazon Studios']}\nThis show somehow balances sensitivity toward a still-marginalized community with a great sense of humor in a very realistic and balanced way. I am completely addicted and sadly finished the season over the course of two marathons. Impeccable casting, acting, writing, and directing. This is a  revolutionary program--keep it up, Amazon!\nhilarious, sensitive, moving!\nCrimson Peak\nMia Wasikowska  (Actor),     Jessica Chastain  (Actor),     Guillermo del Toro  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From the imagination of director Guillermo del Toro (Pan's Labyrinth) comes the gothic romance masterpiece Crimson Peak starring Tom Hiddleston, Jessica Chastain, Mia Wasikowska and Charlie Hunnam. When her heart is stolen by a seductive stranger, a young woman is swept away to a house atop a mountain of blood-red clay—a place filled with secrets that will haunt her forever. Between desire and darkness, between mystery and madness, lies the truth behind Crimson Peak.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7 x 5 x 0.5 inches; 3.2 Ounces', 'Audio Description': 'English, Spanish, French', 'Director': 'Guillermo del Toro', 'Media Format': 'Color, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '3 hours and 58 minutes', 'Release date': 'February 9, 2016', 'Actors': 'Mia Wasikowska, Jessica Chastain, Tom Hiddleston, Charlie Hunnam, Jim Beaver', 'Subtitles': 'French, Spanish', 'Producers': 'Thomas Tull, Jon Jashni, Guillermo del Toro, Callum Greene', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1), French Canadian (DTS 5.1), Spanish (DTS 5.1)', 'Studio': 'Universal', 'Writers': 'Guillermo del Toro, Matthew Robbins', 'Number of discs': '2'}\nWhat a masterfully executed throwback to classic gothic horror stories! From the impeccably researched costumes, complete with period details and smartly chosen anachronisms for a decaying family, to the haunting settings, this movie was one of my favorites last year. Excellent storyline, great casting and direction, suspense and mystery, and beautiful effects--this is a perfect movie for fans of classic horror stories!\nOmg the costumes. Classic horror story in a sumptuous setting\nTai Chi Fit for a HEALTHY BACK: Seated Workout (YMAA) David-Dorian Ross **Sitting Tai Chi Bestseller**\nDavid-Dorian Ross  (Actor),     David Silver  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['Relieve your back pain naturally with this easy program.', 'Back pain is one of the most common problems in the world, often caused by working too hard, or sometimes by not getting enough exercise. Studies show by the age of 65 more than two thirds of the population have suffered from lower back pain at least once, and a great many suffer from it daily. Back pain can make almost everything else in life nearly impossible and can lead to a sedentary lifestyle and depression.', '• Seated chair workout anyone can do!', '• Simple tai chi movements to follow-along', '• Great for seniors or those with back issues', 'Tai Chi master teacher David-Dorian Ross', 'guides you through a seated routine that can be practiced by anyone, at any age or fitness level. With repetition you will experience pain relief, strength and flexibility.', 'These seated tai chi and qigong exercises to stretch and strengthen your back will take pressure off the spine and muscles, so that you can ease into essential postures for alleviating pain and create better structural integrity.', 'These movements are gentle and easy enough that anyone can practice along, even if you haven’t exercised in years! The best news is that there is nothing to “learn” in this program. You won’t have to memorize a complicated routine or keep working to perfect any movement or position. Just follow the class, breathe deeply, and have fun.', 'DVD all regions / Region-free']\n{'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.52 x 5.39 x 0.67 inches; 3.21 Ounces', 'Director': 'David Silver', 'Media Format': 'DVD', 'Run time': '45 minutes', 'Actors': 'David-Dorian Ross', 'Studio': 'YMAA Publication Center', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWow! I cannot recommend this DVD enough! I have a foot injury that’s been keeping me down for a while, and I’ve been getting out of shape, and it’s all been rather frustrating. To be able to get back on the horse and have a fitness routine again is amazing. The movements were challenging, yet relaxing. The breath work and mindfulness that came effortlessly from the routine left me feeling loose, relaxed, and alert. As for the instructor, he’s absolutely terrific! What a calm, friendly, open energy. He’s the perfect teacher for Tai chi, and I look forward to my foot feeling better so I can try his other videos. There’s a solid chance I’ll be getting quite a few of these DVDs for my older family members. This is genuinely accessible to all fitness levels, including those with limited lower body mobility or with lower body injuries. A+++!!\nAccessible fitness for all, excellent instructor, relaxing but challenging\nTai Chi Fit for a HEALTHY HEART with David-Dorian Ross (YMAA) Mind/Body Cardio Workout **BESTSELLER** Beginner friendly\nDavid-Dorian Ross  (Actor),     David Silver  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['SALE! (Reg $30) Strengthen Your Heart, Improve Your Circulation. Harvard Medical School says Tai Chi may be the best exercise for a healthy heart and cardiovascular system.', 'In this program, Tai Chi Master-teacher David-Dorian Ross guides you through a easy follow-along healthy heart workout using the beautiful and gentle movements of Tai Chi.\\xa0 \\xa0 A healthy heart and circulatory system is so important because that’s how oxygen is delivered throughout your body, and oxygen is the key ingredient to your metabolism. Poor circulation contributes to all kinds of adverse health conditions, like diabetes, arthritis, Alzheimers and stroke. In Tai Chi, it is understood that your blood, oxygen, and energy, or Qi, circulate together and are the basis of your life. Raising your heart rate strengthens the heart, improves your vascular health, and raises your energy.', 'The American College of Sports Medicine says we need 30 minutes of continuous moderate-intensity motion to maintain basic cardiovascular health. Unlike most forms of exercise, Tai Chi movements use every part of your body all at once. This means for every minute you practice Tai Chi exercise, you’re getting as much as four times the activity as in other workouts. And yet, it’s gentle enough that even a beginner of any age or fitness level can develop a healthier heart with Tai Chi. And for an added bonus, you’ll find that Tai Chi improves your mood and raises your spirit.']\n{'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.52 x 5.43 x 0.55 inches; 3.56 Ounces', 'Director': 'David Silver', 'Media Format': 'DVD', 'Run time': '45 minutes', 'Actors': 'David-Dorian Ross', 'Producers': 'YMAA Publication Center', 'Studio': 'YMAA Publication Center', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFirst of all, I thought I was in better shape! This was a much harder workout than I thought it would be. At the same time, because it is so gentle and slow moving, it is accessible to any fitness level, even full on couch potatoes. Your arms will get tired at first, and maybe some of your lower body movements will be smaller, but you’ll get into the flow.<br /><br />The instructor has a great sense of humor and a lovely energy, and I deeply enjoyed the explanations and names of moves. This is the second DVD of his that I review, and so far, they are both excellent. I think I might be buying some extras for my parents and some older relatives, who I know could really benefit from this. In the meantime, I’m definitely going to keep up with it! It’s a great mindfulness activity, and you just feel alert and relaxed at the same time afterward. Terrific!\nMore of a workout than I expected, but doable for all levels of fitness\nTai Chi Fit for Women (YMAA) David-Dorian Ross **NEW BESTSELLER**\nDavid-Dorian Ross  (Actor),     David Silver  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Enjoy this fun and easy Tai Chi Class Specifically for Women. Perfect for Moms and the women in your life!', 'When you look at the balance of fitness routines recommended for health and longevity, it turns out that most of them were actually designed for men. They fit men’s personalities, muscle structure and physique. Fitness programs for women have often just been watered down men’s workouts. But', 'women have different needs when it comes to health and fitness. In this program, David-Dorian Ross and female TaijiFit teachers guide you through a Tai Chi workout designed especially for women.', 'Women, more than men, need a workout that both strengthens the bones and calms the immune system. Women are far more susceptible to autoimmune diseases than men, including MS, arthritis, lupus, fibromyalgia and psoriasis. Women are also more at risk for osteoporosis, or thinning bones, as they get older, which in turn affects your hormones.', 'This short Tai Chi routine can be a perfect daily workout for women. It promotes:', 'balance', 'balance', 'coordination', 'coordination', 'strength', 'strength', 'supports the immune system', 'supports the immune system', 'and raises your spirit.', 'and raises your spirit.', 'The best news is that there is nothing to “learn” in this program. You won’t have to memorize a complicated routine or keep working to perfect any movement. Just follow us for fun, and you’ll experience the healing benefits of Tai Chi. All regions / Region-free DVD.']\n{'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.6 x 5.43 x 0.63 inches; 3.63 Ounces', 'Director': 'David Silver', 'Run time': '45 minutes', 'Actors': 'David-Dorian Ross', 'Producers': 'YMAA Publication Center', 'Studio': 'YMAA Publication Center', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have a few other DVDs by the same instructor, and I absolutely love his energy, explanations, and the general flow of the class. This one was a little different than some of the others in that he had two different individuals (both women) stand in the center to do a section, which was cool, because you get to see how it looks on different bodies. He did the opening and closing sequences, or about half of the class. (He is still in the background doing them with the other two, so you can always refer to anyone in the group.)<br />I appreciate his approach to Tai Chi, which is lighthearted, with plenty of laughter, and with 40 years of experience and love for the art. The gentle movements are accessible to people of any fitness level, yet they provide a good work out that helps create a sense of balance, peace, and clarity. I highly recommend this DVD!\nExcellent instructor, wonderful DVD\n{'Content advisory': ['Flashing lights', 'nudity', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Alex Rudzinski'], 'Producers': ['Robyn Rihanna Fenty', 'Laurence \"Jay\" Brown', 'Jennifer Rosales Davis', 'Michael Antinoro', 'David Chamberlin', 'Izzie Pick Ibarra', 'Chris Wagner'], 'Starring': ['Rihanna', 'Nas', 'Daddy Yankee']}\nI feel like a lot of the negative reviews are coming from people who can’t get a grip on the fact that diversity is awesome, and that beautiful comes in every shape, size, race, and gender.<br />Amazing choreographies, wonderfully inclusive, so so sexy. This is an amazing show.\nAmazing choreographies, wonderfully inclusive, so so sexy",
  "profile": "**Updated User Profile Summary:**\n\nThe user showcases a strong affinity for classic adaptations and traditional storytelling, particularly within the gothic horror genre, favoring narratives rich in historical detail and atmosphere. Their appreciation extends to indie films that explore love and relationships, especially those featuring strong female leads.\n\nThe user is deeply committed to fitness, engaging with accessible routines that promote physical wellness and mindfulness. They value holistic practices, reflecting an understanding of the connection between fitness and overall well-being, with a particular focus on inclusivity for various mobility levels. Their recent interaction highlights an enthusiasm for programs designed with women's health in mind, emphasizing heart health and mindfulness through gentle movements.\n\nAdditionally, the user expresses progressive views on representation in media, as illustrated by their positive review of a recent show that champions diversity and inclusivity, praising its choreography and sexy, empowering presentation. They maintain a discerning perspective on adaptations, often critical of those that lack clarity, yet recognizing successful interpretations of source material. \n\nOverall, the user embodies a balanced lifestyle, intertwining a passion for impactful cinema with a commitment to fitness, while advocating for relatable narratives that address sensitive themes with both humor and grace.",
  "metrics": {
    "rouge1_f": 0.058965896589658964,
    "rouge2_f": 0.007043803653973147,
    "rougeL_f": 0.029482948294829482,
    "meteor": 0.01711092251948618,
    "bleu1": 6.185798168818157e-12,
    "bleu2": 2.6580261932546474e-12,
    "bleu3": 3.188687237905429e-13,
    "bleu4": 1.1056662319514007e-13,
    "bertscore_precision": 0.3306575417518616,
    "bertscore_recall": 0.5340834856033325,
    "bertscore_f1": 0.40844303369522095
  }
}