{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Matilda (Special Edition)\nReview Date: 2006/12/06\nStore: Mara Wilson  (Actor),     Danny DeVito  (Actor, Director, Producer)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"See the world from a kid's-eye view with MATILDA, a modern fairytale that mixes hilarious humor with the magical message of love. Mrs. Doubtfire's Mara Wilson stars as Matilda, a super-smart little girl who's woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother, and anevil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn't have to get mad to get even. 2013 BD Release: From best-selling author Roald Dahl and the unique vision of Danny DeVito comes Matilda, remastered in high definition! This modern-day fairy tale mixes hilarious humor with a magical message of love. Mrs. Doubtfire’s Mara Wilson stars as Matilda, a super-smart little girl who’s woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother and an evil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn’t have to get mad to get even. 2016 Refresh Fro\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Contributor': 'Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)  See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 5.3 x 7.4 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 98 min', 'Director': 'Danny DeVito', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 17, 2006', 'Actors': 'Mara Wilson, Danny DeVito, Rhea Perlman, Embeth Davidtz, Pam Ferris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Stacey Sher, Liccy Dahl, Danny DeVito, Michael Shamberg', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a great story about a brilliant young girl who overcomes the cruelty of a family that does not treat her as she deserves. The villains are her parents and her teacher, Mrs Trunchbull. With the help of the kind teacher, Ms Honey, and her own magical powers, she manages to get adopted by her mentor and get rid of the villainous teacher who killed Ms Honey's parents. Not only does the book make some interesting statements about education and family, but the strong female protagonist is a neat role model for young girls. I loved it as a kid, and still appreciate it a great deal; also, the film version captures the imagery and intent nicely.<br /><br />As for the widescreen issue, it's a shame. It could have been kept the way we saw it in theatres...oh well.\nReview Title: Great adaptation!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Charlie and the Chocolate Factory\nJohnny Depp  (Actor),     Freddie Highmore  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Willy Wonka, the eccentric owner of a candy factory, decides to open up his factory to five lucky kids who won a contest by finding golden tickets in his candy bars. As the tour progresses, each kid succumbs to a temptation of their weaknesses except for Charlie Bucket, an innocent child whose family has grown up in poverty in the shadow Willy Wonka's monstrous factory.\", 'Amazon.com', \"Mixed reviews and creepy comparisons to Michael Jackson notwithstanding, Tim Burton's splendidly imaginative adaptation of\", 'Charlie and the Chocolate Factory', \"would almost surely meet with Roald Dahl's approval. The celebrated author of darkly offbeat children's books vehemently disapproved of 1971's\", 'Willy Wonka and the Chocolate Factory', \"(hence the change in title), so it's only fitting that Burton and his frequent star/collaborator, Johnny Depp, should have another go, infusing the enigmatic candyman's tale with their own unique brand of imaginative oddity. Depp's pale, androgynous Wonka led some to suspect a partial riff on that most controversial of eternal children, Michael Jackson, but Burton's film is too expansively magnificent to be so narrowly defined. While preserving Dahl's morality tale on the hazards of indulgent excess, Burton's riotous explosion of color provides a wondrous setting for the lessons learned by Charlie Bucket (played by Freddie Highmore, Depp's delightful costar in\", 'Finding Neverland', \"), as he and other, less admirable children enjoy a once-in-a-lifetime tour of Wonka's confectionary wonderland. Elaborate visual effects make this an eye-candy overdose (including digitally multiplied Oompa-Loompas, all played by diminutive actor Deep Roy), and the film's underlying weirdness is exaggerated by Depp's admirably risky but ultimately off-putting performance. Of course, none of this stops Burton's Charlie from being the must-own family DVD of 2005's holiday season, perhaps even for those who staunchly defend Gene Wilder's portrayal of Wonka from 34 years earlier.\", '--Jeff Shannon', 'DVD features', 'The second disc is filled with a number of distinctive featurettes. The likely crowd-pleaser in most households is \"Attack of the Squirrels,\" which recounts how those fuzzy little creatures (a combination of hard-to-train live animals, animatronics, and computer graphics) can be ornery in their own right. \"The Fantastic Mr. Dahl\" is a 17-minute look at author Roald Dahl through vintage footage and new interviews with family, friends, and colleagues. \"Becoming Oompa-Loompa\" follows Deep Roy as he is filmed over and over again through his dance steps and music performances.', 'Roy is a constant throughout the kids\\' activities as well. You can follow him to learn two different dance steps \"Augustus Gloop\" and \"Violet Beauregarde,\" and make him taste weird candy inventions in a simple game. \"Search for the Golden Ticket\" is a five-part challenge that tests your remote-control fingers, your deductive abilities, or your luck. Finally, if you just want basic behind-the-scenes information, \"Making the Mix\" is a collection of featurettes (around 40 minutes total) covering the film\\'s casting, music, production design, and special effects.', '--David Horiuchi']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 5.6 Ounces', 'Item model number': '12569743151', 'Director': 'Tim Burton', 'Media Format': 'Dolby, Closed-captioned, Full Screen, NTSC, Dubbed, Subtitled', 'Run time': '1 hour and 55 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Johnny Depp, Freddie Highmore, David Kelly, Helena Bonham Carter, Noah Taylor', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Brad Grey, Bruce Berman, Derek Frey, Graham Burke, Katterli Frauenfelder', 'Language': 'English (Dolby Digital 5.1 EX), French (Dolby Digital 5.1 EX), Spanish (Dolby Digital 5.1 EX)', 'Studio': 'Warner Bros. Pictures', 'Writers': 'John August, Roald Dahl', 'Number of discs': '2'}\nThe newest adaptation is nothing like the book; if anything, try the Gene Wilder one, which better captures the fun-loving nature of Wonka and the silly laughs resulting from the rotten kids visiting the delicious funhouse. That screenplay, as it happens, was written by Dahl, so you know it is true to his intentions. That, and the music is more fun and catchy, whereas this one fails to impress.<br /><br />The visuals are typical for Tim Burton: beautifully dark, twisted, and a little scary. The humor is there at times, but is overshadowed by the overwhelming artistic vision and really unpleasant version of the oompa loompas. The various elements are mostly exciting, but don't quite add up to an engaging film. Nice try, but not the best.\nnot as good as the Gene Wilder version\nMatilda (Special Edition)\nMara Wilson  (Actor),     Danny DeVito  (Actor, Director, Producer)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"See the world from a kid's-eye view with MATILDA, a modern fairytale that mixes hilarious humor with the magical message of love. Mrs. Doubtfire's Mara Wilson stars as Matilda, a super-smart little girl who's woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother, and anevil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn't have to get mad to get even. 2013 BD Release: From best-selling author Roald Dahl and the unique vision of Danny DeVito comes Matilda, remastered in high definition! This modern-day fairy tale mixes hilarious humor with a magical message of love. Mrs. Doubtfire’s Mara Wilson stars as Matilda, a super-smart little girl who’s woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother and an evil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn’t have to get mad to get even. 2016 Refresh Fro\"]\n{'Genre': 'Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Contributor': 'Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)  See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 5.3 x 7.4 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 98 min', 'Director': 'Danny DeVito', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 17, 2006', 'Actors': 'Mara Wilson, Danny DeVito, Rhea Perlman, Embeth Davidtz, Pam Ferris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Stacey Sher, Liccy Dahl, Danny DeVito, Michael Shamberg', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a great story about a brilliant young girl who overcomes the cruelty of a family that does not treat her as she deserves. The villains are her parents and her teacher, Mrs Trunchbull. With the help of the kind teacher, Ms Honey, and her own magical powers, she manages to get adopted by her mentor and get rid of the villainous teacher who killed Ms Honey's parents. Not only does the book make some interesting statements about education and family, but the strong female protagonist is a neat role model for young girls. I loved it as a kid, and still appreciate it a great deal; also, the film version captures the imagery and intent nicely.<br /><br />As for the widescreen issue, it's a shame. It could have been kept the way we saw it in theatres...oh well.\nGreat adaptation!",
  "profile": "**Updated User Profile Summary:**\n\nThe user maintains a strong preference for classic adaptations and traditional storytelling, particularly favoring the original versions over modern interpretations. Their latest interaction reflects an appreciation for engaging narratives that resonate with childhood experiences, showcasing a fondness for humor and magical themes. \n\nThe user continues to exhibit interest in prominent directors and actors, particularly appreciating the work of Danny DeVito, both as an actor and director. They enjoy adaptations that stay true to the source material while highlighting strong, relatable characters, especially female protagonists, which resonates with their nostalgic feelings. \n\nTheir liking for films that present whimsical narratives is reinforced, with an emphasis on storytelling that balances visual appeal and character engagement. The user critiques adaptations when artistic vision overshadows narrative clarity but acknowledges when a film captures the intent of its source material effectively, leading them to rate it highly. \n\nOverall, the user consistently favors films that blend humor, authenticity, and a lighthearted tone, with an eye for the quality of adaptation and a nostalgic appreciation for beloved childhood stories.",
  "metrics": {
    "rouge1_f": 0.1259946949602122,
    "rouge2_f": 0.01460823373173971,
    "rougeL_f": 0.0636604774535809,
    "meteor": 0.04208687159370087,
    "bleu1": 0.0001975654818414035,
    "bleu2": 7.870156246675933e-05,
    "bleu3": 3.392189279475043e-05,
    "bleu4": 9.527914823197495e-06,
    "bertscore_precision": 0.3398081064224243,
    "bertscore_recall": 0.5125343799591064,
    "bertscore_f1": 0.4086698591709137
  }
}