{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Element: Targeted Toning Pilates for Beginners\nReview Date: 2013/12/01\nStore: Elizabeth Ordway  (Actor),     Andrea Ambandos  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Filmed in a lush garden overlooking the Pacific Ocean, these three powerful 20-minute programs are designed to reach even the hardest to access muscles-which is the key to creating a slim, balanced body and achieving dramatic results. The Long Lean Waistline program stretches and tones your core muscles simultaneously to create firm, flat abs and sculpted waistline. The Lower Body Lift and Sculpt workout uses a dynamic leg series and focused \"seat lifters\" to shape and firm the entire lower half of the body. The efficient Total Body program tones and defines all of the major muscle groups in just 20 minutes for maximum full-body benefits. As a bonus, this DVD includes a 10-minute core strengthener featuring signature moves to tighten your midsection and create beautiful curves along your waistline. Each of these specially-designed programs utilizes the dynamic of working in opposition to create long, lean muscles and sculpt a strong and graceful Pilates physique.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Elizabeth Ordway, Andrea Ambandos', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': '27576233', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 19 minutes', 'Release date': 'October 1, 2013', 'Actors': 'Elizabeth Ordway', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: I wasn't sure what to expect from this beyond some yoga-like movements that might trim some fat and build muscle, but I really liked this DVD. I am a dancer and have a once-a-week personal trainer, so I am in pretty good shape, but I don't stretch as much as I should, and my back, glutes, and legs can sometimes get a little messed up from overworking without warming up. This DVD was perfect for me because, while the &#34;exercise&#34; component wasn't really there for me (very easy), the movements had a therapeutic quality to them.<br /><br />The instructor actually did a great job explaining pilates both conceptually and in terms of how different movements could achieve different results. The demonstration of those movements was clear and easy to follow, as well, so there was no getting lost and feeling silly the way that some workout videos can do.<br /><br />Don't expect some crazy cardio-burning workout with high intensity movements. This is a Beginner's DVD that shows some basic pilates movements and will help Start your muscles moving and stretching. Good stuff!\nReview Title: feel-good, low-impact activity; great for beginners!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Charlie and the Chocolate Factory\nJohnny Depp  (Actor),     Freddie Highmore  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Willy Wonka, the eccentric owner of a candy factory, decides to open up his factory to five lucky kids who won a contest by finding golden tickets in his candy bars. As the tour progresses, each kid succumbs to a temptation of their weaknesses except for Charlie Bucket, an innocent child whose family has grown up in poverty in the shadow Willy Wonka's monstrous factory.\", 'Amazon.com', \"Mixed reviews and creepy comparisons to Michael Jackson notwithstanding, Tim Burton's splendidly imaginative adaptation of\", 'Charlie and the Chocolate Factory', \"would almost surely meet with Roald Dahl's approval. The celebrated author of darkly offbeat children's books vehemently disapproved of 1971's\", 'Willy Wonka and the Chocolate Factory', \"(hence the change in title), so it's only fitting that Burton and his frequent star/collaborator, Johnny Depp, should have another go, infusing the enigmatic candyman's tale with their own unique brand of imaginative oddity. Depp's pale, androgynous Wonka led some to suspect a partial riff on that most controversial of eternal children, Michael Jackson, but Burton's film is too expansively magnificent to be so narrowly defined. While preserving Dahl's morality tale on the hazards of indulgent excess, Burton's riotous explosion of color provides a wondrous setting for the lessons learned by Charlie Bucket (played by Freddie Highmore, Depp's delightful costar in\", 'Finding Neverland', \"), as he and other, less admirable children enjoy a once-in-a-lifetime tour of Wonka's confectionary wonderland. Elaborate visual effects make this an eye-candy overdose (including digitally multiplied Oompa-Loompas, all played by diminutive actor Deep Roy), and the film's underlying weirdness is exaggerated by Depp's admirably risky but ultimately off-putting performance. Of course, none of this stops Burton's Charlie from being the must-own family DVD of 2005's holiday season, perhaps even for those who staunchly defend Gene Wilder's portrayal of Wonka from 34 years earlier.\", '--Jeff Shannon', 'DVD features', 'The second disc is filled with a number of distinctive featurettes. The likely crowd-pleaser in most households is \"Attack of the Squirrels,\" which recounts how those fuzzy little creatures (a combination of hard-to-train live animals, animatronics, and computer graphics) can be ornery in their own right. \"The Fantastic Mr. Dahl\" is a 17-minute look at author Roald Dahl through vintage footage and new interviews with family, friends, and colleagues. \"Becoming Oompa-Loompa\" follows Deep Roy as he is filmed over and over again through his dance steps and music performances.', 'Roy is a constant throughout the kids\\' activities as well. You can follow him to learn two different dance steps \"Augustus Gloop\" and \"Violet Beauregarde,\" and make him taste weird candy inventions in a simple game. \"Search for the Golden Ticket\" is a five-part challenge that tests your remote-control fingers, your deductive abilities, or your luck. Finally, if you just want basic behind-the-scenes information, \"Making the Mix\" is a collection of featurettes (around 40 minutes total) covering the film\\'s casting, music, production design, and special effects.', '--David Horiuchi']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 5.6 Ounces', 'Item model number': '12569743151', 'Director': 'Tim Burton', 'Media Format': 'Dolby, Closed-captioned, Full Screen, NTSC, Dubbed, Subtitled', 'Run time': '1 hour and 55 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Johnny Depp, Freddie Highmore, David Kelly, Helena Bonham Carter, Noah Taylor', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Brad Grey, Bruce Berman, Derek Frey, Graham Burke, Katterli Frauenfelder', 'Language': 'English (Dolby Digital 5.1 EX), French (Dolby Digital 5.1 EX), Spanish (Dolby Digital 5.1 EX)', 'Studio': 'Warner Bros. Pictures', 'Writers': 'John August, Roald Dahl', 'Number of discs': '2'}\nThe newest adaptation is nothing like the book; if anything, try the Gene Wilder one, which better captures the fun-loving nature of Wonka and the silly laughs resulting from the rotten kids visiting the delicious funhouse. That screenplay, as it happens, was written by Dahl, so you know it is true to his intentions. That, and the music is more fun and catchy, whereas this one fails to impress.<br /><br />The visuals are typical for Tim Burton: beautifully dark, twisted, and a little scary. The humor is there at times, but is overshadowed by the overwhelming artistic vision and really unpleasant version of the oompa loompas. The various elements are mostly exciting, but don't quite add up to an engaging film. Nice try, but not the best.\nnot as good as the Gene Wilder version\nMatilda (Special Edition)\nMara Wilson  (Actor),     Danny DeVito  (Actor, Director, Producer)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"See the world from a kid's-eye view with MATILDA, a modern fairytale that mixes hilarious humor with the magical message of love. Mrs. Doubtfire's Mara Wilson stars as Matilda, a super-smart little girl who's woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother, and anevil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn't have to get mad to get even. 2013 BD Release: From best-selling author Roald Dahl and the unique vision of Danny DeVito comes Matilda, remastered in high definition! This modern-day fairy tale mixes hilarious humor with a magical message of love. Mrs. Doubtfire’s Mara Wilson stars as Matilda, a super-smart little girl who’s woefully misunderstood by her parents (Danny DeVito and Rhea Perlman), her brother and an evil school principal. But with the help of a brave best friend and a wonderful teacher, Matilda discovers she doesn’t have to get mad to get even. 2016 Refresh Fro\"]\n{'Genre': 'Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Contributor': 'Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)Stacey Sher, Mara Wilson, Danny DeVito, Embeth Davidtz, Pam Ferris, Michael Shamberg, Liccy Dahl, Rhea Perlman, Matilda Productions (TriStar)  See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 5.3 x 7.4 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 98 min', 'Director': 'Danny DeVito', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Full Screen, NTSC, Dubbed, Subtitled, Special Edition', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 17, 2006', 'Actors': 'Mara Wilson, Danny DeVito, Rhea Perlman, Embeth Davidtz, Pam Ferris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Stacey Sher, Liccy Dahl, Danny DeVito, Michael Shamberg', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a great story about a brilliant young girl who overcomes the cruelty of a family that does not treat her as she deserves. The villains are her parents and her teacher, Mrs Trunchbull. With the help of the kind teacher, Ms Honey, and her own magical powers, she manages to get adopted by her mentor and get rid of the villainous teacher who killed Ms Honey's parents. Not only does the book make some interesting statements about education and family, but the strong female protagonist is a neat role model for young girls. I loved it as a kid, and still appreciate it a great deal; also, the film version captures the imagery and intent nicely.<br /><br />As for the widescreen issue, it's a shame. It could have been kept the way we saw it in theatres...oh well.\nGreat adaptation!\nPaper Heart\nCharlyne Yi  (Actor, Composer),     Michael Cera  (Actor, Composer),     Nicholas Jasenovec  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', \"Charlyne Yi embarks on a quest across America to make a documentary about the one subject she doesn't fully understand: Love.\", 'Amazon.com', 'A creatively self-conscious comedy that is part real documentary and part, well, something else,', 'Paper Heart', \"begins as an inquiry by artist and comedian Charlyne Yi into the nature of love. Working closely with pal and director Nicholas Jasenovec, Yi travels the U.S. looking for anyone who will talk to her about their experiences with or perspectives about love. Along the way, she meets some wonderful people, including older folks, children, and even a celebrity (Seth Rogen) or two. But nothing shakes Yi's skepticism that there is such a thing as permanent, romantic love until actor Michael Cera (\", 'Juno', \") stumbles into her on-camera life. Shy but curious about one another, Cera and Yi cautiously hook up, troubled by the omnipresence of Jasenovec and his crew but unable to get free of Yi's agreement to allow everything to be filmed. The very pressure under which they try to make their simmering relationship work becomes the test Yi needs to believe that love is real--or, at least, cleverly scripted. It's hard to know exactly where the line is between documentary and fiction in this film, but in a way it doesn't matter. A point or two is made, and the audience gets to enjoy Yi's cardboard-cutout puppetry.\", '--Tom Keogh', 'Stills from', 'Paper Heart', '(Click for larger image)']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.63 x 5.4 x 7.65 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '6540672', 'Director': 'Nicholas Jasenovec', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'June 29, 2010', 'Actors': 'Charlyne Yi, Michael Cera, Seth Rogen, Martin Starr, Derek Waters', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nThis is an indie mockumentary about love with some amazing performers and a very naturalistic script. The pace is a little slow for my taste, and it's not my favorite genre of movie, but I appreciated it for what it was. Considering it should fall away from the beaten path of Hollywood romances, it does come across as a little trite at times, with the obvious love interest between Charlyne Yi and Michael Sera. Still, it is endearing and ok for a low-key evening.\nif you like this kind of movie, then this is good\nElement: Targeted Toning Pilates for Beginners\nElizabeth Ordway  (Actor),     Andrea Ambandos  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Filmed in a lush garden overlooking the Pacific Ocean, these three powerful 20-minute programs are designed to reach even the hardest to access muscles-which is the key to creating a slim, balanced body and achieving dramatic results. The Long Lean Waistline program stretches and tones your core muscles simultaneously to create firm, flat abs and sculpted waistline. The Lower Body Lift and Sculpt workout uses a dynamic leg series and focused \"seat lifters\" to shape and firm the entire lower half of the body. The efficient Total Body program tones and defines all of the major muscle groups in just 20 minutes for maximum full-body benefits. As a bonus, this DVD includes a 10-minute core strengthener featuring signature moves to tighten your midsection and create beautiful curves along your waistline. Each of these specially-designed programs utilizes the dynamic of working in opposition to create long, lean muscles and sculpt a strong and graceful Pilates physique.']\n{'Genre': 'Fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Elizabeth Ordway, Andrea Ambandos', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': '27576233', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 19 minutes', 'Release date': 'October 1, 2013', 'Actors': 'Elizabeth Ordway', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nI wasn't sure what to expect from this beyond some yoga-like movements that might trim some fat and build muscle, but I really liked this DVD. I am a dancer and have a once-a-week personal trainer, so I am in pretty good shape, but I don't stretch as much as I should, and my back, glutes, and legs can sometimes get a little messed up from overworking without warming up. This DVD was perfect for me because, while the &#34;exercise&#34; component wasn't really there for me (very easy), the movements had a therapeutic quality to them.<br /><br />The instructor actually did a great job explaining pilates both conceptually and in terms of how different movements could achieve different results. The demonstration of those movements was clear and easy to follow, as well, so there was no getting lost and feeling silly the way that some workout videos can do.<br /><br />Don't expect some crazy cardio-burning workout with high intensity movements. This is a Beginner's DVD that shows some basic pilates movements and will help Start your muscles moving and stretching. Good stuff!\nfeel-good, low-impact activity; great for beginners!",
  "profile": "**Updated User Profile Summary:**\n\nThe user exhibits a strong preference for classic adaptations and traditional storytelling, favoring original versions over modern reinterpretations. Their latest interaction highlights an appreciation for indie films that explore themes of love and relationships, emphasizing character-driven narratives, though the pace of the film felt slow compared to their favorites. They value unique, naturalistic storytelling and relatable characters, as well as whimsical narratives that balance humor and authenticity, particularly those with strong female leads.\n\nThe user acknowledges the craftsmanship of notable directors and actors, praising Danny DeVito specifically. They are critical of adaptations that compromise clarity for artistic vision while recognizing when a film captures the essence of its source material. Their recent interaction reveals an interest in fitness and wellness, particularly low-impact exercise that emphasizes therapeutic benefits and proper instruction, aligning with their appreciation for authenticity and clear guidance in narratives. \n\nOverall, the user favors films that blend humor, relatability, and a lighthearted tone, alongside a nostalgic appreciation for childhood stories. Their engagement extends beyond cinematic experiences to include wellness practices, demonstrating a dedication to self-care and maintaining balance in their life. This reflects a holistic approach to their interests, valuing both character engagement in films and personal well-being through fitness.",
  "metrics": {
    "rouge1_f": 0.1013787510137875,
    "rouge2_f": 0.011363636363636366,
    "rougeL_f": 0.053527980535279795,
    "meteor": 0.030201292298920775,
    "bleu1": 4.232241419552175e-06,
    "bleu2": 1.6495412227386187e-06,
    "bleu3": 5.800995948307504e-07,
    "bleu4": 1.6284849861272946e-07,
    "bertscore_precision": 0.347798228263855,
    "bertscore_recall": 0.5172916054725647,
    "bertscore_f1": 0.4159408509731293
  }
}