{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/04/28\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gary A. Randall', 'Eric Laneuville', 'Kelly Makin', 'Jonathan Frakes', 'Randy Zisk', 'Timothy Busfield', 'Jeff Bleckner', 'Lee Rose', 'Ron Underwood', 'Tricia Brock'], 'Studio': ['FOX']}\nReview Text: I love this series.  I am just frustrated that A&E discontinued it.  I heard they left you hanging too.  That's annoying.\nReview Title: Great series... but heard A&E canceled it...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Italian Job [Blu-ray]\nDonald Sutherland  (Actor),     Mark Wahlberg  (Actor),     F. Gary Gray  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['The plan was flawless. The execution was perfect. Charlie Croker pulled off the crime of a lifetime. The one thing that he didn\\'t plan on was being double-crossed. Now he wants more than the job\\'s payoff... he wants payback. Mark Wahlberg is electrifying as Croker in this \"fast and furious action-adventure.\" Along with a drop-dead gorgeous safecracker (Charlize Theron), Croker and his team take off to re-steal the loot and end up in a pulse-pounding, pedal-to-the-metal chase that careens up, down and below the streets of Los Angeles. With an ensemble all-star cast that also includes Edward Norton, Seth Green, Jason Statham, Mos Def, Franky G and Donald Sutherland, the Italian Job is hot!']\n{'Genre': 'Action & Adventure', 'Format': \"NTSC, Special Edition, Collector's Edition, Subtitled, Color, Multiple Formats, Blu-ray, Dolby, DTS Surround Sound, WidescreenNTSC, Special Edition, Collector's Edition, Subtitled, Color, Multiple Formats, Blu-ray, Dolby, DTS Surround Sound, Widescreen   See more\", 'Contributor': 'F. Gary Gray, Tiberio Greco, Stefano Petronelli, Jason Statham, Seth Green, Donald Sutherland, Mark Wahlberg, Wayne Powers, Fabio Scarpa, Fausto Callegarini, Troy Kennedy-Martin, Donna Powers, Mos Def, Edward Norton, Cristiano Bonora, Charlize TheronF. Gary Gray, Tiberio Greco, Stefano Petronelli, Jason Statham, Seth Green, Donald Sutherland, Mark Wahlberg, Wayne Powers, Fabio Scarpa, Fausto Callegarini, Troy Kennedy-Martin, Donna Powers, Mos Def, Edward Norton, Cristiano Bonora, Charlize Theron   See more', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '118314', 'Director': 'F. Gary Gray', 'Media Format': \"Blu-ray, Multiple Formats, Special Edition, Widescreen, DTS Surround Sound, NTSC, Dolby, Collector's Edition, Color, Subtitled\", 'Run time': '1 hour and 51 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Donald Sutherland, Mark Wahlberg, Edward Norton, Charlize Theron, Jason Statham', 'Subtitles': 'Spanish, French, English', 'Studio': 'Paramount', 'Writers': 'Donna Powers, Troy Kennedy-Martin, Wayne Powers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have a top of the line Sony 52\" XBR TV and Sony Blu-Ray player we purchased for Christmas and I purchased the Blu-ray version of this movie because we enjoy the movie so much.  It wasn't worth it!  It has trouble rewriting quickly during the action scenes.  We actually compared it to the regular DVD that we own and to be honest... it isn't worth the additional expense to purchase the Blu-ray.  Overall, we have noticed that with all of the older movies that have been converted to Blu-ray... they tend to be a disappointment in the blu-ray version for the same rewriting problems.  However, animations are incredible and all of the new movies that have recently been released in the theaters that are just coming out on Blu-Ray are great... like Ironman... that one was incredible on Blu-ray.\nMovie is great... Blu-Ray is terrible\nIron Man (Two-Disc Ultimate Edition + BD Live) [Blu-ray]\nRobert Downey Jr.  (Actor),     Gwyneth Paltrow  (Actor),     Jon Favreau  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Suit up for action with Robert Downey Jr. in the ultimate adventure movie you\\x92ve been waiting for,', 'Iron Man', '! When jet-setting genius-industrialist Tony Stark is captured in enemy territory, he builds a high-tech suit of armor to escape. Now, he\\x92s on a mission to save the world as a hero who\\x92s built, not born, to be unlike any other. Co-starring Gwyneth Paltrow, Terrence Howard and Jeff Bridges, it\\x92s a fantastic, high-flying journey that is \"hugely entertaining\" (Joe Morgenstern, The Wall Street Journal).', 'Amazon.com', \"You know you're going to get a different kind of superhero when you cast Robert Downey Jr. in the lead role. And\", 'Iron Man', \"is different, in welcome ways. Cleverly updated from Marvel Comics' longstanding series,\", 'Iron Man', \"puts billionaire industrialist Tony Stark (that's Downey) in the path of some Middle Eastern terrorists; in a brilliantly paced section, Stark invents an indestructible suit that allows him to escape. If the rest of the movie never quit hits that precise rhythm again, it nevertheless offers plenty of pleasure, as the renewed Stark swears off his past as a weapons manufacturer, develops his new Iron Man suit, and puzzles both his business partner (Jeff Bridges in great form) and executive assistant (Gwyneth Paltrow). Director Jon Favreau geeks out in fun ways with the hardware, but never lets it overpower the movie, and there's always a goofy one-liner or a slapstick pratfall around to break the tension. As for Downey, he doesn't get to jitterbug around too much in his improv way, but he brings enough of his unpredictable personality to keep the thing fresh. And listen up, hardcore Marvel mavens: even if you know the Stan Lee cameo is coming, you won't be able to guess it until it's on the screen. It all builds to a splendid final scene, with a concluding line delivery by Downey that just feels absolutely right.\", '--Robert Horton', 'Stills from', 'Iron Man', '(Click for larger image)']\n{'Genre': 'Action & Adventure', 'Format': 'Closed-captioned, Color, Widescreen', 'Contributor': 'Jon Favreau, Robert Downey Jr., Terrence Howard, Gwyneth Paltrow, Jeff Bridges', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 5 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Jon Favreau', 'Media Format': 'Closed-captioned, Color, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'September 30, 2008', 'Actors': 'Robert Downey Jr., Gwyneth Paltrow, Terrence Howard, Jeff Bridges', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nThis was an excellent movie... probably one of Robert Downy Jr.'s best.  Unlike most Blu-ray movies that are older that have been converted to blu-ray, this one (being so new) was meant for Blu-ray.  It is truly incredible in HD.  The colors are so vibrant and you can see ever little detail on our 52\" Sony Bravia.  This is worth every penny!\nGreat movie... and even more incredible on Blu-ray\nThe Chronicles of Narnia\nThe Lion the Witch and the Wardrobe [Blu-ray]  (Actor),     Prince Caspian [Blu-ray]  (Actor)    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['The Chronicles of Narnia: The Lion, the Witch and the Wardrobe', \"Prepare to enter another world when Walt Disney Pictures and Walden Media invite you to experience C.S. Lewis' timeless and beloved adventure as never before on Blu-ray Disc\\x99. Join Lucy Edmund Susan and Peter four siblings who step through a magical wardrobe and find the land of Narnia. There they discover a charming once-peaceful kingdom that has been plunged into eternal winter by the evil White Witch Jadis. Aided by the magnificent lion Aslan the children lead Narnia into a tremendous climactic battle to be free of the Witch's glacial powers forever! And now the stunningly realistic special effects are even more breathtaking in the astounding clarity of high definition. Meet talking beasts dwarfs fauns centaurs giants and more! Meanwhile every sound -- from the roar of Aslan to the echo of battle trumpets and the gentle rustling of leaves -- comes alive with spectacularly enhanced audio quality. Live the adventure of a lifetime as if for the very first time with Disney Blu-ray -- Magic in High Definition.System Requirements:Running Time: 135 minutesFormat: BLU-RAY DISC Genre: CHILDREN/FAMILY Rating: PG UPC: 786936751963 Manufacturer No: 05614900\", 'The Chronicles of Narnia: Prince Caspian', \"The magical world of C.S. Lewis' beloved fantasy comes to life once again in\", 'Prince Caspian', ', the second installment of', 'The Chronicles of Narnia', 'series. Join Peter, Susan, Edmund Lucy, the mighty and majestic Aslan, friendly new Narnian creatures and Prince Caspian as they lead the Narnians on a remarkable journey to restore peace and glory to their enchanted land. Continuing the adventure of', 'The Lion, the Witch, and the Wardrobe with more magic and a brand-new hero,', 'Prince Caspian', 'is a triumph of imagination, courage, love, joy and humor your whole family will want to watch again and again']\n{'Package Dimensions': '6.6 x 5.4 x 1 inches; 9.6 Ounces', 'Media Format': 'Blu-ray', 'Release date': 'December 2, 2008', 'Actors': 'The Lion the Witch and the Wardrobe [Blu-ray], Prince Caspian [Blu-ray]', 'Studio': 'Walt Disney Video', 'Number of discs': '2'}\nThis is well worth the little extra cash that you pay for Blu-ray.  The picture is incredible and the movie is exceptional.\nLove the Chronicles of Narnia series and Blu-ray makes it even better\nCloudy with a Chance of Meatballs [Blu-ray]\nAnna Faris  (Actor),     Bruce Campbell  (Actor),     Phil Lord  (Director),     Christopher Miller  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Award Winners in Movies & TV, Golden Globe Central, Past Golden Globe Winners\n['Product Description', 'When Flint Lockwood’s (Bill Hader) latest contraption accidentally destroys the town square and rockets up into the clouds, he thinks his inventing career is over. Then something amazing happens as delicious cheeseburgers start raining from the sky. His machine actually works! But when people greedily ask for more and more food, the machine starts to run amok, unleashing spaghetti tornadoes and giant meatballs that threaten the world! Now it’s up to Flint, with the help of weather girl Sam Sparks (Anna Faris) and Steve, his talking monkey assistant, to find some way to shut down the machine before the world is covered in super-sized meatballs!', 'Amazon.com', \"Judi and Ron Barrett's\", 'Cloudy with a Chance of Meatballs', \"is a much-loved, whimsical book about a tiny island where food falls from the sky like rain. The book serves as a jumping-off point for Sony's animated, digital 3-D\", 'Cloudy with a Chance of Meatballs', 'which is not so much a retelling of the book as an exploration of what makes food rain from the sky on a small island in the middle of the Atlantic Ocean. Flint (Bill Hader), a clever young inventor with a reputation for creations gone awry, has recently completed a machine that he claims will turn water into food. Like his past failed inventions, Flint\\'s new food-converting machine doesn\\'t work as planned, and on its initial test run it ends up getting launched into the sky where clouds form and begin to rain cheeseburgers. The falling burgers destroy the Swallow Falls community\\'s latest attempt to bolster its failing, sardine-dependent economy, but the Mayor\\'s (Bruce Campbell) initial fury quickly turns to greedy anticipation as he begins to realize that food falling from the sky could serve as an innovative tourist draw. As the entire town is caught up re-defining itself as \"Chew and Swallow,\" only Flint\\'s father (James Caan) remains skeptical of his son\\'s invention. Greed leads to some very strange weather events like spaghetti twisters and extra-giant food which, while providing a huge career opportunity for brainy weather intern Sam Sparks (Anna Faris) who\\'s masquerading as an air-headed television personality, also threaten to destroy the town and its inhabitants. In the end, only the collaborative efforts of Flint, his father, and Sam can save the town of Chew and Swallow from certain destruction by the out of control invention.', 'Cloudy with a Chance of Meatballs', \"is a funny, imaginative film that's well-animated and immensely entertaining for kids and adults. Rated PG for brief mild language, but appropriate for most ages 5 and older.\", '--Tami Horiuchi', 'Stills from', 'Cloudy with a Chance of Meatballs', '(Click for larger image)']\n{'Genre': 'Family, Comedy', 'Format': 'Blu-ray', 'Contributor': \"Bill Hader, Al Roker, Phil Lord, Christopher Miller, Mr. T, Neil Patrick Harris, Bruce Campbell, Anna Faris, Bobb'e J. Thompson, Lauren Graham, Benjamin Bratt, James Caan, Will Forte, Andy SambergBill Hader, Al Roker, Phil Lord, Christopher Miller, Mr. T, Neil Patrick Harris, Bruce Campbell, Anna Faris, Bobb'e J. Thompson, Lauren Graham, Benjamin Bratt, James Caan, Will Forte, Andy Samberg  See more\", 'Language': 'English, French, Spanish', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 0.71 Ounces', 'Item model number': '43396215665', 'Director': 'Phil Lord, Christopher Miller', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 5, 2010', 'Actors': 'Anna Faris, Bruce Campbell, Bill Hader, James Caan, Andy Samberg', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThe movie is GREAT.  My complaint and reason for the one star is that it eems Sony got a bit sneaky with this one.  They list a digital copy as part of the set.  I paid more for this set expecting to get the digital copy.  There is one problem... the digital copy only works with a Sony Playstation 3.  It does say this on the back jacket of the disc set.  However, when I ordered it off of Amazon, I had no idea until I opened the package.  I won't be buying another Sony disc with the promise of a digital copy.\nMovie is great... beware of digital copy promise\nAmerican Heritage Series - Ten DVD Set\nDavid Barton  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n[\"Join historian David Barton and experience the untold story of our nation's history in the American Heritage Series. Discover the forgotten and astonishing story of our nation's foundation in the American Heritage Series. For centuries, Americans were taught a truthful view of history that recognized the Godly heroes and moral foundation our nation was founded upon. But in recent years, a new version of history has assaulted the moral and spiritual fiber of our nation, leaving the truth of our past eliminated and forgotten. Until today. From Separation of Church and State, to the Civil Rights Movement, the heroism of our founding Fathers to the building of our nation's monuments, this series will inspire every American to reclaim the Godly, true story of our nation.\", \"When sold by Amazon.com, this product is manufactured on demand using DVD-R recordable media. Amazon.com's standard return policy will apply.\"]\n{'Genre': 'faith_&_spirituality', 'Format': 'NTSC', 'Contributor': 'David Barton', 'Language': 'Unqualified', 'Number Of Discs': '10', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 6 inches; 1.4 Pounds', 'Item model number': '14544071', 'Director': 'David Barton', 'Media Format': 'NTSC', 'Run time': '13 hours', 'Release date': 'August 11, 2009', 'Actors': 'David Barton', 'Studio': 'Bridgestone', 'Number of discs': '10'}\nDavid Barton has really done his research.  This series has made me review all of my children's text books and I have found so many things that are wrong.  This series is so fascinating and I am glad I purchased it.\nDefinitely makes me check my kids history books now...\nDolphin Tale [Blu-ray]\nMorgan Freeman  (Actor),     Ashley Judd  (Actor),     Charles Martin Smith  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n[\"In an inspiring story of the bond between animals and humans, a boy named Sawyer discovers an injured dolphin, who is brought to a marine hospital and named Winter. Unfortunately, her injuries cost Winter her tail, without which she may not survive. But with Sawyer's devotion, a marine biologist's (Harry Connick Jr.) and the brilliance of a prosthetist (Morgan Freeman) charged with creating a new tail, Winter may receive a second chance at life.\"]\n{'Genre': 'Kids & Family', 'Format': 'NTSC, Subtitled', 'Contributor': 'Ashley Judd, Morgan Freeman, Charles Martin Smith, Nathan Gamble', 'Language': 'Portuguese (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Warner Bros. Pictures', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'WHV1000204282BR', 'Director': 'Charles Martin Smith', 'Media Format': 'NTSC, Subtitled', 'Release date': 'December 20, 2011', 'Actors': 'Morgan Freeman, Ashley Judd, Nathan Gamble', 'Number of discs': '1'}\nFirst... let me say I thought the movie was a 4 1/2 star movie.  My complaints are with this Combo set.  This was my first combo DVD/Blu Ray/Digital where it is an ultraviolet digital copy. I must admit that I didn't fully understand the whole \"ULTRAVIOLET\" thing when I purchased it, so I must admit I made some poor assumptions.  All of the past purchases (with the exception of one Sony which would only play if I had a PlayStation) have come with a digital copy I could download to my computer and place on my kid's iPods. But this one... BUYER BEWARE... it only allows you to stream the video through Flixter.  This doesn't help when you're in the car and don't have an internet connection.  I need a digital copy my kids can watch on their iPods while we are traveling in the car.  So, this combo pack is a complete waste of time.  I would have done better to purchase the DVD and burn my own digital copy to the iPods.  I will know better next time.  Also, you have to sign up for a Flixter account and select several required boxes which I did not agree with.  So, this whole marketing scheme they have going is awful!  I will never buy another combo that comes with the ultraviolet digital copy.\nBEWARE OF ULTRAVIOLET... the movie is GREAT.\nReal Genius\nScience Fiction, Comedy, Cerebral, Strange\n['An eccentric group of college student geniuses are recruited to work on the latest generation laser beam - but when they find out the truth behind their experiments, they plot a hilarious revenge!']\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Martha Coolidge'], 'Producers': ['Brian Grazer'], 'Starring': ['Val Kilmer', 'Gabe Jarret', 'William Atherton']}\nI love this film!  I think this is one of the greatest films made from the 80's!the music and cast are great!\nA classic!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gary A. Randall', 'Eric Laneuville', 'Kelly Makin', 'Jonathan Frakes', 'Randy Zisk', 'Timothy Busfield', 'Jeff Bleckner', 'Lee Rose', 'Ron Underwood', 'Tricia Brock'], 'Studio': ['FOX']}\nI love this series.  I am just frustrated that A&E discontinued it.  I heard they left you hanging too.  That's annoying.\nGreat series... but heard A&E canceled it...",
  "profile": "**User Preferences Summary:**\n\n- **Movie Genre Preference:** The user maintains a strong affinity for action and adventure films, family-friendly fantasy, and documentaries focusing on historical and educational narratives. Recently, they have also developed an appreciation for science fiction and cerebral comedies with unconventional storytelling. A nostalgic interest in quality cinema from the 80s is evident in their latest interaction, highlighting a preference for films with strong character ensembles and memorable soundtracks.\n  \n- **Actor Affinity:** The user favors star-studded casts, particularly in comedy and family genres. Their interest has expanded to films featuring prominent historical figures or scholars, reflecting their desire for informed storytelling.\n\n- **Format Feedback:** The user values Blu-ray for its superior quality but is frustrated with digital formats, particularly combo packs with streaming-only digital copies. A recent negative experience has heightened their concerns regarding product transparency and usability, especially for family viewing.\n\n- **Viewing Equipment:** The user owns high-quality entertainment equipment to enhance their experiences with high-definition films and educational content.\n\n- **Critical Reviewer:** The user provides detailed reviews, showcasing a discerning eye for storytelling and technical execution. They express interest in media that challenges conventional narratives and maintain a critical perspective on inaccuracies in educational content. Their latest review indicates a passion for series that provide cohesive storytelling, underscoring a commitment to quality entertainment.",
  "metrics": {
    "rouge1_f": 0.07416127133608005,
    "rouge2_f": 0.005300353356890459,
    "rougeL_f": 0.03766921718658034,
    "meteor": 0.02150678921508073,
    "bleu1": 1.7134022440356725e-07,
    "bleu2": 3.838451874075285e-08,
    "bleu3": 5.9623090133795595e-09,
    "bleu4": 2.352082831867707e-09,
    "bertscore_precision": 0.3538382053375244,
    "bertscore_recall": 0.5022633075714111,
    "bertscore_f1": 0.41518428921699524
  }
}