{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Chronicles of Narnia\nReview Date: 2009/01/19\nStore: The Lion the Witch and the Wardrobe [Blu-ray]  (Actor),     Prince Caspian [Blu-ray]  (Actor)    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: ['The Chronicles of Narnia: The Lion, the Witch and the Wardrobe', \"Prepare to enter another world when Walt Disney Pictures and Walden Media invite you to experience C.S. Lewis' timeless and beloved adventure as never before on Blu-ray Disc\\x99. Join Lucy Edmund Susan and Peter four siblings who step through a magical wardrobe and find the land of Narnia. There they discover a charming once-peaceful kingdom that has been plunged into eternal winter by the evil White Witch Jadis. Aided by the magnificent lion Aslan the children lead Narnia into a tremendous climactic battle to be free of the Witch's glacial powers forever! And now the stunningly realistic special effects are even more breathtaking in the astounding clarity of high definition. Meet talking beasts dwarfs fauns centaurs giants and more! Meanwhile every sound -- from the roar of Aslan to the echo of battle trumpets and the gentle rustling of leaves -- comes alive with spectacularly enhanced audio quality. Live the adventure of a lifetime as if for the very first time with Disney Blu-ray -- Magic in High Definition.System Requirements:Running Time: 135 minutesFormat: BLU-RAY DISC Genre: CHILDREN/FAMILY Rating: PG UPC: 786936751963 Manufacturer No: 05614900\", 'The Chronicles of Narnia: Prince Caspian', \"The magical world of C.S. Lewis' beloved fantasy comes to life once again in\", 'Prince Caspian', ', the second installment of', 'The Chronicles of Narnia', 'series. Join Peter, Susan, Edmund Lucy, the mighty and majestic Aslan, friendly new Narnian creatures and Prince Caspian as they lead the Narnians on a remarkable journey to restore peace and glory to their enchanted land. Continuing the adventure of', 'The Lion, the Witch, and the Wardrobe with more magic and a brand-new hero,', 'Prince Caspian', 'is a triumph of imagination, courage, love, joy and humor your whole family will want to watch again and again']\nAverage Rating: 4.7\nProduct Details: {'Package Dimensions': '6.6 x 5.4 x 1 inches; 9.6 Ounces', 'Media Format': 'Blu-ray', 'Release date': 'December 2, 2008', 'Actors': 'The Lion the Witch and the Wardrobe [Blu-ray], Prince Caspian [Blu-ray]', 'Studio': 'Walt Disney Video', 'Number of discs': '2'}\nReview Text: This is well worth the little extra cash that you pay for Blu-ray.  The picture is incredible and the movie is exceptional.\nReview Title: Love the Chronicles of Narnia series and Blu-ray makes it even better\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Italian Job [Blu-ray]\nDonald Sutherland  (Actor),     Mark Wahlberg  (Actor),     F. Gary Gray  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['The plan was flawless. The execution was perfect. Charlie Croker pulled off the crime of a lifetime. The one thing that he didn\\'t plan on was being double-crossed. Now he wants more than the job\\'s payoff... he wants payback. Mark Wahlberg is electrifying as Croker in this \"fast and furious action-adventure.\" Along with a drop-dead gorgeous safecracker (Charlize Theron), Croker and his team take off to re-steal the loot and end up in a pulse-pounding, pedal-to-the-metal chase that careens up, down and below the streets of Los Angeles. With an ensemble all-star cast that also includes Edward Norton, Seth Green, Jason Statham, Mos Def, Franky G and Donald Sutherland, the Italian Job is hot!']\n{'Genre': 'Action & Adventure', 'Format': \"NTSC, Special Edition, Collector's Edition, Subtitled, Color, Multiple Formats, Blu-ray, Dolby, DTS Surround Sound, WidescreenNTSC, Special Edition, Collector's Edition, Subtitled, Color, Multiple Formats, Blu-ray, Dolby, DTS Surround Sound, Widescreen   See more\", 'Contributor': 'F. Gary Gray, Tiberio Greco, Stefano Petronelli, Jason Statham, Seth Green, Donald Sutherland, Mark Wahlberg, Wayne Powers, Fabio Scarpa, Fausto Callegarini, Troy Kennedy-Martin, Donna Powers, Mos Def, Edward Norton, Cristiano Bonora, Charlize TheronF. Gary Gray, Tiberio Greco, Stefano Petronelli, Jason Statham, Seth Green, Donald Sutherland, Mark Wahlberg, Wayne Powers, Fabio Scarpa, Fausto Callegarini, Troy Kennedy-Martin, Donna Powers, Mos Def, Edward Norton, Cristiano Bonora, Charlize Theron   See more', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '118314', 'Director': 'F. Gary Gray', 'Media Format': \"Blu-ray, Multiple Formats, Special Edition, Widescreen, DTS Surround Sound, NTSC, Dolby, Collector's Edition, Color, Subtitled\", 'Run time': '1 hour and 51 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Donald Sutherland, Mark Wahlberg, Edward Norton, Charlize Theron, Jason Statham', 'Subtitles': 'Spanish, French, English', 'Studio': 'Paramount', 'Writers': 'Donna Powers, Troy Kennedy-Martin, Wayne Powers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have a top of the line Sony 52\" XBR TV and Sony Blu-Ray player we purchased for Christmas and I purchased the Blu-ray version of this movie because we enjoy the movie so much.  It wasn't worth it!  It has trouble rewriting quickly during the action scenes.  We actually compared it to the regular DVD that we own and to be honest... it isn't worth the additional expense to purchase the Blu-ray.  Overall, we have noticed that with all of the older movies that have been converted to Blu-ray... they tend to be a disappointment in the blu-ray version for the same rewriting problems.  However, animations are incredible and all of the new movies that have recently been released in the theaters that are just coming out on Blu-Ray are great... like Ironman... that one was incredible on Blu-ray.\nMovie is great... Blu-Ray is terrible\nIron Man (Two-Disc Ultimate Edition + BD Live) [Blu-ray]\nRobert Downey Jr.  (Actor),     Gwyneth Paltrow  (Actor),     Jon Favreau  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Suit up for action with Robert Downey Jr. in the ultimate adventure movie you\\x92ve been waiting for,', 'Iron Man', '! When jet-setting genius-industrialist Tony Stark is captured in enemy territory, he builds a high-tech suit of armor to escape. Now, he\\x92s on a mission to save the world as a hero who\\x92s built, not born, to be unlike any other. Co-starring Gwyneth Paltrow, Terrence Howard and Jeff Bridges, it\\x92s a fantastic, high-flying journey that is \"hugely entertaining\" (Joe Morgenstern, The Wall Street Journal).', 'Amazon.com', \"You know you're going to get a different kind of superhero when you cast Robert Downey Jr. in the lead role. And\", 'Iron Man', \"is different, in welcome ways. Cleverly updated from Marvel Comics' longstanding series,\", 'Iron Man', \"puts billionaire industrialist Tony Stark (that's Downey) in the path of some Middle Eastern terrorists; in a brilliantly paced section, Stark invents an indestructible suit that allows him to escape. If the rest of the movie never quit hits that precise rhythm again, it nevertheless offers plenty of pleasure, as the renewed Stark swears off his past as a weapons manufacturer, develops his new Iron Man suit, and puzzles both his business partner (Jeff Bridges in great form) and executive assistant (Gwyneth Paltrow). Director Jon Favreau geeks out in fun ways with the hardware, but never lets it overpower the movie, and there's always a goofy one-liner or a slapstick pratfall around to break the tension. As for Downey, he doesn't get to jitterbug around too much in his improv way, but he brings enough of his unpredictable personality to keep the thing fresh. And listen up, hardcore Marvel mavens: even if you know the Stan Lee cameo is coming, you won't be able to guess it until it's on the screen. It all builds to a splendid final scene, with a concluding line delivery by Downey that just feels absolutely right.\", '--Robert Horton', 'Stills from', 'Iron Man', '(Click for larger image)']\n{'Genre': 'Action & Adventure', 'Format': 'Closed-captioned, Color, Widescreen', 'Contributor': 'Jon Favreau, Robert Downey Jr., Terrence Howard, Gwyneth Paltrow, Jeff Bridges', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 5 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Jon Favreau', 'Media Format': 'Closed-captioned, Color, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'September 30, 2008', 'Actors': 'Robert Downey Jr., Gwyneth Paltrow, Terrence Howard, Jeff Bridges', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nThis was an excellent movie... probably one of Robert Downy Jr.'s best.  Unlike most Blu-ray movies that are older that have been converted to blu-ray, this one (being so new) was meant for Blu-ray.  It is truly incredible in HD.  The colors are so vibrant and you can see ever little detail on our 52\" Sony Bravia.  This is worth every penny!\nGreat movie... and even more incredible on Blu-ray\nThe Chronicles of Narnia\nThe Lion the Witch and the Wardrobe [Blu-ray]  (Actor),     Prince Caspian [Blu-ray]  (Actor)    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['The Chronicles of Narnia: The Lion, the Witch and the Wardrobe', \"Prepare to enter another world when Walt Disney Pictures and Walden Media invite you to experience C.S. Lewis' timeless and beloved adventure as never before on Blu-ray Disc\\x99. Join Lucy Edmund Susan and Peter four siblings who step through a magical wardrobe and find the land of Narnia. There they discover a charming once-peaceful kingdom that has been plunged into eternal winter by the evil White Witch Jadis. Aided by the magnificent lion Aslan the children lead Narnia into a tremendous climactic battle to be free of the Witch's glacial powers forever! And now the stunningly realistic special effects are even more breathtaking in the astounding clarity of high definition. Meet talking beasts dwarfs fauns centaurs giants and more! Meanwhile every sound -- from the roar of Aslan to the echo of battle trumpets and the gentle rustling of leaves -- comes alive with spectacularly enhanced audio quality. Live the adventure of a lifetime as if for the very first time with Disney Blu-ray -- Magic in High Definition.System Requirements:Running Time: 135 minutesFormat: BLU-RAY DISC Genre: CHILDREN/FAMILY Rating: PG UPC: 786936751963 Manufacturer No: 05614900\", 'The Chronicles of Narnia: Prince Caspian', \"The magical world of C.S. Lewis' beloved fantasy comes to life once again in\", 'Prince Caspian', ', the second installment of', 'The Chronicles of Narnia', 'series. Join Peter, Susan, Edmund Lucy, the mighty and majestic Aslan, friendly new Narnian creatures and Prince Caspian as they lead the Narnians on a remarkable journey to restore peace and glory to their enchanted land. Continuing the adventure of', 'The Lion, the Witch, and the Wardrobe with more magic and a brand-new hero,', 'Prince Caspian', 'is a triumph of imagination, courage, love, joy and humor your whole family will want to watch again and again']\n{'Package Dimensions': '6.6 x 5.4 x 1 inches; 9.6 Ounces', 'Media Format': 'Blu-ray', 'Release date': 'December 2, 2008', 'Actors': 'The Lion the Witch and the Wardrobe [Blu-ray], Prince Caspian [Blu-ray]', 'Studio': 'Walt Disney Video', 'Number of discs': '2'}\nThis is well worth the little extra cash that you pay for Blu-ray.  The picture is incredible and the movie is exceptional.\nLove the Chronicles of Narnia series and Blu-ray makes it even better",
  "profile": "**User Preferences Summary:**\n\n- **Movie Genre Preference:** The user continues to favor action and adventure films, along with family-friendly fantasy, highlighting a broad interest in engaging and imaginative narratives.\n- **Actor Affinity:** Maintains a preference for star-studded casts, having recently engaged with films featuring well-known actors in the fantasy genre.\n- **Format Feedback:** The user has shown a growing appreciation for Blu-ray, specifically noting its ability to enhance visual and audio quality in family films. This reflects an increasing openness to newer releases marketed effectively for high-definition formats.\n- **Viewing Equipment:** Ownership of high-quality entertainment equipment continues to support the user’s commitment to an enhanced home viewing experience.\n- **Critical Reviewer:** The user remains a detailed critic, offering comprehensive reviews that showcase a deep appreciation for visual quality and immersive sound, particularly in Blu-ray formats.\n\nThe user’s recent interaction indicates a strong enjoyment of both the storytelling and technical aspects of family films in Blu-ray format, further enhancing their nuanced approach to media purchases and reinforcing their preference for well-executed cinematic experiences.",
  "metrics": {
    "rouge1_f": 0.11387900355871886,
    "rouge2_f": 0.011876484560570071,
    "rougeL_f": 0.06524317912218268,
    "meteor": 0.03181868929329016,
    "bleu1": 0.00013650157787630733,
    "bleu2": 3.6564777642657636e-05,
    "bleu3": 6.029993103098992e-06,
    "bleu4": 2.4515623593233166e-06,
    "bertscore_precision": 0.3468496799468994,
    "bertscore_recall": 0.4829699993133545,
    "bertscore_f1": 0.40374553203582764
  }
}