{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/08/23\nAverage Rating: 3.0\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duke', 'Daryl'], 'Producers': ['Georgia Jeffries'], 'Starring': ['Shelley Long', 'Dean Stockwell'], 'Studio': ['Deep Cuts']}\nReview Text: Although this is an older movie, it is relevant and done well.  Shelly Long is quite good in the roll of the adult woman who begins to remember tragic events involving her father.  It takes a very strong woman to do what this character did.  It makes me wonder how many children's lives were damaged in the interim time period.\nReview Title: Courage at it's best.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "ER: The Complete Seasons 1-15 [DVD]\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['ER:The Complete Seasons One-Fifteen (15pk/GFT/DVD)', \"ER explores the inner workings of an urban teaching hospital and critical issues faced by the dedicated physicians and staff of its emergency room. The pulse-pounding drama features new challenges each season, from exploring personal problems outside of Chicago's County General Hospital to the political issues being raised inside. Each season features new additions, including chief resident Kerry Weaver, Alex Kingston as British surgeon Elizabeth Corday, Paul McCrane as abrasive Dr. Robert Romano, and Lucy Knight (Kellie Martin), a third-year medical student starting her rotation. It’s always rush hour at Chicago’s County General where every day brings triumphs and losses. As Dr. Greene fights his final battle, his former student, John Carter, must step in as Chief Resident to lead the group of healers. Meanwhile, Kovac’s wild ways begin to affect his job performance, Susan Lewis gets married, and Weaver gets promoted. Plus, Carter and Kovac return from their time in Africa.\", ']]>']\n{'Genre': 'Drama, Television', 'Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '90', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.05 Pounds', 'Item model number': '883929221660', 'Director': 'Various', 'Media Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Release date': 'September 13, 2011', 'Actors': 'Various', 'Dubbed': 'Portuguese', 'Studio': 'WarnerBrothers', 'Number of discs': '90'}\nLoved the show when it was on TV and I still love it.  I am hearing impaired and missed a lot of dialog when it was on so I was looking forward to watching these with the captioning.  Many of the seasons do not have this option.  It's great to watch without commercials!  With so little to watch on TV these days, this has been a real treat for me.  I just wish the captioning wasn't missing on so many seasons.\nCaptions for Hearing Impaired are missing on some.\n{'Subtitles': ['None available'], 'Directors': ['Daniel Petrie'], 'Producers': ['David W. Rintels'], 'Starring': ['Jeff Fahey', 'Morgan Freeman', 'Laurie Metcalf'], 'Studio': ['Fisher Klingenstein Films']}\nThis was a very good movie, however I found it a bit slow moving in parts.  The acting was very good and I'm a huge fan of Morgan Freeman.  His part in this movie didn't seem to be awesome; it wasn't him - it was the part!  Not enough punch for me.  He's capable of so much more but the opportunity to give more wasn't there.\nOK, but I expected more.\nThe Ghost and the Darkness\nMichael Douglas  (Actor),     Val Kilmer  (Actor),     Stephen Hopkins  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', \"Only the most incredible parts of the story are true. Michael Douglas and Val Kilmer star in this tense, terrific and true adventure set in 1896 East Africa. There, two lions on man-eating rampage have shut down the construction of a railway. The beasts hunt together, showing no fear of man or fire. What's more, they're killing for sport rather than for food-and they have an almost supernatural knack for knowing what traps await them. Big-game hunter Remington (Douglas) and construction engineer Patterson (Kilmer) set out to stop these unstoppable monsters. But, in this astonishing tale of man against beast, the hunters become the hunted.\", 'Amazon.com', \"Val Kilmer stars as Lt. Col. John Patterson, a 19th-century Irish engineer drafted by Britain's railroad bosses to build a trestle bridge over an African river, thus expanding the empire a tiny bit more. In Tsavo, Patterson is instantly hailed for killing a man-eating lion that had been making life hell for native workers. But morale sinks when a pair of unstoppable big cats devour more men and destroy the project. Along comes an Ahab-like, expatriate American hunter (Michael Douglas) to help Patterson face the almost preternatural powers of the two killers. The script by William Goldman (\", 'Butch Cassidy and the Sundance Kid', ') is based on fact, though the film owes more to Spielberg (specifically to', 'Jaws', ') than history. There are also suggestive echoes of Kipling and Conrad in the material and characters, and there are hints of emotional complexity and psychological nuance that make one wish this could have been a great film instead of a merely fun one.', '--Tom Keogh']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Contributor': 'Kurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily MortimerKurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily Mortimer   See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 4 Ounces', 'Director': 'Stephen Hopkins', 'Media Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 1, 1998', 'Actors': 'Michael Douglas, Val Kilmer, Tom Wilkinson, John Kani, Bernard Hill', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'William Goldman', 'Number of discs': '1'}\nGreat (older) movie.  Great effects for the time it was made.  Beautiful country in the background.\nA must see movie.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ramón Menéndez'], 'Producers': ['Tom Musca'], 'Starring': ['Edward James Olmos', 'Lou Diamond Phillips', 'Rosanna DeSoto'], 'Studio': ['Warner Bros. Domestic Televisi']}\nGreat movie - especially for it's time.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Martin Smith'], 'Producers': ['Andrew A. Kosove', 'Broderick Johnson', 'Richard Ingber'], 'Starring': ['Harry Connick', 'Jr.', 'Ashley Judd', 'Nathan Gamble']}\nGood family movie.\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Marty Callner'], 'Producers': ['Marty Callner', 'David Steinberg', 'Randall Gladstein'], 'Starring': ['Robin Williams'], 'Studio': ['HBO']}\nNot the best work I've seen from Robin Williams.  I tried to laugh but it just didn't work for me.\nNot the best work I've seen from Robin Williams\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Jason Moore'], 'Producers': ['Paul Brooks', 'Elizabeth Banks', 'Max Handelman'], 'Starring': ['Anna Kendrick', 'Skylar Astin', 'Rebel Wilson'], 'Studio': ['Universal Pictures']}\nEntertaining enough.  Good music.  I liked Pitch Perfect 2 better.\nEntertaining\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duke', 'Daryl'], 'Producers': ['Georgia Jeffries'], 'Starring': ['Shelley Long', 'Dean Stockwell'], 'Studio': ['Deep Cuts']}\nAlthough this is an older movie, it is relevant and done well.  Shelly Long is quite good in the roll of the adult woman who begins to remember tragic events involving her father.  It takes a very strong woman to do what this character did.  It makes me wonder how many children's lives were damaged in the interim time period.\nCourage at it's best.",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference**: The user enjoys a blend of drama series and films, particularly those with action-adventure elements and character-driven narratives. Their appreciation for older films continues, as they value special effects and scenic backgrounds while also enjoying family-friendly cinema. Recently, they positively reviewed an older movie, highlighting its relevant themes and strong character portrayals, suggesting a preference for narratives that evoke emotional depth and resilience.\n\n- **Format Preference**: DVD boxed sets remain their favorite format for an immersive experience, emphasizing closed-captioning to meet accessibility needs.\n\n- **Accessibility Needs**: The user's hearing impairment significantly influences viewing choices, leading them to prioritize films with accurate captioning and subtitles for optimal comprehension.\n\n- **Viewing Habits**: They prefer commercial-free, uninterrupted viewing, aligning with binge-watching tendencies. Engaging storylines that explore emotional depth and character development are favored.\n\n- **Nostalgic Viewer**: A strong emotional connection to past television and film experiences guides their content selections, with nostalgia influencing their preferences.\n\n- **Critical Engagement**: The user provides thoughtful reviews, emphasizing accessibility features and character opportunities. They maintain a critical stance, as shown in past reviews, while appreciating family-oriented films and reflecting a commitment to accessible media that resonates emotionally.\n\nOverall, the user remains an avid fan of character-rich dramas and comedies, actively seeking content that balances entertainment value, emotional depth, and accessibility.",
  "metrics": {
    "rouge1_f": 0.12801101169993118,
    "rouge2_f": 0.011026878015161957,
    "rougeL_f": 0.05643496214728149,
    "meteor": 0.042821922590741225,
    "bleu1": 0.0013704563285998057,
    "bleu2": 0.00042571061891310424,
    "bleu3": 0.00016880553596092506,
    "bleu4": 8.94645505075986e-05,
    "bertscore_precision": 0.3513008952140808,
    "bertscore_recall": 0.4730929732322693,
    "bertscore_f1": 0.4032004475593567
  }
}