{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/03/08\nAverage Rating: 3.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': [\"Mark O'Brien\", 'Jake Wilkens'], 'Starring': [\"Mark O'Brien\", \"David O'Donnell\", 'Georgina Reilly']}\nReview Text: Really enjoyed this.  Appearances almost always are deceiving.\nReview Title: What a short thriller should be\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Donna Deitch'], 'Producers': ['Donald P. Borchers', 'John Allen Nelson', 'Daryl Sancton', 'Max Strom', 'David Tripet'], 'Starring': ['Joan Severance', 'Tony Denison', 'John Allen Nelson'], 'Studio': ['EPIX']}\nGeez, am I the ONLY person watching Prime that would like to see a decent movie?  I got 1/10th of the way thru this and went back to read the reviews to see if I was watching the same movie reviewed by others as &#34;bad girl&#34; or &#34;character&#34; depth, and I could go on.  But yep, I was watchin' the same innocuous boring as h€ll, practically made for Lifetime t.v. movie.<br />I proceeded to fast forward it several mins at a time to see if I could find anything remotely worth watching.  Never found it.<br />I'll be glad when Prime has more then worthless movies to watch!\nBleh...\n{'Subtitles': ['None available'], 'Directors': ['Morgan Freeman'], 'Producers': ['Bingo Gubelmann', 'Jack Heller', 'Austin Stark', 'Jim Young', 'Richard Bard', 'Nuala Barton', 'Benji Kohn', 'Chris Papvasiliou'], 'Starring': ['Mischa Barton', 'Matt Long', 'Jessica Stroup'], 'Studio': ['Paramount']}\nI must say this is the only good movie in this genre that is decent that I've seen on Amazon Prime.  I totally agree with the review this is a mix of &#34;Swimfan&#34; and &#34;Misery&#34;.<br />I give Misery 5 stars for being one of the best movies in horror/suspense.  That said, I didn't think I'd see another movie so well put together.  This is.<br />I liked that there wasn't any slip up's in the story.  &#34;Shelby&#34; does an excellent job covering her tracks.\nAhhhh, the football hero...maybe you really can't go home\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['PJ Woodside'], 'Producers': ['PJ Woodside', 'Steve Hudgins'], 'Starring': ['Kristine Renee Farley', 'Justin Veazey', 'Jessica Cook'], 'Studio': ['Indie Rights']}\nI can sum up my review in two words: Don't Bother!  This was horrid.  Microbudget.  Hmmm, I'd say more like something being said at a family gathering, such as, &#34;Since we have barbqued ribs, why don't we make a movie.  I have a camcorder with a fully charged battery!&#34;.<br />Sorry I didn't believe the other thumbs down reviews and decided to waste 100 or so mins. I'll never get back.  My bad for watching it to the end!  Don't repeat my mistake...mmmkay!\n1/2 star actually...\n{'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Brad Rego'], 'Producers': ['Brad Rego'], 'Starring': ['Elizabeth Drake', 'Gerard J Savoy', 'Alyssa Mann'], 'Studio': ['Kinonation']}\nOMG, I SO agree with &#34;the wiz&#34; on their one star review.  I'd like it if Amazon went to 1/2 star reviews!  I'd give it a negative TEN if I could have.  Geezzzzz, more time of my life I'll never get back.\nI've taken better sh!+'s then this movie!\n{'Subtitles': ['None available'], 'Directors': ['Carol L. Fleisher'], 'Producers': ['Carol L. Fleisher']}\nOutstanding.  We as Americans owe so much to these fine men (and gentlemen when they need to be).<br />I learned so much about the entire institution of the Navy Seals.<br />The stories told by the individuals are told with dignity without the bravado.<br />Every single actor who has ever portrayed a Navy Seal or has plans to, needs to watch this documentary.  The actors earn so much more money to pretend to portray them, yet these fine men exemplify the meaning of the word hero.  A word that one can never portray.<br />Gary Sinese does an excellent job of narrating without interference of the conveyed message.\nThoroughly enjoyed this great documentary .\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Bradley Buecker', 'Alfonso Gomez-Rejon', 'Michael Uppendahl', 'Loni Peristere', 'John J. Gray', 'Jennifer Lynch', 'Gwyneth Horder-Payton', 'Michael Goi', 'Ryan Murphy', 'Michael Lehmann'], 'Studio': ['FX']}\nWell, I bought the season.  So looking forward to another season as the first four have been brillantly written and executed.  I've cut the cable cord and watch entirely on my Roku.  So worth the change.  I'm glad I'll own this and be able to see it in HD.\nGottah be good with the Gaga!\nForrest Gump (20th Anniversary)\nTom Hanks  (Actor),     Robin Wright  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Forrest Gump 20th Anniversary (BD) (Diamond Luxe Case)', \"Stupid is as stupid does, says Forrest Gump (played by Tom Hanks in an O scar-winning performance) as he discusses his relative level of intelligence with a stranger while waiting for a bus. Despite his sub-normal IQ , Gump leads a truly charmed life, with a ringside seat for many of the most memorable events of the second half of the 20th century. Entirely without trying, Forrest teaches Elvis Presley to dance, becomes a football star, meets John F. Kennedy, serves with honor in Vietnam, meets Lynd on Johnson, speaks at an anti-war rally at the Washington Monument, hangs out with the Yippies, defeats the Chinese national team in table tennis, meets Richard Nixon, discovers the break-in at the Watergate, opens a profitable shrimping business, becomes an original investor in Apple Computers, and decides to run back and forth across the country for several years. Meanwhile, as the remarkable parade of his life goes by, For rest never forgets Jenny (Robin Wright Penn), the girl he loved as a boy , who makes her own journey through the turbulence of the 1960s and 197 0s that is far more troubled than the path Forrest happens upon. Feature d alongside Tom Hanks are Sally Field as Forrest's mother; Gary Sinise as his commanding officer in Vietnam; Mykelti Williamson as his ill-fate d Army buddy who is familiar with every recipe that involves shrimp; an d the special effects artists whose digital magic place Forrest amidst a remarkable array of historical events and people.\", ']]>']\n{'Genre': 'Drama, Drama/Love & Romance, Comedy', 'Format': 'NTSC', 'Contributor': 'Tom Hanks, Sally Field, Robert Zemeckis, Robin Wright', 'Language': 'English', 'Runtime': '2 hours and 22 minutes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '1000516356', 'Director': 'Robert Zemeckis', 'Media Format': 'NTSC', 'Run time': '2 hours and 22 minutes', 'Release date': 'December 9, 2014', 'Actors': 'Tom Hanks, Robin Wright, Sally Field', 'Studio': 'Paramount', 'Number of discs': '2'}\nReally nice case and trivia for the blu ray version.  I wish all cases were designed this well.  I enjoyed the bonuses alot.\nGreat version with bonuses\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jacob Cooney'], 'Producers': ['Jane Kelly Kosek'], 'Starring': ['Maury Sterling', 'Michael Reilly Burke', 'Jennifer Aspen']}\nI'm so sick of fake reviews with 5 star ratings by those who think they're film genius's.  Thank goodness I only waited the 21 mins for &#34;surely something is coming&#34; of this short story dribble.  Don't waste any of your time on this.  It is nothing to see.  Nothing.  No story.  Oh, except a torn up stuffed doetoy...pahleeze.  Give me a break.\n😤\n{'Subtitles': ['None available'], 'Directors': [\"Mark O'Brien\", 'Jake Wilkens'], 'Starring': [\"Mark O'Brien\", \"David O'Donnell\", 'Georgina Reilly']}\nReally enjoyed this.  Appearances almost always are deceiving.\nWhat a short thriller should be",
  "profile": "**Updated User Profile Summary:**\n\n- **Rating Style:** The user has shown a discerning appreciation for cinematic quality, skillfully balancing critical insights with a focus on storytelling excellence. Their latest interaction indicates a positive engagement with a short thriller, emphasizing an enjoyment derived from narrative twists, particularly noting the misleading nature of appearances.\n\n- **Content Preference:** The continued pursuit of thoughtfully executed and deeply engaging content is evident. Their recent review suggests an openness to varied formats, including shorter narratives, provided they deliver impactful storytelling and a coherent plot.\n\n- **Viewing Expectations:** With high standards firmly in place, the user remains committed to discovering superior narrative experiences, demonstrated by their willingness to appreciate short-format storytelling when executed well, further enhancing their appreciation for depth and substance.\n\n- **Review Engagement:** Active participation in the film and television community remains a cornerstone of their profile. The user critically engages with content, sharing insights that reflect a strong sense of accountability towards quality and authenticity, as showcased in their recent review.\n\n- **Frustration with Offerings:** Previous frustrations continue to evolve into a proactive stance that prioritizes authentic storytelling, highlighting a journey that values true cinematic artistry while remaining cautious about disingenuous narratives.\n\nOverall, the user's profile reflects a serious commitment to elevating exceptional storytelling across all media, while firmly opposing misleading evaluations, showcasing a more nuanced appreciation for varied narrative forms.",
  "metrics": {
    "rouge1_f": 0.1197278911564626,
    "rouge2_f": 0.008174386920980926,
    "rougeL_f": 0.05850340136054422,
    "meteor": 0.03808878786378499,
    "bleu1": 0.001337685527607191,
    "bleu2": 0.0004237680136863522,
    "bleu3": 0.00013424686837193575,
    "bleu4": 4.2528690519484945e-05,
    "bertscore_precision": 0.33629804849624634,
    "bertscore_recall": 0.4508829414844513,
    "bertscore_f1": 0.3852508068084717
  }
}