{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/10/07\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Bradley Buecker', 'Alfonso Gomez-Rejon', 'Michael Uppendahl', 'Loni Peristere', 'John J. Gray', 'Jennifer Lynch', 'Gwyneth Horder-Payton', 'Michael Goi', 'Ryan Murphy', 'Michael Lehmann'], 'Studio': ['FX']}\nReview Text: Well, I bought the season.  So looking forward to another season as the first four have been brillantly written and executed.  I've cut the cable cord and watch entirely on my Roku.  So worth the change.  I'm glad I'll own this and be able to see it in HD.\nReview Title: Gottah be good with the Gaga!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Donna Deitch'], 'Producers': ['Donald P. Borchers', 'John Allen Nelson', 'Daryl Sancton', 'Max Strom', 'David Tripet'], 'Starring': ['Joan Severance', 'Tony Denison', 'John Allen Nelson'], 'Studio': ['EPIX']}\nGeez, am I the ONLY person watching Prime that would like to see a decent movie?  I got 1/10th of the way thru this and went back to read the reviews to see if I was watching the same movie reviewed by others as &#34;bad girl&#34; or &#34;character&#34; depth, and I could go on.  But yep, I was watchin' the same innocuous boring as h€ll, practically made for Lifetime t.v. movie.<br />I proceeded to fast forward it several mins at a time to see if I could find anything remotely worth watching.  Never found it.<br />I'll be glad when Prime has more then worthless movies to watch!\nBleh...\n{'Subtitles': ['None available'], 'Directors': ['Morgan Freeman'], 'Producers': ['Bingo Gubelmann', 'Jack Heller', 'Austin Stark', 'Jim Young', 'Richard Bard', 'Nuala Barton', 'Benji Kohn', 'Chris Papvasiliou'], 'Starring': ['Mischa Barton', 'Matt Long', 'Jessica Stroup'], 'Studio': ['Paramount']}\nI must say this is the only good movie in this genre that is decent that I've seen on Amazon Prime.  I totally agree with the review this is a mix of &#34;Swimfan&#34; and &#34;Misery&#34;.<br />I give Misery 5 stars for being one of the best movies in horror/suspense.  That said, I didn't think I'd see another movie so well put together.  This is.<br />I liked that there wasn't any slip up's in the story.  &#34;Shelby&#34; does an excellent job covering her tracks.\nAhhhh, the football hero...maybe you really can't go home\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['PJ Woodside'], 'Producers': ['PJ Woodside', 'Steve Hudgins'], 'Starring': ['Kristine Renee Farley', 'Justin Veazey', 'Jessica Cook'], 'Studio': ['Indie Rights']}\nI can sum up my review in two words: Don't Bother!  This was horrid.  Microbudget.  Hmmm, I'd say more like something being said at a family gathering, such as, &#34;Since we have barbqued ribs, why don't we make a movie.  I have a camcorder with a fully charged battery!&#34;.<br />Sorry I didn't believe the other thumbs down reviews and decided to waste 100 or so mins. I'll never get back.  My bad for watching it to the end!  Don't repeat my mistake...mmmkay!\n1/2 star actually...\n{'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Brad Rego'], 'Producers': ['Brad Rego'], 'Starring': ['Elizabeth Drake', 'Gerard J Savoy', 'Alyssa Mann'], 'Studio': ['Kinonation']}\nOMG, I SO agree with &#34;the wiz&#34; on their one star review.  I'd like it if Amazon went to 1/2 star reviews!  I'd give it a negative TEN if I could have.  Geezzzzz, more time of my life I'll never get back.\nI've taken better sh!+'s then this movie!\n{'Subtitles': ['None available'], 'Directors': ['Carol L. Fleisher'], 'Producers': ['Carol L. Fleisher']}\nOutstanding.  We as Americans owe so much to these fine men (and gentlemen when they need to be).<br />I learned so much about the entire institution of the Navy Seals.<br />The stories told by the individuals are told with dignity without the bravado.<br />Every single actor who has ever portrayed a Navy Seal or has plans to, needs to watch this documentary.  The actors earn so much more money to pretend to portray them, yet these fine men exemplify the meaning of the word hero.  A word that one can never portray.<br />Gary Sinese does an excellent job of narrating without interference of the conveyed message.\nThoroughly enjoyed this great documentary .\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Bradley Buecker', 'Alfonso Gomez-Rejon', 'Michael Uppendahl', 'Loni Peristere', 'John J. Gray', 'Jennifer Lynch', 'Gwyneth Horder-Payton', 'Michael Goi', 'Ryan Murphy', 'Michael Lehmann'], 'Studio': ['FX']}\nWell, I bought the season.  So looking forward to another season as the first four have been brillantly written and executed.  I've cut the cable cord and watch entirely on my Roku.  So worth the change.  I'm glad I'll own this and be able to see it in HD.\nGottah be good with the Gaga!",
  "profile": "**Updated User Profile Summary:**\n\n- **Rating Style:** The user continues to balance critical insights with appreciation for high-quality content. Their latest purchase and enthusiastic review highlight a consistent preference for well-crafted narratives, further cementing their discerning taste.\n\n- **Content Preference:** The user has shown a strong affinity for series that are brilliantly written and executed, indicating a shift towards serialized storytelling in addition to their established interest in impactful films and documentaries. Their preference leans towards content that offers depth and complexity, regardless of the medium.\n\n- **Viewing Expectations:** The user maintains high expectations, as evidenced by their excitement for future seasons of a series they believe is exceptional. This suggests a commitment to seeking out standout works that resonate with their refined standards, alongside a readiness to celebrate quality across various platforms.\n\n- **Review Engagement:** Their engagement in the film and television community remains active, reflecting an openness to share positive experiences while also valuing the opinions of others. The user's willingness to invest in quality content demonstrates a recognition of excellence that enriches their viewing experience.\n\n- **Frustration with Offerings:** Although they've previously expressed frustration with subpar films, their recent interactions indicate a focus on celebrating narratives that truly excel, showcasing a more balanced approach that prioritizes quality storytelling over genre limitations.\n\nOverall, the user's profile reflects an ongoing journey towards selectively uplifting and critically engaging with diverse forms of storytelling.",
  "metrics": {
    "rouge1_f": 0.17518248175182483,
    "rouge2_f": 0.01044932079414838,
    "rougeL_f": 0.072992700729927,
    "meteor": 0.05938586326767092,
    "bleu1": 0.01824080810638995,
    "bleu2": 0.004908745175500216,
    "bleu3": 0.0016586595231943113,
    "bleu4": 0.0005426689309396863,
    "bertscore_precision": 0.3401857018470764,
    "bertscore_recall": 0.4368944466114044,
    "bertscore_f1": 0.3825222849845886
  }
}