{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/03/13\nAverage Rating: 2.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['PJ Woodside'], 'Producers': ['PJ Woodside', 'Steve Hudgins'], 'Starring': ['Kristine Renee Farley', 'Justin Veazey', 'Jessica Cook'], 'Studio': ['Indie Rights']}\nReview Text: I can sum up my review in two words: Don't Bother!  This was horrid.  Microbudget.  Hmmm, I'd say more like something being said at a family gathering, such as, &#34;Since we have barbqued ribs, why don't we make a movie.  I have a camcorder with a fully charged battery!&#34;.<br />Sorry I didn't believe the other thumbs down reviews and decided to waste 100 or so mins. I'll never get back.  My bad for watching it to the end!  Don't repeat my mistake...mmmkay!\nReview Title: 1/2 star actually...\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Donna Deitch'], 'Producers': ['Donald P. Borchers', 'John Allen Nelson', 'Daryl Sancton', 'Max Strom', 'David Tripet'], 'Starring': ['Joan Severance', 'Tony Denison', 'John Allen Nelson'], 'Studio': ['EPIX']}\nGeez, am I the ONLY person watching Prime that would like to see a decent movie?  I got 1/10th of the way thru this and went back to read the reviews to see if I was watching the same movie reviewed by others as &#34;bad girl&#34; or &#34;character&#34; depth, and I could go on.  But yep, I was watchin' the same innocuous boring as h€ll, practically made for Lifetime t.v. movie.<br />I proceeded to fast forward it several mins at a time to see if I could find anything remotely worth watching.  Never found it.<br />I'll be glad when Prime has more then worthless movies to watch!\nBleh...\n{'Subtitles': ['None available'], 'Directors': ['Morgan Freeman'], 'Producers': ['Bingo Gubelmann', 'Jack Heller', 'Austin Stark', 'Jim Young', 'Richard Bard', 'Nuala Barton', 'Benji Kohn', 'Chris Papvasiliou'], 'Starring': ['Mischa Barton', 'Matt Long', 'Jessica Stroup'], 'Studio': ['Paramount']}\nI must say this is the only good movie in this genre that is decent that I've seen on Amazon Prime.  I totally agree with the review this is a mix of &#34;Swimfan&#34; and &#34;Misery&#34;.<br />I give Misery 5 stars for being one of the best movies in horror/suspense.  That said, I didn't think I'd see another movie so well put together.  This is.<br />I liked that there wasn't any slip up's in the story.  &#34;Shelby&#34; does an excellent job covering her tracks.\nAhhhh, the football hero...maybe you really can't go home\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['PJ Woodside'], 'Producers': ['PJ Woodside', 'Steve Hudgins'], 'Starring': ['Kristine Renee Farley', 'Justin Veazey', 'Jessica Cook'], 'Studio': ['Indie Rights']}\nI can sum up my review in two words: Don't Bother!  This was horrid.  Microbudget.  Hmmm, I'd say more like something being said at a family gathering, such as, &#34;Since we have barbqued ribs, why don't we make a movie.  I have a camcorder with a fully charged battery!&#34;.<br />Sorry I didn't believe the other thumbs down reviews and decided to waste 100 or so mins. I'll never get back.  My bad for watching it to the end!  Don't repeat my mistake...mmmkay!\n1/2 star actually...",
  "profile": "**User Profile Summary (Updated):**\n\n- **Rating Style:** The user exhibits a sharp critical edge in their reviews, maintaining an unwavering stance on film quality. Their recent interaction underscores a strong aversion to poorly executed narratives, leading to a very low rating for a film they found to be abysmal.\n  \n- **Content Preference:** The user clearly prefers films with depth and effective storytelling. While they appreciate suspenseful and horror narratives when done well, their latest review reveals a low tolerance for microbudget productions that lack quality.\n\n- **Viewing Expectations:** The user maintains high standards for content, and their disappointment with the recent viewing reflects a frustration with mediocrity. This critical perspective reinforces their inclination to spotlight standout films, contrasting sharply with their experience of watching subpar offerings.\n\n- **Review Engagement:** They actively engage with the film community and are influenced by others' opinions, but their newfound dissatisfaction indicates that they are less likely to overlook flaws even when community consensus leans positively.\n\n- **Frustration with Offerings:** Their recent review illustrates a return to expressing frustration with poor-quality film offerings. This indicates a narrowing focus on only high-quality works that align with their refined taste, reaffirming their commitment to discerning selections within the film landscape.\n\nOverall, the user remains a critical and discerning viewer, prioritizing well-crafted narratives and expressing strong opposition to poorly made films.",
  "metrics": {
    "rouge1_f": 0.1907790143084261,
    "rouge2_f": 0.012759170653907498,
    "rougeL_f": 0.0794912559618442,
    "meteor": 0.0860214265227788,
    "bleu1": 0.07756786569314814,
    "bleu2": 0.019802159164403216,
    "bleu3": 0.003413988750859755,
    "bleu4": 0.001418846100568049,
    "bertscore_precision": 0.3499618470668793,
    "bertscore_recall": 0.4198085069656372,
    "bertscore_f1": 0.3817163109779358
  }
}