{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: ESPOIR Contour Powder #3 Light Gray | Natural Shadowing Effect with Flawless Tone | Light-Silky Veil Texture\nReview Date: 2021/06/15\nStore: Espoir\nAverage Rating: 3.4\nProduct Details: {'Brand': 'Espoir', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Coverage': 'Light', 'Product Benefits': 'Flawless', 'Package Dimensions': '3.03 x 2.64 x 0.55 inches; 0.35 Ounces', 'Item model number': '611122638'}\nReview Text: Great shade!  I have fair, neutral skin that makes it rather easy for contour shades to be too dark, or too warm, or too dirty looking. This shade is really perfect.  Buildable, cool-neutral light contouring powder.  The powder is soft, blendable, and buildable.  The packaging is nice and the quantity is excellent.  The large square of powder is suitable for any brush shape or size.\nReview Title: Great shade!  Good quantity.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Ulta Eyeshadow Palette, Metals\nUlta\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.1 x 3.5 x 0.7 inches; 5.6 Ounces', 'UPC': '717897052646'}\nI really like this palette, but feel it should be noted that it is NOT as expected. Very nice colors, but more subdued than bold, more satin/shimmer than metallic.  This is my first Ulta palette and I am happy with the quality.  I only deducted one star because the colors are somewhat other than expected.  I paid $12.<br /><br />I specifically bought it for the green color, and I still like the green color, but it's not as bright or as metallic as the collection name caused me to expect.  The finish is something of a shimmering satin, not metallic.  The colors are somewhat subdued.  The package says &#34;jewel tones&#34; which may be more accurate than the &#34;metals&#34; description, but still (to me) implies more brightly colored shades, with fewer earth tones.  I would also expect a &#34;jewel toned&#34; palette to include a strong purple, and this only has the lilac (Dynasty). (The Royal looks purple but swatched brown with a hint of burgundy.) The colors are more woodsy than jeweled.  The green is more mossy than emerald, the purple more floral than jeweled, the blue more night sky than sapphire.<br /><br />The quality of the shadows is good.  Neither buttery nor powdery, it's a slightly dry formula that nevertheless doesn't kick up a lot of product or cause a lot of fall out.  I wear them over a primer, but I have been happy with their wear time.  As stated above, pigmentation is good in that you don't have to build heavily, but it's also not a bright coloring.<br /><br />A lovely bonus is that I actually love the brush that comes with this item!  How often do you say that about a brush in a palette?  It's not only soft and usable, it's unique among my brush collection.  It's flufflier and less flat that most brushes of it's size, and it's also smaller and more pinpointed that most brushes that have a bit of fluffiness to them.  Overall, I feel like it gives good control while still blending well.  It's quickly become a favorite brush.<br /><br />There may have been a naming crisis when creating this palette, lol.  As the palette name is Metals, the subtitle is Jewels, and every individual shade is named with a royalty/gentry theme.  The shares are: Noble (white), Lady (pale pink), Reign (earthy pink), Crown (gold), Dynasty (lilac), Royal (brown), Honor (platinum), Jester (silver), Armor (bronze),  Fortress (green), Duchess (navy), and Duke (off black).  No mattes, all satin/shimmer.  All smooth, no fall out, some apply more evenly than others (drier formula).  Swatched dry on dry skin in photo.  Will build to brighter, more shiny finish.<br /><br />I ordered this palette on a whim, and I've enjoyed it.  However, if you are wanted super metallic finishes or bright colors, you should manage your expectations.\nLovely palette, poorly named.\nReal Techniques Bold Metals: Diamond Sponge, Create Shadow or Highlighting, Multi Surfaced for Variety of Application, Synthetic Materials, Latex Free\nReal Techniques\n['Real Techniques Bold Metals: Diamond Sponge, Create Shadow or Highlighting, Multi Surfaced for Variety of Application, Synthetic Materials, Latex Free']\n{'Brand': 'Real Techniques', 'Color': 'Diamond', 'Material': 'Rubber', 'Item Dimensions LxWxH': '2.35 x 2 x 5.12 inches', 'Recommended Uses For Product': 'For Highlighting', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.35 x 2 x 5.12 inches; 0.48 Ounces', 'Item model number': '1552', 'UPC': '079625915525', 'Manufacturer': 'Paris Presents Incorporated'}\nI like this, but I don't love it.  It works well, but I don't think it really stands out as a revolutionary shape or as a favorite among my sponge collection.<br /><br />The feature of this sponge that I like best and used the most is the pointed tip (which has more point that is currently pictured).  The point is excellent at getting into little creviced on the face.<br /><br />The other sides a re a little gimmicky but usable (although I never use the smaller rectangular facets for anything!).  Overall I think I prefer using their brushes with rounded sides, and I think their shape feels more natural in the hand as well.  Still, I have no complaints about this one, and I really like the texture of it.  The pleasant point to this one probably renders this a tie.  Basically, I think you need a Real Techniques Face Sponge, but I don't think it matters which one; since the other is cheaper, I would probably go with it.<br /><br />It is a very soft sponge, pleasant feeling on the skin, and it seems made from quality material.  It washes clean and dries well.\nAnother good sponge from Real Techniques (I like their others equally well.)\nYes To Face Wipes for Women and Men, Sensitive Facial Cleansing Wipes for use as a Make Up Remover, Cleaning, Soothing, Cucumbers Aloe Vera (Pack of 2)\nYes To\n[\"Yes To Cucumbers Hypoallergenic Facial Wipes gently remove dirt, sweat and makeup (eye makeup too!) without the need to rinse. Whether you're out and about, going for a run, or having a late night, these wipes make it a snap to refresh on-the-go. Packed with green superfoods these all-natural, biodegradable wipes naturally refresh and rejuvenate all-in-one. Stay gorgeous, and go from zero to clean in seconds! Snap up the lid and snatch out a towelette! Gently glide across your face and neck. Feel refreshed? You should- your skin is clean, revitalized and nourished- in just a snap! These 95% natural, oil-free, non-comedogenic, hypoallergenic wipes are made with compostable, FSC certified fabric. They are petroleum free, SLS free, paraben free, and cruelty-free. Say Yes to Cucumbers Hypoallergenic Facial Wipes! These 2 pack wipes are specifically sold by the manfucaturer. We can&rsquo. INGREDIENTS Water, Glycerin, Cucumis Sativas (Cucumber) Extract, Aloe Barbadensis (Aloe) Extract, Camellia Sinensis (Green Tea) Extract, Sodium Chloride (Sea Salt), Carpylyl/Capryl Glucoside, Guar Hydroxypropyltrimonium Chloride, Polyglyceryl-4 Caprate, Caprylic/Capric Triglyceride, Sodium Benzoate, Potassium Sorbate, Citric Acid, Phenoxyethanol, Fragrance.\"]\n{'Brand': 'Yes To', 'Skin Type': 'Sensitive', 'Material Feature': 'Compostable Warning', 'Unit Count': '60 Count', 'Number of Items': '2', 'Product Dimensions': '4.6 x 3.75 x 5.5 inches; 14.4 Ounces', 'Item model number': '1024734', 'UPC': '815921024734', 'Manufacturer': 'Yes To Inc.', 'Country of Origin': 'USA', 'Domestic Shipping': 'Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.', 'International Shipping': 'This item can be shipped to select countries outside of the U.S.  Learn More'}\nI love them!<br />I have crazy sensitive skin, so I wanted to test these out for a while before commenting, and I am very pleased with these.  They are soothing and are perfectly suitable for my sensitive skin.  They are not stripping, and I've went through them without one single reaction to them (and my skin hates a lot of stuff).  I would definitely repurchase.<br /><br />Face wipes can't compare to truly washing your face with a cleanser; my skin (which needs it's exfoliation) is at it's best and most polished when I wash fully with a cleanser.  But life happens, and last nights happen, and face wipes are 1000% better than sleeping in your makeup.  They're also great for mornings when you don't really need the full cleansing routine, or as pre-wash makeup removed in the evening if you have on a lot of long wearing makeup.  So many uses, and wipes are a staple in my bathroom cabinet.  And these are some of the gentlest ones I've tried.<br /><br />I absolutely recommend for sensitive or dry skin.\nSensitive Skin Friendly!!!!\nGirzzur fashion headbands for women-(6 Pack) yoga running headbands for women nonslip of wide boho Face washing makeup cloth hair bands\nGirzzur\n{'Age Range (Description)': 'Adult', 'Material': 'Spandex', 'Fabric Type': 'Cloth,Elastic,Spandex,Nylon', 'Number of Items': '6', 'Brand': 'Girzzur', 'Package Dimensions': '11.06 x 7.68 x 2.56 inches; 4.16 Ounces', 'Item model number': 'NVSTD-01', 'UPC': '782937993012'}\nComfortable headbands that stay in place all day with no readjustment but without squeezing your head.  Smooth soft material.  The patterns and colors are as pictured.  Very wide headband, but can be folded to smaller width if preferred.\nComfortable stretch, stays in place, patterns as pictured.\nlilah b. - Bronzed Beauty Bronzer Duo - b. sunkissed - Multipurpose Bronzer Duo to Highlight + Contour and Blend\nLILAH B\n{'Brand': 'LILAH B', 'Skin Tone': 'All', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Style': 'Compact', 'Package Dimensions': '3.8 x 3.5 x 1 inches; 0.32 Ounces', 'UPC': '851078006100'}\nSmooth natural bronzer, well pigmented and picks up on brush and glides on skin easily.  Last through the day.<br />Very nice, luxurious and protective packaging.  Heavy metal compact carefully boxed.  Amazon (inexplicably) shipped this with cases of cat food, so I expected it to be shattered when I opened it, but it was so well packaged it was unharmed.  However, if you are concerned about weight (perhaps you have hand weakness or because you want something for your purse or you are packing carry on luggage) please note that this packaging is quite heavy.\nNatural shade, heavy packaging.\nPretty Frank Natural Deodorant - No Aluminum Deodorant for Women, Men, Teens, & Kids – Paraben Sulfate Free Solid Deodorant Featuring Shea Butter, Coconut Oil, Vitamin E & Baking Soda (Lavender)\nPRETTY FRANK\n{'Brand': 'PRETTY FRANK', 'Item Form': 'Powder', 'Scent': 'Lavender, Coconut', 'Material Feature': 'Natural', 'Number of Items': '1', 'Package Dimensions': '5.87 x 5.12 x 1.14 inches; 4.23 Ounces', 'Item model number': 'DSF-BS-LAV'}\nI was happy to try this deodorant, hoping it would be a natural deodorant that did the job of complete protection against odors.  Unfortunately, it doesn't quite cut it.  While it does cut down on body odors, it definitely doesn't eliminate them.  Perhaps cuts them by half.  So, I'm disappointed and won't repurchase.  However, I can well imagine mileage may vary with individual body chemistry, so it may be worth a try if you're feeling like a gamble.<br />The deodorant is comfortable, non itchy, and doesn't leave a lot of residue.  Spreads easily along skin.  And the natural lavender scent is very pleasant.<br />While it does not seem to be billed as an antipersperant, per se, I did find it helped with moisture more than with odor.\nComfortable and natural lavender scent, but it doesn't block odors completely.\nAlteya Organics Sunscreen Rose Face Cream Spf 30, 50 ML\nAlteya Organics\n{'Scent': 'Rose', 'Sun Protection Factor': '30 Sun Protection Factor (SPF)', 'Item Weight': '0.05 Kilograms', 'Number of Items': '1', 'Unit Count': '1.69 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.36 x 2.36 x 3.94 inches; 1.76 Ounces', 'Item model number': 'SG_B06ZYWVSZY_US', 'Manufacturer': 'Alteya Organics'}\nI'm giving this 4 stars because it's one of the most comfortably suncreens I've tried.  However, there are other things to note.  First the scent; I'm obsessed with rosewater, and I expected this to have a rosewater scent.  However, it doesn't smell of roses (or like sunscreen) at all;  I actually dislike the oddly medicinal smell, but fortunately it disappears quickly.  Also, it has a slight, small gritty texture (and I have not encountered in suncreen before); this also doesn't linger.  The textured is watery and easy to distribute.  The tint is very much the color of calamine lotion (really), but it's watery and thin so it doesn't show up that color once distributed.  I have fair, neutral skin, and I think the effect is actually flattering.  However, I am not at all sure how well it will or won't server darker skins.  As I only have my own skin to test it on, I can't assess how well it will suit darker skin, just note that the slight tint is pink.\nPink, gritty, doesn't smell like roses at all.  But comfortable.\nESPOIR Contour Powder #3 Light Gray | Natural Shadowing Effect with Flawless Tone | Light-Silky Veil Texture\nEspoir\n{'Brand': 'Espoir', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Coverage': 'Light', 'Product Benefits': 'Flawless', 'Package Dimensions': '3.03 x 2.64 x 0.55 inches; 0.35 Ounces', 'Item model number': '611122638'}\nGreat shade!  I have fair, neutral skin that makes it rather easy for contour shades to be too dark, or too warm, or too dirty looking. This shade is really perfect.  Buildable, cool-neutral light contouring powder.  The powder is soft, blendable, and buildable.  The packaging is nice and the quantity is excellent.  The large square of powder is suitable for any brush shape or size.\nGreat shade!  Good quantity.",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Great shade!  Good quantity.",
    "text": "Great shade!  I have fair, neutral skin that makes it rather easy for contour shades to be too dark, or too warm, or too dirty looking. This shade is really perfect.  Buildable, cool-neutral light contouring powder.  The powder is soft, blendable, and buildable.  The packaging is nice and the quantity is excellent.  The large square of powder is suitable for any brush shape or size.",
    "images": [],
    "asin": "B08C7MDQDG",
    "parent_asin": "B08C7MDQDG",
    "user_id": "AETD4B3NZCZICXNC7LY7UZ5RUWFQ",
    "timestamp": "2021-06-15 00:46:33.912000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "ESPOIR Contour Powder #3 Light Gray | Natural Shadowing Effect with Flawless Tone | Light-Silky Veil Texture",
    "average_rating": 3.4,
    "rating_number": 23,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41S1ZNXzOkL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41S1ZNXzOkL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51MsS4CQCZL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41NI-NKCNQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41NI-NKCNQL.jpg",
        "variant": "PT01",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/515Sn8aTFQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/515Sn8aTFQL.jpg",
        "variant": "PT02",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41mywrMTzgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41mywrMTzgL.jpg",
        "variant": "PT03",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Espoir",
    "categories": [],
    "details": {
      "Brand": "Espoir",
      "Item Form": "Powder",
      "Finish Type": "Natural",
      "Coverage": "Light",
      "Product Benefits": "Flawless",
      "Package Dimensions": "3.03 x 2.64 x 0.55 inches; 0.35 Ounces",
      "Item model number": "611122638"
    },
    "bought_together": null
  }
}