{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ulta Eyeshadow Palette, Metals\nReview Date: 2017/03/03\nStore: Ulta\nAverage Rating: 3.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.1 x 3.5 x 0.7 inches; 5.6 Ounces', 'UPC': '717897052646'}\nReview Text: I really like this palette, but feel it should be noted that it is NOT as expected. Very nice colors, but more subdued than bold, more satin/shimmer than metallic.  This is my first Ulta palette and I am happy with the quality.  I only deducted one star because the colors are somewhat other than expected.  I paid $12.<br /><br />I specifically bought it for the green color, and I still like the green color, but it's not as bright or as metallic as the collection name caused me to expect.  The finish is something of a shimmering satin, not metallic.  The colors are somewhat subdued.  The package says &#34;jewel tones&#34; which may be more accurate than the &#34;metals&#34; description, but still (to me) implies more brightly colored shades, with fewer earth tones.  I would also expect a &#34;jewel toned&#34; palette to include a strong purple, and this only has the lilac (Dynasty). (The Royal looks purple but swatched brown with a hint of burgundy.) The colors are more woodsy than jeweled.  The green is more mossy than emerald, the purple more floral than jeweled, the blue more night sky than sapphire.<br /><br />The quality of the shadows is good.  Neither buttery nor powdery, it's a slightly dry formula that nevertheless doesn't kick up a lot of product or cause a lot of fall out.  I wear them over a primer, but I have been happy with their wear time.  As stated above, pigmentation is good in that you don't have to build heavily, but it's also not a bright coloring.<br /><br />A lovely bonus is that I actually love the brush that comes with this item!  How often do you say that about a brush in a palette?  It's not only soft and usable, it's unique among my brush collection.  It's flufflier and less flat that most brushes of it's size, and it's also smaller and more pinpointed that most brushes that have a bit of fluffiness to them.  Overall, I feel like it gives good control while still blending well.  It's quickly become a favorite brush.<br /><br />There may have been a naming crisis when creating this palette, lol.  As the palette name is Metals, the subtitle is Jewels, and every individual shade is named with a royalty/gentry theme.  The shares are: Noble (white), Lady (pale pink), Reign (earthy pink), Crown (gold), Dynasty (lilac), Royal (brown), Honor (platinum), Jester (silver), Armor (bronze),  Fortress (green), Duchess (navy), and Duke (off black).  No mattes, all satin/shimmer.  All smooth, no fall out, some apply more evenly than others (drier formula).  Swatched dry on dry skin in photo.  Will build to brighter, more shiny finish.<br /><br />I ordered this palette on a whim, and I've enjoyed it.  However, if you are wanted super metallic finishes or bright colors, you should manage your expectations.\nReview Title: Lovely palette, poorly named.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Ulta Eyeshadow Palette, Metals\nUlta\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.1 x 3.5 x 0.7 inches; 5.6 Ounces', 'UPC': '717897052646'}\nI really like this palette, but feel it should be noted that it is NOT as expected. Very nice colors, but more subdued than bold, more satin/shimmer than metallic.  This is my first Ulta palette and I am happy with the quality.  I only deducted one star because the colors are somewhat other than expected.  I paid $12.<br /><br />I specifically bought it for the green color, and I still like the green color, but it's not as bright or as metallic as the collection name caused me to expect.  The finish is something of a shimmering satin, not metallic.  The colors are somewhat subdued.  The package says &#34;jewel tones&#34; which may be more accurate than the &#34;metals&#34; description, but still (to me) implies more brightly colored shades, with fewer earth tones.  I would also expect a &#34;jewel toned&#34; palette to include a strong purple, and this only has the lilac (Dynasty). (The Royal looks purple but swatched brown with a hint of burgundy.) The colors are more woodsy than jeweled.  The green is more mossy than emerald, the purple more floral than jeweled, the blue more night sky than sapphire.<br /><br />The quality of the shadows is good.  Neither buttery nor powdery, it's a slightly dry formula that nevertheless doesn't kick up a lot of product or cause a lot of fall out.  I wear them over a primer, but I have been happy with their wear time.  As stated above, pigmentation is good in that you don't have to build heavily, but it's also not a bright coloring.<br /><br />A lovely bonus is that I actually love the brush that comes with this item!  How often do you say that about a brush in a palette?  It's not only soft and usable, it's unique among my brush collection.  It's flufflier and less flat that most brushes of it's size, and it's also smaller and more pinpointed that most brushes that have a bit of fluffiness to them.  Overall, I feel like it gives good control while still blending well.  It's quickly become a favorite brush.<br /><br />There may have been a naming crisis when creating this palette, lol.  As the palette name is Metals, the subtitle is Jewels, and every individual shade is named with a royalty/gentry theme.  The shares are: Noble (white), Lady (pale pink), Reign (earthy pink), Crown (gold), Dynasty (lilac), Royal (brown), Honor (platinum), Jester (silver), Armor (bronze),  Fortress (green), Duchess (navy), and Duke (off black).  No mattes, all satin/shimmer.  All smooth, no fall out, some apply more evenly than others (drier formula).  Swatched dry on dry skin in photo.  Will build to brighter, more shiny finish.<br /><br />I ordered this palette on a whim, and I've enjoyed it.  However, if you are wanted super metallic finishes or bright colors, you should manage your expectations.\nLovely palette, poorly named.",
  "profile": "**User Profile Summary:**\n\n- **Preference for Subdued Colors:** The user enjoys eyeshadow palettes with a focus on more muted, earthy tones rather than bold or bright colors. They appreciate jewel tones but expect them to be less vibrant.\n\n- **Quality Over Boldness:** The user values quality in product formulation, noting satisfaction with the texture and wear time, even if the pigmentation isn't incredibly bright. They lean towards options that offer good blendability without excessive fallout.\n\n- **Specific Color Expectations:** They display a preference for certain colors (e.g., green tones) and express disappointment when products do not fulfill expected color vibrancy. The user seems to favor specific color families (such as jewel tones) but prefers them in a more subdued version.\n\n- **Accessory Appreciation:** The user showed a positive reaction to the included brush, indicating an appreciation for tools paired with makeup. They value unique and effectively designed brushes.\n\n- **Analytical Reviews:** Their review indicates analytical tendencies, emphasizing product details and naming inconsistencies. This suggests a critical approach to product evaluation.\n\n- **Mixed Feelings About Expectations:** The user acknowledges the discrepancy between product name and performance, indicating they seek clarity in marketing and product descriptions.\n\nOverall, the user looks for high-quality, subdued eye makeup products with specific color preferences and values effective tools that enhance their experience.",
  "metrics": {
    "rouge1_f": 0.2760487144790257,
    "rouge2_f": 0.03256445047489824,
    "rougeL_f": 0.11907983761840323,
    "meteor": 0.11019750777968212,
    "bleu1": 0.09517770407093269,
    "bleu2": 0.03443636300009805,
    "bleu3": 0.012551135062828143,
    "bleu4": 0.0035863601469448727,
    "bertscore_precision": 0.400005578994751,
    "bertscore_recall": 0.4676249623298645,
    "bertscore_f1": 0.43118029832839966
  }
}