{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Girlz Squad Foot Spa Sets for Girls Ages 7-12 with Nail Kit for Kids - DIY Manicure and Pedicure Set with Foot Care Kit Perfect for Sleepovers and Slumber Party. Helps Develop Self-Care and Creativity\nReview Date: 2021/10/29\nStore: Girlz Squad\nAverage Rating: 4.5\nProduct Details: {'Product Dimensions': '10 x 8 x 1.5 inches; 3 Pounds', 'UPC': '850026487275', 'Manufacturer': 'Girlz Squad'}\nReview Text: My daughter absolutley love this thing! I did take a star away because it's battery operated...which i thought having an electric plug would makee it more convenient and worth it to me, less expensive in the long run. However, I guess that depends on the age of your little one too because electricity and water don't mix and you dont want any accidents. Anyway, that being said, we love everything else about it. I have one that I do epson salt soaks in and my daughter kept asking if ai could buy her one. This seemed perfect because of the fun colors,  the bubbles, the music and all the extras. It comes with the little spa sandals, toe dividers, nail polish, press on nails, a nail file, and the machine itself of course,  the machine has two buttons one for bubbles and one for music. My little one loves to pretend shes having a spa day with mommy!!\nReview Title: Little kid approved!!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "NeWisdom 72 PCS Toddler Girls Hair Accessory Set with Gift Packing Organization Box, Gifts for Grandkids, Cute Hair Bows Hair Clips Hair Bands for Girls Toddlers, Multi-Style Elastic Hair Ties Hair Accessories for Baby Girls Age 3 4 5 6\nNeWisdom\n{'Brand': 'NeWisdom', 'Hair Type': 'All', 'Color': 'GirlsKit', 'Age Range (Description)': 'Babies', 'Embellishment': 'Bow', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10.83 x 7.28 x 1.77 inches; 14.57 Ounces', 'Manufacturer recommended age': '5 months and up', 'Item model number': 'NW-GirlsKit-36Grid', 'Department': 'Baby-girls', 'UPC': '778942698455', 'Manufacturer': 'NeWisdom'}\nMy 2 year old, got so excited when she saw these, she loves to open the box and pick out her hair ties. I must say that I think the organizational box is a major plus, each little slot comes with 2 hair ties or clips, and each one seems to be great quality. They're stretchy and I haven't had any break which is awesome. I do think the price is a little steep, especially since some hair ties are really cute but others in my opinion are kinda corny and wouldnt be my first choice. I've included pictures to show, however if you like all of the little plastic characters,  then you should buy these! Great concept and your kid should surely love them! Good quality.\nGreat stretch hair ties!! Awesome organizational box.\nGrowom Garden Hose Nozzle 4 Adjustable Spray Patterns Garden Sprayer Heavy Duty Metal Hose Nozzle with 3 Washers for Gardening, Car Washing, Pet Bathing and General Cleaning\nGrowom\n{'Brand': 'Growom', 'Finish Type': 'Polished', 'Material': 'Heavy,Metal', 'Handle Type': 'Lever', 'Package Dimensions': '8.3 x 4.6 x 1.7 inches; 1.15 Pounds'}\nReally nice heavy duty garden hose. My husband was even impressed by it. It's very solid, and heavy, definitely doesn't feel like it will be breaking anytime soon.  It's easy to fit to your hose and to use. You can adjust the water spray, and it has the lock feature so that you can keep the water running without holding the handle down. Overall I think this sprayer has it all!\nVery heavy duty!\nMagnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nEyenjoy\n{'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nThis a fairly decent set of magnetic eyelashes. I will say I have tried a few different brands. The plus side about these is that they have several small magnets, making it easy to manipulate to your eye shape and have them fit correctly. Some brands only have 3 large magnets and the placing is hard to get a good fit. The second positive about these is that it comes with two bottles of the eyeliner which is awesome since you can keep reusing the eyelashes. I will say that these eyelashes are pretty long. I wouldn't say any of them are \"natural\" looking because of the length. I've toyed with cutting a pair to see if I like them better but am afraid I'll throw off the look...over all though I would say this is a good set. And I love magnetic eyelashes far more than dealing with eyelash glue!\nBetter than dealing with eyelash glue!\nMiss U Hair Long Wavy Dyeing Color Wig Burgundy Ombre Blonde Cosplay Costume Wig\nM MISS U HAIR\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'M MISS U HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.2 x 8 x 1.7 inches; 11.36 Ounces'}\nThis wig might be okay for a halloween costume but really isn't great quality. The hairline on the wig, for the part, looks like a ratted tangly mess. I didnt think it was super flattering.\nOkay for a costume\nMAD | Cosmetic's Makeup Remover Cleansing Towelettes, Daily cleansing face wipes to remove waterproof mascara, alcohol free , with Vitamin E 25 count\nJUST FOR TOTS BY MAD\n{'Brand': 'JUST FOR TOTS BY MAD', 'Skin Type': 'Oily', 'Unit Count': '25.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.3 x 7.87 x 1.97 inches; 7.16 Ounces', 'UPC': '685757511926'}\nI really wanted to like these, and I do enjoy that they are soft,  and that they don't leave my eyes burning or my skin irritated, so they're gentle...however, I had to really scrub my face and even then it still did not fully remove by eyeliner and definitely did not removed my mascara,  I had to pull out some back up wipes by another brand to fully get my face clean. They company seems to be going for something good but unfortunately these are not for me.\nDid not remove mascara well\nUJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nUJM\n{'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nSo I have to say that these might not be my favorite magnetic eyelashes out of all the ones I've tried, but for the price and the amount of pairs you get, you really cant beat the value.  It comes with two viles of the eyeliner, application teasers and 10 pairs of lashes. I love the style of lashes because they're more natural and I can pull them off verses some others that have really thick dramatic ones that are so full, that they make me look ridiculous, these pairs have really thick bands though,  which isn't my favorite but again I shouldn't complain given the price. It also has a decent amount of magnets to get them to stick, they're easy to apply and remove. I love magnetic lashes oi very glue for sure. I always had problems with the glue  and gluing my eyelashes shut .. I would recommend trying these for the price\nGreat value\nMulticolors Crimped Bobby Pins, 96 Counts 2 Inches Non Slip Grip Hair Pins For Women, Safe Rubber Tips & Strong Grip Bob Pins, Bobby Pins Blonde, Black, Brown, Green\nDARONGFENG\n{'Brand': 'DARONGFENG', 'Hair Type': 'All', 'Color': 'Gray,Green,Brown', 'Age Range (Description)': 'Adult', 'Material': 'Metal, Rubber', 'Package Dimensions': '4.8 x 3.8 x 0.7 inches; 3.21 Ounces', 'Item model number': 'Hair pins-D96-4', 'UPC': '741416436082'}\nThey're you're typical bobby pin, they're sturdy and hold hair in place well. I love the mixed pack, to kind of match your hair. Inhave blonde highlighted hair, but my kids have brown hair, so the diversity helps. Nice pack.\nGreat set\nWater Flosser Professional Cordless Dental Oral Irrigator - 300ML Portable and Rechargeable IPX7 Waterproof 4 Modes Water Flosser with Cleanable Water Tank for Home and Travel\nMLIKANG BEAUTY\n{'Brand': 'MLIKANG BEAUTY', 'Power Source': 'Battery Powered', 'Special Feature': 'Por, Non Slip Grip, Multiple Operation Modes', 'Unit Count': '2000.00 Count', 'Tank Volume': '300 Milliliters', 'Package Dimensions': '10 x 4.3 x 3 inches; 10.41 Ounces', 'UPC': '739677388783', 'Manufacturer': 'Mlikang'}\nI have never had a water flossed and have really wanted one. The name brands are all over a hundred bucks though,  and without knowing if I would like it or if I would actually be committed to using ot every day, I wanted to try a less expensive version. I noticed a few reviews said this was junk,  and I dont believe it's that bad. I cant compare it to the more expensive models but I'm sure tippi get what you pay for. This one I really didnt think was bad though.  It's super easy to put together and use. You do have to change it before use, and the. Harge port is at the bottom of the white power unit, between the u it and the blue water tank, kind of odd placement, but no biggie. It holds a charge really well. It has 3 different settings, pulse ( which I dont like) soft and normal. I prefer the soft because my gums are sensitive. You have ton pool ut it in your mouth before turning on, it sprays out alot of water, so you have to turn the power off to spit,  and power back on to continue, that would be my biggest complaint. But really is no biggie. For being under 40 dollars, I cant day much I think it's easy to use,  works well, its helping for what I need, and if I stay consistent with it, maybe I'll upgrade to a bigger one. Also, I love the size, it's very compact compared to other units.\nNot bad\nGirlz Squad Foot Spa Sets for Girls Ages 7-12 with Nail Kit for Kids - DIY Manicure and Pedicure Set with Foot Care Kit Perfect for Sleepovers and Slumber Party. Helps Develop Self-Care and Creativity\nGirlz Squad\n{'Product Dimensions': '10 x 8 x 1.5 inches; 3 Pounds', 'UPC': '850026487275', 'Manufacturer': 'Girlz Squad'}\nMy daughter absolutley love this thing! I did take a star away because it's battery operated...which i thought having an electric plug would makee it more convenient and worth it to me, less expensive in the long run. However, I guess that depends on the age of your little one too because electricity and water don't mix and you dont want any accidents. Anyway, that being said, we love everything else about it. I have one that I do epson salt soaks in and my daughter kept asking if ai could buy her one. This seemed perfect because of the fun colors,  the bubbles, the music and all the extras. It comes with the little spa sandals, toe dividers, nail polish, press on nails, a nail file, and the machine itself of course,  the machine has two buttons one for bubbles and one for music. My little one loves to pretend shes having a spa day with mommy!!\nLittle kid approved!!",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Little kid approved!!",
    "text": "My daughter absolutley love this thing! I did take a star away because it's battery operated...which i thought having an electric plug would makee it more convenient and worth it to me, less expensive in the long run. However, I guess that depends on the age of your little one too because electricity and water don't mix and you dont want any accidents. Anyway, that being said, we love everything else about it. I have one that I do epson salt soaks in and my daughter kept asking if ai could buy her one. This seemed perfect because of the fun colors,  the bubbles, the music and all the extras. It comes with the little spa sandals, toe dividers, nail polish, press on nails, a nail file, and the machine itself of course,  the machine has two buttons one for bubbles and one for music. My little one loves to pretend shes having a spa day with mommy!!",
    "images": [],
    "asin": "B0912BNP4J",
    "parent_asin": "B0912BNP4J",
    "user_id": "AFO6QRJE7PPMBY2P66V2FPKJUIEA",
    "timestamp": "2021-10-29 21:19:50.023000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Girlz Squad Foot Spa Sets for Girls Ages 7-12 with Nail Kit for Kids - DIY Manicure and Pedicure Set with Foot Care Kit Perfect for Sleepovers and Slumber Party. Helps Develop Self-Care and Creativity",
    "average_rating": 4.5,
    "rating_number": 276,
    "features": [
      "REAL SPA EXPERIENCE : Pamper your kids at home by giving them the ultimate spa treatment with our foot spa kit. This little girl spa set includes slippers, nail polish, press on nails for kids, nail filers, and a toe separator. It also comes with bubbling music, so they can enjoy a more realistic and soothing spa experience.",
      "PROMOTES CREATIVITY : Have them invite friends over for a girls spa day and watch them have loads of fun stimulating their creativity with this spa toys for girls. This pedicure foot spa comes with vibrant nail polish colors plus fun styles of press on nails. Your kids can create their own nail art designs that match their personality and style.",
      "KIDS SAFE MATERIALS AND INGREDIENTS : Having kids ourselves, we underrstand how important their safety is. That's why we designed and created this home salon foot spa kit to only contain safe and innovative high quality BPA-free materials. Our foot soak tub is battery-operated, making it safe to use in both indoor and outdoor settings, and doesn't need to be plugged which is dangerous.",
      "MAKE IT YOUR NEXT PRESENT : This makes a perfect spa gift set for your kids, goddaughters, cousins, or nieces, their friends, Encourage time away from the TV or phone sceen, and stimullate both their physical and mental dexterity, and have them learn the art of relaxation with this manicure and pedicure set.",
      "REAL SPA EXPERIENCE: Just a regular foot bath spa, this Girlz Squad spa kit for girls features everything you need to set up an awesome little princess mani-pedi spa party for your kids, sisters, and their friends. It's also great in promoting parent-child bonding to create memorable experience at the safety of your home."
    ],
    "description": [],
    "price": 49.95,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51CbJeU4FzL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51CbJeU4FzL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71Oq4sWArML._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51dkzJxnYpL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51dkzJxnYpL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71N64tcxvAL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51mqkwJw6WL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51mqkwJw6WL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71qPE4xiknL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51qtT3K5zzL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51qtT3K5zzL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/7153PGa-8LL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/513EKGu0u6L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/513EKGu0u6L.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71kjOzrfyeL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51ZPVy9Y7LL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ZPVy9Y7LL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71nCIn22gIL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Yu8OtRuyL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Yu8OtRuyL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/811Cp1PA60L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51svxu6-ycL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51svxu6-ycL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/81gK63QAo+L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51wtDFq2OXL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51wtDFq2OXL.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/71ajQe+TeaL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Fits adult feet but the music is annoying",
        "url": "https://www.amazon.com/vdp/0aee30cf05444da588465b146e88b216?ref=dp_vse_rvc_0",
        "user_id": "AG73GHT2UARR7KS6OO3J5I66HP6A"
      },
      {
        "title": "Foot Spa-Kids",
        "url": "https://www.amazon.com/vdp/01174214d738413b84514f4828cfcfea?ref=dp_vse_rvc_1",
        "user_id": "AEA2WU4X7IPMH4QCVI6DFMR7JZEA"
      },
      {
        "title": "Girlz Squad Spa Kit for Girls, Kids Nail and Pedicure Salon",
        "url": "https://www.amazon.com/vdp/06ded3b8fd9744f2841cc483935346e9?ref=dp_vse_rvc_2",
        "user_id": ""
      }
    ],
    "store": "Girlz Squad",
    "categories": [],
    "details": {
      "Product Dimensions": "10 x 8 x 1.5 inches; 3 Pounds",
      "UPC": "850026487275",
      "Manufacturer": "Girlz Squad"
    },
    "bought_together": null
  }
}