{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fanboy & Chum Chum\nReview Date: 2015/06/11\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Movies & TV Holiday Wishlist\nProduct Description: [\"Put on your cape and your tighty-whiteys for full-tilt, fantastic adventures with Fanboy and Chum Chum! Meet Fanboy's favorite comic book hero, Man-Arctica! Help the duo outwit the likes of bully Boog, the Chum Chum-obsessed Yo, and evil Janitor Poopatine's quest to wipe out all the gum in the Galaxy Hills school district! Join them as they first meet Kyle, a wizard expelled from Milkweed Academy, and Dollar-nator, a tough-talking videogame sent back in time to loan Fanboy a dollar! Plus other adventures into the imaginative and the absurd!\"]\nAverage Rating: 4.6\nProduct Details: {'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Animated', 'Language': 'English', 'Number Of Discs': '1', 'Publication Date': 'May 24, 2011', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '821804', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Animated', 'Release date': 'May 24, 2011', 'Subtitles': 'English', 'Studio': 'Nickelodeon', 'Number of discs': '1'}\nReview Text: MY GREAT GRANDDAUGHTER LOVED THIS\nReview Title: MY GREAT GRANDDAUGHTER LOVED\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Garfield and Friends: Behind the Scenes\nCarl Ballantine  (Actor),     Victoria Jackson  (Actor),     Tom Tataranowicz  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n[\"He's furry! He's fat! He's all that \\x96 and more!\", \"When he's not gobbling lasagna, taking up couch space or toying with his dog pal Odie, Garfield is busy being one hip Hollywood cat in these hilarious adventures hand-picked by creator Jim Davis! From hosting his own special about how cats are from out of this world (literally!) to animating his own cat cartoon to teaching kittens how to annoy their humans, Garfield is fantastically funny in this exclusive DVD! So bring home the humor, the wit and the fun of everyone's favorite fat cat!\"]\n{'Genre': 'Comedy, Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, Color, Animated, Dolby, Full Screen, NTSC, Subtitled, Dubbed', 'Contributor': 'Tom Tataranowicz, Carl Ballantine, Victoria Jackson', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Mono)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 3.84 Ounces', 'Director': 'Tom Tataranowicz', 'Media Format': 'Multiple Formats, Color, Animated, Dolby, Full Screen, NTSC, Subtitled, Dubbed', 'Run time': '2 hours and 7 minutes', 'Release date': 'December 5, 2006', 'Actors': 'Carl Ballantine, Victoria Jackson', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nGREAT MOVIE\nFive Stars\nBig Hero 6\nRyan Potter  (Actor),     Scott Adsit  (Actor),     Chris Williams  (Director),     Don Hall  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"With all the heart and humor audiences expect from Walt Disney Animation Studios, BIG HERO 6 is an action-packed comedy adventure that introduces Baymax, a lovable, personal companion robot, who forms a special bond with robotics prodigy Hiro Hamada. When a devastating turn of events catapults them into the midst of a dangerous plot unfolding in the streets of San Fransokyo, Hiro turns to Baymax and his diverse group of friends -- adrenaline junky Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred -- who transform into a band of unlikely heroes. Bring home Disney's BIG HERO 6, featuring comic-book-style action and hilarious, unforgettable characters -- it's fun for the whole family!\"]\n{'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '2O-RH6X-83O8', 'Director': 'Chris Williams, Don Hall', 'Media Format': 'Dolby, Multiple Formats, Widescreen, NTSC, Dubbed, Subtitled', 'Run time': '1 hour and 42 minutes', 'Release date': 'February 24, 2015', 'Actors': 'Ryan Potter, Scott Adsit, Jamie Chung, Jr. Damon Wayans, Genesis Rodriguez', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WALT DISNEY ANIMATION', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWE LOVED THIS MOVIE\nFive Stars\nGarfield Show: All You Need Is Love & Pasta\n-  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Romance\n[\"Hearts, flowers and fur balls are in the air with The Garfield Show: All You Need Is Love (and Pasta). You'll have enough fun and laughter to last through nine lives and nine dishes of lasagna as everyone's favorite droll kitty meanders from one hilarious situation to the next. Whether he's fostering orphan birds, enduring John's quest for the perfect family portrait, or putting up a good front for Liz's parents, Garfield really does love his friends... maybe even more than lasagna. Maybe.\"]\n{'Genre': 'Romance', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Full Screen, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 12 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.6 x 7.5 inches; 2.4 Ounces', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 12 minutes', 'Release date': 'January 4, 2011', 'Studio': 'Dargaud', 'Number of discs': '1'}\nTHIS GUY IS MY FAVORITE\nFive Stars\nGarfield Show: Summertime Adventures\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Join Garfield and his favorite pals as they visit Cheeseworld a cheese-lovers themepark! Anything can happen this summer as Garfield embarks on one adventure after another.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Language': 'English', 'Publication Date': 'May 29, 2012', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Release date': 'May 29, 2012', 'Studio': 'Dargaud'}\nLOVE THIS GUY\nFive Stars\nJack\nRobin Williams  (Actor),     Diane Lane  (Actor),     Francis Ford Coppola  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Comedy favorite Robin Williams (FLUBBER, BICENTENNIAL MAN) lights up the screen in JACK, the acclaimed hit that had critics and audiences cheering! Williams stars as a mischievous 10-year-old who acts like any other boy his age, except he's in a grown-up's body. It's nonstop laughs as Jack embarks on the greatest adventure of his young life ... the fifth grade. In his wildest role ever, Williams takes you on a hilarious ride as Jack explores the ups and downs of life from a kid's point of view! With Bill Cosby (TV's THE COSBY SHOW), and sexy Fran Drescher (TV's THE NANNY), Diane Lane (UNDER THE TUSCAN SUN), and Jennifer Lopez (JERSEY GIRL) -- join the millions of moviegoers who loved this outrageous comedy hit!\"]\n{'Genre': 'Comedy', 'Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled', 'Contributor': \"Jennifer Lopez, Brian Kerwin, Bill Cosby, Hugo Hernandez, Diane Lane, Robin Williams, Rickey D'Shon Collins, Fran Drescher, Todd Bosley, Francis Ford Coppola, Seth Smith, Gary Nadeau, Mario Yedidia, Jurnee Smollett, Dani Faith, Jeremy Lelliott, James DeMonaco, Adam ZolotinJennifer Lopez, Brian Kerwin, Bill Cosby, Hugo Hernandez, Diane Lane, Robin Williams, Rickey D'Shon Collins, Fran Drescher, Todd Bosley, Francis Ford Coppola, Seth Smith, Gary Nadeau, Mario Yedidia, Jurnee Smollett, Dani Faith, Jeremy Lelliott, James DeMonaco, Adam Zolotin  See more\", 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 113 min', 'Director': 'Francis Ford Coppola', 'Media Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Robin Williams, Diane Lane, Brian Kerwin, Jennifer Lopez, Bill Cosby', 'Subtitles': 'French', 'Studio': 'HOLLYWOOD PICTURES', 'Writers': 'James DeMonaco, Gary Nadeau', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLOVE ROBIN WILLIAMS\nFive Stars\nThe Garfield Show: Pizza Dreams\nVarious  (Actor),     Dargaud  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD\n[\"Join Garfield in this Pizza-fabulous collection of food favorites! Nothing is more special than a pizza feast for Garfield, but his appetite will be put to the test as he goes on a diet. Can it be true? Is this really happening to everyone's favorite food-loving feline? Don't miss a single moment in this jam-packed delicious collection of episodes!\"]\n{'Format': 'Multiple Formats, NTSC, Color, Animated, Full Screen', 'Contributor': 'Dargaud, Various', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 12 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Dargaud', 'Media Format': 'Multiple Formats, NTSC, Color, Animated, Full Screen', 'Run time': '1 hour and 12 minutes', 'Release date': 'June 25, 2013', 'Actors': 'Various', 'Studio': 'Dargaud', 'Number of discs': '1'}\nLOVE THIS GUY\nFive Stars\nSonic Underground: Queen Aleena's Chronicles\nArtist Not Provided  (Actor),     NCircle  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Features include: •MPAA Rating: NR•Format: DVD•Runtime: 88 minutes']\n{'Format': 'Animated, NTSC, Multiple Formats, Color', 'Contributor': 'NCircle, Artist Not Provided', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'NCircle', 'Media Format': 'Animated, NTSC, Multiple Formats, Color', 'Run time': '1 hour and 28 minutes', 'Release date': 'December 18, 2007', 'Actors': 'Artist Not Provided', 'Studio': 'Dhx Media Ltd', 'Number of discs': '1'}\nLOVE SONIC\nFive Stars\nSonic the Hedgehog: The Fight for Freedom\nSonic the Hedgehog  (Actor),     Sonic  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Ultra Sonic: Sonic and the Freedom Fighters journey to Robotnik's lab in hopes of deciphering his roboticizer system.  Hooked on Sonics: Sonic conquers Robotnik's latest evil - a vehicle designated to locate and destroy living tissue matter - during a solo mission to the Badlands.  Warp Sonic: When Sonic and the Freedom Fighters take out Robotnik's main computer, they're trapped by Swat-Bots in an underground tunnel, only to be rescued by a handsome teenager named Griff.  Sonic and the Secret Scrolls: Sally, Rotor, Bunnie and Antoine take off in a homemade airplane, bound for an ancient city hidden deep in the Great Mountains, while Sonic follows via his fave transportation - his sneakers. Things go from bad to worse when Robotnik shows up with a Swab-Bot team and demands the scrolls.\"]\n{'Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, Full Screen, NTSC, Widescreen, HiFi Sound, Surround Sound, THXMultiple Formats, Anamorphic, Animated, Color, Dolby, Full Screen, NTSC, Widescreen, HiFi Sound, Surround Sound, THX  See more', 'Contributor': 'Sonic the Hedgehog, Sonic', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Sonic', 'Media Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, Full Screen, NTSC, Widescreen, HiFi Sound, Surround Sound, THX', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 16, 2008', 'Actors': 'Sonic the Hedgehog', 'Studio': 'Dhx Media Ltd', 'Number of discs': '1'}\nLOVE SONIC\nFive Stars\nSonic the Hedgehog: Sonic Mega Mix\nSonic  (Actor),     NCircle Entertainment  (Director)    Rated:    G    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Spaceman Sonic: When S and G rocket to outer space to mine a radioactive mineral from asteroids, Sonic and Tails stow away on board. Through a blunder by the robots, all are stranded in space, and Robotnik tries to blow all of them out of the stars. The Little Merhog: When an undersea world is threatened by Captain Memo and his lobster sub, Sonic spreads a rumor that Memo plans to attack Robotnik but Sonic\\'s plan backfires. With the help of a friendly school porpoises, and the Mer-People of the undersea world, Sonic sends Robotnik and Memo floundering away. Fast & Easy: Lazy con-man Bo Beagle has the Chaos Emerald ring stuck on his finger, and Robotnik wants it for one of his evil schemes. Sonic is forced to protect the irritating Bo, until they can get the ring off his finger. Underground Masquerade: Sleet and Dingo plan to collect the taxes owed to Robotnik from the Duke of Velcronia but keep it for themselves. The scheme is moving along well for the evil duo until they are caught on tape by Max. Sonic Tonic: A speed enhancing fluid deemed \"Sonic Tonic\" is created by Robotnik to make him as fast as Sonic so that he may finally catch him. When the effects of the fluid take hold of Manic and Sonia, it renders them immobile and they must rely on their brother to get them out of trouble. Ultra Sonic: Sonic and the Freedom fighters journey to Robotnik\\'s lab in hopes of deciphering his roboticizer system. While Underground, Sonic spots his now-robotized Uncle Chuck a board a Badlands bound mine-train and devises a plan for his rescue. Super Sonic: While on a mission to the big city to replace Nicole\\'s malfunctioning microchip, Sonic and Sally encounter the Guardian, a mysterious cloaked figure who guards a dormant wizard named Lazar and his computer of evil spells. Both Robotnik and Sonic believe that spells could be useful and set out to elude the watchful Guardian and steal Lazar\\'s computer.']\n{'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '843501001516', 'Director': 'NCircle Entertainment', 'Media Format': 'Animated, NTSC, Color, Multiple Formats', 'Run time': '1 hour and 20 minutes', 'Release date': 'January 4, 2011', 'Actors': 'Sonic', 'Studio': 'Ncircle', 'Number of discs': '1'}\nLOVE SONIC\nFive Stars\nBest of the Adventures of Sonic the Hedgehog\nSonic  (Actor),     Sonic the Hedgehog  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Black Bot the Pirate Robotnik invents a time machine to go back in time and gather powerful gemstones. Sonic goes into hyper-Sonic-overdrive and reverses time to go after him.  Pseudo Sonic Mobius is suffering a crime spree and all the evidence points to Sonic as the culprit. But the real thief is a lab rat wearing a high-tech vehicle suit that was sent by Robotnik to discredit our hero.  Too Tall Tails Tails gets a mega-dose of Robotnik s growth gas and grows quickly to monstrous proportions, eating everything in sight and terrorizing the countryside.  Sonic the Matchmaker  Sonic tries to bring Robotnik Jr. and Breezie together. The problem is, Breezie's crazy about Sonic. Sonic gets out of the way, but when he does, Junior is captured by Robotnik.  Sloww Going When Scratch and Grounder use Robotnik's new Slo-Mo Ray Gun to capture Sonic, Tails rescues him by reversing the gun and turning it on a tribe of friendly Tree Sloth People who become a high speed commando strike force against Robotnik. Road Hog Sonic loses his memory when Robotnik uses hypnotic flower pollen on him, and tells him he's just an ordinary guy. With Tails trying to remind him who he is, Sonic joins a Hog Biker gang and hits the open road.  Force Three From Mobius Robotnik invents a giant amnesia ray in his booby-trapped pinball fortress in order to erase the bad memories the Mobius citizens have of him.\"]\n{'Genre': 'Kids & Family, Kids & Family/Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Sonic the Hedgehog, Sonic', 'Language': 'English', 'Runtime': '2 hours and 34 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Sonic the Hedgehog', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '2 hours and 34 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Sonic', 'Studio': 'Ncircle', 'Number of discs': '1'}\nLOVE THIS\nFive Stars\nSonic Christmas Blast\nJaleel White  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n[\"Santa Claus announces his retirement on television and the public is shocked! But it's Santa's replacement Robotropolis who has everyone worried. It seems Robotropolis has his own ideas and instead of giving boys and girls gifts Robotropolis would rather receive them. Join Sonic the Hedgehog in an adventure to rescue the spirit of Christmas and bring joy back to the world!\"]\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '3346034', 'Media Format': 'Multiple Formats, Color, Animated, NTSC', 'Run time': '1 hour and 28 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Jaleel White', 'Language': 'Unqualified', 'Studio': 'Ncircle', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLOVE IT\nFive Stars\nAlvin and the Chipmunks Go to the Movies: Star Wreck [DVD]\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Funny things are happening where no Chipmunk has dared to go! Alvin stars as Captain Dirk, commander of the S.S. Boobyprize; Simon is Mr. Speck, and Brittany is Uhaha. Together, they must rescue fellow crewmember Dr. McRoy (Theodore) after he gets abducted by a weird extraterrestrial family! This high-flying spoof of the box office smash will leave you beaming with laughter! The DVD includes 2 additional episodes:', 'Elementary, My Dear Simon', ', and', 'Chip Tracy', '.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Full Screen, NTSC, Animated, Color, DVD, Dolby', 'Run time': '1 hour and 6 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Alvin & The Chipmunks', 'Language': 'Unqualified', 'Studio': 'Paramount', 'Number of discs': '1'}\nLOVE ALVIN\nGOOD MOVIE\nLooney Tunes:Spotlight Coll. Premiere Ed\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Looney Tunes: Spotlight Collection, The Premiere Edition (Dbl DVD)', \"They're the clown princes of animation. They're the international ambassadors of cartoon comedy. They're the fabulously funny friends you grew up with! And now, 28 of the very best animated shorts starring the very wackiest Warner Bros. cartoon characters have been rounded up on DVD for the first time ever in The Looney Tunes Premiere Collection! Just barely contained in two special edition discs, each specially selected short has been brilliantly restored and re-mastered to its original anvil-dropping, laughter-inducing glory! Featuring some of the very earliest, ground-breaking on-screen appearances of many all-time Looney Tunes favorites, it's an unprecedented animation celebration for cartoon-lovers eager to re-live the heady, hilarious, golden age of Warner Bros. animation! Sparkling with one unforgettable, landmark cartoon classic after another, there's Bugs Bunny's monstrously merry encounter with the tennis-shoe clad creature of Hair-Raising Hare. Wile E. Coyote and Roadrunner racing to cartoon immortality in Fast and Furryous. Oscar-winning animated gems, scenery-chewing Tazmanian Devils and much more! Plus, a dazzling array of totally Looney DVD bonus features!\", ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.5 inches; 6.4 Ounces', 'Item model number': '2232461', 'Director': 'Various', 'Media Format': 'Color, Closed-captioned, Animated, Multiple Formats, Subtitled, NTSC', 'Run time': '3 hours and 27 minutes', 'Release date': 'September 14, 2004', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nGREAT GRANDDAUGHTER LOVED THIS\nFive Stars\nFanboy & Chum Chum\nRated:    Unrated    Format: DVD\nMovies & TV, Movies & TV Holiday Wishlist\n[\"Put on your cape and your tighty-whiteys for full-tilt, fantastic adventures with Fanboy and Chum Chum! Meet Fanboy's favorite comic book hero, Man-Arctica! Help the duo outwit the likes of bully Boog, the Chum Chum-obsessed Yo, and evil Janitor Poopatine's quest to wipe out all the gum in the Galaxy Hills school district! Join them as they first meet Kyle, a wizard expelled from Milkweed Academy, and Dollar-nator, a tough-talking videogame sent back in time to loan Fanboy a dollar! Plus other adventures into the imaginative and the absurd!\"]\n{'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Animated', 'Language': 'English', 'Number Of Discs': '1', 'Publication Date': 'May 24, 2011', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '821804', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Animated', 'Release date': 'May 24, 2011', 'Subtitles': 'English', 'Studio': 'Nickelodeon', 'Number of discs': '1'}\nMY GREAT GRANDDAUGHTER LOVED THIS\nMY GREAT GRANDDAUGHTER LOVED",
  "profile": "**Updated User Profile Summary:**\n\n- **General Interests:** The user remains enthusiastic about animated comedies that evoke nostalgia and present whimsical adventures, reaffirmed by their recent purchase that highlights their appreciation for lighthearted storytelling suitable for younger audiences.\n\n- **Media Formats:** Their preference for DVDs endures, underlining a commitment to the superior visual and audio quality that enhances viewing experiences.\n\n- **Humor Preference:** The user continues to favor uplifting narratives that emphasize emotional connections, showcasing a celebration of humor centered on family values and broader audiences.\n\n- **Engagement with Content:** A desire for thoughtful exploration of character development and story arcs continues to enrich their engagement with comedic narratives, enhancing their overall enjoyment.\n\n- **Rating Tendencies:** The user consistently provides five-star ratings, indicating their strong inclination toward emotionally uplifting content, a consistent trend reflected in their latest review praising a family-friendly experience.\n\n- **Core Values:** The user's focus on high-quality content that integrates humor, adventure, and heartfelt moments remains pivotal, guiding their media choices toward family-centric themes.\n\n- **Recent Focus:** Their latest interactions continue to highlight a passion for heartwarming comedic tales that foster family connections and creativity, reinforcing their commitment to wholesome entertainment.\n\nOverall, the user exemplifies a dedication to joyous animated works that inspire laughter and emotional resonance, prioritizing enjoyable experiences that promote family engagement.",
  "metrics": {
    "rouge1_f": 0.04965753424657534,
    "rouge2_f": 0.0017133066818960593,
    "rougeL_f": 0.0319634703196347,
    "meteor": 0.015826865811625124,
    "bleu1": 4.118108116642873e-08,
    "bleu2": 9.179254332484713e-09,
    "bleu3": 1.512560485928445e-09,
    "bleu4": 6.145552841711843e-10,
    "bertscore_precision": 0.34370458126068115,
    "bertscore_recall": 0.49123525619506836,
    "bertscore_f1": 0.4044358730316162
  }
}