{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Newcally 20MM False Eyelashes 5D Premium Faux Mink Dramatic False Lashes 4 Pairs\nReview Date: 2020/03/10\nStore: Newcally\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.59 x 4.33 x 0.63 inches; 3.21 Ounces', 'UPC': '797805591986'}\nReview Text: These lashes are bomb. They are soft and not too long. I would upload a pic if I knew how. They are much better looking in person. They came fast. I will continue to order from this company\nReview Title: Lashes are so pretty\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 25mm Lashes Faux Mink,7 Styles Mixed Dramatic Volumn Eyelashes Strip Thick False Eyelash 3D/4D/5D/6D\nALICROWN HAIR\n{'Color': 'Black', 'Brand': 'ALICROWN HAIR', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Package Dimensions': '6.6 x 6.5 x 0.6 inches; 2.4 Ounces'}\nThey were a perfect fit. Came as described\nWould buy again\nYounsolo Deep Wave 4 Bundles (18 20 22 24) 8A Unprocessed Virgin Brazilian Human Hair Extension Brazilian Deep Wave Natural Color Can Be Dyed and Bleached\nyounsolo\n{'Brand': 'Younsolo', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.1 x 7 x 3.8 inches; 15.2 Ounces'}\nThe bundles are really soft. I plan on making a wig soon with them. They come true to length. The are full but at the ends they are a little thin. I would buy again.\nGreat texture\nNewcally 20MM False Eyelashes 5D Premium Faux Mink Dramatic False Lashes 4 Pairs\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.59 x 4.33 x 0.63 inches; 3.21 Ounces', 'UPC': '797805591986'}\nThese lashes are bomb. They are soft and not too long. I would upload a pic if I knew how. They are much better looking in person. They came fast. I will continue to order from this company\nLashes are so pretty",
  "profile": "**Updated User Profile Summary:**\n\n- **Preference for Eyelashes**: The user continues to showcase a strong preference for dramatic and voluminous false eyelashes, particularly favoring faux mink varieties. Their latest purchase reflects satisfaction with their desired aesthetic, emphasizing a penchant for high-impact beauty products.\n\n- **Interest in Hair Extensions**: The user remains interested in exploring hair extensions, seeking quality products that offer styling and customization options, indicating a versatile approach to their beauty regimen.\n\n- **Quality and Fit**: They consistently prioritize quality and a reliable product fit. Their most recent experience indicates high satisfaction with accurate product descriptions, reinforcing their interest in trustworthy beauty items.\n\n- **Cruelty-Free Material**: The user is committed to ethical beauty purchases, with a clear preference for cruelty-free products that align with their values.\n\n- **Repeat Buyer Potential**: The user has demonstrated loyalty to brands that meet their standards, as indicated by their intention to continue purchasing from preferred companies based on past positive experiences.\n\n- **Performance and Texture Appreciation**: They value products that deliver desirable texture and performance, with recent reviews highlighting their focus on product effectiveness in their decision-making process.\n\nOverall, the user profile reflects a dedicated beauty enthusiast with a focus on ethical sourcing, aesthetic appeal, and a growing interest in complementary hair products, solidifying their commitment to quality.",
  "metrics": {
    "rouge1_f": 0.18300653594771243,
    "rouge2_f": 0.02188183807439825,
    "rougeL_f": 0.09150326797385622,
    "meteor": 0.10732655208247963,
    "bleu1": 0.15026040765040913,
    "bleu2": 0.02107959380937968,
    "bleu3": 0.005090244279613742,
    "bleu4": 0.0025036936581170014,
    "bertscore_precision": 0.37463492155075073,
    "bertscore_recall": 0.40995272994041443,
    "bertscore_f1": 0.3914989233016968
  }
}