{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: PLEELL 20 Pairs False Eyelashes 4 Styles Mixed Faux Mink Lashes Pack Fluffy Wispy Long Dramatic Handmade Soft Natural Look\nReview Date: 2020/07/24\nStore: Pleell\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Pleell', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '8.9 x 7.64 x 0.63 inches; 0.35 Ounces'}\nReview Text: These are a little shorter than what I wear but the are super cute. They are full and soft. These give you a basic look. Love them\nReview Title: Great lashes\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 25mm Lashes Faux Mink,7 Styles Mixed Dramatic Volumn Eyelashes Strip Thick False Eyelash 3D/4D/5D/6D\nALICROWN HAIR\n{'Color': 'Black', 'Brand': 'ALICROWN HAIR', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Package Dimensions': '6.6 x 6.5 x 0.6 inches; 2.4 Ounces'}\nThey were a perfect fit. Came as described\nWould buy again\nYounsolo Deep Wave 4 Bundles (18 20 22 24) 8A Unprocessed Virgin Brazilian Human Hair Extension Brazilian Deep Wave Natural Color Can Be Dyed and Bleached\nyounsolo\n{'Brand': 'Younsolo', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.1 x 7 x 3.8 inches; 15.2 Ounces'}\nThe bundles are really soft. I plan on making a wig soon with them. They come true to length. The are full but at the ends they are a little thin. I would buy again.\nGreat texture\nNewcally 20MM False Eyelashes 5D Premium Faux Mink Dramatic False Lashes 4 Pairs\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.59 x 4.33 x 0.63 inches; 3.21 Ounces', 'UPC': '797805591986'}\nThese lashes are bomb. They are soft and not too long. I would upload a pic if I knew how. They are much better looking in person. They came fast. I will continue to order from this company\nLashes are so pretty\nBeautykaisen False Eyelashes, 3D Mink Lashes with Dramatic Look 100% Handmade & Cruelty-Free 5 Pairs\nBeautykaisen\n{'Brand': 'Beautykaisen', 'Material': 'Mink Fur', 'Material Feature': 'Cruelty Free', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.5 x 4.9 x 1 inches; 2.89 Ounces', 'UPC': '713091615380'}\nLashes are bomb. I love them. They are soft and last a while. They not really long just thick so that’s a plus\nCame as described\nPLEELL 20 Pairs False Eyelashes 4 Styles Mixed Faux Mink Lashes Pack Fluffy Wispy Long Dramatic Handmade Soft Natural Look\nPleell\n{'Brand': 'Pleell', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '8.9 x 7.64 x 0.63 inches; 0.35 Ounces'}\nThese are a little shorter than what I wear but the are super cute. They are full and soft. These give you a basic look. Love them\nGreat lashes",
  "profile": "**Updated User Profile Summary:**\n\n- **Preference for Eyelashes**: The user continues to have a strong affinity for dramatic and voluminous false eyelashes, appreciating their softness and quality. Their latest purchase, while shorter than usual, has reinforced their preference for fluffy and wispy styles that still provide a cute, full appearance.\n\n- **Interest in Hair Extensions**: The user is actively exploring versatile and customizable hair extensions, seeking options that seamlessly integrate into their beauty routine.\n\n- **Quality and Fit**: Quality and accurate product descriptions remain crucial. Their recent interactions highlight satisfaction with products that meet or exceed expectations in terms of performance and aesthetic appeal.\n\n- **Cruelty-Free Material**: The user's commitment to ethical beauty products persists, with a solid preference for cruelty-free materials, ensuring alignment with their values.\n\n- **Repeat Buyer Potential**: The user exhibits a strong tendency toward brand loyalty, indicating they are inclined to continue purchasing from brands that deliver consistent quality and positive experiences.\n\n- **Performance and Texture Appreciation**: The user places great emphasis on texture and performance, as demonstrated by their recent assessments. They value products that effectively deliver on their promised features.\n\nOverall, the profile illustrates a dedicated beauty enthusiast who prioritizes ethical sourcing, bold aesthetics, and ongoing exploration of complementary beauty products, reaffirming their commitment to quality and satisfaction in their beauty journey.",
  "metrics": {
    "rouge1_f": 0.1892332789559543,
    "rouge2_f": 0.026186579378068738,
    "rougeL_f": 0.08482871125611746,
    "meteor": 0.0931411547151451,
    "bleu1": 0.08940372718340477,
    "bleu2": 0.01939150910553612,
    "bleu3": 0.003754181924064622,
    "bleu4": 0.0016533420062120902,
    "bertscore_precision": 0.3512241244316101,
    "bertscore_recall": 0.400362491607666,
    "bertscore_f1": 0.37418699264526367
  }
}