{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Murder on the Orient Express\nReview Date: 2018/01/16\nStore: Lumet, Sidney  (Director),     Finney, Albert  (Actor),     Bacall, Lauren  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Mystery & Thrillers\nAverage Rating: 4.6\nProduct Details: {}\nReview Text: The best and amazing star studded version. Alfred Finney is amazing, and you really get attached to the characters in this.  I loaned out my copy - and had to buy another one.  Great story - helps you understand the new 2017 movie version.\nReview Title: an all time favorite\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Girl Who Kicked The Hornet's Nest (English Dubbed)\nSuspense, Drama, Biting, Gritty\n[\"THE GIRL WHO KICKED THE HORNET'S NEST is the third and final film adaptation of the best-selling Millennium trilogy written by the late Swedish author, Stieg Larsson (The Girl With the Dragon Tattoo and The Girl Who Played With Fire). In this last installment, Lisbeth Salander (Noomi Rapace) lies in critical condition, a bullet wound to her head, in the intensive care unit of a Swedish city hospital. She's fighting for her life in more ways than one: if and when she recovers, she'll be taken back to Stockholm to stand trial for three murders. With the help of her friend, journalist Mikael Blomkvist (Michael Nyqvist), she will not only have to prove her innocence, but also identify and denounce those in authority who have allowed the vulnerable, like herself, to suffer abuse and violence. And, on her own, she will plot revenge - against the man who tried to kill her, and the corrupt government institutions that very nearly destroyed her life. THE GIRL WHO KICKED THE HORNET'S NEST brings back Noomi Rapace in the starring role of the pierced and tattooed genius computer hacker Lisbeth Salander, Michael Nyqvist as Mikael Blomkvist, the crusading journalist and publisher of the magazine Millennium, and Lena Endre (Erika Berger) the editor of the magazine and Blomkvist's occasional lover.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Alfredson'], 'Producers': ['Klaus Bassiner', 'Susann Billberg-Rydholm', 'Gunnar Carlsson', 'Anni Faurbye Fernandez', 'Wolfgang Feindt', 'Jenny Gilbertsson', 'Lone Korslund', 'Jon Mankell', 'Peter Nadermann', 'Ole Søndberg', 'Søren Stærmose', 'Mikael Wallen'], 'Starring': ['Michael Nyqvist', 'Noomi Rapace', 'Lena Endre']}\nThese are not the types of Movies I normally watch  - however sometimes a dose of drama, reality, and tough life are good for those of us who are unaware of this kind of suffering. I told my adult children they should watch it. I came to appreciate the great strength and struggles of Lisbet. It is important to know there are women who suffer this kind of abuse - some not so terribly violent - but still disturbing. Loved how she \"kicked butt\" in this finale.\nA necessary disturbance\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Stromberg'], 'Producers': ['Joe Roth'], 'Starring': ['Angelina Jolie', 'Sharlto Copley', 'Elle Fanning']}\nUnexpected\ncreative\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James Gunn'], 'Producers': ['Kevin Feige'], 'Starring': ['Chris Pratt', 'Zoe Saldana', 'Dave Bautista'], 'Studio': ['BUENA VISTA PAY TELEVISION']}\nFun\nenjoyed\nAgatha Christie's Marple: Geraldine McEwan Collection\nGeraldine McEwan  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['As seen on the PBS', 'Mystery!', 'series', 'Geraldine McEwan (', 'The Magdalene Sisters, Mapp & Lucia', ') effortlessly captures the sly wit and keen observations of Agatha Christie’s beloved spinster sleuth in these 12 full-length mysteries. Prim and proper in her smart tweed suits and matching hats, Miss Marple is often overlooked by the police and underestimated by criminals. But she proves her mettle time and again, solving cases that leave even the most experienced professionals flummoxed. These lavish adaptations are filled with rich period detail and feature top guest stars, including Jane Seymour, Joanna Lumley, Derek Jacobi, Zoë Wanamaker, Eileen Atkins, Anthony Andrews, Peter Davison, Timothy Dalton, John Hannah, Keeley Hawes, Greg Wise, Francesca Annis, and Juliet Stevenson. \"Irresistible\" --', 'TV Guide.', 'THE MYSTERIES The Murder at the Vicarage The Body in the Library A Murder Is Announced 4:50 From Paddington Sleeping Murder By the Pricking of My Thumbs The Moving Finger The Sittaford Mystery Towards Zero Nemesis At Bertram’s Hotel Ordeal by Innocence']\n{'Genre': 'Mystery & Thrillers', 'Format': 'NTSC, Multiple Formats, Color', 'Contributor': 'Geraldine McEwan', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '12', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.25 Pounds', 'Item model number': '8480', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '19 hours', 'Release date': 'November 2, 2010', 'Actors': 'Geraldine McEwan', 'Studio': 'ACORN MEDIA', 'Number of discs': '12'}\nI'm just so sad there are not more with Geraldine. She is fantastic. I'm going to look up other movies/shows she was in.\nI'm just so sad there are not more with Geraldine\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Yannick Bisson', 'Laurie Lynd', 'Gail Harvey', 'Cal Coons', 'Don McCutcheon', 'Harvey Crossland', 'Dawn Wilkonson', 'Sudz Sutherland', 'Michael DeCarlo', 'Michael McGowan', 'Peter Mitchell', 'Julie Lacy'], 'Producers': ['Stephen Montgomery', 'Paul Aitken'], 'Starring': ['Yannick Bisson', 'Hélène Joy', 'Thomas Craig']}\nCan't wait till season 8 comes out\nFive Stars\nMurder on the Orient Express\nLumet, Sidney  (Director),     Finney, Albert  (Actor),     Bacall, Lauren  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Mystery & Thrillers\n{}\nThe best and amazing star studded version. Alfred Finney is amazing, and you really get attached to the characters in this.  I loaned out my copy - and had to buy another one.  Great story - helps you understand the new 2017 movie version.\nan all time favorite",
  "profile": "**Updated User Profile Summary:**\n\n- **Genres of Interest:** Suspense, Drama, Mystery, Gritty narratives while still enjoying light-hearted content that entertains.\n- **Themes:** Strong, resilient female protagonists; emotional complexity and creativity in storytelling; exploring systemic challenges; values diverse narratives that balance serious themes with elements of fun.\n- **Viewing Preferences:** Engages with impactful storytelling that addresses societal issues, appreciating character-driven narratives that combine levity with deeper life realities; has a particular fondness for classic mystery narratives.\n- **Audience Engagement:** Actively shares and discusses media with family, using stories to foster meaningful conversations about significant themes. Balances intense narratives with lighter content for enriched discussions.\n- **Rating Behavior:** Consistently rates highly those that resonate deeply, demonstrating excitement for both classic and contemporary works. Maintains a commitment to long-term series and values strong character arcs.\n- **Personal Reflection:** Sees media as a vehicle for empathy and understanding others' struggles; cherishes the blend of creativity and entertainment, enhancing her viewing experience and supporting advocacy through storytelling.\n\nThe recent interaction reflects a continued appreciation for well-crafted mysteries and character development, highlighting her enduring affection for classic narratives while embracing new interpretations, further solidifying her engagement with emotionally resonant content.",
  "metrics": {
    "rouge1_f": 0.12595419847328243,
    "rouge2_f": 0.0019120458891013386,
    "rougeL_f": 0.06106870229007633,
    "meteor": 0.04671309665364362,
    "bleu1": 0.005268703270302802,
    "bleu2": 0.0013540619797382462,
    "bleu3": 0.0006351507311187993,
    "bleu4": 0.00036615935761001177,
    "bertscore_precision": 0.34794628620147705,
    "bertscore_recall": 0.4422411620616913,
    "bertscore_f1": 0.3894675076007843
  }
}