{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/05/01\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Neill Blomkamp'], 'Producers': ['Bill Block', 'Neill Blomkamp', 'Simon Kinberg'], 'Starring': ['Matt Damon', 'Jodie Foster', 'Sharlto Copley']}\nReview Text: I consider myself a Matt Damon fan, and find the Bourne movies irresistible.  And I like science fiction.  Unfortunately while I am pretty good at identifying why I like particular movies, I am not so good at figuring out why a given movie falls flat.  I think the special effects were good, but they didn't compensate for deficits in either the storyline or character development.  Or maybe both.  I seriously wanted to love this movie, and I did watch the entire thing, but I'm not going to watch it again, and I'm not going to buy it.\nReview Title: It's okay.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)'], 'Directors': ['John Lee Hancock'], 'Producers': ['Alison Owen', 'Ian Collie', 'Philip Steuer'], 'Starring': ['Paul Giamatti', 'Jason Schwartzman', 'Emma Thompson'], 'Studio': ['BUENA VISTA PAY TELEVISION']}\nGreat acting really brings the heart-wrenching back story of the movie Mary Poppins to life.<br />Fans of Mary Poppins would be exceptionally entertained, I believe.  Myself, I selected the movie to watch because I am a huge Tom Hanks fan.<br />My adult son (early 20's) and husband would not have been interested in this type of movie.<br />Best advice: watch the trailer to ensure it piques your interest first.\nVery Entertaining; Really Enjoyed the Characters & Storyline\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin Scorsese'], 'Producers': ['Emma Koskoff', 'Alexandra Milchan', 'Rick Yorn', 'Irwin Winkler', 'Danny Dimbort', 'Joel Gotler', 'Georgia Kacandes', 'Martin Scorsese', 'Leonardo DiCaprio', 'Riza Aziz', 'Joey McFarland', 'Emma Tillinger Koskoff'], 'Starring': ['Leonardo DiCaprio', 'Jonah Hill', 'Margot Robbie'], 'Studio': ['Hit Movies']}\nI was so intrigued by this fascinating movie that I have researched Jordan Belfort online and plan to order his books soon.  Second hand, of course, as he is currently in default with restitution payments to his victims.<br />Leonardo DiCaprio does an exceptional portrayal of this money hungry, drug crazed, sex addicted character.  I am definitely a bigger Leo fan than ever before after watching this.<br />If you have a problem with nudity, sex, drugs, profanity and/or nudity, sex, drugs, profanity - and there IS a double helping of all of it - then this movie is not for you.  Otherwise, grab some popcorn and enjoy!\nClear out the kiddos and order it.  You are about to be entertained!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Steve Coogan', 'Tracey Seaward', 'Gabrielle Tana'], 'Starring': ['Judi Dench', 'Steve Coogan', 'Sophie Kennedy Clark']}\nActing at it's finest.  I was completely immersed in this story from the very beginning.  I both laughed and cried.  I was surprised more than once at the turns the story took.  I highly recommend it.  It is not a movie that would particularly interest my husband who prefers westerns and action movies.  I am a very conservative mother of 2 adult sons and would say that in retrospect I would have required them to be 12 to 14 years old before they watched it.  It is plenty good enough to see twice, so I recommend parents watch it first, then decide what they feel is appropriate for viewing by the children.  Great movie.\nLoved it.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Jean-Marc Vallee'], 'Producers': ['Robbie Brenner', 'Rachel Winter'], 'Starring': ['Matthew McConaughey', 'Jennifer Garner', 'Jared Leto']}\nWonderfully acted, great story.  Provides enough insight and food for thought to last a lifetime.  I was emotionally wrung out by the end.  Anger, frustration, hope, and sadness - my feelings ran the gamut not only as I watched, but was left with long after viewing.  An adult's movie, to be sure.\nAn Eye Opener\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Neill Blomkamp'], 'Producers': ['Bill Block', 'Neill Blomkamp', 'Simon Kinberg'], 'Starring': ['Matt Damon', 'Jodie Foster', 'Sharlto Copley']}\nI consider myself a Matt Damon fan, and find the Bourne movies irresistible.  And I like science fiction.  Unfortunately while I am pretty good at identifying why I like particular movies, I am not so good at figuring out why a given movie falls flat.  I think the special effects were good, but they didn't compensate for deficits in either the storyline or character development.  Or maybe both.  I seriously wanted to love this movie, and I did watch the entire thing, but I'm not going to watch it again, and I'm not going to buy it.\nIt's okay.",
  "profile": "**User Summary:**\n\n- **Entertainment Preference:** Enjoys films with strong narratives and emotional depth, particularly with renowned actors such as Tom Hanks and Leonardo DiCaprio, while also appreciating performances by Matthew McConaughey and Matt Damon.\n- **Genre Interest:** Fond of biographical and family-oriented films with historical significance or heartwarming elements, but now demonstrates a willingness to explore science fiction, albeit with cautious enthusiasm due to past disappointments in storytelling and character development.\n- **Actor Affinity:** Holds fondness for acclaimed performers, with recent interactions expanding appreciation to include a broader range of genres and complex narratives, especially those featuring emotional intensity.\n- **Viewing Companions:** Selective in film choices, prioritizing content that suits an adult audience and avoids explicit material for younger viewers, maintaining a conservative approach to movie selection.\n- **Content Sensitivity:** Open to engaging with films that have adult themes and emotional complexity, but will critique them based on narrative coherence and character depth, showing a discerning eye for quality.\n- **Language and Accessibility:** Values bilingual content, actively seeking options for audio and subtitles to enhance the viewing experience.\n- **Engagement Strategy:** Engages in post-viewing research and emphasizes the importance of trailers before selection, underscoring a thoughtful approach to curating a balanced film experience, while acknowledging difficulty in articulating critiques constructively. \n\nThis user’s taste reflects a discerning appreciation for well-acted films, balancing a desire for emotional resonance with critical insight into story structure and character development.",
  "metrics": {
    "rouge1_f": 0.21615720524017468,
    "rouge2_f": 0.015317286652078774,
    "rougeL_f": 0.08733624454148471,
    "meteor": 0.07266576442583067,
    "bleu1": 0.028075634697244244,
    "bleu2": 0.007549888698253365,
    "bleu3": 0.002439312720614485,
    "bleu4": 0.0007803638286178108,
    "bertscore_precision": 0.38653483986854553,
    "bertscore_recall": 0.4720918536186218,
    "bertscore_f1": 0.4250507056713104
  }
}