{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/05/01\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Steve Coogan', 'Tracey Seaward', 'Gabrielle Tana'], 'Starring': ['Judi Dench', 'Steve Coogan', 'Sophie Kennedy Clark']}\nReview Text: Acting at it's finest.  I was completely immersed in this story from the very beginning.  I both laughed and cried.  I was surprised more than once at the turns the story took.  I highly recommend it.  It is not a movie that would particularly interest my husband who prefers westerns and action movies.  I am a very conservative mother of 2 adult sons and would say that in retrospect I would have required them to be 12 to 14 years old before they watched it.  It is plenty good enough to see twice, so I recommend parents watch it first, then decide what they feel is appropriate for viewing by the children.  Great movie.\nReview Title: Loved it.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)'], 'Directors': ['John Lee Hancock'], 'Producers': ['Alison Owen', 'Ian Collie', 'Philip Steuer'], 'Starring': ['Paul Giamatti', 'Jason Schwartzman', 'Emma Thompson'], 'Studio': ['BUENA VISTA PAY TELEVISION']}\nGreat acting really brings the heart-wrenching back story of the movie Mary Poppins to life.<br />Fans of Mary Poppins would be exceptionally entertained, I believe.  Myself, I selected the movie to watch because I am a huge Tom Hanks fan.<br />My adult son (early 20's) and husband would not have been interested in this type of movie.<br />Best advice: watch the trailer to ensure it piques your interest first.\nVery Entertaining; Really Enjoyed the Characters & Storyline\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin Scorsese'], 'Producers': ['Emma Koskoff', 'Alexandra Milchan', 'Rick Yorn', 'Irwin Winkler', 'Danny Dimbort', 'Joel Gotler', 'Georgia Kacandes', 'Martin Scorsese', 'Leonardo DiCaprio', 'Riza Aziz', 'Joey McFarland', 'Emma Tillinger Koskoff'], 'Starring': ['Leonardo DiCaprio', 'Jonah Hill', 'Margot Robbie'], 'Studio': ['Hit Movies']}\nI was so intrigued by this fascinating movie that I have researched Jordan Belfort online and plan to order his books soon.  Second hand, of course, as he is currently in default with restitution payments to his victims.<br />Leonardo DiCaprio does an exceptional portrayal of this money hungry, drug crazed, sex addicted character.  I am definitely a bigger Leo fan than ever before after watching this.<br />If you have a problem with nudity, sex, drugs, profanity and/or nudity, sex, drugs, profanity - and there IS a double helping of all of it - then this movie is not for you.  Otherwise, grab some popcorn and enjoy!\nClear out the kiddos and order it.  You are about to be entertained!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Steve Coogan', 'Tracey Seaward', 'Gabrielle Tana'], 'Starring': ['Judi Dench', 'Steve Coogan', 'Sophie Kennedy Clark']}\nActing at it's finest.  I was completely immersed in this story from the very beginning.  I both laughed and cried.  I was surprised more than once at the turns the story took.  I highly recommend it.  It is not a movie that would particularly interest my husband who prefers westerns and action movies.  I am a very conservative mother of 2 adult sons and would say that in retrospect I would have required them to be 12 to 14 years old before they watched it.  It is plenty good enough to see twice, so I recommend parents watch it first, then decide what they feel is appropriate for viewing by the children.  Great movie.\nLoved it.",
  "profile": "**User Summary:**\n\n- **Entertainment Preference:** Enjoys films with strong narratives and emotional depth, particularly those featuring renowned actors such as Tom Hanks and now also Leonardo DiCaprio.\n- **Genre Interest:** Gravitation towards biographical and family-oriented films, especially those with historical significance or a heartwarming touch, while showing a growing openness to edgier content.\n- **Actor Affinity:** Notable fondness for acclaimed performers, with recent interactions enhancing appreciation for diverse genres represented by celebrated actors.\n- **Viewing Companions:** Selective about viewing choices, particularly prioritizing films that suit an adult audience, while avoiding explicit content for younger viewers, reflecting a conservative approach to movie selection due to family considerations.\n- **Content Sensitivity:** Exhibits willingness to engage with films containing adult themes and emotional complexity, but with a discerning awareness of appropriateness for various age groups.\n- **Language and Accessibility:** Values bilingual content, actively seeking options for audio and subtitles.\n- **Engagement Strategy:** Typically researches film subjects post-viewing and emphasizes the importance of trailers before selection, showcasing a thoughtful approach to movie choices.\n\nThis user maintains a discerning taste for films that are well-acted and emotionally resonant, reaffirming a balanced appreciation for both family-oriented narratives and more mature themes when presented by esteemed actors.",
  "metrics": {
    "rouge1_f": 0.20280811232449297,
    "rouge2_f": 0.009389671361502348,
    "rougeL_f": 0.0873634945397816,
    "meteor": 0.07806256511848123,
    "bleu1": 0.058817028349953344,
    "bleu2": 0.009436496955744429,
    "bleu3": 0.0018914676082129927,
    "bleu4": 0.0008476493823448422,
    "bertscore_precision": 0.36181896924972534,
    "bertscore_recall": 0.4284217357635498,
    "bertscore_f1": 0.392313688993454
  }
}