{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/08/12\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Slade'], 'Producers': ['Sam Raimi', 'Rob Tapert'], 'Starring': ['Josh Hartnett', 'Melissa George', 'Danny Huston'], 'Studio': ['Columbia Pictures']}\nReview Text: Very good vampire movie. Good story. Very good effects. And Josh Hartnett. 🤩\nReview Title: Great Vampire Movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)'], 'Directors': ['John Lee Hancock'], 'Producers': ['Alison Owen', 'Ian Collie', 'Philip Steuer'], 'Starring': ['Paul Giamatti', 'Jason Schwartzman', 'Emma Thompson'], 'Studio': ['BUENA VISTA PAY TELEVISION']}\nGreat acting really brings the heart-wrenching back story of the movie Mary Poppins to life.<br />Fans of Mary Poppins would be exceptionally entertained, I believe.  Myself, I selected the movie to watch because I am a huge Tom Hanks fan.<br />My adult son (early 20's) and husband would not have been interested in this type of movie.<br />Best advice: watch the trailer to ensure it piques your interest first.\nVery Entertaining; Really Enjoyed the Characters & Storyline\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin Scorsese'], 'Producers': ['Emma Koskoff', 'Alexandra Milchan', 'Rick Yorn', 'Irwin Winkler', 'Danny Dimbort', 'Joel Gotler', 'Georgia Kacandes', 'Martin Scorsese', 'Leonardo DiCaprio', 'Riza Aziz', 'Joey McFarland', 'Emma Tillinger Koskoff'], 'Starring': ['Leonardo DiCaprio', 'Jonah Hill', 'Margot Robbie'], 'Studio': ['Hit Movies']}\nI was so intrigued by this fascinating movie that I have researched Jordan Belfort online and plan to order his books soon.  Second hand, of course, as he is currently in default with restitution payments to his victims.<br />Leonardo DiCaprio does an exceptional portrayal of this money hungry, drug crazed, sex addicted character.  I am definitely a bigger Leo fan than ever before after watching this.<br />If you have a problem with nudity, sex, drugs, profanity and/or nudity, sex, drugs, profanity - and there IS a double helping of all of it - then this movie is not for you.  Otherwise, grab some popcorn and enjoy!\nClear out the kiddos and order it.  You are about to be entertained!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Steve Coogan', 'Tracey Seaward', 'Gabrielle Tana'], 'Starring': ['Judi Dench', 'Steve Coogan', 'Sophie Kennedy Clark']}\nActing at it's finest.  I was completely immersed in this story from the very beginning.  I both laughed and cried.  I was surprised more than once at the turns the story took.  I highly recommend it.  It is not a movie that would particularly interest my husband who prefers westerns and action movies.  I am a very conservative mother of 2 adult sons and would say that in retrospect I would have required them to be 12 to 14 years old before they watched it.  It is plenty good enough to see twice, so I recommend parents watch it first, then decide what they feel is appropriate for viewing by the children.  Great movie.\nLoved it.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Jean-Marc Vallee'], 'Producers': ['Robbie Brenner', 'Rachel Winter'], 'Starring': ['Matthew McConaughey', 'Jennifer Garner', 'Jared Leto']}\nWonderfully acted, great story.  Provides enough insight and food for thought to last a lifetime.  I was emotionally wrung out by the end.  Anger, frustration, hope, and sadness - my feelings ran the gamut not only as I watched, but was left with long after viewing.  An adult's movie, to be sure.\nAn Eye Opener\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Neill Blomkamp'], 'Producers': ['Bill Block', 'Neill Blomkamp', 'Simon Kinberg'], 'Starring': ['Matt Damon', 'Jodie Foster', 'Sharlto Copley']}\nI consider myself a Matt Damon fan, and find the Bourne movies irresistible.  And I like science fiction.  Unfortunately while I am pretty good at identifying why I like particular movies, I am not so good at figuring out why a given movie falls flat.  I think the special effects were good, but they didn't compensate for deficits in either the storyline or character development.  Or maybe both.  I seriously wanted to love this movie, and I did watch the entire thing, but I'm not going to watch it again, and I'm not going to buy it.\nIt's okay.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Kriegsman'], 'Producers': ['Bipolar Productions'], 'Studio': ['Bipolar Productions']}\nI learned a lot more about the details of autopsies by watching this in comparison to watching Dr G. Medical Examiner. This is 100% gritty reality and you witness all of the steps taken. “Graphic” hardly touches the stark realism of deconstructing a human and observing organs and entrails. I took a few breaks, TBH. Just a lot to take in, but yes, it was exactly what I asked to see. Good job. Please note that this is not filmed Hollywood style and the lighting and sound clarity is of a realistic nature to be expected in this setting.\nHighly educational\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Weir'], 'Producers': ['Hal McElroy', 'Jim McElroy'], 'Starring': ['Rachel Roberts', 'Vivean Gray', 'Helen Morse']}\nI watched the film because another current movie I want to see (Old) took pointers from this film in it’s development of dread and the sheer overwhelming force of nature. The definition, sound, and color are exactly what you would expect from a film of it’s time. There are poignant moments, to be sure, and the sense of dread. Would I choose to watch it again? Probably not, but I don’t feel like I came away with nothing, either.<br />To my fellow YELLOWSTONE fans, watch and see if you can identify the current cast member in this movie!\nNice movie, but once was enough for me\n{'Audio languages': ['English'], 'Subtitles': ['English'], 'Starring': ['Alan Tudyk', 'Alice Wetterlund', 'Corey Reynolds'], 'Studio': ['SYFY']}\nOne of a kind Sci Fi series with interesting characters and enough suspense to keep me watching. Quality writing and acting.\nGreat Series\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Damon Thomas', 'James Hawes', 'Brian Kirk', 'Paco Cabezas', 'J.A. Bayona', 'Coky Giedroyc', 'Dearbhla Walsh', 'Kari Skogland', 'Toa Fraser'], 'Producers': ['John Logan', 'Pippa Harris', 'Sam Mendes'], 'Starring': ['Josh Hartnett', 'Timothy Dalton', 'Eva Green'], 'Studio': ['Showtime']}\nI like everything about this series!  Was absolutely mortified to discover that it had been canceled. I am currently watching season two and it’s also fantastic. A+++\nAWESOME 🤩\n{'Content advisory': ['Violence', 'frightening scenes', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['M. Night Shyamalan'], 'Producers': ['Frank Marshall', 'Sam Mercer', 'M. Night Shyamalan'], 'Starring': ['Mel Gibson', 'Joaquin Phoenix'], 'Studio': ['WALT DISNEY PICTURES']}\nI absolutely love this movie. I am no professional movie critic,  I just know what I like and to me the story and acting are very good. Mel Gibson & Joaquin Phoenix are both wonderful, as usual. ⭐️⭐️⭐️⭐️⭐️\nExcellent\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Slade'], 'Producers': ['Sam Raimi', 'Rob Tapert'], 'Starring': ['Josh Hartnett', 'Melissa George', 'Danny Huston'], 'Studio': ['Columbia Pictures']}\nVery good vampire movie. Good story. Very good effects. And Josh Hartnett. 🤩\nGreat Vampire Movie",
  "profile": "**User Summary:**\n\n- **Entertainment Preference:** Enjoys films and series with strong narratives and emotional depth, favoring renowned actors such as Tom Hanks, Leonardo DiCaprio, Matthew McConaughey, and Matt Damon. Recently engaged with a sci-fi series noted for interesting characters and suspense, showing an appreciation for quality writing and acting alongside emotionally resonant storytelling. Expressed enthusiasm for films praised for their execution and narrative strength, with a new interest in vampire films, highlighting effective storytelling and visual effects.\n\n- **Genre Interest:** Fond of biographical and family-oriented films with historical significance or heartwarming elements, while becoming increasingly open to gritty content, including horror and documentary-style presentations that explore complex themes. Demonstrated a keenness for suspenseful storytelling and engaging performances across different genres.\n\n- **Actor Affinity:** Holds a fondness for acclaimed performers and is expanding appreciation across genres, balancing interest in emotional intensity and realism, now including performances by actors like Josh Hartnett.\n\n- **Viewing Companions:** Selective in film and series choices, focusing on adult-appropriate content while considering suitability for younger viewers.\n\n- **Content Sensitivity:** Engages with films that include adult themes, maintaining a discerning eye for narrative coherence and character depth.\n\n- **Language and Accessibility:** Values bilingual content, preferring audio in English with English subtitles to enhance the viewing experience.\n\n- **Engagement Strategy:** Conducts post-viewing research and emphasizes trailers, reflecting a thoughtful approach to curating balanced viewing experiences. Enjoys repeatable films that leave a lasting impact, evidenced by high ratings for preferred content.",
  "metrics": {
    "rouge1_f": 0.16702052370842177,
    "rouge2_f": 0.021261516654854713,
    "rougeL_f": 0.0651096956829441,
    "meteor": 0.04911138814376306,
    "bleu1": 0.0021647554172995833,
    "bleu2": 0.0006772563301271447,
    "bleu3": 0.00028994801381484206,
    "bleu4": 8.112949147496603e-05,
    "bertscore_precision": 0.38451749086380005,
    "bertscore_recall": 0.49527060985565186,
    "bertscore_f1": 0.432922899723053
  }
}