{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/01/06\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Weir'], 'Producers': ['Hal McElroy', 'Jim McElroy'], 'Starring': ['Rachel Roberts', 'Vivean Gray', 'Helen Morse']}\nReview Text: I watched the film because another current movie I want to see (Old) took pointers from this film in it’s development of dread and the sheer overwhelming force of nature. The definition, sound, and color are exactly what you would expect from a film of it’s time. There are poignant moments, to be sure, and the sense of dread. Would I choose to watch it again? Probably not, but I don’t feel like I came away with nothing, either.<br />To my fellow YELLOWSTONE fans, watch and see if you can identify the current cast member in this movie!\nReview Title: Nice movie, but once was enough for me\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)'], 'Directors': ['John Lee Hancock'], 'Producers': ['Alison Owen', 'Ian Collie', 'Philip Steuer'], 'Starring': ['Paul Giamatti', 'Jason Schwartzman', 'Emma Thompson'], 'Studio': ['BUENA VISTA PAY TELEVISION']}\nGreat acting really brings the heart-wrenching back story of the movie Mary Poppins to life.<br />Fans of Mary Poppins would be exceptionally entertained, I believe.  Myself, I selected the movie to watch because I am a huge Tom Hanks fan.<br />My adult son (early 20's) and husband would not have been interested in this type of movie.<br />Best advice: watch the trailer to ensure it piques your interest first.\nVery Entertaining; Really Enjoyed the Characters & Storyline\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin Scorsese'], 'Producers': ['Emma Koskoff', 'Alexandra Milchan', 'Rick Yorn', 'Irwin Winkler', 'Danny Dimbort', 'Joel Gotler', 'Georgia Kacandes', 'Martin Scorsese', 'Leonardo DiCaprio', 'Riza Aziz', 'Joey McFarland', 'Emma Tillinger Koskoff'], 'Starring': ['Leonardo DiCaprio', 'Jonah Hill', 'Margot Robbie'], 'Studio': ['Hit Movies']}\nI was so intrigued by this fascinating movie that I have researched Jordan Belfort online and plan to order his books soon.  Second hand, of course, as he is currently in default with restitution payments to his victims.<br />Leonardo DiCaprio does an exceptional portrayal of this money hungry, drug crazed, sex addicted character.  I am definitely a bigger Leo fan than ever before after watching this.<br />If you have a problem with nudity, sex, drugs, profanity and/or nudity, sex, drugs, profanity - and there IS a double helping of all of it - then this movie is not for you.  Otherwise, grab some popcorn and enjoy!\nClear out the kiddos and order it.  You are about to be entertained!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Steve Coogan', 'Tracey Seaward', 'Gabrielle Tana'], 'Starring': ['Judi Dench', 'Steve Coogan', 'Sophie Kennedy Clark']}\nActing at it's finest.  I was completely immersed in this story from the very beginning.  I both laughed and cried.  I was surprised more than once at the turns the story took.  I highly recommend it.  It is not a movie that would particularly interest my husband who prefers westerns and action movies.  I am a very conservative mother of 2 adult sons and would say that in retrospect I would have required them to be 12 to 14 years old before they watched it.  It is plenty good enough to see twice, so I recommend parents watch it first, then decide what they feel is appropriate for viewing by the children.  Great movie.\nLoved it.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Jean-Marc Vallee'], 'Producers': ['Robbie Brenner', 'Rachel Winter'], 'Starring': ['Matthew McConaughey', 'Jennifer Garner', 'Jared Leto']}\nWonderfully acted, great story.  Provides enough insight and food for thought to last a lifetime.  I was emotionally wrung out by the end.  Anger, frustration, hope, and sadness - my feelings ran the gamut not only as I watched, but was left with long after viewing.  An adult's movie, to be sure.\nAn Eye Opener\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Neill Blomkamp'], 'Producers': ['Bill Block', 'Neill Blomkamp', 'Simon Kinberg'], 'Starring': ['Matt Damon', 'Jodie Foster', 'Sharlto Copley']}\nI consider myself a Matt Damon fan, and find the Bourne movies irresistible.  And I like science fiction.  Unfortunately while I am pretty good at identifying why I like particular movies, I am not so good at figuring out why a given movie falls flat.  I think the special effects were good, but they didn't compensate for deficits in either the storyline or character development.  Or maybe both.  I seriously wanted to love this movie, and I did watch the entire thing, but I'm not going to watch it again, and I'm not going to buy it.\nIt's okay.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Kriegsman'], 'Producers': ['Bipolar Productions'], 'Studio': ['Bipolar Productions']}\nI learned a lot more about the details of autopsies by watching this in comparison to watching Dr G. Medical Examiner. This is 100% gritty reality and you witness all of the steps taken. “Graphic” hardly touches the stark realism of deconstructing a human and observing organs and entrails. I took a few breaks, TBH. Just a lot to take in, but yes, it was exactly what I asked to see. Good job. Please note that this is not filmed Hollywood style and the lighting and sound clarity is of a realistic nature to be expected in this setting.\nHighly educational\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Weir'], 'Producers': ['Hal McElroy', 'Jim McElroy'], 'Starring': ['Rachel Roberts', 'Vivean Gray', 'Helen Morse']}\nI watched the film because another current movie I want to see (Old) took pointers from this film in it’s development of dread and the sheer overwhelming force of nature. The definition, sound, and color are exactly what you would expect from a film of it’s time. There are poignant moments, to be sure, and the sense of dread. Would I choose to watch it again? Probably not, but I don’t feel like I came away with nothing, either.<br />To my fellow YELLOWSTONE fans, watch and see if you can identify the current cast member in this movie!\nNice movie, but once was enough for me",
  "profile": "**User Summary:**\n\n- **Entertainment Preference:** Enjoys films with strong narratives and emotional depth, particularly with renowned actors such as Tom Hanks and Leonardo DiCaprio, while also appreciating performances by Matthew McConaughey and Matt Damon. Recently watched a film noted for its emotional resonance and thematic dread, highlighting interest in the impact of storytelling techniques on viewer experience.\n- **Genre Interest:** Fond of biographical and family-oriented films with historical significance or heartwarming elements. The user is becoming increasingly open to engaging with gritty and educational content, particularly documentary-style presentations that provide detailed subject insights.\n- **Actor Affinity:** Holds fondness for acclaimed performers, expanding appreciation to a broader range of genres and complex narratives that feature emotional intensity and realism.\n- **Viewing Companions:** Selective in film choices, prioritizing content suitable for adult audiences while maintaining a conservative approach for younger viewers.\n- **Content Sensitivity:** Engages with films that have adult themes and emotional complexity but critiques them on narrative coherence and character depth, reflecting a discerning eye for quality storytelling.\n- **Language and Accessibility:** Values bilingual content, actively seeking audio and subtitles to enhance the viewing experience.\n- **Engagement Strategy:** Conducts post-viewing research and emphasizes the importance of trailers, underscoring a thoughtful approach to curating balanced film experiences. While some films may leave a lasting impact, the user prefers those that offer repeatable enjoyment. \n\nThis update reflects a discerning appreciation for well-crafted films, balancing emotional resonance with critical insights into storytelling dynamics.",
  "metrics": {
    "rouge1_f": 0.18493150684931506,
    "rouge2_f": 0.010291595197255574,
    "rougeL_f": 0.08561643835616439,
    "meteor": 0.058245846197337005,
    "bleu1": 0.009352901954714785,
    "bleu2": 0.002130655502454582,
    "bleu3": 0.00033276184038615546,
    "bleu4": 0.00013161523845632732,
    "bertscore_precision": 0.38725388050079346,
    "bertscore_recall": 0.4770801067352295,
    "bertscore_f1": 0.427499383687973
  }
}