{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: I Am Number Four\nReview Date: 2014/02/06\nCategories: Science Fiction, Suspense, Intense, Ominous\nProduct Description: ['Aliens and their Guardians are hiding on Earth from intergalactic bounty hunters. They can only be killed in numerical order, and Number Four is next on the list. This is his story.']\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['D.J. Caruso'], 'Producers': ['Michael Bay'], 'Starring': ['Alex Pettyfer', 'Timothy Olyphant', 'Dianna Agron']}\nReview Text: This was a wonderful movie that my husband and I discovered on a whim one night when we didn't have anything else to watch. The plot and characters drew us in from the start. Very intriguing! It led me to the book series which I completed in a matter of weeks. I was very excited to see the other books made into movies but was heartbroken when some internet searching revealed that someone somewhere had deemed the first attempt (I am Number Four) a failure and that no more of the books would ever see the silver screen. I do not agree that this movie was a flop or failure and truly hope to one day see the entire series made into movies.\nReview Title: Superb!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Prep & Landing / Prep & Landing: Naughty vs. Nice (Totally Tinsel Collection) [Blu-ray]\nDave Foley  (Actor),     Derek Richardson  (Actor),     Kevin Deters  (Director),     Stevie Wermers  (Director)    &                   1                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Kids & Family\n['Product Description', \"PREP & LANDING -- On Christmas Eve, a high-tech team of elves from an elite unit known as 'Prep & Landing' ensures homes around the world are prepared for Santa's visit. But when two hilarious little elves face unexpected challenges and are pushed to their limits, it'll take a great big effort to save the season. Enjoy a heartwarming holiday classic sure to make everyone's Christmas list! PREP & LANDING: NAUGHTY VS. NICE -- The outrageous yuletide adventures of Christmas elves Lanny and Wayne continue in this totally tinsel adventure that reminds us there's room for everyone on the 'nice' list. Santa's stealthiest little elves must race to recover classified North Pole technology, which has fallen into the hands of a computer-hacking naughty kid, in order to stop Christmas from descending into chaos. Bring the family together for a comical adventure that puts the Ho, Ho, Ho in your holidays!\", 'Amazon.com', 'Changes in the television and animation industries have all but eliminated the half-hour special, once a holiday staple. When Disney\\'s CG \"Prep & Landing\" debuted in 2009, it scored an immediate hit and won four Emmy Awards. The program turned Santa Claus\\'s annual trip into a combination of a NASA launch and a', 'Mission: Impossible', 'assignment. Fitted out with high tech gear that includes gingerbread-man scanners and candy-cane grappling hooks, teams of elves make sure not a creature is stirring when Santa arrives. With more than 200 years of experience, Wayne has grown jaded and a little cynical: he\\'s been bucking for a promotion to supervisor of the Naughty and Nice List. Instead, he\\'s saddled with a novice partner: Lanny is eager, but he\\'s clearly not the brightest ornament on the tree. When Wayne gets careless and a little boy spots him, the entire elf bureaucracy panics. Of course, Wayne and Lanny save the day, ensuring everyone has a joyous Christmas. Disney brought the \"Prep & Landing\" characters back two years later in \"Naughty vs. Nice.\" A child on the Naughty List has gotten ahold of an elf\\'s fruitcake transmitter and is attempting to hack into Santa\\'s database. Wayne and Lanny accept the mission to recapture the transmitter, joined by Wayne\\'s roisterous younger brother Noel. Both Wayne and the would-be hacker must resolve aching sibling rivalries before Christmas can be merry. The two specials have a more lavish look than most television animation, with richly detailed settings. The filmmakers clearly have fun giving new meanings to such holiday references as \"It\\'s jingle time!\" and \"The Partridge is in the Pear Tree.\" The', 'Totally Tinsel Collection', 'comes loaded with extras, the most entertaining of which is the \"Stocking Stuffer\" mini-adventure \"Secret Santa.\" Wayne and Lanny have joined Rudolph, Charlie Brown, and the Grinch as holiday standard-bearers. (Rated G: cartoon violence)', '--Charles Solomon']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Blu-ray, Animated, Color, NTSC, Widescreen, Subtitled', 'Contributor': 'Stevie Wermers, Rob Riggle, Dave Foley, Kevin Deters, Daniel Gerson, Robert L. Baird, Derek Richardson, Sarah ChalkeStevie Wermers, Rob Riggle, Dave Foley, Kevin Deters, Daniel Gerson, Robert L. Baird, Derek Richardson, Sarah Chalke   See more', 'Language': 'French (Dolby Digital 5.1), English (DTS-HD High Res Audio), Spanish (Dolby Digital 2.0)', 'Runtime': '46 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': 'WD11019300BR', 'Director': 'Kevin Deters, Stevie Wermers', 'Media Format': 'Multiple Formats, Blu-ray, Animated, Color, NTSC, Widescreen, Subtitled', 'Run time': '46 minutes', 'Release date': 'November 6, 2012', 'Actors': 'Dave Foley, Derek Richardson, Sarah Chalke, Rob Riggle', 'Subtitles': 'French, Spanish, English', 'Studio': 'ABC STUDIOS', 'Writers': 'Robert L. Baird, Daniel Gerson', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis is a wonderfully funny addition to any family's holiday movie collection. It is a hilarious and care-free break from the usual hustle and bustle of the holiday season for every family member. We highly recommend it to anyone who wishes to expand their traditional collection of holiday flicks (i.e., Rudolf, Frosty, the Grinch) as it falls into place perfectly!\nNew Family Tradition\nLittle House on the Prairie: The Complete Nine-Season Set (Complete Series + Pilot Episode)\nMichael Landon  (Actor),     Melissa Sue Anderson  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['When', 'Little House on the Prairie', \"made its television debut in September 1974, it captured the hearts and imaginations of families across the country. A top-rated series throughout its nine-season run, the timeless show's themes of love, discipline, morality and strong values continue to resonate with viewers around the world through its continued syndication. Nominated for 17 Emmy and three Golden Globe awards during its original TV run,\", 'Little House on the Prairie', \"was based on the best-selling books by Laura Ingalls Wilder that documented the extraordinary adventures of a young pioneer family's struggle to build a new life for themselves on the lawless American frontier of the 1870s.\"]\n{'Genre': 'Romance, Action & Adventure', 'Format': 'Dolby, NTSC, Full Screen', 'Contributor': 'Michael Landon, Melissa Gilbert, Karen Grassle, Melissa Sue Anderson, Lindsay Greenbush, Scottie MacGregorMichael Landon, Melissa Gilbert, Karen Grassle, Melissa Sue Anderson, Lindsay Greenbush, Scottie MacGregor  See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '11 x 6.25 x 2 inches; 2.45 Pounds', 'Media Format': 'Dolby, NTSC, Full Screen', 'Release date': 'October 18, 2011', 'Actors': 'Michael Landon, Melissa Sue Anderson, Melissa Gilbert, Karen Grassle, Lindsay Greenbush', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nI purchased this set for my mother who raised me on this show (along with Bonanza, Cheers and other classics). I was told the series was delivered in a timely manner and that no damage was incurred during shipping. Other than that, I am constantly getting phone calls asking if I recall certain episodes and at other times I am sharing the memories of days past. My mother is extremely pleased with this set which makes me pleased as well. A wonderful collection of memories.\nExtremely surprised and pleased Mom\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'हिन्दी', 'Español (España)', 'मराठी', 'Español (Latinoamérica)', 'Português', 'తెలుగు', 'Français (France)', 'தமிழ்'], 'Subtitles': ['English [CC]', 'العربية', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Indonesia', 'Bahasa Melayu', 'Nederlands', 'Português (Brasil)', 'Português (Portugal)', 'ไทย', 'Türkçe', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Robert Schwentke'], 'Producers': ['Lorenzo di Bonaventura', 'Mark Vahradian'], 'Starring': ['Julian McMahon', 'James Remar', 'Ernest Borgnine']}\nExcellent movie that kept my husband and I either laughing or on the edge of our couch nearly the entire time. Great stay at home date night movie.\nRed\nStar Trek: Original Motion Picture Collection\nWilliam Shatner  (Actor, Director),     Leonard Nimoy  (Actor, Director),     Nicholas Meyer  (Director),     Robert Wise  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Prepare to boldly go where no man has gone before with the Star Trek: Original Motion Picture Collection, an action-packed box set featuring the six films in their original theatrical versions starring the U.S.S. Enterprise's legendary crew. The films have been digitally remastered and The Wrath of Khan has been fully restored in high definition with brilliant picture quality and 7.1 Dolby TrueHD. Star Trek: The Motion Picture (1979) Star Trek: The Wrath of Khan (1982) Star Trek: The Search for Spock (1984) Star Trek: The Voyage Home (1986) Star Trek: The Final Frontier (1989) Star Trek: The Undiscovered Country (1991)\", 'Amazon.com', 'Star Trek I : The Original Motion Picture', 'Back when the first', 'Star Trek', 'feature was released in December 1979, the', 'Trek', 'franchise was still relatively modest, consisting of the original TV series, an animated cartoon series from 1973-74, and a burgeoning fan network around the world. Series creator Gene Roddenberry had conceived a second TV series, but after the success of', 'Star Wars', 'the project was upgraded into this lavish feature film, which reunited the original series cast aboard a beautifully redesigned starship U.S.S.', 'Enterprise', '. Under the direction of Robert Wise (best known for', 'West Side Story', '), the film proved to be a mixed blessing for', 'Trek', \"fans, who heatedly debated its merits; but it was, of course, a phenomenal hit. Capt. Kirk (William Shatner) leads his crew into the vast structures surrounding V'Ger, an all-powerful being that is cutting a destructive course through Starfleet space. With his new First Officer (Stephen Collins), the bald and beautiful Lieutenant Ilia (played by the late Persis Khambatta) and his returning veteran crew, Kirk must decipher the secret of V'Ger's true purpose and restore the safety of the galaxy. The story is rather overblown and derivative of plots from the original series, and avid Trekkies greeted the film's bland costumes with derisive laughter. But as a feast for the eyes, this is an adventure worthy of big-screen trekkin'. Douglas Trumbull's visual effects are astonishing, and Jerry Goldmith's score is regarded as one of the prolific composer's very best (with its main theme later used for\", 'Star Trek: The Next Generation', '). And, fortunately for', 'Star Trek', \"fans, the expanded 143-minute version (originally shown for the film's network TV premiere) is generally considered an improvement over the original theatrical release.\", '--Jeff Shannon', 'Star Trek II :', 'The Wrath of Khan', 'Although', 'Star Trek: The Motion Picture', 'had been a box-office hit, it was by no means a unanimous success with', 'Star Trek', 'fans, who responded much more favorably to the \"classic', 'Trek', '\" scenario of', 'Star Trek II: The Wrath of Khan', '. Inspired by the \"Space Seed\" episode of the original TV series, the film reunites newly promoted Admiral Kirk with his nemesis from the earlier episode--the genetically superior Khan (Ricardo Montalban)--who is now seeking revenge upon Kirk for having been imprisoned on a desolated planet. Their battle ensues over control of the Genesis device, a top-secret Starfleet project enabling entire planets to be transformed into life-supporting worlds, pioneered by the mother (Bibi Besch) of Kirk\\'s estranged and now-adult son. While Mr. Spock mentors the young Vulcan Lt. Saavik (then-newcomer Kirstie Alley), Kirk must battle Khan to the bitter end, through a climactic starship chase and an unexpected crisis that will cost the life of Kirk\\'s closest friend. This was the kind of character-based', 'Trek', \"that fans were waiting for, boosted by spectacular special effects, a great villain (thanks to Montalban's splendidly melodramatic performance), and a deft combination of humor, excitement, and wondrous imagination. Director Nicholas Meyer (who would play a substantial role in the success of future\", 'Trek', 'features) handles the film as a combination of', 'Moby Dick', ', Shakespearean tragedy, World War II submarine thriller, and dazzling science fiction, setting the successful tone for the', 'Trek', 'films that followed.', '--Jeff Shannon', 'Star Trek III :', 'The Search for Spock', \"You didn't think Mr. Spock was\", 'really', \"dead, did you? When Spock's casket landed on the surface of the Genesis planet at the end of\", 'Star Trek II', ', we had already been told that Genesis had the power to bring \"life from lifelessness.\" So it\\'s no surprise that this energetic but somewhat hokey sequel gives Spock a new lease on life, beginning with his rebirth and rapid growth as the Genesis planet literally shakes itself apart in a series of tumultuous geological spasms. As Kirk is getting to know his estranged son (Merritt Butrick), he must also do battle with the fiendish Klingon Kruge (Christopher Lloyd), who is determined to seize the power of Genesis from the Federation. Meanwhile, the regenerated Spock returns to his home planet, and', 'Star Trek III', \"gains considerable interest by exploring the ceremonial (and, of course, highly logical) traditions of Vulcan society. The movie's a minor disappointment compared to\", 'Star Trek II', \", but it's a--well, logical--sequel that successfully restores Spock (and first-time film director Leonard Nimoy) to the phenomenal\", 'Trek', \"franchise...as if he were ever really gone. With Kirk's willful destruction of the U.S.S.\", 'Enterprise', 'and Robin Curtis replacing the departing Kirstie Alley as Vulcan Lt. Saavik, this was clearly a transitional film in the series, clearing the way for the highly popular', 'Star Trek IV', '.', '--Jeff Shannon', 'Star Trek IV :', 'The Voyage Home', 'Jumping on to the end-of-the-century bandwagon a little early, Paramount Pictures released 10 of their top films in one 10-pack, the Millennium Collection, in 1998. All the films are presented in their widescreen editions; one,', \"Breakfast at Tiffany's\", ', is offered in this format for the first time. The set includes 5 Best Picture Oscar winners and films that took home an additional 33 Academy Awards. All the tapes are available to buy individually. The pack, with a handsome mosaic of faces from the movies, also features collector gift cards (a movie version of baseball cards) and a commemorative booklet detailing the productions of all 10 films. The collection is oddly weighted toward the last 25 years, offering only one film from the 1950s and one from the 1960s. Your taste in current cinema will define the value of the set. Besides', \"Tiffany's\", \", one of Audrey Hepburn's finest films, the collection contains:\", 'The Ten Commandments', 'with Charlton Heston,', 'Grease', \"with John Travolta, Francis Ford Coppola's\", 'Apocalypse Now', 'and', 'The Godfather', ', the funny, whale-saving', 'Star Trek IV--The Voyage Home', \", Tom Cruise's hit\", 'Top Gun', ', the smash hit', 'Ghost', \"with Demi Moore, Mel Gibson's Celt fest\", 'Braveheart', ', and', 'Forrest Gump', 'with Tom Hanks.', '--Doug Thomas', 'Star Trek V :', 'The Final Frontier', 'Movie critic Roger Ebert summed it up very succinctly: \"Of all of the', 'Star Trek', 'movies, this is the worst.\" Subsequent films in the popular series have done nothing to disprove this opinion; we can be grateful that they\\'ve all been significantly better since this film was released in 1989. After Leonard Nimoy scored hits with', 'Star Trek III', 'and', 'IV', \", William Shatner used his contractual clout (and bruised ego) to assume directorial duties on this mission, in which a rebellious Vulcan (Laurence Luckinbill) kidnaps Federation officials in his overzealous quest for the supreme source of creation. That's right, you heard it correctly:\", 'Star Trek V', 'is about a crazy Vulcan\\'s search for God. By the time Kirk, Spock, and their Federation cohorts are taken to the Great Barrier of the galaxy, this journey to \"the final future\" has gone from an embarrassing prologue to an absurd conclusion, with a lot of creaky plotting in between. Of course, die-hard Trekkies will still allow this movie into their video collections; but they\\'ll only watch it when nobody else is looking. After this humbling experience, Shatner wisely relinquished the director\\'s chair to', 'Star Trek II', \"'s Nicholas Meyer.\", '--Jeff Shannon', 'Star Trek VI :', 'The Undiscovered Country', 'Star Trek V', 'left us nowhere to go but up, and with the return of', 'Star Trek II', 'director Nicholas Meyer,', 'Star Trek VI', 'restored the movie series to its classic blend of space opera, intelligent plotting, and engaging interaction of stalwart heroes and menacing villains. Borrowing its subtitle (and several lines of dialogue) from Shakespeare, the movie finds Admiral Kirk (William Shatner) and his fellow', 'Enterprise', 'crew members on a diplomatic mission to negotiate peace with the revered Klingon Chancellor Gorkon (David Warner). When the high-ranking Klingon and several officers are ruthlessly murdered, blame is placed on Kirk, whose subsequent investigation uncovers an assassination plot masterminded by the nefarious Klingon General Chang (Christopher Plummer) in an effort to disrupt a historic peace summit. As this political plot unfolds,', 'Star Trek VI', 'takes on a sharp-edged tone, with Kirk and Spock confronting their opposing views of diplomacy, and testing their bonds of loyalty when a Vulcan officer is revealed to be a traitor. With a dramatic depth befitting what was to be the final movie mission of the original', 'Star Trek', 'crew, this film took the veteran cast out in respectably high style. With the torch being passed to the crew of', 'Star Trek: The Next Generation', ', only Kirk, Scotty, and Chekov would return, however briefly, in', 'Star Trek: Generations', '.', '--Jeff Shannon']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.15 Pounds', 'Item model number': 'PRT142754BR', 'Director': 'Leonard Nimoy, Nicholas Meyer, Robert Wise, William Shatner', 'Media Format': 'Blu-ray, Color, Widescreen, NTSC', 'Run time': '11 hours and 25 minutes', 'Release date': 'May 12, 2009', 'Actors': 'William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, George Takei', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Writers': 'Alan Dean Foster, David Loughery, Denny Martin Flinn, Gene Roddenberry', 'Number of discs': '7'}\nI still have this collection on VHS, if you can believe that. It is a wonderfully made collection of films and, not surprisingly, they all look superb in the Blu-Ray version. The sound is amazing and the video and visual affects are nothing short of a miracle what they can accomplish with technology these days. I am glad to have had the opportunity to upgrade from my VHS set and thank Amazon for making this collection the deal of the day. Truly a great deal all around and a very worthwhile purchase.\nStar Trek Original Motion Picture Collection\nRocky: The Undisputed Collection (Rocky / Rocky II / Rocky III / Rocky IV / Rocky V / Rocky Balboa)\nSylvester Stallone  (Actor, Director, Writer),     Burt Young  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Amazon.com', 'Review for', 'Rocky', ':', 'The only remaining evidence that Sylvester Stallone might have had a respectable career, this 1976 Oscar winner (for Best Picture, Director, and Editing) is still the quintessential ode to an underdog and one of the best boxing movies ever made. After writing the script about a two-bit boxer who gets a \"million-to-one shot\" against the world heavyweight champion, Stallone insisted that he star in the title role, and his equally unknown status helped to catapult him (and this rousing film) to overnight success. The story is familiar, but it has been handled with such vitality and emotional honesty that you can\\'t help but leap and cheer for Rocky Balboa, the chump turned champ (despite his valiant defeat in the ring) who stuns the boxing world with the support of his timid girlfriend, Adrian (Talia Shire), and grizzled trainer, Mickey (Burgess Meredith). Oscar nominations went to all the lead actors (including Burt Young as Adrian\\'s hot-tempered brother), but four sequels could never top the universal appeal of this low-budget crowd pleaser. --', 'Jeff Shannon', 'Review for', 'Rocky II', ':', 'Beginning precisely where Rocky left off, the surprisingly effective 1979 sequel takes the saga of Rocky Balboa to its logical next step, as the palooka turned public idol and media darling returns to his \"normal\" life in Philadelphia with his newlywed bride Adrian (Talia Shire) and some degree of material comfort. He needs to find a job, but boxing champ Apollo Creed (Carl Weathers) is challenging Rocky to a lucrative rematch, and despite his doctor\\'s warning against future boxing, Rocky can\\'t resist. Defying the odds that most sequels can\\'t live up to their originals, Rocky II doesn\\'t pack all the punch that Rocky did, but it takes us further into the lives of its now-familiar and beloved characters, and Stallone (as director and star) gives us another rousing finale in the ring. Do you really need to know who wins? --', 'Jeff Shannon', 'Review for', 'Rocky III', ':', 'Rocky III', ': The third installment in the Rocky saga is the last one to matter, and in this case only marginally. The now rich and famous Rocky (Sylvester Stallone) triumphantly pummels a succession of boxing challengers until he encounters Clubber Lang (Mr. T), a human wall of brick who wants a piece of Rocky\\'s action. The Rock\\'s loyal trainer Mickey (Burgess Meredith) has taken ill and dies, so Rocky recruits retired opponent Apollo Creed (Carl Weathers) to whip him into fighting shape after his embarrassing defeat to Clubber. Time for another rematch, mixed in with some family matters involving Rocky\\'s brother-in-law Paulie (Burt Young), who\\'s feeling neglected amid all the hoopla. Not bad as sequels go, boosted by Mr. T.\\'s taunting presence and yet another rousing finale. For those with a bad case of \\'80s nostalgia, the hit theme song \"Eye of the Tiger\" is sure to bring back memories. --', 'Jeff Shannon', 'Review for', 'Rocky IV', ': It was time for Sylvester Stallone to say \"enough, already\" to the boxing hero he plays in the popular Rocky film series, but instead Stallone kept the saga going by pushing Rocky into Rambo territory. The 1985', 'Rocky IV', \"finds the Italian stallion pitted against a seemingly unbeatable Russian monster named Drago (Dolph Lundgren) who lets his wife (Stallone's then-wife, Brigitte Nielsen) do all the talking. With a mighty punch, Drago has sent Rocky's former opponent and trainer Apollo Creed to an early grave, and the boxer responds with the ultimate challenge. Even the Russians are rooting for Rocky, so it's not hard to guess how the film ends. Despite Stallone's claims to the contrary, this installment was followed by\", 'Rocky V', 'in 1990. --', 'Jeff Shannon', 'Review for', 'Rocky Balboa', ': The sixth installment of the', 'Rocky', 'series picks up the story of the Italian Stallion 16 years after the morose', 'Rocky V', \". And sure, at his advanced age, Sylvester Stallone now looks like one of those sides of beef his character used to pound on. No matter. Somehow you buy the premise after all these years, even if it takes forever for Rocky Balboa to stop wallowing in self-pity (Adrian is dead, his old haunts are demolished) and get down to the business of drinking raw eggs and running up staircases. The business at hand is an unlikely exhibition fight with champion Mason Dixon (Antonio Tarver), which the near-sexagenarian Mr. Balboa has no business accepting. Of course, just as sure as the horns of Bill Conti's theme music are even now trumpeting through your head, the ol' Rock might have a punch or two left in him. Stallone wrote and directed, and there isn't much to say except that the movie steps in its pre-determined paces with a canny sense of what has come before (it's practically an homage to all the previous Rocky pictures, complete with fleeting flashbacks). Burt Young is around again, and Geraldine Hughes makes an appealing, rather chaste female companion for Rocky. Stallone's Rocky has gotten suspiciously articulate over the years, but he still knows how to slouch. If Stallone never forgets that, he can probably keep the franchise rolling. --\", 'Robert Horton']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.3 x 1 inches; 4 Ounces', 'Director': 'Sylvester Stallone', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Box set, Color, Dolby, DTS Surround Sound, Dubbed, Extra tracks, NTSC, Widescreen', 'Run time': '8 hours and 52 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Sylvester Stallone, Burt Young, Carl Weathers, Burgess Meredith, Talia Shire', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, Portuguese', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Sylvester Stallone', 'Number of discs': '7'}\nI still have most of these movies on VHS, if you can believe that. I purchased this set for my husband when it was the deal of the day a few weeks ago. This collection is perhaps one of the most uplifting and as American as you can get. And it was a great deal, impossible to pass up at only $29.00.\nRocky\nThe Santa Clause 3-Movie Collection [Blu-ray]\nTim Allen  (Actor)    Rated:    G    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Comedy\n[\"Have three times the fun as you celebrate the season with the complete SANTA CLAUSE trilogy in one spectacular box set! Superstar comedian Tim Allen delivers the perfect gift as he stars as the big man, himself, in three warm and wonderful movies about discovering the true magic of Christmas. See how it all began with Disney's original classic, and hop on Santa's sleigh for an exciting ride filled with belly laughs and family fun. Christmas gets a little nuttier when Scott Calvin unknowingly inherits the role of the legendary St. Nick. His ordinary life snowballs into a hysterical series of outrageous events as he fills out his Santa suit, meets the future Mrs. Claus and faces his ultimate test against the mischievous Jack Frost. With a blizzard of bonus features and three magical movies, this box set is hours of holiday entertainment your whole family will enjoy again and again.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '25646556', 'Media Format': 'Blu-ray, Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 37 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Tim Allen', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WALT DISNEY PICTURES', 'Number of discs': '3'}\nA great deal on a classic set of movies. What else can one say about this set of Blu-ray movies?\nGreat deal\nIce Age: The Meltdown\nRay Romano  (Actor),     John Leguizamo  (Actor),     Carlos Saldanha  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Product Description', 'Your favorite sub-zero heroes are back for another incredible adventure in the super-cool animated comedy Ice Age the Meltdown! The action heats up', 'Amazon.com', 'The love life of a woolly mammoth--handled with G-rated delicacy--drives this sequel to the first computer-animated romp in the age of prehistoric mammals. While the first', 'Ice Age', 'took a delightful premise and suffocated it with a formulaic plot--in which a mammoth named Manfred (voiced by Ray Romano,', 'Everyone Loves Raymond', '), a sloth named Sid (John Leguizamo,', 'Moulin Rouge!', '), and a sabre-tooth tiger named Diego (Denis Leary,', 'Rescue Me', ') helped an abandoned human infant return to its tribe (basically,', 'Three Mammals and a Baby', ')--the sequel takes the now-familiar setting, gives it a shapeless, episodic storyline, and yet somehow becomes pretty darn entertaining. Faced with the threat of a flood from melting ice, our heroic trio are on the run to escape from their blossoming valley. On the way, they meet a female mammoth (Queen Latifah,', 'Bringing Down the House', \") who thinks she's an opossum and get menaced by some freshly defrosted carnivo! rous fish. Add into the mix a herd of lava-worshipping mini-sloths, some Busby Berkeley-style vultures, and more ingenious slapstick featuring the acorn-crazed Scrat, and\", 'Ice Age: The Meltdown', 'will amuse even jaded adults. --', 'Bret Fetzer', 'Beyond', 'Ice Age: The Meltdown', 'Ice Age - Super Cool Edition', 'Ice Age & Ice Age 2: The Meltdown - (DVD 2-Pack)', 'Funtastic Adventures Collection Box Set (Ice Age / Robots / Fern Gully / Once Upon a Rainforest)', 'Stills from', 'Ice Age: The Meltdown', '(click for larger image)']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '2239613', 'Director': 'Carlos Saldanha', 'Media Format': 'Anamorphic, Blu-ray, Multiple Formats, Color, Dolby, DTS Surround Sound, Subtitled', 'Run time': '1 hour and 31 minutes', 'Release date': 'November 21, 2006', 'Actors': 'Ray Romano, John Leguizamo, Denis Leary, Queen Latifah', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'English (DTS 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unknown (DTS 5.1)', 'Studio': 'Twentieth Century Fox Home Entertainment', 'Number of discs': '1'}\nI adore this movie as it is appealing to adults and children alike. It is rare these days to find a movie (let alone an entire series) that the entire family can enjoy together. The Ice Age series is a staple in our collection and I will continue to recommend it to everyone.\nGotta love Scrat\nThe Hunger Games (Blu-ray + Digital Copy) [Blu-ray] [2012]\nJennifer Lawrence  (Actor),     Josh Hutcherson  (Actor),     Gary Ross  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Based on the first novel of Suzanne Collins' best selling The Hunger Games trilogy. In the ruins of what was once North America, twelve remaining districts are forced by the Capitol to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, televised for all to see. 16-year-old Katniss Everdeen becomes a contender in the Games in order to save her little sister from having to compete. Only one of the 24 contenders can survive. To win the Games and return home, Katniss must make choices that weigh survival against humanity and life against love.\", 'Amazon.com', 'Building on her performance as a take-no-prisoners teenager in', \"Winter's Bone\", ', Jennifer Lawrence portrays heroine Katniss Everdeen in Gary Ross\\'s action-oriented adaptation of author-screenwriter Suzanne Collins\\'s young adult bestseller. Set in a dystopian future in which the income gap is greater than ever, 24 underprivileged youth fight to the death every year in a televised spectacle designed to entertain the rich and give the poor enough hope to quell any further unrest--but not too much, warns Panem president Snow (Donald Sutherland), because that would be \"dangerous.\" Hailing from the same mining town, 16-year-olds Katniss and Peeta (Josh Hutcherson,', 'The Kids Are All Right', \") represent District 12 with the help of escort Effie (an unrecognizable Elizabeth Banks) and mentor Haymitch (a scene-stealing Woody Harrelson). At first they're adversaries, but a wary partnership eventually develops, though the rules stipulate that only one contestant can win. For those who haven't read the book, the conclusion is likely to come as a surprise. Before it arrives, Ross (\", 'Pleasantville', \") depicts a society in which the Haves appear to have stepped out of a Dr. Seuss book and the Have-Nots look like refugees from the WPA photographs of Walker Evans. It's an odd mix, made odder still by frenetic fight scenes where it's hard to tell who's doing what to whom. Fortunately, Lawrence and Hutcherson prove a sympathetic match in this crazy, mixed-up combination of\", 'Survivor', ',', 'Lost', ', and the collected works of George Orwell.', '--Kathleen C. Fennessy', 'Synopsis', 'Every year in the ruins of what was once North America, the Capitol of the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games. A twisted punishment for a past uprising and an ongoing government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains. Sixteen-year-old Katniss Everdeen volunteers in her younger sister’s place to enter the games, and is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy when she’s pitted against highly-trained Tributes who have prepared for these Games their entire lives. If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love.', 'About the Author', 'SUZANNE COLLINS', 'first made her mark in children’s literature with the New York Times bestselling', 'Underland Chronicles', 'for middle grade readers. Her debut for readers aged 12 and up,', 'The Hunger Games', 'was an instant bestseller, appealing to both teen readers and adults. It has appeared on the New York Times bestseller list for more than 180 consecutive weeks/more than three consecutive years since publication. Suzanne Collins also had a successful and prolific career writing for children’s television. In 2010 Collins was named to the TIME 100 list as well as the Entertainment Weekly Entertainers of the Year list. In 2011 Fast Company named her to their 100 Most Creative People in Business.', 'Meet the Characters', 'Katniss Everdeen', 'The Tribute who becomes a heroine when she volunteers to take her sister’s place in the Hunger Games.', 'Peeta Mellark', 'The male Tribute from District 12, who has long harbored secret feelings for Katniss.', 'Gale Hawthorne', 'Katniss’s fellow hunter, rebel and best friend, who is heartbroken when she volunteers and departs for the Games.', 'Haymitch Abernathy', 'Victor of the 50th Hunger Games, now the rarely sober mentor for Katniss and Peeta.', 'Effie Trinket', 'Katniss’s elaborately-coiffed escort and PR handler for the Games.', 'Cinna', 'Katniss’s personal Stylist for the Games who becomes her unexpected confidante and supporter.']\n{'Genre': 'Action/Adventure', 'Format': 'Blu-ray, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Contributor': 'Lenny Kravitz, Woody Harrelson, Gary Ross, Elizabeth Banks, Josh Hutcherson, Jennifer Lawrence, Donald Sutherland, Stanley Tucci, Wes Bentley, Suzanne Collins, Amandla Stenberg, Billy Ray, Liam HemsworthLenny Kravitz, Woody Harrelson, Gary Ross, Elizabeth Banks, Josh Hutcherson, Jennifer Lawrence, Donald Sutherland, Stanley Tucci, Wes Bentley, Suzanne Collins, Amandla Stenberg, Billy Ray, Liam Hemsworth  See more', 'Language': 'Spanish (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), English (DTS-HD Master Audio 7.1)', 'Runtime': '2 hours and 22 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 2.4 Ounces', 'Item model number': 'LGT32741BR', 'Director': 'Gary Ross', 'Media Format': 'Blu-ray, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 22 minutes', 'Release date': 'August 18, 2012', 'Actors': 'Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Woody Harrelson, Elizabeth Banks', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate Home Entertainment', 'Writers': 'Gary Ross, Suzanne Collins, Billy Ray', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI had never read the books, didn't even know about the series until I saw the movie trailer and my curiosity was peaked. I saw the movie and was immediately hooked. I appreciate how it appeals to multiple age groups and that, as an adult, I do not have to be embarrassed to admit that I am a District 12 fan. These movies are very well made and nothing that was on the big screen was lost in translation when put onto Blu-Ray discs. All of the imagery and sound quality is still intact and I can enjoy the movie at home just as I did in the theater.\nA new favorite\nOpus n' Bill in A Wish for Wings That Work [DVD]\nSkip Jones  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Animation\n[\"Take your family to Bloom County with the quirky perennial favorite Opus n' Bill in A Wish for Wings That Work, a whimsical, wacky cartoon treat that's as funny for grownups as it is fun for kids! From Pulitzer Prize-winning author-artist Berkeley Breathed, it's a merry, madcap romp with Opus the earthbound penguin and his brain-fried feline cohort, Bill.Wrestling with an unfulfilled wish to soar through the air like any other self-respecting bird, the plucky penguin decides there's only one person who can make his aeronautic dream come true: Father Christmas. Bill the Cat coughs up a wild idea that just may bring a holiday miracle, but when ol' St. Nick finds himself in hot water on December 24th, the fate of Christmas itself suddenly depends on the kind of heroism that only comes in a penguin-sized package! Will Opus come to the rescue and learn the value of being true to oneself?\", ']]>']\n{'Genre': 'Kids & Family, DVD Movie, Animation, Blu-ray Movie, Opus & Bill in A Wish for Wings That Work, Opus and BillKids & Family, DVD Movie, Animation, Blu-ray Movie, Opus & Bill in A Wish for Wings That Work, Opus and Bill   See more', 'Format': 'AC-3, NTSC, Animated, Dolby, Color', 'Contributor': 'Skip Jones', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0)', 'Runtime': '24 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25195009515', 'Director': 'Skip Jones', 'Media Format': 'AC-3, NTSC, Animated, Dolby, Color', 'Run time': '24 minutes', 'Release date': 'September 1, 2015', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nA classic film that has been a Christmas tradition in my family for over 20 years. We taped it when it originally ran on TV the one time back in the early 1990's and have since worn that poor VHS tape out. Luckily, it was released on DVD a few years later and now it was time for me to have a copy in my own home. This lovely story teaches a timeless moral that every person should know and is told as only Opus n Bill can. It is truly worth every penny as this is, currently, the only way to watch this priceless short movie.\nClassic\nIce Age: Continental Drift (Blu-ray / DVD + Digital Copy)\nRay Romano  (Actor),     Denis Leary  (Actor),     Steve Martino  (Director),     Mike Thurmeier  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Scrat's nutty pursuit of the cursed acorn, which he's been after since the dawn of time, has world-changing consequences -- a continental cataclysm that triggers the greatest adventure of all for Manny, Diego and Sid. In the wake of these upheavals, Sid reunites with his cantankerous Granny, and the herd encounters a ragtag menagerie of seafaring pirates determined to stop them from returning home.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Animated, Color, AC-3, Dolby, DTS Surround Sound, Subtitled, Widescreen, Digital_copyMultiple Formats, Blu-ray, Animated, Color, AC-3, Dolby, DTS Surround Sound, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'Steve Martino, Denis Leary, Mike Thurmeier, Ray Romano', 'Language': 'English, French', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.89 Ounces', 'Item model number': 'FOXS2280764BR', 'Director': 'Steve Martino, Mike Thurmeier', 'Media Format': 'Multiple Formats, Blu-ray, Animated, Color, AC-3, Dolby, DTS Surround Sound, Subtitled, Widescreen, Digital_copy', 'Release date': 'December 11, 2012', 'Actors': 'Ray Romano, Denis Leary', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nI adore this movie as it is appealing to adults and children alike. It is rare these days to find a movie (let alone an entire series) that the entire family can enjoy together. The Ice Age series is a staple in our collection and I will continue to recommend it to everyone.\nGotta love Scrat!\nMr. Magoo's Christmas Carol (Collector's Edition) (Blu-ray + DVD)\nJim Backus  (Actor),     Morey Amsterdam  (Actor),     Abe Levitow  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Mr Magoos Chri(Br+Dv)']\n{'Genre': 'Kids & Family', 'Format': \"Multiple Formats, Blu-ray, Collector's Edition, Color, Animated, Dubbed, Full Screen, NTSC\", 'Contributor': 'Abe Levitow, Jack Cassidy, Morey Amsterdam, Paul Frees, Royal Dano, Jim Backus', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'CL2913', 'Director': 'Abe Levitow', 'Media Format': \"Multiple Formats, Blu-ray, Collector's Edition, Color, Animated, Dubbed, Full Screen, NTSC\", 'Run time': '52 minutes', 'Release date': 'June 23, 2016', 'Actors': 'Jim Backus, Morey Amsterdam, Jack Cassidy, Royal Dano, Paul Frees', 'Dubbed': 'French', 'Studio': 'Classic Media', 'Number of discs': '1'}\nI purchased this for my father for Christmas and he hasn't smiled like that in years as he said it brought back his childhood. It is a timeless classic that will always hold a place in our family's hearts. Today, there are so many Christmas 'specials' that include sexual innuendos, vulgar language and other not so family-oriented plots and characters. So, it is wonderful to still have Mr. Magoo around to assist in instilling the true feeling and meaning of Christmas in a proper way.\nGifted\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Español (España)', 'Español (Latinoamérica)', '日本語', 'Português', 'Français (France)'], 'Subtitles': ['English [CC]', 'العربية', 'Español (Latinoamérica)', 'Español (Latinoamérica) [CC]', 'Español (España)', 'Français (Canada)', 'Français (France)', 'हिन्दी', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Nederlands', 'Português (Brasil)', 'Português (Brasil) [SDH]', 'Português (Portugal)', 'ไทย', 'Türkçe', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Bill Condon'], 'Producers': ['Wyck Godfrey', 'Karen Rosenfelt', 'Stephenie Meyer'], 'Starring': ['Kristen Stewart', 'Robert Pattinson', 'Taylor Lautner']}\nIt was a long haul but I enjoyed every minute of the Twilight Saga. BD Part 2 brought the storyline to an end, albeit a surprising end for someone who did not read the books. I will continue to revisit this story whenever I need a Jacob vs. Edward fix or when I need an escape from reality as these movies help accomplish that very well!\nGreat Movie\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ang Lee'], 'Producers': ['Gil Netter', 'Ang Lee', 'David Womark'], 'Starring': ['Irrfan Khan', 'Tabu', 'Gerard Depardieu'], 'Studio': ['Epix']}\nWe rented this movie on our Wii one night when we were feeling adventurous. The reviews were mostly positive and the preview was intriguing. However this movie fell short of all of that. The movie has limited backgrounds as the majority takes place on the open sea. The struggle, or battle, between the boy and the tiger was unmoving and the ending was nothing short of unsatisfactory. Overall, it was a flop for us.\nNot for us\nI Am Number Four\nScience Fiction, Suspense, Intense, Ominous\n['Aliens and their Guardians are hiding on Earth from intergalactic bounty hunters. They can only be killed in numerical order, and Number Four is next on the list. This is his story.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['D.J. Caruso'], 'Producers': ['Michael Bay'], 'Starring': ['Alex Pettyfer', 'Timothy Olyphant', 'Dianna Agron']}\nThis was a wonderful movie that my husband and I discovered on a whim one night when we didn't have anything else to watch. The plot and characters drew us in from the start. Very intriguing! It led me to the book series which I completed in a matter of weeks. I was very excited to see the other books made into movies but was heartbroken when some internet searching revealed that someone somewhere had deemed the first attempt (I am Number Four) a failure and that no more of the books would ever see the silver screen. I do not agree that this movie was a flop or failure and truly hope to one day see the entire series made into movies.\nSuperb!",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference:** The user continues to enjoy classic animated holiday films and family-friendly features but has expanded their interests to include fantasy narratives with adventure and romance elements. Their recent interactions reflect an appreciation for science fiction, indicating a willingness to explore more intense and suspenseful genres while remaining cautious about content quality.\n\n- **Content Style:** They favor narratives that blend humor, action, and emotional depth, yet their critical lens regarding storytelling effectiveness is sharpening. They now prioritize engagement from characters and plots, choosing narratives with complex structures that resonate with their expectations.\n\n- **Viewing Context:** Films are primarily a form of escapism for the user, although recent choices have shown them grappling with unmet expectations and mixed experiences, particularly in terms of character development and plot coherence.\n\n- **Review Tone:** The user maintains enthusiasm in their reviews but increasingly incorporates critical insights, balancing personal anecdotes with thoughtful analyses. They exhibit a passion for narratives that ignite curiosity and wonder.\n\n- **Collection Expansion:** They are drawn to narratives blending animated elements with mature themes and live-action formats but remain discerning about their overall quality.\n\n- **Ratings:** While traditionally giving high ratings, the user now demonstrates a nuanced approach to evaluations, offering lower scores for films that disappoint, reflecting their demanding standards for quality storytelling in their viewing choices.",
  "metrics": {
    "rouge1_f": 0.0408,
    "rouge2_f": 0.004267804747932782,
    "rougeL_f": 0.0224,
    "meteor": 0.011059390275227492,
    "bleu1": 5.407477146998611e-16,
    "bleu2": 1.779571474052462e-16,
    "bleu3": 4.9878742106306683e-17,
    "bleu4": 1.4863107467965463e-17,
    "bertscore_precision": 0.3395261764526367,
    "bertscore_recall": 0.523252010345459,
    "bertscore_f1": 0.4118271768093109
  }
}