{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Nightbreed\nReview Date: 2015/05/05\nStore: Craig Sheffer  (Actor),     Anne Bobby  (Actor),     Clive Barker  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Boone (Craig Sheffer) may be a troubled young man, but his troubles are just beginning. Set up as the fall guy in a string of slasher murders, he decides he'll hide by crossing the threshold that separates us from them and sneak into the forbidden subterranean realm of Midian. Boone will live among the monsters. Hellraiser creator Clive Barker writes (adapting his novel Cabal) and directs this vivid leap into horror that asks: in the battle of man vs. monster, who's really the monster? The answer supplies flesh-crawling suspense, sudden fear, a colorful Danny Elfman score and a creepy array of shape-shifting beings. They are the Nightbreed, denizens of a world beyond death, beyond the imagination, perhaps beyond anything you've seen.\", \"This product is manufactured on demand using DVD-R recordable media. Amazon.com's standard return policy will apply.\", 'This product is expected to play back in DVD Video \"play only\" devices, and may not play in other DVD devices, including recorders and PC drives.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Horror', 'Format': 'NTSC', 'Contributor': 'Craig Sheffer, Anne Bobby, David Cronenberg, Clive Barker, Charles Haid', 'Runtime': '1 hour and 41 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Clive Barker', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 10, 2011', 'Actors': 'Craig Sheffer, Anne Bobby, David Cronenberg, Charles Haid', 'Studio': 'Warner Archive', 'Number of discs': '1'}\nReview Text: Old goodie! Definitely an eighties movie but put it this way..saw this over twenty years ago and it stuck with me as a great movie.\nReview Title: saw this over twenty years ago and it stuck with me as a great movie.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Greatest American Hero - The Complete Series (Free Cape and Notebook Included) [DVD]\nWilliam Katt  (Actor),     Connie Sellecca  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Believe it or not, he\\x92s walking on air! William Katt stars as mild-mannered high school teacher Ralph Hinkley, whose close encounter with aliens leaves him with a red super-power suit that only he can control. But when Ralph promptly loses the instruction manual, the safety of mankind is left in his fumbling hands. Now with the help of his attorney girlfriend Pam Davidson (Connie Selleca) and FBI agent Bill Maxwell (Robert Culp), the world\\x92s most unlikely flying crime fighter is ready for action. Who could it be? Believe it or not, he\\x92s THE GREATEST AMERICAN HERO! Michael Pare and Faye Grant co-star in this awesome \\x9180s hit created by Stephen J. Cannell that featured such guest stars as Joe Mantegna, Markie Post, Bob Saget, Rick Dees, June Lockhart, David Paymer, Barbara Hale, André The Giant, Dixie Carter, Don Drysdale and more. This deluxe set also includes interviews, with cast and crew, and the unaired spinoff series pilot \"The Greatest American Heroine\".']\n{'Format': \"Box set, Color, DVD, Full Screen, Collector's Edition, NTSC\", 'Contributor': 'William Bogert, Jeff Ray, Jesse D. Goins, Glenn R. Wilder, Don Cervantes, Robert Culp, Edward Bell, William Katt, Connie Sellecca, Michael Par, Stephen J. Cannell, Faye Grant, Robby Weaver, Brandon WilliamsWilliam Bogert, Jeff Ray, Jesse D. Goins, Glenn R. Wilder, Don Cervantes, Robert Culp, Edward Bell, William Katt, Connie Sellecca, Michael Par, Stephen J. Cannell, Faye Grant, Robby Weaver, Brandon Williams  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '13', 'Runtime': '35 hours and 22 minutes', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5 x 4.75 inches; 3.4 Pounds', 'Media Format': \"Box set, Color, DVD, Full Screen, Collector's Edition, NTSC\", 'Run time': '35 hours and 22 minutes', 'Release date': 'October 3, 2006', 'Actors': 'William Katt, Connie Sellecca, Robert Culp, Don Cervantes, Faye Grant', 'Studio': 'Starz / Anchor Bay', 'Writers': 'Jeff Ray, Stephen J. Cannell', 'Number of discs': '13'}\ni bought this for my brother for christmas, since we have such fond memories of it as kids. christmas day he calls and says that he and his girlfriend are flying around their apartment with the cape on. they love the instruction manual and aparently there is some episode of a attempted greatest american heroine...but didnt make it. he is normally someone who doesnt open collector things so i was shocked when i found he had. he said he couldnt help himself. anyway, excellent product.\ninstant hero\nAmerican Dreamer\nChristopher Daniel Barnes  (Actor),     Tom Conti  (Actor),     Rick Rosenthal  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n[\"JoBeth Williams, Tom Conti. A conservative housewife wins a writing contest and takes a trip to Paris, where she starts to believe she's the daring heroine of a romantic novel. 1984/color/105 min/PG.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Giancarlo Giannini, Christopher Daniel Barnes, Tom Conti, Rick Rosenthal, JoBeth Williams', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.05 Ounces', 'Item model number': '2238190', 'Director': 'Rick Rosenthal', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 3, 2005', 'Actors': 'Christopher Daniel Barnes, Tom Conti, Giancarlo Giannini, JoBeth Williams', 'Dubbed': 'French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthis is an awesome movie. if anyone loves comedies with light romance this is the movie for you. i dont like sticky sappy junk, but i do like a movie in which to people wind up together because of strange circumstances (gives me hope that i dont have to go out looking). anyway, you will laugh alot and there are no dull points.\ni love this movie!!\nOne Foot in the Grave - Season 1\nRichard Wilson  (Actor),     Annette Crosbie  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'One Foot in the Grave: Season One (DVD)', \"The BAFTA-nominated series about the growing pains of growing old is finally on DVD! Forced into early retirement, Victor Meldrew optimistically tries to adjust to years of leisure with his wife Margaret. If only events -- coincidences, misunderstandings, bureaucratic inefficiencies and sheer bad luck -- didn't conspire against him.\", ']]>', 'Amazon.com', 'Think of', 'One Foot in the Grave', 'as a British version of', 'Curb Your Enthusiasm', \": Cranky, misanthropic Victor Mildrew (the wonderfully bilious Richard Wilson) perceives himself as the only sane man in a world out to drive him mad--a world in which yoga instructors abruptly keel over, a dead cat appears in his freezer, a man in a bee costume uses his loo, and an escaped snake crawls into his luggage. Of course, Victor can dish it out too; he gives a political candidate a severe tongue-lashing and has a vacuum cleaner duel with an old man who's even more cantankerous than Victor. Only his long-suffering wife Margaret (sweet-tempered Annette Crosbie,\", 'Calendar Girls', ',', 'An Unsuitable Job for a Woman', ') provides Victor with any serenity--even as he destroys hers! Wilson had a long career before', 'One Foot in the Grave', '(including the series', 'Tutti Frutti', \", costarring with Emma Thompson and Robbie Coltrane), but this show became a phenomenon, giving a voice of outrage to the disenfranchised (young and old alike) in Margaret Thatcher's political era. But politics were always secondary to humor, and anyone with a taste for scathing invective and madcap plots will bask in Wilson's indignity. Written by David Remnick, creator of\", 'Jonathan Creek', '.', '--Bret Fetzer']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Annette Crosbie, Richard Wilson, David Renwick', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '2 hours and 51 minutes', 'Release date': 'March 27, 2007', 'Actors': 'Richard Wilson, Annette Crosbie', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Writers': 'David Renwick', 'Number of discs': '1'}\ni used to watch this series a long time ago when wxxi carried it and it is just as funny as i remembered. now understand it isnt blatent in your face funny, its dry and kind of a sad funny, which all in all doesnt sound funny but it is. if you have never seen this show i would start with later in the series and then go back. i love it.\ngreat british stuff\nMisfits: Season 2 (DVD+UltraViolet)\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Misfits: Season 2 (DVD+UltraViolet)', \"The Misfits are back on DVD 1/29 for another season of Sex, Drugs, and Superpowers! Fuelled with its usual irreverent humor, the second season of Misfits has an array of new characters crashing into the Misfits' world, and is even bigger, bolder and brasher than the last. The second series kicks off where the first ended, with Alisha, Simon, Nathan, Kelly and Curtis still on community service and still trying to adapt to their new lives. But what's new is the mysterious, masked figure watching over them from afar... someone who looks remarkably like a real-life superhero, and who seems to know everything about them. Is he protecting them? Or is he a threat? As the gang tries to piece together the clues to discover the true identity of their new stalker, it soon becomes apparent that the masked man harbors a secret that could change their world forever...\", ']]>']\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '4 hours and 36 minutes', 'Digital Copy Expiration Date': 'January 29, 2015', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.67 Ounces', 'Item model number': 'BBCW1000279724DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '4 hours and 36 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nExcellent! I wish though that the descriptions of DVD s would include which region..luckily this is for north America ... Fantastic second season...at first I thought I was too old to get into a series starring would be teens...but apparently I'm not...super fun and interesting show...and if you're especially fond of British shows then you'll love this!\nthis misfit loves misfits!!\nI Sell the Dead\nDominic Monaghan  (Actor),     Ron Perlman  (Actor),     Glenn McQuaid  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"It was a time of ghouls, ghosts and most ghastly of all, the fine art of grave-robbing. Dominic Monaghan of Lord of the Rings and Flash Forward stars as 19th century corpse snatcher Arthur Blake, who pilfered the cemeteries and coffins of England until his capture by police. But just before Blake is to meet the hangman's noose, he will confess to a peculiar priest (Ron Perlman of Hellboy and Sons of Anarchy) his gruesome tale of vampires, zombies and cadaver-dealing that takes him from the savagery of the criminal underworld to the terrors of the undead. Producer Larry Fessenden (Wendigo, the Last Winter) and Angus Scrimm (Phantasm) co-star in this deliriously grisly and hilarious homage to foggy graveyards, bloody mayhem and the golden age of gothic horror.\"]\n{'Genre': 'Horror/Things That Go Bump/Monsters', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Dominic Monaghan, Ron Perlman, Larry Fessenden, Glenn McQuaid', 'Language': 'Unqualified', 'Runtime': '1 hour and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '030306951799', 'Director': 'Glenn McQuaid', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'March 30, 2010', 'Actors': 'Dominic Monaghan, Ron Perlman, Larry Fessenden', 'Studio': 'IFC Independent Film', 'Number of discs': '1'}\nSuper..... crazy....interesting movie...saw it on Netflix then had to buy it! Yes it's that good!\ndraws you in!\nNightbreed\nCraig Sheffer  (Actor),     Anne Bobby  (Actor),     Clive Barker  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Boone (Craig Sheffer) may be a troubled young man, but his troubles are just beginning. Set up as the fall guy in a string of slasher murders, he decides he'll hide by crossing the threshold that separates us from them and sneak into the forbidden subterranean realm of Midian. Boone will live among the monsters. Hellraiser creator Clive Barker writes (adapting his novel Cabal) and directs this vivid leap into horror that asks: in the battle of man vs. monster, who's really the monster? The answer supplies flesh-crawling suspense, sudden fear, a colorful Danny Elfman score and a creepy array of shape-shifting beings. They are the Nightbreed, denizens of a world beyond death, beyond the imagination, perhaps beyond anything you've seen.\", \"This product is manufactured on demand using DVD-R recordable media. Amazon.com's standard return policy will apply.\", 'This product is expected to play back in DVD Video \"play only\" devices, and may not play in other DVD devices, including recorders and PC drives.']\n{'Genre': 'Horror', 'Format': 'NTSC', 'Contributor': 'Craig Sheffer, Anne Bobby, David Cronenberg, Clive Barker, Charles Haid', 'Runtime': '1 hour and 41 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Clive Barker', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 10, 2011', 'Actors': 'Craig Sheffer, Anne Bobby, David Cronenberg, Charles Haid', 'Studio': 'Warner Archive', 'Number of discs': '1'}\nOld goodie! Definitely an eighties movie but put it this way..saw this over twenty years ago and it stuck with me as a great movie.\nsaw this over twenty years ago and it stuck with me as a great movie.",
  "profile": "The user maintains a robust affinity for light-hearted, nostalgic content, particularly in comedy and unconventional storytelling. Their recent engagement with a classic film showcases a continued openness to exploring narratives that intertwine humor with darker themes, further emphasizing their appreciation for distinctive characters in unusual circumstances. This interaction reflects their desire for entertainment that is both memorable and emotionally resonant.\n\nThe user's detailed review style highlights their dedication to high-quality content, indicating a preference for well-crafted narratives that enrich the viewing experience. Their enthusiasm extends to diverse storytelling, including works intended for younger audiences, while thoughtfully reflecting on their own life experiences. This balance illustrates their pursuit of humor that fosters connection through shared experiences and laughter, across various genres.\n\nThe latest interaction aligns with their established love for nostalgic and inventive storytelling. Their engagement with a horror film that has left a lasting impression showcases their ability to enjoy playful yet suspenseful plots. This ongoing exploration reflects a well-rounded enthusiasm for inventive humor and creative narratives, reinforcing their profile as someone who delights in the joy of entertainment that surprises and uplifts. Overall, the user exhibits a joyful exploration of comedy and storytelling, blending nostalgia with a fondness for emotional depth and connection.",
  "metrics": {
    "rouge1_f": 0.08052516411378555,
    "rouge2_f": 0.004380201489268506,
    "rougeL_f": 0.048140043763676144,
    "meteor": 0.023817625042531473,
    "bleu1": 2.695527254362978e-06,
    "bleu2": 7.881194469391308e-07,
    "bleu3": 1.2157917876960544e-07,
    "bleu4": 4.780581852136639e-08,
    "bertscore_precision": 0.31134191155433655,
    "bertscore_recall": 0.4860907196998596,
    "bertscore_f1": 0.3795691430568695
  }
}