{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: American Dreamer\nReview Date: 2008/01/01\nStore: Christopher Daniel Barnes  (Actor),     Tom Conti  (Actor),     Rick Rosenthal  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: [\"JoBeth Williams, Tom Conti. A conservative housewife wins a writing contest and takes a trip to Paris, where she starts to believe she's the daring heroine of a romantic novel. 1984/color/105 min/PG.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Giancarlo Giannini, Christopher Daniel Barnes, Tom Conti, Rick Rosenthal, JoBeth Williams', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.05 Ounces', 'Item model number': '2238190', 'Director': 'Rick Rosenthal', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 3, 2005', 'Actors': 'Christopher Daniel Barnes, Tom Conti, Giancarlo Giannini, JoBeth Williams', 'Dubbed': 'French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: this is an awesome movie. if anyone loves comedies with light romance this is the movie for you. i dont like sticky sappy junk, but i do like a movie in which to people wind up together because of strange circumstances (gives me hope that i dont have to go out looking). anyway, you will laugh alot and there are no dull points.\nReview Title: i love this movie!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Greatest American Hero - The Complete Series (Free Cape and Notebook Included) [DVD]\nWilliam Katt  (Actor),     Connie Sellecca  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Believe it or not, he\\x92s walking on air! William Katt stars as mild-mannered high school teacher Ralph Hinkley, whose close encounter with aliens leaves him with a red super-power suit that only he can control. But when Ralph promptly loses the instruction manual, the safety of mankind is left in his fumbling hands. Now with the help of his attorney girlfriend Pam Davidson (Connie Selleca) and FBI agent Bill Maxwell (Robert Culp), the world\\x92s most unlikely flying crime fighter is ready for action. Who could it be? Believe it or not, he\\x92s THE GREATEST AMERICAN HERO! Michael Pare and Faye Grant co-star in this awesome \\x9180s hit created by Stephen J. Cannell that featured such guest stars as Joe Mantegna, Markie Post, Bob Saget, Rick Dees, June Lockhart, David Paymer, Barbara Hale, André The Giant, Dixie Carter, Don Drysdale and more. This deluxe set also includes interviews, with cast and crew, and the unaired spinoff series pilot \"The Greatest American Heroine\".']\n{'Format': \"Box set, Color, DVD, Full Screen, Collector's Edition, NTSC\", 'Contributor': 'William Bogert, Jeff Ray, Jesse D. Goins, Glenn R. Wilder, Don Cervantes, Robert Culp, Edward Bell, William Katt, Connie Sellecca, Michael Par, Stephen J. Cannell, Faye Grant, Robby Weaver, Brandon WilliamsWilliam Bogert, Jeff Ray, Jesse D. Goins, Glenn R. Wilder, Don Cervantes, Robert Culp, Edward Bell, William Katt, Connie Sellecca, Michael Par, Stephen J. Cannell, Faye Grant, Robby Weaver, Brandon Williams  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '13', 'Runtime': '35 hours and 22 minutes', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5 x 4.75 inches; 3.4 Pounds', 'Media Format': \"Box set, Color, DVD, Full Screen, Collector's Edition, NTSC\", 'Run time': '35 hours and 22 minutes', 'Release date': 'October 3, 2006', 'Actors': 'William Katt, Connie Sellecca, Robert Culp, Don Cervantes, Faye Grant', 'Studio': 'Starz / Anchor Bay', 'Writers': 'Jeff Ray, Stephen J. Cannell', 'Number of discs': '13'}\ni bought this for my brother for christmas, since we have such fond memories of it as kids. christmas day he calls and says that he and his girlfriend are flying around their apartment with the cape on. they love the instruction manual and aparently there is some episode of a attempted greatest american heroine...but didnt make it. he is normally someone who doesnt open collector things so i was shocked when i found he had. he said he couldnt help himself. anyway, excellent product.\ninstant hero\nAmerican Dreamer\nChristopher Daniel Barnes  (Actor),     Tom Conti  (Actor),     Rick Rosenthal  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n[\"JoBeth Williams, Tom Conti. A conservative housewife wins a writing contest and takes a trip to Paris, where she starts to believe she's the daring heroine of a romantic novel. 1984/color/105 min/PG.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Giancarlo Giannini, Christopher Daniel Barnes, Tom Conti, Rick Rosenthal, JoBeth Williams', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.05 Ounces', 'Item model number': '2238190', 'Director': 'Rick Rosenthal', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 3, 2005', 'Actors': 'Christopher Daniel Barnes, Tom Conti, Giancarlo Giannini, JoBeth Williams', 'Dubbed': 'French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthis is an awesome movie. if anyone loves comedies with light romance this is the movie for you. i dont like sticky sappy junk, but i do like a movie in which to people wind up together because of strange circumstances (gives me hope that i dont have to go out looking). anyway, you will laugh alot and there are no dull points.\ni love this movie!!",
  "profile": "The user continues to demonstrate a strong preference for nostalgic and comedic television and film, emphasizing light-hearted content that elicits fond memories. Their recent acquisition reflects an appreciation for comedies with elements of romance, suggesting a fondness for feel-good narratives that blend humor with heartfelt moments. The user values entertainment that fosters connections, as they enjoy sharing amusing experiences with family members. \n\nThey also show a preference for high-quality formats, similar to previous collector's editions, indicating a pattern of seeking out well-produced content that enhances their viewing experience. The enthusiasm expressed in their review highlights a proactive engagement with media, suggesting they appreciate not only the entertainment value but also the emotional uplift provided by comedic storytelling. \n\nMoreover, the user’s inclination toward narratives involving \"strange circumstances\" points to a broader interest in unconventional storylines that deliver humor while allowing for a hopeful outlook, reinforcing their affinity for light-hearted entertainment over overly sentimental plots. Overall, the user’s profile reflects a deep-rooted love for nostalgic comedies that resonate with both personal memories and family bonding experiences, alongside an appreciation for quality media formats.",
  "metrics": {
    "rouge1_f": 0.15919282511210764,
    "rouge2_f": 0.01348314606741573,
    "rougeL_f": 0.06726457399103139,
    "meteor": 0.054075433562968206,
    "bleu1": 0.007794769451204442,
    "bleu2": 0.002017527632896518,
    "bleu3": 0.000349579754094948,
    "bleu4": 0.00014569539662256616,
    "bertscore_precision": 0.31191039085388184,
    "bertscore_recall": 0.4366239905357361,
    "bertscore_f1": 0.36387789249420166
  }
}