{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: What We Do in the Shadows\nReview Date: 2015/11/02\nStore: Jemaine Clement  (Actor, Director),     Taika Waititi  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['WHAT WE DO IN THE SHADOWS chronicles the adventures of four vampire roommates trying to get by in a modern world that\\'s not always hospitable to the undead. Clement and Waititi, creators of the HBO hit series \"Flight of the Conchords,\" co-wrote, co-directed, and co-star in this hilarious send-up in which an endearingly unhip quartet of friends reveal to us or, rather, to the documentary crew that\\'s filming them, the details of their daily-make that nightly-routine. Ranging in age from 183 to 8,000, and in appearance from adorably youthful to Nosferatu-crusty, they squabble over household chores, struggle to keep up with the latest trends in technology and fashion, antagonize the local werewolves, cruise clubs for lovely ladies, and deal with the rigors of living on a very, very strict diet.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '59172034000', 'Director': 'Taika Waititi, Jemaine Clement', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'July 21, 2015', 'Actors': 'Jemaine Clement, Taika Waititi, Jonny Brugh, Cori Gonzalez-Macuer, Stuart Rutherford', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: Seriously well written, acted and directed film!! Would recommend to anyone who can see passed only &#34;action&#34; movies. Would highly insist to anyone who likes humor, indies and intelligent humor. Superb movie.!!!!!\nReview Title: subtle and hysterical humor\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Greatest American Hero - The Complete Series (Free Cape and Notebook Included) [DVD]\nWilliam Katt  (Actor),     Connie Sellecca  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Believe it or not, he\\x92s walking on air! William Katt stars as mild-mannered high school teacher Ralph Hinkley, whose close encounter with aliens leaves him with a red super-power suit that only he can control. But when Ralph promptly loses the instruction manual, the safety of mankind is left in his fumbling hands. Now with the help of his attorney girlfriend Pam Davidson (Connie Selleca) and FBI agent Bill Maxwell (Robert Culp), the world\\x92s most unlikely flying crime fighter is ready for action. Who could it be? Believe it or not, he\\x92s THE GREATEST AMERICAN HERO! Michael Pare and Faye Grant co-star in this awesome \\x9180s hit created by Stephen J. Cannell that featured such guest stars as Joe Mantegna, Markie Post, Bob Saget, Rick Dees, June Lockhart, David Paymer, Barbara Hale, André The Giant, Dixie Carter, Don Drysdale and more. This deluxe set also includes interviews, with cast and crew, and the unaired spinoff series pilot \"The Greatest American Heroine\".']\n{'Format': \"Box set, Color, DVD, Full Screen, Collector's Edition, NTSC\", 'Contributor': 'William Bogert, Jeff Ray, Jesse D. Goins, Glenn R. Wilder, Don Cervantes, Robert Culp, Edward Bell, William Katt, Connie Sellecca, Michael Par, Stephen J. Cannell, Faye Grant, Robby Weaver, Brandon WilliamsWilliam Bogert, Jeff Ray, Jesse D. Goins, Glenn R. Wilder, Don Cervantes, Robert Culp, Edward Bell, William Katt, Connie Sellecca, Michael Par, Stephen J. Cannell, Faye Grant, Robby Weaver, Brandon Williams  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '13', 'Runtime': '35 hours and 22 minutes', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5 x 4.75 inches; 3.4 Pounds', 'Media Format': \"Box set, Color, DVD, Full Screen, Collector's Edition, NTSC\", 'Run time': '35 hours and 22 minutes', 'Release date': 'October 3, 2006', 'Actors': 'William Katt, Connie Sellecca, Robert Culp, Don Cervantes, Faye Grant', 'Studio': 'Starz / Anchor Bay', 'Writers': 'Jeff Ray, Stephen J. Cannell', 'Number of discs': '13'}\ni bought this for my brother for christmas, since we have such fond memories of it as kids. christmas day he calls and says that he and his girlfriend are flying around their apartment with the cape on. they love the instruction manual and aparently there is some episode of a attempted greatest american heroine...but didnt make it. he is normally someone who doesnt open collector things so i was shocked when i found he had. he said he couldnt help himself. anyway, excellent product.\ninstant hero\nAmerican Dreamer\nChristopher Daniel Barnes  (Actor),     Tom Conti  (Actor),     Rick Rosenthal  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n[\"JoBeth Williams, Tom Conti. A conservative housewife wins a writing contest and takes a trip to Paris, where she starts to believe she's the daring heroine of a romantic novel. 1984/color/105 min/PG.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Giancarlo Giannini, Christopher Daniel Barnes, Tom Conti, Rick Rosenthal, JoBeth Williams', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.05 Ounces', 'Item model number': '2238190', 'Director': 'Rick Rosenthal', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 3, 2005', 'Actors': 'Christopher Daniel Barnes, Tom Conti, Giancarlo Giannini, JoBeth Williams', 'Dubbed': 'French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthis is an awesome movie. if anyone loves comedies with light romance this is the movie for you. i dont like sticky sappy junk, but i do like a movie in which to people wind up together because of strange circumstances (gives me hope that i dont have to go out looking). anyway, you will laugh alot and there are no dull points.\ni love this movie!!\nOne Foot in the Grave - Season 1\nRichard Wilson  (Actor),     Annette Crosbie  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'One Foot in the Grave: Season One (DVD)', \"The BAFTA-nominated series about the growing pains of growing old is finally on DVD! Forced into early retirement, Victor Meldrew optimistically tries to adjust to years of leisure with his wife Margaret. If only events -- coincidences, misunderstandings, bureaucratic inefficiencies and sheer bad luck -- didn't conspire against him.\", ']]>', 'Amazon.com', 'Think of', 'One Foot in the Grave', 'as a British version of', 'Curb Your Enthusiasm', \": Cranky, misanthropic Victor Mildrew (the wonderfully bilious Richard Wilson) perceives himself as the only sane man in a world out to drive him mad--a world in which yoga instructors abruptly keel over, a dead cat appears in his freezer, a man in a bee costume uses his loo, and an escaped snake crawls into his luggage. Of course, Victor can dish it out too; he gives a political candidate a severe tongue-lashing and has a vacuum cleaner duel with an old man who's even more cantankerous than Victor. Only his long-suffering wife Margaret (sweet-tempered Annette Crosbie,\", 'Calendar Girls', ',', 'An Unsuitable Job for a Woman', ') provides Victor with any serenity--even as he destroys hers! Wilson had a long career before', 'One Foot in the Grave', '(including the series', 'Tutti Frutti', \", costarring with Emma Thompson and Robbie Coltrane), but this show became a phenomenon, giving a voice of outrage to the disenfranchised (young and old alike) in Margaret Thatcher's political era. But politics were always secondary to humor, and anyone with a taste for scathing invective and madcap plots will bask in Wilson's indignity. Written by David Remnick, creator of\", 'Jonathan Creek', '.', '--Bret Fetzer']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Annette Crosbie, Richard Wilson, David Renwick', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '2 hours and 51 minutes', 'Release date': 'March 27, 2007', 'Actors': 'Richard Wilson, Annette Crosbie', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Writers': 'David Renwick', 'Number of discs': '1'}\ni used to watch this series a long time ago when wxxi carried it and it is just as funny as i remembered. now understand it isnt blatent in your face funny, its dry and kind of a sad funny, which all in all doesnt sound funny but it is. if you have never seen this show i would start with later in the series and then go back. i love it.\ngreat british stuff\nMisfits: Season 2 (DVD+UltraViolet)\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Misfits: Season 2 (DVD+UltraViolet)', \"The Misfits are back on DVD 1/29 for another season of Sex, Drugs, and Superpowers! Fuelled with its usual irreverent humor, the second season of Misfits has an array of new characters crashing into the Misfits' world, and is even bigger, bolder and brasher than the last. The second series kicks off where the first ended, with Alisha, Simon, Nathan, Kelly and Curtis still on community service and still trying to adapt to their new lives. But what's new is the mysterious, masked figure watching over them from afar... someone who looks remarkably like a real-life superhero, and who seems to know everything about them. Is he protecting them? Or is he a threat? As the gang tries to piece together the clues to discover the true identity of their new stalker, it soon becomes apparent that the masked man harbors a secret that could change their world forever...\", ']]>']\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '4 hours and 36 minutes', 'Digital Copy Expiration Date': 'January 29, 2015', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.67 Ounces', 'Item model number': 'BBCW1000279724DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '4 hours and 36 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nExcellent! I wish though that the descriptions of DVD s would include which region..luckily this is for north America ... Fantastic second season...at first I thought I was too old to get into a series starring would be teens...but apparently I'm not...super fun and interesting show...and if you're especially fond of British shows then you'll love this!\nthis misfit loves misfits!!\nI Sell the Dead\nDominic Monaghan  (Actor),     Ron Perlman  (Actor),     Glenn McQuaid  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"It was a time of ghouls, ghosts and most ghastly of all, the fine art of grave-robbing. Dominic Monaghan of Lord of the Rings and Flash Forward stars as 19th century corpse snatcher Arthur Blake, who pilfered the cemeteries and coffins of England until his capture by police. But just before Blake is to meet the hangman's noose, he will confess to a peculiar priest (Ron Perlman of Hellboy and Sons of Anarchy) his gruesome tale of vampires, zombies and cadaver-dealing that takes him from the savagery of the criminal underworld to the terrors of the undead. Producer Larry Fessenden (Wendigo, the Last Winter) and Angus Scrimm (Phantasm) co-star in this deliriously grisly and hilarious homage to foggy graveyards, bloody mayhem and the golden age of gothic horror.\"]\n{'Genre': 'Horror/Things That Go Bump/Monsters', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Dominic Monaghan, Ron Perlman, Larry Fessenden, Glenn McQuaid', 'Language': 'Unqualified', 'Runtime': '1 hour and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '030306951799', 'Director': 'Glenn McQuaid', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'March 30, 2010', 'Actors': 'Dominic Monaghan, Ron Perlman, Larry Fessenden', 'Studio': 'IFC Independent Film', 'Number of discs': '1'}\nSuper..... crazy....interesting movie...saw it on Netflix then had to buy it! Yes it's that good!\ndraws you in!\nNightbreed\nCraig Sheffer  (Actor),     Anne Bobby  (Actor),     Clive Barker  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Boone (Craig Sheffer) may be a troubled young man, but his troubles are just beginning. Set up as the fall guy in a string of slasher murders, he decides he'll hide by crossing the threshold that separates us from them and sneak into the forbidden subterranean realm of Midian. Boone will live among the monsters. Hellraiser creator Clive Barker writes (adapting his novel Cabal) and directs this vivid leap into horror that asks: in the battle of man vs. monster, who's really the monster? The answer supplies flesh-crawling suspense, sudden fear, a colorful Danny Elfman score and a creepy array of shape-shifting beings. They are the Nightbreed, denizens of a world beyond death, beyond the imagination, perhaps beyond anything you've seen.\", \"This product is manufactured on demand using DVD-R recordable media. Amazon.com's standard return policy will apply.\", 'This product is expected to play back in DVD Video \"play only\" devices, and may not play in other DVD devices, including recorders and PC drives.']\n{'Genre': 'Horror', 'Format': 'NTSC', 'Contributor': 'Craig Sheffer, Anne Bobby, David Cronenberg, Clive Barker, Charles Haid', 'Runtime': '1 hour and 41 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Clive Barker', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 10, 2011', 'Actors': 'Craig Sheffer, Anne Bobby, David Cronenberg, Charles Haid', 'Studio': 'Warner Archive', 'Number of discs': '1'}\nOld goodie! Definitely an eighties movie but put it this way..saw this over twenty years ago and it stuck with me as a great movie.\nsaw this over twenty years ago and it stuck with me as a great movie.\nDoghouse\nDanny Dyer  (Actor),     Stephen Graham  (Actor),     Jake West  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['The latest and most outrageous in a wave of UK comic horror films like Shaun of the Dead, Doghouse is a raucous, balls-out funny spin on male insecurity over their own masculinity and vengeful women. A group of guys (including Danny Dyer of the Football Factory and Severance and Stephen Graham of Snatch and Public Enemies) head off for a boys weekend to buck up a friend still depressed over a painful divorce. Unfortunately, they end up in an isolated town infected with a bio-weapon that has turned all the women into the man-hating monsters the lads always suspected women were at heart. The guys spend less time bonding and a lot more time fleeing from hairdressers, nurses, schoolgirls and other iconic female figures all looking to snip away with scissors and swords and literally do what the guys have been fearing for years. Deftly satirical, witty and just bloody good fun, Doghouse is the most original battle of the sexes in years.']\n{'Genre': 'Horror/Things That Go Bump/Monsters', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Jake West, Danny Dyer, Stephen Graham', 'Language': 'Unqualified', 'Runtime': '1 hour and 29 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.56 x 5.39 x 7.54 inches; 2.47 Ounces', 'Item model number': 'IDFC9545DVD', 'Director': 'Jake West', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'October 12, 2010', 'Actors': 'Danny Dyer, Stephen Graham', 'Subtitles': 'English, Spanish', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI first saw this on ifc then had to own it.  Funny crazy and stupid all in one but oh so enjoyable. I loved the end...I guess it's how you look at things that will allow you to decide if it was just right or not...\nbloody fun\nThor at the Bus Stop\nJoe Berry  (Actor),     Robert Shupe  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Comedy\n['Thor at the Bus Stop is a fantasy/comedy about the mythical Thor, the Norse god of lightning, making his final journey through a suburban neighborhood on the day he is going to die fighting to save the world. Thor starts a chain reaction of interweaving story lines packed with colorful characters, a \"Pulp Fiction\" vibe, and themes about goodness and the Power of Cool.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Chris McInroy, Joel Schoenbach, Lauryn Shelley, Carlos Mathis-Johnson, Robert Shupe, Mike Thompson, Trae Cullivan, G. Scott Thompson, Jerry Thompson, Joe Berry, Barrett Applegate, Jason Neistadt, Dana BomarChris McInroy, Joel Schoenbach, Lauryn Shelley, Carlos Mathis-Johnson, Robert Shupe, Mike Thompson, Trae Cullivan, G. Scott Thompson, Jerry Thompson, Joe Berry, Barrett Applegate, Jason Neistadt, Dana Bomar  See more', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '25120143', 'Director': 'Jerry Thompson, Mike Thompson', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 24, 2012', 'Actors': 'Joe Berry, Robert Shupe, Barrett Applegate, Chris McInroy, Jason Neistadt', 'Studio': 'VCI Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLol wtf......WTF!!! I spent most of the movie along what the heck am I watching and then the last ten minutes it all came together and even put a little happy tear in my eye ...I'm still shaking my head but with a smile on my face...\na little brilliant and a lot crazy\nWhat We Do in the Shadows\nJemaine Clement  (Actor, Director),     Taika Waititi  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['WHAT WE DO IN THE SHADOWS chronicles the adventures of four vampire roommates trying to get by in a modern world that\\'s not always hospitable to the undead. Clement and Waititi, creators of the HBO hit series \"Flight of the Conchords,\" co-wrote, co-directed, and co-star in this hilarious send-up in which an endearingly unhip quartet of friends reveal to us or, rather, to the documentary crew that\\'s filming them, the details of their daily-make that nightly-routine. Ranging in age from 183 to 8,000, and in appearance from adorably youthful to Nosferatu-crusty, they squabble over household chores, struggle to keep up with the latest trends in technology and fashion, antagonize the local werewolves, cruise clubs for lovely ladies, and deal with the rigors of living on a very, very strict diet.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '59172034000', 'Director': 'Taika Waititi, Jemaine Clement', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'July 21, 2015', 'Actors': 'Jemaine Clement, Taika Waititi, Jonny Brugh, Cori Gonzalez-Macuer, Stuart Rutherford', 'Studio': 'Paramount', 'Number of discs': '1'}\nSeriously well written, acted and directed film!! Would recommend to anyone who can see passed only &#34;action&#34; movies. Would highly insist to anyone who likes humor, indies and intelligent humor. Superb movie.!!!!!\nsubtle and hysterical humor",
  "profile": "The user maintains a strong enthusiasm for light-hearted, unconventional content that blends comedy with imaginative storytelling. Their recent viewing experience reflects a joyful curiosity and willingness to engage with unpredictable, eccentric narratives. This interaction aligns with their long-standing appreciation for unique storytelling, particularly those that evoke emotional responses ranging from laughter to nostalgia. The user’s thoughtful reviewing style indicates a commitment to quality, often drawing personal connections to the works they engage with.\n\nTheir latest engagement highlights a preference for films that combine bewilderment with warmth, illustrating an enjoyment of narratives that challenge expectations while delivering heartwarming moments. The user actively seeks out memorable, uplifting entertainment that balances humor with emotional depth. Their fondness for distinctive characters and surprising plot twists solidifies their identity as an explorer of narrative innovation within comedic genres that address profound themes in a lighthearted manner.\n\nOverall, the user exhibits an ongoing desire for inventive storytelling that fosters connection and shared laughter, showcasing a discerning taste for well-crafted humor and intelligent narratives, often favoring indie films that resonate deeply on multiple levels.",
  "metrics": {
    "rouge1_f": 0.05463786531130877,
    "rouge2_f": 0.0038143674507310874,
    "rougeL_f": 0.03176620076238882,
    "meteor": 0.01558462317180382,
    "bleu1": 7.109241507479303e-10,
    "bleu2": 2.2538966489497693e-10,
    "bleu3": 3.5728808988473225e-11,
    "bleu4": 1.4243670393736895e-11,
    "bertscore_precision": 0.3017709255218506,
    "bertscore_recall": 0.48966148495674133,
    "bertscore_f1": 0.3734130859375
  }
}