{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Oreola Wire Hair Extensions Real Remy Human Hair with Invisible Miracle Wire One Piece Extension Chocolate Brown Color #3 16 Inch 100 Gram\nReview Date: 2022/01/17\nStore: Oreola\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Oreola', 'Color': '#3', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '10.31 x 4.21 x 1.93 inches; 8.18 Ounces', 'UPC': '673311242850'}\nReview Text: Having fine hair … I’ve wanted to try a halo for a long time. I want it for special occasions. Clip in extensions do not stay in my hair and they just fill heavy and uncomfortable. My hair is medium length below my shoulders. I got the dark brown halo to add volume not length. It is so easy to wear and blend. It’s light weight. The hair is very nice, make sure you take care of it. Using it for awhile it hasn’t gotten damaged or tangled. I’m especially surprised by how easy halos are to wear.\nReview Title: Great for fine hair!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Red Carpet Manicure Starter Kits\n{'Color': 'RCM Essentials Starter Kit', 'Material': 'Acrylic', 'Brand': 'RC Red Carpet Manicure', 'Finish Type': 'Glossy', 'Item Form': 'Gel', 'Is Discontinued By Manufacturer': 'No', 'UPC': '817248203854', 'Manufacturer': 'RC Red Carpet Manicure/ Zupishi'}\nI know gel polish has been around for quite some time but I actually switched from dip powder to gel. I do my own nails and just find dip to be messy and time consuming. I figured at this point all gel systems were the same, so I’ve been using a cheap brand. I came across this kit and definitely notice the difference in Red Carpet. It’s much better quality. Your gel polish will last 21 days if you follow the directions. Five stars from me and it’s a great value!\nRed Carpet... the difference in quality is noticeable!\nAUGNORYE 13 Pcs Hair Cutting Scissors Kit, Professional Hair Barber Scissors Kit with Thinning Shears, Home Hair Shears for Women, Men, Kids\nAUGNORYE\n{'Brand': 'AUGNORYE', 'Included Components': 'Scissors', 'Unit Count': '1.00 Count', 'Blade Material': 'Stainless Steel'}\nI was looking for a decent set of scissors to trim my daughters hair. This set exceeded my expectations. The Sheers have a nice weight to them, comfortable in your hands. The cuts are precise. The kit come with great accessories. All are useful, only complaint is the brush is cheaply made.\nStrudy scissors!\n3 Pieces Messy Donut Chignons Hair Piece Scrunchies Synthetic Extensions Updo Hair Bun for Women Scrunchies Natural Black #1b\nSHINYSHOW\n{'UPC': '738630490242'}\nMy hair is a 3/4 medium to dark brown with some red undertones. I went with the 1b natural black because the 4 was described as light brown. Light brown is usually a 5. I suggest you go with the number instead of relying on the description. This is still a good product and will match my hair when I first color it... it is always a bit darker. Unfortunately, I was not blessed with thick luscious hair so my buns are super thin (see pictures). This scrunchie is made of synthetic hair and easy to use. I only need to use one but it came with three buns. This is an added bonus because over time synthetic hair will become frizzy and tangled. Also with synthetic, you can not color it or use heat on it.\nGreat to add umph! to your messy bun!\nDr. Denese SkinScience Essential Lipid Anti Aging Power Infusion Dry Oil - Skin Nutrients 97% Organic 100% Natural - Rejuvinating Blend with Amaranth & Resveratrol - Paraben-Free, Cruelty-Free - 2oz\nDr. Denese\n{'Brand': 'Dr. Denese', 'Item Form': 'Dr. Denese', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.57 x 3.15 x 3.07 inches; 5.61 Ounces', 'Item model number': '800166A', 'UPC': '811684022284', 'Manufacturer': 'Dr. Denese'}\nAt 30 something, I wanted to start taking better care of my skin. I was excited to try this Infusion Oil. Many referred to this as the game changer. But sadly this wasn't a product for me. I still have combination and acne prone skin. The oil never soaked into my skin. It also caused me to break out. I gave it to my mother-in-law, she has dry patches. She loved this stuff. It worked perfectly for her. Her face felt refreshed and moisturized. She also has sensitive skin and has not had any irritation from this Infusion Oil.\nNot for combination skin type.\nLANGE HAIR Extendé Conditioning Detangler Hair Spray - Paraben Free Leave-in Conditioner Spray, Detangles and Hydrates Hair, Moisture & Shine | 4OZ\n{'Item Form': 'Liquid', 'Material Feature': 'Paraben Free', 'Hair Type': 'Curly, Dry', 'Product Benefits': 'Helps protect color and reinforces strands, leaving them strong and vibrant', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.5 x 1.4 x 1.4 inches; 4 Ounces', 'UPC': '793150592708'}\nI've tried a couple L'ange products with the sea salt spray being my favorite. I love this fortifying detangler as well! My hair is fine which means its fragile. I'm trying to grow it out about four more inches. My ends tend to get thin from breakage. I'm hoping this product helps prevent this. So far I notice my hair is breaking less when I brush it. It's a great detangler with a clean scent. It adds shine to my hair and there is less frizz.\nAnother great L'ange product!\nNail Files 16 Pcs, Double Sided Emery Board Manicure Tools for Filing Natural Gel and Acrylic Nails for Home and Salon Use\nKeiby Citom\n{'Material': 'Acrylic', 'Brand': 'Keiby Citom', 'Grit Number': '100', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.8 x 5.08 x 0.59 inches; 5.29 Ounces', 'UPC': '742025065137', 'Manufacturer': 'YHIT'}\nI like to do my own nails. These emery boards are wonderful for removing glue and gel polish. The curved shape of the emery board is helpful when filing your nails and shaping nails. I love that these nail files are washable.\nGreat for removing nail glue.\ninvisibobble Sprunchie Spiral Hair Ring - True Black - Scrunchie Stylish Bracelet, Strong Elastic Grip Coil Accessories for Women - Gentle for Girls Teens and Thick Hair\ninvisibobble\n{'Item Form': 'Scrunchie', 'Brand': 'invisibobble', 'Hair Type': 'Straight', 'Item Weight': '2 Grams', 'Number of Pieces': '1', 'Package Dimensions': '2.83 x 2.8 x 0.87 inches; 0.07 Ounces', 'Item model number': 'IB-SP-HP10001'}\nI have long, medium thick hair. This scrunchie did not work for me. My bun constantly fell down. I can use the spiral rings without the cloth, with no problems.\nNot for me.\nChristmas Headbands for Women,Glitter headbands Sequence Red and Green,Holiday Costume Headwear Handmade Mouse Ears Hairband Hair Decorations for Girl Party Cosplay Favor Accessories\nYanJie\n{'Age Range (Description)': 'Child', 'Occasion': 'Christmas, Party, Birthday, Thanksgiving', 'Material': 'Cotton Blend', 'Number of Items': '1', 'Brand': 'YanJie', 'Package Dimensions': '10.12 x 7.6 x 1.22 inches; 1.13 Ounces', 'UPC': '751300682099'}\nThis headband is cute and adorable for any child; But not made very well. Poor quality. Started to come apart before even wearing the headband. The headband is comfortable and sit well in hair.\nPoor quality!\n3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nVedory\n['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\n{'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nThese are not the most comfortable to wear and it takes some getting used to. I do not hook them to my mask, I just let them rest on my face under my mask. They don’t help save my makeup but that is not what I use them for. I am a teacher and have a hybrid class (covid times). This means I am teaching in person and my remote students log on at certain times for lessons. So I wear this contraption for 30 minutes at a time. I teach pre k and my mask does not allow children to accurately hear me. I cannot take my mask of because I also have students in person. This bracket allows my young scholars to hear the important sounds during phonics and phonemic learning. It was difficult for my remote students to diffreintiate between sounds when segmenting words such as she, he, etc.\nMet my needs\nGreen Tea Stick Mask ,Purifying Green Tea Clay Mask,Cleansing Mask for Face Oil Control,Green Solid Mask,Deep Clean Pores for All Skin Types Men Women\nsefudun\n{'Brand': 'sefudun', 'Item Form': 'Clay, Stick', 'Product Benefits': 'Cleansing', 'Scent': 'Green Tea', 'Skin Type': 'All', 'Package Dimensions': '3.07 x 1.57 x 1.54 inches; 3.21 Ounces'}\nI seen so many ads for this green mask I had to try it. It did absolutely nothing! After using this mask my skin felt a little tightness. It was hard to remove the mask.\nNot worth it!\nOreola Wire Hair Extensions Real Remy Human Hair with Invisible Miracle Wire One Piece Extension Chocolate Brown Color #3 16 Inch 100 Gram\nOreola\n{'Brand': 'Oreola', 'Color': '#3', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '10.31 x 4.21 x 1.93 inches; 8.18 Ounces', 'UPC': '673311242850'}\nHaving fine hair … I’ve wanted to try a halo for a long time. I want it for special occasions. Clip in extensions do not stay in my hair and they just fill heavy and uncomfortable. My hair is medium length below my shoulders. I got the dark brown halo to add volume not length. It is so easy to wear and blend. It’s light weight. The hair is very nice, make sure you take care of it. Using it for awhile it hasn’t gotten damaged or tangled. I’m especially surprised by how easy halos are to wear.\nGreat for fine hair!",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Great for fine hair!",
    "text": "Having fine hair … I’ve wanted to try a halo for a long time. I want it for special occasions. Clip in extensions do not stay in my hair and they just fill heavy and uncomfortable. My hair is medium length below my shoulders. I got the dark brown halo to add volume not length. It is so easy to wear and blend. It’s light weight. The hair is very nice, make sure you take care of it. Using it for awhile it hasn’t gotten damaged or tangled. I’m especially surprised by how easy halos are to wear.",
    "images": [],
    "asin": "B0952KBKHZ",
    "parent_asin": "B0952KBKHZ",
    "user_id": "AFHB5H6XQKOFLV7JRZUBA6IHJC6A",
    "timestamp": "2022-01-17 02:32:29.908000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Oreola Wire Hair Extensions Real Remy Human Hair with Invisible Miracle Wire One Piece Extension Chocolate Brown Color #3 16 Inch 100 Gram",
    "average_rating": 4.0,
    "rating_number": 220,
    "features": [
      "Remy Human Hair--High quality original material makes our wire hair extensions no tangling, no shedding, no smelling.",
      "Fast and Easy to Use-- No tape, no glue, no sew, you can install it by yourself within a few minutes. Adjust the size by tightening or loosening the elastic wire.",
      "Invisible Wire Hair Extensions--If you don't need the clips, just take out them and just use the wire.",
      "Perfect Color Matching--There are various of colors for your selection, so you can choose the nearest color to match your own hair.",
      "Return or Exchange Service--We provide Quick Money-Back guarantee for every customer. If you are not satisfied with our products, please keep the hair in its original condition and feel free to contact us. Oreola will always provide you best service."
    ],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51-zXL2NqKS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-zXL2NqKS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61o8ZTEkkpS._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/418pDV9wrSS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/418pDV9wrSS.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61rBS+aisxS._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/513mpNBgN5S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/513mpNBgN5S.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/719SyPQ0liS._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41PugJAfvwS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41PugJAfvwS.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61mMvWd58BS._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51jcyW4WRNS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51jcyW4WRNS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61tH5s+cI0S._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41AhNDskj4S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41AhNDskj4S.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61Snr8hiRYS._SL1001_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Halo Hair Extensions",
        "url": "https://www.amazon.com/vdp/07efe5fcc983454881a5889f01501b39?ref=dp_vse_rvc_0",
        "user_id": "/shop/jefekristina"
      }
    ],
    "store": "Oreola",
    "categories": [],
    "details": {
      "Brand": "Oreola",
      "Color": "#3",
      "Material": "Human Hair",
      "Extension Length": "16 Inches",
      "Hair Type": "Straight",
      "Package Dimensions": "10.31 x 4.21 x 1.93 inches; 8.18 Ounces",
      "UPC": "673311242850"
    },
    "bought_together": null
  }
}