{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Diva Queen 100% Virgin Human Hair Unprocessed Brazilian Weave 13x4 Lace Frontal Closure Natural Body (NATURAL) (10\")\nReview Date: 2017/04/06\nStore: DIVA QUEEN\nAverage Rating: 5.0\nProduct Details: {'Brand': 'DIVA QUEEN', 'Color': 'natural', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Installation Type': 'weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.58 x 7.91 x 2.91 inches; 8.01 Ounces', 'UPC': '643665608831'}\nReview Text: I love it just got to bleach n pluck\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "3 Part Lace Closure 4x4 Body Wave Human Hair Closure Piece with Baby Hair Natural Black Color No Bleached Knots (10 inch)\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.49 x 5.24 x 0.39 inches; 1.59 Ounces', 'UPC': '605175459785'}\nGreat texture\nFive Stars\nRossy&Nancy Cheap Braided Synthetic Lace Front Wigs for Black Women Natural Black Color 24inch\nRossy&Nancy\n{'Color': 'Black', 'Material': 'Synthetic', 'Hair Type': 'Straight', 'Brand': 'Rossy&Nancy', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.6 x 7.1 x 2.6 inches; 2.53 Pounds'}\nNice wig easy to maintain long braids  all or even a can be glued on or sewd on the wig is full of braids I'm happy with this product looks real\nHappy\nFani Short Bob Wig For Women With Free Wig Cap Yaki Straight Synthetic Wigs Side Bangs Wig Natural Color Cospaly Wigs by fani\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.4 x 6.9 x 2.6 inches; 8 Ounces'}\nGreat synthetic wig looks and feel good best company to order from\nGreat hair\nDiva Queen 100% Virgin Human Hair Unprocessed Brazilian Weave 13x4 Lace Frontal Closure Natural Body (NATURAL) (10\")\nDIVA QUEEN\n{'Brand': 'DIVA QUEEN', 'Color': 'natural', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Installation Type': 'weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.58 x 7.91 x 2.91 inches; 8.01 Ounces', 'UPC': '643665608831'}\nI love it just got to bleach n pluck\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to prioritize high-quality human hair products, now showing a strong endorsement for a specific 100% virgin human hair item, reaffirming their commitment to authenticity and premium materials while still maintaining an interest in synthetic options.\n\n- **Style Preference:** Their recent acquisition reflects a preference for versatile styles, with a particular inclination towards wavy textures that offer a natural appearance. This aligns with their trend towards modern aesthetics blended with practicality.\n\n- **Quality Focus:** The user's high rating for the latest human hair product underscores their expectation for top-notch quality, demonstrating a discerning approach to selecting items that not only meet but exceed their standards.\n\n- **Simplicity in Use:** With a note on the need for minor customization (bleaching and plucking), the user still leans towards products that maintain a straightforward application process, balancing quality with ease of styling.\n\n- **Positive Feedback:** Their enthusiastic review and perfect rating for the human hair product highlight a continued pattern of satisfaction with items that deliver on quality and aesthetic appeal, reinforcing their trend of appreciating reliable, high-caliber products.\n\n- **Age Range:** The user remains in the adult demographic, indicating ongoing interest in sophisticated styles that resonate with elegance and refined taste.\n\nOverall, the user values exceptional quality, versatility, and user-friendly solutions across both human and synthetic hair products, consistently reflecting their discerning yet adventurous approach to styling.",
  "metrics": {
    "rouge1_f": 0.16599190283400808,
    "rouge2_f": 0.036585365853658534,
    "rougeL_f": 0.08097165991902834,
    "meteor": 0.10008363763304474,
    "bleu1": 0.11182634430384567,
    "bleu2": 0.024444115962845153,
    "bleu3": 0.005430869022989666,
    "bleu4": 0.0025620599722255373,
    "bertscore_precision": 0.36321693658828735,
    "bertscore_recall": 0.38254961371421814,
    "bertscore_f1": 0.3726327121257782
  }
}