{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Courageous\nReview Date: 2013/10/24\nStore: Alex Kendrick  (Actor, Director),     Ken Bevel  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Four men, one calling: To serve and protect. As law enforcement officers, they are confident and focused, standing up to the worst the streets can offer. Yet at the end of the day, they face a challenge they’re ill prepared to tackle: fatherhood. When tragedy strikes home, these men are left wrestling with their hopes, their fears, their faith, and their fathering. Sherwood Pictures, creators of', 'Fireproof', ', returns with this heartfelt, action-packed story. Protecting the streets is second nature to these law enforcement officers. Raising their children in a God-honoring way? That takes courage. Starring: Alex Kendrick, Kevin Downes, Ken Bevel, Robert Amaya, Ben Davies Director: Alex Kendrick Producer: Stephen Kendrick', 'Amazon.com', 'What is the true mark of a man? The male stars of the moving sleeper hit', 'Courageous', \"are all sheriff's deputies in a small Georgia town, putting their lives on the line every day. Yet as\", 'Courageous', \"deftly shows, the true measure of a man's courage and heart lies in the daily choices he makes, especially as a husband and father.\", 'Courageous', 'is a film that examines faith, commitment, and the preciousness of life. If that sounds simplistic,', 'Courageous', ', made by the same filmmakers who made the Christian film', 'Fireproof', 'and others, is in fact mostly nuanced, sophisticated, and very well acted. Directed by Alex Kendrick, who also cowrote the screenplay with his brother Stephen, and who costars as well,', 'Courageous', 'blends believable action scenes and drama with just enough comedy to keep things from being ponderous. The opening sequence, in fact, is one of the best car-chase scenes in recent film memory--and the \"reveal\" at its conclusion will bring tears to viewers\\' eyes. In fact,', 'Courageous', 'is a weeper of a film, but only because its message is so true and deeply felt. Each of the four deputies--played by Alex Kendrick, Ken Bevel, Kevin Downes, and Ben Davies--wrestles with choices big and small, and finds his faith tested in the darkest of times.', 'Courageous', 'is an excellent faith-based film suitable for teens and older (there\\'s a death in the film that may be disturbing to very young viewers, though it\\'s handled off-screen). The Blu-ray disc contains lots of extras, including a thoughtful commentary with Alex and Stephen Kendrick, a making-of featurette that\\'s as inspiring as the film, outtakes, and a hilarious short called \"', 'Courageous', 'in 60 Seconds\" that underscores that the filmmakers have an all-important sense of humor. Anyone seeking a quality faith-based film experience will be enormously moved by the heart of', 'Courageous', '. --', 'A.T. Hurley']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': '043396388338', 'Director': 'Alex Kendrick', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, Closed-captioned, NTSC, AC-3', 'Run time': '2 hours and 9 minutes', 'Release date': 'January 17, 2012', 'Actors': 'Alex Kendrick, Ken Bevel, Kevin Downes, Renee Jewell, Rusty Martin', 'Subtitles': 'Thai, Spanish, English, Korean, Chinese', 'Producers': 'Stephen Kendrick', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is the best movie ever.  It's a great plot line and it gives you a full range of emotions to experience from beginning to end.\nReview Title: Best Movie Ever\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Cain'], 'Producers': ['Jerry Weintraub'], 'Starring': ['George Strait', 'Lesley Ann Warren', 'Isabel Glasser'], 'Studio': ['Warner Bros.']}\nLoved the movie Pure Country.  The music was wonderful and of course I love George Strait, but all in all it was a good story.\nLovin' George Strait\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nCouldn't wait for this to get here and I wasn't disappointed.  Love It and I really can't wait to order some more of my favorite old shows.\nLove My Old TV Shows\nThe New Adventures Of Robin Hood (S1) (4 Disc)\nFred  Weintraub  (Director),     Tom  Kuhn  (Director),     Matthew Poretta  (Actor),     Anna Galvin  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['An outlaw of Sherwood Forest and his partners, Marion, Friar Tuck and Little John, use magic, sorcery and courage to fight royal soldiers, evil Knights and whoever else tries to oppress the impoverished people of 12th Century England.']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'NTSC, Full Screen', 'Contributor': 'Fred  Weintraub, Matthew Poretta, Richard Ashton, Martyn Ellis, Anna Galvin, Tom  Kuhn', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Fred  Weintraub, Tom  Kuhn', 'Media Format': 'NTSC, Full Screen', 'Run time': '20 hours and 10 minutes', 'Release date': 'July 23, 2010', 'Actors': 'Matthew Poretta, Anna Galvin, Richard Ashton, Martyn Ellis', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '4'}\nThis was one of my favorite Saturday morning tv shows so of course I love my dvd set; I just wish they'd release the rest of the seasons for us to buy as well.\nWatched on TV\nCourageous\nAlex Kendrick  (Actor, Director),     Ken Bevel  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Four men, one calling: To serve and protect. As law enforcement officers, they are confident and focused, standing up to the worst the streets can offer. Yet at the end of the day, they face a challenge they’re ill prepared to tackle: fatherhood. When tragedy strikes home, these men are left wrestling with their hopes, their fears, their faith, and their fathering. Sherwood Pictures, creators of', 'Fireproof', ', returns with this heartfelt, action-packed story. Protecting the streets is second nature to these law enforcement officers. Raising their children in a God-honoring way? That takes courage. Starring: Alex Kendrick, Kevin Downes, Ken Bevel, Robert Amaya, Ben Davies Director: Alex Kendrick Producer: Stephen Kendrick', 'Amazon.com', 'What is the true mark of a man? The male stars of the moving sleeper hit', 'Courageous', \"are all sheriff's deputies in a small Georgia town, putting their lives on the line every day. Yet as\", 'Courageous', \"deftly shows, the true measure of a man's courage and heart lies in the daily choices he makes, especially as a husband and father.\", 'Courageous', 'is a film that examines faith, commitment, and the preciousness of life. If that sounds simplistic,', 'Courageous', ', made by the same filmmakers who made the Christian film', 'Fireproof', 'and others, is in fact mostly nuanced, sophisticated, and very well acted. Directed by Alex Kendrick, who also cowrote the screenplay with his brother Stephen, and who costars as well,', 'Courageous', 'blends believable action scenes and drama with just enough comedy to keep things from being ponderous. The opening sequence, in fact, is one of the best car-chase scenes in recent film memory--and the \"reveal\" at its conclusion will bring tears to viewers\\' eyes. In fact,', 'Courageous', 'is a weeper of a film, but only because its message is so true and deeply felt. Each of the four deputies--played by Alex Kendrick, Ken Bevel, Kevin Downes, and Ben Davies--wrestles with choices big and small, and finds his faith tested in the darkest of times.', 'Courageous', 'is an excellent faith-based film suitable for teens and older (there\\'s a death in the film that may be disturbing to very young viewers, though it\\'s handled off-screen). The Blu-ray disc contains lots of extras, including a thoughtful commentary with Alex and Stephen Kendrick, a making-of featurette that\\'s as inspiring as the film, outtakes, and a hilarious short called \"', 'Courageous', 'in 60 Seconds\" that underscores that the filmmakers have an all-important sense of humor. Anyone seeking a quality faith-based film experience will be enormously moved by the heart of', 'Courageous', '. --', 'A.T. Hurley']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': '043396388338', 'Director': 'Alex Kendrick', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, Closed-captioned, NTSC, AC-3', 'Run time': '2 hours and 9 minutes', 'Release date': 'January 17, 2012', 'Actors': 'Alex Kendrick, Ken Bevel, Kevin Downes, Renee Jewell, Rusty Martin', 'Subtitles': 'Thai, Spanish, English, Korean, Chinese', 'Producers': 'Stephen Kendrick', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is the best movie ever.  It's a great plot line and it gives you a full range of emotions to experience from beginning to end.\nBest Movie Ever",
  "profile": "**User Profile Summary:**\n\n- **Music Preference:** Strong affinity for country music, particularly favoring George Strait.\n- **Content Appreciation:** Enjoys films and television series that feature solid narratives and engaging music; expresses enthusiasm for classic and nostalgic TV shows, reflecting a fondness for past favorites.\n- **Cinematic Taste:** Demonstrates a preference for quality productions with notable directors and actors, often gravitating towards heartwarming, character-driven stories with romantic and adventurous themes, and shows a particular interest in faith-based films that explore themes of commitment and courage.\n- **Reviewing Style:** Typically provides consistent, positive feedback, reflecting genuine enjoyment; high ratings signify strong satisfaction, with a recent review indicating a deep emotional engagement with the story.\n- **Genre Preference:** Inclined towards narrative-rich films and series within the mystery, action-adventure, and romantic comedy genres, underlining a love for character relationships and emotional depth.\n- **Language Accessibility:** Values content accessibility through the use of audio descriptions and closed captions; enjoys subtitles, especially for older shows.\n- **Nostalgic Affinity:** Recently highlighted a nostalgic connection to favorite childhood shows and emotional storytelling, indicating a desire for comprehensive collections and the enjoyment of beloved past narratives.\n\nThe user's interests intersect a consistent appreciation for compelling, story-centric content across various media, seamlessly blending nostalgia with a commitment to quality storytelling, emotional exploration, and character dynamics.",
  "metrics": {
    "rouge1_f": 0.12765957446808512,
    "rouge2_f": 0.01704199634814364,
    "rougeL_f": 0.06443768996960486,
    "meteor": 0.038830271544105836,
    "bleu1": 0.0007982362045148724,
    "bleu2": 0.0002939554482932431,
    "bleu3": 3.970210809948064e-05,
    "bleu4": 1.4603780319922548e-05,
    "bertscore_precision": 0.3681403398513794,
    "bertscore_recall": 0.4995051920413971,
    "bertscore_f1": 0.4238782227039337
  }
}