{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Best of Trading Spaces [DVD]\nReview Date: 2017/04/25\nStore: Paige Davis  (Actor),     Frank Bielec  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, Top Sellers\nProduct Description: ['Product Description', 'THE BEST OF THE BEST. Take the coolest show on daytime TV, select the best moments plus never-before-seen outrageous footage, and you have The Best of Trading Spaces. This unique DVD captures the fun, creative side of the crew and homeowners and places them in an interactive format. Meet each crew member in specially edited vignettes. Witness extreme reveals (when the homeowners see their redesigned rooms for the first time) complete with awkward moments of truth. And go behind the scenes for never-before-seen bloopers and outtakes. It\\'s the best of the best! DO UNTO YOUR NEIGHBORS... In this one-of-a-kind decorating show, two sets of neighbors swap keys to transform one room in each other\\'s home. They have two days, a set budget, and they\\'re not allowed back into their own homes until the moment of truth. This is the \"how-to\" with a neighborly twist.', 'Amazon.com', 'This phenomenally popular reality TV series that put the Learning Channel on the map obviously hopes to further build its fan base with this nearly two-hour collection of memorable moments, behind-the-scenes segments, and crew profiles. The premise: Two sets of neighbors have 48 hours to redo a room in each other\\'s home. At their disposal are a designer, a carpenter, and a $1,000 budget. Most entertaining are the \"reveals,\" presented in too-brief \"Love it\" and \"Hate it\" segments. These are all subjective, of course. One couple loved their new safari-inspired bedroom. I thought it made Graceland look like Monticello. Those new to the series might want to get a few episodes under their (tool) belt to really appreciate this. Fans of the series will make it a valuable addition to their DVD library.', '--Donald Liebenson']\nAverage Rating: 3.6\nProduct Details: {'Format': 'Color, NTSC, Closed-captioned, DVD, Full Screen', 'Contributor': 'Douglas Wilson, Hildi Santo Tomas, Brandon Russell, Genevieve Gorder, Edward Walker, Amy Wynn Pastor, Frank Bielec, Ty Pennington, Paige Davis, Alex McLeod, Faber Dewar, Laurie SmithDouglas Wilson, Hildi Santo Tomas, Brandon Russell, Genevieve Gorder, Edward Walker, Amy Wynn Pastor, Frank Bielec, Ty Pennington, Paige Davis, Alex McLeod, Faber Dewar, Laurie Smith   See more', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC, Closed-captioned, DVD, Full Screen', 'Run time': '1 hour', 'Release date': 'March 18, 2003', 'Actors': 'Paige Davis, Frank Bielec, Faber Dewar, Hildi Santo Tomas, Alex McLeod', 'Studio': 'Live / Artisan', 'Number of discs': '1'}\nReview Text: Not a great dvd. Just marginal as far as seeing what the show really was.\nReview Title: Not recommend\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Cain'], 'Producers': ['Jerry Weintraub'], 'Starring': ['George Strait', 'Lesley Ann Warren', 'Isabel Glasser'], 'Studio': ['Warner Bros.']}\nLoved the movie Pure Country.  The music was wonderful and of course I love George Strait, but all in all it was a good story.\nLovin' George Strait\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nCouldn't wait for this to get here and I wasn't disappointed.  Love It and I really can't wait to order some more of my favorite old shows.\nLove My Old TV Shows\nThe New Adventures Of Robin Hood (S1) (4 Disc)\nFred  Weintraub  (Director),     Tom  Kuhn  (Director),     Matthew Poretta  (Actor),     Anna Galvin  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['An outlaw of Sherwood Forest and his partners, Marion, Friar Tuck and Little John, use magic, sorcery and courage to fight royal soldiers, evil Knights and whoever else tries to oppress the impoverished people of 12th Century England.']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'NTSC, Full Screen', 'Contributor': 'Fred  Weintraub, Matthew Poretta, Richard Ashton, Martyn Ellis, Anna Galvin, Tom  Kuhn', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Fred  Weintraub, Tom  Kuhn', 'Media Format': 'NTSC, Full Screen', 'Run time': '20 hours and 10 minutes', 'Release date': 'July 23, 2010', 'Actors': 'Matthew Poretta, Anna Galvin, Richard Ashton, Martyn Ellis', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '4'}\nThis was one of my favorite Saturday morning tv shows so of course I love my dvd set; I just wish they'd release the rest of the seasons for us to buy as well.\nWatched on TV\nCourageous\nAlex Kendrick  (Actor, Director),     Ken Bevel  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Four men, one calling: To serve and protect. As law enforcement officers, they are confident and focused, standing up to the worst the streets can offer. Yet at the end of the day, they face a challenge they’re ill prepared to tackle: fatherhood. When tragedy strikes home, these men are left wrestling with their hopes, their fears, their faith, and their fathering. Sherwood Pictures, creators of', 'Fireproof', ', returns with this heartfelt, action-packed story. Protecting the streets is second nature to these law enforcement officers. Raising their children in a God-honoring way? That takes courage. Starring: Alex Kendrick, Kevin Downes, Ken Bevel, Robert Amaya, Ben Davies Director: Alex Kendrick Producer: Stephen Kendrick', 'Amazon.com', 'What is the true mark of a man? The male stars of the moving sleeper hit', 'Courageous', \"are all sheriff's deputies in a small Georgia town, putting their lives on the line every day. Yet as\", 'Courageous', \"deftly shows, the true measure of a man's courage and heart lies in the daily choices he makes, especially as a husband and father.\", 'Courageous', 'is a film that examines faith, commitment, and the preciousness of life. If that sounds simplistic,', 'Courageous', ', made by the same filmmakers who made the Christian film', 'Fireproof', 'and others, is in fact mostly nuanced, sophisticated, and very well acted. Directed by Alex Kendrick, who also cowrote the screenplay with his brother Stephen, and who costars as well,', 'Courageous', 'blends believable action scenes and drama with just enough comedy to keep things from being ponderous. The opening sequence, in fact, is one of the best car-chase scenes in recent film memory--and the \"reveal\" at its conclusion will bring tears to viewers\\' eyes. In fact,', 'Courageous', 'is a weeper of a film, but only because its message is so true and deeply felt. Each of the four deputies--played by Alex Kendrick, Ken Bevel, Kevin Downes, and Ben Davies--wrestles with choices big and small, and finds his faith tested in the darkest of times.', 'Courageous', 'is an excellent faith-based film suitable for teens and older (there\\'s a death in the film that may be disturbing to very young viewers, though it\\'s handled off-screen). The Blu-ray disc contains lots of extras, including a thoughtful commentary with Alex and Stephen Kendrick, a making-of featurette that\\'s as inspiring as the film, outtakes, and a hilarious short called \"', 'Courageous', 'in 60 Seconds\" that underscores that the filmmakers have an all-important sense of humor. Anyone seeking a quality faith-based film experience will be enormously moved by the heart of', 'Courageous', '. --', 'A.T. Hurley']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': '043396388338', 'Director': 'Alex Kendrick', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, Closed-captioned, NTSC, AC-3', 'Run time': '2 hours and 9 minutes', 'Release date': 'January 17, 2012', 'Actors': 'Alex Kendrick, Ken Bevel, Kevin Downes, Renee Jewell, Rusty Martin', 'Subtitles': 'Thai, Spanish, English, Korean, Chinese', 'Producers': 'Stephen Kendrick', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is the best movie ever.  It's a great plot line and it gives you a full range of emotions to experience from beginning to end.\nBest Movie Ever\nThe Closer: Season 1\nKyra Sedgwick  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'Closer, The: The Complete First Season (DVD)', 'Meet Deputy Police Chief Brenda Leigh Johnson, the quirky, no-nonsense boss of the elite Priority Homicide Division of the Los Angeles Police Department, played to perfection by Golden Globe winner and Emmy® nominee Kyra Sedgwick. Brought from Atlanta to head up this special unit that handles sensitive, high-profile murder cases, Brenda has world-class interrogation skills, often matching a criminal’s lie with one of her own in order to obtain a confession. Her offbeat attitude and hard-nosed approach can rub her colleagues the wrong way, as does the fact that she is a tough-minded Southern woman in a department dominated by men. The series also stars J.K. Simmons (Juno, Spider-Man films), Corey Reynolds (The Terminal), Robert Gossett (Arlington Road), G.W. Bailey (Police Academy films), Tony Denison (Prison Break) and Jon Tenney (Looking for Comedy in the Muslim World). Catch the critically acclaimed series from the start.', ']]>', 'Amazon.com', 'Deputy Police Chief Brenda Johnson (Kyra Sedgwick,', 'Personal Velocity', \") isn't about making friends, she's about getting results. Days after her transfer from Atlanta, the LAPD's Priority Homicide Division decides they can't work with the blunt-talking Southern belle. Fortunately, she has former CIA colleague, Assistant Police Chief Will Pope (J.K. Simmons,\", 'Spider-Man', '), on her side. As he explains to Captain Taylor (Robert Gossett), who she has just replaced, \"She is not miss congeniality...but she\\'s a closer.\" Set to the sound of urban blues, TNT\\'s', 'The Closer', 'is', 'Columbo', 'by way of', 'Prime Suspect', \". In other words, Johnson may be as messy as Oscar Madison, but she's as sharp as Sherlock Holmes. Throughout the first season, she'll solve 13 murders, including those of a reclusive mathematician, a Russian prostitute, and a British butler. She won't get much support from her colleagues, except for Sergeant David Gabriel (Corey Reynolds, Broadway\\x92s\", 'Hairspray', ')--to the consternation of his co-workers, like Detective Lieutenants Provenza (G.W. Bailey,', 'M*A*S*H', ') and Flynn (Tony Denison,', 'Melrose Place', '). Johnson also has a friend in FBI Special Agent Fritz Howard (Jon Tenney,', 'You Can Count on Me', '). With his help, she\\'ll eventually settle into her new environment, especially when she lands a house and a cat on the same day (conveniently left behind by a victim). Just as it takes awhile for the chief to grow on her squad--and to get used to driving in LA--Sedgwick\\'s Golden Globe-nominated performance follows a similar trajectory. Fortunately, \"Scarlett O\\'Hara,\" as the droll Provenza dubs her, becomes more fully-rounded as the season progresses, aided by a superb SAG Award-nominated ensemble cast. Consulting producer on', 'The Closer', 'is former LA District Attorney Gil Garcetti of O.J. infamy.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Drama/Love & Romance, Mystery & Suspense/Crime, Mystery & Suspense/Crime/Cops, Action & AdventureDrama, Drama/Love & Romance, Mystery & Suspense/Crime, Mystery & Suspense/Crime/Cops, Action & Adventure  See more', 'Format': 'Multiple Formats, Box set, Color, Subtitled, Full Screen, NTSC', 'Contributor': 'Kyra Sedgwick', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 7.2 Ounces', 'Item model number': '2211087', 'Media Format': 'Multiple Formats, Box set, Color, Subtitled, Full Screen, NTSC', 'Run time': '10 hours and 2 minutes', 'Release date': 'May 29, 2007', 'Actors': 'Kyra Sedgwick', 'Subtitles': 'Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '4'}\nI loved this show and if you liked it too, then you most definitely need to buy these.  I can't wait till I get the complete series.\nYAY Kyra Sedgewick\nThe Munsters: Two-Movie Fright Fest - (Franchise Collection) - (Munster, Go Home! & The Munsters' Revenge)\nFred Gwynne  (Actor),     Yvonne De Carlo  (Actor),     Don Weis  (Director),     Earl Bellamy  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'America\\'s first family of fright lives on in The Munsters: Two-Movie Fright Fest! Following their wildly popular TV series, original cast members Fred Gwynne (Herman Munster), Yvonne De Carlo (Lily Munster), and Al Lewis (Grandpa) are reunited in two hilarious movies as you\\'ve never seen them before—in color! Munster, Go Home!: The laughs begin when Herman moves the family to an English estate he inherited. The Munsters\\' Revenge: Dr. Diablo (Sid Caesar) concocts a plan to create robot \"Munsters\" to pull off a series of art heists.', 'Amazon.com', \"There aren't many funny, pre-\", 'Pufnstuf', \"era monster movies suitable for the family, until one remembers the Munsters, who beyond their two-season television stint, made two feature films, albeit fifteen years apart. Both filmed in Technicolor, the vibrance of the Munsters' spooky lifestyle is most apparent in\", 'Munsters, Go Home', '(1966), far superior to the cornier', \"Munsters' Revenge\", \". A true '60s relic,\", 'Munsters, Go Home', \"begins when Herman's deceased relative bestows him with Lord status, necessitating the Munsters' trip to England to claim his title. There, he meets other Munsters, Lady Effigy and Freddie Munster, whose jealousy results in frightening antics that only thrill Herman, Grandpa, Lily, Eddie, and Marilyn (with Pat Priest replaced by Debbie Watson). As the plot thickens, Herman faces other threats to the family honor with his classic innocent bravado. In\", \"Munsters' Revenge\", \", a wax museum criminal circuit sends Munsters' imposters out to commit crimes, so it's up to the real family to solve the mystery. Different Eddies and Marilyns slightly spoil the family reunion's ambience, though ample physical comedy--for example when Herman's bee sting causes him to destroy the police precinct where he's being held as a criminal suspect--makes the film authentic to its original characters. Moreover, watching this double feature is an inspiring reminder of what props used to look like, like George Barris's Munster Koach, not to mention those that grace the entire Munster Mansion.\", '--Trinie Dalton']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Bob Mosher, K.C. Martel, Jo McDonnell, Richard Dawson, Butch Patrick, Debbie Watson, John Carradine, Don Weis, Al Lewis, George Tibbles, Fred Gwynne, Sid Caesar, Yvonne De Carlo, Earl Bellamy, Joe ConnellyBob Mosher, K.C. Martel, Jo McDonnell, Richard Dawson, Butch Patrick, Debbie Watson, John Carradine, Don Weis, Al Lewis, George Tibbles, Fred Gwynne, Sid Caesar, Yvonne De Carlo, Earl Bellamy, Joe Connelly  See more', 'Initial release date': '2006-09-26', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.48 x 5.31 x 0.67 inches; 0.01 Ounces', 'Director': 'Don Weis, Earl Bellamy', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 14 minutes', 'Release date': 'September 26, 2006', 'Actors': 'Fred Gwynne, Yvonne De Carlo, Al Lewis, K.C. Martel, Butch Patrick', 'Subtitles': 'English, French', 'Producers': 'Joe Connelly, Bob Mosher', 'Studio': 'Studio Distribution Services', 'Writers': 'Joe Connelly, Bob Mosher, George Tibbles', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe original movie Munster Go Home was great.  I loved it as a kid and I love it now.  The follow-up movie Munsters Revenge was just marginal at best, but since it came as a set at such a good price, it was well worth the $$$ I spent.\nOriginal=10 Follow-up=5\nGirls Girls Girls (1962) [DVD]\nElvis Presley  (Actor),     Stella Stevens  (Actor),     Norman Taurog  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Music Artists, Presley, Elvis\n['Product description', 'Girls Girls Girls (1962) 98 Min/PG/Color', 'Amazon.com', 'Hawaii seems like an afterthought in Elvis\\'s second island outing. Half the musical numbers take place on boats (including the seasick-making title tune) and half in a Trader Vic\\'s-style nightclub, so there\\'s little good use of the exotic locale. There\\'s little use of that lovable dish Stella Stevens, either, who\\'s relegated to \"other woman\" duty as Elvis courts bland Laurel Goodwin. Goodwin\\'s a rich girl going incognito, while E.P. is a penniless fisherman who dreams of owning his own boat. You finish the plot. The King is in good voice here, although the songs are fairly weak, with some curious flings at calypso and flamenco mixed in. He comes to shoulder-shaking life for \"Return to Sender,\" a sizzling number that shows how his entire being could be possessed by a musical moment. This movie doesn\\'t have enough of those to boost it into the upper tier of Elvis pictures.', '--Robert Horton']\n{'Format': 'Color, Widescreen, NTSC, Anamorphic, DVD, Closed-captioned, Dolby', 'Contributor': 'Frank Puglia, Elizabeth Tiu, Beulah Quo, Elvis Presley, Ginny Tiu, Jeremy Slate, Edward Anhalt, Laurel Goodwin, Guy Lee, Benson Fong, Norman Taurog, Stella Stevens, Lili Valenty, Allan Weiss, Robert StraussFrank Puglia, Elizabeth Tiu, Beulah Quo, Elvis Presley, Ginny Tiu, Jeremy Slate, Edward Anhalt, Laurel Goodwin, Guy Lee, Benson Fong, Norman Taurog, Stella Stevens, Lili Valenty, Allan Weiss, Robert Strauss  See more', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), English (Dolby Digital 5.0)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Director': 'Norman Taurog', 'Media Format': 'Color, Widescreen, NTSC, Anamorphic, DVD, Closed-captioned, Dolby', 'Run time': '1 hour and 46 minutes', 'Release date': 'January 7, 2003', 'Actors': 'Elvis Presley, Stella Stevens, Jeremy Slate, Laurel Goodwin, Benson Fong', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Allan Weiss, Edward Anhalt', 'Number of discs': '1'}\nThis was one of Elvis' better movies especially if love the music that's in it and I definitely do.  Well worth the $$$.\nWho doesn't love Elvis?\nScarecrow and Mrs. King: Season 3\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n{'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Color, Multiple Formats, NTSC, Box set', 'Contributor': 'Kate Jackson, Bruce Boxleitner', 'Language': 'English', 'Number Of Discs': '5'}\nThis is and always will be one of my favorite old tv series.  I love the chemistry between these two and they're good clean shows which is more than I can say for what's on the boob tube now.\nLove My Old TV Series\nThe Incredible Mr. Limpet (Keepcase)\nDon Knotts  (Actor),     Carole Cook  (Actor),     Arthur Lubin  (Director),     William Tytle  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Subtitled', 'Contributor': 'Larry Keating, Charles Meredith, Jameson Brewer, Jack Weston, Elizabeth MacRae, Don Knotts, Andrew Duggan, William Tytle, Arthur Lubin, Paul Frees, Carole Cook, Oscar Beregi, John C. RoseLarry Keating, Charles Meredith, Jameson Brewer, Jack Weston, Elizabeth MacRae, Don Knotts, Andrew Duggan, William Tytle, Arthur Lubin, Paul Frees, Carole Cook, Oscar Beregi, John C. Rose   See more', 'Language': 'English', 'Runtime': '1 hour and 39 minutes'}\nI love this movie.  It's my favorite Don Knotts movie.  I love Crusty and Limpet's thrum.  It's a great story if you like using your imagination.  Really Good!!!\nMy Favorite Don Knotts\nTaking Care of Business & Mr. Destiny + Hello Again - Triple Feature\nJames Belushi  (Actor),     Michael Caine  (Actor),     Various  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Mr. Destiny', \"- Would you give up everything you have for everything you've ever wanted? That's exactly what junior executive Larry Burrows (\", \"James Belushi - New Year's Eve, Hoodwinked\", ') does when he encounters a mysterious stranger named', '\"Mr. Destiny\"', '(', 'Academy Award® winner Michael Caine', \"). Instantly, Larry's ordinary life is transformed into his ultimate fantasy - a huge mansion, a beautiful wife, exotic cars galore! But before long, he discovers that the good life isn't all it's cracked up to be, and goes to outrageous extremes to retrieve the life he left behind.\", 'MR. DESTINY', 'is a delightful rags-to-riches comedy brimming with magical entertainment!', 'Hello Again', '- Lucy Chadman (', \"Shelley Long of Outrageous Fortune and TV's Cheers\", ') comes to an untimely end while nibbling on an Oriental chicken ball - but says', 'HELLO AGAIN', 'when her wacky, mystical sister Zelda (', 'Judith Ivey - Flags of our Fathers', \") brings her back from the great beyond. Only one year has passed but oh, how things have changed! Lucy's miraculous return creates laugh-filled pandemonium with everyone she re-encounters - especially with her upwardly mobile husband (\", 'Corbin Bernsen - Major League', '), who is now wed to her', '\"former\"', 'best friend! Suddenly solo, Lucy must piece together a new life - in a riotous odyssey that bewilders her ex-husband - and bewitches both press and public alike!', 'Taking Care of Business', '- James Belushi (', 'Underdog', \") is Jimmy Dworski, a happy-go-lucky convict who breaks out of prison and finally gets a life - somebody else's! When Dworski finds the daily planner book that literally runs the life of ultra-organized executive Spencer Barnes (\", \"Charles Grodin - Beethoven's 2nd\", '), all hell breaks loose! With newfound cash, credit cards and the keys to a Malibu mansion, the impostor Dworski embarks on an all-expense-paid trip to', '\"Easy Street\"', \"while posing as the high-powered Barnes. Meanwhile, Spencer's life is turned upside-down as he hunts through the jungles of Los Angeles for his beloved book! When these oddball opposites finally meet, it's a comedic collision you won't soon forget!\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Michael Caine, James Belushi, Shelley Long, Various', 'Language': 'English', 'Runtime': '5 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.88 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '5 hours and 14 minutes', 'Release date': 'June 26, 2012', 'Actors': 'James Belushi, Michael Caine, Shelley Long', 'Studio': 'Mill Creek Ent', 'Number of discs': '2'}\nI love these movies, they're very entertaining, the only thing I hate is the language in them, but I guess if I'm going to watch them I have to overlook that.  Funny Funny movies though\n80's Movies\nFlintstones:Flintstones Xmas Carol (D)\nJoanna Romersa  (Director),     Henry Corden  (Actor),     Jean Vander Pyl  (Actor)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Timeless Holiday Favorites\n['Flintstones, The: A Flintstones Christmas Carol (DVD)', \"When Fred Flintstone stars as Ebenezer Scrooge in the Bedrock Community Players production of Dickens' A Christmas Carol, his ego swells to the size of a Tyrannosaurus, and he starts to become like embittered old miser he is to portray. But by the time the curtain closes on the play, Wilma, Barney and Pebbles help Fred learn the true meaning of Christmas.\", ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 2.4 Ounces', 'Item model number': '3349416', 'Director': 'Joanna Romersa', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled, Closed-captioned', 'Run time': '1 hour and 26 minutes', 'Release date': 'October 2, 2007', 'Actors': 'Henry Corden, Jean Vander Pyl, Frank Welker, B.J. Ward, Russi Taylor', 'Subtitles': 'English, Portuguese', 'Producers': 'William Hanna, Gordon Kent, Joseph Barbera, Buzz Potamkin', 'Language': 'English (Dolby Digital 2.0), Unqualified, Portuguese (Dolby Digital 1.0)', 'Studio': 'WarnerBrothers', 'Writers': 'Glenn Leopold', 'Number of discs': '1'}\nThere are several Scrooge movies that I watch during the Christmas season, but this by far is my favorite.  I grew up on the Flintstones and this is one of the best yet\nLoving Scrooge\nScarecrow and Mrs. King: Season 2\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.']\n{'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Kate Jackson, Bruce Boxleitner', 'Language': 'English', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '883929157457', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '5 hours', 'Release date': 'March 22, 2011', 'Actors': 'Kate Jackson, Bruce Boxleitner', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nI now have the complete series and this season has some of my favorite episodes in it.  You get several hours worth of good clean entertainment from these two.  Well worth the $$$ especially if you love them as much as I do.\nSome of my Favorite Episodes\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Robson'], 'Producers': ['Jerry Wald'], 'Starring': ['Lana Turner', 'Lee Philips', 'Lloyd Nolan'], 'Studio': ['20th Century Fox']}\nIf you like old movies and I do...this is an excellent choice.  The storyline, although set back in history is one that still complicates our culture today.  Love the actors in the movie, they're quite good.  Enjoy this movie.\nGreat Movie\nDragnet (1987)\nDan Aykroyd  (Actor, Writer),     Tom Hanks  (Actor),     Tom Mankiewicz  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['This is the city...and only Dan Aykroyd and Tom Hanks can save it in this hilarious box-office blockbuster that pays homage to the famed original police drama of the \\'50s and \\'60s. Aykroyd is at his comedic best as the namesake nephew of Detective Sgt. Joe Friday. Like his uncle, he\\'s a blue-suited, by-the-rules cop who reluctantly joins forces with his footloose partner Pep Streebek (Hanks) to rescue the City of Angels from the machinations of a power-mad Reverend and corrupt Police Commissioners. And those are \"just the facts\" of this hysterically funny action-comedy.']\n{'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': '61020392', 'Director': 'Tom Mankiewicz', 'Media Format': 'Anamorphic, Color, Widescreen, NTSC, Multiple Formats, Closed-captioned, Dolby', 'Run time': '1 hour and 46 minutes', 'Release date': 'October 27, 1998', 'Actors': 'Dan Aykroyd, Tom Hanks, Dabney Coleman, Christopher Plummer, Harry Morgan', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'David Permut, Robert K. Weiss', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Dan Aykroyd, Alan Zweibel, Tom Mankiewicz', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLoved this 1980's movie. It was a good recreation of the Dragnet TV series that brought good, but ridiculous humor with it. If you just need a good chuckle some rainy afternoon, give it a look-see & enjoy\nLoved this 1980's movie\nNo Time for Sergeants\nAndy Griffith  (Actor),     Nick Adams  (Actor),     Mervyn LeRoy  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Georgia farm boy Will Stockdale is about to bust with pride. He’s been drafted. Will’s ready. But is Uncle Sam ready for Will? In No Time for Sergeants, Andy Griffith is certifiably funny in the role that clinched his stardom. Wearing a friendly, wide grin, he ambles into the U.S. Air Force – and lots of folks’ll never be the same. They include pint-sized Ben (Nick Adams), big-city bruiser Irvin (Murray Hamilton) and a jittery aptitude tester (Don Knotts). Finally, there’s Sgt. Orville King (Myron McCormick), a don’t-rock-the-boat old-timer driven crazy by Will’s gee-whiz efforts at friendship. Griffith, McCormick and Knotts reprise their winning performances from No Time for Sergeants’ smash Broadway run. Breezily directed by the veteran Mervyn LeRoy (Mister Roberts), it’s definitely time for entertainment!']\n{'Genre': 'Musicals, Arts, Culture & Entertainment, Comedy', 'Format': 'Multiple Formats, Black & White, Original recording remastered, Subtitled, NTSC, Restored', 'Contributor': 'Don Knotts, Murray Hamilton, Nick Adams, Mervyn LeRoy, Andy Griffith, Myron McCormick', 'Initial release date': '2010-05-04', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '6638889', 'Director': 'Mervyn LeRoy', 'Media Format': 'Multiple Formats, Black & White, Original recording remastered, Subtitled, NTSC, Restored', 'Run time': '1 hour and 59 minutes', 'Release date': 'May 4, 2010', 'Actors': 'Andy Griffith, Nick Adams, Murray Hamilton, Don Knotts, Myron McCormick', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis movie is for all Andy Griffith fans. It's early nonsensical humor that's just plain clean fun. I've seen it all my life & this a replacement copy because I wore out my others. My entire family loves too & it never seems to get old.\nIt's early nonsensical humor that's just plain clean fun. I've seen it all my life & this ...\nTrading Spaces - Great Kitchen Designs and More\nPaige Davis  (Actor),     Frank Bielec  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Four friends. Two designers. One Carpenter. It\\'s TRADING SPACES where two sets of neighbors have just 48 hours to completely redecorate one room in each other\\'s house.In these five fast- paced episodes interior designers Doug Wilson (\"Moving Up\") Genevieve Gorder (\"Town Hall\") Bern Yip and carpenter Ty Pennington (\"Extreme Makeover: Home Edition\") tackle the most popular room in everybody\\'s home- the kitchen. Watch the fun and excitement- and pick up valuable decorating tips and ideas- as the design teams race against the clock to redo everything from countertops to cabinets to magically transform the family gathering place into a showroom of creative ingenuity.']\n{'Format': 'NTSC, Multiple Formats, Full Screen, Color', 'Contributor': 'Douglas Wilson, Hildi Santo Tomas, Brandon Russell, Genevieve Gorder, Edward Walker, Amy Wynn Pastor, Frank Bielec, Ty Pennington, Paige Davis, Alex McLeod, Faber Dewar, Laurie SmithDouglas Wilson, Hildi Santo Tomas, Brandon Russell, Genevieve Gorder, Edward Walker, Amy Wynn Pastor, Frank Bielec, Ty Pennington, Paige Davis, Alex McLeod, Faber Dewar, Laurie Smith  See more', 'Language': 'English (Dolby Digital 2.0)', 'Number Of Discs': '1', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 3.2 Ounces', 'Media Format': 'NTSC, Multiple Formats, Full Screen, Color', 'Run time': '1 hour', 'Release date': 'April 26, 2005', 'Actors': 'Paige Davis, Frank Bielec, Faber Dewar, Hildi Santo Tomas, Alex McLeod', 'Studio': 'Sony Pictures', 'Number of discs': '1'}\nThis trading spaces dvd was awesome.\nLoved it\nThe Best of Trading Spaces [DVD]\nPaige Davis  (Actor),     Frank Bielec  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, Top Sellers\n['Product Description', 'THE BEST OF THE BEST. Take the coolest show on daytime TV, select the best moments plus never-before-seen outrageous footage, and you have The Best of Trading Spaces. This unique DVD captures the fun, creative side of the crew and homeowners and places them in an interactive format. Meet each crew member in specially edited vignettes. Witness extreme reveals (when the homeowners see their redesigned rooms for the first time) complete with awkward moments of truth. And go behind the scenes for never-before-seen bloopers and outtakes. It\\'s the best of the best! DO UNTO YOUR NEIGHBORS... In this one-of-a-kind decorating show, two sets of neighbors swap keys to transform one room in each other\\'s home. They have two days, a set budget, and they\\'re not allowed back into their own homes until the moment of truth. This is the \"how-to\" with a neighborly twist.', 'Amazon.com', 'This phenomenally popular reality TV series that put the Learning Channel on the map obviously hopes to further build its fan base with this nearly two-hour collection of memorable moments, behind-the-scenes segments, and crew profiles. The premise: Two sets of neighbors have 48 hours to redo a room in each other\\'s home. At their disposal are a designer, a carpenter, and a $1,000 budget. Most entertaining are the \"reveals,\" presented in too-brief \"Love it\" and \"Hate it\" segments. These are all subjective, of course. One couple loved their new safari-inspired bedroom. I thought it made Graceland look like Monticello. Those new to the series might want to get a few episodes under their (tool) belt to really appreciate this. Fans of the series will make it a valuable addition to their DVD library.', '--Donald Liebenson']\n{'Format': 'Color, NTSC, Closed-captioned, DVD, Full Screen', 'Contributor': 'Douglas Wilson, Hildi Santo Tomas, Brandon Russell, Genevieve Gorder, Edward Walker, Amy Wynn Pastor, Frank Bielec, Ty Pennington, Paige Davis, Alex McLeod, Faber Dewar, Laurie SmithDouglas Wilson, Hildi Santo Tomas, Brandon Russell, Genevieve Gorder, Edward Walker, Amy Wynn Pastor, Frank Bielec, Ty Pennington, Paige Davis, Alex McLeod, Faber Dewar, Laurie Smith   See more', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC, Closed-captioned, DVD, Full Screen', 'Run time': '1 hour', 'Release date': 'March 18, 2003', 'Actors': 'Paige Davis, Frank Bielec, Faber Dewar, Hildi Santo Tomas, Alex McLeod', 'Studio': 'Live / Artisan', 'Number of discs': '1'}\nNot a great dvd. Just marginal as far as seeing what the show really was.\nNot recommend",
  "profile": "**Updated User Profile Summary:**\n\n- **Music Preference:** Maintains a strong affinity for country music, particularly George Strait, along with classic pop and rock from iconic artists like Elvis Presley.\n- **Content Appreciation:** Values films and TV series featuring compelling narratives and engaging soundtracks, with a specific interest in nostalgic collections that evoke childhood memories.\n- **Cinematic Taste:** Prefers quality productions by notable directors and iconic actors, enjoying heartwarming, character-driven stories with humorous undertones. Enthusiastic about classic comedies, especially those with clean humor and strong emotional engagement.\n- **Genre Preference:** Drawn to narrative-rich content across drama, comedy, mystery, action-adventure, and romantic comedy genres, emphasizing character relationships and socio-cultural themes.\n- **Reviewing Style:** Typically offers positive feedback but has recently shown a more critical edge, as reflected in a lower rating for a DVD that didn't meet expectations, indicating a focus on authenticity in content appreciation.\n- **Nostalgic Affinity:** Strong emphasis on nostalgia for childhood shows and films, enjoying content that revives joyful and whimsical storytelling.\n- **Recent Engagement:** Demonstrating an interest in lighthearted, family-friendly entertainment, recent interactions reflect a love for practical home improvement programming, alongside a discernment towards quality and content authenticity.",
  "metrics": {
    "rouge1_f": 0.03619302949061662,
    "rouge2_f": 0.003352329869259135,
    "rougeL_f": 0.021782841823056304,
    "meteor": 0.010545566190113868,
    "bleu1": 1.3879939064289272e-14,
    "bleu2": 4.5583728141126895e-15,
    "bleu3": 1.3392671130744555e-15,
    "bleu4": 4.0862114088327455e-16,
    "bertscore_precision": 0.3461271822452545,
    "bertscore_recall": 0.5152856111526489,
    "bertscore_f1": 0.41409730911254883
  }
}