{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The New Adventures Of Robin Hood (S1) (4 Disc)\nReview Date: 2013/10/24\nStore: Fred  Weintraub  (Director),     Tom  Kuhn  (Director),     Matthew Poretta  (Actor),     Anna Galvin  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['An outlaw of Sherwood Forest and his partners, Marion, Friar Tuck and Little John, use magic, sorcery and courage to fight royal soldiers, evil Knights and whoever else tries to oppress the impoverished people of 12th Century England.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Action & Adventure/Television, Television', 'Format': 'NTSC, Full Screen', 'Contributor': 'Fred  Weintraub, Matthew Poretta, Richard Ashton, Martyn Ellis, Anna Galvin, Tom  Kuhn', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Fred  Weintraub, Tom  Kuhn', 'Media Format': 'NTSC, Full Screen', 'Run time': '20 hours and 10 minutes', 'Release date': 'July 23, 2010', 'Actors': 'Matthew Poretta, Anna Galvin, Richard Ashton, Martyn Ellis', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: This was one of my favorite Saturday morning tv shows so of course I love my dvd set; I just wish they'd release the rest of the seasons for us to buy as well.\nReview Title: Watched on TV\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Cain'], 'Producers': ['Jerry Weintraub'], 'Starring': ['George Strait', 'Lesley Ann Warren', 'Isabel Glasser'], 'Studio': ['Warner Bros.']}\nLoved the movie Pure Country.  The music was wonderful and of course I love George Strait, but all in all it was a good story.\nLovin' George Strait\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nCouldn't wait for this to get here and I wasn't disappointed.  Love It and I really can't wait to order some more of my favorite old shows.\nLove My Old TV Shows\nThe New Adventures Of Robin Hood (S1) (4 Disc)\nFred  Weintraub  (Director),     Tom  Kuhn  (Director),     Matthew Poretta  (Actor),     Anna Galvin  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['An outlaw of Sherwood Forest and his partners, Marion, Friar Tuck and Little John, use magic, sorcery and courage to fight royal soldiers, evil Knights and whoever else tries to oppress the impoverished people of 12th Century England.']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'NTSC, Full Screen', 'Contributor': 'Fred  Weintraub, Matthew Poretta, Richard Ashton, Martyn Ellis, Anna Galvin, Tom  Kuhn', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Fred  Weintraub, Tom  Kuhn', 'Media Format': 'NTSC, Full Screen', 'Run time': '20 hours and 10 minutes', 'Release date': 'July 23, 2010', 'Actors': 'Matthew Poretta, Anna Galvin, Richard Ashton, Martyn Ellis', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '4'}\nThis was one of my favorite Saturday morning tv shows so of course I love my dvd set; I just wish they'd release the rest of the seasons for us to buy as well.\nWatched on TV",
  "profile": "**User Profile Summary:**\n\n- **Music Preference:** Strong affinity for country music, particularly favoring George Strait. \n- **Content Appreciation:** Enjoys films and television series that feature solid narratives and engaging music; expresses enthusiasm for classic and nostalgic TV shows, reflecting a fondness for past favorites.\n- **Cinematic Taste:** Demonstrates a preference for quality productions with notable directors and actors, often gravitating towards heartwarming, character-driven stories with romantic and adventurous themes.\n- **Reviewing Style:** Typically provides consistent, positive feedback, reflecting genuine enjoyment; high ratings signify strong satisfaction.\n- **Genre Preference:** Inclined towards narrative-rich films and series within the mystery, action-adventure, and romantic comedy genres, underlining a love for character relationships and emotional depth.\n- **Language Accessibility:** Values content accessibility through the use of audio descriptions and closed captions; enjoys subtitles, especially for older shows.\n- **Nostalgic Affinity:** Recently highlighted a nostalgic connection to favorite childhood shows, indicating a desire for comprehensive collections and the enjoyment of beloved past narratives.\n\nThe user's interests intersect a consistent appreciation for story-centric content across various media forms, blending nostalgia with an unwavering commitment to quality storytelling and the exploration of beloved character dynamics.",
  "metrics": {
    "rouge1_f": 0.150390625,
    "rouge2_f": 0.011741682974559686,
    "rougeL_f": 0.072265625,
    "meteor": 0.04974905344721317,
    "bleu1": 0.006664430324863778,
    "bleu2": 0.001784702657931403,
    "bleu3": 0.0002942365504367349,
    "bleu4": 0.0001195911141347936,
    "bertscore_precision": 0.35143035650253296,
    "bertscore_recall": 0.4656985402107239,
    "bertscore_f1": 0.4005747437477112
  }
}