{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Munsters: Two-Movie Fright Fest - (Franchise Collection) - (Munster, Go Home! & The Munsters' Revenge)\nReview Date: 2013/10/24\nStore: Fred Gwynne  (Actor),     Yvonne De Carlo  (Actor),     Don Weis  (Director),     Earl Bellamy  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'America\\'s first family of fright lives on in The Munsters: Two-Movie Fright Fest! Following their wildly popular TV series, original cast members Fred Gwynne (Herman Munster), Yvonne De Carlo (Lily Munster), and Al Lewis (Grandpa) are reunited in two hilarious movies as you\\'ve never seen them before—in color! Munster, Go Home!: The laughs begin when Herman moves the family to an English estate he inherited. The Munsters\\' Revenge: Dr. Diablo (Sid Caesar) concocts a plan to create robot \"Munsters\" to pull off a series of art heists.', 'Amazon.com', \"There aren't many funny, pre-\", 'Pufnstuf', \"era monster movies suitable for the family, until one remembers the Munsters, who beyond their two-season television stint, made two feature films, albeit fifteen years apart. Both filmed in Technicolor, the vibrance of the Munsters' spooky lifestyle is most apparent in\", 'Munsters, Go Home', '(1966), far superior to the cornier', \"Munsters' Revenge\", \". A true '60s relic,\", 'Munsters, Go Home', \"begins when Herman's deceased relative bestows him with Lord status, necessitating the Munsters' trip to England to claim his title. There, he meets other Munsters, Lady Effigy and Freddie Munster, whose jealousy results in frightening antics that only thrill Herman, Grandpa, Lily, Eddie, and Marilyn (with Pat Priest replaced by Debbie Watson). As the plot thickens, Herman faces other threats to the family honor with his classic innocent bravado. In\", \"Munsters' Revenge\", \", a wax museum criminal circuit sends Munsters' imposters out to commit crimes, so it's up to the real family to solve the mystery. Different Eddies and Marilyns slightly spoil the family reunion's ambience, though ample physical comedy--for example when Herman's bee sting causes him to destroy the police precinct where he's being held as a criminal suspect--makes the film authentic to its original characters. Moreover, watching this double feature is an inspiring reminder of what props used to look like, like George Barris's Munster Koach, not to mention those that grace the entire Munster Mansion.\", '--Trinie Dalton']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Bob Mosher, K.C. Martel, Jo McDonnell, Richard Dawson, Butch Patrick, Debbie Watson, John Carradine, Don Weis, Al Lewis, George Tibbles, Fred Gwynne, Sid Caesar, Yvonne De Carlo, Earl Bellamy, Joe ConnellyBob Mosher, K.C. Martel, Jo McDonnell, Richard Dawson, Butch Patrick, Debbie Watson, John Carradine, Don Weis, Al Lewis, George Tibbles, Fred Gwynne, Sid Caesar, Yvonne De Carlo, Earl Bellamy, Joe Connelly  See more', 'Initial release date': '2006-09-26', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.48 x 5.31 x 0.67 inches; 0.01 Ounces', 'Director': 'Don Weis, Earl Bellamy', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 14 minutes', 'Release date': 'September 26, 2006', 'Actors': 'Fred Gwynne, Yvonne De Carlo, Al Lewis, K.C. Martel, Butch Patrick', 'Subtitles': 'English, French', 'Producers': 'Joe Connelly, Bob Mosher', 'Studio': 'Studio Distribution Services', 'Writers': 'Joe Connelly, Bob Mosher, George Tibbles', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The original movie Munster Go Home was great.  I loved it as a kid and I love it now.  The follow-up movie Munsters Revenge was just marginal at best, but since it came as a set at such a good price, it was well worth the $$$ I spent.\nReview Title: Original=10 Follow-up=5\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Cain'], 'Producers': ['Jerry Weintraub'], 'Starring': ['George Strait', 'Lesley Ann Warren', 'Isabel Glasser'], 'Studio': ['Warner Bros.']}\nLoved the movie Pure Country.  The music was wonderful and of course I love George Strait, but all in all it was a good story.\nLovin' George Strait\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nCouldn't wait for this to get here and I wasn't disappointed.  Love It and I really can't wait to order some more of my favorite old shows.\nLove My Old TV Shows\nThe New Adventures Of Robin Hood (S1) (4 Disc)\nFred  Weintraub  (Director),     Tom  Kuhn  (Director),     Matthew Poretta  (Actor),     Anna Galvin  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['An outlaw of Sherwood Forest and his partners, Marion, Friar Tuck and Little John, use magic, sorcery and courage to fight royal soldiers, evil Knights and whoever else tries to oppress the impoverished people of 12th Century England.']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'NTSC, Full Screen', 'Contributor': 'Fred  Weintraub, Matthew Poretta, Richard Ashton, Martyn Ellis, Anna Galvin, Tom  Kuhn', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Fred  Weintraub, Tom  Kuhn', 'Media Format': 'NTSC, Full Screen', 'Run time': '20 hours and 10 minutes', 'Release date': 'July 23, 2010', 'Actors': 'Matthew Poretta, Anna Galvin, Richard Ashton, Martyn Ellis', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '4'}\nThis was one of my favorite Saturday morning tv shows so of course I love my dvd set; I just wish they'd release the rest of the seasons for us to buy as well.\nWatched on TV\nCourageous\nAlex Kendrick  (Actor, Director),     Ken Bevel  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Four men, one calling: To serve and protect. As law enforcement officers, they are confident and focused, standing up to the worst the streets can offer. Yet at the end of the day, they face a challenge they’re ill prepared to tackle: fatherhood. When tragedy strikes home, these men are left wrestling with their hopes, their fears, their faith, and their fathering. Sherwood Pictures, creators of', 'Fireproof', ', returns with this heartfelt, action-packed story. Protecting the streets is second nature to these law enforcement officers. Raising their children in a God-honoring way? That takes courage. Starring: Alex Kendrick, Kevin Downes, Ken Bevel, Robert Amaya, Ben Davies Director: Alex Kendrick Producer: Stephen Kendrick', 'Amazon.com', 'What is the true mark of a man? The male stars of the moving sleeper hit', 'Courageous', \"are all sheriff's deputies in a small Georgia town, putting their lives on the line every day. Yet as\", 'Courageous', \"deftly shows, the true measure of a man's courage and heart lies in the daily choices he makes, especially as a husband and father.\", 'Courageous', 'is a film that examines faith, commitment, and the preciousness of life. If that sounds simplistic,', 'Courageous', ', made by the same filmmakers who made the Christian film', 'Fireproof', 'and others, is in fact mostly nuanced, sophisticated, and very well acted. Directed by Alex Kendrick, who also cowrote the screenplay with his brother Stephen, and who costars as well,', 'Courageous', 'blends believable action scenes and drama with just enough comedy to keep things from being ponderous. The opening sequence, in fact, is one of the best car-chase scenes in recent film memory--and the \"reveal\" at its conclusion will bring tears to viewers\\' eyes. In fact,', 'Courageous', 'is a weeper of a film, but only because its message is so true and deeply felt. Each of the four deputies--played by Alex Kendrick, Ken Bevel, Kevin Downes, and Ben Davies--wrestles with choices big and small, and finds his faith tested in the darkest of times.', 'Courageous', 'is an excellent faith-based film suitable for teens and older (there\\'s a death in the film that may be disturbing to very young viewers, though it\\'s handled off-screen). The Blu-ray disc contains lots of extras, including a thoughtful commentary with Alex and Stephen Kendrick, a making-of featurette that\\'s as inspiring as the film, outtakes, and a hilarious short called \"', 'Courageous', 'in 60 Seconds\" that underscores that the filmmakers have an all-important sense of humor. Anyone seeking a quality faith-based film experience will be enormously moved by the heart of', 'Courageous', '. --', 'A.T. Hurley']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': '043396388338', 'Director': 'Alex Kendrick', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, Closed-captioned, NTSC, AC-3', 'Run time': '2 hours and 9 minutes', 'Release date': 'January 17, 2012', 'Actors': 'Alex Kendrick, Ken Bevel, Kevin Downes, Renee Jewell, Rusty Martin', 'Subtitles': 'Thai, Spanish, English, Korean, Chinese', 'Producers': 'Stephen Kendrick', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is the best movie ever.  It's a great plot line and it gives you a full range of emotions to experience from beginning to end.\nBest Movie Ever\nThe Closer: Season 1\nKyra Sedgwick  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'Closer, The: The Complete First Season (DVD)', 'Meet Deputy Police Chief Brenda Leigh Johnson, the quirky, no-nonsense boss of the elite Priority Homicide Division of the Los Angeles Police Department, played to perfection by Golden Globe winner and Emmy® nominee Kyra Sedgwick. Brought from Atlanta to head up this special unit that handles sensitive, high-profile murder cases, Brenda has world-class interrogation skills, often matching a criminal’s lie with one of her own in order to obtain a confession. Her offbeat attitude and hard-nosed approach can rub her colleagues the wrong way, as does the fact that she is a tough-minded Southern woman in a department dominated by men. The series also stars J.K. Simmons (Juno, Spider-Man films), Corey Reynolds (The Terminal), Robert Gossett (Arlington Road), G.W. Bailey (Police Academy films), Tony Denison (Prison Break) and Jon Tenney (Looking for Comedy in the Muslim World). Catch the critically acclaimed series from the start.', ']]>', 'Amazon.com', 'Deputy Police Chief Brenda Johnson (Kyra Sedgwick,', 'Personal Velocity', \") isn't about making friends, she's about getting results. Days after her transfer from Atlanta, the LAPD's Priority Homicide Division decides they can't work with the blunt-talking Southern belle. Fortunately, she has former CIA colleague, Assistant Police Chief Will Pope (J.K. Simmons,\", 'Spider-Man', '), on her side. As he explains to Captain Taylor (Robert Gossett), who she has just replaced, \"She is not miss congeniality...but she\\'s a closer.\" Set to the sound of urban blues, TNT\\'s', 'The Closer', 'is', 'Columbo', 'by way of', 'Prime Suspect', \". In other words, Johnson may be as messy as Oscar Madison, but she's as sharp as Sherlock Holmes. Throughout the first season, she'll solve 13 murders, including those of a reclusive mathematician, a Russian prostitute, and a British butler. She won't get much support from her colleagues, except for Sergeant David Gabriel (Corey Reynolds, Broadway\\x92s\", 'Hairspray', ')--to the consternation of his co-workers, like Detective Lieutenants Provenza (G.W. Bailey,', 'M*A*S*H', ') and Flynn (Tony Denison,', 'Melrose Place', '). Johnson also has a friend in FBI Special Agent Fritz Howard (Jon Tenney,', 'You Can Count on Me', '). With his help, she\\'ll eventually settle into her new environment, especially when she lands a house and a cat on the same day (conveniently left behind by a victim). Just as it takes awhile for the chief to grow on her squad--and to get used to driving in LA--Sedgwick\\'s Golden Globe-nominated performance follows a similar trajectory. Fortunately, \"Scarlett O\\'Hara,\" as the droll Provenza dubs her, becomes more fully-rounded as the season progresses, aided by a superb SAG Award-nominated ensemble cast. Consulting producer on', 'The Closer', 'is former LA District Attorney Gil Garcetti of O.J. infamy.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Drama/Love & Romance, Mystery & Suspense/Crime, Mystery & Suspense/Crime/Cops, Action & AdventureDrama, Drama/Love & Romance, Mystery & Suspense/Crime, Mystery & Suspense/Crime/Cops, Action & Adventure  See more', 'Format': 'Multiple Formats, Box set, Color, Subtitled, Full Screen, NTSC', 'Contributor': 'Kyra Sedgwick', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 7.2 Ounces', 'Item model number': '2211087', 'Media Format': 'Multiple Formats, Box set, Color, Subtitled, Full Screen, NTSC', 'Run time': '10 hours and 2 minutes', 'Release date': 'May 29, 2007', 'Actors': 'Kyra Sedgwick', 'Subtitles': 'Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '4'}\nI loved this show and if you liked it too, then you most definitely need to buy these.  I can't wait till I get the complete series.\nYAY Kyra Sedgewick\nThe Munsters: Two-Movie Fright Fest - (Franchise Collection) - (Munster, Go Home! & The Munsters' Revenge)\nFred Gwynne  (Actor),     Yvonne De Carlo  (Actor),     Don Weis  (Director),     Earl Bellamy  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'America\\'s first family of fright lives on in The Munsters: Two-Movie Fright Fest! Following their wildly popular TV series, original cast members Fred Gwynne (Herman Munster), Yvonne De Carlo (Lily Munster), and Al Lewis (Grandpa) are reunited in two hilarious movies as you\\'ve never seen them before—in color! Munster, Go Home!: The laughs begin when Herman moves the family to an English estate he inherited. The Munsters\\' Revenge: Dr. Diablo (Sid Caesar) concocts a plan to create robot \"Munsters\" to pull off a series of art heists.', 'Amazon.com', \"There aren't many funny, pre-\", 'Pufnstuf', \"era monster movies suitable for the family, until one remembers the Munsters, who beyond their two-season television stint, made two feature films, albeit fifteen years apart. Both filmed in Technicolor, the vibrance of the Munsters' spooky lifestyle is most apparent in\", 'Munsters, Go Home', '(1966), far superior to the cornier', \"Munsters' Revenge\", \". A true '60s relic,\", 'Munsters, Go Home', \"begins when Herman's deceased relative bestows him with Lord status, necessitating the Munsters' trip to England to claim his title. There, he meets other Munsters, Lady Effigy and Freddie Munster, whose jealousy results in frightening antics that only thrill Herman, Grandpa, Lily, Eddie, and Marilyn (with Pat Priest replaced by Debbie Watson). As the plot thickens, Herman faces other threats to the family honor with his classic innocent bravado. In\", \"Munsters' Revenge\", \", a wax museum criminal circuit sends Munsters' imposters out to commit crimes, so it's up to the real family to solve the mystery. Different Eddies and Marilyns slightly spoil the family reunion's ambience, though ample physical comedy--for example when Herman's bee sting causes him to destroy the police precinct where he's being held as a criminal suspect--makes the film authentic to its original characters. Moreover, watching this double feature is an inspiring reminder of what props used to look like, like George Barris's Munster Koach, not to mention those that grace the entire Munster Mansion.\", '--Trinie Dalton']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Bob Mosher, K.C. Martel, Jo McDonnell, Richard Dawson, Butch Patrick, Debbie Watson, John Carradine, Don Weis, Al Lewis, George Tibbles, Fred Gwynne, Sid Caesar, Yvonne De Carlo, Earl Bellamy, Joe ConnellyBob Mosher, K.C. Martel, Jo McDonnell, Richard Dawson, Butch Patrick, Debbie Watson, John Carradine, Don Weis, Al Lewis, George Tibbles, Fred Gwynne, Sid Caesar, Yvonne De Carlo, Earl Bellamy, Joe Connelly  See more', 'Initial release date': '2006-09-26', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.48 x 5.31 x 0.67 inches; 0.01 Ounces', 'Director': 'Don Weis, Earl Bellamy', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 14 minutes', 'Release date': 'September 26, 2006', 'Actors': 'Fred Gwynne, Yvonne De Carlo, Al Lewis, K.C. Martel, Butch Patrick', 'Subtitles': 'English, French', 'Producers': 'Joe Connelly, Bob Mosher', 'Studio': 'Studio Distribution Services', 'Writers': 'Joe Connelly, Bob Mosher, George Tibbles', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe original movie Munster Go Home was great.  I loved it as a kid and I love it now.  The follow-up movie Munsters Revenge was just marginal at best, but since it came as a set at such a good price, it was well worth the $$$ I spent.\nOriginal=10 Follow-up=5",
  "profile": "**Updated User Profile Summary:**\n\n- **Music Preference:** Maintains a strong affinity for country music, particularly favoring George Strait.\n- **Content Appreciation:** Enjoys films and television series with solid narratives and engaging music; has a fondness for classic and nostalgic shows from childhood, seeking comprehensive collections of beloved past narratives.\n- **Cinematic Taste:** Prefers quality productions featuring notable directors and actors, gravitating towards heartwarming, character-driven stories that explore themes of commitment and courage, often within the comedy genre.\n- **Genre Preference:** Inclined towards narrative-rich films and series in drama, comedy, mystery, action-adventure, and romantic comedy genres, emphasizing character relationships and emotional depth.\n- **Reviewing Style:** Provides consistent, positive feedback with high ratings, reflecting strong satisfaction. Recent reviews demonstrate deep emotional engagement with content, appreciating character-driven narratives and quality storytelling.\n- **Language Accessibility:** Values accessibility features like audio descriptions and closed captions; enjoys subtitles, particularly for older shows.\n- **Nostalgic Affinity:** Recently highlighted nostalgia for favorite shows, actively seeking content that evokes fond childhood memories, particularly noting her affection for the character dynamics and humor within classic sitcoms. \n\nThe user's interests reflect a blend of nostalgia and a commitment to quality storytelling and character exploration across various media.",
  "metrics": {
    "rouge1_f": 0.06629834254143646,
    "rouge2_f": 0.006219765031098825,
    "rougeL_f": 0.03798342541436465,
    "meteor": 0.020265608830631252,
    "bleu1": 5.491444851843422e-07,
    "bleu2": 1.6664698730173238e-07,
    "bleu3": 2.4157532132718396e-08,
    "bleu4": 9.206515982728488e-09,
    "bertscore_precision": 0.35493290424346924,
    "bertscore_recall": 0.5054306387901306,
    "bertscore_f1": 0.41701897978782654
  }
}