{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/05/30\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Kim Manners', 'Rob Bowman', 'David Nutter', 'Chris Carter', 'R.W. Goodwin', 'Tony Wharmby', 'Michael W. Watkins', 'Daniel Sackheim', 'Michael Lange', 'James Wong'], 'Studio': ['FOX']}\nReview Text: The x files were so cool.  And I heard they are going to made another season this year 2015.  I don't see how that could happen without cancer man.\nReview Title: how that could happen\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Terminator Salvation (Two-Disc Director's Cut) [Blu-ray]\nChristian Bale  (Actor),     Sam Worthington  (Actor),     McG  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', 'Terminator Salvation (Blu-ray)', 'In the highly anticipated new installment of The Terminator film franchise, set in post-apocalyptic 2018, Christian Bale stars as John Connor, the man fated to lead the human resistance against Skynet and its army of Terminators. But the future Connor was raised to believe in is altered in part by the appearance of Marcus Wright (Sam Worthington), a stranger whose last memory is of being on death row. Connor must decide whether Marcus has been sent from the future, or rescued from the past. As Skynet prepares its final onslaught, Connor and Marcus both embark on an odyssey that takes them into the heart of Skynets operations, where they uncover the terrible secret behind the possible annihilation of mankind.', ']]>', 'Amazon.com', 'Terminator Salvation', \"restores some of the balance of huge freakin' explosions and emotionally compelling plot to the\", 'Terminator', 'series. Set entirely after the nuclear assault that left the computer system Skynet in control of the world,', 'Terminator Salvation', \"follows John Connor (Christian Bale) as he grapples with both murderous robots and his superiors in the resistance, who aren't sure they believe the prophecies that Connor is destined to save humanity. Into the midst of this struggle tumbles Marcus Wright (Sam Worthington, who would later star in James Cameron's\", 'Avatar', '); the last thing he remembers was being executed in prison decades before. Baffled, he falls into company with Kyle Reese (Anton Yelchin,', 'Star Trek', ') and a mute little girl, who soon get captured--but Wright then meets and bonds with Blair Williams (Moon Bloodgood,', 'Eight Below', \"), a resistance fighter who remains loyal to the confused Wright even though Connor suspects he's not what he seems--or what he believes himself to be.\", 'Terminator Salvation', \"isn't the astonishing synthesis of action and feeling that either\", 'The Terminator', 'or', 'T2', 'were; the plot threads are poorly woven and fray completely in the last third of the movie. Despite this,', 'Terminator Salvation', \"has at least two skillfully orchestrated action sequences that will get your heart racing, and Worthington’s beguiling mixture of toughness and vulnerability gives his relationship with Bloodgood a genuine pulse. It's imperfect, but compared with the hollow carcasses that most action movies (including\", 'Terminator 3', \") turn out to be, it's worth seeing.\", '--Bret Fetzer', 'On the Blu-ray disc', \"The director's cut is a mere three minutes longer than the theatrical cut. Many of these additions are just a few seconds of extra violence (e.g., a knife thrust into a body then pulled out), but there are a few more-substantial sequences: A longer conversation in Resistance Command Headquarters; a brief topless scene by Moon Bloodgood when her Blair Williams character and Sam Worthington's Marcus return to her base (reminiscent of Kelly McGillis and Harrison Ford in\", 'Witness', '); an extended conversation between those two characters afterward (Blair: \"You can focus on what you\\'ve lost or you can fight for what\\'s left\"); and a longer radio address by John Connor in which he mentions his mother. Even though it\\'s not all that different, it should be the preferred way to watch the movie.', 'The big extra feature, Maximum Movie Mode, is only on disc 2\\'s original theatrical cut. In front of two large TV screens, director McG introduces the movie then makes periodic appearances to discuss key concepts. Interspersed along the way are various pop-ups with the Terminator mythology timeline, picture-in-picture with cast and crew interviews and behind-the-scenes footage, and stills galleries. You can also, when prompted, exit out of the movie to watch any of 11 Focus Points, which are two- to three-minute featurettes. Conveniently, you can also access these from the main menu. Two other features are watchable separate from Maximum Movie Mode: \"Reforging the Future\" (19 minutes), discussing the new film\\'s take on the Terminator legacy, and \"The Moto-Terminator\" (8:33), focusing on the motorcycle-like robots.', '--David Horiuchi']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': \"Multiple Formats, Blu-ray, Color, Widescreen, Dubbed, Subtitled, Director's Cut\", 'Contributor': 'McG, Christian Bale, Anton Yelchin, Helena Bonham Carter, Jane Alexander, Moon Bloodgood, Bryce Dallas Howard, Sam Worthington, CommonMcG, Christian Bale, Anton Yelchin, Helena Bonham Carter, Jane Alexander, Moon Bloodgood, Bryce Dallas Howard, Sam Worthington, Common   See more', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7 x 5.5 x 0.5 inches; 3.52 Ounces', 'Director': 'McG', 'Media Format': \"Multiple Formats, Blu-ray, Color, Widescreen, Dubbed, Subtitled, Director's Cut\", 'Run time': '1 hour and 57 minutes', 'Release date': 'December 1, 2009', 'Actors': 'Christian Bale, Sam Worthington, Anton Yelchin, Moon Bloodgood, Helena Bonham Carter', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Home Video', 'Number of discs': '2'}\nThe movie is not what I have come to expect from a terminator movie.  I think that all the Terminator movies had a story line that was pretty plausible for an everyday event that could happen.  That coupled along with some points along the way that can only be overcome with some major action.  I guess without Arnold Schwarzenegger I should have already known there would not be much good action.<br /> The entire movie is all about the big `Time Paradox' that brings the `John Conner' guy into existence.  How he sent his father back to his mom.  And if he doesn't do this then he will not `be'.  Arnold does make a walk on appearance toward the end but it is really nothing.  I guess I watched it so I can join in the conversation whenever this title is up for discussion.  Just don't expect any action.  It's not a `fun' kill em' all kind of film; but rather a complex theoretical kind of head trip.\nWhat a let down!!\n{'Subtitles': ['None available'], 'Directors': ['Tony Tilse', 'Rowan Woods', 'Andrew Prowse', 'Ian Watson', 'Peter Andrikidis', 'Geoff Bennett', 'Catherine Millar', 'Pino Amenta', 'Ian Barry', 'Brian Henson'], 'Studio': ['New Video']}\nJust the, idea, alone, of trying to make a sci-fi fiction about a space adventure. You already have almost insurmountable odds against you. Your show will have to compete against the likes of Star Trek (Voyager, next generation, deep space nine, and also the original), and Dr. who also. But I think this far scape does do a good job. To even try such a task takes a lot of Gaul.<br /><br />Although, my account does not show that I have watched the entire first season, I have. I watch it on the other television, with somebody else's account. We went through the first season, so far. And I will continue to watch the, rest. It's already got my interest, that I have to see what happens to this guy. The way I remember it, the last time I checked, there is only four seasons. So, I do see myself finishing this series out, couple months it will take. And I will enjoy the ride.\na very good story, even though I didn't think, it was possible to revive the space adventure theme, before I seen this\n{'Subtitles': ['None available'], 'Directors': ['Jon Foy'], 'Producers': ['Jon Foy', 'Doug Block', 'Colin Smith', 'Steve Weinik'], 'Starring': ['Justin Duerr', 'Colin Smith', 'Steve Weinik'], 'Studio': ['Land of Missing Pa']}\nWith the world all connected, with the internet and all.  There is not many Mystery s left.  Sure, there are some crimes, but usually the only mystery is (guilty, or not guilty).  But this story shows how there was/is a Mystery left.  With great Patience, and no guarantee of a resolution.  The narrator takes us on the mystery of the Toynbee Tiles.  A great story.\na great mysery\n{'Subtitles': ['None available'], 'Directors': ['George Bloomfield', 'Terry Maskell', 'Eric Till', 'Jim Henson', 'Patrick Villechaize', 'Norman Campbell', 'Perry Rosemond', 'Douglas Williams', 'Les Rose', 'Wayne Moss']}\nHe had a blessing, for sure, when it came to making an exciting and enjoyable television show.  And each episode has a 'lesson' imbedded in it.  So the 'younger' generation can be happy, while they take away some sort of knowledge.  And each episode of FRAGGLE ROCK has a cute little song, that sort of sticks with you for a day or two.  To re-enforce the lesson.\nJim Henson was the best.\nHouse, M.D.: The Complete Series\nHugh Laurie  (Actor),     Robert Sean Leonard  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Every baffling case. Every brilliant diagnosis. Every brutal insult. They\\'re all here in all eight seasons of House, M.D., the compelling medical drama that critics proclaimed \"one of the smartest and intellectually bravest shows on television\" (Jennifer Arrow, E! Online). Two-time Golden Globe winner Hugh Laurie is Dr. Gregory House, Princeton-Plainsboro Teaching Hospital\\'s Chief of Diagnostic Medicine whose astounding intellect is matched only by his frightening bedside manner. Relive every captivating moment as House and his team of doctors solve complex medical mysteries, push professional boundaries, and face their own demons. Gripping, witty, and intelligent, satisfy your House addiction in this must-own 41-disc collection, featuring all 176 episodes of this Primetime Emmy and Golden Globe-winning television phenomenon.']\n{'Genre': 'House: Season Three, House: Season One, Drama, DVD Movie, House: Season Six, House: Season Five, House: Season Two, Blu-ray Movie, House: Season Eight, House: Season Four, House: Season SevenHouse: Season Three, House: Season One, Drama, DVD Movie, House: Season Six, House: Season Five, House: Season Two, Blu-ray Movie, House: Season Eight, House: Season Four, House: Season Seven   See more', 'Format': 'Box set, NTSC, Subtitled, Widescreen', 'Contributor': 'David Morse, Steve Valentine, Lisa Edelstein, Mira Sorvino, Jesse Spencer, Anne Dudek, Hugh Laurie, Robert Sean Leonard, Jennifer Morrison, Peter Jacobson, Kal Penn, Omar Epps, Olivia WildeDavid Morse, Steve Valentine, Lisa Edelstein, Mira Sorvino, Jesse Spencer, Anne Dudek, Hugh Laurie, Robert Sean Leonard, Jennifer Morrison, Peter Jacobson, Kal Penn, Omar Epps, Olivia Wilde   See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '41', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '4.8 x 5.5 x 7.7 inches; 3.2 Pounds', 'Item model number': '26192925', 'Media Format': 'Box set, NTSC, Subtitled, Widescreen', 'Run time': '129 hours and 23 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Hugh Laurie, Robert Sean Leonard, Lisa Edelstein, Omar Epps, Jesse Spencer', 'Subtitles': 'Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '41'}\nAll the episodes, of House Md.  All the shows, in a nice little box.  This show is not available on streaming, as of yet, October 2013.  So really, if you’re interested in the show, this is the best deal I’ve found.  I had already seen all the beginning episodes, but have never seen season 7 and 8 and some of 6.  I still never.  I decided to start at the beginning, and get the entire story.  It provides something to look forward towards.  I watch this while I fold towels, and it makes time just jump by.  House is a cool series.\nnice set\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['---'], 'Producers': ['Mark Johnson', 'Charles Newirth'], 'Starring': ['Tim Allen', 'Sigourney Weaver', 'Alan Rickman'], 'Studio': ['Epix']}\nI only wish, that they would have made a part 2.\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Fawcett', 'David Frazee', 'TJ Scott', 'Brett Sullivan', 'Ken Girotti'], 'Producers': ['John Fawcett', 'David Fortier', 'Ivan Schneeberg', 'Graeme Manson'], 'Starring': ['Tatiana Maslany', 'Jordan Gavaris', 'Maria Doyle Kennedy'], 'Studio': ['BBC America']}\nExcellent.  with no 'filler', material.  That is purposed to 'take up time', so the 'real', conundrum can be addressed on the next episode.  Orphan Black, has none of that.  And, If, you miss an episode, you will, more than not, be confused.<br />And, the action moves fast.  Borderline, on the, too fast.  It's like they took four seasuns, and boiled them down, to end up with two seasons.<br />Wen I watch this, I feel my time was well spent.\nno 'filler', time was well spent\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'David Giuntoli', 'Bitsie Tulloch'], 'Studio': ['NBC']}\nGrimm is awesome.  I don't like most of the series there are now.  When I think about the shows people are talking about I think american idol, family guy, south park.  And I don't find any of those 'sweet'.  But I really enjoyed this.  But don't get me wrong.  You might still like some of those 'other' shows I mentioned.  And you will probably still think Grimm is awesome.  I watched Grimm with a people from all cliques of life and they all liked it.\nGrimm is awesome!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Johnston'], 'Producers': ['Scott Kroopf', 'William Teitler'], 'Starring': ['Frank Welker', 'Robin Williams', 'Kirsten Dunst'], 'Studio': ['TriStar Pictures']}\nThis is just the coolest movie.  I've already seen it 3 times, and I will probably see it 3 more.  Robin Williams was just the best actor.\nso cool\n{'Content advisory': ['Violence', 'frightening scenes', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Kim Manners', 'Rob Bowman', 'David Nutter', 'Chris Carter', 'R.W. Goodwin', 'Tony Wharmby', 'Michael W. Watkins', 'Daniel Sackheim', 'Michael Lange', 'James Wong'], 'Studio': ['FOX']}\nThe x files were so cool.  And I heard they are going to made another season this year 2015.  I don't see how that could happen without cancer man.\nhow that could happen",
  "profile": "**Updated User Profile Summary**\n\n- **Genre Preference**: The user has a strong inclination towards action and adventure, particularly in science fiction with space adventure themes. They appreciate narratives that challenge traditional conventions, value complex mystery storytelling, and show interest in supernatural narratives.\n\n- **Film Expectations**: They prioritize compelling and innovative storylines that integrate action while remaining grounded in plausibility. The user favors tight, focused narratives without excessive filler and is open to fresh interpretations of established themes.\n\n- **Disappointment in Franchise Evolution**: Expresses dissatisfaction with beloved franchises that diverge from core narratives, preferring sequels and continuity that maintain engaging plots and action, particularly noting concerns about character continuity.\n\n- **Character Familiarity**: Demonstrates significant familiarity with popular franchises and iconic characters, often referencing them in discussions, including a deep interest in classic series and their legacies.\n\n- **Analytical Viewpoint**: Approaches films and television critically, focusing on theoretical aspects and prioritizing quality storytelling over mere entertainment.\n\n- **Engagement with Popular Culture**: Shows keen interest in current film discussions and developments within franchises, reflecting a strong desire for social interaction within the film community.\n\n- **Specificity in Format**: Prefers high-quality viewing experiences such as Blu-ray but remains flexible with formats that enable comprehensive storytelling.\n\n- **Appreciation for Educational Elements**: Enjoys narratives incorporating lessons in entertaining formats, enhancing their broader interest in intelligent storytelling and charismatic performances, reinforcing their preference for depth and engagement in storytelling.",
  "metrics": {
    "rouge1_f": 0.08641975308641975,
    "rouge2_f": 0.006177606177606178,
    "rougeL_f": 0.04012345679012346,
    "meteor": 0.025877037890357005,
    "bleu1": 1.0863733949773418e-05,
    "bleu2": 2.857755225605033e-06,
    "bleu3": 9.165691734711895e-07,
    "bleu4": 2.9214790753949006e-07,
    "bertscore_precision": 0.35043424367904663,
    "bertscore_recall": 0.47732120752334595,
    "bertscore_f1": 0.40415242314338684
  }
}