{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/06/15\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Holahan', 'Jack Bender', 'Peter Weller', 'Michael Katleman', 'Steven Kane', 'Sergio Mimica-Gezzan', 'Bill Roe', 'Jonathan Mostow', 'Brad Turner', 'Greg Beeman'], 'Producers': ['Michael Bay', 'Brad Fuller', 'Andrew Form', 'Hank Steinberg', 'Steven Kane', 'Jack Bender'], 'Starring': ['Eric Dane', 'Rhona Mitra', 'Adam Baldwin'], 'Studio': ['TNT']}\nReview Text: good series\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Do You Believe?\nMira Sorvino  (Actor),     Sean Astin  (Actor),     Jonathan M. Gunn  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n[\"A dozen different souls–all moving in different directions, all longing for something more. As their lives unexpectedly intersect, they each are about to discover there is power in the Cross of Christ…even if they don't yet believe it. When a local pastor is shaken to the core by the visible faith of an old street-corner preacher, he is reminded that true belief always requires action. His response ignites a faith-fueled journey that powerfully impacts everyone it touches in ways that only God could orchestrate. More than a movie, it's a question we all must answer in our lifetimes: Do You Believe?Bonus Content:\", 'Interviews', 'Interviews', 'Trailers', 'Trailers']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 4 Ounces', 'Item model number': '392', 'Director': 'Jonathan M. Gunn', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 4 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Mira Sorvino, Sean Astin, Alexa PenaVega, Delroy Lindo, Ted McGinley', 'Subtitles': 'English, Spanish', 'Producers': 'Michael Scott, David A.R. White, Russell Wolfe, Elizabeth Travis, Harold Cronk', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Chuck Konzelman, Cary Solomon', 'Number of discs': '2'}\ngreat movie\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Pat Williams', 'David Frazee', 'William Waring', 'Mike Rohl', 'Amanda Tapping', 'Jon Cassar', 'Simon Barry', 'Paul Shapiro', 'Rachel Talalay'], 'Producers': ['Simon Barry', 'Holly Redford'], 'Starring': ['Rachel Nichols', 'Erik Knudsen', 'Victor Webster'], 'Studio': ['Syfy']}\ndissapointed\nThree Stars\nStone Cold [Blu-ray]\nBrian Bosworth  (Actor),     Lance Henriksen  (Actor),     Craig R. Baxley  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Richard Gant, David Tress, William Forsythe, Evan James, Arabella Holzbog, Brian Bosworth, Sam McMurray, Craig R. Baxley, Tony Pierce, Paulo Tocha, Lance HenriksenRichard Gant, David Tress, William Forsythe, Evan James, Arabella Holzbog, Brian Bosworth, Sam McMurray, Craig R. Baxley, Tony Pierce, Paulo Tocha, Lance Henriksen  See more', 'Language': 'English', 'Runtime': '1 hour and 32 minutes'}\ngood movie\nFive Stars\nHarley Davidson and the Marlboro Man [Blu-ray]\nMickey Rourke  (Actor),     Don Johnson  (Actor),     Simon Wincer  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"Mickey Rourke (The Wrestler, Sin City) and Don Johnson (A Boy and His Dog, TV's Miami Vice) star in this four-lane genre collision of biker movie, heist thriller, buddy flick and sci-fi pic that will take you to the hard-line of action and adventure! Co-starring Tom Sizemore (Natural Born Killers), Chelsea Field (The Last Boy Scout), Tia Carrere (True Lies) and Vanessa Williams (Shaft), this relentlessly explosive action pic just may prove that 'it's better to be dead and cool than alive and uncool.' When their favorite bar is threatened with closure, outlaw biker Harley (Rourke) and modern-day cowboy Marlboro (Johnson) hatch a scheme to save the day - by robbing the corrupt bank behind the bar's shutdown! When the robbery yields not money but a shipment of drugs, Harley and Marlboro find themselves on the run from the bank's sinister president (Sizemore) and a posse of seemingly unstoppable hit men. Now wanted dead or alive, the hard-riding heroes must fight for their very lives and learn that when the going gets tough, the tough take the law into their own hands.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Don Johnson, Mickey Rourke, Simon Wincer, Chelsea Field', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Item model number': '15776', 'Director': 'Simon Wincer', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 19, 2015', 'Actors': 'Mickey Rourke, Don Johnson, Chelsea Field', 'Subtitles': 'English', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nlove this movie\nFive Stars\nHatfields & McCoys [Blu-ray]\nKevin Costner  (Actor, Producer),     Bill Paxton  (Actor),     Kevin Reynolds  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Bonded by their oath to the same flag, two confederate soldiers, “Devil” Anse Hatfield (Kevin Costner) and Randall McCoy (Bill Paxton), return home seeking peace after tireless months of battle. Their expectations are quickly shattered when a murder based on misunderstandings and an illicit love affair trigger warfare between former comrades and their clans. This historic feud teeters on the brink of an all out civil war as friends and neighbors join opposing sides in a rivalry that would ultimately shape American History.']\n{'Genre': 'Drama, History', 'Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Noel Fisher, Hatfield and McCoy Productions, LLC, Matt Barr, Jena Malone, Sarah Parish, Bill Paxton, Sam Reid, Kevin Costner, Jilon VanOver, Darrell Fetty, Boyd Holbrook, Andrew Howard, Mare Winningham, Ronan Vibert, Powers Boothe, Kevin Reynolds, Tom McKay, Joe Absolom, Herb Nanas, Tom Berenger, Lindsay PulsipherNoel Fisher, Hatfield and McCoy Productions, LLC, Matt Barr, Jena Malone, Sarah Parish, Bill Paxton, Sam Reid, Kevin Costner, Jilon VanOver, Darrell Fetty, Boyd Holbrook, Andrew Howard, Mare Winningham, Ronan Vibert, Powers Boothe, Kevin Reynolds, Tom McKay, Joe…   See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '25343070', 'Director': 'Kevin Reynolds', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 50 minutes', 'Release date': 'July 31, 2012', 'Actors': 'Kevin Costner, Bill Paxton, Matt Barr, Tom Berenger, Powers Boothe', 'Subtitles': 'English', 'Producers': 'Kevin Costner, Herb Nanas, Darrell Fetty', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nvery good movie\nFive Stars\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Fisher', 'Constantine Makris', 'Tawnia McKiernan', 'Jack Kenny', 'Stephen Surjik', 'Jace Alexander', 'Vincent Misiano', 'Michael W. Watkins', 'Millicent Shelton', 'Michael McMurray'], 'Starring': ['Eddie McClintock', 'Joanne Kelly', 'Saul Rubinek'], 'Studio': ['Syfy']}\nwas disappointed after watching the first 4 seasons. seemed like there wasn't much to season 5 and had to pay for it. wish I haden't\nwas disappointed after watching the first 4 seasons\nThe Last of the Mohicans: Director’s Definitive Cut [Blu-ray]\nDaniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Academy Award(R) winner Daniel Day-Lewis (Best Actor in 1989 for', 'My Left Foot', ') stars as Hawkeye, rugged frontiersman and adopted son of the Mohicans, and Madeleine Stowe is Cora Munro, aristocratic daughter of a proud British Colonel. Their love, tested by fate, blazes amidst a brutal conflict between the British, the French and Native American allies that engulfs the majestic mountains and cathedral-like forests of Colonial America.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD)', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2265788', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Subtitles': 'French, English, Spanish', 'Producers': 'Michael Mann, Hunt Lowry, Mark Mann, Ned Dowd', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat movie\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Bill Eagles', 'M.J. Bassett', 'Paul Wilmshurst', 'Daniel Percival', 'Julian Holmes', 'Brendan Maher', 'Edward Hall', 'Alex Holmes', 'Stephen Woolfenden', 'Mark Everest'], 'Starring': ['Philip Winchester', 'Sullivan Stapleton', 'Rhona Mitra']}\nloved all 3 seasons\nFive Stars\nHeat [Blu-ray]\nTom Sizemore  (Actor),     Diane Venora  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Wave after wave of excitement comes your way in this nitro-meets-glycerin thriller about an obsessed, cool-fire criminal mastermind and the flashfire L.A. cop equally driven to stop him.']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, Widescreen', 'Contributor': \"Mykelti Williamson, Daniel O'Haco, Kevin Gage, Robert De Niro, Art Linson, Steven Ford, Jon Voight, Bill McIntosh, Michael Mann, Patricia Healy, Natalie Portman, Mario Roberts, Hazelle Goodman, William Fichtner, Jeremy Piven, Hank Azaria, Brian Libby, Tone-Loc, Diane Venora, Amy Brenneman, Jerry Trimble, Dennis Haysbert, Val Kilmer, Henry Rollins, Niki Harris, Kai Soremekun, Ray Buktenica, Dan Martin, Kim Staunton, Al Pacino, Rick Marzan, Terry Miller, Paul Herman, Begonia Plaza, Farrah Forke, Xander Berkeley, Tom Sizemore, Tom Noonan, Ashley Judd, Martin Ferrero, Thomas Rosales Jr., Kimberly Flynn, Wes Studi, Danny Trejo, Susan Traylor, Rick Avery, Ted Levine, Kenny EndosoMykelti Williamson, Daniel O'Haco, Kevin Gage, Robert De Niro, Art Linson, Steven Ford, Jon Voight, Bill McIntosh, Michael Mann, Patricia Healy, Natalie Portman, Mario Roberts, Hazelle Goodman, William Fichtner, Jeremy Piven, Hank Azaria, Brian Libby, Tone-Loc, Diane Venor…   See more\", 'Language': 'English', 'Runtime': '2 hours and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '34298872', 'Director': 'Michael Mann', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '2 hours and 51 minutes', 'Release date': 'August 11, 2015', 'Actors': 'Tom Sizemore, Diane Venora, Jon Voight, Al Pacino, Robert De Niro', 'Producers': 'Michael Mann, Art Linson', 'Studio': 'New Regency', 'Number of discs': '1'}\ngreat movie\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Holahan', 'Jack Bender', 'Peter Weller', 'Michael Katleman', 'Steven Kane', 'Sergio Mimica-Gezzan', 'Bill Roe', 'Jonathan Mostow', 'Brad Turner', 'Greg Beeman'], 'Producers': ['Michael Bay', 'Brad Fuller', 'Andrew Form', 'Hank Steinberg', 'Steven Kane', 'Jack Bender'], 'Starring': ['Eric Dane', 'Rhona Mitra', 'Adam Baldwin'], 'Studio': ['TNT']}\ngood series\nFour Stars",
  "profile": "The user continues to exhibit a robust passion for faith-based films, focusing on belief, personal transformation, and the strength of faith. Recently, they've branched out into diverse cinematic experiences, maintaining their pursuit of quality storytelling across genres, despite some disappointment with a longstanding series. Their exploration of highly-rated action films and acclaimed historical dramas reflects their commitment to compelling narratives.\n\nTheir latest purchase aligns with their enthusiasm for exceptional viewing experiences, favoring Blu-ray formats that enhance cinematic enjoyment. This selection highlights their appreciation for ensemble casts and intricate storylines, underscoring their dedication to meaningful storytelling. The user maintains a balance between spiritual themes and emotionally resonant films, often delving into love, conflict, and resilience.\n\nThe user's selective approach to genre exploration demonstrates a commitment to cinema that merges quality with depth, continually seeking impactful stories. Their recent purchase indicates a newfound interest in series that may have previously been overlooked, suggesting a willingness to engage with narrative forms they find enjoyable, regardless of prior sentiments. Overall, the user’s evolving cinematic journey emphasizes a sophisticated understanding of storytelling, as they navigate a landscape filled with narratives that reflect personal growth while incorporating thrilling and engaging elements.",
  "metrics": {
    "rouge1_f": 0.07784718885151369,
    "rouge2_f": 0.001924001924001924,
    "rougeL_f": 0.03844305622296972,
    "meteor": 0.023191154722009007,
    "bleu1": 2.2251801081111275e-06,
    "bleu2": 6.900714731626476e-07,
    "bleu3": 1.0438549846235301e-07,
    "bleu4": 4.064465036933959e-08,
    "bertscore_precision": 0.3031831979751587,
    "bertscore_recall": 0.4765470623970032,
    "bertscore_f1": 0.3705924153327942
  }
}