{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/06/15\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Fisher', 'Constantine Makris', 'Tawnia McKiernan', 'Jack Kenny', 'Stephen Surjik', 'Jace Alexander', 'Vincent Misiano', 'Michael W. Watkins', 'Millicent Shelton', 'Michael McMurray'], 'Starring': ['Eddie McClintock', 'Joanne Kelly', 'Saul Rubinek'], 'Studio': ['Syfy']}\nReview Text: was disappointed after watching the first 4 seasons. seemed like there wasn't much to season 5 and had to pay for it. wish I haden't\nReview Title: was disappointed after watching the first 4 seasons\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Do You Believe?\nMira Sorvino  (Actor),     Sean Astin  (Actor),     Jonathan M. Gunn  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n[\"A dozen different souls–all moving in different directions, all longing for something more. As their lives unexpectedly intersect, they each are about to discover there is power in the Cross of Christ…even if they don't yet believe it. When a local pastor is shaken to the core by the visible faith of an old street-corner preacher, he is reminded that true belief always requires action. His response ignites a faith-fueled journey that powerfully impacts everyone it touches in ways that only God could orchestrate. More than a movie, it's a question we all must answer in our lifetimes: Do You Believe?Bonus Content:\", 'Interviews', 'Interviews', 'Trailers', 'Trailers']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 4 Ounces', 'Item model number': '392', 'Director': 'Jonathan M. Gunn', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 4 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Mira Sorvino, Sean Astin, Alexa PenaVega, Delroy Lindo, Ted McGinley', 'Subtitles': 'English, Spanish', 'Producers': 'Michael Scott, David A.R. White, Russell Wolfe, Elizabeth Travis, Harold Cronk', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Chuck Konzelman, Cary Solomon', 'Number of discs': '2'}\ngreat movie\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Pat Williams', 'David Frazee', 'William Waring', 'Mike Rohl', 'Amanda Tapping', 'Jon Cassar', 'Simon Barry', 'Paul Shapiro', 'Rachel Talalay'], 'Producers': ['Simon Barry', 'Holly Redford'], 'Starring': ['Rachel Nichols', 'Erik Knudsen', 'Victor Webster'], 'Studio': ['Syfy']}\ndissapointed\nThree Stars\nStone Cold [Blu-ray]\nBrian Bosworth  (Actor),     Lance Henriksen  (Actor),     Craig R. Baxley  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Richard Gant, David Tress, William Forsythe, Evan James, Arabella Holzbog, Brian Bosworth, Sam McMurray, Craig R. Baxley, Tony Pierce, Paulo Tocha, Lance HenriksenRichard Gant, David Tress, William Forsythe, Evan James, Arabella Holzbog, Brian Bosworth, Sam McMurray, Craig R. Baxley, Tony Pierce, Paulo Tocha, Lance Henriksen  See more', 'Language': 'English', 'Runtime': '1 hour and 32 minutes'}\ngood movie\nFive Stars\nHarley Davidson and the Marlboro Man [Blu-ray]\nMickey Rourke  (Actor),     Don Johnson  (Actor),     Simon Wincer  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"Mickey Rourke (The Wrestler, Sin City) and Don Johnson (A Boy and His Dog, TV's Miami Vice) star in this four-lane genre collision of biker movie, heist thriller, buddy flick and sci-fi pic that will take you to the hard-line of action and adventure! Co-starring Tom Sizemore (Natural Born Killers), Chelsea Field (The Last Boy Scout), Tia Carrere (True Lies) and Vanessa Williams (Shaft), this relentlessly explosive action pic just may prove that 'it's better to be dead and cool than alive and uncool.' When their favorite bar is threatened with closure, outlaw biker Harley (Rourke) and modern-day cowboy Marlboro (Johnson) hatch a scheme to save the day - by robbing the corrupt bank behind the bar's shutdown! When the robbery yields not money but a shipment of drugs, Harley and Marlboro find themselves on the run from the bank's sinister president (Sizemore) and a posse of seemingly unstoppable hit men. Now wanted dead or alive, the hard-riding heroes must fight for their very lives and learn that when the going gets tough, the tough take the law into their own hands.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Don Johnson, Mickey Rourke, Simon Wincer, Chelsea Field', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Item model number': '15776', 'Director': 'Simon Wincer', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 19, 2015', 'Actors': 'Mickey Rourke, Don Johnson, Chelsea Field', 'Subtitles': 'English', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nlove this movie\nFive Stars\nHatfields & McCoys [Blu-ray]\nKevin Costner  (Actor, Producer),     Bill Paxton  (Actor),     Kevin Reynolds  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Bonded by their oath to the same flag, two confederate soldiers, “Devil” Anse Hatfield (Kevin Costner) and Randall McCoy (Bill Paxton), return home seeking peace after tireless months of battle. Their expectations are quickly shattered when a murder based on misunderstandings and an illicit love affair trigger warfare between former comrades and their clans. This historic feud teeters on the brink of an all out civil war as friends and neighbors join opposing sides in a rivalry that would ultimately shape American History.']\n{'Genre': 'Drama, History', 'Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Noel Fisher, Hatfield and McCoy Productions, LLC, Matt Barr, Jena Malone, Sarah Parish, Bill Paxton, Sam Reid, Kevin Costner, Jilon VanOver, Darrell Fetty, Boyd Holbrook, Andrew Howard, Mare Winningham, Ronan Vibert, Powers Boothe, Kevin Reynolds, Tom McKay, Joe Absolom, Herb Nanas, Tom Berenger, Lindsay PulsipherNoel Fisher, Hatfield and McCoy Productions, LLC, Matt Barr, Jena Malone, Sarah Parish, Bill Paxton, Sam Reid, Kevin Costner, Jilon VanOver, Darrell Fetty, Boyd Holbrook, Andrew Howard, Mare Winningham, Ronan Vibert, Powers Boothe, Kevin Reynolds, Tom McKay, Joe…   See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '25343070', 'Director': 'Kevin Reynolds', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 50 minutes', 'Release date': 'July 31, 2012', 'Actors': 'Kevin Costner, Bill Paxton, Matt Barr, Tom Berenger, Powers Boothe', 'Subtitles': 'English', 'Producers': 'Kevin Costner, Herb Nanas, Darrell Fetty', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nvery good movie\nFive Stars\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Fisher', 'Constantine Makris', 'Tawnia McKiernan', 'Jack Kenny', 'Stephen Surjik', 'Jace Alexander', 'Vincent Misiano', 'Michael W. Watkins', 'Millicent Shelton', 'Michael McMurray'], 'Starring': ['Eddie McClintock', 'Joanne Kelly', 'Saul Rubinek'], 'Studio': ['Syfy']}\nwas disappointed after watching the first 4 seasons. seemed like there wasn't much to season 5 and had to pay for it. wish I haden't\nwas disappointed after watching the first 4 seasons",
  "profile": "The user demonstrates a strong preference for faith-based films that explore belief, personal transformation, and the impact of faith on individuals. Despite showing lower satisfaction with a recent film rated 3.0, their overall pursuit of enriching narratives remains steadfast. They value complex stories delivered through ensemble casts that encompass diverse experiences, enhancing their engagement with emotionally and philosophically resonant dramas.\n\nRecent purchases indicate a growing openness to various genres, illustrated by a recent action film rated 5.0 and an acclaimed historical drama that navigates deep emotional conflicts. This flexibility reflects a desire for high-quality cinematic experiences beyond their primary interest in faith-driven content.\n\nHowever, their latest interaction shows some disappointment with a long-running series, expressing dissatisfaction with its latter seasons and resulting in a moderate rating of 3.0. This could suggest that while the user is exploring new narratives, they maintain high expectations for storytelling quality and character development.\n\nThey prioritize Blu-ray formats to ensure a premium viewing experience. The user's evolving tastes underline a journey towards spiritual reflection and a commitment to seeking meaningful narratives. Overall, they embody a well-rounded appreciation for cinema, blending a quest for quality with deeper thematic exploration while selectively expanding their cinematic palate.",
  "metrics": {
    "rouge1_f": 0.12759415833973864,
    "rouge2_f": 0.007698229407236336,
    "rougeL_f": 0.0568793235972329,
    "meteor": 0.03610054691668742,
    "bleu1": 0.0004667885253623899,
    "bleu2": 0.0001289352106629828,
    "bleu3": 2.148164055003384e-05,
    "bleu4": 8.77838432721155e-06,
    "bertscore_precision": 0.308642715215683,
    "bertscore_recall": 0.46872711181640625,
    "bertscore_f1": 0.37220174074172974
  }
}