{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Gold & Snail Hydrogel Eye Patch (60 pcs) by Petitfee\nReview Date: 2019/07/09\nStore: Petitfee\nProduct Description: ['PTFP06-IG']\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Petitfee', 'Scent': 'Hydrogel', 'Unit Count': '60 Count', 'Number of Items': '1', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.19 x 3.19 x 1.69 inches; 3.88 Ounces', 'UPC': '023071019375 748616751793 755332334339 776529926069 784179516226', 'Manufacturer': 'Petitfee'}\nReview Text: Tried to use as much and as many as i could to judge the effects. I didn't really notice anything different. Had a small tingling sensation when applied and left slim residue.\nReview Title: No noticeable difference\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Human Hair Wigs for Black Women-Glueless Full Lace Wigs with Baby Hair Brazilian Hair Water Wave 130% Density Natural Color 20inch\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.81 x 5.51 x 2.76 inches; 9.12 Ounces', 'UPC': '602731543407'}\nThis wig is a great value for the price. The hair is very soft and doesnt tangle. Minimum shedding, nothing major or beyond average. The density is on the low side so it gives a natural appearance. If you like big, diva hair you might now like the 130% density.\nGreat wig for the price! Good Value\nFree Part Lace Frontal Closure 13x4 With Baby Hair Body Wave Virgin Brazilian Human Hair Full Lace Closure Ear to Ear Natural Color No Bleached Knots (16 inch)\npreferred hair\n{'Brand': 'preferred hair', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7 x 6 x 0.5 inches; 2.4 Ounces', 'UPC': '605175461429'}\nYou get what you pay for.\nAs expected for price\nGold & Snail Hydrogel Eye Patch (60 pcs) by Petitfee\nPetitfee\n['PTFP06-IG']\n{'Brand': 'Petitfee', 'Scent': 'Hydrogel', 'Unit Count': '60 Count', 'Number of Items': '1', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.19 x 3.19 x 1.69 inches; 3.88 Ounces', 'UPC': '023071019375 748616751793 755332334339 776529926069 784179516226', 'Manufacturer': 'Petitfee'}\nTried to use as much and as many as i could to judge the effects. I didn't really notice anything different. Had a small tingling sensation when applied and left slim residue.\nNo noticeable difference",
  "profile": "**Updated User Profile Summary:**\n\nThe user continues to demonstrate a strong preference for human hair wigs that offer a natural look alongside manageability with tangling and shedding. Their recent experience with a body wave wig emphasizes their consistent interest in wavy hair types that balance aesthetics with practicality.\n\nA recent purchase of a frontal closure indicates their preference for versatile styling options. Their value-oriented mindset is further highlighted by their thoughtful reviews, where they exhibit discernment regarding product quality relative to price, seeking products that meet expectations in quality without necessarily exceeding them.\n\nFollowing a recent purchase of hydrogel eye patches, the user is now also exploring skincare products. However, their review reveals a critical approach, as they did not notice significant effects from the product, further indicating a high standard for product efficacy.\n\nOverall, the user maintains a profound inclination towards modern, glueless wig styles that emphasize convenience and understated elegance. They continue to prefer subtle, everyday looks over dramatic styles, demonstrating a commitment to quality, style, and value across both hair and skincare products. This profile resonates with contemporary trends, reflecting a lifestyle that prioritizes practicality alongside aesthetic appeal.",
  "metrics": {
    "rouge1_f": 0.23779193205944799,
    "rouge2_f": 0.03411513859275054,
    "rougeL_f": 0.11040339702760084,
    "meteor": 0.11348649034005844,
    "bleu1": 0.11744090545549246,
    "bleu2": 0.015324692363319238,
    "bleu3": 0.0036134153398887712,
    "bleu4": 0.0017566480833746511,
    "bertscore_precision": 0.3432808518409729,
    "bertscore_recall": 0.42645829916000366,
    "bertscore_f1": 0.38037553429603577
  }
}