{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: N3 No Name Necessary Pore-Minimizing Mattifying Oil and Shine Control Anti-aging Makeup Face Primer Spray (200ml)\nReview Date: 2019/08/15\nStore: No Name Necessary\nAverage Rating: 3.9\nProduct Details: {'Brand': 'No Name Necessary', 'Skin Type': 'Combination', 'Package Information': 'Bottle', 'Finish Type': 'Matte', 'Specialty': 'Mattifying', 'Product Dimensions': '1.7 x 1.7 x 7.5 inches; 8.78 Ounces'}\nReview Text: This primer is nothing short of amazing. The mist that a nozzle gives is a huge deal when it comes to coverage. Some times if the mist is too much its just too messy. But the mist on this one is so fine I barely felt anything on my face when I was applying it and had to be sure that I was even getting product on my faec and opened my eyes to check. I did use more than the recommended amount, which I found to be a bit on the low side since the size of the mist is so small the amount of product that you get out on a single spray is minimum. After I applied, I watched in the mirror as it dried, and the effects were amazing. My shine do go away and I could literally see my pore getting smaller. I could see myself using this alone on a hot summer day without makeup because the finish it gave was just that great. My makeup also went on very easy and smooth and felt as if it was gliding across my face and not going into every wrinkle and groove. I didn't wear my makeup anything close to 16 hours but I did make it through a 8 hour workday flawless. Defiantly a staple now in my makeup bag.\nReview Title: Very fine mist\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Human Hair Wigs for Black Women-Glueless Full Lace Wigs with Baby Hair Brazilian Hair Water Wave 130% Density Natural Color 20inch\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.81 x 5.51 x 2.76 inches; 9.12 Ounces', 'UPC': '602731543407'}\nThis wig is a great value for the price. The hair is very soft and doesnt tangle. Minimum shedding, nothing major or beyond average. The density is on the low side so it gives a natural appearance. If you like big, diva hair you might now like the 130% density.\nGreat wig for the price! Good Value\nFree Part Lace Frontal Closure 13x4 With Baby Hair Body Wave Virgin Brazilian Human Hair Full Lace Closure Ear to Ear Natural Color No Bleached Knots (16 inch)\npreferred hair\n{'Brand': 'preferred hair', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7 x 6 x 0.5 inches; 2.4 Ounces', 'UPC': '605175461429'}\nYou get what you pay for.\nAs expected for price\nGold & Snail Hydrogel Eye Patch (60 pcs) by Petitfee\nPetitfee\n['PTFP06-IG']\n{'Brand': 'Petitfee', 'Scent': 'Hydrogel', 'Unit Count': '60 Count', 'Number of Items': '1', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.19 x 3.19 x 1.69 inches; 3.88 Ounces', 'UPC': '023071019375 748616751793 755332334339 776529926069 784179516226', 'Manufacturer': 'Petitfee'}\nTried to use as much and as many as i could to judge the effects. I didn't really notice anything different. Had a small tingling sensation when applied and left slim residue.\nNo noticeable difference\nN3 No Name Necessary Pore-Minimizing Mattifying Oil and Shine Control Anti-aging Makeup Face Primer Spray (200ml)\nNo Name Necessary\n{'Brand': 'No Name Necessary', 'Skin Type': 'Combination', 'Package Information': 'Bottle', 'Finish Type': 'Matte', 'Specialty': 'Mattifying', 'Product Dimensions': '1.7 x 1.7 x 7.5 inches; 8.78 Ounces'}\nThis primer is nothing short of amazing. The mist that a nozzle gives is a huge deal when it comes to coverage. Some times if the mist is too much its just too messy. But the mist on this one is so fine I barely felt anything on my face when I was applying it and had to be sure that I was even getting product on my faec and opened my eyes to check. I did use more than the recommended amount, which I found to be a bit on the low side since the size of the mist is so small the amount of product that you get out on a single spray is minimum. After I applied, I watched in the mirror as it dried, and the effects were amazing. My shine do go away and I could literally see my pore getting smaller. I could see myself using this alone on a hot summer day without makeup because the finish it gave was just that great. My makeup also went on very easy and smooth and felt as if it was gliding across my face and not going into every wrinkle and groove. I didn't wear my makeup anything close to 16 hours but I did make it through a 8 hour workday flawless. Defiantly a staple now in my makeup bag.\nVery fine mist",
  "profile": "**Updated User Profile Summary:**\n\nThe user continues to show a strong preference for human hair wigs that provide a natural appearance along with manageability, specifically favoring wavy styles for their blend of aesthetic appeal and practicality. Their recent purchase of a frontal closure reinforces their desire for versatile styling options while maintaining a focus on quality.\n\nAs they explore skincare products, the user recently reviewed a mattifying primer, highlighting their discerning approach toward efficacy and product performance. The positive feedback showcases their appreciation for fine application techniques and results, while still maintaining a critical eye towards product utility in daily life. They are drawn to products that enhance their beauty routine without being overly dramatic.\n\nThis exploration aligns with their previously established high standards, emphasizing both value and quality across hair and skincare. The user remains particularly interested in modern, glueless wig styles that prioritize convenience and subtle elegance, consistently preferring everyday looks over more dramatic transformations.\n\nOverall, their profile reflects a lifestyle that balances the pursuit of practical beauty solutions with a commitment to modern trends, seeking products that deliver effective results while embodying a sleek, understated aesthetic.",
  "metrics": {
    "rouge1_f": 0.1871657754010695,
    "rouge2_f": 0.01876675603217158,
    "rougeL_f": 0.09090909090909091,
    "meteor": 0.07051762940735185,
    "bleu1": 0.03136710246890267,
    "bleu2": 0.00828552170677366,
    "bleu3": 0.003113862254427537,
    "bleu4": 0.0010747499116514775,
    "bertscore_precision": 0.3129824995994568,
    "bertscore_recall": 0.41643422842025757,
    "bertscore_f1": 0.3573721945285797
  }
}