{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Transporter Refueled [Blu-ray]\nReview Date: 2015/11/30\nStore: Ray Stevenson  (Actor),     Ed Skrein  (Actor),     Camille Delamarre  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Frank Martin (Ed Skrein) is the best driver money can buy, willing to deliver anything for a price. But when his father (Ray Stevenson) is kidnapped by a gorgeous gang of thieves, Frank must shift his skills into overdrive to rescue him. Loaded with nonstop action and excitement, The Transporter Refueled is a turbo-charged thrill ride full of hairpin twists and dangerous curves! Bonus Features:**Theatrical Feature Blu-ray**Frank Martin: The Reluctant Hero**The Coeur Bris : Les Femmes of Refueled**Rocketing From 0-60**Theatrical Trailer **Digital HD']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, DTS Surround Sound, Subtitled, Widescreen', 'Contributor': 'Loan Chabanol, Ray Stevenson, Ed Skrein, Camille Delamarre', 'Language': 'English', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '35220779', 'Director': 'Camille Delamarre', 'Media Format': 'Multiple Formats, Blu-ray, DTS Surround Sound, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'December 8, 2015', 'Actors': 'Ray Stevenson, Ed Skrein, Loan Chabanol', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: Sure, It's not Jason Stathan but it's still a lot of fun!  Same format, same locations, same sexy femmes!  What's not to like?  This Transporter does a fine job as far as I'm concern.  I don't need the driver to be the same person to sill have fun with the ride.  Definitely liked it!!!!\nReview Title: It's not Jason Stathan but it's still a lot of fun! Same format\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Far from the Madding Crowd VHS\nFormat: VHS Tape\nMovies & TV, Art House & International, By Country, United Kingdom, Drama\n['2 VHS tapes, widescreen edition (as described in product information). box and tapes in pristine condition. We ship daily from Wisconsin.']\n{'Language': 'English', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'January 8, 2002', 'Date First Available': 'June 27, 2006', 'Actors': 'Christie, Stamp, Finch, Bates, Wal', 'Studio': 'MGM / UA Home Video'}\nThis is an exceptional film.  Julie Cristie is perfection!!<br /><br />Why is this film not on DVD?\nFar From The Madding Crowd\nPascali's Island [VHS]\nBen Kingsley  (Actor),     Charles Dance  (Actor),     James Dearden  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n{'Format': 'Color, NTSC', 'Contributor': 'Barry Unsworth, James Dearden, Kevork Malikyan, Vernon Dobtcheff, Nick Burnell, Paul Raphael, George Murcell, Charles Dance, Stefan Gryff, T.P. McKenna, Sheila Allen, Tania Blunden, Mirella Sklavounou, Ben Kingsley, Helen Mirren, Scott Millaney, Nadim Sawalha, Danielle Allen, Roger DeakinsBarry Unsworth, James Dearden, Kevork Malikyan, Vernon Dobtcheff, Nick Burnell, Paul Raphael, George Murcell, Charles Dance, Stefan Gryff, T.P. McKenna, Sheila Allen, Tania Blunden, Mirella Sklavounou, Ben Kingsley, Helen Mirren, Scott Millaney, Nadim Sawalha, D…  See more', 'Runtime': '1 hour and 44 minutes'}\nFascinating movie about a betrail that occurs because of a message that was never received.  Ben Kingsley is wonderful.<br /><br />When will this movie be made available in DVD?\npascali's world\nJohnny Mnemonic\nKeanu Reeves  (Actor),     Dolph Lundgren  (Actor),     Robert Longo  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Futuristic\n['Product Description', \"Keanu Reeves is a space-age courier who's plugged in, turned on and buffed up to deliver the most important data of the 21st century, wet-wired directly into his brain! A rapid-fire roller coaster ofaction and high-impact imagery! Also starring Dolph Lundgren, Takeshi, Ice-T, Dina Meyer and Henry Rollins.\", 'Amazon.com', 'You might be tempted to call it \"Johnny Moronic\" after you\\'ve seen this illogical and derivative adaptation of William Gibson\\'s cyberpunk short story (available in his book', 'Burning Chrome', '), which is all the more depressing since Gibson himself wrote the screenplay. First you have to ask yourself why valuable top-secret electronic data would be stored in the \"wet-wired\" brain of a human courier (played by Keanu Reeves), who then transports the data from China to New Jersey as part of his last, most dangerous assignment. Surely there are better ways to transmit sensitive information, but since this is really just a conventional thriller with near-future design and spiffy special effects, Gibson and New York artist Robert Longo (making his directorial debut) are more interested in surface gloss and cyberpunk atmosphere. On that level the movie\\'s fairly engaging, and Japanese film star Takeshi Kitano makes a pretty good villain, tracking Reeves down for the information in his data-packed brain. The movie also boasts an eclectic gallery of supporting players including rapper Ice-T, performance artist and rocker Henry Rollins, beefcake actor Dolph Lundgren, and transcontinental oddball Udo Kier. They can\\'t stop this trip through virtual reality from being botched up, but sci-fi fans will certainly enjoy the echo of Gibson\\'s fiction that remains on the screen.', '--Jeff Shannon']\n{'Genre': 'Action, Sci-Fi', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Ice-T, Robert Longo, Cinevisions, Takeshi, Don Carmody, Keanu Reeves, Dolph Lundgren, Dina Meyer', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '2 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.01 Ounces', 'Director': 'Robert Longo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '2 minutes', 'Release date': 'November 25, 1997', 'Actors': 'Keanu Reeves, Dolph Lundgren, Takeshi, Ice-T, Dina Meyer', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Don Carmody', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis was a great film until the dolphin sequence appears.  How could such a great beginning end up so poorly?  Too much tuna in the writers diet, I suppose!\ndolphin nightmare!\nAgatha Christie's Marple, Series 1\nGeraldine McEwan  (Actor),     Griff Rhys Jones  (Actor),     Andy Wilson  (Director),     Charles Palmer  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Geraldine McEwan stars as the matronly detective in this new series of mysteries featuring all-new feature-length adaptations of Christie classics starring Joanna Lumley, Derek Jacobi, Tara Fitzgerald and Ian Richardson. Includes the Murder at the Vicarage (2004/94 min.), the Body in the Library (2004/94 min.), 4:50 from Paddington (2004/94 min.) and a Murder Is Announced (2005/94 min.). 4 episodes on 4 DVDs. Color/NR/fullscreen.', 'Amazon.com', 'Miss Marple is back, and what an invigorating, happy experience this quartet of British television productions is for both mystery fans and casual viewers. The luminous Geraldine McEwan (', 'Vanity Fair', \"), following in the footsteps of Helen Hayes, Angela Lansbury, Margaret Rutherford, and others, essays Agatha Christie's aging, amateur sleuth as a discreet observer, knowing friend, and judicious dispenser of wisdom during murder investigations. But what really makes these crisp adaptations a delight is the endless parade of familiar actors playing those numerous suspects, baffled police, and innocent observers who routinely populate Christie's glossy, whodunit landscapes. It's hard not to be dazzled by supporting casts that include Tara Fitzgerald, Robert Powell, Simon Callow, Joanna Lumley, Ian Richardson, Jane Asher, Miriam Margolyes, Tim McInnerny, Herbert Lom, and Jenny Agutter, all nestled into gorgeous, post-World War II backdrops, usually in the English countryside.\", 'This boxed set includes \"The Murder at the Vicarage,\" based on Christie\\'s 1930 book about the killing of one hugely unlikable Colonel Protheroe (Derek Jacobi) in Jane Marple\\'s pretty home village of St. Mary Mead. Typically, there is no end of likely suspects, but what makes the investigation unusual is a pair of competing confessions from two illicit lovers (Jason Flemyng, Janet McTeer). Stephen Tompkinson (', 'Ballykissangel', ') is very good as a police inspector who slowly develops admiration for Miss Marple\\'s keen mind. \"The Body in the Library\" finds Marple aiding the brassy Dolly Bantry (Lumley) after the latter finds the body of an unknown woman in her library. Callow is wonderful as another cop who initially underestimates the heroine\\'s gifts. \"A Murder Is Announced,\" in which a killing is advertised before it happens, and \"4:50 from Paddington,\" about a murder without a body, round out the set with imaginative plots and memorable performances. Don\\'t miss the special featurette in which McEwan and others talk about the endless appeal of Miss Marple.', '--Tom Keogh', 'Review', 'Lively scripting, crisp direction, and evocative design... Christie fans have a treat in store. --', 'The Hollywood Reporter', 'The episodes themselves are visually arresting, really lush and beautiful. --', 'Julia Buckley blog', 'See more']\n{'Genre': 'Television/British Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': \"Tim Stern, Niamh Cusack, John Strickland, Kurtis O'Brien, Griff Rhys Jones, Pam Ferris, Geraldine McEwan, Kevin Elyot, Charlie Creed-Miles, Michael Landes, Stephen Churchett, Ben Daniels, Andy Wilson, Toby Marlow, Agatha Christie, David Warner, Charles Palmer, Stewart Harcourt, Ciarn McMenaminTim Stern, Niamh Cusack, John Strickland, Kurtis O'Brien, Griff Rhys Jones, Pam Ferris, Geraldine McEwan, Kevin Elyot, Charlie Creed-Miles, Michael Landes, Stephen Churchett, Ben Daniels, Andy Wilson, Toby Marlow, Agatha Christie, David Warner, Charles Palmer, Stewar…   See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 2.5 inches; 6.4 Ounces', 'Item model number': '2228910', 'Director': 'Andy Wilson, Charles Palmer, John Strickland', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '6 hours and 16 minutes', 'Release date': 'January 1, 2016', 'Actors': 'Geraldine McEwan, Griff Rhys Jones, David Warner, Niamh Cusack, Ben Daniels', 'Studio': 'ACORN MEDIA', 'Writers': 'Agatha Christie, Kevin Elyot, Stephen Churchett, Stewart Harcourt', 'Number of discs': '4'}\nI have been a masterpiece / mystery theater fan for years, and find the Miss Marple series with Geraldine McEwan to be top notch.  Excellent actors, sumptious costumes, and beautiful settings make for  extremely entertaining viewing.  Geraldine McEwan is marvelous, and is much better than Joan Hicks ever was!  A perfectly lovely voice accompanies the very intelligent eyes!\nwestonjm\nAgatha Christie's Marple: Series 2\nGeraldine McEwan  (Actor),     Chloe Pennington  (Actor),     Edward Hall  (Director),     Paul Unwin  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', '/4 EPISODES/BONUS EXTRAS', 'Amazon.com', 'Granada Television and the PBS', 'Mystery!', \"series'\", 'Marple', 'episodes continue to delight with such distinctive vitality, wit, and stylishness one may never again think of tea rooms in the English countryside as \"quaint\" settings. Geraldine McEwan (', 'Vanity Fair', \") returns as Agatha Christie's Miss Jane Marple, elderly sleuth with a keenly discerning eye and sweet smile that takes the sting out of her blunt observations of friends and murder suspects alike. As with series 1, the quartet of mysteries in series 2, set shortly after World War II, are ensemble affairs filled out by such familiar faces as Timothy Dalton, Charles Dance, Greta Scacchi, Anthony Andrews, Patricia Hodge, and Imogen Stubbs. Rather than pound out a certain visual and tonal sameness over all four stories, each 90-minute episode seems to be approached as a stand-alone affair, giving writers, directors, and production teams a lot of leeway to give each story a unique stamp.\", '\"Sleeping Murder\" stars Sophia Myles as Gwenda Halliday, a young woman haunted by flashbacks of the memory of a killing she observed as a little girl in a stately British house. Problem is, Gwenda has only recently moved to Britain for the first time in her life, after growing up in India. Dawn French, Martin Kemp, and Geraldine Chaplin also star in the tale, which involves an old troupe of actors, a jewelry theft, and a very surprising conclusion. \"By the Pricking of My Thumbs\" concerns the disappearance of a doddering old woman who leaves behind a strange, spooky painting of a cottage in the woods, an unnerving figure lurking in the structure\\'s window. Miss Marple is on the trail, but she allows the lonely, alcoholic wife (Scacchi) of a government investigator (Andrews) to take the lead\\x97a boost to the younger woman\\'s self-esteem.', 'The ambitious \"The Moving Finger\" is the most singular episode in sries 2, a cheeky--almost subversive--vision of a rosy, picture-postcard village whose tranquility is undone by a series of hateful letters mailed to individuals in the community. Miss Marple, observing the tragic effects of these missives on relationships and reputations, is practically in the background in this story, watching closely as a nihilistic young man (James D\\'Arcy) comes out of his cynical, alcohol-laced haze to investigate the source of so much misery. (Bonus: director Ken Russell appears as the local, red-cheeked vicar.) Finally, \"The Sittaford Mystery\" finds Timothy Dalton playing a likely prospect to become prime minister, until he\\'s stabbed to death following a séance. Set in a rundown hotel during a severe winter storm, the episode co-stars James Murray, Rita Tushingham, and comic-actor-director Mel Smith, the latter as the late, great man\\'s touchingly loyal, right-hand man.', '--Tom Keogh', 'Review', 'Great fun. --', 'USA Today', 'Not your Mother\\'s Miss Marple\". --', 'Associated Press', 'The episodes themselves are visually arresting, really lush and beautiful. --', 'Julia Buckley blog', 'See more']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Oliver Jordan, Chloe Pennington, Paul Unwin, Tom Shankland, June Whitfield, Miriam Karlin, Claire Bloom, Patrick Barlow, Geraldine McEwan, Kevin Elyot, Steven Berkoff, Stephen Churchett, O.T. Fagbenle, Edward Hall, Clare Holman, Peter Medak, Agatha Christie, Greta Scacchi, Anthony Andrews, Stewart HarcourtOliver Jordan, Chloe Pennington, Paul Unwin, Tom Shankland, June Whitfield, Miriam Karlin, Claire Bloom, Patrick Barlow, Geraldine McEwan, Kevin Elyot, Steven Berkoff, Stephen Churchett, O.T. Fagbenle, Edward Hall, Clare Holman, Peter Medak, Agatha Christie, Greta…  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.14 x 5.4 x 7.68 inches; 11.2 Ounces', 'Item model number': 'Relay Time: 372 min; 4Videos', 'Director': 'Edward Hall, Paul Unwin, Peter Medak, Tom Shankland', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '6 hours and 12 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Geraldine McEwan, Chloe Pennington, Oliver Jordan, Anthony Andrews, Greta Scacchi', 'Studio': 'ACORN MEDIA', 'Writers': 'Agatha Christie, Kevin Elyot, Stephen Churchett, Stewart Harcourt', 'Number of discs': '4'}\nI have been a masterpiece / mystery theater fan for years, and find the Miss Marple series with Geraldine McEwan to be top notch.  Excellent actors, sumptious costumes, and beautiful settings make for  extremely entertaining viewing.  Geraldine McEwan is marvelous, and is much better than Joan Hicks ever was!  A perfectly lovely voice accompanies the very intelligent eyes!\nExcellent Marple\nPride & Prejudice\nKeira Knightley  (Actor),     Moya Brady  (Actor),     Joe Wright  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Academy Award® nominee Keira Knightley stars in the greatest love story of all time. When Elizabeth Bennet (Knightley) meets the handsome Mr. Darcy (Matthew Macfadyen), she believes he is the last man on earth she could ever marry. But as their lives become intertwined, she finds herself captivated by the very person she swore to loathe for all eternity. Jane Austen’s masterpiece novel comes to the screen in the film critics said “makes you believe in true love and happily-ever-after” (Stephen Holden, The New York Times).']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '1112066', 'Director': 'Joe Wright', 'Media Format': 'Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 9 minutes', 'Release date': 'August 28, 2011', 'Actors': 'Keira Knightley, Moya Brady, Judi Dench, Roy Holder, Meg Wynn Owen', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Language': 'English (DTS-HD Master Audio 5.1), French (DTS 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have seen this version and the much lauded 1995 version, and in my opinion I find this to be the best version.  Keira Knightley turns in her best film performance here!  The supporting cast is excellent, and the settings sumptuous.  I enjoyed the 1995 version, but this version is flawless!!!\nwestonjm\nGorky Park [DVD]\nWilliam Hurt  (Actor),     Lee Marvin  (Actor),     Michael Apted  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Murder, seduction and intrigue in the Kremlin! Written by Dennis Potter (Brimstone and Treacle), from a Martin Cruz Smith novel, Gorky Park is a gripping and brilliant classic! StarringWilliam Hurt, Lee Marvin, Brian Dennehy, and Joanna Pacula, this \"crisp intricate thriller\" (TheNew York Times) takes you behind the iron curtain! When three murder victims are discovered in Moscow\\'s Gorky Parktheir faces and fingertips removeddetective Arkady Renko (Hurt) isdetermined to identify the bodies and find the killer. But as a picture of the victims takes shape,the clues point toward involvement not only of the KGB but also of the woman he loves, Irina (Pacula). Now, hunted by the secret police and confronted by an intricate web of deception and treachery reaching to the highest political levels, Renko will stop at nothing to uncover the truth and bring the killer to justiceeven if it means guaranteeing his own destruction and losing Irina forever.']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Anamorphic, Closed-captioned, Color, DVD, Widescreen, NTSC', 'Contributor': \"Ian Bannen, Alexei Sayle, William Hurt, Richard Griffiths, Lee Marvin, Dennis Potter, Brian Dennehy, Alexander Knox, Niall O'Brien, Martin Cruz Smith, Joanna Pacula, Ian McDiarmid, Michael Apted, Michael Elphick, Rikki FultonIan Bannen, Alexei Sayle, William Hurt, Richard Griffiths, Lee Marvin, Dennis Potter, Brian Dennehy, Alexander Knox, Niall O'Brien, Martin Cruz Smith, Joanna Pacula, Ian McDiarmid, Michael Apted, Michael Elphick, Rikki Fulton  See more\", 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), Unqualified', 'Runtime': '2 hours and 8 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Michael Apted', 'Media Format': 'Anamorphic, Closed-captioned, Color, DVD, Widescreen, NTSC', 'Run time': '2 hours and 8 minutes', 'Release date': 'December 19, 2000', 'Actors': 'William Hurt, Lee Marvin, Brian Dennehy, Ian Bannen, Joanna Pacula', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Dennis Potter, Martin Cruz Smith', 'Number of discs': '1'}\nMartin Cruz Smith's book is quite a read.  The detective Arkady is an extremely convincing character.  He doesn't quite fit in with the party, but he is totally dedicated to his job.  The movie in part fails because William Hurt cannot carry the role.  In the book it is easy for the reader to sympathize with the detective because the detective is man that has taken quite a few lumps in life, but he never gives in.  Arkady is truthful to himself and even at the risk of loosing his life he is determined not to give in to the very corrupt system.  He is tough and bruised.  Not a hero, but also not willing to lie down. William Hurt seems lethargic in the role.  He does not have any depth.  He is not a man of passion.  He just exists.  He is not easy to identify with.  The movie seems more like an Albert Camus work, rather than the thrilling ride that Martin Cruz Smith delivers.\nwestonjm: More like an Albert Camus than a Martin Cruz Smith\nJack the Ripper\nMichael Caine  (Actor),     Armand Assante  (Actor),     David Wickes  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['In 1888, a reign of murderous terror struck East London. To this day, the case is unsolved. And the killer is known only by his infamous nickname. But the truth may at last have been found. Based on breakthrough research at the time it was made, this gripping \"what if\" suggests who wielded the surgically sharp blade of death -- and why his identity has been concealed. Michael Caine plays Scotland Yard\\'s Frederick Abberline and heads a large, flawless cast (including Armand Assante and Jane Seymour) in a movie cloaked in mystery and wrapped in period detail. Was the killer a noted doctor? A famed actor? A police commissioner, clairvoyant or even the Crown Prince? Each raises Abberline\\'s suspecions. Each merits investigation in this gripping whodunit.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'David Wickes', 'Media Format': 'Full Screen, NTSC', 'Run time': '3 hours and 8 minutes', 'Release date': 'January 14, 2010', 'Actors': 'Michael Caine, Armand Assante, Ray McAnally, Lewis Collins, Ken Bones', 'Language': 'Unqualified', 'Studio': 'LORTV', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis movie is excellent, but the format sold to the US viewer is inferior to that that I see made available to other countries.  Standard edition?  Why is the non US viewer able to acquire the film in widescreen?\nripped of fans\nThe Ghost and the Darkness\nMichael Douglas  (Actor),     Val Kilmer  (Actor),     Stephen Hopkins  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', \"Only the most incredible parts of the story are true. Michael Douglas and Val Kilmer star in this tense, terrific and true adventure set in 1896 East Africa. There, two lions on man-eating rampage have shut down the construction of a railway. The beasts hunt together, showing no fear of man or fire. What's more, they're killing for sport rather than for food-and they have an almost supernatural knack for knowing what traps await them. Big-game hunter Remington (Douglas) and construction engineer Patterson (Kilmer) set out to stop these unstoppable monsters. But, in this astonishing tale of man against beast, the hunters become the hunted.\", 'Amazon.com', \"Val Kilmer stars as Lt. Col. John Patterson, a 19th-century Irish engineer drafted by Britain's railroad bosses to build a trestle bridge over an African river, thus expanding the empire a tiny bit more. In Tsavo, Patterson is instantly hailed for killing a man-eating lion that had been making life hell for native workers. But morale sinks when a pair of unstoppable big cats devour more men and destroy the project. Along comes an Ahab-like, expatriate American hunter (Michael Douglas) to help Patterson face the almost preternatural powers of the two killers. The script by William Goldman (\", 'Butch Cassidy and the Sundance Kid', ') is based on fact, though the film owes more to Spielberg (specifically to', 'Jaws', ') than history. There are also suggestive echoes of Kipling and Conrad in the material and characters, and there are hints of emotional complexity and psychological nuance that make one wish this could have been a great film instead of a merely fun one.', '--Tom Keogh']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Contributor': 'Kurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily MortimerKurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily Mortimer   See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 4 Ounces', 'Director': 'Stephen Hopkins', 'Media Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 1, 1998', 'Actors': 'Michael Douglas, Val Kilmer, Tom Wilkinson, John Kani, Bernard Hill', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'William Goldman', 'Number of discs': '1'}\nExcellent movie!  Why is this in a letterbox format that is not enhanced?  Even on a 50 inch screen plasma the movie looks small.  Great acting, fabulous storyline, dramatic colorful African scenes, and great tension.  Too bad the format is so poor!!!\nGreat Movie with terrible format!!!!!\nDerailed [Blu-ray]\nClive Owen  (Actor),     Jennifer Aniston  (Actor),     Mikael Hfstrm  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Import Blu-ray/Region a pressing. A brief encounter turns deadly as Clive Owen and Jennifer Aniston star in this sexy thriller about two people trapped in unhappy marriages who become lovers after a chance meeting on a Chicago commuter train. Their illicit affair attracts the attention of a mysterious blackmailer (Vincent Cassel) who demands hush money to the tune of $100,000. Lacking the funds and hesitant to involve the police, Owen takes matters into his own hands, determined to stop Cassel before anyone gets hurt. A completely involving thriller that raises questions that haven't been posed, this explicitly on-screen since Fatal Attraction. Sexy and thought-provoking.\"]\n{'Genre': 'Mystery & Thrillers', 'Format': 'Multiple Formats, Blu-ray, Dubbed, Widescreen, Import, NTSC', 'Contributor': \"Denis O'Hare, Mikael Hfstrm, Sandra Bee, Richard Leaf, Jennifer Aniston, Giancarlo Esposito, Tom Conti, Xzibit, Melissa George, James Siegel, Clive Owen, Stuart Beattie, RZA, Vincent Cassel, Addison TimlinDenis O'Hare, Mikael Hfstrm, Sandra Bee, Richard Leaf, Jennifer Aniston, Giancarlo Esposito, Tom Conti, Xzibit, Melissa George, James Siegel, Clive Owen, Stuart Beattie, RZA, Vincent Cassel, Addison Timlin  See more\", 'Language': 'English', 'Runtime': '1 hour and 48 minutes', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.95 Ounces', 'Director': 'Mikael Hfstrm', 'Media Format': 'Multiple Formats, Blu-ray, Dubbed, Widescreen, Import, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 3, 2009', 'Actors': 'Clive Owen, Jennifer Aniston, Vincent Cassel, Melissa George, Addison Timlin', 'Dubbed': 'French', 'Studio': 'Alliance Canada', 'Writers': 'James Siegel, Stuart Beattie', 'Number of discs': '1'}\nThis is an excellent thriller.  Beautifully shot.  Excellent casting. Well written cautionary tale.  Forget the bias against Jennifer Aniston.  She is perfect in her role!  This is better than most thrillers, with plenty of twists that keeps the viewer interested throughout.  I love this film!\nLove Derailed\nHilary Hahn: A Portrait\nHilary Hahn  (Actor),     Kent Nagano  (Actor),     Benedict Mirow  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Portrait of the Grammy award-winning American violinist in performance with some of the world's top philharmonic orchestras. Performance footage is interspersed with clips of the artist traveling in some exotic locales including Hong Kong as well as relaxing at her home.\"]\n{'Genre': 'Classical, Music Video & Concerts', 'Format': 'Multiple Formats, NTSC, Classical, Color', 'Contributor': 'Berlin Deutsches Symphony Orchestra, Hilary Hahn, Kent Nagano, Natalie Zhu, Benedict Mirow', 'Language': 'German (Dolby Digital 5.1), English (Dolby Digital 5.1), German (PCM Stereo), English (PCM Stereo), English (DTS 5.1), German (DTS 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.36 Ounces', 'Item model number': 'unknown', 'Director': 'Benedict Mirow', 'Media Format': 'Multiple Formats, NTSC, Classical, Color', 'Run time': '58 minutes', 'Release date': 'February 13, 2007', 'Actors': 'Hilary Hahn, Kent Nagano, Natalie Zhu, Berlin Deutsches Symphony Orchestra', 'Dubbed': 'English', 'Subtitles': 'Spanish, French, German, Cantonese', 'Studio': 'Deutsche Grammophon', 'Number of discs': '1'}\nI love this portrait of the wonderful Ms. Hahn.  However, why is there no recording of this lovely Korngold with Ms. Hahn?  The DVD is great, but what if you just want to hear the lovely Korngold with Ms. Hahn on record.\nExcellent Hahn!\nThe Secret in Their Eyes [Blu-ray]\nRicardo Darín  (Actor),     Soledad Villamil  (Actor),     Juan José Campanella  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Product Description', 'Recently retired criminal court investigator Benjamin (Ricardo Darin), decides to write a novel based on a twenty-five year old unresolved rape and murder case, which still haunts him. Sharing his plans with Irene (Soledad Villamil), the beautiful judge and former colleague he has secretly been in love with for years, Benjamin’s initial involvement with the case is shown through flashbacks, as he sets out to identify the murderer. But Benjamin’s search for the truth will put him at the center of a judicial nightmare, as the mystery of the heinous crime continues to unfold in the present, testing the limits of a man seeking justice and personal fulfillment at last.', 'Amazon.com', 'The Secret in Their Eyes', '(', 'El Secreto de Sus Ojos', \"), an Oscar winner for Best Foreign Language Film, is part cold-case mystery, part long-lost love story, and part thriller set both in the present and in 1970s Argentina, under the tight control of its infamous military dictatorship. Director Juan José Campanella manages to tread easily across these genres with a story that's gripping, a little outlandish, and compelling--if full of a growing sense of dread.\", 'The Secret in Their Eyes', 'stars Ricardo Darín as Benjamin, a policeman who gets pulled into investigating a decades-old crime, and becomes drawn in, almost against his will, as layers of information about the missing (murdered?) girl slowly come to light. As Benjamin investigates, he runs into a woman for whom he has long carried a torch, Irene (Soledad Villamil), an ambitious judge who had also at one point been involved in adjudicating the old crime. The chemistry between Benjamin and Irene is part of the \"secret in their eyes,\" as the pull between the old colleagues becomes palpable. But also palpable is the hold that this unsolved crime has over Benjamin--a creepy borderline obsession that is reminiscent of the American film noir classic', 'Laura', '. Fancy cinematography and well-crafted flashbacks to the era of the crime--set against the backdrop of the military dictatorship--add extra depth to what is a truly original story, told in layers with great intelligence. Fans of great mysteries and dramas--and of lost love that may again be found--will not want to miss', 'The Secret in Their Eyes', '. --', 'A.T. Hurley']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '7986487', 'Director': 'Juan José Campanella', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 9 minutes', 'Release date': 'September 21, 2010', 'Actors': 'Ricardo Darín, Soledad Villamil', 'Dubbed': 'French', 'Subtitles': 'French, English', 'Producers': 'Juan José Campanella, Mariela Besuievski, Carolina Urbieta', 'Studio': 'Sony Pictures Classics', 'Writers': 'Juan José Campanella, Eduardo Sacheri', 'Number of discs': '1'}\nThis film is a delight if for no other reason than that it gives us a glimpse into the world of a culture that is so very different than our own.  Spend a day in the office with these coworkers and you can't help but laugh at the unrestrained dialogue that is heard at all times.  Imagine a job at a US corporation or at a government office where being politically correct in what you say is not the norm.  For us who live in a world where lawsuits threaten us for any politically incorrect statement or insunation that may transpire, or where the possibility of lossing a job is very real if acceptable language is not kept, it is extremely hilarious to see how coworkers behave in an environment where these constraints are non- existant.  Seeing this alone is worth the price of admission!  This is a very different culture with personalities that portray a great deal of passion continuously.  You would think that they would become quite caloused in this environment, and yet quite the opposite is the case.  Their extreme passions make them very vulnerable.  Very fine film.\nThe madness of Argentinos\nLe Divorce\nKate Hudson  (Actor),     Naomi Watts  (Actor),     James Ivory  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Kate Hudson (Almost Famous) lights up the screen as Isabel, a film school dropout who jets off to Paris when her pregant step-sister Roxy (Naomi Watts, Mulholland Drive) is abandoned by her husband. Soon, Isabel has a scandal of her own when she falls for an older man who's related to Roxy's cheating husband! Ths stylish romantic comedy by the acclaimed Merchant Ivory team (The Remains of the Day) features a top cast, including Stockard Channing, Glenn Close, Matthew Modine and Bebe Newirth.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, Anamorphic, Widescreen, NTSC', 'Contributor': 'James Ivory, Sam Waterston, Kate Hudson, Rona Hartner, Daniel Mesguich, Nathalie Richard, Matthew Modine, Glenn Close, Naomi Watts, Stockard Channing, Thomas Lennon, Melvil Poupaud, Ruth Prawer Jhavbala, Bebe Neuwirth, Thierry Lhermitte, Romain Duris, Stephen Fry, Jean-Marc Barr, Leslie CaronJames Ivory, Sam Waterston, Kate Hudson, Rona Hartner, Daniel Mesguich, Nathalie Richard, Matthew Modine, Glenn Close, Naomi Watts, Stockard Channing, Thomas Lennon, Melvil Poupaud, Ruth Prawer Jhavbala, Bebe Neuwirth, Thierry Lhermitte, Romain Duris, Stephen…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '2220416', 'Director': 'James Ivory', 'Media Format': 'Multiple Formats, Color, Dolby, Anamorphic, Widescreen, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 27, 2004', 'Actors': 'Kate Hudson, Naomi Watts, Glenn Close, Leslie Caron, Stockard Channing', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Ruth Prawer Jhavbala', 'Number of discs': '1'}\nTwo American sisters get screwed over in Paris by two Parisian men.  Lovely locations, but not much sense.  An American girl arrives in Paris to console her sister that is being abandoned by her husband for another woman.  The newly arrived sister then promptly accepts an invitation to be a mistress to another married man.  How can this possibly be considered a comedy?  Very humiliating for both American girls.  They are both meant to look like dumb American blondes.  The rest of the girls' American family finally arrive in Paris to see what can be done.  But all that they can come up with is to thank the philandering husbands mother for accepting them for lunch in their lovely country estate, and enjoy wonderful meals at restaurants that are outrageously expensive.  One ridiculous scene even pokes fun at the fact that Americans are too stupid to even know that the 17% automatic gratuity charge at the end of the meal requires an additional tip because that is the right thing to do.  The Americans feel that 17% on a 900.00 meal is tip enough.  Stupid story.  Not very funny.  However,great Parisian scenery.\nUsed in Paris with style\nAs You Like It [DVD]\nBryce Dallas Howard  (Actor),     Kevin Kline  (Actor),     Kenneth Branagh  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Shakespeare on DVD Store, The Works, The Tragedies\n['Product Description', 'As You Like It (DVD)', \"Emmy award winner Kenneth Branagh, the man who redefined Shakespeare for a whole new generation with Henry V, Much Ado About Nothing and Hamlet, brings the Bard's most delightful comedy to sensational life! Rosalind is a young woman living in the court of her uncle when she falls in love with Orlando, a young gentleman of the kingdom. When Rosalind is banished, she flees into the forest of Arden disguised as a man...only to encounter Orlando who has also been exiled! But can she win his heart, disguised as she is? With a setting inspired by 19th century Japan and a star-studded cast including Kevin Kline (Dave, A Prairie Home Companion), Bryce Dallas Howard (Spider-Man 3, The Lady In The Water) and Alfred Molina (Spider-Man 2, The Da Vinci Code), AS YOU LIKE IT once again proves that all the world's a stage. Come enjoy!\", ']]>', 'Amazon.com', 'If you think stuffy old Shakespeare could be livened up with some ninjas, Kenneth Branagh (', 'Hamlet', ',', \"Mary Shelley's Frankenstein\", ') has heard your call. Adapter/director Branagh has set the pastoral comedy', 'As You Like It', 'in feudal Japan, where the characters are still British (they live in a community established by Western merchants) but now have reason to dress up in lush Japanese fabrics and engage in sumo wrestling. Due to a feud between two noble brothers, Rosalind (Bryce Dallas Howard,', 'The Village', ') is banished and ends up disguised as a man in a nearby forest. There she tests the faith of her beloved (and also banished) Orlando (David Oyelowo,', 'MI-5', \"), who can't recognize her because she looks like a Dickensian ragamuffin. Meanwhile, a variety of other star-crossed lovers romp around the forest and zen gardens, sparring about love and melancholy. Branagh, never a subtle director, takes every opportunity to squeeze in slapstick and action (like the aforementioned ninjas), but he also keeps the language clear and the movie is beautiful to look at. The strong cast includes Kevin Kline (who previously frolicked in a movie adaptation of\", \"A Midsummer Night's Dream\", '), Alfred Molina (', 'Spider-Man 2', ',', 'Frida', '), Romola Garai (', 'I Capture the Castle', ',', 'Dirty Dancing: Havana Nights', '), and Adrian Lester (', 'Hustle', ',', \"Love's Labors Lost\", ').', '--Bret Fetzer']\n{'Genre': 'Comedy', 'Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, NTSC, Subtitled, Widescreen, Dubbed', 'Contributor': 'Alfred Molina, Kenneth Branagh, Kevin Kline, Bryce Dallas Howard', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 2.0)', 'Number Of Discs': '1', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Director': 'Kenneth Branagh', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 25, 2007', 'Actors': 'Bryce Dallas Howard, Kevin Kline, Alfred Molina', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'HBO Studios', 'Number of discs': '1'}\nSometimes directors want to be to inovative in their presentations, and in searching for that new thrill they seem to lose the essence of the classic that they are trying to keep.  The director in this work strolls so far in attempting to put a new spin on the old classic that he, at least for this critic, infuriates more than delights his audience.  Al Pacino was quite innovative in his presentation of Looking for Richard.  He moves the setting to modern day New York, and begins a discussion on Shakespeare while at the same time presenting snippets of the play performed by well known actors.  The results of Pacino's efforts are extremely gratifying because he has presented a classic work and has involved his audience in assessing not only the work but also has shifted the focus from the presentation to an honest discussion as to why the work means what it does to the modern day audience.  In Branagh's case the director takes the work of the playwright and is so distracting in his presentation that the audience is not only not captivated by the work but is actually repulsed by the many distractions in the presentation.  This is one of the worst presentations of a Shakespeare film that I have ever seen!\nInterracial Love\nAnna Karenina [Blu-ray]\nKeira Knightley  (Actor),     Jude Law  (Actor),     Joe Wright  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['In 1874, in the Imperial Russia, the aristocratic Anna Karenina travels from Saint Petersburg to Moscow to save the marriage of her brother Prince Oblonsky, who had had a love affair with his housemaid. Anna Karenina has a cold marriage with her husband, Count Alexei Karenin, and they have a son. Anna meets the cavalry officer Count Vronsky at the train station and they feel attracted by each other. Soon she learns that Vronsky will propose to Kitty, who is the younger sister of her sister-in-law Dolly. Anna satisfactorily resolves the infidelity case of her brother and Kitty invites her to stay for the ball. However, Anna Karenina and Vronsky dance in the ball, calling the attention of the conservative society. Soon they have a love affair that will lead Anna Karenina to a tragic fate.']\n{'Genre': 'Drama, Drama/Love & Romance, DVD Movie, Blu-ray Movie', 'Format': 'AC-3, Color, Dolby, DTS Surround Sound, Subtitled, Widescreen', 'Contributor': 'Emily Watson, Ruth Wilson, Eric Fellner, Kelly Macdonald, Aaron Taylor-Johnson, Domhnall Gleeson, Tom Stoppard, Alicia Vikander, Matthew Macfadyen, Keira Knightley, Olivia Williams, Joe Wright, Paul Webster, Sarah Greenwood, Tim Bevan, Katie Spencer, Jude LawEmily Watson, Ruth Wilson, Eric Fellner, Kelly Macdonald, Aaron Taylor-Johnson, Domhnall Gleeson, Tom Stoppard, Alicia Vikander, Matthew Macfadyen, Keira Knightley, Olivia Williams, Joe Wright, Paul Webster, Sarah Greenwood, Tim Bevan, Katie Spencer, Jude Law  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Spanish (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '4 hours and 20 minutes', 'Digital Copy Expiration Date': 'April 30, 2015', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.5 x 5.25 x 0.3 inches; 0.01 Ounces', 'Item model number': 'FOCF62123776BR', 'Director': 'Joe Wright', 'Media Format': 'AC-3, Color, Dolby, DTS Surround Sound, Subtitled, Widescreen', 'Run time': '4 hours and 20 minutes', 'Release date': 'March 13, 2018', 'Actors': 'Keira Knightley, Jude Law, Aaron Taylor-Johnson, Kelly Macdonald, Matthew Macfadyen', 'Subtitles': 'Spanish, English, French', 'Producers': 'Tim Bevan, Eric Fellner, Paul Webster', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Tom Stoppard', 'Number of discs': '2'}\nAnna Karenina was in my opinion the best picture of the year! The highly stylized film was masterful in presentation. The acting was flawless! The editing paced the movie in a very exciting way. The period costumes were luxurious and elegant. Kiera Knightly was magnificent in the title role. Forget Les Miserable. This was the real gem!!!\nBest picture of 2012\nKeeping Score - Stravinsky: Rite of Spring [Blu-ray]\nRated:    G    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n[\"This special Blu-ray disc release commemorates the 100th anniversary of the premiere of the Rite of Spring and is presented in stunning Dolby TrueHD 96K audio. In 1913, with Europe on the brink of war, a fashionable Parisian audience reacted with hostile frenzy to the premiere of Igor Stravinsky's ground-breaking ballet. The work's shocking music and dance provoked a riot that evening and soon afterwards was recognized as perhaps the most revolutionary piece of the twentieth century. On this disc, Michael Tilson Thomas and the musicians of the San Francisco Symphony take you from the salons of St. Petersburg to the villages where Stravinsky found inspiration in the earthy power of Russian folk music and dance, to the cultural crossroads of prewar Paris. Presented for the first time on Blu-ray, Keeping Score: Stravinsky features a thought-provoking documentary and brilliant live concert performances.\"]\n{'Genre': 'Michael Tilson Thomas Keeping Score - Stravinsky: Rite of Spring, Classical', 'Format': 'Multiple Formats, Blu-ray, NTSC, Surround Sound, Widescreen, Classical', 'Contributor': 'Michael Tilson Thomas', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '6.8 x 5.26 x 0.48 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Surround Sound, Widescreen, Classical', 'Run time': '2 hours and 7 minutes', 'Release date': 'July 9, 2013', 'Actors': 'Michael Tilson Thomas', 'Studio': 'SFS MEDIA', 'Number of discs': '1'}\nI just watched MTT's presentation on Stravinky's work and can honestly say that it was the most complete analysis of the work that I have ever heard.  He successfuly disected the Rite stylistically, thematically, and clearly underscored his understanding as to how the work was created, including the root influences from the traditional sources.<br />The bluray included performances of the Firebird Suite and the complete Rite of Spring.  The sound was spectacular.  The SanFrancisco symphony orchestra made me a believer that this was probably the best performance that I have ever heard.  It was great to also here the musicians give their takes on their individual roles in the work.<br />MTT also addressed how the Parisians reacted to the work, and how the ballet may have also played a role in the audiences response.<br />This is an incredible Bluray worth every penny.  I can't recommend it highly enough.\nExcellent Presentation\nTransporter Refueled [Blu-ray]\nRay Stevenson  (Actor),     Ed Skrein  (Actor),     Camille Delamarre  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Frank Martin (Ed Skrein) is the best driver money can buy, willing to deliver anything for a price. But when his father (Ray Stevenson) is kidnapped by a gorgeous gang of thieves, Frank must shift his skills into overdrive to rescue him. Loaded with nonstop action and excitement, The Transporter Refueled is a turbo-charged thrill ride full of hairpin twists and dangerous curves! Bonus Features:**Theatrical Feature Blu-ray**Frank Martin: The Reluctant Hero**The Coeur Bris : Les Femmes of Refueled**Rocketing From 0-60**Theatrical Trailer **Digital HD']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, DTS Surround Sound, Subtitled, Widescreen', 'Contributor': 'Loan Chabanol, Ray Stevenson, Ed Skrein, Camille Delamarre', 'Language': 'English', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '35220779', 'Director': 'Camille Delamarre', 'Media Format': 'Multiple Formats, Blu-ray, DTS Surround Sound, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'December 8, 2015', 'Actors': 'Ray Stevenson, Ed Skrein, Loan Chabanol', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nSure, It's not Jason Stathan but it's still a lot of fun!  Same format, same locations, same sexy femmes!  What's not to like?  This Transporter does a fine job as far as I'm concern.  I don't need the driver to be the same person to sill have fun with the ride.  Definitely liked it!!!!\nIt's not Jason Stathan but it's still a lot of fun! Same format",
  "actual_interaction": {
    "rating": 4.0,
    "title": "It's not Jason Stathan but it's still a lot of fun! Same format",
    "text": "Sure, It's not Jason Stathan but it's still a lot of fun!  Same format, same locations, same sexy femmes!  What's not to like?  This Transporter does a fine job as far as I'm concern.  I don't need the driver to be the same person to sill have fun with the ride.  Definitely liked it!!!!",
    "images": [],
    "asin": "B0168UF1CW",
    "parent_asin": "B0168UF1CW",
    "user_id": "AFAOY6VOFHANZBM4LAB2WLC7HB5A",
    "timestamp": "2015-11-30 20:59:25",
    "helpful_vote": 8,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Transporter Refueled [Blu-ray]",
    "average_rating": 4.6,
    "rating_number": 202,
    "features": [],
    "description": [
      "Frank Martin (Ed Skrein) is the best driver money can buy, willing to deliver anything for a price. But when his father (Ray Stevenson) is kidnapped by a gorgeous gang of thieves, Frank must shift his skills into overdrive to rescue him. Loaded with nonstop action and excitement, The Transporter Refueled is a turbo-charged thrill ride full of hairpin twists and dangerous curves! Bonus Features:**Theatrical Feature Blu-ray**Frank Martin: The Reluctant Hero**The Coeur Bris : Les Femmes of Refueled**Rocketing From 0-60**Theatrical Trailer **Digital HD"
    ],
    "price": 14.5,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51DRUZSc+ZL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51DRUZSc+ZL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91D9LVMEaHL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Ray Stevenson  (Actor),     Ed Skrein  (Actor),     Camille Delamarre  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Genre": "Action & Adventure",
      "Format": "Multiple Formats, Blu-ray, DTS Surround Sound, Subtitled, Widescreen",
      "Contributor": "Loan Chabanol, Ray Stevenson, Ed Skrein, Camille Delamarre",
      "Language": "English",
      "Runtime": "1 hour and 36 minutes",
      "Aspect Ratio": "2.39:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 3.2 Ounces",
      "Item model number": "35220779",
      "Director": "Camille Delamarre",
      "Media Format": "Multiple Formats, Blu-ray, DTS Surround Sound, Subtitled, Widescreen",
      "Run time": "1 hour and 36 minutes",
      "Release date": "December 8, 2015",
      "Actors": "Ray Stevenson, Ed Skrein, Loan Chabanol",
      "Subtitles": "English, Spanish",
      "Studio": "20th Century Fox",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}