{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Pride & Prejudice\nReview Date: 2010/01/29\nStore: Keira Knightley  (Actor),     Moya Brady  (Actor),     Joe Wright  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Academy Award® nominee Keira Knightley stars in the greatest love story of all time. When Elizabeth Bennet (Knightley) meets the handsome Mr. Darcy (Matthew Macfadyen), she believes he is the last man on earth she could ever marry. But as their lives become intertwined, she finds herself captivated by the very person she swore to loathe for all eternity. Jane Austen’s masterpiece novel comes to the screen in the film critics said “makes you believe in true love and happily-ever-after” (Stephen Holden, The New York Times).']\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '1112066', 'Director': 'Joe Wright', 'Media Format': 'Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 9 minutes', 'Release date': 'August 28, 2011', 'Actors': 'Keira Knightley, Moya Brady, Judi Dench, Roy Holder, Meg Wynn Owen', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Language': 'English (DTS-HD Master Audio 5.1), French (DTS 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have seen this version and the much lauded 1995 version, and in my opinion I find this to be the best version.  Keira Knightley turns in her best film performance here!  The supporting cast is excellent, and the settings sumptuous.  I enjoyed the 1995 version, but this version is flawless!!!\nReview Title: westonjm\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Far from the Madding Crowd VHS\nFormat: VHS Tape\nMovies & TV, Art House & International, By Country, United Kingdom, Drama\n['2 VHS tapes, widescreen edition (as described in product information). box and tapes in pristine condition. We ship daily from Wisconsin.']\n{'Language': 'English', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'January 8, 2002', 'Date First Available': 'June 27, 2006', 'Actors': 'Christie, Stamp, Finch, Bates, Wal', 'Studio': 'MGM / UA Home Video'}\nThis is an exceptional film.  Julie Cristie is perfection!!<br /><br />Why is this film not on DVD?\nFar From The Madding Crowd\nPascali's Island [VHS]\nBen Kingsley  (Actor),     Charles Dance  (Actor),     James Dearden  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n{'Format': 'Color, NTSC', 'Contributor': 'Barry Unsworth, James Dearden, Kevork Malikyan, Vernon Dobtcheff, Nick Burnell, Paul Raphael, George Murcell, Charles Dance, Stefan Gryff, T.P. McKenna, Sheila Allen, Tania Blunden, Mirella Sklavounou, Ben Kingsley, Helen Mirren, Scott Millaney, Nadim Sawalha, Danielle Allen, Roger DeakinsBarry Unsworth, James Dearden, Kevork Malikyan, Vernon Dobtcheff, Nick Burnell, Paul Raphael, George Murcell, Charles Dance, Stefan Gryff, T.P. McKenna, Sheila Allen, Tania Blunden, Mirella Sklavounou, Ben Kingsley, Helen Mirren, Scott Millaney, Nadim Sawalha, D…  See more', 'Runtime': '1 hour and 44 minutes'}\nFascinating movie about a betrail that occurs because of a message that was never received.  Ben Kingsley is wonderful.<br /><br />When will this movie be made available in DVD?\npascali's world\nJohnny Mnemonic\nKeanu Reeves  (Actor),     Dolph Lundgren  (Actor),     Robert Longo  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Futuristic\n['Product Description', \"Keanu Reeves is a space-age courier who's plugged in, turned on and buffed up to deliver the most important data of the 21st century, wet-wired directly into his brain! A rapid-fire roller coaster ofaction and high-impact imagery! Also starring Dolph Lundgren, Takeshi, Ice-T, Dina Meyer and Henry Rollins.\", 'Amazon.com', 'You might be tempted to call it \"Johnny Moronic\" after you\\'ve seen this illogical and derivative adaptation of William Gibson\\'s cyberpunk short story (available in his book', 'Burning Chrome', '), which is all the more depressing since Gibson himself wrote the screenplay. First you have to ask yourself why valuable top-secret electronic data would be stored in the \"wet-wired\" brain of a human courier (played by Keanu Reeves), who then transports the data from China to New Jersey as part of his last, most dangerous assignment. Surely there are better ways to transmit sensitive information, but since this is really just a conventional thriller with near-future design and spiffy special effects, Gibson and New York artist Robert Longo (making his directorial debut) are more interested in surface gloss and cyberpunk atmosphere. On that level the movie\\'s fairly engaging, and Japanese film star Takeshi Kitano makes a pretty good villain, tracking Reeves down for the information in his data-packed brain. The movie also boasts an eclectic gallery of supporting players including rapper Ice-T, performance artist and rocker Henry Rollins, beefcake actor Dolph Lundgren, and transcontinental oddball Udo Kier. They can\\'t stop this trip through virtual reality from being botched up, but sci-fi fans will certainly enjoy the echo of Gibson\\'s fiction that remains on the screen.', '--Jeff Shannon']\n{'Genre': 'Action, Sci-Fi', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Ice-T, Robert Longo, Cinevisions, Takeshi, Don Carmody, Keanu Reeves, Dolph Lundgren, Dina Meyer', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '2 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.01 Ounces', 'Director': 'Robert Longo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '2 minutes', 'Release date': 'November 25, 1997', 'Actors': 'Keanu Reeves, Dolph Lundgren, Takeshi, Ice-T, Dina Meyer', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Don Carmody', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis was a great film until the dolphin sequence appears.  How could such a great beginning end up so poorly?  Too much tuna in the writers diet, I suppose!\ndolphin nightmare!\nAgatha Christie's Marple, Series 1\nGeraldine McEwan  (Actor),     Griff Rhys Jones  (Actor),     Andy Wilson  (Director),     Charles Palmer  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Geraldine McEwan stars as the matronly detective in this new series of mysteries featuring all-new feature-length adaptations of Christie classics starring Joanna Lumley, Derek Jacobi, Tara Fitzgerald and Ian Richardson. Includes the Murder at the Vicarage (2004/94 min.), the Body in the Library (2004/94 min.), 4:50 from Paddington (2004/94 min.) and a Murder Is Announced (2005/94 min.). 4 episodes on 4 DVDs. Color/NR/fullscreen.', 'Amazon.com', 'Miss Marple is back, and what an invigorating, happy experience this quartet of British television productions is for both mystery fans and casual viewers. The luminous Geraldine McEwan (', 'Vanity Fair', \"), following in the footsteps of Helen Hayes, Angela Lansbury, Margaret Rutherford, and others, essays Agatha Christie's aging, amateur sleuth as a discreet observer, knowing friend, and judicious dispenser of wisdom during murder investigations. But what really makes these crisp adaptations a delight is the endless parade of familiar actors playing those numerous suspects, baffled police, and innocent observers who routinely populate Christie's glossy, whodunit landscapes. It's hard not to be dazzled by supporting casts that include Tara Fitzgerald, Robert Powell, Simon Callow, Joanna Lumley, Ian Richardson, Jane Asher, Miriam Margolyes, Tim McInnerny, Herbert Lom, and Jenny Agutter, all nestled into gorgeous, post-World War II backdrops, usually in the English countryside.\", 'This boxed set includes \"The Murder at the Vicarage,\" based on Christie\\'s 1930 book about the killing of one hugely unlikable Colonel Protheroe (Derek Jacobi) in Jane Marple\\'s pretty home village of St. Mary Mead. Typically, there is no end of likely suspects, but what makes the investigation unusual is a pair of competing confessions from two illicit lovers (Jason Flemyng, Janet McTeer). Stephen Tompkinson (', 'Ballykissangel', ') is very good as a police inspector who slowly develops admiration for Miss Marple\\'s keen mind. \"The Body in the Library\" finds Marple aiding the brassy Dolly Bantry (Lumley) after the latter finds the body of an unknown woman in her library. Callow is wonderful as another cop who initially underestimates the heroine\\'s gifts. \"A Murder Is Announced,\" in which a killing is advertised before it happens, and \"4:50 from Paddington,\" about a murder without a body, round out the set with imaginative plots and memorable performances. Don\\'t miss the special featurette in which McEwan and others talk about the endless appeal of Miss Marple.', '--Tom Keogh', 'Review', 'Lively scripting, crisp direction, and evocative design... Christie fans have a treat in store. --', 'The Hollywood Reporter', 'The episodes themselves are visually arresting, really lush and beautiful. --', 'Julia Buckley blog', 'See more']\n{'Genre': 'Television/British Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': \"Tim Stern, Niamh Cusack, John Strickland, Kurtis O'Brien, Griff Rhys Jones, Pam Ferris, Geraldine McEwan, Kevin Elyot, Charlie Creed-Miles, Michael Landes, Stephen Churchett, Ben Daniels, Andy Wilson, Toby Marlow, Agatha Christie, David Warner, Charles Palmer, Stewart Harcourt, Ciarn McMenaminTim Stern, Niamh Cusack, John Strickland, Kurtis O'Brien, Griff Rhys Jones, Pam Ferris, Geraldine McEwan, Kevin Elyot, Charlie Creed-Miles, Michael Landes, Stephen Churchett, Ben Daniels, Andy Wilson, Toby Marlow, Agatha Christie, David Warner, Charles Palmer, Stewar…   See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 2.5 inches; 6.4 Ounces', 'Item model number': '2228910', 'Director': 'Andy Wilson, Charles Palmer, John Strickland', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '6 hours and 16 minutes', 'Release date': 'January 1, 2016', 'Actors': 'Geraldine McEwan, Griff Rhys Jones, David Warner, Niamh Cusack, Ben Daniels', 'Studio': 'ACORN MEDIA', 'Writers': 'Agatha Christie, Kevin Elyot, Stephen Churchett, Stewart Harcourt', 'Number of discs': '4'}\nI have been a masterpiece / mystery theater fan for years, and find the Miss Marple series with Geraldine McEwan to be top notch.  Excellent actors, sumptious costumes, and beautiful settings make for  extremely entertaining viewing.  Geraldine McEwan is marvelous, and is much better than Joan Hicks ever was!  A perfectly lovely voice accompanies the very intelligent eyes!\nwestonjm\nAgatha Christie's Marple: Series 2\nGeraldine McEwan  (Actor),     Chloe Pennington  (Actor),     Edward Hall  (Director),     Paul Unwin  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', '/4 EPISODES/BONUS EXTRAS', 'Amazon.com', 'Granada Television and the PBS', 'Mystery!', \"series'\", 'Marple', 'episodes continue to delight with such distinctive vitality, wit, and stylishness one may never again think of tea rooms in the English countryside as \"quaint\" settings. Geraldine McEwan (', 'Vanity Fair', \") returns as Agatha Christie's Miss Jane Marple, elderly sleuth with a keenly discerning eye and sweet smile that takes the sting out of her blunt observations of friends and murder suspects alike. As with series 1, the quartet of mysteries in series 2, set shortly after World War II, are ensemble affairs filled out by such familiar faces as Timothy Dalton, Charles Dance, Greta Scacchi, Anthony Andrews, Patricia Hodge, and Imogen Stubbs. Rather than pound out a certain visual and tonal sameness over all four stories, each 90-minute episode seems to be approached as a stand-alone affair, giving writers, directors, and production teams a lot of leeway to give each story a unique stamp.\", '\"Sleeping Murder\" stars Sophia Myles as Gwenda Halliday, a young woman haunted by flashbacks of the memory of a killing she observed as a little girl in a stately British house. Problem is, Gwenda has only recently moved to Britain for the first time in her life, after growing up in India. Dawn French, Martin Kemp, and Geraldine Chaplin also star in the tale, which involves an old troupe of actors, a jewelry theft, and a very surprising conclusion. \"By the Pricking of My Thumbs\" concerns the disappearance of a doddering old woman who leaves behind a strange, spooky painting of a cottage in the woods, an unnerving figure lurking in the structure\\'s window. Miss Marple is on the trail, but she allows the lonely, alcoholic wife (Scacchi) of a government investigator (Andrews) to take the lead\\x97a boost to the younger woman\\'s self-esteem.', 'The ambitious \"The Moving Finger\" is the most singular episode in sries 2, a cheeky--almost subversive--vision of a rosy, picture-postcard village whose tranquility is undone by a series of hateful letters mailed to individuals in the community. Miss Marple, observing the tragic effects of these missives on relationships and reputations, is practically in the background in this story, watching closely as a nihilistic young man (James D\\'Arcy) comes out of his cynical, alcohol-laced haze to investigate the source of so much misery. (Bonus: director Ken Russell appears as the local, red-cheeked vicar.) Finally, \"The Sittaford Mystery\" finds Timothy Dalton playing a likely prospect to become prime minister, until he\\'s stabbed to death following a séance. Set in a rundown hotel during a severe winter storm, the episode co-stars James Murray, Rita Tushingham, and comic-actor-director Mel Smith, the latter as the late, great man\\'s touchingly loyal, right-hand man.', '--Tom Keogh', 'Review', 'Great fun. --', 'USA Today', 'Not your Mother\\'s Miss Marple\". --', 'Associated Press', 'The episodes themselves are visually arresting, really lush and beautiful. --', 'Julia Buckley blog', 'See more']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Oliver Jordan, Chloe Pennington, Paul Unwin, Tom Shankland, June Whitfield, Miriam Karlin, Claire Bloom, Patrick Barlow, Geraldine McEwan, Kevin Elyot, Steven Berkoff, Stephen Churchett, O.T. Fagbenle, Edward Hall, Clare Holman, Peter Medak, Agatha Christie, Greta Scacchi, Anthony Andrews, Stewart HarcourtOliver Jordan, Chloe Pennington, Paul Unwin, Tom Shankland, June Whitfield, Miriam Karlin, Claire Bloom, Patrick Barlow, Geraldine McEwan, Kevin Elyot, Steven Berkoff, Stephen Churchett, O.T. Fagbenle, Edward Hall, Clare Holman, Peter Medak, Agatha Christie, Greta…  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.14 x 5.4 x 7.68 inches; 11.2 Ounces', 'Item model number': 'Relay Time: 372 min; 4Videos', 'Director': 'Edward Hall, Paul Unwin, Peter Medak, Tom Shankland', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '6 hours and 12 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Geraldine McEwan, Chloe Pennington, Oliver Jordan, Anthony Andrews, Greta Scacchi', 'Studio': 'ACORN MEDIA', 'Writers': 'Agatha Christie, Kevin Elyot, Stephen Churchett, Stewart Harcourt', 'Number of discs': '4'}\nI have been a masterpiece / mystery theater fan for years, and find the Miss Marple series with Geraldine McEwan to be top notch.  Excellent actors, sumptious costumes, and beautiful settings make for  extremely entertaining viewing.  Geraldine McEwan is marvelous, and is much better than Joan Hicks ever was!  A perfectly lovely voice accompanies the very intelligent eyes!\nExcellent Marple\nPride & Prejudice\nKeira Knightley  (Actor),     Moya Brady  (Actor),     Joe Wright  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Academy Award® nominee Keira Knightley stars in the greatest love story of all time. When Elizabeth Bennet (Knightley) meets the handsome Mr. Darcy (Matthew Macfadyen), she believes he is the last man on earth she could ever marry. But as their lives become intertwined, she finds herself captivated by the very person she swore to loathe for all eternity. Jane Austen’s masterpiece novel comes to the screen in the film critics said “makes you believe in true love and happily-ever-after” (Stephen Holden, The New York Times).']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '1112066', 'Director': 'Joe Wright', 'Media Format': 'Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 9 minutes', 'Release date': 'August 28, 2011', 'Actors': 'Keira Knightley, Moya Brady, Judi Dench, Roy Holder, Meg Wynn Owen', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Language': 'English (DTS-HD Master Audio 5.1), French (DTS 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have seen this version and the much lauded 1995 version, and in my opinion I find this to be the best version.  Keira Knightley turns in her best film performance here!  The supporting cast is excellent, and the settings sumptuous.  I enjoyed the 1995 version, but this version is flawless!!!\nwestonjm",
  "profile": "**Updated User Profile Summary:**\n\nThe user continues to exhibit a strong affinity for classic and art-house films, particularly favoring British narratives and adaptations of literary works. Their recent engagement with a notable film reaffirms their established interest in well-crafted narratives, particularly romance and character-driven stories. The user shows a distinct preference for high-quality presentations, as evidenced by their choice of Blu-ray as a format, reflecting both nostalgia and a keen appreciation for modern technologies that enhance viewing experiences.\n\nTheir emphasis on pristine condition and aesthetically pleasing media remains paramount, showcasing a sophisticated taste that values both content and presentation. The user’s review behavior is marked by detailed and enthusiastic commentary, highlighting their discerning nature regarding storytelling and performance quality. This latest interaction illustrates their ongoing commitment to exploring the best adaptations, reinforcing a pattern of high ratings that denote an appreciation for depth and artistic integrity.\n\nAdditionally, their curiosity about film availability across various formats persists, alongside a broader exploration of advancements in film and television technology. The user exemplifies a dedicated film enthusiast, enriched by a blend of classic influences and a progressive outlook towards contemporary releases.",
  "metrics": {
    "rouge1_f": 0.07044864664441973,
    "rouge2_f": 0.008905380333951761,
    "rougeL_f": 0.0378197997775306,
    "meteor": 0.020191149221486918,
    "bleu1": 1.0294145432269527e-07,
    "bleu2": 3.5111283923488083e-08,
    "bleu3": 5.1280520101427155e-09,
    "bleu4": 1.9620996788364e-09,
    "bertscore_precision": 0.3103119730949402,
    "bertscore_recall": 0.4902501106262207,
    "bertscore_f1": 0.3800591826438904
  }
}