{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Knight Rider: The Complete Series\nReview Date: 2020/05/07\nStore: Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: [\"Gear up for action with superstar David Hasselhoff and his supercar K.I.T.T. as they throttle crime in all 4 seasons of Knight Rider. This Amazon-exclusive bundle includes all 90 high-octane episodes on 24 discs tricked out with an impressive array of bonus features including the movie sequel Knight Rider 2000, making this complete DVD collection one you can’t afford to miss! David Hasselhoff is the charismatic Michael Knight, a detective thought to be dead, who's been given a new face and identity. His assignment: to fight crime with the help of an artificially intelligent talking car named K.I.T.T., a high-speed, futuristic weapon outfitted with high-tech gadgets and a personality of its own. Driven by justice, they set out to take down criminals who operate above the law. As this brave duo take on criminals, crooks, and those eager to exploit K.I.T.T.’s impressive technology for their own nefarious purposes, you’ll be blown away by the explosive adventures that set the standard for all TV action series to come.\"]\nAverage Rating: 4.6\nProduct Details: {'Format': 'NTSC', 'Language': 'English', 'Number Of Discs': '13', 'Publication Date': 'August 9, 2013', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5 x 2 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Release date': 'August 9, 2013', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '13'}\nReview Text: This is Only knight rider DVD set that includes the knight rider 2000 movie. Besides that it also is better than the other set that is in a cardboard box with cardboard sleeves.\nReview Title: Best DVD set\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Chucky: The Killer DVD Collection\nAlex Vincent  (Actor),     Justin Whalin  (Actor),     Don Mancini  (Director, Writer),     Ronny Yu  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Product Description', \"Set a play date with Chucky as his gory legacy lives on in this horrifying and hilarious four-movie collection. Watch the killer doll as he torments his original victim, young Andy Barclay, in Child's Play 2 and Child's Play 3. Then the ruthless redhead teams up with his dream doll, Tiffany (Jennifer Tilly), in Bride of Chucky and Seed of Chucky. Oozing with bonus materials, Chucky The Killer DVD Collection is a thrilling, chilling, campy, must-own set. Wanna play?Bonus Content:\", \"Disc 1 - Child's Play 2:\", 'Theatrical Trailer', 'Theatrical Trailer', \"Disc 1 - Child's Play 3:\", 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - Bride of Chucky:', 'Feature Commentary with Director Ronny Yu', 'Feature Commentary with Director Ronny Yu', 'Feature Commentary with Jennifer Tilly, Brad Dourif and Don Mancini', 'Feature Commentary with Jennifer Tilly, Brad Dourif and Don Mancini', 'Spotlight on Location', 'Spotlight on Location', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - Seed of Chucky:', 'Feature Commenary with writer/director Don Mancini and actress Jennifer Tilly', 'Feature Commenary with writer/director Don Mancini and actress Jennifer Tilly', 'Conceiving the Seed of Chucky', 'Conceiving the Seed of Chucky', 'Tilly on The Tonight Show', 'Tilly on The Tonight Show', 'Family Hell-iday Slide Show.', 'Family Hell-iday Slide Show.', 'Amazon.com', 'The most unlikely horror-movie icon this side of', 'Leprechaun', ', the homicidal doll Chucky has blossomed into one of the most recognizable faces of fright fare over the last two decades, and this double-disc set chronicles four of his most monstrous misadventures. The original--and still quite creepy--', \"Child's Play\", 'feature (from 1988) is not included in the set (that title is owned by MGM, and this set is a Universal release), so the', 'Killer DVD Collection', 'kicks off with the more formulaic', \"Child's Play 2\", '(1990) and', '3', \"('91, directed by\", 'Lost', 'producer/director Jack Bender), both of which are saved only by veteran character actor Brad Dourif as the voice of Chucky. The series received a much-needed shot in the arm in 1998 with', 'Bride of Chucky', \", an over-the-top revamp that dispensed with the tired horror-movie mechanics and dove headfirst into a gleeful mix of camp and gore; much of the credit for that film's success must go to Hong Kong director Ronny Yu (\", 'Bride with White Hair', '), who imparts much visual flair to the proceedings and Jennifer Tilly as an amoral moll whose attempt to free the killer that possesses Chucky results in another monster doll on the loose. The fifth (and to date, final)', \"Child's Play\", '/Chucky feature,', 'Seed of Chucky', \", rounds out the set; it strives for the humor-horror quotient of Yu's film, and yields mixed results.\", 'No extras are featured on the first two sequels, but both', 'Bride', 'and', 'Seed', 'offer up commentaries and featurettes for the devoted Chucky fans.', 'Bride', 'gets two commentaries--one with Yu, and the other with Dourif, Tilly, and scriptwriter Don Mancini, while', 'Seed', \"'s commentary has Mancini (who was promoted to director) and Tilly. Making-of featurettes for both features are also included, as well as a clip of Tilly on\", 'The Tonight Show', '. None of these supplements will be new to the longtime', \"Child's Play\", 'collector--all have been released on previous single and multi-disc sets--and buyers should know that they will find the R-rated versions of', 'Bride', 'and', 'Seed', \"here, and not the unrated versions (which have also been previously released). So it's fans looking to fill in the Chucky gap in their DVD libraries that will benefit the most from the\", 'Killer DVD Collection', '.', '--Paul Gaita']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': '61030924', 'Director': 'Don Mancini, Ronny Yu, John Lafia, Jack Bender', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 50 minutes', 'Release date': 'September 19, 2006', 'Actors': 'Alex Vincent, Justin Whalin, Jennifer Tilly, Jenny Agutter, Perrey Reeves', 'Subtitles': 'English, Spanish', 'Producers': 'David Kirschner, Corey Sienega, Robert Latham Brown, Grace Gilroy', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1)', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'Don Mancini', 'Number of discs': '2'}\njust like i remember when i was a kid\nFive Stars\nHancock (Unrated Special Edition) [Blu-ray]\nWill Smith  (Actor, Producer),     Charlize Theron  (Actor),     Peter Berg  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Academy Award® nominee Will Smith (Best Actor, The Pursuit of Happyness, 2006) stars in this action-packed comedy as Hancock, a sarcastic, hard-living and misunderstood superhero who has fallen out of favor with the public. When Hancock grudgingly agrees to an extreme makeover from idealistic publicist Ray Embrey (Jason Bateman, Juno), his life and reputation rise from the ashes and all seems right again--until he meets a woman (2003 Academy Award® winner Charlize Theron, Best Actress, Monster) with similar powers to his and the key to his secret past.', 'Amazon.com', 'Hancock', \"turns the standard superhero movie inside-out: The title character (Will Smith) can fly, has superstrength, and is invulnerable, but he's also a sloppy, alcoholic jerk who causes millions of dollars in property damage whenever he bothers to fight crime. When he saves the life of a public-relations agent named Ray (Jason Bateman,\", 'Arrested Development', \"), Ray decides to improve Hancock's image--starting by having Hancock surrender himself to the authorities and go to prison for his lawless behavior. The idea is that once he's in prison, the crime rate will go up, and people will start to realize Hancock might be of value after all. This is only the first act of\", 'Hancock', \"--from there, the movie takes several clever turns that shouldn't be revealed.\", 'Hancock', \"isn't a great movie (among other things, director Peter Berg overuses close-ups with a hand-held camera to a degree that may cause motion sickness), but it is an extremely entertaining one. The script, which holds together far better than most superhero movies, has a propulsive plot, good dialogue, some compassion for its characters, and even an actual idea or two. The spectacular action at least gestures towards obeying the laws of physics, which actually makes the special effects more vivid. The three leads (Smith, Bateman, and Charlize Theron as Ray's wife, Mary) deftly balance the movie's mixture of comedy, action, and drama. All in all, a smart subversive twist on a genre that all too often takes itself all too seriously. --\", 'Bret Fetzer']\n{'Genre': 'Action, Comedy', 'Format': 'Blu-ray, Anamorphic, Color, Dolby, Subtitled, Widescreen', 'Contributor': 'Jason Bateman, Will Smith, Thomas Lennon, Peter Berg, Michael Mann, Eddie Marsan, Akiva Goldsman, James Lassiter, Johnny Galecki, Columbia Pictures; Columbia Pictures Industries, Inc., Charlize TheronJason Bateman, Will Smith, Thomas Lennon, Peter Berg, Michael Mann, Eddie Marsan, Akiva Goldsman, James Lassiter, Johnny Galecki, Columbia Pictures; Columbia Pictures Industries, Inc., Charlize Theron  See more', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '3 hours and 14 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 3.52 Ounces', 'Item model number': '1201', 'Director': 'Peter Berg', 'Media Format': 'Blu-ray, Anamorphic, Color, Dolby, Subtitled, Widescreen', 'Run time': '3 hours and 14 minutes', 'Release date': 'November 25, 2008', 'Actors': 'Will Smith, Charlize Theron, Jason Bateman, Eddie Marsan, Johnny Galecki', 'Dubbed': 'Portuguese, French, Spanish, Thai', 'Subtitles': 'Thai, Mandarin Chinese, Korean, Indonesian, English, Portuguese, French, Spanish', 'Producers': 'Will Smith, Akiva Goldsman, James Lassiter, Michael Mann', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\ngood movie\nFour Stars\nTalladega Nights: The Ballad of Ricky Bobby (Unrated and Uncut) [Blu-ray]\nWill Ferrell  (Actor),     John Reilly  (Actor),     Adam McKay  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'The fastest man on four wheels, Ricky Bobby (WILL FERRELL) is one of the greatest drivers in NASCAR history. A big, hairy American winning machine, Ricky has everything a dimwitted daredevil could want, a luxurious mansion, a smokin\\' hot wife (LESLIE BIBB) and all the fast food he can eat. But Ricky\\'s turbo-charged lifestyle hits an unexpected speed bump when he\\'s bested by flamboyant Euro-idiot Jean Girard (SACHA BARON COHEN, TV\\'s \"Da Ali G Show\") and reduced to a fear-ridden wreck. Losing his wife and job to best bud and fellow fool, Cal Naughton, Jr. (JOHN C. REILLY), Ricky must kick some serious asphalt if he\\'s to get his career back on the track, beat Girard and reclaim his fame and fortune. \\'Cause as Ricky Bobby always says, IF YOU AIN\\'T FIRST, YOU\\'RE LAST!', 'Amazon.com', 'Sweet baby Jesus, we thank you for blessing Will Ferrell and Adam McKay with the talent to create a NASCAR comedy as hilarious as', 'Talladega Nights', '. The so-called \"', 'Ballad of Ricky Bobby', '\" is hardly flawless in fact it\\'s not always firing on all cylinders but with comedy star Ferrell and director McKay still hot from the success of their previous comedy hit', 'Anchorman: The Legend of Ron Burgundy', \", most of this 108-minute spoof of oval-track racing is so knee-slappin' funny that you can't help but surrender to the stupidity.\", 'Obviously, Ferrell\\'s the shining star, and his portrayal of lead-footed pit-crew-member-turned-#1 NASCAR champion Ricky \"I Wanna Go Fast\" Bobby (how can you not love that name?) is spot-on perfect, righteously spoofing the entirety of NASCAR culture without insulting its oft-ridiculed roots in redneck bootlegging of a bygone era. You could even argue that Talladega Nights is truer to NASCAR than Tom Cruise\\'s', 'Days of Thunder', ', and it\\'s certainly more entertaining, especially when you add John C. Reilly as Ricky\\'s life-long pal, teammate, and eventual rival Cal Naughton, Jr. (together they\\'re nicknamed \"Shake \\'n Bake\"), and Sacha Baron Cohen (from', 'Da Ali G Show', 'and', 'Borat', ') as gay French \"Formula Un\" driver-turned NASCAR rival Jean Girrard, to a stellar cast including Molly Shannon, Greg Germann, Amy Adams and Michael Clarke Duncan.', \"Sure, it's mostly a showcase for Ferrell's loud, over-the-top antics and nonsensical non sequiturs (like cameo appearances by Elvis Costello and Mos Def), but with Ferrell behind the wheel,\", 'Talladega Nights', \"rolls into victory lane with fuel to spare, and there's one final bit of comedy (with a tip of the hat to William Faulkner) for those who sit through the credits. --\", 'Jeff Shannon', 'Stills from', 'Talladega Nights: The Ballad of Ricky Bobby', '(click for larger image)', 'More NASCAR and', 'Talladega Nights', 'at Amazon.com', 'The Calendar', 'On blu-ray', 'NASCAR on PSP', 'Our NASCAR Store', 'NASCAR The Imax Experience', 'Speed, Guts, and Glory', 'Book', '-- end6pak -->', 'Other Will Ferrell Films', 'Anchor Man', 'Elf', 'The Best of Will Ferrell', 'More Films by Will Ferrell']\n{'Genre': 'Comedy, Sports', 'Format': 'Anamorphic, Color, Dolby, Blu-ray, Subtitled, Widescreen', 'Contributor': 'Columbia Pictures, Gary Cole, Judd Apatow, Michael Clarke Duncan, Jimmy Miller, Adam McKay, Sacha Baron Cohen, Will Ferrell, John ReillyColumbia Pictures, Gary Cole, Judd Apatow, Michael Clarke Duncan, Jimmy Miller, Adam McKay, Sacha Baron Cohen, Will Ferrell, John Reilly  See more', 'Language': 'English, French', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.75 x 5.25 x 0.3 inches; 2.4 Ounces', 'Item model number': '2227564', 'Director': 'Adam McKay', 'Media Format': 'Anamorphic, Color, Dolby, Blu-ray, Subtitled, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'December 12, 2006', 'Actors': 'Will Ferrell, John Reilly, Sacha Baron Cohen, Gary Cole, Michael Clarke Duncan', 'Dubbed': 'French', 'Subtitles': 'English, French, Portuguese, Korean, Chinese, Spanish', 'Producers': 'Judd Apatow, Jimmy Miller', 'Studio': 'Columbia Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nShake and bake!\nFive Stars\nTwister [Blu-ray]\nJan de Bont  (Director),     Helen Hunt  (Actor),     Bill Paxton  (Actor)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Today's Deals, Featured Deals & New Releases, Warner Sale\n['Product Description', 'A mile-wide, 300 miles-per-hour force of total devastation is coming at you! In this adventure swirling with cliffhanging excitement and awesome special effects, Helen Hunt and Bill Paxton play scientists pursuing the most destructive weatherfront to sweep through mid-America’s Tornado Alley in 50 years. By launching electronic sensors into the funnel, the storm chasers hope to obtain data to create an improved warning system. But to do so, they must intercept the twisters’ deadly path. The chase is on! Special Features • Commentary by Director Jan DeBont and Visual Effects Supervisor Stefan Fangmeier • Chasing the Storm: Twister Revisited featurette • The History Channel Documentary Nature Tech: Tornadoes • Anatomy of a Twister • HBO First Look: The Making of Twister • Van Halen Humans Being Music Video • Theatrical Trailers', 'Amazon.com', 'Twister', 'was a mega-million-dollar blockbuster--helmed by a director (Dutchman Jan de Bont) hot off another scorcher hit (', 'Speed', ')--that flaunted state-of-the-art digital effects and featured a popular leading actress (Helen Hunt) who would win an Academy Award for her next film (', 'As Good As It Gets', \"). But ask anybody who's seen it and they'll tell you who the real star of\", 'Twister', \"is: the cow. Not to give anything away, but the cow is one of those inspired little touches (like, say, Bronson Pinchot's career-making cameo in\", 'Beverly Hills Cop', \") that adds a touch of personality to a gigantic Hollywood production. The story is blown out the window after an impressive prologue in which Hunt's character, as a little girl, witnesses her daddy being sucked into a tornado. Basically, Hunt and Bill Paxton are thrill-seeking meteorologists chasing twisters in order to study them (and help warn people of them, of course) with a new technology they've developed. If you thought the Kansas tornado in\", 'The Wizard of Oz', 'was every bit as scary as the', 'Wicked Witch of the West', ', then this may be the movie for you.', '--Jim Emerson']\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Closed-captioned, Color, NTSC, Original recording remastered, Special Edition, Subtitled, WidescreenMultiple Formats, Blu-ray, Closed-captioned, Color, NTSC, Original recording remastered, Special Edition, Subtitled, Widescreen  See more', 'Contributor': 'Joey Slotnick, Jan de Bont, Anne-Marie Martin, Gerald R. Molen, Philip Seymour Hoffman, Laurie MacDonald, Todd Field, Scott Thomson, Steven Spielberg, Jami Gertz, Bill Paxton, Alan Ruck, Walter F. Parkes, Helen Hunt, Wendle Josepher, Lois Smith, Jeremy Davies, Ian Bryce, Sean Whalen, Kathleen Kennedy, Michael Crichton, Cary ElwesJoey Slotnick, Jan de Bont, Anne-Marie Martin, Gerald R. Molen, Philip Seymour Hoffman, Laurie MacDonald, Todd Field, Scott Thomson, Steven Spielberg, Jami Gertz, Bill Paxton, Alan Ruck, Walter F. Parkes, Helen Hunt, Wendle Josepher, Lois Smith, Jeremy Davies, Ian…  See more', 'Language': 'English', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '3350335', 'Director': 'Jan de Bont', 'Media Format': 'Multiple Formats, Blu-ray, Color, NTSC, Original recording remastered, Closed-captioned, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'May 6, 2008', 'Actors': 'Helen Hunt, Bill Paxton, Cary Elwes, Jami Gertz, Philip Seymour Hoffman', 'Subtitles': 'English, French', 'Producers': 'Steven Spielberg, Michael Crichton, Kathleen Kennedy, Laurie MacDonald, Gerald R. Molen', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Crichton, Anne-Marie Martin', 'Number of discs': '1'}\ntwister in  hd sweeeet\nFive Stars\nStar Trek Beyond (BD/DVD/Digital HD Combo)\nChris Pine  (Actor),     Zachary Quinto  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['\"Star Trek Beyond,\" the highly anticipated next installment in the globally popular Star Trek franchise, created by Gene Roddenberry and reintroduced by J.J. Abrams in 2009, returns with director Justin Lin (“The Fast and the Furious” franchise) at the helm of this epic voyage of the U.S.S. Enterprise and her intrepid crew. In “Beyond,\" the Enterprise crew explores the furthest reaches of uncharted space, where they encounter a mysterious new enemy who puts them and everything the Federation stands for to the test.']\n{'Genre': 'Action/Adventure, Sci-Fi', 'Format': 'Digital, Blu-ray, DVD', 'Contributor': 'Anton Yelchin, John Cho, Karl Urban, Zoë Saldana, Idris Elba, Chris Pine, Simon Pegg, Zachary Quinto, Sofia BoutellaAnton Yelchin, John Cho, Karl Urban, Zoë Saldana, Idris Elba, Chris Pine, Simon Pegg, Zachary Quinto, Sofia Boutella   See more', 'Language': 'English', 'Runtime': '2 hours and 2 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '43381879', 'Media Format': 'Digital, Blu-ray, DVD', 'Run time': '2 hours and 2 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Chris Pine, Zachary Quinto, Simon Pegg, Zoë Saldana, John Cho', 'Dubbed': 'French, Portuguese, Spanish', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI was by far impressed. I hated the first 2 new remakes. This one somehow managed to entertain me.\nI hated the first 2 new remakes\nWarcraft\nTravis Fimmel  (Actor),     Paula Patton  (Actor),     Duncan Jones  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product description', 'WARCRAFT DESCRIPTION', 'BONUS FEATURES', '-', 'Deleted/Extended scenes', '-', 'Gag reel', '-', 'Origin story', '-', 'The fandom of Warcraft', '-', 'ILM: Behind the magic of Warcraft', 'BLU-RAY EXCLUSIVES', '-', 'Warcraft: Bonds of brotherhood motion comic', '-', 'The World of Warcraft on film: Talent, VFX, Stunts and more', '-', 'Warcraft: The Madame Tussauds experience', '-', 'Warcraft teaser 2013', \"When the world of the Orcs of Draenor is being destroyed by the evil fel magic that uses life-force, the powerful warlock Gul'dan creates a portal to the world of Azeroth and forms the Horde with members of the Orc clans. He also captures many prisoners to keep the portal open. The king of Azeroth, Llane Wrynn and his brother-in-law, Anduin Lothar are informed by the apprentice of magician Khadgar that he has found fel magic in dead bodies and the king decides to summon the Guardian of Tirisfal, Medivh, to protect his kingdom. Lothar and Khadgar head to Kharazhan to meet Medivh and an ominous shadow points a book out to Khadgar, who takes it and hides. Anduin, Khadgar and Medivh and a group of soldiers are attacked by Orcs and they capture the slave Garona, who is released by King Llane, and she shows them the location of the portal. Garona is contacted by the Orc chief of a clan Durotan that wants to meet King Llane to stop the fel magic\", 'Additional Features', 'Includes Dolby Atmos \\uf02d Dolby Atmos is a revolutionary new audio technology that transports you into extraordinary entertainment experience. With Dolby Atmos enabled receivers and speaker configurations, sound comes from all directions, including overhead, to create an immersive experience with clarity, richness, details, and depth. With existing home theater systems, you will get a great surround sound experience.']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 4 Ounces', 'Item model number': '42927659', 'Director': 'Duncan Jones', 'Media Format': 'Blu-ray, Digital_copy, DVD-ROM', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 27, 2016', 'Actors': 'Travis Fimmel, Paula Patton, Ben Foster, Dominic Cooper, Toby Kebbell', 'Subtitles': 'French, Spanish', 'Producers': 'Charles Roven, Thomas Tull, Jon Jashni, Alex Gartner, Stuart Fenegan', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Charles Leavitt, Duncan Jones', 'Number of discs': '2'}\nwas a excellent movie. Made me want to play wow again!\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Renaud'], 'Producers': ['Chris Meledandri', 'Janet Healy'], 'Starring': ['Louis C.K', 'Eric Stonestreet', 'Kevin Hart'], 'Studio': ['Universal Pictures']}\nit was kind of dumb and boring. Glad i rented it i wouldn't buy it\nThree Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['James Mangold'], 'Producers': ['Hutch Parker', 'Simon Kinberg', 'Lauren Shuler Donner'], 'Starring': ['Hugh Jackman', 'Hugh Jackman', 'Patrick Stewart']}\nGood movie He dies at the end.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Lasse Hallstrom'], 'Producers': ['Gavin Polone', 'Alan C. Blomquist'], 'Starring': ['Britt Robertson', 'KJ Apa', 'John Ortiz']}\nMovie is tear Jerking and very good. I never get tears watching movies. Makes me miss my dog. Watch it!\nMovie is tear Jerking and very good. I never get tears watching movies\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Dax Shepard'], 'Producers': ['Andrew Panay', 'Ravi D. Mehta', 'Dax Shepard'], 'Starring': ['Dax Shepard', 'Michael Peña', 'Rosa Salazar'], 'Studio': ['WARNER BROS.']}\nOmg so funny. I loved the chips show and this movie just killed me making me laugh so hard. Definitely a movie to watch if you want a awesome laugh\nOmg so funny. I loved the chips show and this movie ...\nKnight Rider: The Complete Series\nFormat: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n[\"Gear up for action with superstar David Hasselhoff and his supercar K.I.T.T. as they throttle crime in all 4 seasons of Knight Rider. This Amazon-exclusive bundle includes all 90 high-octane episodes on 24 discs tricked out with an impressive array of bonus features including the movie sequel Knight Rider 2000, making this complete DVD collection one you can’t afford to miss! David Hasselhoff is the charismatic Michael Knight, a detective thought to be dead, who's been given a new face and identity. His assignment: to fight crime with the help of an artificially intelligent talking car named K.I.T.T., a high-speed, futuristic weapon outfitted with high-tech gadgets and a personality of its own. Driven by justice, they set out to take down criminals who operate above the law. As this brave duo take on criminals, crooks, and those eager to exploit K.I.T.T.’s impressive technology for their own nefarious purposes, you’ll be blown away by the explosive adventures that set the standard for all TV action series to come.\"]\n{'Format': 'NTSC', 'Language': 'English', 'Number Of Discs': '13', 'Publication Date': 'August 9, 2013', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5 x 2 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Release date': 'August 9, 2013', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '13'}\nThis is Only knight rider DVD set that includes the knight rider 2000 movie. Besides that it also is better than the other set that is in a cardboard box with cardboard sleeves.\nBest DVD set",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Best DVD set",
    "text": "This is Only knight rider DVD set that includes the knight rider 2000 movie. Besides that it also is better than the other set that is in a cardboard box with cardboard sleeves.",
    "images": [],
    "asin": "B00CQAVIZS",
    "parent_asin": "B00CQAVIZS",
    "user_id": "AHXO5KWH7Q2A2UTTLGQWIIR2ONPQ",
    "timestamp": "2020-05-07 08:18:43.009000",
    "helpful_vote": 5,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Knight Rider: The Complete Series",
    "average_rating": 4.6,
    "rating_number": 343,
    "features": [],
    "description": [
      "Gear up for action with superstar David Hasselhoff and his supercar K.I.T.T. as they throttle crime in all 4 seasons of Knight Rider. This Amazon-exclusive bundle includes all 90 high-octane episodes on 24 discs tricked out with an impressive array of bonus features including the movie sequel Knight Rider 2000, making this complete DVD collection one you can’t afford to miss! David Hasselhoff is the charismatic Michael Knight, a detective thought to be dead, who's been given a new face and identity. His assignment: to fight crime with the help of an artificially intelligent talking car named K.I.T.T., a high-speed, futuristic weapon outfitted with high-tech gadgets and a personality of its own. Driven by justice, they set out to take down criminals who operate above the law. As this brave duo take on criminals, crooks, and those eager to exploit K.I.T.T.’s impressive technology for their own nefarious purposes, you’ll be blown away by the explosive adventures that set the standard for all TV action series to come."
    ],
    "price": null,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51QXV+BugKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51QXV+BugKL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81ezgvc9ovL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Format: DVD",
    "categories": [
      "Movies & TV",
      "Studio Specials",
      "Universal Studios Home Entertainment",
      "All Universal Studios Titles"
    ],
    "details": {
      "Format": "NTSC",
      "Language": "English",
      "Number Of Discs": "13",
      "Publication Date": "August 9, 2013",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.5 x 5 x 2 inches; 0.01 Ounces",
      "Media Format": "NTSC",
      "Release date": "August 9, 2013",
      "Subtitles": "Spanish, French",
      "Studio": "Universal Studios Home Entertainment",
      "Number of discs": "13"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}