{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 2001: A Space Odyssey [Blu-ray]\nReview Date: 2016/01/15\nStore: Keir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality Product\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Moonraker [Blu-ray]\nRoger Moore  (Actor),     Lois Chiles  (Actor),     Lewis Gilbert  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Agent 007 meets Hugo Drax, a tycoon out to nerve-gas Earth to make room for his space-bred master race. The 11th James Bond movie.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Michael Lonsdale, Corinne Clery, Lewis Gilbert, Lois Chiles, Richard Kiel, Roger Moore', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Lewis Gilbert', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'March 24, 2009', 'Actors': 'Roger Moore, Lois Chiles, Michael Lonsdale, Richard Kiel, Corinne Clery', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'MGM', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality product\nCasino Royale\nDaniel Craig  (Actor),     Jesper Christensen  (Actor),     Martin Campbell  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'CASINO ROYALE introduces JAMES BOND before he holds his license to kill. But Bond is no less dangerous, and with two professional assassinations in quick succession, he is elevated to \"00\" status. \"M\" (Judi Dench), head of the British Secret Service, sends the newly-promoted 007 on his first mission that takes him to Madagascar, the Bahamas and eventually leads him to Montenegro to face Le Chiffre, a ruthless financier under threat from his terrorist clientele, who is attempting to restore his funds in a high-stakes poker game at the Casino Royale. \"M\" places Bond under the watchful eye of the Treasury official Vesper Lynd. At first skeptical of what value Vesper can provide, Bond\\'s interest in her deepens as they brave danger together. Le Chiffre\\'s cunning and cruelty come to bear on them both in a way Bond could never imagine, and he learns his most important lesson: Trust no one.', 'Amazon.com', 'The most successful invigoration of a cinematic franchise since', 'Batman Begins, Casino Royale', 'offers a new Bond identity. Based on the Ian Fleming novel that introduced Agent 007 into a Cold War world,', 'Casino Royale', 'is the most brutal and viscerally exciting James Bond film since Sean Connery left Her Majesty\\'s Secret Service. Meet the new Bond; not the same as the old Bond. Daniel Craig gives a galvanizing performance as the freshly minted double-0 agent. Suave, yes, but also a \"blunt instrument,\" reckless, and possessed with an ego that compromises his judgment during his first mission to root out the mastermind behind an operation that funds international terrorists. In classic Bond film tradition, his global itinerary takes him to far-flung locales, including Uganda, Madagascar, the Bahamas (that\\'s more like it), and Montenegro, where he is pitted against his nemesis in a poker game, with hundreds of millions in the pot. The stakes get even higher when Bond lets down his \"armor\" and falls in love with Vesper (Eva Green), the ravishing banker\\'s representative fronting him the money.', 'For longtime fans of the franchise,', 'Casino Royale', 'offers some retro kicks. Bond wins his iconic Astin-Martin at the gaming table, and when a bartender asks if he wants his martini \"shaken or stirred,\" he disdainfully replies, \"Do I look like I give a damn?\" There\\'s no Moneypenny or \"Q,\" but Dame Judi Dench is back as the exasperated M, who one senses, admires Bond\\'s \"bloody cheek.\" A Bond film is only as good as its villain, and Mads Mikkelsen as Le Chiffre, who weeps blood, is a sinister dandy. From its punishing violence and virtuoso action sequences to its romance,', 'Casino Royale', 'is a Bond film that, in the words of one character, makes you feel it, particularly during an excruciating torture sequence. Double-0s, Bond observes early on, \"have a short life expectancy.\" But with Craig, there is new life in the old franchise yet, as well as genuine anticipation for the next one when, at last, the signature James Bond theme kicks in following the best last line ever in any Bond film. To quote Goldie Hawn in', 'Private Benjamin', \", now I know what I've been faking all these years.\", '--Donald Liebenson', 'Stills from', 'Casino Royale', '(click for larger image)', '-- end6pak -->', 'Beyond', 'Casino Royale', 'on Amazon.com', 'On Blu-ray', 'CD Soundtrack', 'Why We Love Daniel Craig', 'The Amazon.com James Bond Store', 'Where Have I Seen Daniel Craig?', 'Bond on Set: Filming Casino Royale', 'Book']\n{'Genre': 'Drama, Action/Adventure', 'Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Contributor': 'Sebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, Tobias Menzies, Daniel CraigSebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, To…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 24 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Martin Campbell', 'Media Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'March 13, 2007', 'Actors': 'Daniel Craig, Jesper Christensen, Isaach de Bankolé, Judi Dench, Jeffrey Wright', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish, Chinese, Korean, Portuguese, Thai', 'Studio': 'Columbia Pictures', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality product\nUp [Blu-ray]\nEd Asner  (Actor),     Christopher Plummer  (Actor),     Directed By Pete Docter  (Director),     Co-Directed By Bob Peterson  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Kids & Family\n['Product Description', 'From the revolutionary minds of Pixar Animation Studios and the acclaimed director of MONSTERS, INC. comes a hilariously uplifting adventure where the sky is no longer the limit. Carl Fredricksen, a retired balloon salesman, is part rascal, part dreamer who is ready for his last chance at high-flying excitement. Tying thousands of balloons to his house, Carl sets off to the lost world of his childhood dreams. Unbeknownst to Carl, Russell, an overeager 8-year-old Wilderness Explorer who has never ventured beyond his backyard, is in the wrong place at the wrong time -- Carl\\'s front porch! The world\\'s most unlikely duo reach new heights and meet fantastic friends like Dug, a dog with a special collar that allows him to speak, and Kevin, a rare 13-foot tall flightless bird. Stuck together in the wilds of the jungle, Carl realizes that sometimes life\\'s biggest adventures aren\\'t the ones you set out looking for. Including the hilarious short film \"Dug\\'s Special Mission,\" UP reaches new heights on Blu-ray(TM) and DVD. \"You will want to see it again and again,\" raves Christopher Kelly of the Fort Worth Star-Telegram. It\\'s adventure that will send your spirits soaring!', 'Amazon.com', 'At a time when too many animated films consist of anthropomorphized animals cracking sitcom one-liners and flatulence jokes, the warmth, originality, humor, and unflagging imagination of', 'Up', \"feel as welcome as rain in a desert. Carl Fredericksen (voice by Ed Asner) ranks among the most unlikely heroes in recent animation history. A 78- year-old curmudgeon, he enjoyed his modest life as a balloon seller because he shared it with his adventurous wife Ellie (Ellie Docter). But she died, leaving him with memories and the awareness that they never made their dream journey to Paradise Falls in South America. When well-meaning officials consign Carl to Shady Oaks Retirement Home, he rigs thousands of helium balloons to his house and floats to South America. The journey's scarcely begun when he discovers a stowaway: Russell (Jordan Nagai), a chubby, maladroit Wilderness Explorer Scout who's out to earn his Elderly Assistance Badge. In the tropical jungle, Carl and Russell find more than they bargained for: Charles Muntz (Christopher Plummer), a crazed explorer whose newsreels once inspired Carl and Ellie; Kevin, an exotic bird with a weakness for chocolate; and Dug (Bob Peterson), an endearingly dim golden retriever fitted with a voice box. More importantly, the travelers discover they need each other: Russell needs a (grand)father figure; Carl needs someone to enliven his life without Ellie. Together, they learn that sharing ice-cream cones and counting the passing cars can be more meaningful than feats of daring-do and distant horizons. Pete Docter (\", 'Monsters, Inc', \". ) and Bob Peterson direct the film with consummate skill and taste, allowing the poignant moments to unfold without dialogue to Michael Giacchnio's vibrant score. Building on their work in\", 'The Incredibles', 'and', 'Ratatouille', \", the Pixar crew offers nuanced animation of the stylized characters. Even by Pixar's elevated standards,\", 'Up', 'is an exceptional film that will appeal of audiences of all ages. Rated PG for some peril and action. --', 'Charles Solomon', 'Stills from', 'Up', '(Click for larger image)', 'Set Contains:', \"The eagerly awaited Blu-ray of Pixar's hit\", 'Up', 'comes loaded with extras, including two animated shorts: Peter Sohn\\'s \"Partly Cloudy,\" which screened with the feature in its theatrical release, and a new film, \"Dug\\'s Special Mission.\" Directed by Ronnie Del Carmen, \"Special Mission\" reveals how Dug, the dim but lovable golden retriever, met Carl and Russell. \"Adventure Is Out There\" documents the research trip a key group of artists took to the Tapuis in South America and includes not only footage of the precipitous ascent of the mountain, but watercolor sketches the artists did there. Alternate versions of key moments in the film show how these scenes changed during preproduction and why. An early storyboard of the wordless \"Married Life\" sequence that reduced many viewers to tears could have worked, but it\\'s far less satisfying than the final iteration. Discussions of the characters Carl and Russell include preliminary art and footage of director Pete Docter working with child actor Jordan Nagai. In a thoughtful interview, composer Michael Giacchino explains his use of musical motifs for the individual characters, and how shifts from major to minor chords suggest different moods. The Global Guardian Badge Game narrated by Nagai is an interesting geography quiz that would be more fun if the controls were better calibrated--it\\'s hard to land a cursor on Delaware or Belgium when it keeps drifting away. The bonus materials suggest that if Pixar consistently makes the best animated films in America, it\\'s because such talented artists work so hard on them.', '--Charles Solomon', 'See more']\n{'Genre': 'Kids & Family, Animation, Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Don Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bob Peterson, David Kaye, Mickie T. McGowan, Josh Cooley, Co-Directed By Bob Peterson, Jeremy Leary, Jess HarnellDon Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bo…   See more', 'Language': 'English (DTS 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 6.4 Ounces', 'Item model number': '786936791068', 'Director': 'Directed By Pete Docter, Co-Directed By Bob Peterson', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Ed Asner, Christopher Plummer, Jordan Nagai, Bob Peterson, Delroy Lindo', 'Subtitles': 'French, Spanish', 'Studio': 'Disney*Pixar', 'Writers': 'Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter', 'Number of discs': '4'}\nEither you like the movie or you don't!!!\nQualty Product\nCutthroat Island [Blu-ray]\nGeena Davis  (Actor),     Matthew Modine  (Actor),     Renny Harlin  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Geena Davis, Matthew Modine. A swashbuckling female pirate sails the seven seas in search of fortune and glory. But with only a piece of a treasure map to go on and talk of mutiny in the ranks, will her crew of scallywags make her walk the plank before she can dig up the booty? 1995/color/118 min/PG-13.', 'Amazon.com', 'Geena Davis (THELMA & LOUISE, BEETLEJUICE) and Matthew Modine (MARRIED TO THE MOB, FULL METAL JACKET) deliver a tidal wave of nonstop action and adventure in this swashbuckling saga of ruthless pirates, buried treasure and bloodthirsty betrayal.']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Frank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew ModineFrank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew Modine  See more', 'Language': 'English, French', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 84min', 'Director': 'Renny Harlin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'August 11, 2009', 'Actors': 'Geena Davis, Matthew Modine, Frank Langella, Chris Masterson, Maury Chaykin', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality Product\n2001: A Space Odyssey [Blu-ray]\nKeir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality Product",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user continues to favor classic action and adventure films, emphasizing the James Bond franchise and animated films with rich storytelling. They also appreciate swashbuckling narratives featuring strong female leads coupled with comedic elements, demonstrating a versatile taste in genres. Recently, their interest has expanded to include timeless science fiction classics known for their innovative narratives.\n\n- **Format Preference:** The user remains steadfast in their preference for high-quality media formats, particularly Blu-ray, ensuring optimal viewing experiences across a range of genres, including science fiction.\n\n- **Reviewing Style:** They consistently provide concise, opinionated feedback, favoring straightforward statements that succinctly express their sentiments, as evident in their recent review reflecting a decisive viewpoint on a classic film.\n\n- **Engagement Level:** The user is highly engaged with cinematic content, offering detailed ratings and reflections. They appreciate dynamic narratives and memorable characters, with an average film rating preference of 4.5 or higher.\n\n- **General Taste in Movies:** Films with strong narratives and cultural significance attract their attention, especially those exhibiting high production values and notable talent both in front of and behind the camera.\n\n- **Other Preferences:** The user displays an ongoing enthusiasm for action-oriented narratives that simultaneously offer emotional depth and humor, solidifying their status as a dedicated cinephile eager to explore diverse cinematic expressions.",
  "metrics": {
    "rouge1_f": 0.0751592356687898,
    "rouge2_f": 0.0076481835564053535,
    "rougeL_f": 0.038853503184713374,
    "meteor": 0.020767273626797953,
    "bleu1": 4.3751489805144543e-07,
    "bleu2": 1.6429281822525198e-07,
    "bleu3": 4.615393822493508e-08,
    "bleu4": 1.3769043127515875e-08,
    "bertscore_precision": 0.34358566999435425,
    "bertscore_recall": 0.4968762695789337,
    "bertscore_f1": 0.4062517285346985
  }
}