{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Postman (Keep Case Packaging)\nReview Date: 2018/07/07\nStore: Will Patton  (Actor),     Larenz Tate  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\nProduct Description: ['Postman, The (DVD)', \"Academy Award-winner Kevin Costner directs and stars in this post-apocalyptic thriller. In 2013 anarchy reigns, until a solitary wanderer discovers a postman's uniform, delivers letters ... and rekindles a spirit of revolution.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Tom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz TateTom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz Tate  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5822703', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 57 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Kevin Costner, Will Patton, Larenz Tate, Olivia Williams, Scott Bairstow', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, English', 'Producers': 'Jim Wilson, Steve Tisch, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Eric Roth, Brian Helgeland', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: this. is a great movie, but have not watched this dvd yet\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Most Wonderful Time of the Year\nHenry Winkler  (Actor),     Brooke Burns  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Romantic\n['Five-time Emmy nominee and Golden Globe winner Henry Winkler stars in The Most Wonderful Time of the Year, the story of what happens when you open your heart to the power of Christmas. Disenchanted single mom Jennifer Cullen (Brooke Burns) is a Scroogette when it comes to anything Christmas. In fact, even her six-year-old son, Brian, is having trouble believing in Santa Claus. But when her Uncle Ralph (Henry Winkler) visits and brings a fellow passenger from his flight named Morgan Derby (Warren Christie), Jennifer s dubious heart awakens to the possibility that perhaps Christmas really does hold miracles. It s uplifting and laugh-packed and a story that will inspire the whole family to believe.']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Henry Winkler, Brooke Burns', 'Language': 'Unqualified', 'Runtime': '1 hour and 27 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '782580', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 27 minutes', 'Release date': 'October 13, 2009', 'Actors': 'Henry Winkler, Brooke Burns', 'Studio': 'CINEDIGM', 'Number of discs': '1'}\nwatch this movie over and over again, just love it.\njust love it.\nThe Christmas Card (Hallmark)\nEdward Asner  (Actor),     Brian Robinson (XV)  (Actor),     Stephen Bridgewater  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Once in a while; a movie comes along that reminds us how powerful love can be. In the midst of war in Afghanistan; Captain Codey Cullen (John Newton; \"Desperate Housewives\") is touched by a lovely card sent by Faith Spelman (\"The Chris Isaak Show\") from the small picturesque town of Nevada City; California. As months pass; the card never leaves his side; giving him the strength to survive and setting him on a mission to find her. When Cody returns to the States; he finds himself coincidentally welcomed by her family and friends; but he remains hesitant to reveal the fateful connection that brought him to her. As a new Christmas approaches; Cody has one last opportunity to prove his courage - by taking a chance on love and finding the woman; the home; and the life he\\'s always wanted.']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Rachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice Evans, Lois Nettleton, Nick Hodaly, Kelly Stringfellow, John Newton (II), Lisa CornelisonRachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.51 x 7.56 inches; 2.4 Ounces', 'Item model number': '80598', 'Director': 'Stephen Bridgewater', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '1 hour and 24 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Edward Asner, Brian Robinson (XV), John Newton (II), Alice Evans, Lois Nettleton', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nMy favorite Christmas type movie.. I just love it. It's not even just a Christmas movie, but a good family type movie to watch anytime.\nFive Stars\nThe Butcher's Wife [DVD]\nDemi Moore  (Actor),     Jeff Daniels  (Actor),     Terry Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n[\"The Butcher's Wife (Widescreen) (Bilingual)\"]\n{'Genre': 'Kids & Family', 'Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Demi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson Baker, Stephanie Laurence, Sam Menning, Helen Hanft, Steve Love, Frank Tidy, Luis Avalos, Miriam Margolyes, Margaret Colin, Max Perlich, Barry NeikrugDemi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson…  See more', 'Language': 'English, French', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Terry Hughes', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'October 23, 2001', 'Actors': 'Demi Moore, Jeff Daniels, George Dzundza, Mary Steenburgen, Frances McDormand', 'Dubbed': 'English, French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\none of my favorite movies, had to have it, so glad you had it in your inventory.\nFive Stars\nMask\nCher  (Actor),     Eric Stoltz  (Actor),     Peter Bogdanovich  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Acclaimed filmmaker Peter Bogdanovich directed this heartwarming and inspirational film based on the real-life story of Rocky Dennis (Eric Stoltz), a terribly disfigured but highly sensitive and intelligent teenager. Motivated by his loving mother, Rusty (Cher), and her boyfriend, Gar (Sam Elliott), Rocky ultimately overcomes pain, loneliness and prejudice to become a role model to his classmates and teachers alike.Bonus Content:', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich']\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie', 'Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more\", 'Contributor': 'Peter Bogdanovich, Cher, Eric Stoltz, Sam Elliott', 'Language': 'Unqualified, English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), English (DTS 5.1)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '1022788', 'Director': 'Peter Bogdanovich', 'Media Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen\", 'Run time': '2 hours and 7 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Cher, Eric Stoltz, Sam Elliott', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nanother of my favorite movies. glad you had it.\nFive Stars\nBy the Light of the Silvery Moon\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Product Description', 'By the Light of the Silvery Moon (DVD)', '\"On Moonlight Bay\" stars Doris Day and Gordon MacRae are back together in top tune-crooning form for the further adventures of a small-town family turning the corner from World War I into the Roaring \\'20s. Year: 1953 Director: David Butler Starring: Doris Day, Gordon MacRae, Billy Gray', ']]>', 'Amazon.com', 'The huge popularity of the nostalgic', 'On Moonlight Bay', 'prompted this 1953 sequel, which recaptures the first film\\'s small-town, post-WWI spirit. Because young lovers Doris Day and Gordon MacRae are already together, the movie needs some sort of trumped-up conflict to separate them for a while; it comes with MacRae\\'s decision to postpone their wedding until he gets his financial legs. Yawn. But don\\'t worry, the subplots abound, including younger brother Billy Gray pilfering a prize Thanksgiving turkey, and dad Leon Ames suspected of romancing a visiting French music-hall star. Naturally there are vintage songs, including umpteen renderings of the classic title song (you won\\'t need the bouncing ball to sing along) and Day and MacRae casually bopping out new lyrics to \"Ain\\'t We Got Fun.\" Also returning for the sequel are Rosemary DeCamp as the patient mother and shameless scene-stealer Mary Wickes as the bossy maid. And check it out: future talk-show host Merv Griffin cheerleading during the finale at an outdoor ice rink. Day and MacRae twinkle so aggressively that they sometimes resemble salesmen for a particular kind of Hollywood backlot America that probably never existed, but the whole thing is almost impossible to resist.', '--Robert Horton']\n{'Genre': 'Musicals & Performing Arts/Musicals', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Various', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.72 Ounces', 'Item model number': '2231834', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 41 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nlove old Doris day movies, glad you had it.\nFive Stars\nOn Moonlight Bay\nDoris Day  (Actor),     Gordon MacRae  (Actor),     Roy Del Ruth  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Product Description', 'On Moonlight Bay (DVD)', \"A happy screenful of sun-kissed melody and kiss-by-moonlight romance! After moving to Indiana, young Marjorie Winfield begins a relationship with William Sherman, who lives across the street. Marjorie is a tom-boy, and her father has traditional views not shared by William. Marjorie is forced to learn to dance, despite her and Williams' shared love for baseball. Starring Doris Day and Gordon MacRae.\", ']]>', 'Amazon.com', \"America's love affair with clean-cut, tomboyish, freckle-faced Doris Day got a boost with\", 'On Moonlight Bay', \", a period piece from 1951. The film's masterstroke: put Doris in an old-timey musical full of small-town family values and vintage songs. Another inspiration: pair off Doris again with that chesty-voiced man's man and future Rodgers and Hammerstein stalwart, Gordon MacRae (they'd already made\", 'Tea for Two', 'and', 'The West Point Story', \"). The story is drawn from Booth Tarkington's Penrod tales, although the movie is also under the sway of\", 'Meet Me in St. Louis', '. The WWI-era family is anchored by parents Leon Ames (the pop from', 'St. Louis', ') and Rosemary De Camp, with echt-Fifties boy Billy Gray (later of', 'Father Knows Best', \") as Day's bratty younger brother. Mary Wickes, cinema's eternal sassy housekeeper, provides comic relief. So does radio crooner Jack Smith, who would later host\", 'You Asked for It', \"on TV for many years, as Day's maladroit suitor (he's really funny--too bad Preston Sturges never got a hold of him). The material is so relentlessly wholesome you might have to pinch yourself that anybody really believed it, but audiences sure wanted to. The film's popularity prompted a sequel,\", 'By the Light of the Silvery Moon', ', with most of the cast intact.', '--Robert Horton']\n{'Genre': 'Musicals & Performing Arts/Musicals, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Leon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del RuthLeon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del Ruth  See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.88 Ounces', 'Item model number': '2231837', 'Director': 'Roy Del Ruth', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Doris Day, Gordon MacRae, Jack Smith, Leon Ames, Rosemary DeCamp', 'Subtitles': 'English, Spanish', 'Producers': 'William Jacobs', 'Studio': 'WarnerBrothers', 'Writers': 'Booth Tarkington, Jack Rose', 'Number of discs': '1'}\nLove it\nFive Stars\nMessage in a Bottle (Keepcase)\nRobin Wright  (Actor),     John Savage  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Message in a Bottle (DVD)', 'Grieving widower Garret Blake builds boats for a living. Theresa Osborne, a lonely divorcee and researcher for the Chicago Tribune, tracks down Garret after finding a message he wrote inside a bottle on a Cape Code beach and profoundly touched her heart.', ']]>']\n{'Genre': 'Drama/Love & Romance, Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Denise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis MandokiDenise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis Mandoki  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 11 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000112599DVD', 'Director': 'Luis Mandoki', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Kevin Costner, Robin Wright, John Savage, Illeana Douglas, Robbie Coltrane', 'Subtitles': 'English', 'Producers': 'Denise Di Novi, Jim Wilson, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Gerald DiPego', 'Number of discs': '1'}\nthis movie is a classic, love your inventory.\nlove your inventory\nOnce Around [DVD]\nRichard Dreyfuss  (Actor),     Holly Hunter  (Actor),     Lasse Hallstrom  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Richard Dreyfuss and Holly Hunter lead an all-star cast in this critically acclaimed tale of life, love and chance. Jilted by her boyfriend, Renata (Hunter), the oldest daughter of a close-knit Italian-American family, falls in love with Sam (Dreyfuss), an abrasive and forcefully charming businessman.But neither her spirited sister (Laura San Giacomo), her down-to-earth father (Danny Aiello), or her supportive mother (Gena Rowlands) can tolerate Sam's often obnoxious intrusion into their family circle.Aggressive and overwhelmingly generous, Sam proceeds - with only the best intentions - to disrupt and nearly demolish Renata's family. Love, humor and forgiveness go once more around as the Bellas try to balance Renata's happiness with their family's survival in this funny and often touching story, directed by Lasse Hallström.\", ']]>']\n{'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Contributor': 'Laura San Giacomo, Lasse Hallstrom, Danny Aiello, Gena Rowlands, Richard Dreyfuss, Holly Hunter', 'Initial release date': '2010-06-01', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '25192422027', 'Director': 'Lasse Hallstrom', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Richard Dreyfuss, Holly Hunter, Gena Rowlands, Danny Aiello, Laura San Giacomo', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\ndidn't watch yet, but bought cuz I love this movie.\ngreat movie\nThe Postman (Keep Case Packaging)\nWill Patton  (Actor),     Larenz Tate  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\n['Postman, The (DVD)', \"Academy Award-winner Kevin Costner directs and stars in this post-apocalyptic thriller. In 2013 anarchy reigns, until a solitary wanderer discovers a postman's uniform, delivers letters ... and rekindles a spirit of revolution.\", ']]>']\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Tom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz TateTom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz Tate  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5822703', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 57 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Kevin Costner, Will Patton, Larenz Tate, Olivia Williams, Scott Bairstow', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, English', 'Producers': 'Jim Wilson, Steve Tisch, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Eric Roth, Brian Helgeland', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthis. is a great movie, but have not watched this dvd yet\ngreat movie",
  "profile": "**User Profile Summary:**\n\n- **Genre Preference:** The user continues to have a strong affinity for holiday-themed movies, particularly Christmas narratives laced with romance and drama. They also appreciate uplifting family-friendly comedies and classic musicals featuring iconic actors.\n\n- **Emotional Tone:** Heartwarming stories that evoke joy, love, and familial connections remain a priority, focusing on emotionally resonant experiences.\n\n- **Rewatch Value:** Films with high rewatch potential are favored, offering comfort and familiarity, especially during the holiday season.\n\n- **Rating Behavior:** The user consistently rates films highly, maintaining an average around 4.9. Their recent engagement demonstrates their fondness for beloved narratives, highlighted by a 5.0 rating for a nostalgic film they cherish, emphasizing their appreciation for timeless storytelling.\n\n- **Actor Preference:** They have a clear appreciation for established actors, believing their performances greatly enhance the viewing experience, particularly in classics.\n\n- **Family-Friendly Atmosphere:** The user engages with all-ages content, choosing films that promote family connections. Their latest interaction reflects their enjoyment of narratives that blend love, humor, and familial dynamics, reinforcing their commitment to heartfelt storytelling and wholesome entertainment.\n\n- **Recent Interaction:** The user rated a film highly, indicating an openness to diverse genres beyond their usual preferences, while still valuing the emotional depth and engaging storytelling typical of their favored themes.",
  "metrics": {
    "rouge1_f": 0.06867233485938522,
    "rouge2_f": 0.0058900523560209425,
    "rougeL_f": 0.03858731196860693,
    "meteor": 0.019251007469390895,
    "bleu1": 1.93472245973043e-07,
    "bleu2": 5.595171383639568e-08,
    "bleu3": 8.266523922219007e-09,
    "bleu4": 3.1803376175902706e-09,
    "bertscore_precision": 0.3443862199783325,
    "bertscore_recall": 0.4929744601249695,
    "bertscore_f1": 0.4054969549179077
  }
}