{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/09/18\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick'], 'Studio': ['CBS']}\nReview Text: Great finale! ....looking forward to season 6\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Train - Midnight Moon\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Train Midnight Moon']\n{'Genre': 'Musicals & Performing Arts, Train Midnight Moon', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Train', 'Language': 'English', 'Runtime': '3 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.3 x 7.5 x 0.62 inches; 4 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '3 hours and 14 minutes', 'Release date': 'December 18, 2001', 'Actors': 'Train', 'Studio': 'Sony Legacy', 'Number of discs': '1'}\nThis DVD arrived as promised, actually they came in a little earlier than promised and they are good quality. Would order again from this site.\nGreat Product\nRemembering 9/11: 10 Year Commemorative Collection\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n['National Geo Remember']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5 x 1.5 inches; 6.91 Ounces', 'Media Format': 'DVD', 'Release date': 'September 6, 2011', 'Number of discs': '4'}\nThese DVDs arrived as promised,actually they arrived earlier than promised and  the quality of the product is very good. Would order again from this site\nVery Good DVDs\nThe Fugitive: The Fourth and Final Season, Volume Two\nDavid Janssen  (Actor),     Barry Morse  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Dr. Richard Kimble is accused to be the murder of his wife. The night before his execution, he escapes. The only chance to prove his innocence is to find the man who killed his wife. Kimble, persecuted by the Lt. Gerard, risks his life several times when he shows his identity to help other people out of trouble.']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'William Conrad, Bill Raisch, David Janssen, Barry Morse', 'Language': 'English', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 5.6 Ounces', 'Item model number': '15690532', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '12 hours and 53 minutes', 'Release date': 'August 4, 2015', 'Actors': 'David Janssen, Barry Morse, Bill Raisch', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nThese DVDs arrived as promised, actually they came in a little earlier than promised and they are good quality. Would order again from this site.\nGreat Product\nThe Fugitive: The Fourth and Final Season, Volume One\nDavid Janssen  (Actor),     Barry Morse  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Dr. Richard Kimble is accused to be the murder of his wife. The night before his execution, he escapes. The only chance to prove his innocence is to find the man who killed hi wife. Kimble, persecuted by the Lt. Gerard, risks his life several times when he shows his identity to help other people out of trouble.']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'William Conrad, Bill Raisch, David Janssen, Barry Morse', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 5.6 Ounces', 'Item model number': '14982259', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '11 hours and 6 minutes', 'Release date': 'August 4, 2015', 'Actors': 'David Janssen, Barry Morse, Bill Raisch, William Conrad', 'Studio': 'CBS/Paramount', 'Country of Origin': 'USA', 'Number of discs': '4'}\nThese DVDs arrived as promised, actually they came in a little earlier than promised and they are good quality. Would order again from this site.\nGreat Product\nThe Right Stuff (Two-Disc Special Edition)\nScott Glenn  (Actor),     Ed Harris  (Actor),     Philip Kaufman  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n['Product Description', 'Right Stuff, The: Special Edition (Dbl DVD)', \"In the middle of the 20th century, America pondered its future - and looked to the skies. Based on Tom Wolfe's book, The Right Stuff is the tale of how that future began, a thrilling epic of intrepid test pilot Chuck Yeager and the seven pioneering astronauts of the Project Mercury space program. Philip Kaufman scripts and directs, pushing the envelope with a filmmaking bravado that matches this soaring story of training and heroism; and of sudden fame for which there is no training. Ed Harris, Barbara Hershey, Sam Shepard, Dennis Quaid and Fred Ward are among the perfect cast of this winner of 4 Academy Awards* that in a pristine 20th-anniversary digital transfer remains the stuff of must-see entertainment. Let's light this candle, flyboys!\", ']]>', 'Set Contains:', \"For the film's 20th anniversary, a new two-disc edition replaces the original bare-bones DVD. The film looked pretty good on the old disc, but there is more depth to the remastered soundtrack and better yet, you don't need to flip the disc to view the entire film. The second disc of extras is well done, but a bit light. There are 20-minute commentaries from director Philip Kauffman and another track of many actors' fond reminisces of working on the film. They are so engaging it's odd to think there wasn't enough to do a complete commentary track, or even two. A newly produced three-part documentary looks at the project from Tom Wolfe's book to screenplay, the making-of the movie, and interviews with the real participants of the saga. Again, the running time (45 minutes) feels too short. The 13 additional scenes, sans set-up, are really pieces from the cutting-room floor but curiously interesting. The bulk of the extras is the 90-minute PBS program on the life and times of John Glenn, aired around the time of--and mostly about--his second trip into space in 1998. The DVD extras could have used an outside voice--or historian or film critic--to give an objective viewpoint to this outstanding film.\", '--Doug Thomas']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, Closed-captioned, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, Anamorphic, Color, Dolby, Closed-captioned, NTSC, Special Edition, Subtitled, Widescreen  See more', 'Contributor': 'Pamela Reed, Irwin Winkler, Barbara Hershey, Philip Kaufman, Donald Moffat, Kathy Baker, Veronica Cartwright, Kim Stanley, Dennis Quaid, Lance Henriksen, Sam Shepard, Tom Wolfe, Fred Ward, Scott Glenn, Robert Chartoff, Scott Wilson, Ed HarrisPamela Reed, Irwin Winkler, Barbara Hershey, Philip Kaufman, Donald Moffat, Kathy Baker, Veronica Cartwright, Kim Stanley, Dennis Quaid, Lance Henriksen, Sam Shepard, Tom Wolfe, Fred Ward, Scott Glenn, Robert Chartoff, Scott Wilson, Ed Harris  See more', 'Initial release date': '2005-12-13', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 5.6 Ounces', 'Item model number': '2232393', 'Director': 'Philip Kaufman', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, Closed-captioned, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '3 hours and 13 minutes', 'Release date': 'December 13, 2005', 'Actors': 'Scott Glenn, Ed Harris, Barbara Hershey, Dennis Quaid, Pamela Reed', 'Subtitles': 'English, Spanish, French', 'Producers': 'Robert Chartoff, Irwin Winkler', 'Studio': 'Studio Distribution Services', 'Writers': 'Philip Kaufman, Tom Wolfe', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis is a very good DVD that covers the early space test and exploration. If you like space stuff you will truly enjoy it very much.Would recommend to my friends.\nGreat DVD\nFrozen\nComedy, Animation, Dreamlike, Exciting\n['Encountering Everest-like conditions, mystical trolls and a hilarious snowman named Olaf, Anna and Kristoff battle the elements in a race to save the kingdom.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Buck', 'Jennifer Lee'], 'Producers': ['Peter Del Vecho'], 'Starring': ['Kristen Bell', 'Idina Menzel', 'Jonathan Groff']}\nWe enjoy this movie with our 5 year old granddaughter. She really like to sing along with the characters on the screen\nVery Nice Movie\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick'], 'Studio': ['CBS']}\nGreat finale! ....looking forward to season 6\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference**: The user continues to prioritize music-related content and family-friendly animated films, now also showing interest in engaging narratives found in various genres, including series with a dramatic flair. Their recent purchase emphasizes a preference for entertaining storylines, indicating a likely interest in both comedic and serious themes that resonate with diverse audiences.\n\n- **Genre Affinity**: Commitment to musicals and performing arts remains, coupled with a growing interest in dramatic serials. The user enjoys narratives that creatively explore a range of themes, suggesting a nuanced appreciation for content that maintains entertainment value while addressing more serious subjects.\n\n- **Quality Expectation**: Expectations for high-quality production persist, now extending to both animated films and dramatic series. The user seeks well-crafted content that engages viewers, indicating an appreciation for production values across various media.\n\n- **Shopping Behavior**: Loyalty to reliable platforms continues, highlighted by recent activities revealing a balance between enriching musical interests and a broader exploration of entertaining series for family viewing.\n\n- **Rating Tendencies**: The user actively rates products highly when they meet or exceed expectations, reflecting a commitment to sharing favorable experiences. Their recent review indicates an enthusiasm for engaging narratives and a willingness to endorse quality.\n\n- **Media Format**: A versatile approach to digital and physical content prevails, with a focus on compelling storytelling that appeals to both adults and younger viewers.\n\nOverall, the user exhibits a passion for diverse entertainment that fosters family engagement while maintaining a commitment to quality and reliability in service.",
  "metrics": {
    "rouge1_f": 0.12409638554216866,
    "rouge2_f": 0.006031363088057901,
    "rougeL_f": 0.055421686746987955,
    "meteor": 0.03920421322504937,
    "bleu1": 0.0010531804752470092,
    "bleu2": 0.000292573511708773,
    "bleu3": 4.435267903095822e-05,
    "bleu4": 1.7282896192380416e-05,
    "bertscore_precision": 0.35580456256866455,
    "bertscore_recall": 0.46731090545654297,
    "bertscore_f1": 0.40400493144989014
  }
}