{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/04/20\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christian J. Pinto'], 'Producers': ['Adullam Films'], 'Starring': ['Chris Pinto', 'Ed Decker'], 'Studio': ['Total Content Digital']}\nReview Text: Christian propaganda and prejudice\nReview Title: One Star\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Queen Margot [VHS]\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Art House & International, By Country, France\n['Product Description', \"A classic tale of intrigue and forbidden love, QUEEN MARGOT is the powerful hit universally acclaimed by critics! Thrown into a political marriage of convenience by her ruthlessly power-hungry family, the beautiful Margot (Isabelle Adjani -- CAMILLE CLAUDEL) soon finds herself hopelessly drawn into their murderous affairs. It's then she realizes that her only hope of escape lies somewhere between the heroic soldier who loves her and the enemy husband who could save her! Triumphant winner of 5 Cesar Awards the pretigious Cannes Film Festival Jury Prize -- you're sure to be entertained by this vivid portrayal of passion, revenge, and extraordinary courage!\", 'Amazon.com', 'Based on a novel by Alexandre Dumas,', 'Queen Margot', \"concerns the events behind infamous Massacre of St. Bartholomew in 16th-century France. Isabelle Adjani plays Margot, betrothed for political reasons to one man (Daniel Auteuil) by her mother (Virna Lisi), while she is, in fact, in love with another (Vincent Pérez). Despite the bond that grows between the reluctant couple, plots are hatching all over the castle against the royals. Adventurous, exciting, erotic, and given strong artistic credibility through its outstanding cast, the film is enthralling and visually sumptuous. Directed by Patrice Chereau, less known outside of France than is the film's producer, Claude Berri (director of\", 'Jean de Florette', 'and', 'Manon of the Spring', ').', '--Tom Keogh']\n{'Format': 'Color, Dolby, Subtitled, NTSC, HiFi Sound', 'Contributor': 'Adjani, Anglade, Auteuil', 'Language': 'Russian', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'April 30, 1996', 'Date First Available': 'September 29, 2006', 'Actors': 'Adjani, Auteuil, Anglade', 'Subtitles': 'English', 'Studio': 'Miramax', 'Country of Origin': 'USA'}\nNot the Queen Margot I expected.  It had subtitles and a different plot.\nOne Star\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christian J. Pinto'], 'Producers': ['Adullam Films'], 'Starring': ['Chris Pinto', 'Ed Decker'], 'Studio': ['Total Content Digital']}\nChristian propaganda and prejudice\nOne Star",
  "profile": "**User Profile Summary:**\n\n- **Medium Preference**: Strong inclination towards films, particularly in international and art house categories, with a specific focus on French cinema.\n- **Format Preference**: Historically engaged with physical media formats such as VHS.\n- **Critical Engagement**: Demonstrates a discerning approach to films, often starting with high expectations but displaying dissatisfaction when content strays from anticipated narrative norms or themes. Recent interactions highlight a shift towards dissatisfaction with perceived biases and lack of artistic integrity.\n- **Subtitles**: Discontent with subtitles remains evident, reinforcing a preference for dubbed or non-subtitled formats when consuming foreign films, as these elements can detract from the viewing experience.\n- **Ratings**: Engages in detailed and thoughtful ratings, emphasizing narrative coherence and thematic depth. Notably, the user has shown a tendency to rate films considerably lower when they encounter elements perceived as propaganda or bias.\n- **Themes of Interest**: Engages with themes of romance, political intrigue, and historical narratives, with a clear expectation for clarity and alignment with personal values.\n- **User Experience**: Values an accessible and clear viewing experience, expressing disappointment when films present unforeseen biases or when expectations regarding narrative and presentation are not met.\n\nOverall, the user exhibits a passion for international films, tempered by a growing critical awareness of content integrity and a need for a comfortable viewing format, reflecting increased sensitivity to thematic presentation.",
  "metrics": {
    "rouge1_f": 0.18962432915921287,
    "rouge2_f": 0.010771992818671455,
    "rougeL_f": 0.08586762075134169,
    "meteor": 0.09272897274709174,
    "bleu1": 0.10388257924201362,
    "bleu2": 0.026015850492775237,
    "bleu3": 0.004800521513088726,
    "bleu4": 0.002063924990593701,
    "bertscore_precision": 0.3661480247974396,
    "bertscore_recall": 0.4293980300426483,
    "bertscore_f1": 0.39525866508483887
  }
}