{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/04/20\nAverage Rating: 3.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Goh Choon Ean'], 'Producers': ['Goh Choon Ean'], 'Starring': ['Tan Siao Ping', 'Wendy Lim', 'Susanna Leung'], 'Studio': ['Vision Video']}\nReview Text: Excellent overview of Chinese history followed by Christian propaganda\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Queen Margot [VHS]\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Art House & International, By Country, France\n['Product Description', \"A classic tale of intrigue and forbidden love, QUEEN MARGOT is the powerful hit universally acclaimed by critics! Thrown into a political marriage of convenience by her ruthlessly power-hungry family, the beautiful Margot (Isabelle Adjani -- CAMILLE CLAUDEL) soon finds herself hopelessly drawn into their murderous affairs. It's then she realizes that her only hope of escape lies somewhere between the heroic soldier who loves her and the enemy husband who could save her! Triumphant winner of 5 Cesar Awards the pretigious Cannes Film Festival Jury Prize -- you're sure to be entertained by this vivid portrayal of passion, revenge, and extraordinary courage!\", 'Amazon.com', 'Based on a novel by Alexandre Dumas,', 'Queen Margot', \"concerns the events behind infamous Massacre of St. Bartholomew in 16th-century France. Isabelle Adjani plays Margot, betrothed for political reasons to one man (Daniel Auteuil) by her mother (Virna Lisi), while she is, in fact, in love with another (Vincent Pérez). Despite the bond that grows between the reluctant couple, plots are hatching all over the castle against the royals. Adventurous, exciting, erotic, and given strong artistic credibility through its outstanding cast, the film is enthralling and visually sumptuous. Directed by Patrice Chereau, less known outside of France than is the film's producer, Claude Berri (director of\", 'Jean de Florette', 'and', 'Manon of the Spring', ').', '--Tom Keogh']\n{'Format': 'Color, Dolby, Subtitled, NTSC, HiFi Sound', 'Contributor': 'Adjani, Anglade, Auteuil', 'Language': 'Russian', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'April 30, 1996', 'Date First Available': 'September 29, 2006', 'Actors': 'Adjani, Auteuil, Anglade', 'Subtitles': 'English', 'Studio': 'Miramax', 'Country of Origin': 'USA'}\nNot the Queen Margot I expected.  It had subtitles and a different plot.\nOne Star\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christian J. Pinto'], 'Producers': ['Adullam Films'], 'Starring': ['Chris Pinto', 'Ed Decker'], 'Studio': ['Total Content Digital']}\nChristian propaganda and prejudice\nOne Star\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Goh Choon Ean'], 'Producers': ['Goh Choon Ean'], 'Starring': ['Tan Siao Ping', 'Wendy Lim', 'Susanna Leung'], 'Studio': ['Vision Video']}\nExcellent overview of Chinese history followed by Christian propaganda\nFour Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Medium Preference**: The user maintains a strong inclination towards films, particularly in international and art house categories, with a specific focus on French cinema.\n- **Format Preference**: Continues to engage with physical media formats such as VHS.\n- **Critical Engagement**: Shows a discerning approach to films, often starting with high expectations but increasingly dissatisfied when content deviates from anticipated narrative norms or themes. Recent interactions underscore a growing sensitivity to perceived biases and a lack of artistic integrity. \n- **Subtitles**: Discontent with subtitles remains prevalent, highlighting a clear preference for dubbed or non-subtitled formats, as they detract from the overall viewing experience.\n- **Ratings**: Engages in thoughtful ratings, emphasizing narrative coherence and thematic depth. A pattern of rating films lower arises when encountering elements perceived as propaganda or bias, despite recognizing quality aspects like historical overviews.\n- **Themes of Interest**: Engages with themes of romance, political intrigue, and historical narratives, expecting clarity and alignment with personal values.\n- **User Experience**: Values an accessible and clear viewing experience, expressing disappointment when films present unforeseen biases or fail to meet expectations regarding narrative and presentation.\n\nThe user's passion for international films persists, balanced by an acute awareness of content integrity and a need for comfortable viewing formats, demonstrating an ongoing sensitivity to thematic presentation while navigating complex narratives.",
  "metrics": {
    "rouge1_f": 0.1888701517706577,
    "rouge2_f": 0.010152284263959392,
    "rougeL_f": 0.0775716694772344,
    "meteor": 0.08091891469619393,
    "bleu1": 0.0793218017013141,
    "bleu2": 0.013938439348036749,
    "bleu3": 0.0028795324634831518,
    "bleu4": 0.0013099666088608676,
    "bertscore_precision": 0.35976260900497437,
    "bertscore_recall": 0.4268955588340759,
    "bertscore_f1": 0.39046451449394226
  }
}