{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tropic Labs Smart Screen | Broad Spectrum SPF 22 Sunscreen | 2-in-1 Mineral Sunscreen & Natural Tanning Accelerator | Fast Acting Tan Boosting Body Suntan Lotion | Lightweight, Vegan, & Cruelty-Free (TSA Friendly)\nReview Date: 2023/01/07\nStore: Tropic Labs\nAverage Rating: 4.6\nProduct Details: {'Unit Count': '3.5 Fl Oz', 'Skin Type': 'All', 'Brand': 'Tropic Labs', 'Water Resistance Level': 'Water Resistant', 'Age Range (Description)': 'Adult', 'UPC': '850033640182'}\nReview Text: I like this tanning sunscreen. I think the SPF level because it provides protection without being too high to prevent tanning. It goes on nicely and doesn't feel too heavy or greasy on my skin. I like the bottle style and size - it's easy to throw in my bag. The color of the lotion itself is kind of surprising (yellow) because most sun lotions I've used are white but I like the scent - it smells like sun lotion but with a subtle tropical/coconut scent.\nReview Title: Good size bottle and feels lightweight on skin\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Shiny Leaf Vitamin C Serum For Face, Hyaluronic Acid Serum And Retinol Serum Facial Skin Care Products Set, Anti Aging Skin Care Sets For Women And Men, 2 Fl. Oz x 3 - Big Bottles Of Skincare Serums\nShiny Leaf\n{'Product Benefits': 'Hydrating,Anti-aging', 'Use for': 'Face', 'Scent': 'Aloe', 'Brand': 'Shiny Leaf', 'Material Feature': 'Natural', 'Product Dimensions': '4.9 x 1.6 x 5 inches; 14.89 Ounces', 'Item model number': 'SL-TRIO'}\nThis serum set is a great product and has made my skin smooth, younger looking and overall, much healthier. I will note though, that if you're not used to using retinol, do your research and use it sparingly. It definitely can cause your skin to be dry and flaky at first. I only use it every 3 days or so with this regime and make sure to use moisturizer after I finish applying the serums. I use these serums at night and wash my face gently in the morning and I also use sunscreen if I go out after using retinol as it can cause sunburn. Overall, the benefits of retinol and all of these serums are extremely positive.\nGreat set\nEyebrow Stamp Stencil Kit- Easy Way To Get Perfect Eyebrows In Minutes,Waterproof, Middle Brown\nETEDES\n{'Brand': 'ETEDES', 'Finish Type': 'Natural', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.61 x 3.62 x 1.02 inches; 1.45 Ounces'}\nThis stencil kit is a complete joke. First of all, there are very few directions, and the first step is in Spanish while the rest are in English. Secondly, None of these stencils are normal size. Instead, they're about 1 1/4 the length of normal eyebrows. The powder is also much darker than it should be. I ended up looking like a clown when I used it, so I guess the fact that it's not waterproof as advertised is a good thing in this case because I was able to wash it off easily.\nNot waterproof at all\nSO'BiO étic | Baby Soothing Diaper Cream | Organic and Gentle for Newborn, Infant, Toddler | 3.38 fl oz\nSo'Bio Étic\n{'Brand': \"So'Bio Étic\", 'Item Form': 'Cream', 'Item Volume': '3.38 Fluid Ounces', 'Package Dimensions': '5.31 x 1.93 x 1.42 inches; 4.02 Ounces'}\nThis diaper cream is somewhat thin as far as diaper creams go. It is more of a lotion, rather than a thick cream. It definitely is a good moisturizer and seems to help protect sensitive skin. However, I'm not sure that it will completely get rid of a rash once it has completely formed. This is also a smaller tube than I was anticipating.\nWorks ok but somewhat thin\nGLO to Go Teeth Whitening Pen — Easy to Use, Safe & Effective Dentist-Invented Whitening Treatment — Designed for Sensitive Teeth, Travel Friendly, Cinnamint Flavor\n{'Brand': 'GLO Science', 'Product Benefits': 'Natural plant-based ingredients help promote a clean and healthy smile and noticeably whiter teeth in 1 week.Natural plant-based ingredients help promote a clean and healthy smile and noticeably whiter teeth in 1 week.   See more', 'Item Form': 'Pen', 'Number of Items': '1', 'Included Components': 'Teeth Whitening Pen', 'Product Dimensions': '8 x 2 x 3 inches; 1.45 Ounces', 'Item model number': '28103305', 'UPC': '857181002510', 'Manufacturer': 'AmazonUs/RPTMQ'}\nThis teeth whitener is easy to use and my teeth looked whiter after just one use. I like that you only have to wait 20-30 minutes after applying before you can eat/drink and also that you don't have to brush your teeth afterward. When I first used I had to click the button probably 20 times before any of the gel dispensed but after that it was smooth and easy to apply. Right after I use this my teeth look noticeably whiter and brighter especially for the first day or two, but the brightness kind of fades although overall I am seeing, hopefully, a long lasting whiter smile.\nQuick results\nFace Cleaner by Whitney Jean, Gentle Facial Cleanser, Best Simple Daily Face Wash Skin Care Products, Face Wash for Women or Men with Vitamin C, Reduce Appearance of Acne, Face Makeup Remover, Hydrating Skin Care for Sensitive Skin, Oily Skin, Dry Skin\nWhitney Jean\n{'Brand': 'Whitney Jean', 'Scent': 'Lavender, Tea Tree, Aloe Vera, Geranium', 'Number of Items': '1', 'Unit Count': '6.00 Fl Oz', 'Item Package Quantity': '1', 'Product Dimensions': '7.25 x 1.75 x 1.75 inches; 9.59 Ounces', 'Item model number': 'WJPFC'}\nThis face was feels very lightweight and cleanses my skin well. I like the ingredients included and that they don't feel too heavy or harsh. I'm happy with this face wash and I love how pretty the packaging is and that it's in a pump bottle.\nGreat cleanser - very light feeling\nTimeRelish Collapsible Foot Spa Bath Massager with Heat Bubbles and Massage and Jet, Pedicure Foot Spa Massager with Remote, Foot Soak Tub with Pumice Stone and Lavender Epsom, Gift for Woman Blue\nTimeRelish\n{'Use for': 'Feet', 'Power Source': 'Corded Electric', 'Material': 'Stone', 'Brand': 'TimeRelish', 'Color': 'Blue', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16 x 13 x 7.5 inches; 4.7 Pounds', 'Item model number': 'HT-001A', 'UPC': '797823642509', 'Manufacturer': 'TimeRelish'}\nThis foot spa massager is comfortable and relaxing. Although I prefer to fill it with warm water to start with, it will actually heat the water on its own in about 25 minutes. It also keeps it warm and you can control the temperature that you want. I love how relaxing the massage rollers feel after a long day on my feet. I also love that it has a remote control. It's also collapsible so it doesn't take as much space to store as other foot massagers.\nComfortable relaxing foot spa\nOUKEYA Eyelash Growth Serum, Effective Eyelash Serum for Longer, Thicker Eyelashes and Brows with a powerful, hypoallergenic formula that is safe and non-irritating [2Pack (0.17 FLoz each)]\nOUKEYA\n{}\nI find that with products like this you need to have patience but I have seen some results with this serum. I have mostly been using this on my eyebrows because I have been using a different eyelash serum and I think the applicator works a little better for eyelashes but it still works to use on eyebrows. If you use this consistently you will see some results. I love that this is a 2 pack!\nSlow results\nBaboo Kids Bamboo Toothbrush Soft Bristles - BPA Free Activated Charcoal - Organic Wooden Baby Tooth Brush - Eco-Friendly Biodegradable Toothbrushes for Toddlers, Child and Babies\nBABOO\n{'Brand': 'BABOO', 'Age Range (Description)': 'Kid', 'Special Feature': 'Charcoal Infused Bristle', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Ultra Soft', 'Product Dimensions': '5.12 x 0.44 x 0.44 inches; 0.42 Ounces', 'UPC': '869003000444', 'Material Feature': 'Biodegradable Warning', 'Manufacturer': 'Baboo'}\nI love that that this toothbrush is environmental conscious and has a bamboo handle - the design is very simple, but I like the overall style of it. It's only 1 toothbrush though and at the price I'm not sure if it's worth continuing to order this.\nSimple design but I love the aesthetic\nEveryday Beauty Strawberry Exfoliator, Nourishing, Hydrating, and Rich Antioxidant Exfoliating Scrub with Ginseng, Strawberry Seeds, and Black Currant for Dry Dehydrated, and Aging Skin, 1.7 oz. Jar\nEveryday Beauty\n{'Brand': 'Everyday Beauty', 'Material Feature': 'Gluten Free, Cruelty Free', 'Number of Items': '1', 'Package Information': 'Jar', 'Item Weight': '1.7 Ounces', 'Package Dimensions': '3.03 x 2.99 x 2.13 inches; 1.7 Ounces', 'UPC': '700463002374', 'Manufacturer': 'Cosmetic Solutions, LLC'}\nI love a good exfoliator and I'm quite happy with this one. I really like the style/packaging as well as the scent. There are little exfoliating beads which I'm a fan of and it helps my skin feel clear and soft.\nGives me soft skin\nStride Foot Cream Smoothes Rough Cracked Heels & Dry Skin –– Dematologist-Developed, Intensely Moisturizing Foot Cream with Aloe Vera, Coconut oil and Green tea\nStride\n{'Brand': 'Stride', 'Scent': 'Coconut', 'Active Ingredients': 'Coconut oil,green tea,vitamin e', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Package Dimensions': '3 x 3 x 2 inches; 3.99 Ounces', 'UPC': '860006643317'}\nThis cream is helpful for moisturizing my feet. I prefer to apply my foot cream after getting out of the shower because I feel like it helps absorb better and then I like to put socks in to lock in the moisture. I have had pretty good results.\nWorks pretty well\nEveryday Beauty Glow Day Cream, Gel-to-Oil Rich Moisturizer to Minimize Signs of Aging, Reduce Redness, Dullness, and Fatigue for a Healthy Glow, 1 oz. Jar\nEveryday Beauty\n{'Brand': 'Everyday Beauty', 'Scent': 'Rose', 'Unit Count': '1.0 Ounce', 'Number of Items': '1', 'Item Volume': '1 Fluid Ounces', 'Package Dimensions': '2.56 x 2.52 x 1.93 inches; 4.66 Ounces', 'UPC': '700463002381', 'Manufacturer': 'Cosmetic Solutions, LLC'}\nI like this day cream, but I don't LOVE it. It's a bit more gel like consistency and not as creamy as I like but it does help my skin feel moisturized and hydrated. It looks nice and the overall packaging/design/aesthetic is quite beautiful so I think it would be nice to gift, however, I'm not sure if I would order it again for myself.\nNice product but not the best cream I've used\nSKYFCC 3Pcs Collapsible Foot soak tub with Pumice Stone &Brush-Foot Bath with Handle-feet Soaking tub-Foot Soaking Bath Basin Bucket (Green)\nSKYFCC\n{'Package Dimensions': '17.41 x 13.63 x 3.47 inches; 1.9 Pounds', 'Item model number': 'PP68'}\nI really like this collapsible foot tub set. It is a good size for soaking my feet and I like the pumice stone and foot file that are included with it. They really make a great set. The massage rollers feel good on my feet and the fact that the bucket is collapsible is the best! It's portable, can be used for a multitude of other things, and it stores easily. I couldn't be happier!\nGreat set\nTropic Labs White Sands Dual-Action Body Scrub | Natural Exfoliating Body Scrubs | Gentle Exfoliator Wash With Quartz Crystals | Lightweight Moisturizing Exfoliant | Vegan & Cruelty-Free (TSA Friendly)\nTropic Labs\n{'Brand': 'Tropic Labs', 'Skin Type': 'All', 'Material Feature': 'Cruelty Free, Vegan', 'Number of Items': '1', 'Recommended Uses For Product': 'Fine Lines, Exfoliating', 'UPC': '850033640212'}\nI like the soft scent of this body scrub and it does exfoliate and make my skin softer after use, however it's not as moisturizing as some body scrubs I've used and I feel that the results don't last quite as long. However, it does work really well to use in addition to a good moisturizing body wash.\nNice gentle scent\nTropic Labs Smart Screen | Broad Spectrum SPF 22 Sunscreen | 2-in-1 Mineral Sunscreen & Natural Tanning Accelerator | Fast Acting Tan Boosting Body Suntan Lotion | Lightweight, Vegan, & Cruelty-Free (TSA Friendly)\nTropic Labs\n{'Unit Count': '3.5 Fl Oz', 'Skin Type': 'All', 'Brand': 'Tropic Labs', 'Water Resistance Level': 'Water Resistant', 'Age Range (Description)': 'Adult', 'UPC': '850033640182'}\nI like this tanning sunscreen. I think the SPF level because it provides protection without being too high to prevent tanning. It goes on nicely and doesn't feel too heavy or greasy on my skin. I like the bottle style and size - it's easy to throw in my bag. The color of the lotion itself is kind of surprising (yellow) because most sun lotions I've used are white but I like the scent - it smells like sun lotion but with a subtle tropical/coconut scent.\nGood size bottle and feels lightweight on skin",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Good size bottle and feels lightweight on skin",
    "text": "I like this tanning sunscreen. I think the SPF level because it provides protection without being too high to prevent tanning. It goes on nicely and doesn't feel too heavy or greasy on my skin. I like the bottle style and size - it's easy to throw in my bag. The color of the lotion itself is kind of surprising (yellow) because most sun lotions I've used are white but I like the scent - it smells like sun lotion but with a subtle tropical/coconut scent.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61fSLxGmCwL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61fSLxGmCwL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61fSLxGmCwL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B0BGT17QQG",
    "parent_asin": "B0BGT17QQG",
    "user_id": "AGIGXAVHVBQFXBXMOBNJ6HFY36MA",
    "timestamp": "2023-01-07 19:37:10.203000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Tropic Labs Smart Screen | Broad Spectrum SPF 22 Sunscreen | 2-in-1 Mineral Sunscreen & Natural Tanning Accelerator | Fast Acting Tan Boosting Body Suntan Lotion | Lightweight, Vegan, & Cruelty-Free (TSA Friendly)",
    "average_rating": 4.6,
    "rating_number": 18,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31dXxpNGtqL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31dXxpNGtqL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51zZvvIJKhL._SL1420_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51LebHXYagL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51LebHXYagL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61Vy1o1bN1L._SL1420_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/517xve2kWsL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/517xve2kWsL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71sdqTuzc3L._SL1420_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51oTM1WE86L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51oTM1WE86L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71xd4+gSvhL._SL1420_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512iBA0y16L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/512iBA0y16L.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71g+EJ+67fL._SL1420_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/510kd1wF-RL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/510kd1wF-RL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71efh8-ttAL._SL1420_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Tropic Labs Skincare Products",
        "url": "https://www.amazon.com/vdp/01f795dbd0cd4a38b6129a1bdff6c680?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Tropic Labs",
    "categories": [],
    "details": {
      "Unit Count": "3.5 Fl Oz",
      "Skin Type": "All",
      "Brand": "Tropic Labs",
      "Water Resistance Level": "Water Resistant",
      "Age Range (Description)": "Adult",
      "UPC": "850033640182"
    },
    "bought_together": null
  }
}