{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/05/11\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Hutchings'], 'Producers': ['Victoria Bousis', 'Wendy Cox', 'Brice Dal Farra', 'Claude Dal Farra', 'Glenn W. Garland', 'Brian Keady', 'Kathleen E. Kearney', 'Christian Mercuri', 'Lauren Munsch'], 'Starring': ['Eden Sher', 'Victoria Justice', 'Peyton List'], 'Studio': ['Vision Films']}\nReview Text: I LOVE Eden Sher, Sue Sue Heck, from The Middle, which I will miss so much once it stops airing later this year. I am also a fan of the other actors/actresses in the movie, but this movie doesn't do their talent justice (pun intended, given Victoria Justice is one of the leads). The movie cops to a lot of teen geek chick romance ploys and plot points and doesn't serve to stir up any new thought provoking ideas about bullies, nerds, and kids that are often forgotten. I have seen movies that cleverly discuss these ideals like Before I Fall, The DUFF, and Prom. I like this movie. It is forgettable, but good for a Sunday night movie popcorn theater at home. It is just not memorable, but does the trick in the moment.\nReview Title: Forgettable Geek Chic, but You Can Do Better...\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greta Gerwig'], 'Producers': ['Eli Bush', \"Evelyn O'Neill\", 'Scott Rudin', 'Jason Sack', 'Alex G. Scott', 'Lila Yacoub'], 'Starring': ['Ronan', 'Saoirse', 'Laurie Metcalf'], 'Studio': ['A24 Distribution LLC']}\nI don't quite understand why this movie got the Oscar buzz it did. I feel like there are so many EXCELLENT and AMAZING under the radar teen movies that deserve Oscar credit than this mediocre film like Edge of Seventeen or even more recently Love, Simon.<br />Lady Bird tries to do much in one movie without a general vision. The character meanders and is often awful. I hate the relationship she has with her mom and her best friend. She treats everyone horribly.<br /><br />SPOILER ALERT:<br /><br />At the end, there is no life lessons learned by the main character; however, she becomes lonely and instead cow-tows to her mom, who was verbally abusive to her in the entire movie. That is a horrible lesson for any teen or any one else to take away from this movie. This character should have dropped her mom like it is hot and realized that she is better off without her belittling her all of the time and yelling in her face and demeaning her. I don't understand why this movie got so much buzz when the Edge of Seventeen deals with the tension between a mother and daughter in a much more mature and well-developed way. This movie leaves a lot to be desired.\nWhy the Oscar Buzz? You can do much better for a movie tonight!\nScream 4\nComedy, Horror, Eerie, Ominous\n['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nI really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nRetro Tale of Love, Loss, and Murder\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Hutchings'], 'Producers': ['Victoria Bousis', 'Wendy Cox', 'Brice Dal Farra', 'Claude Dal Farra', 'Glenn W. Garland', 'Brian Keady', 'Kathleen E. Kearney', 'Christian Mercuri', 'Lauren Munsch'], 'Starring': ['Eden Sher', 'Victoria Justice', 'Peyton List'], 'Studio': ['Vision Films']}\nI LOVE Eden Sher, Sue Sue Heck, from The Middle, which I will miss so much once it stops airing later this year. I am also a fan of the other actors/actresses in the movie, but this movie doesn't do their talent justice (pun intended, given Victoria Justice is one of the leads). The movie cops to a lot of teen geek chick romance ploys and plot points and doesn't serve to stir up any new thought provoking ideas about bullies, nerds, and kids that are often forgotten. I have seen movies that cleverly discuss these ideals like Before I Fall, The DUFF, and Prom. I like this movie. It is forgettable, but good for a Sunday night movie popcorn theater at home. It is just not memorable, but does the trick in the moment.\nForgettable Geek Chic, but You Can Do Better...",
  "profile": "**Updated User Profile Summary:**\n\n- **Film Preferences:** The user has a strong inclination towards teen-centric films that delve into complex relationships, notably between mothers and daughters. They seek well-developed narratives with meaningful life lessons and have a growing interest in horror-comedy elements that blend thrills with deep emotional themes. However, they also display a discerning taste, as highlighted by their recent critique of a film that they found lacking in originality and depth.\n\n- **Critique Style:** The user expresses their opinions candidly, particularly when films fail to meet their expectations regarding character development and innovative storytelling. They prefer narratives that challenge common tropes surrounding adolescence, such as bullying and social dynamics, while demonstrating authenticity and emotional resonance.\n\n- **Content Sensitivity:** They remain critical of films featuring substance abuse, foul language, and unhealthy relationships, favoring stories that convey redeeming lessons. Their complex feelings about gory content persist, evident in their enjoyment of horror series that intertwine thrills with substantive narratives.\n\n- **General Sentiment:** Characterized by high standards for storytelling, the user seeks films that resonate with adolescent challenges and relatable character arcs. They maintain skepticism towards critically acclaimed works devoid of substantial storytelling, alongside appreciation for campy aspects of horror when executed effectively.\n\n- **Engagement with Film Culture:** The user actively participates in film discussions, appreciating critical reception debates while challenging conventional views on film merit. Their recent viewing experience underscores their desire for originality and narrative depth in teen-centric cinema.",
  "metrics": {
    "rouge1_f": 0.19913419913419914,
    "rouge2_f": 0.013015184381778741,
    "rougeL_f": 0.08658008658008658,
    "meteor": 0.07236544549977386,
    "bleu1": 0.03543124199429434,
    "bleu2": 0.007207262827266894,
    "bleu3": 0.0012408137958248965,
    "bleu4": 0.0005152846507727348,
    "bertscore_precision": 0.3656906187534332,
    "bertscore_recall": 0.4563157558441162,
    "bertscore_f1": 0.4060075283050537
  }
}