{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bletchley Circle: Season 2\nReview Date: 2018/05/23\nStore: Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: ['Watch two new code-breaking thrillers in The Bletchley Circle, Season 2. The series is based on the lives of four extraordinary and brilliant women who worked at top-secret HQ Bletchley Park during World War II.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'PBSDBLEC600DVD', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '3 hours', 'Release date': 'April 15, 2014', 'Actors': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '2'}\nReview Text: I saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war. It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nReview Title: MUST WATCH SERIES!!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greta Gerwig'], 'Producers': ['Eli Bush', \"Evelyn O'Neill\", 'Scott Rudin', 'Jason Sack', 'Alex G. Scott', 'Lila Yacoub'], 'Starring': ['Ronan', 'Saoirse', 'Laurie Metcalf'], 'Studio': ['A24 Distribution LLC']}\nI don't quite understand why this movie got the Oscar buzz it did. I feel like there are so many EXCELLENT and AMAZING under the radar teen movies that deserve Oscar credit than this mediocre film like Edge of Seventeen or even more recently Love, Simon.<br />Lady Bird tries to do much in one movie without a general vision. The character meanders and is often awful. I hate the relationship she has with her mom and her best friend. She treats everyone horribly.<br /><br />SPOILER ALERT:<br /><br />At the end, there is no life lessons learned by the main character; however, she becomes lonely and instead cow-tows to her mom, who was verbally abusive to her in the entire movie. That is a horrible lesson for any teen or any one else to take away from this movie. This character should have dropped her mom like it is hot and realized that she is better off without her belittling her all of the time and yelling in her face and demeaning her. I don't understand why this movie got so much buzz when the Edge of Seventeen deals with the tension between a mother and daughter in a much more mature and well-developed way. This movie leaves a lot to be desired.\nWhy the Oscar Buzz? You can do much better for a movie tonight!\nScream 4\nComedy, Horror, Eerie, Ominous\n['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nI really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nRetro Tale of Love, Loss, and Murder\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Hutchings'], 'Producers': ['Victoria Bousis', 'Wendy Cox', 'Brice Dal Farra', 'Claude Dal Farra', 'Glenn W. Garland', 'Brian Keady', 'Kathleen E. Kearney', 'Christian Mercuri', 'Lauren Munsch'], 'Starring': ['Eden Sher', 'Victoria Justice', 'Peyton List'], 'Studio': ['Vision Films']}\nI LOVE Eden Sher, Sue Sue Heck, from The Middle, which I will miss so much once it stops airing later this year. I am also a fan of the other actors/actresses in the movie, but this movie doesn't do their talent justice (pun intended, given Victoria Justice is one of the leads). The movie cops to a lot of teen geek chick romance ploys and plot points and doesn't serve to stir up any new thought provoking ideas about bullies, nerds, and kids that are often forgotten. I have seen movies that cleverly discuss these ideals like Before I Fall, The DUFF, and Prom. I like this movie. It is forgettable, but good for a Sunday night movie popcorn theater at home. It is just not memorable, but does the trick in the moment.\nForgettable Geek Chic, but You Can Do Better...\n{'Subtitles': ['None available'], 'Directors': ['Andy Devonshire'], 'Producers': ['Anna Beattie', 'Mark Drake', 'Anna Driver', 'Hannah Griffiths', 'Jake Senior', 'Samantha Beddoes', 'Helen Cawley'], 'Starring': ['Mel Giedroyc', 'Sue Perkins', 'Mary Berry'], 'Studio': ['PBS']}\nFor anyone who likes cooking and baking competitions, this one is slightly different for a few reasons:<br />1) it is set in England<br />2) all of the deserts are things that I had never heard of before and very unique to watch being made from start to scratch (pun, intended)<br />3) The hosts are all engaging, except one<br />4) The contestants are not super competitive or mean with each other and help each other out when things go poorly. I love that in competitive shows.<br />5) This is great fun for anyone with an interest in food.\nGreat British Introduction to Unusual Foods Across the Pond\n{'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Mysak', 'Michael Fitzpatrick Lawrence Jr.', 'Nick Petrie'], 'Producers': ['John Dufresne-Williams', 'Montré Burton', 'Chris Lauer', 'Chris Coelen', 'Karrie Wolfe', 'Kimberly Goodman', 'Jason Sands'], 'Starring': ['Neil Bowlus', 'Joseph Cilona', 'Ashley Doherty']}\nMarried at First Sight is a reality tv show where couples that have never met before are matched by professionals- a psychologist, a sexologist, and a sociologist- in an arranged marriage and see if they can make it work for 6 weeks- some couples survive, some don’t. You learn a TON about why people do the things they do and why relationships don’t work and some do work. I love it and learned a lot of great tips on how to improve my own relationships and provide guidance with others struggling in their own relationships.\nExcellent Reality TV with Real World Applications\nThe Bletchley Circle: Cracking a Killer's Code\n.  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Mystery & Thrillers\n['Product Description', 'Four women who worked as codebreakers at Bletchley Park have taken up civilian lives. Susan, has collated data about a series of murders. She tries to convince the police she knows where another body is, but they are unable to locate it and dismiss her. She turns to her three friends and they work out where the next victim will be taken, find the body, then decide they are the only ones who can track down the killer.', 'Amazon.com', 'After her days cracking Nazi codes at Bletchley Park during World War II, Susan Gray (Anna Maxwell Martin) finds life as a housewife lacking. When she perceives patterns in a series of killings, she approaches the police, only to be rebuffed. Horrified by the prospect of more women being murdered, Susan gathers three of her Bletchley cohorts--outspoken, independent Millie (Rachael Stirling,', 'Tipping the Velvet', '); Jean (Julie Graham), an administrator at Bletchley who still has connections in the British bureaucracy; and Lucy (Sophie Rundle), whose eidetic memory makes her a living computer. Their complementary skills allow them to deconstruct these grisly crimes, predicting where the killer may strike next and gradually unraveling where he came from… which brings them closer to the murderer than they ever expected.', \"The Bletchley Circle: Cracking a Killer's Code\", \"cunningly mixes a gripping mystery with understated commentary on women's roles in society (or lack thereof). The social critique actually compounds the tension; the patronizing and dismissive attitude of the police and other men makes the serial killer's actions seem less like a derangement and more like the logical extreme of sexism. The writing, performances, and production are all top-notch; this is a smart, multilayered thriller. --\", 'Bret Fetzer']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '7018838', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 15 minutes', 'Release date': 'May 14, 2013', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\nI saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war.  It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nMUST WATCH SERIES!!!!\nBletchley Circle: Season 2\nAnna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Independently Distributed, Drama\n['Watch two new code-breaking thrillers in The Bletchley Circle, Season 2. The series is based on the lives of four extraordinary and brilliant women who worked at top-secret HQ Bletchley Park during World War II.']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'PBSDBLEC600DVD', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '3 hours', 'Release date': 'April 15, 2014', 'Actors': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '2'}\nI saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war. It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nMUST WATCH SERIES!!!!",
  "profile": "**Updated User Profile Summary:**\n\n- **Film and Media Preferences:** The user continues to favor teen-centric narratives that delve into complex relationships, especially between mothers and daughters. Their interest in reality TV series remains strong, particularly those focusing on relationship dynamics. Recently, they expressed a deeper enthusiasm for historical crime dramas and mysteries, specifically those featuring strong female leads and compelling narratives rooted in real historical events, reflecting a broader interest in stories that explore meaningful life experiences.\n\n- **Critique Style:** The user emphasizes character development and innovative storytelling while enjoying narratives that challenge typical adolescent tropes. They appreciate engaging formats that blend suspense with rich plots, finding joy in multifaceted storylines that resonate on multiple levels.\n\n- **Content Sensitivity:** They remain critical of substance abuse and foul language in media, preferring uplifting narratives. Their enjoyment of horror persists, especially when combined with significant plots, although they navigate complex feelings about gory content.\n\n- **General Sentiment:** The user seeks depth in storytelling, often critiquing acclaimed works for lacking authenticity. They enjoy campy humor and originality while promoting creativity and collaboration in discussions about film and television.\n\n- **Engagement with Culture:** Actively participating in discourse around films and series that explore interpersonal relationships, the user looks for content offering insights into dynamics and societal issues, reinforcing their commitment to diverse storytelling and strong female characters.",
  "metrics": {
    "rouge1_f": 0.11957671957671957,
    "rouge2_f": 0.007415254237288135,
    "rougeL_f": 0.05291005291005291,
    "meteor": 0.034855528278487535,
    "bleu1": 0.00021606590188156215,
    "bleu2": 5.460469399851983e-05,
    "bleu3": 8.387023320340302e-06,
    "bleu4": 3.2899948853095705e-06,
    "bertscore_precision": 0.3519591689109802,
    "bertscore_recall": 0.48426932096481323,
    "bertscore_f1": 0.4076470136642456
  }
}