{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/05/23\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Mysak', 'Michael Fitzpatrick Lawrence Jr.', 'Nick Petrie'], 'Producers': ['John Dufresne-Williams', 'Montré Burton', 'Chris Lauer', 'Chris Coelen', 'Karrie Wolfe', 'Kimberly Goodman', 'Jason Sands'], 'Starring': ['Neil Bowlus', 'Joseph Cilona', 'Ashley Doherty']}\nReview Text: Married at First Sight is a reality tv show where couples that have never met before are matched by professionals- a psychologist, a sexologist, and a sociologist- in an arranged marriage and see if they can make it work for 6 weeks- some couples survive, some don’t. You learn a TON about why people do the things they do and why relationships don’t work and some do work. I love it and learned a lot of great tips on how to improve my own relationships and provide guidance with others struggling in their own relationships.\nReview Title: Excellent Reality TV with Real World Applications\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greta Gerwig'], 'Producers': ['Eli Bush', \"Evelyn O'Neill\", 'Scott Rudin', 'Jason Sack', 'Alex G. Scott', 'Lila Yacoub'], 'Starring': ['Ronan', 'Saoirse', 'Laurie Metcalf'], 'Studio': ['A24 Distribution LLC']}\nI don't quite understand why this movie got the Oscar buzz it did. I feel like there are so many EXCELLENT and AMAZING under the radar teen movies that deserve Oscar credit than this mediocre film like Edge of Seventeen or even more recently Love, Simon.<br />Lady Bird tries to do much in one movie without a general vision. The character meanders and is often awful. I hate the relationship she has with her mom and her best friend. She treats everyone horribly.<br /><br />SPOILER ALERT:<br /><br />At the end, there is no life lessons learned by the main character; however, she becomes lonely and instead cow-tows to her mom, who was verbally abusive to her in the entire movie. That is a horrible lesson for any teen or any one else to take away from this movie. This character should have dropped her mom like it is hot and realized that she is better off without her belittling her all of the time and yelling in her face and demeaning her. I don't understand why this movie got so much buzz when the Edge of Seventeen deals with the tension between a mother and daughter in a much more mature and well-developed way. This movie leaves a lot to be desired.\nWhy the Oscar Buzz? You can do much better for a movie tonight!\nScream 4\nComedy, Horror, Eerie, Ominous\n['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nI really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nRetro Tale of Love, Loss, and Murder\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Hutchings'], 'Producers': ['Victoria Bousis', 'Wendy Cox', 'Brice Dal Farra', 'Claude Dal Farra', 'Glenn W. Garland', 'Brian Keady', 'Kathleen E. Kearney', 'Christian Mercuri', 'Lauren Munsch'], 'Starring': ['Eden Sher', 'Victoria Justice', 'Peyton List'], 'Studio': ['Vision Films']}\nI LOVE Eden Sher, Sue Sue Heck, from The Middle, which I will miss so much once it stops airing later this year. I am also a fan of the other actors/actresses in the movie, but this movie doesn't do their talent justice (pun intended, given Victoria Justice is one of the leads). The movie cops to a lot of teen geek chick romance ploys and plot points and doesn't serve to stir up any new thought provoking ideas about bullies, nerds, and kids that are often forgotten. I have seen movies that cleverly discuss these ideals like Before I Fall, The DUFF, and Prom. I like this movie. It is forgettable, but good for a Sunday night movie popcorn theater at home. It is just not memorable, but does the trick in the moment.\nForgettable Geek Chic, but You Can Do Better...\n{'Subtitles': ['None available'], 'Directors': ['Andy Devonshire'], 'Producers': ['Anna Beattie', 'Mark Drake', 'Anna Driver', 'Hannah Griffiths', 'Jake Senior', 'Samantha Beddoes', 'Helen Cawley'], 'Starring': ['Mel Giedroyc', 'Sue Perkins', 'Mary Berry'], 'Studio': ['PBS']}\nFor anyone who likes cooking and baking competitions, this one is slightly different for a few reasons:<br />1) it is set in England<br />2) all of the deserts are things that I had never heard of before and very unique to watch being made from start to scratch (pun, intended)<br />3) The hosts are all engaging, except one<br />4) The contestants are not super competitive or mean with each other and help each other out when things go poorly. I love that in competitive shows.<br />5) This is great fun for anyone with an interest in food.\nGreat British Introduction to Unusual Foods Across the Pond\n{'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Mysak', 'Michael Fitzpatrick Lawrence Jr.', 'Nick Petrie'], 'Producers': ['John Dufresne-Williams', 'Montré Burton', 'Chris Lauer', 'Chris Coelen', 'Karrie Wolfe', 'Kimberly Goodman', 'Jason Sands'], 'Starring': ['Neil Bowlus', 'Joseph Cilona', 'Ashley Doherty']}\nMarried at First Sight is a reality tv show where couples that have never met before are matched by professionals- a psychologist, a sexologist, and a sociologist- in an arranged marriage and see if they can make it work for 6 weeks- some couples survive, some don’t. You learn a TON about why people do the things they do and why relationships don’t work and some do work. I love it and learned a lot of great tips on how to improve my own relationships and provide guidance with others struggling in their own relationships.\nExcellent Reality TV with Real World Applications",
  "profile": "**Updated User Profile Summary:**\n\n- **Film and Media Preferences:** The user continues to favor teen-centric films that explore complex relationships, particularly between mothers and daughters. They appreciate narratives that provide meaningful life lessons and have recently shown a growing interest in reality TV series that investigate relationship dynamics, offering insights into interpersonal challenges. This reflects their broader curiosity for diverse storytelling and character interactions, especially in food-related and reality content.\n\n- **Critique Style:** The user's candid critiques remain focused on character development and innovative storytelling. They value narratives that defy typical adolescent tropes, promoting authenticity while also enjoying engaging, lighthearted formats across genres.\n\n- **Content Sensitivity:** The user remains critical of media containing substance abuse and foul language, as evidenced by their purchase preferences. They favor narratives that impart positive lessons and continue to navigate their complex feelings about gory content, enjoying horror that merges thrills with substantial plotlines.\n\n- **General Sentiment:** With high standards for storytelling, the user seeks films and media that resonate with adolescent challenges and relatable arcs, often skeptical of critically acclaimed works that lack depth. They appreciate campy humor and originality.\n\n- **Engagement with Culture:** The user actively engages in discussions around film and reality TV, demanding richness and depth while promoting creativity, collaboration, and positive interactions. Their interest in relationship-focused content aligns with their desire for learning and understanding interpersonal dynamics.",
  "metrics": {
    "rouge1_f": 0.18,
    "rouge2_f": 0.015025041736227044,
    "rougeL_f": 0.07833333333333334,
    "meteor": 0.056206707464808395,
    "bleu1": 0.007639883623837722,
    "bleu2": 0.0018039505766228368,
    "bleu3": 0.00028514874073689856,
    "bleu4": 0.0001134709579809301,
    "bertscore_precision": 0.3655478060245514,
    "bertscore_recall": 0.4773492217063904,
    "bertscore_f1": 0.41403383016586304
  }
}