{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Scream 4\nReview Date: 2018/05/06\nCategories: Comedy, Horror, Eerie, Ominous\nProduct Description: ['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nReview Text: I really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nReview Title: Retro Tale of Love, Loss, and Murder\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greta Gerwig'], 'Producers': ['Eli Bush', \"Evelyn O'Neill\", 'Scott Rudin', 'Jason Sack', 'Alex G. Scott', 'Lila Yacoub'], 'Starring': ['Ronan', 'Saoirse', 'Laurie Metcalf'], 'Studio': ['A24 Distribution LLC']}\nI don't quite understand why this movie got the Oscar buzz it did. I feel like there are so many EXCELLENT and AMAZING under the radar teen movies that deserve Oscar credit than this mediocre film like Edge of Seventeen or even more recently Love, Simon.<br />Lady Bird tries to do much in one movie without a general vision. The character meanders and is often awful. I hate the relationship she has with her mom and her best friend. She treats everyone horribly.<br /><br />SPOILER ALERT:<br /><br />At the end, there is no life lessons learned by the main character; however, she becomes lonely and instead cow-tows to her mom, who was verbally abusive to her in the entire movie. That is a horrible lesson for any teen or any one else to take away from this movie. This character should have dropped her mom like it is hot and realized that she is better off without her belittling her all of the time and yelling in her face and demeaning her. I don't understand why this movie got so much buzz when the Edge of Seventeen deals with the tension between a mother and daughter in a much more mature and well-developed way. This movie leaves a lot to be desired.\nWhy the Oscar Buzz? You can do much better for a movie tonight!\nScream 4\nComedy, Horror, Eerie, Ominous\n['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nI really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nRetro Tale of Love, Loss, and Murder",
  "profile": "**User Profile Summary:**\n\n- **Film Preferences:** The user maintains a strong preference for teen-centric films that explore complex relationships, particularly between mothers and daughters. They favor well-developed narratives with meaningful life lessons and exhibit an interest in horror-comedy elements with deeper continuity and character development.\n\n- **Critique Style:** The user articulates their feelings candidly, expressing disappointment when films fail to meet expectations regarding character depth and growth. They appreciate authenticity in storytelling and are drawn to narratives that balance horror with humor and emotional resonance.\n\n- **Content Sensitivity:** The user is critical of films featuring substance abuse, foul language, and unhealthy relationships, preferring stories that offer redeeming lessons and positive resolutions. They seem to have complex feelings about gory content, as showcased by their enjoyment of horror series that balance thrills with strong narratives.\n\n- **General Sentiment:** High standards for storytelling in film characterize this user, who seeks works that resonate with adolescent challenges while offering relatable character arcs. They are often skeptical of critically acclaimed films that lack substantial storytelling, yet they show an appreciation for the campy aspects of the horror genre when executed effectively.\n\n- **Engagement with Film Culture:** The user actively engages with film culture, appreciating discussions around critical reception while occasionally challenging conventional views on what makes a film deserving of recognition. Their recent engagement with horror-comedy suggests a growing interest in narratives that combine thrills with deep emotional themes.",
  "metrics": {
    "rouge1_f": 0.2465373961218837,
    "rouge2_f": 0.022222222222222223,
    "rougeL_f": 0.10249307479224376,
    "meteor": 0.09864837914683496,
    "bleu1": 0.08495959228743324,
    "bleu2": 0.019949989795320727,
    "bleu3": 0.0033448388966633336,
    "bleu4": 0.001370809689469706,
    "bertscore_precision": 0.3773597478866577,
    "bertscore_recall": 0.4488879442214966,
    "bertscore_f1": 0.41002774238586426
  }
}