{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sweat Cosmetics Foundation Powder Jar SPF 30 Water + Sweat Resistant (Shade 100: light)\nReview Date: 2021/03/14\nStore: SWEAT FOR ACTIVE BEAUTY\nAverage Rating: 3.4\nProduct Details: {'Item Form': 'Powder', 'Skin Type': 'Sensitive', 'Finish Type': 'Natural', 'Package Information': 'Jar', 'Brand': 'SWEAT FOR ACTIVE BEAUTY', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.8 x 2.8 x 1.4 inches; 0.63 Ounces'}\nReview Text: This powder is nice enough, but it doesn't blow me away so much that I can justify spending almost $50 for a jar of powder. I have dry skin and powder often makes me look cakey, this sits on my skin nicely and doesn't look too thick or powdery. I would say this has light to medium coverage. The shade I received is 100 light, it pulls too yellow/orange on me, I wish it had a more neutral undertone. I like that it has SPF 30 and is water/sweat resistant, I will probably get a lot more use out of this in the summer than in the winter. Overall, this is a decent product but I have several other loose powder foundations that I like just as much that are a fraction of this price.\nReview Title: Expensive powder\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "N3 No Name Necessary Mattifying Shine and Oil Control Long Lasting Anti-aging Makeup Setting Spray (200ml)\nNo Name Necessary\n{'Product Dimensions': '1.7 x 1.7 x 7.5 inches; 0.81 Ounces'}\nThis spray feels slightly like hairspray when you spritz it on. It helps makeup last all day and stay matte. I personally like a dewy finish so I spray this first for longevity, then when it dries I’ll spray a little dewy spray. Love the combo! Comes in a huge bottle that will last forever.\nGood spray for oily skin\nCatrice | SUNGASM Luminizing Bronzer 01 | For A Sun-Kissed Shimmery Finish | Highly Pigmented & Blendable | Vegan, Paraben Free, Oil Free | Cruelty Free\nCatrice\n{'Item Form': 'Powder', 'Finish Type': 'Shimmery', 'Brand': 'Catrice', 'Color': 'C01 Golden Ecstasy', 'Skin Tone': 'All', 'Product Dimensions': '2.72 x 2.72 x 0.51 inches; 1.27 Ounces'}\nThis bronzer is really pretty, it's not matte but not glittery. It has the perfect amount of shimmer/sheen that makes your skin look healthy and glowy. Perfect for summer. It blends out beautifully on my skin and looks like I have a natural tan. I have fair skin and the 01 shade doesn't pull too orange or too red on me.\nSo beautiful!\nBouquet Garni Body Shower White Musk - Unique Fragrance Decanting Engineering Method gives Long Lasting Rich Fragrance - Gentle and Mild Cleansing Scented Body Wash with Natural Surfactant 17.85 Fl Oz\nBouquet Garni\n{'Item Form': 'Gel', 'Skin Type': 'All, Dry', 'Brand': 'Bouquet Garni', 'Scent': 'Garni', 'Material Feature': 'Natural', 'Package Dimensions': '8.23 x 6.34 x 3.66 inches; 1.34 Pounds'}\nThis body wash lathers nicely and has a pleasant, musky scent. I find I need about 3-4 pumps to wash my whole body. It came in a really nice box that would make a cute gift. I wish it had a little bit more vanilla scent to it.\nLathers nice!\nSweat Cosmetics Foundation Powder Jar SPF 30 Water + Sweat Resistant (Shade 100: light)\nSWEAT FOR ACTIVE BEAUTY\n{'Item Form': 'Powder', 'Skin Type': 'Sensitive', 'Finish Type': 'Natural', 'Package Information': 'Jar', 'Brand': 'SWEAT FOR ACTIVE BEAUTY', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.8 x 2.8 x 1.4 inches; 0.63 Ounces'}\nThis powder is nice enough, but it doesn't blow me away so much that I can justify spending almost $50 for a jar of powder. I have dry skin and powder often makes me look cakey, this sits on my skin nicely and doesn't look too thick or powdery. I would say this has light to medium coverage. The shade I received is 100 light, it pulls too yellow/orange on me, I wish it had a more neutral undertone. I like that it has SPF 30 and is water/sweat resistant, I will probably get a lot more use out of this in the summer than in the winter. Overall, this is a decent product but I have several other loose powder foundations that I like just as much that are a fraction of this price.\nExpensive powder",
  "profile": "**User Summary:**\n\n- **Makeup Preferences**: Prioritizes long-lasting solutions with a focus on controlling shine and oil while valuing products that provide a healthy glow. Recently explored a foundation powder that offers SPF and water/sweat resistance, emphasizing the need for functional products for active situations.\n  \n- **Skin Type**: Likely has oily skin but also experiences periods of dryness and sensitivities, as indicated by the recent interaction. Shows a preference for products that avoid cakiness, favoring formulations that sit nicely on the skin.\n\n- **Finish Preference**: Enjoys a dewy finish and products that impart a sun-kissed effect, demonstrating versatility in achieving different looks based on the environment and season.\n\n- **Body Care Preferences**: Engages with effective cleansing products that provide pleasant fragrances, leaning towards gentle formulations with subtle sweetness in scents.\n\n- **Product Packaging**: Prefers larger sizes for longevity and cost-effectiveness, though recent experiences illustrate a consideration of value for performance.\n\n- **Review Behavior**: Offers balanced and pragmatic reviews, indicating a discerning approach to evaluating products based on quality and effectiveness. This user recently highlighted a desire for neutral undertones in products while balancing the price against performance.\n\n- **Usage Technique**: Utilizes a mix of products and blends well, indicating readiness to experiment with textures and finishes to achieve a natural, radiant appearance. \n\nThis profile reflects an evolving beauty routine with a focus on practicality and performance across both makeup and body care.",
  "metrics": {
    "rouge1_f": 0.29490616621983917,
    "rouge2_f": 0.043010752688172046,
    "rougeL_f": 0.1152815013404826,
    "meteor": 0.12111113369650647,
    "bleu1": 0.11615886461361169,
    "bleu2": 0.024695815204311106,
    "bleu3": 0.008629595112520427,
    "bleu4": 0.002871112996185201,
    "bertscore_precision": 0.39104822278022766,
    "bertscore_recall": 0.467817485332489,
    "bertscore_f1": 0.4260018467903137
  }
}