{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Beard Balm Leave In Conditioner - All Natural Beard Oil Wax for Beard Mustache & Hair Growth, Deep Beard Softener Cream Butter, Soothes Softens Tames & Styles Hair, Beard Care Kit Best Gift for Men\nReview Date: 2017/03/24\nStore: Premium Nature\nAverage Rating: 3.9\nProduct Details: {'Hair Type': 'All', 'Scent': 'Citrus', 'Item Form': 'Cream', 'Brand': 'Premium Nature', 'Number of Items': '6', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.9 x 2.8 x 1.1 inches; 2.89 Ounces', 'Item model number': 'Beard Balm', 'UPC': '857646006664'}\nReview Text: When you start getting a decent beard you realize the value of beard balms and oils. After you shampoo your beard you basically strip it of oils and dirt. That is good but you have to replace the oils if you don't want the dreaded beard itch and dandruff. This stuff does a great job at replacing the striped oils. It keeps my beard happy and that helps keep me happy. I also enjoy the sent of this balm. It is a mild sent of citrus orange in my opinion. I have used others with less sent and some that are much stronger. This sent seems to leave about an hour after applying.<br /><br />Pros:<br />Natural ingredients<br />Good conditioning<br />Easy to use tin.<br />Easy to apply consistency<br /><br />Cons:<br />If I use it multiple times in day I started to get zits in certain areas.<br /><br />All in all. It is a good product and keeps my beard looking and feeling good.\nReview Title: Great conditioner. Keep your beard happy.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Beard Balm Leave In Conditioner - All Natural Beard Oil Wax for Beard Mustache & Hair Growth, Deep Beard Softener Cream Butter, Soothes Softens Tames & Styles Hair, Beard Care Kit Best Gift for Men\nPremium Nature\n{'Hair Type': 'All', 'Scent': 'Citrus', 'Item Form': 'Cream', 'Brand': 'Premium Nature', 'Number of Items': '6', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.9 x 2.8 x 1.1 inches; 2.89 Ounces', 'Item model number': 'Beard Balm', 'UPC': '857646006664'}\nWhen you start getting a decent beard you realize the value of beard balms and oils. After you shampoo your beard you basically strip it of oils and dirt. That is good but you have to replace the oils if you don't want the dreaded beard itch and dandruff. This stuff does a great job at replacing the striped oils. It keeps my beard happy and that helps keep me happy. I also enjoy the sent of this balm. It is a mild sent of citrus orange in my opinion. I have used others with less sent and some that are much stronger. This sent seems to leave about an hour after applying.<br /><br />Pros:<br />Natural ingredients<br />Good conditioning<br />Easy to use tin.<br />Easy to apply consistency<br /><br />Cons:<br />If I use it multiple times in day I started to get zits in certain areas.<br /><br />All in all. It is a good product and keeps my beard looking and feeling good.\nGreat conditioner. Keep your beard happy.",
  "profile": "**User Summary:** \n\nThis user shows a strong interest in personal grooming, particularly in beard care, emphasizing natural and effective products. They prefer items that help rejuvenate and maintain beard health after washing, highlighting the importance of conditioning to avoid issues like itchiness and dandruff. The positive review indicates a preference for products with pleasant, mild scents, specifically citrus. They appreciate ease of use in product packaging and application. \n\nKey patterns include a focus on natural ingredients, effectiveness in conditioning, and a moderate scent strength that doesn't overpower. The user shares a balanced perspective, acknowledging minor drawbacks, such as potential skin irritation from frequent use. Overall, they exhibit a trend towards seeking reliable and user-friendly grooming solutions that enhance the beard care experience.",
  "metrics": {
    "rouge1_f": 0.25,
    "rouge2_f": 0.0213903743315508,
    "rougeL_f": 0.12765957446808512,
    "meteor": 0.10882925738543904,
    "bleu1": 0.09994790391248506,
    "bleu2": 0.018953849594017573,
    "bleu3": 0.008663050168929438,
    "bleu4": 0.0032992821125718635,
    "bertscore_precision": 0.38961198925971985,
    "bertscore_recall": 0.45626920461654663,
    "bertscore_f1": 0.4203141927719116
  }
}