{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Beard Grooming Kit for Men - Beard Care Gift Sets Best Mustache and Beard Growth Natural Beard Oil Beard Softener Conditioner Balm Butter And Wooden Comb Best Gift Idea for Men Premium Nature\nReview Date: 2017/06/24\nStore: Premium Nature\nAverage Rating: 4.4\nProduct Details: {'Hair Type': 'Coarse', 'Liquid Volume': '1 Fluid Ounces', 'Item Form': 'Balm', 'Brand': 'Premium Nature', 'Number of Items': '2', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.47 x 4.02 x 2.36 inches; 6.4 Ounces', 'UPC': '857646006961'}\nReview Text: Alright, I have tried many different beard oils and typically I am unsatisfied with the smell in some sort of way. Most of them seem to have the smell of an old lady. Many are so strong they give me headaches as the sent rests under me nose all day.<br />None of this is the case with this beard oil. It has an amazing smell and the sent strength is just perfect. It has citrus woodsy type smell in my opinion. It gained the approval of my wife in the smells department and that is no easy feat. Plus it conditions and hydrates just as it should. It will keep your beardruff at bay.<br /><br />I would most definitely recommend to a friend!\nReview Title: I finally found the one.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Beard Balm Leave In Conditioner - All Natural Beard Oil Wax for Beard Mustache & Hair Growth, Deep Beard Softener Cream Butter, Soothes Softens Tames & Styles Hair, Beard Care Kit Best Gift for Men\nPremium Nature\n{'Hair Type': 'All', 'Scent': 'Citrus', 'Item Form': 'Cream', 'Brand': 'Premium Nature', 'Number of Items': '6', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.9 x 2.8 x 1.1 inches; 2.89 Ounces', 'Item model number': 'Beard Balm', 'UPC': '857646006664'}\nWhen you start getting a decent beard you realize the value of beard balms and oils. After you shampoo your beard you basically strip it of oils and dirt. That is good but you have to replace the oils if you don't want the dreaded beard itch and dandruff. This stuff does a great job at replacing the striped oils. It keeps my beard happy and that helps keep me happy. I also enjoy the sent of this balm. It is a mild sent of citrus orange in my opinion. I have used others with less sent and some that are much stronger. This sent seems to leave about an hour after applying.<br /><br />Pros:<br />Natural ingredients<br />Good conditioning<br />Easy to use tin.<br />Easy to apply consistency<br /><br />Cons:<br />If I use it multiple times in day I started to get zits in certain areas.<br /><br />All in all. It is a good product and keeps my beard looking and feeling good.\nGreat conditioner. Keep your beard happy.\nArgan Oil Hair Treatment Gift Set - 3 Value Pack: Morrocan Argan Oil Shampoo 8oz Conditioner 8 oz & Hair Heat Protectant Spray 4oz Sulfate Free Natural Damaged Hair Growth Repair Packaging May Vary\nPremium Nature\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.83 x 7.05 x 2.28 inches; 1 Pounds', 'Item model number': 'Argan Oil Hair Care Set', 'UPC': '857646006497'}\nI was hesitant to try this because my hair is colored and very finicky. But I only have a few complaints. One con for me is these smell good (kinda like a unisex smell) but it's so strong that I almost got annoyed by it. Although I was amazed at how long the smell lasted after the initial wash. Another con for me is the conditioner is very thin substance. I have long hair and because of the consistency it takes a lot more conditioner than I was hoping. It did not fade my color which is a plus!! And I have to brag about how much I love the heat spray. It doesn't leave my hair looking greasy or a weird sticky texture after straightening my hair. I will be buying the heat spray again!! Overall great product just be aware of the scent. It smells good just very strong and if you aren't into unisex scent it will almost smells like cologne.\nGreat product strong scent\nBeard Grooming Kit for Men - Beard Care Gift Sets Best Mustache and Beard Growth Natural Beard Oil Beard Softener Conditioner Balm Butter And Wooden Comb Best Gift Idea for Men Premium Nature\nPremium Nature\n{'Hair Type': 'Coarse', 'Liquid Volume': '1 Fluid Ounces', 'Item Form': 'Balm', 'Brand': 'Premium Nature', 'Number of Items': '2', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.47 x 4.02 x 2.36 inches; 6.4 Ounces', 'UPC': '857646006961'}\nAlright, I have tried many different beard oils and typically I am unsatisfied with the smell in some sort of way. Most of them seem to have the smell of an old lady. Many are so strong they give me headaches as the sent rests under me nose all day.<br />None of this is the case with this beard oil. It has an amazing smell and the sent strength is just perfect. It has citrus woodsy type smell in my opinion. It gained the approval of my wife in the smells department and that is no easy feat. Plus it conditions and hydrates just as it should. It will keep your beardruff at bay.<br /><br />I would most definitely recommend to a friend!\nI finally found the one.",
  "profile": "**User Summary:**\n\nThis user remains highly engaged with personal grooming, particularly in beard and hair care, favoring natural and effective products. Their latest interaction shows a significant appreciation for a beard oil that combines pleasant scent and conditioning properties. They specifically noted the appealing citrus woodsy fragrance, which met their sensitivity to strong scents—a shift from their earlier experiences with overpowering and undesirable aromas. This positive experience further emphasizes their preference for mild and enjoyable scents.\n\nConsistent with their previous behavior, the user values products that enhance hair and beard health without compromising on the quality, particularly for colored hair. They continue to seek grooming solutions that effectively address issues like dryness and flaking, while also considering ease of use and packaging. Their balanced reviews illustrate a discerning approach, acknowledging various product strengths while remaining sensitive to scent intensity and texture.\n\nOverall, the user is keen on reliable grooming products that elevate their care routines, and they exhibit a strong inclination toward effective, naturally formulated items with user-friendly application methods. The recent satisfaction with the beard grooming kit reinforces their ongoing pursuit of quality and effectiveness in personal grooming.",
  "metrics": {
    "rouge1_f": 0.18885096700796358,
    "rouge2_f": 0.020524515393386546,
    "rougeL_f": 0.09101251422070535,
    "meteor": 0.06757511533006409,
    "bleu1": 0.018779697039988705,
    "bleu2": 0.005001227555902139,
    "bleu3": 0.0008232024955875646,
    "bleu4": 0.00033437784919938346,
    "bertscore_precision": 0.3360213339328766,
    "bertscore_recall": 0.43303120136260986,
    "bertscore_f1": 0.3784077763557434
  }
}