{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nReview Date: 2021/05/19\nStore: Marine Forest\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Package Dimensions': '6.5 x 2.28 x 0.94 inches; 2.24 Ounces', 'UPC': '729843711958'}\nReview Text: Beautiful colors. works great and last a long time.\nReview Title: Awesome set\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "senvenski Gel Nail Polish Top and Base Coat Shine Mirror Eggshell Fur Matte Crystal Cat Eye Effect No Wipe Art Set Soak Off UV LED Lacquer Clear Resin Home Salon Use 6pcs (TB6-001)\nsenvenski\n{}\nGreat nail polish\nGreat nail polish\nKRISNICE Gel Nail Polish Kit- 6 Colors Blue Olive Turquoise Lavender Purple Gel Polish Set Glitter Nail Polish Soak Off LED Gel Nail Kit Nail Art Manicure Salon DIY at Home Gifts for Women (KCS6-010)\nKRISNICE\n{'Brand': 'KRISNICE', 'Item Form': 'Gel', 'Color': 'Blue,Olive,Turquoise,Purple', 'Type': 'gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Age Range (Description)': 'Adult', 'Unit Count': '6.00 Count', 'Liquid Volume': '7.3 Milliliters', 'Item Dimensions LxWxH': '5.51 x 3.94 x 0.59 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.51 x 3.94 x 0.59 inches; 1.41 Ounces', 'Item model number': 'KCS6-010', 'UPC': '613635849250'}\ngreat nail polish\nGreat nail polish\nBicrops Professional Haircutting Shears Kit, Stainless Steel Beard Hairdressing Scissors Set, Regular Hair Shear, Thinning Scissor, Leather Case. Home Hair Salon For Men And Women\nBicrops\n{'Material': 'Stainless Steel, Leather', 'Brand': 'Bicrops', 'Blade Material': 'Stainless Steel', 'Style': 'Classic', 'Blade Edge': 'Straight', 'Package Dimensions': '9.61 x 4.53 x 1.34 inches; 12.7 Ounces', 'UPC': '779324784056', 'Manufacturer': 'Bicrops'}\nComfortable to use. Well constructed and high quality. Very sharp out of the box and stayed that way for a long time.\nGreat Scissors\nLip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nMarine Forest\n{'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Package Dimensions': '6.5 x 2.28 x 0.94 inches; 2.24 Ounces', 'UPC': '729843711958'}\nBeautiful colors. works great and last a long time.\nAwesome set",
  "profile": "**User Summary:**\n\nThis user continues to prioritize high-quality beauty products, expanding their interests to include versatile makeup options. Their recent purchase of a lip liner set, celebrated for its beautiful colors and long-lasting performance, showcases their appreciation for innovative cosmetics that complement their grooming repertoire. This addition aligns with their established preference for premium, durable tools that enhance their home beauty routine, reflecting a thoughtful approach to personal grooming.\n\nThe user values not only the craftsmanship of their tools but also the aesthetics and functionality of makeup products. Their consistent focus on items that deliver professional results further emphasizes their dedication to quality and satisfaction. With a discerning eye for effective and comfortable products, they seek out cosmetics that not only provide smooth application but also align with their skin type needs.\n\nOverall, the user's ongoing commitment to exploring superior beauty options showcases a desire for a comprehensive salon-like experience at home, merging high performance with innovative designs across both grooming tools and makeup. This approach highlights their passion for versatility in appearance and self-expression, enhancing their beauty regimen with products that embody both craftsmanship and visual appeal.",
  "metrics": {
    "rouge1_f": 0.15447154471544716,
    "rouge2_f": 0.0326530612244898,
    "rougeL_f": 0.07317073170731707,
    "meteor": 0.07078190314765061,
    "bleu1": 0.05707367506281596,
    "bleu2": 0.009811331735817937,
    "bleu3": 0.002536197111375361,
    "bleu4": 0.0012910149251650611,
    "bertscore_precision": 0.3011391758918762,
    "bertscore_recall": 0.3426608443260193,
    "bertscore_f1": 0.3205610513687134
  }
}