{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dragonhawk Rotary Tattoo Machine Space Aluminum Machine for Tattoo Artists Coloring Black\nReview Date: 2016/07/18\nStore: Dragonhawk\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.95 x 5.2 x 2.85 inches; 10.08 Ounces', 'UPC': '701385991524'}\nReview Text: [[VIDEOID:bb5d02bd6cdc2aacb49b1a0f62af91fb]] My husband is a professional tattoo artist and he is always looking for the newest and best equipment.<br /><br />Tattoo machines are an important part of the tattoo process so having a machine that preforms well is a must have.<br /><br />The description says this machine is a 3.5 stroke but after using this my husband would have to say he believes it to be a 2.8 stroke in his professional opinion.<br /><br />When doing the tattoo he had to make several passes to get the line bold enough in the skin versus his other machines. He said this would be fine for doing black and grey tattoos but it is not a good machine to pack color.<br /><br />The machine is bulky and fits in the hand nice. There is no added weight and it doesn't feel uncomfortable in the hand.<br /><br />This is a rotary machine so traditional clip cords are not compatible with this.<br /><br />Overall this is a decent machine. Perfect for an apprentice.<br /><br />I was selected to review this item at a discount. My reviews are based on quality and performance and are never manipulated or altered in any way.\nReview Title: ... and he is always looking for the newest and best equipment. Tattoo machines are an important part of ...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Moroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nPure Body Naturals\n{'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nI'm a bit of a hair product snob. Years of coloring has damaged my hair badly so I am very picky what I use on it.<br /><br />Not only is this shampoo organic and not loaded with sulfates and parabens but it has an amazing smell. Almost like a sweet cedar.<br /><br />The shampoo has a medium lather. I used 10 pumps as I have think and mid length hair. I also left the shampoo in my hair for about 2 minutes.<br /><br />After washing my hair was not greasy or heavy from residue. There was definitely a shine but no oily feel.<br /><br />I have oily roots and this shampoo cleaned my hair with easy while leaving it evenly moisturizer.<br /><br />Overall I am very pleased and I definitely will be purchasing again.<br /><br />I was selected to review this item for free. My review and assessment is my own after personal use and has not been influenced or compensated.\nNot only is this shampoo organic and not loaded with sulfates and parabens but it has an amazing smell. Almost like a sweet ceda\nBath Gift Set for Her Blackberry Sage - Organic with Soap Bar, Bubble Bath, Sugar Scrub & Bath Pillow - Top Birthday and Christmas Gift Ideas for Women\n{'Package Dimensions': '12.4 x 9.1 x 8.5 inches; 3.25 Pounds', 'Item model number': '1', 'UPC': '780873595031'}\n[[VIDEOID:f7eef1e0d6ac999bf9c0518a71064d21]] This has two of my favorite things, blackberries and organic ingredients!<br /><br />I'm going to review each product in the set:<br /><br />Bubble bath: very thin like water. Produced little to no bubbles and what it did produce dissipated quickly. It does smell amazing.<br />3/5<br />Sugar scrub: Very moisturizing. Not to oily and not to dry. It has the right amount of oils. It left my skin silky smooth but my bathtub slippery.<br />4/5<br />Bath pillow: Very comfortable, had a bit of a strange smell at first I wiped it down with a cleansing wipe. The suction cups do come out but they are easy to reinsert.<br />4/5<br />Soap: Medium lathering it does clean well with no yucky residue.<br />4/5<br /><br />In all this is a decent set. I would like to see the bubble bath revamped. Then I could justify the price. As is I would not pay asking price as I could buy a better quality set for the same price.<br /><br />I was offered a discount to review this item. I paid 10$ out of pocket for this item. My reviews are based on quality and preformance and are never manipulated in any way.\nThis has two of my favorite things, blackberries and organic ingredients\nArgus Le Waterproof Electric Facial and Body Cleansing Brush Facial Massager Natural Face Cleanser for Women & Men- Stimulate Collagen - Pore Minimizer - Acne Scar Treatment -Reveal a Youthful Skin\nArgus Le\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.6 x 1.5 inches; 7.68 Ounces', 'UPC': '601951169787', 'Manufacturer': 'Argus Le'}\n[[VIDEOID:de92ae908edbae946014f9c8bd24b4e8]] My skin care and health is number one on my priorities. I am always on the lookout for the best products.<br /><br />This brush is definitely a must have. It has several attachments that keep your skin in is best shape.<br /><br />I tan in the summer mostly sunless but I also get a natural base tan. Before and after exfoliation is key to keeping a natural looking tan. In the video I am in a bathing suit (wanted to make that clear) and I am preparing to exfoliate before I go to the beach. With this brush you have a body brush, a facial brush, a pumice stone and a facial sponge.<br /><br />The body brush is great for legs and arms and even backs. The facial brush is Ye best way to deep clean all the makeup residue and grime from your face. The pumice stone is perfect for elbows, knees, ankles and fee. Lastly the sponge is an added bonus for serums and creams.<br /><br />My only complaint is the need for so many batteries. Other than that definitely a great brush set to have!<br /><br />I was selected to review this item at a discount. My reviews are based on personal use, quality and performance and are never manipulated or altered in any way.\nI am always on the lookout for the best products. This brush is definitely a must have\nRose Crystal Organic Rosewater Hydrating Facial Toner with Essential Oils, Pomegranate, and Rose Quartz Gem Elixir by Angel Face Botanicals\nAngel Face Botanicals\n{'Brand': 'Angel Face Botanicals', 'Skin Type': 'Oily, Acne Prone Skin, Combination, Sensitive, Dry, Normal', 'Material Feature': 'Organic', 'Scent': 'Rose', 'Unit Count': '4.5 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.7 x 2.3 x 2.3 inches; 8.8 Ounces', 'Manufacturer': 'Angel Face Botanicals'}\nThis had me at Rose Quartz! I'm a rock collector and I am all about beauty so this definitely peaked my interest!<br /><br />I've been using this for about a week and honestly I haven't seen an improvement in my complexion or anything fancy but this is awesome to use before applying makeup. It seems to grab the makeup and hold it on longer. Weird I know it isn't the intended use but it works! I also use it after I've done my make up to set it. If you compare ingredients to most setting spray that is all natural they are almost identical.<br /><br />The smell is light and flowery. Definitely has a scent of Rose with a bit of a witch hazel after scent.<br /><br />The spray itself is medium mist and covers the entire face with one burst. It's very light and absorbs quickly.<br /><br />This is a nice hydrating mist that has a multitude of uses and I would definitely recommend it.<br /><br />I was selected to review this item at a discount. My reviews are based on personal use, quality and performance and are never manipulated or altered in any way.\nI've been using this for about a week and honestly I haven't seen an improvement in my complexion or anything fancy but this is\nSuper Detox - Organic Deep Pore Facial Cleanser with Activated Charcoal, Green Tea, and Argan Oil 4.3 oz\nAngel Face Botanicals\n{'Item Form': 'Oil', 'Skin Type': 'Sensitive', 'Brand': 'Angel Face Botanicals', 'Scent': 'Tea Tree', 'Material Feature': 'Organic', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.7 x 1.9 x 1.8 inches; 5.6 Ounces'}\nAcne has been an issue for me since puberty. I am always searching for the newest and the best cleansers and treatments.<br /><br />I really love organic cleansers because they are very gentle on the face and don't load my pores down with nasty chemicals.<br /><br />This is a charcoal based wash and we all know charcoal is a purifier. This cleanser does not foam, however, you can feel it cleaning. It has a pleasant scent and is amazing at removing makeup. I have found a little bit will do it, you don't have to use a lot of cleanser to clean your face.<br /><br />I haven't seen any miracle results but I will tell you it does clean well.<br /><br />Overall a decent cleanser. Price wise a little steep but with Organics you're always going to pay more.<br /><br />I was selected to review this item at a discount. My reviews are based on personal use, quality and performance and are never manipulated or altered in any way.\nI am always searching for the newest and the best cleansers and treatments\nDragonhawk Rotary Tattoo Machine Space Aluminum Machine for Tattoo Artists Coloring Black\nDragonhawk\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.95 x 5.2 x 2.85 inches; 10.08 Ounces', 'UPC': '701385991524'}\n[[VIDEOID:bb5d02bd6cdc2aacb49b1a0f62af91fb]] My husband is a professional tattoo artist and he is always looking for the newest and best equipment.<br /><br />Tattoo machines are an important part of the tattoo process so having a machine that preforms well is a must have.<br /><br />The description says this machine is a 3.5 stroke but after using this my husband would have to say he believes it to be a 2.8 stroke in his professional opinion.<br /><br />When doing the tattoo he had to make several passes to get the line bold enough in the skin versus his other machines. He said this would be fine for doing black and grey tattoos but it is not a good machine to pack color.<br /><br />The machine is bulky and fits in the hand nice. There is no added weight and it doesn't feel uncomfortable in the hand.<br /><br />This is a rotary machine so traditional clip cords are not compatible with this.<br /><br />Overall this is a decent machine. Perfect for an apprentice.<br /><br />I was selected to review this item at a discount. My reviews are based on quality and performance and are never manipulated or altered in any way.\n... and he is always looking for the newest and best equipment. Tattoo machines are an important part of ...",
  "profile": "**User Summary:**\n\n- **Hair Care Preference**: The user prioritizes organic, sulfate-free, and paraben-free hair care products, reflecting a commitment to natural ingredients that address damage from coloring.\n\n- **Skincare Interest**: Their focus includes skincare tools, hydrating mists, and organic cleansers, emphasizing effective cleansing, hydration, and overall skin health. They prefer multifunctional products, in line with their holistic beauty approach.\n\n- **Product Characteristics**: The user appreciates sweet and unique scents, favoring light, floral fragrances and elements like charcoal for purification. They seek effective products with minimal residues while integrating exfoliation and deep cleansing into their routine.\n\n- **Application Method**: They are intentional about application techniques and product quantities, suited for their thick, mid-length hair and detailed skincare regimen.\n\n- **Performance Evaluation**: They value a balance between cleansing and moisturizing, managing oily roots while promoting overall health. Though they may not see immediate improvements with new products, they prioritize those with versatile applications and gentle, organic formulations.\n\n- **Repurchase Intent**: They demonstrate satisfaction with tested products but are discerning about quality and price, open to exploring alternatives.\n\n- **Overall Sentiment**: Recent interactions reveal an interest in high-quality equipment related to art, specifically tattooing, highlighting a focus on performance and practical applications. The user continues to seek effective, enjoyable solutions that enhance their routines while managing specific concerns, reflecting a broader appreciation for quality across different products.",
  "metrics": {
    "rouge1_f": 0.11771058315334774,
    "rouge2_f": 0.014054054054054056,
    "rougeL_f": 0.0550755939524838,
    "meteor": 0.04198533809818979,
    "bleu1": 0.001045389700013526,
    "bleu2": 0.00027552603526235977,
    "bleu3": 3.946403706029258e-05,
    "bleu4": 1.4948267863033908e-05,
    "bertscore_precision": 0.38800179958343506,
    "bertscore_recall": 0.5100101232528687,
    "bertscore_f1": 0.4407176375389099
  }
}