{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Moroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nReview Date: 2015/12/26\nStore: Pure Body Naturals\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nReview Text: I'm a bit of a hair product snob. Years of coloring has damaged my hair badly so I am very picky what I use on it.<br /><br />Not only is this shampoo organic and not loaded with sulfates and parabens but it has an amazing smell. Almost like a sweet cedar.<br /><br />The shampoo has a medium lather. I used 10 pumps as I have think and mid length hair. I also left the shampoo in my hair for about 2 minutes.<br /><br />After washing my hair was not greasy or heavy from residue. There was definitely a shine but no oily feel.<br /><br />I have oily roots and this shampoo cleaned my hair with easy while leaving it evenly moisturizer.<br /><br />Overall I am very pleased and I definitely will be purchasing again.<br /><br />I was selected to review this item for free. My review and assessment is my own after personal use and has not been influenced or compensated.\nReview Title: Not only is this shampoo organic and not loaded with sulfates and parabens but it has an amazing smell. Almost like a sweet ceda\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Moroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nPure Body Naturals\n{'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nI'm a bit of a hair product snob. Years of coloring has damaged my hair badly so I am very picky what I use on it.<br /><br />Not only is this shampoo organic and not loaded with sulfates and parabens but it has an amazing smell. Almost like a sweet cedar.<br /><br />The shampoo has a medium lather. I used 10 pumps as I have think and mid length hair. I also left the shampoo in my hair for about 2 minutes.<br /><br />After washing my hair was not greasy or heavy from residue. There was definitely a shine but no oily feel.<br /><br />I have oily roots and this shampoo cleaned my hair with easy while leaving it evenly moisturizer.<br /><br />Overall I am very pleased and I definitely will be purchasing again.<br /><br />I was selected to review this item for free. My review and assessment is my own after personal use and has not been influenced or compensated.\nNot only is this shampoo organic and not loaded with sulfates and parabens but it has an amazing smell. Almost like a sweet ceda",
  "profile": "**User Summary:**\n\n- **Hair Care Preference**: The user is discerning and places a high value on hair care products that are organic, sulfate-free, and free of parabens, indicating a preference for natural ingredients and a concern for hair health, especially after experiencing damage from coloring.\n\n- **Product Characteristics**: They favor products with pleasant scents, specifically noting a liking for sweet and unique fragrances. Additional importance is placed on effective cleaning without leaving greasy or heavy residuals.\n\n- **Application Method**: The user demonstrated a specific application technique, suggesting they are thoughtful and meticulous about their hair care routine. They pay attention to the quantity used based on hair type and length, indicating they have thick, mid-length hair.\n\n- **Performance Evaluation**: A major consideration is the balance between cleansing and moisturizing capabilities, as they seek products that can handle oily roots while maintaining overall hair health. \n\n- **Repurchase Intent**: The expression of satisfaction and intention to repurchase underscores their commitment to finding high-quality, effective hair products.\n\n- **Overall Sentiment**: The user's interactions reflect a blend of appreciation for quality, effectiveness, and sensory experience, making them likely to continue seeking similar products in the hair care category.",
  "metrics": {
    "rouge1_f": 0.31390134529147984,
    "rouge2_f": 0.036036036036036036,
    "rougeL_f": 0.12556053811659193,
    "meteor": 0.15027157380343822,
    "bleu1": 0.23099776642007291,
    "bleu2": 0.051120807640585034,
    "bleu3": 0.019505387019096255,
    "bleu4": 0.006782189514810719,
    "bertscore_precision": 0.417668879032135,
    "bertscore_recall": 0.45310020446777344,
    "bertscore_f1": 0.43466368317604065
  }
}