{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sally Hansen Miracle Gel Neon Collection, 870 Feelin' Grape\nReview Date: 2022/06/09\nStore: Sally Hansen\nProduct Description: ['Miracle Gel nail colour is a 2-step gel system manicure with no UV lamp needed. The life-proof polish lasts throughout your everyday life, is more chip-resistant than regular nail polish and removes easily with regular nail polish remover. Both the Miracle Gel nail colour and top coat Activator contain patented Tube Technology, allowing higher loading of actives and a continuous care release into the gel lacquer film, resulting in beautifully durable, high-shine gel finish nails. Step 2 Sold Seperately.']\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Sally Hansen', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Glossy, Matte', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Number of Pieces': '1', 'Liquid Volume': '14.7 Milliliters', 'Item Dimensions LxWxH': '1.39 x 1.39 x 3.25 inches', 'Product Dimensions': '1.39 x 1.39 x 3.25 inches; 2.47 Ounces'}\nReview Text: Not sure what this formula is supposed to be.  It goes on very sheer, has a light purple color, certainly NOT neon. It dries very quickly but is MATTE.  The color in the bottle is accurate but only when you put on 5 coats and then use a topcoat to get a shine.  You can see the difference in the sheen: one is without a topcoat (and is matte) the second pix is with the Sally Hansen Insta-Dri in 'Clearly Quick'.<br />This is horrible.  Not the usual Sally Hansen quality at all.  This was a loss.\nReview Title: Sheer, MATTE and pale color unless you put on 5+ coats\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Vitamin C Serum 2 fl. oz with L'Ascorbic Acid - Facial Skin Care & Anti Aging Serum That Helps Skin Brightening, Repair Sun Damage, Fade Age Spots, Dark Circles, Wrinkles & Fine Lines\n{'Item Form': 'Liquid', 'Item Weight': '0.31 Pounds', 'Unit Count': '2 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.83 x 3.46 x 2.2 inches; 4.96 Ounces', 'UPC': '602519445008'}\nVery light feeling, clear serum that sinks into my skin with no stickiness at all.  It doesn't feel 'tacky' on my skin, but I'm so dry that it just soaked it right up!<br />The glass dropper is long enough to reach the bottom of the glass jar.  Looks and feels very 'vintage, like something off of an Apothecary's shelf.  If you're not a fan of the dropper, you can just use the bottle top that it comes with.<br />I didn't notice any discernable scent to this.  Not floral, not perfumey, just clean.  As soon as I rubbed it in, there was NO smell left on my hands.  It just disappeared.  This is one for the beauty stand.  Very good quality and I'm happy to have been able to test this at a reduced price from the company.\nSo light and soaked right into my skin\nUptown Cosmeceuticals Eyelash Growth Serum Contains Stem Cell & Myristoyl Pentapeptide-17, Dermatologist Lab Tested Lash & Eyebrow Growth Formula, 4 Months Supply 3.5ml\n{}\nStill waiting for the results.  I don't have terribly thick eyebrows so I wanted some of this to try out.  I've been applying it at bedtime and before I put my makeup on. It is a nice light viscous oil that doesn't weigh down my brow hairs.  Perhaps knowing that I've put something on my eyebrows makes me not fuss with them as much.  Time will tell, but so far, I like it.  I can use my Anastasia BH brow kit over this and it doesn't change the application at all (I dust a bit of setting powder on before)<br />I like it and will update if there is anything significant to tell!<br />If you feel that my review was helpful, please let me know by selecting “Yes” from the options below. Even though I received this product at lower cost, I am not obligated in any way to review positively, my opinion has not been influenced by outside sources in any manner. I am not affiliated with this company and I never promise to provide a positive review when offered. I test the product thoroughly and do my best to provide detailed reviews to other Amazon customers so they may make informed decisions.  My hope is that these reviews are helpful to others.\nSeems to be working for my brow hair!\nProfessional Hair Straightener Brush Best for Beauty 40W Digital Electric Straightening Comb Styles Silky Look\n{'Package Dimensions': '13.1 x 4.3 x 2.3 inches; 1.8 Pounds'}\nI am always sceptical when I see advertisements on TV for products that seem 'AMAAAAZZZZING!  MUST BUY NOW!!'<br />I wasn't too sure what to expect with this. I thought it was gimmicky, but I am happy to be proven wrong.<br />This is so much easier to use than a flat iron.<br />I like that it has a digital LCD that shows you what temperature the brush is heating up to.  It gives the heat range that your hair styling should be at depending on thickness, etc. I set mine to 230, the hottest setting and it worked great for my thick, curly hair.<br />It heats up very quickly and the hand grip is comfortable. The cord rotates from the end and the grip on the back of the wand feels nice in the hand.<br />The rubbery nubs on the ends of the bristles offer some flexibility, but they are not as flexible as your hairbrush. They are also shorter, too.<br />The way that you do this is to start with clean, well brushed hair.  As the bristles are short, they will not detangle for you.  Have your hair prepped and ready.  If you use a smoothing serum, it would be perfect to add it before you start with this.<br />You simply brush it over your hair like you would a hairbrush. You can brush from underneath or on top to make sure that all the hair gets close to the heated plate of the brush.<br />You can spend more time on areas that you want straightened more but I found that my doing my hair in pieces (held up with an alligator clip) worked best for me.<br />In order to get to the roots at the scalp, it was very easy.  The brush is easy to angle towards the scalp and it gets about 1/2&#34; away from the scalp easily and starts straightening from there.<br />If you hair is damp, you will see some steam, but you'd expect that with a curling iron or flatiron, too.<br />This actually worked so well, my kids wanted to try it out and they loved it!<br />The only concern that I had was that if you hair is the type to come out when you brush it, it will come out when you use this, too.  The issue was removing the hair from the straightener.  It is HOT. I had to work quickly to sweep the excess hair from the brush to toss.  I will keep a wide tooth comb by this the next time I use it so I can run it over the bristles and remove the hair.<br />All in all: I give this a strong thumbs up!<br />I can't speak about the others on the market, but this one really does what it says it will do.  It is way better than a flat iron.  It covers more ground and feels more comfortable in the hand.  Its a natural movement to brush your hair and this is no different.<br />Excellent new beauty tool!  Very happy that this does what it claims to do!  Part of my daily hair regime now!<br />If you found this review helpful, please click the 'yes' button below.<br /> I have personally used the product and tried my best to reflect my experience with the product so you can make a more informed purchasing decision. Hopefully my review includes the information you would want to know before ordering.\nIt actually works!  This is pretty amazing on my curly hair!\nEye Gel From Majestic Pure Offers Potent Anti Aging & Skin Firming Gel Cream For Dark Circle Eyes, Wrinkles, Eye Puffiness & Loss of Tone and Resilience, 1.7 fl. oz.\n{'Item Form': 'Gel', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Skin Type': 'All', 'Item Volume': '1.7 Fluid Ounces', 'Package Dimensions': '3 x 2.8 x 2.7 inches; 6.4 Ounces'}\nI love the cooling feeling from this thick gel.  It has a unique push down applicator that you can simply swipe off the amount you dispense to put it on your forehead, under your chin, around your neck or around your eyes.  As it dries and sinks into your skin, it makes it feel a bit tighter.<br />There is also a moisturizing feel to it as well.  I realize that this sounds contradictory: moisturizing, plus tightening but it does work.<br />I find that the results last, for me, about 3-4 hours.  This is not an issue, but I feel worth noting.  This isn't an all day formula.<br />This formula has Hyaluronic Acid and vitamin E oil in it.  Although the list of ingredients is lengthy, what I base my decision on is: does this work?<br />This does.  The puffiness under my eyes, the crepe-y neck, the small lines on my forehead have all benefited from this gel.<br />A little does go a long way.  This is also perfect to use as an overnight serum on your skin.<br />Very happy with this.  Love the pump, love the product, love the results.\nExcellent formula for neck, forehead, and eyes!\nVelvetPets - Dog Cat Slicker Hair Brush and Comb Set | Pet Grooming Brushes for Detangling and Shedding | Great for Short, Long, Curly, Matt Hair Pets and Undercoat Fur | Soft Bamboo Kit\nVelvetPets\n{'Brand': 'VelvetPets', 'Shape': 'Oblong', 'Handle Material': 'Rubber, Metal', 'Unit Count': '1.0 Count', 'Hair Type': 'Curly', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '12.17 x 4.8 x 2.95 inches; 6.31 Ounces', 'UPC': '045934697049'}\nI have 2 standard poodles and their hair needs daily attention.  As their hair texture is very tightly curled and soft, it tends to mat easily.<br />I love these brushes for raking their hair and then fluffing it up.<br />The comb has rotating pins so that it will glide through their tangles easily and not pull.<br />As anyone who has brushed a tangled cat or dog, you know that any discomfort that they feel will likely mean that you will get some teeth marks on your hand and the dreaded 'smile' with all their teeth showing.<br />This set comes in a pretty canvas drawstring bag and has solid bamboo handles.  The grips on the handles have raised silicone pads to keep your hand from getting fatigued...and to prevent them from slipping when Pooch or Kitty decides to grab it and run off.<br />I'm happy with this set.  You get all 3 grooming tools in the set: pin brush, fluff brush, pin comb.<br />Makes my dogs happy and keeps their hair looking awesome...till they roll on the grass :)<br />If this helped you, please click 'yes' below.  Thanks\nBamboo pin brush, comb, fluff brush.  SEE PIX\nLASHVIEW False eyelash+lash glue (VC)\nLASHVIEW\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.4 x 4.5 x 0.6 inches; 0.81 Ounces'}\nGorgeous lashes. The strip is a bit stiff but once you heat it with the hairdryer and get the bend the way you want it, it stays put.<br />There are a variety of styles but I like the more natural one the best.<br />If you use a quality lash glue (Kiss) then these will work great for you.  Again: the only issue was that they band was a bit 'flat' straight out of the package.  It was easily fixed.<br />I have been able to wear these many times with no lash fallout or damage.<br />I did need to trim about 25% off them, but they are still full and beautiful.\nBeautiful lashes!\nBest Jade Roller For Face - Massager Slimming Tool Roller Anti Aging Therapy Wrinkle Cellulite Green Jade Chinese Facial Therapy 100% Natural Double Neck Healing Slimming Premium Quality in Gift Box\nXavié\n['Beauty And Health Benefits', 'Jade facial rollers have been around for centuries; there’s evidence of them as far back as seventh-century China, where the stone was believed to have healing and protective properties. Jade carries a soothing and nourishing energy that can feel very healing as it purifies energy field and creates a serene feeling of harmony and balance.', 'Using the Xavié™ Jade Roller on the face, neck and body has the following effects:', 'Helps with anti-aging and prevents fine lines and wrinkles from appearing on your face', 'Helps with anti-aging and prevents fine lines and wrinkles from appearing on your face', 'Reduces puffiness, wrinkles and dark circles around eyes', 'Reduces puffiness, wrinkles and dark circles around eyes', 'Improve elasticity of the skin by tightening and toning', 'Improve elasticity of the skin by tightening and toning', 'Provides a soothing and relaxing effect on the skin relieving facial tension', 'Provides a soothing and relaxing effect on the skin relieving facial tension', 'Helps penetrate beauty products like face creams and serums deeper into the skin', 'Helps penetrate beauty products like face creams and serums deeper into the skin', 'Promotes blood circulation to the face for a natural healthy glow', 'Promotes blood circulation to the face for a natural healthy glow', 'Promote lymphatic drainage', 'Promote lymphatic drainage', 'Eliminate toxins', 'Eliminate toxins', 'The jade roller can also tighten pores since the jade remains cold even when in direct contact with the skin', 'The jade roller can also tighten pores since the jade remains cold even when in direct contact with the skin', 'Package Includes:', 'One Jade Roller Green', 'PLEASE NOTE:', 'Due to the nature of the jade stone, each piece varies in color - from very pale to darker green to opaque and translucent.', '100% SATISFACTION GUARANTEE:', 'Our number one priority is to ensure customer satisfaction and product quality. Try the Xavié™ Jade Roller for 30 days and love it, or your money back. Hassle-free and 100% satisfaction guarantee.', '**Supply is limited. Order today to ensure availability']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 3.3 x 0.8 inches; 3.99 Ounces', 'UPC': '715007582915', 'Manufacturer': 'Xavié'}\nI don't often leave a one star review but here it is.<br />The wire that connects the jade pieces to the handle is exceptionally thin and brittle.<br />The large end jade had dislodged during shipping so I tried to put it back.<br />The second I tried to bend the prongs together to hold the jade in place, they both snapped at the base.<br />All in all: not good quality.  It does come in a pretty box, so there's that.<br />I have since seen this same item on Ebay for a dollar.  That's what it is worth IMO\nMetal is garbage.  Not worth the price.\nCurling Iron, Curling Wand Set with Hair Straightener Brush, Professional Hair Curler with 6 Interchangeable Ceramic Barrels, 60 Min Auto Off Hair Iron with Heat Resistant Glove, 2 Clip…\nDuomishu\n{'Brand': 'Duomishu', 'Hair Type': 'Fine', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '232.2 Degrees Celsius', 'Package Dimensions': '13.54 x 8.7 x 2.24 inches; 2.25 Pounds', 'UPC': '641197835275', 'Manufacturer': 'SuperDuomishu'}\nLove this multi-head curling iron.  My daughter's hair is very straight and she needed lots of curls to wear with her halo hairpiece.  I curled both of them identically for a seamless look.<br />The curling iron heats up very quickly and you can read the temperature as it is rising.  The barrels do not have clamps.  You have to wrap the hair around the various barrels and hold it for a few seconds.  There is a heat proof glove that makes this very easy so you don't worry about burning your hands.<br />I had to use some heat spray and hold on my daughter's hair and it did not stick to the barrels.  I accidentally put it down next to a plastic bag.  The bag melted on the barrel but was easily wiped off with a tissue.  There is a straightening brush attachment that you can use as well.<br />The barrels are easy to fit into the handle: just line up the pins, push down and turn to lock them in place.  Where you push them in does not get hot so you can change out your barrels while you're doing your styling.<br />The cord on this unit is 6' long.<br />Great value for multi use curling wands.\nNon-stick surface, accurate temp, LONG cord, interchangeable barrels, fast heating (*pix*)\n3 Barrel Curling Iron, Seniny 1 Inch Ceramic Hair Crimper for Women, Dual Voltage Three Barrel Hair Waver with LCD Temp Display, Temperature Adjustable Waver Iron, Portable Tourmaline Triple Barrels\nSeniny\n{'Brand': 'Seniny', 'Hair Type': 'All', 'Material': 'Ceramic', 'Color': 'Pink', 'Power Source': 'Corded Electric', 'Package Dimensions': '15.98 x 4.29 x 3.5 inches; 1.63 Pounds', 'Item model number': 'R01-HCW210PI52-001', 'Manufacturer': 'Seniny'}\nMy daughter's hair is poker straight, thick and will not hold a curl.  Enter: The TIKTOK curling iron!<br />This was easy to use and gave her some fluffy waves that look amazing.<br />This takes a lot longer than a regular curling iron due to the fact that you can only do small pieces at a time.  YOu have to move the iron down the length of hair after about holding it for 15 seconds (YMMV)<br />We use a hair protectant and some styling spray and her waves lasted about 8 hours.  That's a win in my book.\nBeachy waves on straight hair? Yes please! *pix*\nSally Hansen Miracle Gel Neon Collection, 870 Feelin' Grape\nSally Hansen\n['Miracle Gel nail colour is a 2-step gel system manicure with no UV lamp needed. The life-proof polish lasts throughout your everyday life, is more chip-resistant than regular nail polish and removes easily with regular nail polish remover. Both the Miracle Gel nail colour and top coat Activator contain patented Tube Technology, allowing higher loading of actives and a continuous care release into the gel lacquer film, resulting in beautifully durable, high-shine gel finish nails. Step 2 Sold Seperately.']\n{'Brand': 'Sally Hansen', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Glossy, Matte', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Number of Pieces': '1', 'Liquid Volume': '14.7 Milliliters', 'Item Dimensions LxWxH': '1.39 x 1.39 x 3.25 inches', 'Product Dimensions': '1.39 x 1.39 x 3.25 inches; 2.47 Ounces'}\nNot sure what this formula is supposed to be.  It goes on very sheer, has a light purple color, certainly NOT neon. It dries very quickly but is MATTE.  The color in the bottle is accurate but only when you put on 5 coats and then use a topcoat to get a shine.  You can see the difference in the sheen: one is without a topcoat (and is matte) the second pix is with the Sally Hansen Insta-Dri in 'Clearly Quick'.<br />This is horrible.  Not the usual Sally Hansen quality at all.  This was a loss.\nSheer, MATTE and pale color unless you put on 5+ coats",
  "actual_interaction": {
    "rating": 1.0,
    "title": "Sheer, MATTE and pale color unless you put on 5+ coats",
    "text": "Not sure what this formula is supposed to be.  It goes on very sheer, has a light purple color, certainly NOT neon. It dries very quickly but is MATTE.  The color in the bottle is accurate but only when you put on 5 coats and then use a topcoat to get a shine.  You can see the difference in the sheen: one is without a topcoat (and is matte) the second pix is with the Sally Hansen Insta-Dri in 'Clearly Quick'.<br />This is horrible.  Not the usual Sally Hansen quality at all.  This was a loss.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/51-2MFoUC5L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/51-2MFoUC5L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/51-2MFoUC5L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/51ekBKvIa5L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/51ekBKvIa5L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/51ekBKvIa5L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B092YN4DG4",
    "parent_asin": "B092YN4DG4",
    "user_id": "AHYUFOFTGNEV4TGMQLASS6EA7QAQ",
    "timestamp": "2022-06-09 15:27:40.160000",
    "helpful_vote": 4,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Sally Hansen Miracle Gel Neon Collection, 870 Feelin' Grape",
    "average_rating": 3.7,
    "rating_number": 37,
    "features": [],
    "description": [
      "Miracle Gel nail colour is a 2-step gel system manicure with no UV lamp needed. The life-proof polish lasts throughout your everyday life, is more chip-resistant than regular nail polish and removes easily with regular nail polish remover. Both the Miracle Gel nail colour and top coat Activator contain patented Tube Technology, allowing higher loading of actives and a continuous care release into the gel lacquer film, resulting in beautifully durable, high-shine gel finish nails. Step 2 Sold Seperately."
    ],
    "price": 5.1,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/311B4QYI1bS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/311B4QYI1bS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61GtxapaqpS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41GdR81c68S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41GdR81c68S.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61sskDiJM4S._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/2176d9Y62lS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/2176d9Y62lS.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/51Y8njtheNS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51MdGmNNdQS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51MdGmNNdQS.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/81U2pK4zgCS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/514b6u7ddfS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/514b6u7ddfS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81VaZHU4oWS._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Sally Hansen",
    "categories": [],
    "details": {
      "Brand": "Sally Hansen",
      "Item Form": "Gel",
      "Type": "gel",
      "Finish Type": "Glossy, Matte",
      "Age Range (Description)": "Adult",
      "Number of Items": "1",
      "Number of Pieces": "1",
      "Liquid Volume": "14.7 Milliliters",
      "Item Dimensions LxWxH": "1.39 x 1.39 x 3.25 inches",
      "Product Dimensions": "1.39 x 1.39 x 3.25 inches; 2.47 Ounces"
    },
    "bought_together": null
  }
}