{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ron White: A Little Unprofessional\nReview Date: 2013/09/11\nStore: Ron White  (Actor),     Tom Forest  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Ron 'Tater Salad' White has been Drunk in Public. He Tried to Fix Stupid. No one argues that he has Behavioral Problems, and now he is 'A Little Unprofessional'. with cigar in one hand and a glass of scotch in the other, the Grammy-Nominated Blue Collar Comedy Tour alum delivers more than an hour of all new material with is signature, irreverent storytelling style and the best comedic timing in the business. Filmed live at the Paramount Theater in Austin, TX.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Tom Forest, Ron White', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Tom Forest', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Uhe/Csdc', 'Number of discs': '1'}\nReview Text: FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! Ron White has done it again with a Las Vegas smash hit and of course, some great scotch!\nReview Title: Funny as expected!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "BET ComicView All Stars, Vol. 3\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['DVD']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Media Format': 'NTSC', 'Release date': 'June 11, 2002', 'Studio': 'Time Life Records'}\nWish they had more of Don DC Curry! The other artists are funny as well, some are younger shots of current/recent successful comedians, but other than that I would rate it a 8.5. Definitely worth a look!\nHilarious!\nThe Warriors [Blu-ray](Ultimate Directors cut)\nMichael Beck  (Actor),     James Remar  (Actor),     Walter Hill  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Warriors, The (BD)', \"A battle of gigantic proportions is looming in the neon underground of N ew York City. The armies of the night number 100,000; they o utnumber th e police 5 to 1; and tonight they're after the Warriors - a street gang blamed unfairly for a rival gang leader's death. This contemporary actio n-adventure story takes place at night, underground, in the sub-culture of gang warfare that rages from Coney Island to Manhattan to the Bronx. Members of the Warriors fight for their lives, seek to survive in the u rban jungle and learn the meaning of loyalty. This intense and stylized film is a dazzling achievement for cinematographer Andrew Laszlo.\", ']]>']\n{'Genre': 'Drama, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'NTSC, Widescreen, Multiple Formats, Blu-ray', 'Contributor': 'Michael Beck, Brian Tyler, Walter Hill, David Harris, Dorsey Wright, James Remar', 'Language': 'English (Dolby Digital 5.1), Spanish (Mono), French (Mono)', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370216BR', 'Director': 'Walter Hill', 'Media Format': 'Multiple Formats, Blu-ray, Widescreen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Michael Beck, James Remar, Dorsey Wright, Brian Tyler, David Harris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nJust a present for my wife! She's is a nut case fro this movie so I got it for her as a gag gift!\nI got it for my wife, she loves it!\nBlue Collar TV - Season 1, Vol. 1\nJeff Foxworthy  (Actor, Writer),     Larry the Cable Guy  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The guys who had you laughing on the Blue Collar Comedy Tour - Jeff Foxworthy, Bill Engvall and Larry the Cable Guy - bring their particular brand of hilarity to Blue Collar TV: Season 1 Volume 1. Expect a hometown buffet of TV parodies, sketches, and stand-up, celebrating everything from spouses to spoilers, Winnebagos to Waffle Houses, cheap beer to even cheaper lingerie. You are about to get a 64-oz. Big Gulp of blue collar comedy. Are you ready?', 'DVD Features:', 'Documentary', 'Other', 'Amazon.com', 'Blue Collar TV', 'finds three of the boys from', 'Blue Collar Comedy Tour: The Movie', 'and', 'Blue Collar Comedy Tour Rides Again', 'in a sketch comedy format, supported by a talented ensemble of comic players and writers who know how to build on the stars\\' individual strengths. Jeff Foxworthy is the series\\' anchor, opening each episode in the 1994 debut season with a strong monologue riffing on one or another theme: marriage, bad jobs, sports, vacations, family, partying. Happy redneck Larry the Cable Guy and NASCAR-loving Everyman Bill Engvall join Foxworthy in energetic skits that definitely become funnier and bolder with each new show. Among the best sketches is \"CSI: Greater Greensboro Tri-Area,\" in which Foxworthy\\'s crime-scene sleuth is on the trail of a deerslayer. \"Lingerie for Couples Together 20 Years\" spotlights such hot domestic garb as sweatshirts accented with a ratty, cat-hair-covered blanket from the back of a closet. \"Hug or Hit\" is a mock game show in which a terrified contestant has to predict whether a drunk sleeping in a glass booth will, upon awakening, embrace or take a swing at him.', 'The recurring \"I believe\" format finds Foxworthy, Larry, and Engvall piously revealing articles of their faith in this hard, hard world: \"I believe,\" Engvall says, \"that Angelina Jolie thinks about me as much as I think about her.\" Right. Guest star Ron White (the missing fourth partner from the', 'Blue Collar', \"tours), cigarette and Scotch-on-the-rocks in hand, lends his decadent (and welcome) persona here and there to the proceedings. Drew Carey shows up as well, but it's the series' obvious growth over 13 episodes that makes\", 'Blue Collar TV', 'a comedy success.', '--Tom Keogh']\n{'Genre': 'Documentary, Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff FoxworthyLarry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff Foxworthy   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 0.5 inches; 5.6 Ounces', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '5 hours and 2 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Jeff Foxworthy, Larry the Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Producers': 'Kathy Katz, Ted Kenney, Tom Park', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy', 'Number of discs': '2'}\nI like good redneck humor and this is it! You might be a redneck if.....FUNNY! Jeff Foxworthy, Bill Engvall and Larry the Cable Guy have done it again with a lot of laughs smash hit and of course, some redneck humor! Freakin funnier than ever yee hahah!\nGreat Redneck Humor!\nBlue Collar TV: Season 1, Vol. 2\nJeff Foxworthy  (Actor, Writer),     Larry The Cable Guy  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['If you thought the Vol. 1 Blue Collar TV DVD was as welcome and satisfying as ham and red-eye gravy, you\\'re only half right. \\'Cause this Vol. 2 set (3 discs, 18 episodes) completes the Season 1 fun and, like the previous volume, builds each episode around a theme ? like \"The Human Body,\" \"Christmas\" or \"Gadgets.\" Pass that gravy and stay awhile, friends. Y\\'all gonna have some right-good laughs.']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff FoxworthyLarry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff Foxworthy   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '3', 'Runtime': '6 hours and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Jeff Foxworthy, Larry The Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy, Mathew Harawitz', 'Number of discs': '3'}\nFUNNY! FUNNY! Jeff Foxworthy has done it again with a lot of laughs smash hit and of course, some redneck humor!\nGood Hillbilly Redneck Humor/Skits!!!!!!\nRon White: A Little Unprofessional\nRon White  (Actor),     Tom Forest  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Ron 'Tater Salad' White has been Drunk in Public. He Tried to Fix Stupid. No one argues that he has Behavioral Problems, and now he is 'A Little Unprofessional'. with cigar in one hand and a glass of scotch in the other, the Grammy-Nominated Blue Collar Comedy Tour alum delivers more than an hour of all new material with is signature, irreverent storytelling style and the best comedic timing in the business. Filmed live at the Paramount Theater in Austin, TX.\"]\n{'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Tom Forest, Ron White', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Tom Forest', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Uhe/Csdc', 'Number of discs': '1'}\nFUNNY! FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! Ron White has done it again with a Las Vegas smash hit and of course, some great scotch!\nFunny as expected!",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interests:** The user maintains a strong affinity for comedy, particularly enjoying stand-up and variety shows infused with redneck humor. They continue to appreciate comedic content from both established talents and emerging artists, valuing ensemble casts and relatable humor.\n\n- **Format Preference:** Their passion for physical media is evident with recent DVD purchases, including titles that showcase their commitment to building a personal collection of tangible formats.\n\n- **Engagement with Artists:** The user actively engages with comedians who connect culturally and personally, with a clear preference for humor that reflects everyday experiences. Their admiration for performers like Ron White underscores their dedication to this genre.\n\n- **Rating Pattern:** The user's rating pattern remains consistently high for comedic content, reflecting their enthusiasm for enjoyable comedic experiences. Perfect scores are commonly awarded to performances that resonate deeply with their taste.\n\n- **Review Style:** Their reviews are characterized by personal insights and a humorous outlook, highlighting a blend of humor with critiques while showcasing enthusiasm for sharing comedic adventures.\n\n- **Long-term Affinity:** While the user prioritizes comedy, they are also exploring how other genres can complement their love for humor, indicating a diverse entertainment palate that enriches their viewing experiences and influences their gift-giving practices.",
  "metrics": {
    "rouge1_f": 0.10443571027512634,
    "rouge2_f": 0.007869589657110737,
    "rougeL_f": 0.04941044357102751,
    "meteor": 0.03207036516380307,
    "bleu1": 0.00015983999758538067,
    "bleu2": 3.528488010534453e-05,
    "bleu3": 5.795973501514949e-06,
    "bleu4": 2.3513479997498312e-06,
    "bertscore_precision": 0.3295801877975464,
    "bertscore_recall": 0.4718412160873413,
    "bertscore_f1": 0.3880842626094818
  }
}