{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dexter: The Complete Series Collection\nReview Date: 2015/08/22\nStore: Michael C. Hall  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['Product Description', \"Dexter is a crime drama about Dexter Morgan, a man who leads a double life as an incredibly likeable forensics expert for the Miami Police Department and as an emotionless vigilante serial killer. Taught by his foster father to harness his lust for blood and killing, Dexter lives by his own strict moral code - he only kills murderers who can't otherwise be brought to justice. Dexter is a killer who grapples with fitting into society while, at the same time, he struggles with his inability to feel emotion. The irony of Dexter's life is that he works closely as a blood splatter analyst with the very people who hunt his kind - the homicide departments.\", 'Amazon.com', 'Own it all: 8 seasons, exclusive art book and a bonus disc of killer special feature in a collectible slide box inspired by the one Dexter himself uses on the show to catalog his kills. Join your favorite serial killer in all 8 chilling seasons of Showtime’s Emmy and Golden Globe winning series. DVD collection includes 33 discs, featuring all 8 seasons’ episodes and the bonus disc.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama, Mystery & Thrillers', 'Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Contributor': 'Dexter, Michael C. Hall', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.97 Pounds', 'Item model number': '27810893', 'Media Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Run time': '84 hours and 51 minutes', 'Release date': 'November 12, 2013', 'Actors': 'Michael C. Hall, Dexter', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: I love the Dexter series.  The Collector box is a littler overdone.  It is difficult to store.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Heat\nSandra Bullock  (Actor),     Melissa McCarthy  (Actor),     Paul Feig  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane CurtinMichael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane Curtin  See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes'}\nI did not like this movie AT ALL.  I attempted to write a review without clicking any stars, but found that was impossible.<br /><br />There was so much contention and foul language, I never figured out what the story line was.  I bought it new right after it came out.  A friend watched with me.  We both felt the same about the movie, that it was a waste of money.  I donated to Goodwill.  Maybe they can make some money on it since it won awards.\nI did not like this movie AT ALL\nThe Net\nSandra Bullock  (Actor),     Ken Howard  (Actor),     Irwin Winkler  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Sandra Bullock, Jeremy Northam and Dennis Miller star in this hit thriller about a computer expert whose life is “erased” by a computer conspiracy.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.5 Ounces', 'Item model number': '2227339', 'Director': 'Irwin Winkler', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 54 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Sandra Bullock, Ken Howard, Diane Baker, Dennis Miller, Jeremy Northam', 'Dubbed': 'French', 'Subtitles': 'Thai, English, Portuguese, French, Spanish, Mandarin Chinese, Korean', 'Producers': 'Irwin Winkler, Rob Cowan', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nTerrific!\nFive Stars\nDexter: The Complete Series Collection\nMichael C. Hall  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', \"Dexter is a crime drama about Dexter Morgan, a man who leads a double life as an incredibly likeable forensics expert for the Miami Police Department and as an emotionless vigilante serial killer. Taught by his foster father to harness his lust for blood and killing, Dexter lives by his own strict moral code - he only kills murderers who can't otherwise be brought to justice. Dexter is a killer who grapples with fitting into society while, at the same time, he struggles with his inability to feel emotion. The irony of Dexter's life is that he works closely as a blood splatter analyst with the very people who hunt his kind - the homicide departments.\", 'Amazon.com', 'Own it all: 8 seasons, exclusive art book and a bonus disc of killer special feature in a collectible slide box inspired by the one Dexter himself uses on the show to catalog his kills. Join your favorite serial killer in all 8 chilling seasons of Showtime’s Emmy and Golden Globe winning series. DVD collection includes 33 discs, featuring all 8 seasons’ episodes and the bonus disc.']\n{'Genre': 'Drama, Mystery & Thrillers', 'Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Contributor': 'Dexter, Michael C. Hall', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.97 Pounds', 'Item model number': '27810893', 'Media Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Run time': '84 hours and 51 minutes', 'Release date': 'November 12, 2013', 'Actors': 'Michael C. Hall, Dexter', 'Studio': 'Paramount', 'Number of discs': '1'}\nI love the Dexter series.  The Collector box is a littler overdone.  It is difficult to store.\nFive Stars",
  "profile": "The user maintains a strong preference for films and series with coherent storytelling, favoring genres that emphasize quality and substance over crude humor or excessive reliance on conflict. Their previous experiences led them to donate unsatisfactory purchases, reinforcing their commitment to only keeping media that aligns with their standards. The user recently expressed appreciation for a gripping crime drama, highlighting their continued interest in thrillers that blend engaging plots with high production values. \n\nTheir consistent feedback on various cinematic experiences indicates a discerning taste, favoring narratives that resonate deeply and provide clarity. This reflects their trend of favoring stories that challenge the norm while exploring complex characters and moral dilemmas. The user highly values personal recommendations and actively shares their opinions to influence future buying decisions. \n\nWith a recent positive interaction related to a critically acclaimed series featuring a well-known actor, the user's profile reinforces their ongoing preference for drama and thrillers that prioritize character development and intricate storytelling, all while reflecting their established disdain for content that relies excessively on humor or conflict. Overall, they seek immersive cinematic experiences that engage the intellect and emotions, ensuring their choices align with their established values in storytelling.",
  "metrics": {
    "rouge1_f": 0.1367713004484305,
    "rouge2_f": 0.0022471910112359553,
    "rougeL_f": 0.06278026905829595,
    "meteor": 0.042377427314665796,
    "bleu1": 0.007168358398749051,
    "bleu2": 0.0015436382485229036,
    "bleu3": 0.00029823928863410577,
    "bleu4": 0.00013124727850335956,
    "bertscore_precision": 0.3137221336364746,
    "bertscore_recall": 0.40024781227111816,
    "bertscore_f1": 0.3517419695854187
  }
}