{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Eureka: The Complete Series (Amazon Exclusive)\nReview Date: 2017/03/18\nStore: Colin Ferguson  (Actor),     Salli Richardson-Whitfield  (Actor)    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Welcome to Eureka, a small, secluded town populated by America’s brightest scientists whose work lead to innovative discoveries and, more often than not, unnatural and hilarious chaos! Join Sheriff Jack Carter (Colin Ferguson) in all five seasons of', 'Eureka', 'as he deals with the towns quirky geniuses, volatile experiments, and earth-shaking secrets. Wacky adventures and mayhem await in the hit Syfy series that bravely explores the space where human dilemmas and super-science collide. Relationship audits, force fields run amok, and floating banks…anything goes in Eureka! This Amazon exclusive bundle includes all 5 seasons in 7 DVD sets:', 'Eureka: Season 1 Eureka: Season 2 Eureka: Season 3.0 Eureka: Season 3.5 Eureka: Season 4.0 Eureka: Season 4.5 Eureka: Season 5', 'Now you can watch all 77 quirky and unpredictable episodes any time, back-to-back and uninterrupted, and enjoy over 30 hours of bonus features, including two holiday specials, a plethora of episode commentaries, fun behind-the-scenes extras, deleted scenes, gag reels, and more! Witty, surprising, and full of intriguing mysteries, this show is a must-own for all Eureka and sci-fi fans!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure, Science Fiction', 'Format': 'NTSC', 'Contributor': 'Colin Ferguson, Erica Cerra, Salli Richardson-Whitfield', 'Language': 'English', 'Number Of Discs': '18', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.2 x 6.3 x 3.8 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '55 hours and 58 minutes', 'Release date': 'July 17, 2012', 'Actors': 'Colin Ferguson, Salli Richardson-Whitfield, Erica Cerra', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '18'}\nReview Text: The best science fiction ever!\nReview Title: Science Fiction Lovers, this is it!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Heat\nSandra Bullock  (Actor),     Melissa McCarthy  (Actor),     Paul Feig  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane CurtinMichael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane Curtin  See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes'}\nI did not like this movie AT ALL.  I attempted to write a review without clicking any stars, but found that was impossible.<br /><br />There was so much contention and foul language, I never figured out what the story line was.  I bought it new right after it came out.  A friend watched with me.  We both felt the same about the movie, that it was a waste of money.  I donated to Goodwill.  Maybe they can make some money on it since it won awards.\nI did not like this movie AT ALL\nThe Net\nSandra Bullock  (Actor),     Ken Howard  (Actor),     Irwin Winkler  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Sandra Bullock, Jeremy Northam and Dennis Miller star in this hit thriller about a computer expert whose life is “erased” by a computer conspiracy.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.5 Ounces', 'Item model number': '2227339', 'Director': 'Irwin Winkler', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 54 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Sandra Bullock, Ken Howard, Diane Baker, Dennis Miller, Jeremy Northam', 'Dubbed': 'French', 'Subtitles': 'Thai, English, Portuguese, French, Spanish, Mandarin Chinese, Korean', 'Producers': 'Irwin Winkler, Rob Cowan', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nTerrific!\nFive Stars\nDexter: The Complete Series Collection\nMichael C. Hall  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', \"Dexter is a crime drama about Dexter Morgan, a man who leads a double life as an incredibly likeable forensics expert for the Miami Police Department and as an emotionless vigilante serial killer. Taught by his foster father to harness his lust for blood and killing, Dexter lives by his own strict moral code - he only kills murderers who can't otherwise be brought to justice. Dexter is a killer who grapples with fitting into society while, at the same time, he struggles with his inability to feel emotion. The irony of Dexter's life is that he works closely as a blood splatter analyst with the very people who hunt his kind - the homicide departments.\", 'Amazon.com', 'Own it all: 8 seasons, exclusive art book and a bonus disc of killer special feature in a collectible slide box inspired by the one Dexter himself uses on the show to catalog his kills. Join your favorite serial killer in all 8 chilling seasons of Showtime’s Emmy and Golden Globe winning series. DVD collection includes 33 discs, featuring all 8 seasons’ episodes and the bonus disc.']\n{'Genre': 'Drama, Mystery & Thrillers', 'Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Contributor': 'Dexter, Michael C. Hall', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.97 Pounds', 'Item model number': '27810893', 'Media Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Run time': '84 hours and 51 minutes', 'Release date': 'November 12, 2013', 'Actors': 'Michael C. Hall, Dexter', 'Studio': 'Paramount', 'Number of discs': '1'}\nI love the Dexter series.  The Collector box is a littler overdone.  It is difficult to store.\nFive Stars\nEureka: The Complete Series (Amazon Exclusive)\nColin Ferguson  (Actor),     Salli Richardson-Whitfield  (Actor)    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Welcome to Eureka, a small, secluded town populated by America’s brightest scientists whose work lead to innovative discoveries and, more often than not, unnatural and hilarious chaos! Join Sheriff Jack Carter (Colin Ferguson) in all five seasons of', 'Eureka', 'as he deals with the towns quirky geniuses, volatile experiments, and earth-shaking secrets. Wacky adventures and mayhem await in the hit Syfy series that bravely explores the space where human dilemmas and super-science collide. Relationship audits, force fields run amok, and floating banks…anything goes in Eureka! This Amazon exclusive bundle includes all 5 seasons in 7 DVD sets:', 'Eureka: Season 1 Eureka: Season 2 Eureka: Season 3.0 Eureka: Season 3.5 Eureka: Season 4.0 Eureka: Season 4.5 Eureka: Season 5', 'Now you can watch all 77 quirky and unpredictable episodes any time, back-to-back and uninterrupted, and enjoy over 30 hours of bonus features, including two holiday specials, a plethora of episode commentaries, fun behind-the-scenes extras, deleted scenes, gag reels, and more! Witty, surprising, and full of intriguing mysteries, this show is a must-own for all Eureka and sci-fi fans!']\n{'Genre': 'Action & Adventure, Science Fiction', 'Format': 'NTSC', 'Contributor': 'Colin Ferguson, Erica Cerra, Salli Richardson-Whitfield', 'Language': 'English', 'Number Of Discs': '18', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.2 x 6.3 x 3.8 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '55 hours and 58 minutes', 'Release date': 'July 17, 2012', 'Actors': 'Colin Ferguson, Salli Richardson-Whitfield, Erica Cerra', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '18'}\nThe best science fiction ever!\nScience Fiction Lovers, this is it!",
  "profile": "The user continues to maintain a strong preference for films and series with coherent storytelling, focusing on quality and substance rather than humor or conflict. Their recent purchase of a critically acclaimed series showcases an appreciation for immersive narratives that blend engaging plots with high production values. Despite expressing a deep disdain for content that relies heavily on humor, this interaction reveals an openness to the sci-fi genre, particularly when it combines elements of action, adventure, and human dilemmas within a thought-provoking framework.\n\nTheir discerning taste clearly favors stories that explore complex characters and moral dilemmas, reinforcing their established pattern of seeking narratives that challenge norms. The user’s review of the series reflects an enthusiasm for content that captivates their intellect and emotions, aligning with their values in storytelling. They continue to highly value personal recommendations and actively share their opinions to influence buying decisions, showcasing a commitment to curating a collection that meets their high standards. Overall, the user's profile is characterized by a desire for engaging, character-driven dramas and thrillers, now inclusive of thoughtful sci-fi offerings that provide clarity and resonance with their established preferences.",
  "metrics": {
    "rouge1_f": 0.12605042016806725,
    "rouge2_f": 0.010101010101010102,
    "rougeL_f": 0.06722689075630252,
    "meteor": 0.03837883079168019,
    "bleu1": 0.0011258209555566072,
    "bleu2": 0.0003071488818738756,
    "bleu3": 5.096743375102537e-05,
    "bleu4": 2.078705767883958e-05,
    "bertscore_precision": 0.3132244944572449,
    "bertscore_recall": 0.42267942428588867,
    "bertscore_f1": 0.35981205105781555
  }
}