{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: In Plain Sight: Season 4\nReview Date: 2022/05/19\nStore: Mary McCormack  (Actor),     Frederick Weller  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', \"Mary McCormack stars as tough, smart and sexy U.S. Marshal Mary Shannon who works for the Witness Protection Program (WITSEC). Putting her life on the line as she relocates and protects both innocent people and ruthless criminals, Mary struggles to find a balance between work and her personal life. Riveting and refreshingly unique, In Plain Sight also stars Frederick Weller, Paul Ben-Victor and Nichole Hiltz, and features phenomenal guest stars including Bradley Whitford (The West Wing), Joshua Malina (The West Wing) and Lesley Ann Warren (Desperate Housewives). Experience the excitement in this three-disc set containing all 13 episodes of the critically acclaimed series' fourth season. Hiding in plain sight was never so much fun.\", 'Bonus Content:', 'Disc 2 - In Plain Sight Season Four:', 'Gag Reel', 'Gag Reel', 'Deleted and Extended Scenes', 'Deleted and Extended Scenes', ']]>', 'Amazon.com', 'The fourth and final full-length season of the quirky action-drama series', 'In Plain Sight', \"continues the show's impressive balance of crime-driven stories with offbeat and engaging character arcs, including one very substantial development for its lead character, US Marshal Mary Shannon (Mary McCormack). The actress's real-life pregnancy was folded into the series through Shannon's ill-timed one-night-stand with her ex-husband (Bryan Callen), resulting in a flurry of serious, emotionally weighty decisions for the character. The pregnancy storyline anchors both the season and the character, lending gravitas to some of the flightier elements, including Shannon's sister Brandi (Nichole Hiltz), whose on-again, off-again relationship with fiancé Peter Alpert (Joshua Malina) tipped the show's tone towards broad comedy, as did partner Marshall Mann's relationship with Detective Abigail Chaffee (Rachel Boston). As a result, Shannon remains the show's anchor and most compelling figure, walking a series of high-wire scenarios, including her highly dysfunctional family, her dangerous job, and her own feelings on relationships and now motherhood, with a combination of grace, stubbornness and charming confusion. It's a tricky mix of motivations, but McCormack continues to shoulder them well while handling the show's action requirements with believable toughness.\", 'In Plain Sight', 'fans will undoubtedly miss Mary Shannon, whose adventures come to an end in the abbreviated fifth season, though the fourth go-round provides plenty of reminders as to why they fell in love with her to begin with. The three-disc set includes a modest collection of deleted and extended scenes, as well as the de rigueur gag reel.', '--Paul Gaita']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Paul Ben-Victor, Frederick Weller, Nichole Hiltz, Mary McCormack', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '25195009', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Run time': '9 hours and 15 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Mary McCormack, Frederick Weller, Paul Ben-Victor, Nichole Hiltz', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I enjoyed watching the programs\nReview Title: The disc was in good condition\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Heat\nSandra Bullock  (Actor),     Melissa McCarthy  (Actor),     Paul Feig  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane CurtinMichael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane Curtin  See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes'}\nI did not like this movie AT ALL.  I attempted to write a review without clicking any stars, but found that was impossible.<br /><br />There was so much contention and foul language, I never figured out what the story line was.  I bought it new right after it came out.  A friend watched with me.  We both felt the same about the movie, that it was a waste of money.  I donated to Goodwill.  Maybe they can make some money on it since it won awards.\nI did not like this movie AT ALL\nThe Net\nSandra Bullock  (Actor),     Ken Howard  (Actor),     Irwin Winkler  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Sandra Bullock, Jeremy Northam and Dennis Miller star in this hit thriller about a computer expert whose life is “erased” by a computer conspiracy.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.5 Ounces', 'Item model number': '2227339', 'Director': 'Irwin Winkler', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 54 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Sandra Bullock, Ken Howard, Diane Baker, Dennis Miller, Jeremy Northam', 'Dubbed': 'French', 'Subtitles': 'Thai, English, Portuguese, French, Spanish, Mandarin Chinese, Korean', 'Producers': 'Irwin Winkler, Rob Cowan', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nTerrific!\nFive Stars\nDexter: The Complete Series Collection\nMichael C. Hall  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', \"Dexter is a crime drama about Dexter Morgan, a man who leads a double life as an incredibly likeable forensics expert for the Miami Police Department and as an emotionless vigilante serial killer. Taught by his foster father to harness his lust for blood and killing, Dexter lives by his own strict moral code - he only kills murderers who can't otherwise be brought to justice. Dexter is a killer who grapples with fitting into society while, at the same time, he struggles with his inability to feel emotion. The irony of Dexter's life is that he works closely as a blood splatter analyst with the very people who hunt his kind - the homicide departments.\", 'Amazon.com', 'Own it all: 8 seasons, exclusive art book and a bonus disc of killer special feature in a collectible slide box inspired by the one Dexter himself uses on the show to catalog his kills. Join your favorite serial killer in all 8 chilling seasons of Showtime’s Emmy and Golden Globe winning series. DVD collection includes 33 discs, featuring all 8 seasons’ episodes and the bonus disc.']\n{'Genre': 'Drama, Mystery & Thrillers', 'Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Contributor': 'Dexter, Michael C. Hall', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.97 Pounds', 'Item model number': '27810893', 'Media Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Run time': '84 hours and 51 minutes', 'Release date': 'November 12, 2013', 'Actors': 'Michael C. Hall, Dexter', 'Studio': 'Paramount', 'Number of discs': '1'}\nI love the Dexter series.  The Collector box is a littler overdone.  It is difficult to store.\nFive Stars\nEureka: The Complete Series (Amazon Exclusive)\nColin Ferguson  (Actor),     Salli Richardson-Whitfield  (Actor)    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Welcome to Eureka, a small, secluded town populated by America’s brightest scientists whose work lead to innovative discoveries and, more often than not, unnatural and hilarious chaos! Join Sheriff Jack Carter (Colin Ferguson) in all five seasons of', 'Eureka', 'as he deals with the towns quirky geniuses, volatile experiments, and earth-shaking secrets. Wacky adventures and mayhem await in the hit Syfy series that bravely explores the space where human dilemmas and super-science collide. Relationship audits, force fields run amok, and floating banks…anything goes in Eureka! This Amazon exclusive bundle includes all 5 seasons in 7 DVD sets:', 'Eureka: Season 1 Eureka: Season 2 Eureka: Season 3.0 Eureka: Season 3.5 Eureka: Season 4.0 Eureka: Season 4.5 Eureka: Season 5', 'Now you can watch all 77 quirky and unpredictable episodes any time, back-to-back and uninterrupted, and enjoy over 30 hours of bonus features, including two holiday specials, a plethora of episode commentaries, fun behind-the-scenes extras, deleted scenes, gag reels, and more! Witty, surprising, and full of intriguing mysteries, this show is a must-own for all Eureka and sci-fi fans!']\n{'Genre': 'Action & Adventure, Science Fiction', 'Format': 'NTSC', 'Contributor': 'Colin Ferguson, Erica Cerra, Salli Richardson-Whitfield', 'Language': 'English', 'Number Of Discs': '18', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.2 x 6.3 x 3.8 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '55 hours and 58 minutes', 'Release date': 'July 17, 2012', 'Actors': 'Colin Ferguson, Salli Richardson-Whitfield, Erica Cerra', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '18'}\nThe best science fiction ever!\nScience Fiction Lovers, this is it!\nIn Plain Sight: Season 1\nMary McCormack  (Actor),     Frederick Weller  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', 'Since 1970, the Federal Witness Protection Program has relocated thousands of witnesses - some criminal, some not – to neighborhoods all across the country. Every one of those individuals shares a unique attribute, distinguishing them from the rest of the general population. And that is, somebody wants them dead.Get lost with Mary McCormack as the compelling and quirky hit USA series In Plain Sight comes to DVD! U.S. Marshal Mary Shannon (McCormack) works for the Federal Witness Protection Program (WITSEC) relocating and protecting career criminals, compulsive liars, thieves, murderers, and the occasional innocent bystander. With the help of her partner Marshall Mann (yes, Marshal Marshall) and her beat-up but beloved car, she just may get through her workday in time to deal with her sort-of boyfriend, her flaky sister, and her ne\\'er-do-well mother. Featuring an impressive cast, including Fred Weller, Nichole Hiltz, Todd Williams, and Lesley Ann Warren, In Plain Sight is the funny, suspenseful drama that critics are calling \"hugely entertaining!\" (Hal Boedeker, Orlando Sentinel).', 'Bonus Content:', 'Disc 1 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 2 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 3 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', ']]>', 'Amazon.com', 'An amusing blend of cop show action and dysfunctional family fireworks, the comedy-drama', 'In Plain Sight', 'benefits greatly from the charisma of its lead, Mary McCormack, as well as some promising episodes in this first-season set. TV and film vet McCormack (', 'The West Wing', ',', 'Murder One', \") finally gets a lead as Mary Shannon, a U.S. Marshal working in the Albuquerque office of the Witness Protection Program. The array of offbeat characters that fall under Mary’s jurisdiction--everyone from innocent witnesses of terrible crimes to less scrupulous types like Dave Foley’s obnoxious mob squealer (“Trojan Horst”) to a diamond smuggler (Missi Pyle) with wedding fever (“Never the Bride”)--present less problems for her than her family, which includes her overly dramatic mom (Lesley Ann Warren) and troublemaking sister (Nichole Hiltz), who has designs on Mary's on-again-off-again boyfriend (Cristian de la Fuente). Frederick Weller (as her quirky partner) and Paul Ben-Victor as her boss offer solid support, but\", 'In Plain Sight', 'is McCormack’s showcase, and she shines in both the comic moments and more serious elements, most notably a confessional monologue in “High Priced Spread.” One wishes the scripts lived up to the performances--too often, the program coasts on glib dialogue, or worse, heavy-handed voice-overs--but these are fixable problems in the face of considerable potential. All 12 episodes of the first season are included in the three-disc set, as well as brief deleted scenes from each episode.', '--Paul Gaita']\n{'Genre': 'Drama, Suspense', 'Format': 'AC-3, Box set, Color, Multiple Formats, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': 'Paul Ben-Victor, Frederick Weller, Mary McCormack, Lesley Ann Warren', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5070309', 'Media Format': 'AC-3, Box set, Color, Multiple Formats, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '9 hours and 12 minutes', 'Release date': 'April 25, 2010', 'Actors': 'Mary McCormack, Frederick Weller, Lesley Ann Warren, Paul Ben-Victor', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI thoroughly enjoyed watching the program\nAll disks were in good shape\nIn Plain Sight: Season 5\nMary McCormack  (Actor),     Frederick Weller  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', \"Mary McCormack returns as tough and sexy U.S. Marshal Mary Shannon in the fifth and final season of this critically acclaimed hit series. Back from maternity leave, Mary rejoins her job at the Witness Protection Program (WITSEC) and must quickly find a way to balance motherhood and her job protecting both innocent people and cold-blooded killers on a daily basis. If that didn't complicate things enough, her fugitive father suddenly returns, her ex-fiancé pops back into her life and her longtime partner, Marshall, is getting engaged! Guest starring Tia Carrere (True Lies), Lesley Ann Warren (Desperate Housewives), Aaron Ashmore (Smallville), Stephen Lang (Avatar), Julia Jones (Twilight), Madchen Amick (Twin Peaks), Josh Hopkins (Cougar Town), Eric Lynch (Howard Stern on Demand) and Bryan Callen (The Hangover), watch the final episodes of the unique and riveting series that made hiding In Plain Sight so much fun.\", ']]>', 'Amazon.com', 'The action-drama', 'In Plain Sight', \"ends its five-season run with an eight-episode arc that brings together its array of storylines in a manner befitting its main character, Deputy Marshal Mary Shannon (Mary McCormack): equal parts tough and tender, with a decidedly quirky sense of humor, and a soft spot for the family unit, no matter how diverse (or dysfunctional). Mary's family essentially takes top priority throughout the final season, with the arrival of her wayward, bank-robbing father (Stephen Lang) sending the entire Shannon clan into protective custody and forcing Mary to choose between her profession and her chaotic but loving extended relations. Frederick Weller's Marshall Mann also has some choices to make, specifically in regard to his allegiance to Mary and impending marriage to Rachel Boston's Detective Abigail Chaffee. With so many interpersonal issues at stake, the witness-protection cases seem secondary, and indeed, the subjects here, including a drag queen and a hoarder, lack the grit or vulnerability seen in previous seasons. But true to fashion,\", 'In Plain Sight', 'wraps up with a satisfying finale for both Mary and (most likely) the viewer. Though it was never a headline-grabber like some major network shows,', 'In Plain Sight', \"'s eclectic tone and smart dialogue earned the admiration of its loyal fan base, which will undoubtedly increase via the DVD releases. The two-disc season-five set includes no extras.\", '--Paul Gaita']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Ben-Victor, Frederick Weller, Nichole Hiltz, Mary McCormack', 'Initial release date': '2018-10-09', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 43 minutes', 'Release date': 'October 9, 2018', 'Actors': 'Mary McCormack, Frederick Weller, Paul Ben-Victor, Nichole Hiltz', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nIt was impossible to understand what was happening and what was being said for part of the program.  I was disappointed because I really enjoyed the series, but had a hard time understanding the ending because of this one bad disc.\nThe disk was in bad condition and didn’t play well\nIn Plain Sight: Season 3 [DVD]\nMary McCormack  (Actor),     Fred Weller  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Mary Shannon (Mark McCormack), a US Marshal in the witness protection program, spends her time relocating federal witnesses. Based in Albuquerque, New Mexico, Mary works with her partner, Marshall Mann (Frederick Weller), to place criminals and innocent witnesses into new lives. When not putting her life on the line to protect federal witnesses, Mary attempts to manage her dysfunctional family, including overly dependent mother, Jinx, and younger sister, Brandi, both of whom live with her.']\n{'Genre': 'Drama, Suspense', 'Format': 'AC-3, Dolby, DVD, NTSC, Subtitled, Widescreen', 'Contributor': 'Fred Weller, Paul Ben-Victor, Mary McCormack', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '61115397', 'Media Format': 'AC-3, Dolby, DVD, NTSC, Subtitled, Widescreen', 'Run time': '9 hours and 16 minutes', 'Release date': 'March 29, 2011', 'Actors': 'Mary McCormack, Fred Weller, Paul Ben-Victor', 'Subtitles': 'English', 'Studio': 'Universal Studios', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI enjoyed watching the programs\nThe disc was in good condition\nIn Plain Sight: Season 2\nMary McCormack  (Actor),     Frederick Weller  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', \"For Mary, living a double life is all in day’s work. Mary McCormack (The West Wing) returns as Mary Shannon, a U.S. Marshal with the highly secretive Federal Witness Protection Program (WITSEC), in Season Two of the suspenseful and quirky hit series In Plain Sight. For Mary, living a double life and getting shot at on a regular basis are all in day’s work. So are teaming up with her trusted partner, Marshall Mann (Frederick Weller), to protect Federal Witnesses who relocate to Albuquerque and juggling a complicated personal life. Gripping and refreshing, In Plain Sight co-stars Lesley Ann Warren (Desperate Housewives), Paul Ben-Victor (The Wire) and Nichole Hiltz (Bones), and features phenomenal guest stars that include Will McCormack (Brothers and Sisters), Martin Landau (Entourage), Laura Prepon (That '70s Show), Joshua Malina (The West Wing), Richard Schiff (The West Wing) and David Denman (The Office). Get lost In Plain Sight!\", 'Amazon.com', 'After closing its debut season on a harrowing note, the crime drama', 'In Plain Sight', \"returns for a sophomore season filled with the same clever scripting and sharp performances built around its unique blend of action and dysfunctional family dynamics. Mary McCormack is again the short-fused, acid-tongued glue that holds the program and its cast of eccentrics together; having recovered physically, if not entirely in an emotional sense, from the kidnapping that ended the show's first season, her Mary Shannon, U.S. Marshal with the Federal Witness Security Program, returns to the double rigors of her job and her contentious family. Neither side gives her much time to breathe in season 2; Mary's cases with loyal partner Marshall (Fred Weller) include a persistent rabbi (Richard Schiff, McCormack's former\", 'West Wing', 'costar), a witness (David Denman of', 'The Office', \") who refuses to testify until his missing son is found, an elderly mobster (Martin Landau) who wants to attend his son's funeral, and a pot salesman who cannot appear in court without copious amounts of his own product. Meanwhile, an FBI agent (Will McCormack, Mary's real-life brother) is hell-bent on bringing down her wayward sister Brandi (Nichole Hiltz) for drug trafficking and murder--Brandi was the original target of the men who kidnapped Mary and killed two federal agents in the first-season closer. Add to the mix Mary's mom (the terrific Lesley Ann Warren), who's struggling with recovery from drinking, plus relationship troubles with boyfriend Raph (Cristián de la Fuente) and new office manager Eleanor (Holly Maples, wife of series creator David Maples), who clashes with Mary at every turn, and the result is another collection of smartly written and frequently exciting episodes that, in many ways, surpasses the best of the first season, even in its closing cliffhanger. Said wrap-out was one of many controversies that swirled around the show in season 2; clashes with the network over the handling of the finale led to Maples and co-executive producer Paul Stupin--the show's guiding forces--leaving the program, which was then re-tooled to focus more on Mary's work and less on her family. It's an unfortunate decision that robs the show of much of its color, so fans should appreciate what they can of that combination here.\", 'DVD extras on the three-disc set include commentary tracks for three episodes; Maples and Stupin are featured on \"In My Humboldt Opinion,\" where they recap in detail their history of working on the show, as well as their appreciation for the cast. McCormack and Weller handle two episodes--\"A Frond in Need\" and \"Who\\'s Bugging Mary\"--with a lighter touch that focuses on their performances. Deleted scenes for eight episodes are actually moments that could have fit well into their respective shows, rather than the extraneous material that usually ends up on the editing room floor, while the gag reel combines the usual flubs with some moments of genuine humor.', '--Paul Gaita']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Ben-Victor, Frederick Weller, Mary McCormack', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '10 hours and 40 minutes', 'Release date': 'March 9, 2010', 'Actors': 'Mary McCormack, Frederick Weller, Paul Ben-Victor', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI enjoyed watching the programs\nThe disc was in good condition\nIn Plain Sight: Season 4\nMary McCormack  (Actor),     Frederick Weller  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', \"Mary McCormack stars as tough, smart and sexy U.S. Marshal Mary Shannon who works for the Witness Protection Program (WITSEC). Putting her life on the line as she relocates and protects both innocent people and ruthless criminals, Mary struggles to find a balance between work and her personal life. Riveting and refreshingly unique, In Plain Sight also stars Frederick Weller, Paul Ben-Victor and Nichole Hiltz, and features phenomenal guest stars including Bradley Whitford (The West Wing), Joshua Malina (The West Wing) and Lesley Ann Warren (Desperate Housewives). Experience the excitement in this three-disc set containing all 13 episodes of the critically acclaimed series' fourth season. Hiding in plain sight was never so much fun.\", 'Bonus Content:', 'Disc 2 - In Plain Sight Season Four:', 'Gag Reel', 'Gag Reel', 'Deleted and Extended Scenes', 'Deleted and Extended Scenes', ']]>', 'Amazon.com', 'The fourth and final full-length season of the quirky action-drama series', 'In Plain Sight', \"continues the show's impressive balance of crime-driven stories with offbeat and engaging character arcs, including one very substantial development for its lead character, US Marshal Mary Shannon (Mary McCormack). The actress's real-life pregnancy was folded into the series through Shannon's ill-timed one-night-stand with her ex-husband (Bryan Callen), resulting in a flurry of serious, emotionally weighty decisions for the character. The pregnancy storyline anchors both the season and the character, lending gravitas to some of the flightier elements, including Shannon's sister Brandi (Nichole Hiltz), whose on-again, off-again relationship with fiancé Peter Alpert (Joshua Malina) tipped the show's tone towards broad comedy, as did partner Marshall Mann's relationship with Detective Abigail Chaffee (Rachel Boston). As a result, Shannon remains the show's anchor and most compelling figure, walking a series of high-wire scenarios, including her highly dysfunctional family, her dangerous job, and her own feelings on relationships and now motherhood, with a combination of grace, stubbornness and charming confusion. It's a tricky mix of motivations, but McCormack continues to shoulder them well while handling the show's action requirements with believable toughness.\", 'In Plain Sight', 'fans will undoubtedly miss Mary Shannon, whose adventures come to an end in the abbreviated fifth season, though the fourth go-round provides plenty of reminders as to why they fell in love with her to begin with. The three-disc set includes a modest collection of deleted and extended scenes, as well as the de rigueur gag reel.', '--Paul Gaita']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Paul Ben-Victor, Frederick Weller, Nichole Hiltz, Mary McCormack', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '25195009', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Run time': '9 hours and 15 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Mary McCormack, Frederick Weller, Paul Ben-Victor, Nichole Hiltz', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI enjoyed watching the programs\nThe disc was in good condition",
  "profile": "The user maintains a strong preference for films and series that emphasize coherent storytelling, complex characters, and emotionally engaging narratives. Their recent exploration of series that intertwine suspense with familial dynamics reflects this established taste, particularly in narratives that delve deeply into interpersonal relationships under pressure. \n\nTheir latest interaction involves a series focused on witness protection, showing an ongoing interest in character-driven content that addresses themes of personal struggle within high-stakes environments. Interestingly, the user is evolving to embrace narratives that balance drama with subtle humor, a departure from their prior aversion to overly comedic content. They now value stories that present ethical dilemmas and challenge societal norms, demonstrating a growing appreciation for diverse narrative tones.\n\nAs an active participant in sharing insightful reviews, the user is committed to curating a high-quality collection of character-centric content. Their increasing awareness of the technical aspects of film and television underscores their dedication to clarity and continuity in storytelling. Overall, the user remains focused on high-quality narratives that engage both emotionally and intellectually while embracing a nuanced blend of drama and light-heartedness, enhancing their viewing experience.",
  "metrics": {
    "rouge1_f": 0.057157309054122404,
    "rouge2_f": 0.006578947368421052,
    "rougeL_f": 0.03136064744562468,
    "meteor": 0.015550056133787408,
    "bleu1": 1.0230167342614894e-11,
    "bleu2": 4.146422569647208e-12,
    "bleu3": 5.548554204119048e-13,
    "bleu4": 2.032263144472236e-13,
    "bertscore_precision": 0.32028838992118835,
    "bertscore_recall": 0.5043482184410095,
    "bertscore_f1": 0.3917771279811859
  }
}