{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: In Plain Sight: Season 1\nReview Date: 2022/05/19\nStore: Mary McCormack  (Actor),     Frederick Weller  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: ['Product Description', 'Since 1970, the Federal Witness Protection Program has relocated thousands of witnesses - some criminal, some not – to neighborhoods all across the country. Every one of those individuals shares a unique attribute, distinguishing them from the rest of the general population. And that is, somebody wants them dead.Get lost with Mary McCormack as the compelling and quirky hit USA series In Plain Sight comes to DVD! U.S. Marshal Mary Shannon (McCormack) works for the Federal Witness Protection Program (WITSEC) relocating and protecting career criminals, compulsive liars, thieves, murderers, and the occasional innocent bystander. With the help of her partner Marshall Mann (yes, Marshal Marshall) and her beat-up but beloved car, she just may get through her workday in time to deal with her sort-of boyfriend, her flaky sister, and her ne\\'er-do-well mother. Featuring an impressive cast, including Fred Weller, Nichole Hiltz, Todd Williams, and Lesley Ann Warren, In Plain Sight is the funny, suspenseful drama that critics are calling \"hugely entertaining!\" (Hal Boedeker, Orlando Sentinel).', 'Bonus Content:', 'Disc 1 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 2 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 3 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', ']]>', 'Amazon.com', 'An amusing blend of cop show action and dysfunctional family fireworks, the comedy-drama', 'In Plain Sight', 'benefits greatly from the charisma of its lead, Mary McCormack, as well as some promising episodes in this first-season set. TV and film vet McCormack (', 'The West Wing', ',', 'Murder One', \") finally gets a lead as Mary Shannon, a U.S. Marshal working in the Albuquerque office of the Witness Protection Program. The array of offbeat characters that fall under Mary’s jurisdiction--everyone from innocent witnesses of terrible crimes to less scrupulous types like Dave Foley’s obnoxious mob squealer (“Trojan Horst”) to a diamond smuggler (Missi Pyle) with wedding fever (“Never the Bride”)--present less problems for her than her family, which includes her overly dramatic mom (Lesley Ann Warren) and troublemaking sister (Nichole Hiltz), who has designs on Mary's on-again-off-again boyfriend (Cristian de la Fuente). Frederick Weller (as her quirky partner) and Paul Ben-Victor as her boss offer solid support, but\", 'In Plain Sight', 'is McCormack’s showcase, and she shines in both the comic moments and more serious elements, most notably a confessional monologue in “High Priced Spread.” One wishes the scripts lived up to the performances--too often, the program coasts on glib dialogue, or worse, heavy-handed voice-overs--but these are fixable problems in the face of considerable potential. All 12 episodes of the first season are included in the three-disc set, as well as brief deleted scenes from each episode.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Suspense', 'Format': 'AC-3, Box set, Color, Multiple Formats, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': 'Paul Ben-Victor, Frederick Weller, Mary McCormack, Lesley Ann Warren', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5070309', 'Media Format': 'AC-3, Box set, Color, Multiple Formats, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '9 hours and 12 minutes', 'Release date': 'April 25, 2010', 'Actors': 'Mary McCormack, Frederick Weller, Lesley Ann Warren, Paul Ben-Victor', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I thoroughly enjoyed watching the program\nReview Title: All disks were in good shape\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Heat\nSandra Bullock  (Actor),     Melissa McCarthy  (Actor),     Paul Feig  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane CurtinMichael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane Curtin  See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes'}\nI did not like this movie AT ALL.  I attempted to write a review without clicking any stars, but found that was impossible.<br /><br />There was so much contention and foul language, I never figured out what the story line was.  I bought it new right after it came out.  A friend watched with me.  We both felt the same about the movie, that it was a waste of money.  I donated to Goodwill.  Maybe they can make some money on it since it won awards.\nI did not like this movie AT ALL\nThe Net\nSandra Bullock  (Actor),     Ken Howard  (Actor),     Irwin Winkler  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Sandra Bullock, Jeremy Northam and Dennis Miller star in this hit thriller about a computer expert whose life is “erased” by a computer conspiracy.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.5 Ounces', 'Item model number': '2227339', 'Director': 'Irwin Winkler', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 54 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Sandra Bullock, Ken Howard, Diane Baker, Dennis Miller, Jeremy Northam', 'Dubbed': 'French', 'Subtitles': 'Thai, English, Portuguese, French, Spanish, Mandarin Chinese, Korean', 'Producers': 'Irwin Winkler, Rob Cowan', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nTerrific!\nFive Stars\nDexter: The Complete Series Collection\nMichael C. Hall  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', \"Dexter is a crime drama about Dexter Morgan, a man who leads a double life as an incredibly likeable forensics expert for the Miami Police Department and as an emotionless vigilante serial killer. Taught by his foster father to harness his lust for blood and killing, Dexter lives by his own strict moral code - he only kills murderers who can't otherwise be brought to justice. Dexter is a killer who grapples with fitting into society while, at the same time, he struggles with his inability to feel emotion. The irony of Dexter's life is that he works closely as a blood splatter analyst with the very people who hunt his kind - the homicide departments.\", 'Amazon.com', 'Own it all: 8 seasons, exclusive art book and a bonus disc of killer special feature in a collectible slide box inspired by the one Dexter himself uses on the show to catalog his kills. Join your favorite serial killer in all 8 chilling seasons of Showtime’s Emmy and Golden Globe winning series. DVD collection includes 33 discs, featuring all 8 seasons’ episodes and the bonus disc.']\n{'Genre': 'Drama, Mystery & Thrillers', 'Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Contributor': 'Dexter, Michael C. Hall', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.97 Pounds', 'Item model number': '27810893', 'Media Format': \"Multiple Formats, Box set, Collector's Edition, Color, Dolby, NTSC, Special Edition, Widescreen\", 'Run time': '84 hours and 51 minutes', 'Release date': 'November 12, 2013', 'Actors': 'Michael C. Hall, Dexter', 'Studio': 'Paramount', 'Number of discs': '1'}\nI love the Dexter series.  The Collector box is a littler overdone.  It is difficult to store.\nFive Stars\nEureka: The Complete Series (Amazon Exclusive)\nColin Ferguson  (Actor),     Salli Richardson-Whitfield  (Actor)    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Welcome to Eureka, a small, secluded town populated by America’s brightest scientists whose work lead to innovative discoveries and, more often than not, unnatural and hilarious chaos! Join Sheriff Jack Carter (Colin Ferguson) in all five seasons of', 'Eureka', 'as he deals with the towns quirky geniuses, volatile experiments, and earth-shaking secrets. Wacky adventures and mayhem await in the hit Syfy series that bravely explores the space where human dilemmas and super-science collide. Relationship audits, force fields run amok, and floating banks…anything goes in Eureka! This Amazon exclusive bundle includes all 5 seasons in 7 DVD sets:', 'Eureka: Season 1 Eureka: Season 2 Eureka: Season 3.0 Eureka: Season 3.5 Eureka: Season 4.0 Eureka: Season 4.5 Eureka: Season 5', 'Now you can watch all 77 quirky and unpredictable episodes any time, back-to-back and uninterrupted, and enjoy over 30 hours of bonus features, including two holiday specials, a plethora of episode commentaries, fun behind-the-scenes extras, deleted scenes, gag reels, and more! Witty, surprising, and full of intriguing mysteries, this show is a must-own for all Eureka and sci-fi fans!']\n{'Genre': 'Action & Adventure, Science Fiction', 'Format': 'NTSC', 'Contributor': 'Colin Ferguson, Erica Cerra, Salli Richardson-Whitfield', 'Language': 'English', 'Number Of Discs': '18', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.2 x 6.3 x 3.8 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '55 hours and 58 minutes', 'Release date': 'July 17, 2012', 'Actors': 'Colin Ferguson, Salli Richardson-Whitfield, Erica Cerra', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '18'}\nThe best science fiction ever!\nScience Fiction Lovers, this is it!\nIn Plain Sight: Season 1\nMary McCormack  (Actor),     Frederick Weller  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', 'Since 1970, the Federal Witness Protection Program has relocated thousands of witnesses - some criminal, some not – to neighborhoods all across the country. Every one of those individuals shares a unique attribute, distinguishing them from the rest of the general population. And that is, somebody wants them dead.Get lost with Mary McCormack as the compelling and quirky hit USA series In Plain Sight comes to DVD! U.S. Marshal Mary Shannon (McCormack) works for the Federal Witness Protection Program (WITSEC) relocating and protecting career criminals, compulsive liars, thieves, murderers, and the occasional innocent bystander. With the help of her partner Marshall Mann (yes, Marshal Marshall) and her beat-up but beloved car, she just may get through her workday in time to deal with her sort-of boyfriend, her flaky sister, and her ne\\'er-do-well mother. Featuring an impressive cast, including Fred Weller, Nichole Hiltz, Todd Williams, and Lesley Ann Warren, In Plain Sight is the funny, suspenseful drama that critics are calling \"hugely entertaining!\" (Hal Boedeker, Orlando Sentinel).', 'Bonus Content:', 'Disc 1 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 2 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 3 - In Plain Sight Season One:', 'Deleted Scenes', 'Deleted Scenes', ']]>', 'Amazon.com', 'An amusing blend of cop show action and dysfunctional family fireworks, the comedy-drama', 'In Plain Sight', 'benefits greatly from the charisma of its lead, Mary McCormack, as well as some promising episodes in this first-season set. TV and film vet McCormack (', 'The West Wing', ',', 'Murder One', \") finally gets a lead as Mary Shannon, a U.S. Marshal working in the Albuquerque office of the Witness Protection Program. The array of offbeat characters that fall under Mary’s jurisdiction--everyone from innocent witnesses of terrible crimes to less scrupulous types like Dave Foley’s obnoxious mob squealer (“Trojan Horst”) to a diamond smuggler (Missi Pyle) with wedding fever (“Never the Bride”)--present less problems for her than her family, which includes her overly dramatic mom (Lesley Ann Warren) and troublemaking sister (Nichole Hiltz), who has designs on Mary's on-again-off-again boyfriend (Cristian de la Fuente). Frederick Weller (as her quirky partner) and Paul Ben-Victor as her boss offer solid support, but\", 'In Plain Sight', 'is McCormack’s showcase, and she shines in both the comic moments and more serious elements, most notably a confessional monologue in “High Priced Spread.” One wishes the scripts lived up to the performances--too often, the program coasts on glib dialogue, or worse, heavy-handed voice-overs--but these are fixable problems in the face of considerable potential. All 12 episodes of the first season are included in the three-disc set, as well as brief deleted scenes from each episode.', '--Paul Gaita']\n{'Genre': 'Drama, Suspense', 'Format': 'AC-3, Box set, Color, Multiple Formats, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': 'Paul Ben-Victor, Frederick Weller, Mary McCormack, Lesley Ann Warren', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5070309', 'Media Format': 'AC-3, Box set, Color, Multiple Formats, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '9 hours and 12 minutes', 'Release date': 'April 25, 2010', 'Actors': 'Mary McCormack, Frederick Weller, Lesley Ann Warren, Paul Ben-Victor', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI thoroughly enjoyed watching the program\nAll disks were in good shape",
  "profile": "The user exhibits a strong preference for films and series characterized by coherent storytelling and substance, favoring quality narratives over humor or conflict. Their recent interest in a series blending suspenseful drama with familial dynamics demonstrates an appreciation for immersive narratives that engage both intellect and emotions. While they have previously expressed disdain for content relying heavily on humor, this interaction reveals an openness to drama series that incorporate comedic elements within a compelling framework.\n\nThe user's tastes favor complex characters and moral dilemmas, reinforcing their established pattern of seeking thought-provoking stories that challenge societal norms. They actively share their opinions and provide insightful reviews, reflecting a commitment to curating a high-standard collection of engaging, character-driven content. Notably, they continue to value personal recommendations as they navigate various genres, including drama and suspense, while now also appreciating narratives with slight comedic undertones. \n\nOverall, the user remains characterized by a desire for high-quality storytelling that captivates their intellect, now inclusive of entertaining series that harmoniously blend drama and humor, further enriching their viewing experience.",
  "metrics": {
    "rouge1_f": 0.0883174958077138,
    "rouge2_f": 0.004476776720761052,
    "rougeL_f": 0.042481833426495245,
    "meteor": 0.028299647059873024,
    "bleu1": 8.194850812036978e-06,
    "bleu2": 2.582126212136498e-06,
    "bleu3": 4.0849448515955516e-07,
    "bleu4": 1.626909940160639e-07,
    "bertscore_precision": 0.31106388568878174,
    "bertscore_recall": 0.45168137550354004,
    "bertscore_f1": 0.36841073632240295
  }
}