{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: YYONG Brazilian Curly Hair Bundles with Closure Kinky Curly Virgin Extensions 3 Bundles of Brazilian Hair and Closure Curly Weave Human Hair Bundles with Lace Closure 20 22 24 & 18\nReview Date: 2020/09/03\nStore: YYONG\nAverage Rating: 3.2\nProduct Details: {'Brand': 'YYONG', 'Color': 'natural', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '15.75 x 9.37 x 2.56 inches; 13.09 Ounces', 'Item model number': 'Straight003'}\nReview Text: This hair looked good when I first got It but It has a lot of shedding came with an odor and lost its curl pattern\nReview Title: Lots of shedding\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Brazilian Virgin Body Wave Hair 3 Bundles 8A 100% Unprocessed Brazilian Body Wave Human Hair (20)\nJolanly\n{'Brand': 'Jolanly', 'Color': 'black', 'Material': 'human', 'Style': '13x4 Frontal', 'Hair Type': 'Wavy', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '12 x 3 x 2 inches; 3.2 Ounces', 'UPC': '631089369469'}\nI’m highly upset this hair had a bad odor and lots of shedding and hair fillers very poor quality\nDon’t waste your time or money\nDeep Wave Closure Size 4\"x4\" 100% Unprocessed Brazilian Virgin Human Hair Bleached Knots Free Part Top Front Lace Closure Naturl Black Soft and Smooth (14inch, Brazilian Hair)\nZhuoqi hair\n{'Brand': 'Zhuoqi hair', 'Age Range (Description)': 'Adult', 'Material': 'Human', 'Unit Count': '3.5274 Ounce', 'Are Batteries Included': 'No', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.5 x 5.67 x 1.06 inches; 2.26 Ounces', 'UPC': '760960320111 791719202266'}\nThe hair itself isn’t bad but my lace had a rip in It and I don’t like all the white hairs blended in the closure\nDamaged lace\nYYONG Brazilian Curly Hair Bundles with Closure Kinky Curly Virgin Extensions 3 Bundles of Brazilian Hair and Closure Curly Weave Human Hair Bundles with Lace Closure 20 22 24 & 18\nYYONG\n{'Brand': 'YYONG', 'Color': 'natural', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '15.75 x 9.37 x 2.56 inches; 13.09 Ounces', 'Item model number': 'Straight003'}\nThis hair looked good when I first got It but It has a lot of shedding came with an odor and lost its curl pattern\nLots of shedding",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Quality Sensitivity:** The user maintains a high standard for hair products and has demonstrated a strong intolerance for issues like odor, shedding, and loss of curl pattern. Their latest experience with excessive shedding and unexpected characteristics further reinforces their sensitivity to product quality.\n\n- **Expectations of Value:** The user continues to expect high-quality, unprocessed hair, and their recent dissatisfaction underscores a consistent theme of feeling that the value received does not match the price paid. Their disappointment highlights the importance they place on product integrity and performance.\n\n- **Negativity Toward Poor Experiences:** This user is vocal about their unmet expectations and exhibits a clear intolerance for substandard products. Their willingness to assign low ratings reflects their demand for quality and consistency in purchasing decisions.\n\n- **Preference for Natural Characteristics:** The user consistently seeks products noted for being \"100% unprocessed,\" indicating a strong preference for natural beauty, authenticity, and durability. Their latest review, which mentions shedding, odor, and loss of curl pattern, aligns with their aversion to undesirable features and underlines their commitment to high-quality standards.\n\nOverall, this user is inclined to prioritize premium hair products. They will likely express disappointment with brands that do not meet their rigorous expectations, making clear communication about product quality essential for their satisfaction.",
  "metrics": {
    "rouge1_f": 0.19542619542619544,
    "rouge2_f": 0.020876826722338208,
    "rougeL_f": 0.09979209979209978,
    "meteor": 0.101936468212649,
    "bleu1": 0.14117736461541341,
    "bleu2": 0.03244936118314994,
    "bleu3": 0.006405112210704348,
    "bleu4": 0.0028483875749623255,
    "bertscore_precision": 0.36300215125083923,
    "bertscore_recall": 0.3904971480369568,
    "bertscore_f1": 0.3762480318546295
  }
}