{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/02/02\nAverage Rating: 4.0\nProduct Details: {'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['NA'], 'Producers': ['John Lewis']}\nReview Text: It covered a battle I knew nothing about so I enjoyed it.\nReview Title: ... covered a battle I knew nothing about so I enjoyed it.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Pied Piper (1942)\nRoddy McDowall  (Actor),     Anne Baxter  (Actor),     Irving Pichel  (Director)    &                   0                  more   Format: DVD-R  This title is manufactured on demand using DVD-R, when sold by Amazon.com.  Learn more   What's this?\nMovies & TV, Movies\n['Englishman Mr Howard is on a fishing holiday in eastern France when the Germans invade in 1940. Setting off to try and get back home he is persuaded to take along the two Cavanaugh children, and as his journey progresses his family keeps growing in size. Once in German-occupied northern France a new problem arises - the risk of being heard speaking English.']\n{'Is Discontinued By Manufacturer': 'No', 'Director': 'Irving Pichel', 'Media Format': 'Black & White, Full length', 'Actors': 'Monty Woolley, Roddy McDowall, Anne Baxter'}\nThis is a great WWII movie that was very well produced. Monte Woolley was great as the lead. It arrived quicker than promised and was a very good copy.\nThe Pied Piper (1942)\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ryan Little'], 'Producers': ['Charles Chan', 'Sunny Chen', 'Adam Abel', 'Ryan Little'], 'Starring': ['Corbin Allred', 'Kirby Heyborne', 'Alexander Polinsky'], 'Studio': ['Koan', 'Inc.']}\nA very well told and gripping action film\nFour Stars\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rick Beyer'], 'Producers': ['Rick Beyer'], 'Starring': ['Peter Coyote']}\nA great documentary on the ghost army and what they accomplished in WWII.\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Scott Walker'], 'Producers': ['Curtis \"50 Cent\" Jackson', 'Jane Fleming', 'Mark Ordesky', 'Jeff Rice'], 'Starring': ['Nicolas Cage', 'John Cusack', 'Vanessa Hudgens'], 'Studio': ['Lions Gate Films', 'Inc.']}\nGood film.\nFour Stars\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Atom Egoyan'], 'Producers': ['Robert Lantos', 'Ari Lantos'], 'Starring': ['Christopher Plummer', 'Martin Landau', 'Henry Czerny']}\nSuspence with a surprise\nFour Stars\nAgainst the Sun\nDrama, Adventure, Downbeat, Emotional\n['In one of the most harrowing true stories of World War II, three US Navy airmen crash land their torpedo bomber in the South Pacific and find themselves on a tiny life raft, surrounded by open ocean. No food. No water. No hope of rescue. Against incredible odds, these three virtual strangers must survive storms, sharks, starvation and each other as they try to sail to safety.']\n{'Subtitles': ['None available'], 'Directors': ['Brian Falk'], 'Producers': ['Brian Falk', 'Mark Moran', 'Joe Ricketts', 'Kurt Graver', 'Luisa Gomez de Silva'], 'Starring': ['Garrett Dillahunt', 'Tom Felton', 'Jake Abel']}\nI couldn't get into it.\nOne Star\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher McQuarrie'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Paramount Pictures']}\nGreat action film. I thought better than the other IMF films.\nFour Stars\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Alan Taylor'], 'Producers': ['David Ellison', 'Dana Goldberg', 'Bil Carraro', 'Laeta Kalogridis'], 'Starring': ['Arnold Schwarzenegger', 'Jason Clarke', 'Emilia Clarke'], 'Studio': ['Paramount Pictures Corp.']}\nGreat movie.\nFive Stars\nMurdoch Mysteries Collection 5-8\nYannick Bisson  (Actor),     Cal Coons  (Director),     Don McCutcheon  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Mystery & Thrillers\n['This award-winning Canadian series follows Detective William Murdoch (Yannick Bisson, Sue Thomas: F.B.Eye) as he solves turn-of-the-century Toronto’s most intriguing mysteries with groundbreaking scientific inventions and revolutionary forensic techniques. Aided by his eager deputy, Constable Crabtree (Jonny Harris, Hatching, Matching & Dispatching); gruff boss, Inspector Brackenreid (Thomas Craig, Where the Heart Is); and feisty coroner Dr. Emily Grace (Georgina Reilly, The L.A. Complex), Murdoch faces off against murderers, thieves, and dangerous criminals. He also continues his on-again, off-again romance with pathologist-turned-psychiatrist Dr. Julia Ogden (Gemini winner Hélène Joy, Durham County).During his investigations, Murdoch encounters the greatest minds of the day, like Sir Arthur Conan Doyle, Thomas Edison, Henry Ford, Winston Churchill, and President Theodore Roosevelt. Guest stars in this collection of Seasons 5-8 include Peter Keleghan (The Newsroom), Patrick McKenna (The Red Green Show), Allan Hawco (Republic of Doyle), Thomas Howes (Downton Abbey), Lisa Faulkner (Murder in Suburbia), and Matthew Bennett (Battlestar Galactica).']\n{'Genre': 'Television, Television/Crime', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Don McCutcheon, Laurie Lynd, Harvey Crossland, Cal Coons, Yannick Bisson', 'Language': 'English', 'Number Of Discs': '18', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.45 Pounds', 'Item model number': '35644720', 'Director': 'Cal Coons, Don McCutcheon, Harvey Crossland, Laurie Lynd', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '46 hours and 20 minutes', 'Release date': 'August 2, 2016', 'Actors': 'Yannick Bisson', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '18'}\nGreat series.. Highly recommended.\nGood detective story.\nMurdoch Mysteries: Season 2\nYannick Bisson  (Actor),     Thomas Craig  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n[\"Winner of three Gemini Awards, this sassy-smart Victorian-era whodunit stars Yannick Bisson (Sue Thomas: F. B. Eye) as Detective William Murdoch, a police investigator who employs emerging science to solve Toronto's most dreadful murders.\"]\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Hélène Joy, Thomas Craig, Yannick Bisson, Various', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '9 hours and 58 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '80543545', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '9 hours and 58 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Yannick Bisson, Thomas Craig, Hélène Joy', 'Studio': 'Acorn', 'Number of discs': '4'}\nGreat series.\nGood stories.\nMurdoch Mysteries, Season One\nYannick Bisson  (Actor),     Helene Joy  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'Combining the period appeal of Sherlock Holmes with the forensic fascination of CSI, this slick, stylish series has won fiercely loyal fans in the U. K. and Canada. In Victorian Toronto, handsome Detective Murdoch (Yannick Bisson, Sue Thomas: F. B. Eye) uses newfangled scientific techniques like finger marks to solve the citys most baffling murders. Helped by a pretty pathologist (Gemini-winner Hilhne Joy, Durham County) and an eager protigi (Jonny Harris, Hatching, Matching & Dispatching), he tries to win over his skeptical boss (Thomas Craig, Where the Heart Is) to his radical methods. Clever plot twists, sly wit, and references to historical figures add to the fun. Starring Yannick Bisson, Jonny Harris, Helene Joy Special Features: 4-Disc Set Box Set Screen Format Note: Widescreen 16:9 Audio: Stereo - English Subtitles - English - SDH Additional Release Material Runtime: 598 Minutes.', 'Amazon.com', 'Inspired by a series of television movies based on the mystery novels of Maureen Jennings, the enjoyable', 'Murdoch Mysteries: Series One', \"follows the investigations of Toronto police detective William Murdoch at the close of the 19th century. A man of scientific progress as well as devout Catholicism, Murdoch (Yannick Bisson) approaches mysteries with such new, state-of-the-art techniques as fingerprinting, blood-testing, and trace evidence, collaborating closely with his department's pathologist, Dr. Julia Ogden (Hélène Joy). Working under the skeptical Inspector Brackenreid (Thomas Craig), an old-school copper who respects his lead investigator's results but has little patience for his complex methods, Murdoch often encounters new-fangled technology that, in time, will pave the way for such 20th-century staples as radio, television and the electronic grid. At the same time, the faith element in Murdoch's view of the world allows him to be something more than a complete rationalist. His occasional reliance on a medium (Maria del Mar) to help him discover clues, and his church-derived ethics are all part of Murdoch's approach to an increasingly complicated world.\", 'The first episode in', 'Murdoch Mysteries: Season One', 'is an excellent template for all 13 shows in this boxed set. \"Power\" finds Murdoch trying to discover how and why a woman was killed during a demonstration of the \"evils\" of alternating-current-derived electricity put on by a direct-current power company. Murdoch\\'s queries put him in touch with Nikola Tesla, the real-life father of the AC motor. \"The Glass Ceiling\" pits Murdoch\\'s scientific techniques against the more brutal approach of his boss, Brackenreid, who seems to be the target of a killer linked to an old case. \"Elementary, My Dear Murdoch\" somewhat inevitably pairs Murdoch in a murder investigation with one of his idols, Sir Arthur Conan Doyle, whose faith in such spiritualist pursuits as seances complicates things. (Doyle returns in a later episode, \"Belly Speaker,\" again proving more of a meddler than a help in a case involving a mad ventriloquist.) \"Bad Medicine\" is a scary story about a hooded archer killing off the patients at a clinic for advanced brain study. (The aforementioned medium has unnerving visions of Murdoch becoming one of the murderer\\'s victims.) The last episode, \"The Annoying Red Planet,\" is easily the season\\'s most ambitious, involving crop circles, possible extraterrestrial footprints, and a genuine unidentified flying object that pushes the series into', 'The X-Files', 'territory.', '--Tom Keogh', 'Stills from', 'Murdoch Mysteries: Series 1', '(Click for larger image)', 'Review', 'Clever and smart. --', 'Deseret News (UT)', 'Excellent adventure. --', 'Midwest Book Review', 'The compelling performances of the cast help make the series absolutely addictive. --', 'The Boston Event Guide', \"This is a show that perhaps you haven't heard much of, but it is truly outstanding. Check this out right away! --\", 'Fort Bend Star', 'See more']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Anamorphic, NTSC', 'Contributor': 'Paul Amos, Lachlan Murdoch, Kate Greenhouse, Jonny Harris, Thomas Craig, Sarah Allen, Peter Stebbings, Arwen Humphreys, Sean Harraher, Yannick Bisson, Helene Joy, Dakota GoyoPaul Amos, Lachlan Murdoch, Kate Greenhouse, Jonny Harris, Thomas Craig, Sarah Allen, Peter Stebbings, Arwen Humphreys, Sean Harraher, Yannick Bisson, Helene Joy, Dakota Goyo  See more', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '1.2 x 5.4 x 7.6 inches; 11.2 Ounces', 'Item model number': '24584068', 'Media Format': 'Multiple Formats, Box set, Color, Anamorphic, NTSC', 'Run time': '9 hours and 58 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Yannick Bisson, Helene Joy, Thomas Craig, Jonny Harris, Lachlan Murdoch', 'Studio': 'ACORN MEDIA', 'Number of discs': '4'}\nGreat detective stories.\nGood detective stories.\n{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['NA'], 'Producers': ['John Lewis']}\nIt covered a battle I knew nothing about so I enjoyed it.\n... covered a battle I knew nothing about so I enjoyed it.",
  "profile": "User Profile Summary:\n\n- **Movie/TV Genre Preference:** The user has a strong passion for classic war films, especially WWII narratives, and is increasingly drawn to clever mystery narratives, as evidenced by recent purchases. Their latest review highlights a continuing interest in lesser-known historical battles, indicating a desire for depth and discovery in storytelling beyond their primary genre.\n\n- **Quality Appreciation:** The user values high-quality filmmaking and storytelling, consistently providing articulate and positive reviews. Their recent feedback emphasizes their expectation for engaging narratives, reinforcing their established critique style focused on plot strength.\n\n- **Format Preference:** The user continues to favor physical media, specifically DVD-R, showcasing a dedication to curating a meaningful collection of films and series that resonate with their cinematic values.\n\n- **Actor Affinity:** While they admire established actors, the user maintains a focus on strong storytelling and well-developed narratives over performances alone.\n\n- **Timeliness:** The user emphasizes prompt service and efficiency in transactions, consistent with their historical behavior.\n\n- **Engagement Style:** The user exhibits an articulate and reflective engagement style, offering nuanced insights into themes and narratives in their evaluations.\n\nOverall, the user remains a committed film enthusiast, recently displaying an interest in exploring historical content while upholding a commitment to exceptional narrative quality across genres. Their reflective approach continues to enhance their engagement with diverse cinematic experiences.",
  "metrics": {
    "rouge1_f": 0.08485446472619634,
    "rouge2_f": 0.003950617283950617,
    "rougeL_f": 0.045387271830291065,
    "meteor": 0.024168713210930497,
    "bleu1": 3.413518884886886e-05,
    "bleu2": 7.462589178382125e-06,
    "bleu3": 1.2217860016806291e-06,
    "bleu4": 4.948223781175062e-07,
    "bertscore_precision": 0.3408721685409546,
    "bertscore_recall": 0.4745749235153198,
    "bertscore_f1": 0.3967624306678772
  }
}