{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/03/24\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rick Beyer'], 'Producers': ['Rick Beyer'], 'Starring': ['Peter Coyote']}\nReview Text: A great documentary on the ghost army and what they accomplished in WWII.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Pied Piper (1942)\nRoddy McDowall  (Actor),     Anne Baxter  (Actor),     Irving Pichel  (Director)    &                   0                  more   Format: DVD-R  This title is manufactured on demand using DVD-R, when sold by Amazon.com.  Learn more   What's this?\nMovies & TV, Movies\n['Englishman Mr Howard is on a fishing holiday in eastern France when the Germans invade in 1940. Setting off to try and get back home he is persuaded to take along the two Cavanaugh children, and as his journey progresses his family keeps growing in size. Once in German-occupied northern France a new problem arises - the risk of being heard speaking English.']\n{'Is Discontinued By Manufacturer': 'No', 'Director': 'Irving Pichel', 'Media Format': 'Black & White, Full length', 'Actors': 'Monty Woolley, Roddy McDowall, Anne Baxter'}\nThis is a great WWII movie that was very well produced. Monte Woolley was great as the lead. It arrived quicker than promised and was a very good copy.\nThe Pied Piper (1942)\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ryan Little'], 'Producers': ['Charles Chan', 'Sunny Chen', 'Adam Abel', 'Ryan Little'], 'Starring': ['Corbin Allred', 'Kirby Heyborne', 'Alexander Polinsky'], 'Studio': ['Koan', 'Inc.']}\nA very well told and gripping action film\nFour Stars\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rick Beyer'], 'Producers': ['Rick Beyer'], 'Starring': ['Peter Coyote']}\nA great documentary on the ghost army and what they accomplished in WWII.\nFive Stars",
  "profile": "User Profile Summary:\n\n- **Movie Genre Preference:** The user maintains a strong interest in classic war films, particularly narratives centered around WWII. Their recent engagement with a documentary about the Ghost Army indicates an appreciation for insightful historical narratives, further enhancing their openness to related genres that emphasize emotional depth and significant events.\n\n- **Quality Appreciation:** The user continues to value high-quality production, evident in their consistent high ratings. Their discerning taste for storytelling and filmmaking techniques persists, underscoring a preference for impactful, well-crafted content.\n\n- **Format Preference:** The commitment to physical media (DVD-R) remains strong, highlighting a desire for tangible film collections that reflect their curated tastes in cinema.\n\n- **Actor Affinity:** The appreciation for performances by established actors continues, aligning with their previous inclinations towards classic and seasoned talent in film.\n\n- **Timeliness:** The user still values prompt delivery, as indicated by ongoing positive feedback regarding efficient service in their transactions.\n\n- **Engagement Style:** They engage thoughtfully in detailed reviews, showcasing a reflective and intellectual approach to film analysis. This suggests a desire to share insights and contribute meaningfully to the film community.\n\nOverall, the user is reaffirmed as a classic film enthusiast with a particular admiration for WWII narratives, a focus on cinematic excellence, and an indication of expanding interests toward thoughtful historical documentaries.",
  "metrics": {
    "rouge1_f": 0.2222222222222222,
    "rouge2_f": 0.013392857142857142,
    "rougeL_f": 0.09777777777777778,
    "meteor": 0.11100168082686648,
    "bleu1": 0.16501225459108101,
    "bleu2": 0.02835153297181405,
    "bleu3": 0.0058137342049039,
    "bleu4": 0.0026351015522514533,
    "bertscore_precision": 0.3736202120780945,
    "bertscore_recall": 0.42890623211860657,
    "bertscore_f1": 0.3993588984012604
  }
}