{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 8 Rolls White Eyelash Extension PE Tape, Adhesive Fabric Eyelash Tape, Lash PE Tape for Eyelash Extension Supply, 1/2'' x 10 Yards\nReview Date: 2020/12/23\nStore: Cuckoo\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Cuckoo', 'Material': 'Paper', 'Number of Items': '8', 'Compatible Material': 'Fabric', 'Product Dimensions': '5.12 x 1.97 x 1.97 inches; 4.23 Ounces'}\nReview Text: Although this tape is designed for eyelash extensions, I wanted to see how it worked when applying eye-shadow. I use the makeup artist's Scotch tape trick for applying eye shadow [see Dominique Sachse's, Caught on Tape U tube video] and love the effect. However, Scotch tape doesn't stick to skin evenly/smoothly leaving gaps and when its peeled off it takes some foundation with it. I was hoping this would work better and I've not been disappointed.  It's easy to apply and goes on smoothly with no wrinkles or gaps and it removes without taking foundation with it. Leaving you with a nice winged effect to your shadow. Now that I think about it, it should also work for winged eyeliner.\nReview Title: PERFECT ALTERNATIVE FOR EYESHADOW SCOTCH TAPE TRICK👍👍👍\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Sigma 3DHD - Precision Brush - Pink\n{'Skin Type': 'All', 'Item Form': 'Wand', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Brass', 'Item Dimensions LxWxH': '2 x 1 x 8 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 1 x 8 inches; 0.35 Ounces', 'Item model number': '3DP02'}\nThis is another great brush from Sigma! I now have 4 Sigma brushes and all four are of outstanding quality. This little brush does exactly  what Sigma's website says it will do (see the video on their site) and I highly recommend it. I no longer see any reason to pay $40 and up for one makeup brush when Sigma offers such a large variety of brushes at half the price!\nAnother win for Sigma\nR-NEU 200 Cotton Rounds, 100% Natural Turkish Cotton Makeup Remover and Facial Cleansing Cotton Round Pads, Waffle Textured Hypoallergenic Cotton Wipes, 2.25 Inch Diameter (200 Pack)\nR-NEU\n{'Size': '2.25 Inch (Pack of 200)', 'Brand': 'R-NEU', 'Material': 'Cotton', 'Product Benefits': 'Cleansing', 'Shape': 'Round', 'Package Dimensions': '9.17 x 4.8 x 2.28 inches; 3.77 Ounces', 'Item model number': 'yhua8a-654', 'UPC': '696292837730', 'Manufacturer': 'R-NEU'}\nSwisspers is my usual brand but for some strange reason I decided to give these a try. They're \"ok\" ...they are soft and absorbent but they tend to shed fibers even when wet. As I use these around my eye area that is not a good thing! Will return to my usual rounds.\nJUST OK\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nFirst off I wear contact lens and so far I've had no adverse reaction. I've only tried it once and it stayed put for 24 hrs, even though a shower! Now that's what I call really waterproof! I don't normally sleep in makeup of any kind but wanted to give it an \"all night\" durability test. Woke up the next morning....was still there! Expected at least some \"mascara\" marks on my pillowcase but there was nary a mark. But my biggest surprise came when I awoke without \"racoon eyes\"!!! I usually wear \"tubing\" mascaras as other formulas end up under my eyes within a few hours, I actually expected this mascara to do the same.<br /><br />Volume and length? It definitely added length.  I use Latisse so my lashes have stayed long as I've aged and this mascara provided additional length.  As to volume,  not so much.  However, I only used one coat so it may indeed give the volume advertised with another coat. I really did not notice any \"fibers\" and being a lens wearer perhaps that's not a bad thing.  The formula is not thick so it applies smoothly without leaving clumps. It was fairly easy to remove  with a cotton pad soaked in micro-cellular water.  All in all, if you are looking for staying power this mascara is worthy of a try.<br /><br />The packaging is unique! Hans Holbein's portrait of a young Princess Elizabeth [later Queen Elizabeth I] just caught my eye. I found the square shape vs round tube a lot easier to hold and the brush is a standard design found on many other mascara brands.\nWORTHY OF A TRY FOR STAYING POWER ALONE PLUS- No Racoon Eyes!\nEASYDEW Fill Up Volume Spot 0.67 fl oz -Anti-Aging Filler Spot Good for Topical Wrinkle Care with Hyaluronic Acid I Moisturizer with Instant Filling Effect and Skin Renewal | For Topical Area\nEASYDEW\n{'Brand': 'EASYDEW', 'Scent': 'Aloe Vera', 'Item Form': 'Cream', 'Active Ingredients': 'Hyaluronic acid', 'Number of Items': '1', 'Product Dimensions': '1.46 x 0.91 x 5.71 inches; 1.41 Ounces'}\nI just started using this filler and at this time I don't feel its had the appropriate time for me to see any change in the depth of my fine lines. So this will be a 1st impression review that I will revisit after I've used this for a few weeks.<br /><br />[From the box/packaging] This product is made by the Korean,  Daewoong Pharmaceutical [DN Co.] Company which according to the company's website is a global healthcare company that strives to contribute to the beauty molding industry in Korea and around the world.<br /><br />The gel has an easy to use unique packaging that doses out just the right amount needed to pat over wrinkles and fine lines. The gel, when first applied, feels slightly sticky but does not remain so on the skin and it worked well under foundation with no pilling or reaction.<br /><br />Being a skin care/cosmetic junkie and always a bit skeptical,  I did a little digging into the ingredients. It does contain proven HA [hyaloronic acid] which is a good start in my opinion. I did find one ingredient I wanted to know more about namely:<br /><br />EGF [epidermal growth factor) a/k/a SH-OLIGOPEPTIDE-1: - From the INCI website - Epidermal growth factor is a protein that stimulates cell growth.  I encourage you to research this ingredient for additional information for informed decision making.<br /><br />Right now, I'm skeptically giving this 3 stars for seemingly falling into the Cosmeceuticals [cosmetic products that claimed to have medicinal or drug-like benefits]<br /><br />11/29/20 Update:  I've used this for a few weeks now and my smile lines, although not doing a disappearing act,  they are less noticeable. I've not had any adverse reaction to this gel and have added a star due to the results I've seen. Note : a little goes a long way.\nSMILE LINES NOW LESS NOTICEABLE\n8 Rolls White Eyelash Extension PE Tape, Adhesive Fabric Eyelash Tape, Lash PE Tape for Eyelash Extension Supply, 1/2'' x 10 Yards\nCuckoo\n{'Brand': 'Cuckoo', 'Material': 'Paper', 'Number of Items': '8', 'Compatible Material': 'Fabric', 'Product Dimensions': '5.12 x 1.97 x 1.97 inches; 4.23 Ounces'}\nAlthough this tape is designed for eyelash extensions, I wanted to see how it worked when applying eye-shadow. I use the makeup artist's Scotch tape trick for applying eye shadow [see Dominique Sachse's, Caught on Tape U tube video] and love the effect. However, Scotch tape doesn't stick to skin evenly/smoothly leaving gaps and when its peeled off it takes some foundation with it. I was hoping this would work better and I've not been disappointed.  It's easy to apply and goes on smoothly with no wrinkles or gaps and it removes without taking foundation with it. Leaving you with a nice winged effect to your shadow. Now that I think about it, it should also work for winged eyeliner.\nPERFECT ALTERNATIVE FOR EYESHADOW SCOTCH TAPE TRICK👍👍👍",
  "profile": "**User Profile Summary:**\n\n- **Brand Loyalty:** The user maintains a strong preference for Sigma products but is open to alternatives, recently expressing satisfaction with a mascara from a different brand and exploring a filler from a Korean company.\n- **Value-Conscious:** They prioritize affordable options without compromising quality, demonstrating a discerning selection process for beauty and skincare products.\n- **Quality Focused:** The user emphasizes performance in makeup and skincare tools, reflecting continued interest in high-quality products and a willingness to experiment with alternatives that yield the desired results.\n- **Frequency of Use:** Regular use of brushes, cleansing tools, mascaras, anti-aging treatments, and now tools for precise makeup application shows a solid commitment to comprehensive beauty routines.\n- **Cosmetics and Skincare Enthusiast:** Their engagement with both cosmetics and skincare highlights a keen interest in effective makeup artistry and skincare efficacy.\n- **Skin Type & Age Range:** They seek versatile products suitable for all skin types and adult demographics, showcasing a broad approach to product selection.\n- **Product Review Behavior:** They typically provide positive feedback but are critical when products do not meet expectations. Recent reviews reflect a thoughtful approach, with a focus on innovative applications, such as using alternative tools for precise makeup techniques.\n\nOverall, the user combines enthusiasm for high-quality beauty products with a mindful approach to new experiences, showcasing a strong commitment to effective skincare and makeup routines.",
  "metrics": {
    "rouge1_f": 0.16051136363636365,
    "rouge2_f": 0.011379800853485065,
    "rougeL_f": 0.07812499999999999,
    "meteor": 0.056580204276581676,
    "bleu1": 0.0067938097726474725,
    "bleu2": 0.0013834337833905463,
    "bleu3": 0.00022118393015815608,
    "bleu4": 8.851770255067842e-05,
    "bertscore_precision": 0.367351233959198,
    "bertscore_recall": 0.48990729451179504,
    "bertscore_f1": 0.4198687672615051
  }
}