{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: UJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nReview Date: 2021/01/04\nStore: UJM\nAverage Rating: 4.2\nProduct Details: {'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nReview Text: These are natural looking lashes that were easy to apply. The magnetic liner's brush is tapered to a point allowing me to make a thin less noticeable line that stayed put all day. The lashes removed easily and the liner was gone with one swipe of Micellar Water. My only complaint is that it did seem to take a while for the liner to dry, but then I'm a newbie at magnetic lashes so this may not be out of the ordinary.\nReview Title: NICE NATURAL LOOKING REASONABLE PRICE\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Sigma 3DHD - Precision Brush - Pink\n{'Skin Type': 'All', 'Item Form': 'Wand', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Brass', 'Item Dimensions LxWxH': '2 x 1 x 8 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 1 x 8 inches; 0.35 Ounces', 'Item model number': '3DP02'}\nThis is another great brush from Sigma! I now have 4 Sigma brushes and all four are of outstanding quality. This little brush does exactly  what Sigma's website says it will do (see the video on their site) and I highly recommend it. I no longer see any reason to pay $40 and up for one makeup brush when Sigma offers such a large variety of brushes at half the price!\nAnother win for Sigma\nR-NEU 200 Cotton Rounds, 100% Natural Turkish Cotton Makeup Remover and Facial Cleansing Cotton Round Pads, Waffle Textured Hypoallergenic Cotton Wipes, 2.25 Inch Diameter (200 Pack)\nR-NEU\n{'Size': '2.25 Inch (Pack of 200)', 'Brand': 'R-NEU', 'Material': 'Cotton', 'Product Benefits': 'Cleansing', 'Shape': 'Round', 'Package Dimensions': '9.17 x 4.8 x 2.28 inches; 3.77 Ounces', 'Item model number': 'yhua8a-654', 'UPC': '696292837730', 'Manufacturer': 'R-NEU'}\nSwisspers is my usual brand but for some strange reason I decided to give these a try. They're \"ok\" ...they are soft and absorbent but they tend to shed fibers even when wet. As I use these around my eye area that is not a good thing! Will return to my usual rounds.\nJUST OK\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nFirst off I wear contact lens and so far I've had no adverse reaction. I've only tried it once and it stayed put for 24 hrs, even though a shower! Now that's what I call really waterproof! I don't normally sleep in makeup of any kind but wanted to give it an \"all night\" durability test. Woke up the next morning....was still there! Expected at least some \"mascara\" marks on my pillowcase but there was nary a mark. But my biggest surprise came when I awoke without \"racoon eyes\"!!! I usually wear \"tubing\" mascaras as other formulas end up under my eyes within a few hours, I actually expected this mascara to do the same.<br /><br />Volume and length? It definitely added length.  I use Latisse so my lashes have stayed long as I've aged and this mascara provided additional length.  As to volume,  not so much.  However, I only used one coat so it may indeed give the volume advertised with another coat. I really did not notice any \"fibers\" and being a lens wearer perhaps that's not a bad thing.  The formula is not thick so it applies smoothly without leaving clumps. It was fairly easy to remove  with a cotton pad soaked in micro-cellular water.  All in all, if you are looking for staying power this mascara is worthy of a try.<br /><br />The packaging is unique! Hans Holbein's portrait of a young Princess Elizabeth [later Queen Elizabeth I] just caught my eye. I found the square shape vs round tube a lot easier to hold and the brush is a standard design found on many other mascara brands.\nWORTHY OF A TRY FOR STAYING POWER ALONE PLUS- No Racoon Eyes!\nEASYDEW Fill Up Volume Spot 0.67 fl oz -Anti-Aging Filler Spot Good for Topical Wrinkle Care with Hyaluronic Acid I Moisturizer with Instant Filling Effect and Skin Renewal | For Topical Area\nEASYDEW\n{'Brand': 'EASYDEW', 'Scent': 'Aloe Vera', 'Item Form': 'Cream', 'Active Ingredients': 'Hyaluronic acid', 'Number of Items': '1', 'Product Dimensions': '1.46 x 0.91 x 5.71 inches; 1.41 Ounces'}\nI just started using this filler and at this time I don't feel its had the appropriate time for me to see any change in the depth of my fine lines. So this will be a 1st impression review that I will revisit after I've used this for a few weeks.<br /><br />[From the box/packaging] This product is made by the Korean,  Daewoong Pharmaceutical [DN Co.] Company which according to the company's website is a global healthcare company that strives to contribute to the beauty molding industry in Korea and around the world.<br /><br />The gel has an easy to use unique packaging that doses out just the right amount needed to pat over wrinkles and fine lines. The gel, when first applied, feels slightly sticky but does not remain so on the skin and it worked well under foundation with no pilling or reaction.<br /><br />Being a skin care/cosmetic junkie and always a bit skeptical,  I did a little digging into the ingredients. It does contain proven HA [hyaloronic acid] which is a good start in my opinion. I did find one ingredient I wanted to know more about namely:<br /><br />EGF [epidermal growth factor) a/k/a SH-OLIGOPEPTIDE-1: - From the INCI website - Epidermal growth factor is a protein that stimulates cell growth.  I encourage you to research this ingredient for additional information for informed decision making.<br /><br />Right now, I'm skeptically giving this 3 stars for seemingly falling into the Cosmeceuticals [cosmetic products that claimed to have medicinal or drug-like benefits]<br /><br />11/29/20 Update:  I've used this for a few weeks now and my smile lines, although not doing a disappearing act,  they are less noticeable. I've not had any adverse reaction to this gel and have added a star due to the results I've seen. Note : a little goes a long way.\nSMILE LINES NOW LESS NOTICEABLE\n8 Rolls White Eyelash Extension PE Tape, Adhesive Fabric Eyelash Tape, Lash PE Tape for Eyelash Extension Supply, 1/2'' x 10 Yards\nCuckoo\n{'Brand': 'Cuckoo', 'Material': 'Paper', 'Number of Items': '8', 'Compatible Material': 'Fabric', 'Product Dimensions': '5.12 x 1.97 x 1.97 inches; 4.23 Ounces'}\nAlthough this tape is designed for eyelash extensions, I wanted to see how it worked when applying eye-shadow. I use the makeup artist's Scotch tape trick for applying eye shadow [see Dominique Sachse's, Caught on Tape U tube video] and love the effect. However, Scotch tape doesn't stick to skin evenly/smoothly leaving gaps and when its peeled off it takes some foundation with it. I was hoping this would work better and I've not been disappointed.  It's easy to apply and goes on smoothly with no wrinkles or gaps and it removes without taking foundation with it. Leaving you with a nice winged effect to your shadow. Now that I think about it, it should also work for winged eyeliner.\nPERFECT ALTERNATIVE FOR EYESHADOW SCOTCH TAPE TRICK👍👍👍\nUJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nUJM\n{'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nThese are natural looking lashes that were easy to apply. The magnetic liner's brush is tapered to a point allowing me to make a thin less noticeable line that stayed put all day. The lashes removed easily and the liner was gone with one swipe of Micellar Water. My only complaint is that it did seem to take a while for the liner to dry, but then I'm a newbie at magnetic lashes so this may not be out of the ordinary.\nNICE NATURAL LOOKING REASONABLE PRICE",
  "profile": "**User Profile Summary:**\n\n- **Brand Loyalty:** The user exhibits strong loyalty to Sigma products yet remains open to exploring alternatives that deliver quality results. Their recent satisfaction with products from a different brand, including false eyelashes, indicates a growing interest in innovative makeup solutions. \n- **Value-Conscious:** They prioritize affordability without sacrificing quality, showing a savvy approach to product selection, as demonstrated by their continued interest in reasonably priced beauty items.\n- **Quality Focused:** Emphasizing performance, the user values high-quality beauty tools and is willing to experiment with new techniques, such as magnetic eyelashes, that enhance their makeup application.\n- **Frequency of Use:** They regularly use a variety of products, including makeup brushes, cleansing tools, and lashes, reflecting a commitment to a comprehensive and versatile beauty routine.\n- **Cosmetics and Skincare Enthusiast:** Their engagement with both cosmetics and skincare underscores a keen interest in effective beauty techniques, particularly those that offer natural looks.\n- **Skin Type & Age Range:** They prefer versatile products suitable for all skin types and adult demographics, which aligns with their broad product selection approach.\n- **Product Review Behavior:** The user provides balanced feedback, often highlighting innovative applications while remaining critical when products fall short. Their recent reviews suggest a focus on user-friendly features and effective performance.\n\nOverall, the user combines a passion for high-quality beauty products with a mindful and value-driven approach, showcasing a clear commitment to effective makeup artistry and skincare routines.",
  "metrics": {
    "rouge1_f": 0.14385741565881605,
    "rouge2_f": 0.011472275334608031,
    "rougeL_f": 0.06492679821769573,
    "meteor": 0.05423459256717003,
    "bleu1": 0.004296696936807315,
    "bleu2": 0.000689160316053937,
    "bleu3": 0.00012063921580241967,
    "bleu4": 5.0516579623604513e-05,
    "bertscore_precision": 0.3582812547683716,
    "bertscore_recall": 0.48473799228668213,
    "bertscore_f1": 0.4120250940322876
  }
}