{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 50th Birthday Gifts for Women, 40th Birthday Gifts Women, 60th Birthday Gifts for Women, Gift Basket for Women, Spa Gifts for Women, 30th Birthday Gifts for Her, 70th Birthday Gifts for Women – 7 PC\nReview Date: 2021/12/26\nStore: WAX & WIT\nAverage Rating: 4.7\nProduct Details: {'Package Dimensions': '10.63 x 7.44 x 4.49 inches; 3.59 Pounds', 'Manufacturer': 'WAX & WIT', 'Country of Origin': 'USA'}\nReview Text: This is fabulous box full of everything you need to relax in the tub and after you get out! Everything that comes in this set smells amazing and is made with good quality ingredients! The box would make a perfect gift for a loved one, or even yourself. Have a self care spa day at home and treat yourself with this lovely bath and body set.\nReview Title: Everything smells amazing\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Godefroy Tint Kit for Spot Coloring, Dark Brown\nGodefroy\n['Godefroy Professional Hair Color Tint Kit is ideal for coloring small areas of the scalp and facial hair. Pre-measured in separate capsule units, it gives you the versatility to use the exact amount of color with no waste. Great for use on beards, mustaches, sideburns, & temple, anywhere you need a little color. Also can be used for root touch ups in between hair color treatments. No odor & Blends well with existing color']\n{'Color': 'Dark Brown', 'Brand': 'Godefroy', 'Item Form': 'Cream', 'Number of Items': '1', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.2 x 2.5 x 2.1 inches; 2.4 Ounces', 'Item model number': '203', 'UPC': '852661595933 604106323737 186297000067 726714358472 801276566487', 'Manufacturer': 'Godefroy'}\ni searched &#34;dark brown eyebrow tint&#34; and this came up and i was about to make the purchase until i fully read the description &#34;This product must not be used for dyeing the eyelashes and eyebrows. To do so may cause blindness&#34; so i dont know why people are condoning the use of this product on their eyebrows/ eye area. i guess they dont care there is a chance of losing eye sight. also amazon needs to remove this from results for eyebrow tint... glad i saw before i bought!\nNot for use near eyes! may cause blindness!\nSegbeauty empty bottle 290\nTruuMe\n{'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nThis mister is awesome! I got it to use on my house plants and it works great. It holds a little of 5oz, the mist very fine, handle is easy to pull, and it's a continuous spray for few seconds per handle pump! Might consider using on my hair in the future too!<br /><br />Please let me know if you have any questions about my review, or if you have found it of any help to you.\nWorks great as a plant mister\nQIC 4D Silk Fiber Lash Mascara, Fiber Mascara, Waterproof Mascara, Natural Thick Thickening and Lengthening Mascara Lasting All Day\nJoruby\n{'Brand': 'Joruby', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '5.3 x 0.8 x 0.8 inches; 0.81 Ounces'}\nDisappointed in this product because it did not work for me. I took a couple pictures showing and comparing my eyelashes before and after applying. The mascara was a little pastey but step 1 applied ok and looked fine, but step 2 completely ruined my eyelashes. It looked horrible; The left side got clumped together and the right side looked like my eyelashes were growing baby eyelashes. Very unnatural looking. This claims to be flake free but after it dried i noticed a few little black specks on my cheeks. I had to use one of my old dried up mascara brushes to separate my lashes to fix them. It's also very hard to wash off.\nAfter step 2 my eyelashes looked horrible\nMagnesium Serum For Kids - All Natural Rub for Kids and Babies, Toxic Free + Free Magnesium Chart PDF\nRaise Them Well\n{'Brand': 'Raise Them Well', 'Item Form': 'Liquid', 'Unit Count': '2 Fl. Oz', 'Flavor': 'Unflavored', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 1.5 x 1.5 inches; 3.2 Ounces', 'UPC': '853647007044', 'Manufacturer': 'Raise Them Well'}\nI got this to use on my 1 year old! The quality seemed great (all natural, organic and enhanced with fulvic acid!). Ithought it could help her sleep better especially on nights where she is having a hard time (due to teething for an example.) Its easy to apply, rubs in and absorbs well but does feel a little sticky afterwards. It doesnt have much of a smell either maybe a little like lavender but gentle. Ive been doing one pump and rubbing it on her feet and she likes the little foot massage. I could tell it helps her sleep better. She wakes up/squirms less, maybe helping her get a deeper sleep. Very happy to have this for the rough nights.\nWorks well, a little sticky after-feeling\nEmpty Clear Glass Spray Bottles 2-PACK,Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Special Feature': 'Mist Spray', 'Package Dimensions': '10 x 6.5 x 3.4 inches; 1.4 Pounds', 'UPC': '791523234156'}\nThese are sturdy glass bottles. I have a couple amber colored bottles but I wanted to get a couple glear bottles. The spray nozzles have long tubes that go all the way down to the bottom of the glass bottle so you could get every last drop out! The spray top only has 2 options: off and on, and the on is a very fine misted spray- No stream setting like most bottles, so that could be a con depending on what you want to use it for. It would be ideal for misting (like plants or hair) I will also be using these for making my own cleaning products.\nOnly sprays a fine mist, ideal for plants\nIce Roller for Face & Eye by Charmlily, Puffiness, Migraine, Pain Relief - Cold Facial Massager Treatment to Reduce Puffy Face & Tighten Pores, Under Eye Wrinkles (Pink)\nCHARMLILY\n{'Brand': 'CHARMLILY', 'Special Feature': 'Heat', 'Water Resistance Level': 'Not Water Resistant', 'Package Dimensions': '7.8 x 3.54 x 2.48 inches; 6.35 Ounces', 'UPC': '679360098356', 'Manufacturer': 'CHARMLILY'}\ni get frequent puffiness under my eyes. The usual go to is a frozen spoon or ice cube, but came across this and decided to get it. Its easier to use and more convenient.  You dont have to worry about your hand getting cold because the roller part is the only thing that goes in the freezer. It gently massages and soothes eyes and other areas youd like to treat. I think this would also make a nice gift! It is a little bigger than expected so it may be harder to reach small areas.\ngood alternative to frozen spoons or ice cubes\nSOFTACULOUS Foot Peeling Mask Booties – 2 Pairs, Baby Soft Skin in 7 Days\nSuiteMade\n{'Package Dimensions': '7.87 x 5.91 x 1.14 inches; 4 Ounces', 'Item model number': 'STM-FMP-LAV', 'UPC': '734038263785'}\nThis was my first time using a foot peel, so I feel like this product didnt provide enough information for first time users. Directions said to put booties on feet. I wasnt sure if i should take them out of the plastic, so i didnt because there was alot of liquid in them. The packets also said to not use if you are breastfeeding or pregnant so that was concerning - not sure what is in it or how it effects milk, but i still pump for my daughter. I kept these securely on my feet for the directed amount of time and then took them off and took a shower. A couple days later my right foot started to peel first but got really itchy so i think i scratched off some of the peeling skin. The description says it will peel in about a week and leave skin smooth but my whole foot didnt peel and I still have patches of dried skin and calluses. Idk if I was suppose to keep socks/ slippers off  during this time but it didnt completely work for me for whatever reason. Maybe if they provided a more detailed instruction process I couldve been more successful?\nfeet didnt peel fully, still had rough spots\nAsenlin Hair Ties Bands 4MM Durable Neutral Ouchless Accessories for Women Men Girls No Metal Elastics Thick Tie with Strong Ponytail Holder and for Medium Hair(24 Count of 3 Pack)-Black\nAsenlin\n{'Material': 'Metal, Cotton, Rubber', 'Item Form': 'elastic', 'Brand': 'Asenlin', 'Item Dimensions LxWxH': '0.2 x 0.09 x 0.02 inches', 'Hair Type': 'Curly', 'Product Dimensions': '0.2 x 0.09 x 0.02 inches; 4.23 Ounces', 'UPC': '779663992884'}\nThese hair ties are a tighter tie similar to name brand like conair. Right off the packaging they are too tight tight wear around wrist but work well to hold hair in place. Haven't had any break or anything so far, so overall good hair ties so far!\nComparable to name brand\n50th Birthday Gifts for Women, 40th Birthday Gifts Women, 60th Birthday Gifts for Women, Gift Basket for Women, Spa Gifts for Women, 30th Birthday Gifts for Her, 70th Birthday Gifts for Women – 7 PC\nWAX & WIT\n{'Package Dimensions': '10.63 x 7.44 x 4.49 inches; 3.59 Pounds', 'Manufacturer': 'WAX & WIT', 'Country of Origin': 'USA'}\nThis is fabulous box full of everything you need to relax in the tub and after you get out! Everything that comes in this set smells amazing and is made with good quality ingredients! The box would make a perfect gift for a loved one, or even yourself. Have a self care spa day at home and treat yourself with this lovely bath and body set.\nEverything smells amazing",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Everything smells amazing",
    "text": "This is fabulous box full of everything you need to relax in the tub and after you get out! Everything that comes in this set smells amazing and is made with good quality ingredients! The box would make a perfect gift for a loved one, or even yourself. Have a self care spa day at home and treat yourself with this lovely bath and body set.",
    "images": [],
    "asin": "B091GDY97P",
    "parent_asin": "B0BQQ5L942",
    "user_id": "AG644AQBRT56BVFDCJMISCNTSRMA",
    "timestamp": "2021-12-26 22:45:15.061000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "50th Birthday Gifts for Women, 40th Birthday Gifts Women, 60th Birthday Gifts for Women, Gift Basket for Women, Spa Gifts for Women, 30th Birthday Gifts for Her, 70th Birthday Gifts for Women – 7 PC",
    "average_rating": 4.7,
    "rating_number": 837,
    "features": [
      "Happy Bday Gifts for Women: Every lady loves a little time to relax and enjoy some me time. Our birthday spa gift box basket for women is a beautifully boxed care package for women. Great gifts for mom, grandma, daughter, wife, girlfriend!",
      "Birthday Gift Sets for Women: Our spa set kit is just right as a luxury birthday gift for teen girls, a birthday gift for women friends, a self care gifts for women who have everything, and as a happy birthday gift set idea for friends female.",
      "Birthday Basket for Womens Gifts: Our Birthday gift sets comes with a hand poured Birthday Cake scented candle and premium spa items. Great for any age, 25th, 30th, 40th, 50th, 60th and 70th relaxing friendship birthday unique gifts for women.",
      "Self Care Products: Our spa gift basket for women is a gift she will never forget. The perfect self care birthday gifts from mom for daughter to leave her destressed and feeling appreciated. Perfect gift for mom, spouse and bestfriends!",
      "Spa Sets for Women: Personalized bday gifts can be tricky for women who have everything, find just the right stress relief birthday gifts for her. Look no further, we have a birthday surprise relaxation gift basket to make her light up with joy."
    ],
    "description": [],
    "price": 36.95,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/615CLzEqyqS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/615CLzEqyqS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91tF2raNWSS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51IHrjRX6YL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51IHrjRX6YL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/912ochbXs1L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51bVrDMAnRL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51bVrDMAnRL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/91n3b3h+h+L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51HvABZ-OEL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51HvABZ-OEL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/91wXnTaW-wL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/518r-9Ov6JL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/518r-9Ov6JL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/91L0xD8mOaL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41SmFmJU4VL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41SmFmJU4VL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81+RDY0QzPL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51xTiMdiNqL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51xTiMdiNqL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/91rQsit4dhL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Our POV on Gift Baskets for Women",
        "url": "https://www.amazon.com/vdp/034ad9b2c089428683c4064a0b817a2e?ref=dp_vse_rvc_0",
        "user_id": "/shop/influencer-20a38664"
      },
      {
        "title": "Our Point of View on Wax & Wit Gift Baskets",
        "url": "https://www.amazon.com/vdp/0104db69230f467e90f7897d6f8f506b?ref=dp_vse_rvc_1",
        "user_id": "/shop/influencer-20a38664"
      },
      {
        "title": "Our Point of View on Wax & Wit Spa Gifts",
        "url": "https://www.amazon.com/vdp/04ecd28c7a72491791c661313d368287?ref=dp_vse_rvc_2",
        "user_id": "/shop/influencer-20a38664"
      },
      {
        "title": "Our POV on Wax & Wit \"I Love You More\" Gift Set",
        "url": "https://www.amazon.com/vdp/006de9d112164ecdad9445efbd6b8354?ref=dp_vse_rvc_3",
        "user_id": "/shop/influencer-20a38664"
      },
      {
        "title": "Birthday Spa Care Package ",
        "url": "https://www.amazon.com/vdp/00d28d0b4da040d98c984bb003efac92?ref=dp_vse_rvc_4",
        "user_id": ""
      },
      {
        "title": "Self Care Gift Basket for Mom. New Mommy Care Package.",
        "url": "https://www.amazon.com/vdp/012bbfe4a429441e9abc1d1e26720142?ref=dp_vse_rvc_5",
        "user_id": ""
      }
    ],
    "store": "WAX & WIT",
    "categories": [],
    "details": {
      "Package Dimensions": "10.63 x 7.44 x 4.49 inches; 3.59 Pounds",
      "Manufacturer": "WAX & WIT",
      "Country of Origin": "USA"
    },
    "bought_together": null
  }
}