{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Iris Korean Tv Drama Dvd English Subtitle NTSC All Region (Complete Series , 20 Episodes 6 Dvd Boxset)\nReview Date: 2014/01/21\nStore: Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Starring: Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo & Kim So Yun Language: Korean Subtitle: English & Chinese Picture Format: NTSC - All Region No. of Disc: 6 Publisher: PK Entertainment (Singapore) Story line: 2009 Release - Kim Hyun Joon is an assassin who belongs to a top secret organization known as the NSS\\x9d whereas T.O.P is an assassin who works in another secret organization located in the United States called IRIS\\x9d and was ordered to kill Hyun Joon. Seung Hee is a psychological analyst who plays an important role in bring Hyun Joon into the NSS.\\x9d Jin Sa Woo is Hyun Joon's colleague and falls in love with Seung Hee as well but keeps this to himself.\"]\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Drama', 'Format': 'Import', 'Contributor': 'Lee Byung Hun, Kim So Yun, Jung Joon Ho, Kim Tae Hee, Kim Seung Woo', 'Language': 'Korean', 'Runtime': '10 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.5 x 5.5 x 0.8 inches; 0.01 Ounces', 'Media Format': 'Import', 'Run time': '10 minutes', 'Actors': 'Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo, Kim So Yun', 'Subtitles': 'English, Chinese'}\nReview Text: I'm not one for foreign dramas (I'm way too lazy to read subtitles) but I will admit I watched most of this just for T.O.P. What I got from it, other than an awesome plot, is a crazy love for Lee Byung Hun. He's such an amazing actor and I never pass up the chance to see him in anything now. If you're going to watch it, watch it for him, or the fact that the plot is fantastic because you won't see T.O.P much. It's totally worth it though, great drama!\nReview Title: Love this series!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Seinfeld: The Complete Series [DVD]\nJerry Seinfeld  (Actor, Writer),     Julia Louis-Dreyfus  (Actor),     Tom Cherones  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['No show captured the eccentricities of New York like the Larry David-created sitcom', 'Seinfeld', \". Helping to define America's view of New Yorkers, the series gained endless fans over its nine season run. Though it wasn't the first show to assert the rudeness of Gotham's citizens, its characters are selfish to a fault--not that there's anything wrong with that. Self-obsessed comedian Jerry Seinfeld is joined in the cast by his neurotic ex-girlfriend, Elaine (Julia Louis-Dreyfus); his chronically lazy pal, George (Jason Alexander); and Cosmo Kramer (Michael Richards), who takes the sitcom cliche of the weird neighbor to impressive new heights. Despite their faults (or perhaps because of them), they're some of the most hilariously watchable characters in television history. The entire series is presented here.\"]\n{'Genre': 'TV', 'Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Contributor': 'Ruth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz SheridanRuth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz Sheridan  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '33', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '11 x 7.5 x 3.75 inches; 5.88 Pounds', 'Director': 'Tom Cherones', 'Media Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Run time': '68 hours and 41 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander, Ruth Cohen', 'Subtitles': 'English, Spanish, French, Portuguese', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Jerry Seinfeld, Larry David', 'Number of discs': '33'}\nI've been watching this show for years and have still never seen every episode, so it was a must have for me. Currently the price for this box set is too high, but I was lucky enough to score it on a lightning deal which definitely made it worth it.<br /><br />This is the best made box set I have seen/own. Not only is it sturdy (And extremely heavy) it doesn't do like most collector's sets and give you a nice box and crappy DVD cases, or vice versa. It also comes with a book about the show. I can't wait until I have a chance to sit down and watch the entire series!\nA must for Seinfeld fans!\nThe Sorcerer's Apprentice (Two-Disc Blu-ray / DVD Combo)\nNicolas Cage  (Actor),     Alfred Molina  (Actor),     Jon Turteltaub  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Action/Adventure', 'Format': 'Blu-ray', 'Contributor': 'Nicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton ListNicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton List  See more', 'Language': 'English, Spanish, French', 'Runtime': '1 hour and 49 minutes'}\nBy general rule of thumb I avoid anything \"new\" Disney. I grew up on the classics and felt that anything new would be horrid (ie Little Mermaid 2, Lady and the Tramp 2, etc). Because of that it took me months to even entertain the idea of watching this.<br /><br />With the nonsense background aside, I am in love with this movie. I've had it about two weeks and I've watched it probably 4 times, if not more. I don't often find movies I enjoy this much and can stand to watch this often, but it's definitely one of them. It's a fantastic movie, with what I thought was a very good plot and cast. I definite must, especially if you enjoy Nicholas Cage.\nA great live action Disney!\nRob Dyrdek's Fantasy Factory: Season 5\nRob Dyrdek  (Actor),     Chris \"Drama\" Pfaff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Sports\n['The death-defying comedy genius of Rob Dyrdek reaches unprecedented levels of inspiration and laughter in the fifth season of Rob Dyrdeks Fantasy Factory, along with familiar faces Chris Drama Pfaff, Christopher Big Black Boykin, Scott The Big Cat Pfaff, Chanel West Coast, and his Ridiculousness co-host Sterling Steelo Brim. Dyrdek shocks the world in the Season 5 premier when he dubs himself \"Supersonic Rob\" and attempts a car stunt achieved by few men in daredevil history: The Corkscrew Flip -- a literal 360 degree \"kickflip\" car jump. Rob\\'s other adventures include: inviting Johnny Knoxville and Chris Pontius (Jackass) to train Drama in the fine art of getting \"mowed down\" by an angry bull, becoming an ordained minister in order to marry his sister to her boyfriend, and creating Dyrdek Day -- an official Los Angeles City-certified holiday celebrating kindness, hugs, and random charity toward everyone. Rob also reinvents his pop icon alter-ego Bobby Light as an overweight superstar named \"Blobby\" Light, emerging from retirement to record a new single with Big Black and company titled, Chunky as Charged -- a celebration of all big people. The adventure never seems to end for Rob and the Fantasy Factory cast. Season 5 proves that for every Fantasy, there is a hilarious episode of television behind it. Includes all 12 episodes, plus Deleted Scenes and the full Blobby Light music video for Chucky As Charged']\n{'Genre': 'Television/Reality Shows', 'Format': 'NTSC', 'Contributor': 'Sterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big BlackSterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big Black  See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 20, 2012', 'Actors': 'Rob Dyrdek, Chris \"Drama\" Pfaff, Big Black, Chanel West Coast, Scott \"Big Cat\" Pfaff', 'Studio': 'MTV Mod', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI don't usually find much on TV (much less MTV) that I want to waste time watching but MTV was marathoning this one day and I was almost in tears after two episodes. I immediately came on here and ordered all the seasons and have seen all of them. It's a silly but hilarious show and even my mom likes it--we're rewatching the seasons now and anytime my brothers are over, they're hooked too!\nGreat show\nIris Korean Tv Drama Dvd English Subtitle NTSC All Region (Complete Series , 20 Episodes 6 Dvd Boxset)\nRated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Starring: Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo & Kim So Yun Language: Korean Subtitle: English & Chinese Picture Format: NTSC - All Region No. of Disc: 6 Publisher: PK Entertainment (Singapore) Story line: 2009 Release - Kim Hyun Joon is an assassin who belongs to a top secret organization known as the NSS\\x9d whereas T.O.P is an assassin who works in another secret organization located in the United States called IRIS\\x9d and was ordered to kill Hyun Joon. Seung Hee is a psychological analyst who plays an important role in bring Hyun Joon into the NSS.\\x9d Jin Sa Woo is Hyun Joon's colleague and falls in love with Seung Hee as well but keeps this to himself.\"]\n{'Genre': 'Drama', 'Format': 'Import', 'Contributor': 'Lee Byung Hun, Kim So Yun, Jung Joon Ho, Kim Tae Hee, Kim Seung Woo', 'Language': 'Korean', 'Runtime': '10 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.5 x 5.5 x 0.8 inches; 0.01 Ounces', 'Media Format': 'Import', 'Run time': '10 minutes', 'Actors': 'Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo, Kim So Yun', 'Subtitles': 'English, Chinese'}\nI'm not one for foreign dramas (I'm way too lazy to read subtitles) but I will admit I watched most of this just for T.O.P. What I got from it, other than an awesome plot, is a crazy love for Lee Byung Hun. He's such an amazing actor and I never pass up the chance to see him in anything now. If you're going to watch it, watch it for him, or the fact that the plot is fantastic because you won't see T.O.P much. It's totally worth it though, great drama!\nLove this series!",
  "profile": "**User Profile Summary:**\n\n- **Media Preference:** The user exhibits a strong interest in classic sitcoms and films, recently expanding into humorous reality shows and foreign dramas, particularly those with engaging narratives and emotional depth. Their appreciation for laughter and relatable moments persists across both classic and contemporary content.\n\n- **Format Preference:** The user prefers physical media such as DVD and Blu-ray collections, valuing high-quality packaging and compelling bonus features that enhance the viewing experience. They prioritize excellent audio and visual formats.\n\n- **Value Sensitivity:** While sensitive to pricing and keen on deals, the user is willing to invest in quality entertainment that offers significant enjoyment, especially when it involves nostalgia or humor.\n\n- **Viewing Habits:** An avid binge-watcher who revisits favorite films and series, the user enjoys dramas that combine humor and captivating storytelling. Their viewing portfolio is diverse, now including foreign and classic dramas among newer offerings.\n\n- **Reviewing Behavior:** Enthusiastic about sharing feedback, the user rates content highly when it resonates with their tastes. Reviews emphasize enjoyment, particularly regarding humor, relatability, and the quality of performances, reflecting strong engagement with the material.\n\nThe user's recent engagement with foreign dramas indicates an expanding appreciation for diverse storytelling, while still maintaining their nostalgic love for classic and comedic elements.",
  "metrics": {
    "rouge1_f": 0.10830324909747291,
    "rouge2_f": 0.009638554216867469,
    "rougeL_f": 0.056558363417569195,
    "meteor": 0.037553510942818606,
    "bleu1": 0.0006257077596506241,
    "bleu2": 0.00016928254240338716,
    "bleu3": 2.65998976121014e-05,
    "bleu4": 1.0554329556640853e-05,
    "bertscore_precision": 0.34730449318885803,
    "bertscore_recall": 0.4837627410888672,
    "bertscore_f1": 0.40433067083358765
  }
}