{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Jurassic World [Blu-ray]\nReview Date: 2016/01/31\nStore: Chris Pratt  (Actor),     Bryce Dallas Howard  (Actor),     Colin Trevorrow  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: [\"The Jurassic World theme park lets guests experience the thrill of witnessing actual dinosaurs, but something ferocious lurks behind the park's attractions – a genetically modified dinosaur with savage capabilities. When the massive creature escapes, chaos erupts across the island. Now it's up to Owen (Chris Pratt) and Claire (Bryce Dallas Howard) to save the park's tourists from an all-out prehistoric assault.Bonus Content:\", 'Includes a digital copy of Jurassic World (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Includes a digital copy of Jurassic World (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Deleted Scenes', 'Deleted Scenes', 'Chris & Colin Take on the World', 'Chris & Colin Take on the World', 'Welcome to Jurassic World', 'Welcome to Jurassic World', 'Dinosaurs Roam Once Again', 'Dinosaurs Roam Once Again', 'Jurassic World: All-Access Pass', 'Jurassic World: All-Access Pass', 'Innovation Center Tour with Chris Pratt', 'Innovation Center Tour with Chris Pratt', \"Jurassic's Closest Shaves – Presented by Barbasol®\", \"Jurassic's Closest Shaves – Presented by Barbasol®\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Jurassic Park Undiscovered, Science Fiction & Fantasy, Jurassic Park 4, DVD Movie, Monde Jurassique, Isla Nublar, Ebb Tide, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseJurassic Park Undiscovered, Science Fiction & Fantasy, Jurassic Park 4, DVD Movie, Monde Jurassique, Isla Nublar, Ebb Tide, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense   See more', 'Format': 'Blu-ray, Color, Widescreen', 'Contributor': \"Omar Sy, Nick Robinson, Colin Trevorrow, Frank Marshall, Rick Jaffa, Ty Simpkins, Patrick Crowley, Vincent D'Onofrio, Irrfan Khan, Derek Connolly, Amanda Silver, Bryce Dallas Howard, Chris Pratt, BD WongOmar Sy, Nick Robinson, Colin Trevorrow, Frank Marshall, Rick Jaffa, Ty Simpkins, Patrick Crowley, Vincent D'Onofrio, Irrfan Khan, Derek Connolly, Amanda Silver, Bryce Dallas Howard, Chris Pratt, BD Wong   See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (DTS 5.1), Spanish (DTS 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '2.20:1, 2:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7 x 5 x 0.5 inches; 3.2 Ounces', 'Item model number': '61129756', 'Director': 'Colin Trevorrow', 'Media Format': 'Blu-ray, Color, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 20, 2015', 'Actors': \"Chris Pratt, Bryce Dallas Howard, Vincent D'Onofrio, Ty Simpkins, Nick Robinson\", 'Subtitles': 'French, Spanish', 'Producers': 'Frank Marshall, Patrick Crowley', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Rick Jaffa, Amanda Silver, Derek Connolly, Colin Trevorrow', 'Number of discs': '2'}\nReview Text: My brother adores the jurassic park movies so this was a no brainer, and he loved it!\nReview Title: and he loved it!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Seinfeld: The Complete Series [DVD]\nJerry Seinfeld  (Actor, Writer),     Julia Louis-Dreyfus  (Actor),     Tom Cherones  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['No show captured the eccentricities of New York like the Larry David-created sitcom', 'Seinfeld', \". Helping to define America's view of New Yorkers, the series gained endless fans over its nine season run. Though it wasn't the first show to assert the rudeness of Gotham's citizens, its characters are selfish to a fault--not that there's anything wrong with that. Self-obsessed comedian Jerry Seinfeld is joined in the cast by his neurotic ex-girlfriend, Elaine (Julia Louis-Dreyfus); his chronically lazy pal, George (Jason Alexander); and Cosmo Kramer (Michael Richards), who takes the sitcom cliche of the weird neighbor to impressive new heights. Despite their faults (or perhaps because of them), they're some of the most hilariously watchable characters in television history. The entire series is presented here.\"]\n{'Genre': 'TV', 'Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Contributor': 'Ruth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz SheridanRuth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz Sheridan  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '33', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '11 x 7.5 x 3.75 inches; 5.88 Pounds', 'Director': 'Tom Cherones', 'Media Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Run time': '68 hours and 41 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander, Ruth Cohen', 'Subtitles': 'English, Spanish, French, Portuguese', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Jerry Seinfeld, Larry David', 'Number of discs': '33'}\nI've been watching this show for years and have still never seen every episode, so it was a must have for me. Currently the price for this box set is too high, but I was lucky enough to score it on a lightning deal which definitely made it worth it.<br /><br />This is the best made box set I have seen/own. Not only is it sturdy (And extremely heavy) it doesn't do like most collector's sets and give you a nice box and crappy DVD cases, or vice versa. It also comes with a book about the show. I can't wait until I have a chance to sit down and watch the entire series!\nA must for Seinfeld fans!\nThe Sorcerer's Apprentice (Two-Disc Blu-ray / DVD Combo)\nNicolas Cage  (Actor),     Alfred Molina  (Actor),     Jon Turteltaub  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Action/Adventure', 'Format': 'Blu-ray', 'Contributor': 'Nicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton ListNicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton List  See more', 'Language': 'English, Spanish, French', 'Runtime': '1 hour and 49 minutes'}\nBy general rule of thumb I avoid anything \"new\" Disney. I grew up on the classics and felt that anything new would be horrid (ie Little Mermaid 2, Lady and the Tramp 2, etc). Because of that it took me months to even entertain the idea of watching this.<br /><br />With the nonsense background aside, I am in love with this movie. I've had it about two weeks and I've watched it probably 4 times, if not more. I don't often find movies I enjoy this much and can stand to watch this often, but it's definitely one of them. It's a fantastic movie, with what I thought was a very good plot and cast. I definite must, especially if you enjoy Nicholas Cage.\nA great live action Disney!\nRob Dyrdek's Fantasy Factory: Season 5\nRob Dyrdek  (Actor),     Chris \"Drama\" Pfaff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Sports\n['The death-defying comedy genius of Rob Dyrdek reaches unprecedented levels of inspiration and laughter in the fifth season of Rob Dyrdeks Fantasy Factory, along with familiar faces Chris Drama Pfaff, Christopher Big Black Boykin, Scott The Big Cat Pfaff, Chanel West Coast, and his Ridiculousness co-host Sterling Steelo Brim. Dyrdek shocks the world in the Season 5 premier when he dubs himself \"Supersonic Rob\" and attempts a car stunt achieved by few men in daredevil history: The Corkscrew Flip -- a literal 360 degree \"kickflip\" car jump. Rob\\'s other adventures include: inviting Johnny Knoxville and Chris Pontius (Jackass) to train Drama in the fine art of getting \"mowed down\" by an angry bull, becoming an ordained minister in order to marry his sister to her boyfriend, and creating Dyrdek Day -- an official Los Angeles City-certified holiday celebrating kindness, hugs, and random charity toward everyone. Rob also reinvents his pop icon alter-ego Bobby Light as an overweight superstar named \"Blobby\" Light, emerging from retirement to record a new single with Big Black and company titled, Chunky as Charged -- a celebration of all big people. The adventure never seems to end for Rob and the Fantasy Factory cast. Season 5 proves that for every Fantasy, there is a hilarious episode of television behind it. Includes all 12 episodes, plus Deleted Scenes and the full Blobby Light music video for Chucky As Charged']\n{'Genre': 'Television/Reality Shows', 'Format': 'NTSC', 'Contributor': 'Sterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big BlackSterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big Black  See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 20, 2012', 'Actors': 'Rob Dyrdek, Chris \"Drama\" Pfaff, Big Black, Chanel West Coast, Scott \"Big Cat\" Pfaff', 'Studio': 'MTV Mod', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI don't usually find much on TV (much less MTV) that I want to waste time watching but MTV was marathoning this one day and I was almost in tears after two episodes. I immediately came on here and ordered all the seasons and have seen all of them. It's a silly but hilarious show and even my mom likes it--we're rewatching the seasons now and anytime my brothers are over, they're hooked too!\nGreat show\nIris Korean Tv Drama Dvd English Subtitle NTSC All Region (Complete Series , 20 Episodes 6 Dvd Boxset)\nRated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Starring: Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo & Kim So Yun Language: Korean Subtitle: English & Chinese Picture Format: NTSC - All Region No. of Disc: 6 Publisher: PK Entertainment (Singapore) Story line: 2009 Release - Kim Hyun Joon is an assassin who belongs to a top secret organization known as the NSS\\x9d whereas T.O.P is an assassin who works in another secret organization located in the United States called IRIS\\x9d and was ordered to kill Hyun Joon. Seung Hee is a psychological analyst who plays an important role in bring Hyun Joon into the NSS.\\x9d Jin Sa Woo is Hyun Joon's colleague and falls in love with Seung Hee as well but keeps this to himself.\"]\n{'Genre': 'Drama', 'Format': 'Import', 'Contributor': 'Lee Byung Hun, Kim So Yun, Jung Joon Ho, Kim Tae Hee, Kim Seung Woo', 'Language': 'Korean', 'Runtime': '10 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.5 x 5.5 x 0.8 inches; 0.01 Ounces', 'Media Format': 'Import', 'Run time': '10 minutes', 'Actors': 'Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo, Kim So Yun', 'Subtitles': 'English, Chinese'}\nI'm not one for foreign dramas (I'm way too lazy to read subtitles) but I will admit I watched most of this just for T.O.P. What I got from it, other than an awesome plot, is a crazy love for Lee Byung Hun. He's such an amazing actor and I never pass up the chance to see him in anything now. If you're going to watch it, watch it for him, or the fact that the plot is fantastic because you won't see T.O.P much. It's totally worth it though, great drama!\nLove this series!\nJay Park Concert: Live in Seoul\nFormat: DVD\nMovies & TV, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.56 x 5.51 x 0.87 inches; 11.99 Ounces', 'Media Format': 'Multiple Formats, Import, NTSC', 'Release date': 'May 7, 2013', 'Actors': 'Park, Jay', 'Studio': 'Ais', 'Number of discs': '2'}\nNot only do I have a copy of this for myself, but I also got one for my friend who tries to refute her love for Jay Park and loses at every turn. I do wish it were longer and the songs are all chopped together which is relatively annoying--I hate when a song I love comes on and oh hey sorry, it's over. If he had other concert DVDs out I probably would've chosen one of those over this due to that, but as it is, he doesn't. It's worth the purchase if you're a Jay Park fan.\nShe Loved It!\nFuturama: The Complete Series\nBilly West  (Actor),     Katey Sagal  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['As vast and hilarious as the universe itself, behold the utterly complete collection of FUTURAMA, the gravity defying, Emmy Award winning animated series from The Simpsons creator Matt Groening. Here you ll find all 124 outrageous episodes, plus 4 feature length epic adventures and enough DVD extras to last you until the next millennium. It doesn t get any completer than this, folks!']\n{'Genre': 'Comedy/Television, Animation/Television', 'Format': 'Color, Dolby, Box set, NTSC, Animated', 'Contributor': 'David Herman, John DiMaggio, Maurice LaMarche, Billy West, Katey Sagal, Tress MacNeille, Phil LaMarr, Lauren TomDavid Herman, John DiMaggio, Maurice LaMarche, Billy West, Katey Sagal, Tress MacNeille, Phil LaMarr, Lauren Tom  See more', 'Language': 'English', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.17 Pounds', 'Media Format': 'Color, Dolby, Box set, NTSC, Animated', 'Release date': 'December 10, 2013', 'Actors': 'Billy West, Katey Sagal, John DiMaggio, Tress MacNeille, Phil LaMarr', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '8'}\nA lot of the reviews are being marked down due to packaging/features. I don't personally buy box sets for extra features/just because it's a collector's item or pretty. I just like being able to get everything in a series for a decent price and that was definitely accomplished with this box set. I'll probably end up taking the cases out of the large box anyways as our movie shelf isn't built for the dimensions of the series box.\nGreat show!\nSherlock: Season 3\nBenedict Cumberbatch  (Actor),     Martin Freeman  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n['Sherlock: Season Three (BBC/DVD)', 'The question on everyone’s lips is finally answered as the hugely popular Sherlock returns in three brand new action-packed adventures. With the demise of Moriarty, Sherlock finds himself locked in another mind battle with the powerful Charles Augustus Magnussen, who is holding the secrets of the world at his fingertips. Once again, the game is on for Sherlock and John in “The Empty Hearse,” “The Sign of Three” and finally, “His Last Vow.”', ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Martin Freeman, Benedict Cumberbatch', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'BBCW1000418285DVD', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '4 hours and 22 minutes', 'Release date': 'February 11, 2014', 'Actors': 'Benedict Cumberbatch, Martin Freeman', 'Studio': 'BBC Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nWhen I first heard of the show I was offended that a &#34;season&#34; consisted of 3 episodes. Months later, I'm just waiting for the next one. I have a mile long list of BBC shows I love but this one tops it. It's witty, challenging, and all around great. Definitely worth watching!!\nAMAZING.\nWhite House Down (Two Disc Combo: Blu-ray / DVD)\nChanning Tatum  (Actor),     Jamie Foxx  (Actor),     Roland Emmerich  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"Capitol Policeman John Cale (Channing Tatum) has just been denied his dream job with the Secret Service of protecting President James Sawyer (Jamie Foxx). Not wanting to let down his little girl with the news, he takes her on a tour of the White House, when the complex is overtaken by a heavily armed paramilitary group. Now, with the nation’s government falling into chaos and time running out, it's up to Cale to save the president, his daughter, and the country.\"]\n{'Genre': 'Action, Thriller', 'Format': 'Blu-ray, Digital_copy, Ultraviolet, Ultraviolet', 'Contributor': 'Harald Kloser, Matt Craven, Kevin Rankin, Channing Tatum, Michael Murphy, James Woods, Peter Jacobson, Garcelle Beauvais, Maggie Gyllenhaal, Richard Jenkins, Bradley Fischer, Laeta Kalogridis, Joey King, Columbia Pictures, Jamie Foxx, Jake Weber, Rachelle Lefevre, Larry Franco, Falk Hentschel, Jason Clarke, James Vanderbilt, Lance Reddick, Barbara Williams, Jimmi Simpson, Roland Emmerich, Nicolas WrightHarald Kloser, Matt Craven, Kevin Rankin, Channing Tatum, Michael Murphy, James Woods, Peter Jacobson, Garcelle Beauvais, Maggie Gyllenhaal, Richard Jenkins, Bradley Fischer, Laeta Kalogridis, Joey King, Columbia Pictures, Jamie Foxx, Jake Weber, Rachelle Lefevre, Larry Fr…   See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '2 hours and 12 minutes', 'Digital Copy Expiration Date': 'December 31, 2016', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.7 inches; 3.84 Ounces', 'Item model number': '27724607', 'Director': 'Roland Emmerich', 'Media Format': 'Blu-ray, Digital_copy, Ultraviolet, Ultraviolet', 'Run time': '2 hours and 12 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Channing Tatum, Jamie Foxx, Maggie Gyllenhaal, Jason Clarke, Richard Jenkins', 'Dubbed': 'Thai, French, Portuguese, Spanish', 'Subtitles': 'English', 'Producers': 'Laeta Kalogridis, Bradley Fischer, Harald Kloser, James Vanderbilt, Larry Franco', 'Studio': 'Sony Pictures Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nIt's been a long time since I've seen an action movie that held my attention from start to finish. Usually I need to watch something two or three times to really appreciate it but not this movie. No, I watched this movie in one sitting and as soon as it was over, wanted to watch it AGAIN! I don't know what it is, but it was just amazing. Everyone I've recommended it to has loved it as well!\nLove it!\nChristmas with the Kranks\nTim Allen  (Actor),     Jamie Lee Curtis  (Actor),     Joe Roth  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['When their only daughter Blair leaves the family nest, Luther and Nora Krank (Tim Allen and Jamie Lee Curtis) decide to book an island cruise to beat the yuletide blues and just skip the holidays. But their decision to boycott tradition has the whole neighborhood in an uproar, and when Blair callson Christmas Eve to announce a surprise visit with her new fiancée, the Kranks have just twelve hours to perform a miracle and pull themselves and their neighbors together to throw the best celebration ever! With fast-paced energy and support from Dan Aykroyd, Cheech Marin, Jake Busey and M. EmmetWalsh, this hilarious adaptation of John Grisham\\'s best-selling novel, \"Skipping Christmas\" has become \"an instant family classic!\" (Gorman Woodfin, CBN)']\n{'Genre': 'Drama, Family', 'Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Dan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe RothDan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe Roth  See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1, 2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.25 x 7.55 inches; 2.4 Ounces', 'Item model number': '2226145', 'Director': 'Joe Roth', 'Media Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Tim Allen, Jamie Lee Curtis, Dan Aykroyd, Cheech Marin', 'Dubbed': 'French', 'Subtitles': 'English, French, Mandarin Chinese, Thai', 'Producers': 'Chris Columbus, Michael Barnathan, Mark Radcliffe', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis movie is by far in my top five favorite Christmas movies. It's goofy sad, and in a weird way, shows family values by the end. If you like Tim Allen (I just mean in general, don't base it on Home Improvement..can't stand that show) then this is a shoe in. It's really cute and it's my go to every single time I start my Christmas baking!\nThis movie is by far in my top five favorite Christmas movies\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dax Rhorer', 'Bry Thomas Sanders', 'Nancy Huffman'], 'Producers': ['Luke Wanagel', 'Megan Estrada', 'R.J. Bain', 'Chris Lehman', 'Tori Davis', 'Carey Mandelker', 'LeDerek John Rocque'], 'Studio': ['A&E Television Networks']}\nI absolutely love this show. On one hand some of the dancing seemed kind of provocative for their age group, but on the other their coach kept it classy. Pair that with her need for perfection and her occasionally shown soft side, it really is a great show. It's great getting to see the girls mature and become better in every episode.\nI absolutely love this show\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Stone', 'Emily Squires', 'Lisa Simon', 'Robert Myhrum', 'Ted May', 'Ken Diego', 'Victor DiNapoli', 'Kevin Clash', 'Jim Martin', 'Benjamin Lehmann'], 'Studio': ['PBS']}\nThis show saws at my sanity, but it keeps our baby happy and teaches him with every episode\nbut it keeps our baby happy and teaches him with every\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nMy favorite movie of all time! Definitely worth seeing, especially if you like to watch some of the older christmas movies during the holidays. I had just seen this for the first time 2 or 3 years ago and have watched it obsessively since. Chevy Chase in his normal style of humor\nMy favorite movie of all time\nJurassic World [Blu-ray]\nChris Pratt  (Actor),     Bryce Dallas Howard  (Actor),     Colin Trevorrow  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"The Jurassic World theme park lets guests experience the thrill of witnessing actual dinosaurs, but something ferocious lurks behind the park's attractions – a genetically modified dinosaur with savage capabilities. When the massive creature escapes, chaos erupts across the island. Now it's up to Owen (Chris Pratt) and Claire (Bryce Dallas Howard) to save the park's tourists from an all-out prehistoric assault.Bonus Content:\", 'Includes a digital copy of Jurassic World (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Includes a digital copy of Jurassic World (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Deleted Scenes', 'Deleted Scenes', 'Chris & Colin Take on the World', 'Chris & Colin Take on the World', 'Welcome to Jurassic World', 'Welcome to Jurassic World', 'Dinosaurs Roam Once Again', 'Dinosaurs Roam Once Again', 'Jurassic World: All-Access Pass', 'Jurassic World: All-Access Pass', 'Innovation Center Tour with Chris Pratt', 'Innovation Center Tour with Chris Pratt', \"Jurassic's Closest Shaves – Presented by Barbasol®\", \"Jurassic's Closest Shaves – Presented by Barbasol®\"]\n{'Genre': 'Jurassic Park Undiscovered, Science Fiction & Fantasy, Jurassic Park 4, DVD Movie, Monde Jurassique, Isla Nublar, Ebb Tide, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseJurassic Park Undiscovered, Science Fiction & Fantasy, Jurassic Park 4, DVD Movie, Monde Jurassique, Isla Nublar, Ebb Tide, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense   See more', 'Format': 'Blu-ray, Color, Widescreen', 'Contributor': \"Omar Sy, Nick Robinson, Colin Trevorrow, Frank Marshall, Rick Jaffa, Ty Simpkins, Patrick Crowley, Vincent D'Onofrio, Irrfan Khan, Derek Connolly, Amanda Silver, Bryce Dallas Howard, Chris Pratt, BD WongOmar Sy, Nick Robinson, Colin Trevorrow, Frank Marshall, Rick Jaffa, Ty Simpkins, Patrick Crowley, Vincent D'Onofrio, Irrfan Khan, Derek Connolly, Amanda Silver, Bryce Dallas Howard, Chris Pratt, BD Wong   See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (DTS 5.1), Spanish (DTS 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '2.20:1, 2:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7 x 5 x 0.5 inches; 3.2 Ounces', 'Item model number': '61129756', 'Director': 'Colin Trevorrow', 'Media Format': 'Blu-ray, Color, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 20, 2015', 'Actors': \"Chris Pratt, Bryce Dallas Howard, Vincent D'Onofrio, Ty Simpkins, Nick Robinson\", 'Subtitles': 'French, Spanish', 'Producers': 'Frank Marshall, Patrick Crowley', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Rick Jaffa, Amanda Silver, Derek Connolly, Colin Trevorrow', 'Number of discs': '2'}\nMy brother adores the jurassic park movies so this was a no brainer, and he loved it!\nand he loved it!",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preference:** The user has a strong affinity for classic sitcoms, humorous reality shows, foreign dramas, animated series with comedic elements, and recently, action-packed films, reflecting a broad taste in entertaining content. Their enduring love for cozy, feel-good movies is emphasized during the holiday season. The recent focus on blockbuster titles also indicates an openness to genre diversity, especially in family-friendly entertainment.\n\n- **Format Preference:** They prefer physical media, particularly valuing Blu-ray for its high-quality audio and video presentations, alongside complete box sets. The aesthetic appeal of packaging remains important in their acquisitions.\n\n- **Value Sensitivity:** The user is sensitive to pricing but willing to invest in quality content that delivers enjoyment and nostalgia, often preferring titles with strong storytelling and character development, particularly those with high ratings.\n\n- **Viewing Habits:** As a binge-watcher, they tend to revisit content that balances humor with heartwarming narratives. Their viewing habits indicate a preference for relatable and enriching storytelling suitable for family enjoyment, now expanding to include more adventure-oriented themes.\n\n- **Reviewing Behavior:** The user actively shares feedback reflecting their enjoyment and appreciation for media, emphasizing humor, relatability, and educational value. Their recent positive review reinforces their commitment to family-oriented material that fosters emotional connections and engagement for younger viewers while showcasing a growing interest in action-adventure films.",
  "metrics": {
    "rouge1_f": 0.06291222729578894,
    "rouge2_f": 0.005583756345177665,
    "rougeL_f": 0.0319634703196347,
    "meteor": 0.017843115558549626,
    "bleu1": 6.725250684276949e-09,
    "bleu2": 2.0314094959603634e-09,
    "bleu3": 2.8480987700976996e-10,
    "bleu4": 1.067405319982324e-10,
    "bertscore_precision": 0.34880149364471436,
    "bertscore_recall": 0.5139768719673157,
    "bertscore_f1": 0.41557809710502625
  }
}