{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Futurama: The Complete Series\nReview Date: 2014/02/22\nStore: Billy West  (Actor),     Katey Sagal  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['As vast and hilarious as the universe itself, behold the utterly complete collection of FUTURAMA, the gravity defying, Emmy Award winning animated series from The Simpsons creator Matt Groening. Here you ll find all 124 outrageous episodes, plus 4 feature length epic adventures and enough DVD extras to last you until the next millennium. It doesn t get any completer than this, folks!']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Television, Animation/Television', 'Format': 'Color, Dolby, Box set, NTSC, Animated', 'Contributor': 'David Herman, John DiMaggio, Maurice LaMarche, Billy West, Katey Sagal, Tress MacNeille, Phil LaMarr, Lauren TomDavid Herman, John DiMaggio, Maurice LaMarche, Billy West, Katey Sagal, Tress MacNeille, Phil LaMarr, Lauren Tom  See more', 'Language': 'English', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.17 Pounds', 'Media Format': 'Color, Dolby, Box set, NTSC, Animated', 'Release date': 'December 10, 2013', 'Actors': 'Billy West, Katey Sagal, John DiMaggio, Tress MacNeille, Phil LaMarr', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '8'}\nReview Text: A lot of the reviews are being marked down due to packaging/features. I don't personally buy box sets for extra features/just because it's a collector's item or pretty. I just like being able to get everything in a series for a decent price and that was definitely accomplished with this box set. I'll probably end up taking the cases out of the large box anyways as our movie shelf isn't built for the dimensions of the series box.\nReview Title: Great show!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Seinfeld: The Complete Series [DVD]\nJerry Seinfeld  (Actor, Writer),     Julia Louis-Dreyfus  (Actor),     Tom Cherones  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['No show captured the eccentricities of New York like the Larry David-created sitcom', 'Seinfeld', \". Helping to define America's view of New Yorkers, the series gained endless fans over its nine season run. Though it wasn't the first show to assert the rudeness of Gotham's citizens, its characters are selfish to a fault--not that there's anything wrong with that. Self-obsessed comedian Jerry Seinfeld is joined in the cast by his neurotic ex-girlfriend, Elaine (Julia Louis-Dreyfus); his chronically lazy pal, George (Jason Alexander); and Cosmo Kramer (Michael Richards), who takes the sitcom cliche of the weird neighbor to impressive new heights. Despite their faults (or perhaps because of them), they're some of the most hilariously watchable characters in television history. The entire series is presented here.\"]\n{'Genre': 'TV', 'Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Contributor': 'Ruth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz SheridanRuth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz Sheridan  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '33', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '11 x 7.5 x 3.75 inches; 5.88 Pounds', 'Director': 'Tom Cherones', 'Media Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Run time': '68 hours and 41 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander, Ruth Cohen', 'Subtitles': 'English, Spanish, French, Portuguese', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Jerry Seinfeld, Larry David', 'Number of discs': '33'}\nI've been watching this show for years and have still never seen every episode, so it was a must have for me. Currently the price for this box set is too high, but I was lucky enough to score it on a lightning deal which definitely made it worth it.<br /><br />This is the best made box set I have seen/own. Not only is it sturdy (And extremely heavy) it doesn't do like most collector's sets and give you a nice box and crappy DVD cases, or vice versa. It also comes with a book about the show. I can't wait until I have a chance to sit down and watch the entire series!\nA must for Seinfeld fans!\nThe Sorcerer's Apprentice (Two-Disc Blu-ray / DVD Combo)\nNicolas Cage  (Actor),     Alfred Molina  (Actor),     Jon Turteltaub  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Action/Adventure', 'Format': 'Blu-ray', 'Contributor': 'Nicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton ListNicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton List  See more', 'Language': 'English, Spanish, French', 'Runtime': '1 hour and 49 minutes'}\nBy general rule of thumb I avoid anything \"new\" Disney. I grew up on the classics and felt that anything new would be horrid (ie Little Mermaid 2, Lady and the Tramp 2, etc). Because of that it took me months to even entertain the idea of watching this.<br /><br />With the nonsense background aside, I am in love with this movie. I've had it about two weeks and I've watched it probably 4 times, if not more. I don't often find movies I enjoy this much and can stand to watch this often, but it's definitely one of them. It's a fantastic movie, with what I thought was a very good plot and cast. I definite must, especially if you enjoy Nicholas Cage.\nA great live action Disney!\nRob Dyrdek's Fantasy Factory: Season 5\nRob Dyrdek  (Actor),     Chris \"Drama\" Pfaff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Sports\n['The death-defying comedy genius of Rob Dyrdek reaches unprecedented levels of inspiration and laughter in the fifth season of Rob Dyrdeks Fantasy Factory, along with familiar faces Chris Drama Pfaff, Christopher Big Black Boykin, Scott The Big Cat Pfaff, Chanel West Coast, and his Ridiculousness co-host Sterling Steelo Brim. Dyrdek shocks the world in the Season 5 premier when he dubs himself \"Supersonic Rob\" and attempts a car stunt achieved by few men in daredevil history: The Corkscrew Flip -- a literal 360 degree \"kickflip\" car jump. Rob\\'s other adventures include: inviting Johnny Knoxville and Chris Pontius (Jackass) to train Drama in the fine art of getting \"mowed down\" by an angry bull, becoming an ordained minister in order to marry his sister to her boyfriend, and creating Dyrdek Day -- an official Los Angeles City-certified holiday celebrating kindness, hugs, and random charity toward everyone. Rob also reinvents his pop icon alter-ego Bobby Light as an overweight superstar named \"Blobby\" Light, emerging from retirement to record a new single with Big Black and company titled, Chunky as Charged -- a celebration of all big people. The adventure never seems to end for Rob and the Fantasy Factory cast. Season 5 proves that for every Fantasy, there is a hilarious episode of television behind it. Includes all 12 episodes, plus Deleted Scenes and the full Blobby Light music video for Chucky As Charged']\n{'Genre': 'Television/Reality Shows', 'Format': 'NTSC', 'Contributor': 'Sterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big BlackSterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big Black  See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 20, 2012', 'Actors': 'Rob Dyrdek, Chris \"Drama\" Pfaff, Big Black, Chanel West Coast, Scott \"Big Cat\" Pfaff', 'Studio': 'MTV Mod', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI don't usually find much on TV (much less MTV) that I want to waste time watching but MTV was marathoning this one day and I was almost in tears after two episodes. I immediately came on here and ordered all the seasons and have seen all of them. It's a silly but hilarious show and even my mom likes it--we're rewatching the seasons now and anytime my brothers are over, they're hooked too!\nGreat show\nIris Korean Tv Drama Dvd English Subtitle NTSC All Region (Complete Series , 20 Episodes 6 Dvd Boxset)\nRated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Starring: Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo & Kim So Yun Language: Korean Subtitle: English & Chinese Picture Format: NTSC - All Region No. of Disc: 6 Publisher: PK Entertainment (Singapore) Story line: 2009 Release - Kim Hyun Joon is an assassin who belongs to a top secret organization known as the NSS\\x9d whereas T.O.P is an assassin who works in another secret organization located in the United States called IRIS\\x9d and was ordered to kill Hyun Joon. Seung Hee is a psychological analyst who plays an important role in bring Hyun Joon into the NSS.\\x9d Jin Sa Woo is Hyun Joon's colleague and falls in love with Seung Hee as well but keeps this to himself.\"]\n{'Genre': 'Drama', 'Format': 'Import', 'Contributor': 'Lee Byung Hun, Kim So Yun, Jung Joon Ho, Kim Tae Hee, Kim Seung Woo', 'Language': 'Korean', 'Runtime': '10 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.5 x 5.5 x 0.8 inches; 0.01 Ounces', 'Media Format': 'Import', 'Run time': '10 minutes', 'Actors': 'Lee Byung Hun, Kim Tae Hee, Jung Joon Ho, Kim Seung Woo, Kim So Yun', 'Subtitles': 'English, Chinese'}\nI'm not one for foreign dramas (I'm way too lazy to read subtitles) but I will admit I watched most of this just for T.O.P. What I got from it, other than an awesome plot, is a crazy love for Lee Byung Hun. He's such an amazing actor and I never pass up the chance to see him in anything now. If you're going to watch it, watch it for him, or the fact that the plot is fantastic because you won't see T.O.P much. It's totally worth it though, great drama!\nLove this series!\nJay Park Concert: Live in Seoul\nFormat: DVD\nMovies & TV, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.56 x 5.51 x 0.87 inches; 11.99 Ounces', 'Media Format': 'Multiple Formats, Import, NTSC', 'Release date': 'May 7, 2013', 'Actors': 'Park, Jay', 'Studio': 'Ais', 'Number of discs': '2'}\nNot only do I have a copy of this for myself, but I also got one for my friend who tries to refute her love for Jay Park and loses at every turn. I do wish it were longer and the songs are all chopped together which is relatively annoying--I hate when a song I love comes on and oh hey sorry, it's over. If he had other concert DVDs out I probably would've chosen one of those over this due to that, but as it is, he doesn't. It's worth the purchase if you're a Jay Park fan.\nShe Loved It!\nFuturama: The Complete Series\nBilly West  (Actor),     Katey Sagal  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['As vast and hilarious as the universe itself, behold the utterly complete collection of FUTURAMA, the gravity defying, Emmy Award winning animated series from The Simpsons creator Matt Groening. Here you ll find all 124 outrageous episodes, plus 4 feature length epic adventures and enough DVD extras to last you until the next millennium. It doesn t get any completer than this, folks!']\n{'Genre': 'Comedy/Television, Animation/Television', 'Format': 'Color, Dolby, Box set, NTSC, Animated', 'Contributor': 'David Herman, John DiMaggio, Maurice LaMarche, Billy West, Katey Sagal, Tress MacNeille, Phil LaMarr, Lauren TomDavid Herman, John DiMaggio, Maurice LaMarche, Billy West, Katey Sagal, Tress MacNeille, Phil LaMarr, Lauren Tom  See more', 'Language': 'English', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.17 Pounds', 'Media Format': 'Color, Dolby, Box set, NTSC, Animated', 'Release date': 'December 10, 2013', 'Actors': 'Billy West, Katey Sagal, John DiMaggio, Tress MacNeille, Phil LaMarr', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '8'}\nA lot of the reviews are being marked down due to packaging/features. I don't personally buy box sets for extra features/just because it's a collector's item or pretty. I just like being able to get everything in a series for a decent price and that was definitely accomplished with this box set. I'll probably end up taking the cases out of the large box anyways as our movie shelf isn't built for the dimensions of the series box.\nGreat show!",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preference:** The user continues to have a strong interest in classic sitcoms, films, humorous reality shows, and foreign dramas, maintaining their appreciation for engaging narratives, emotional depth, and humor. Their recent activities show a fondness for animated series, particularly those with a comedic edge, further diversifying their media interests.\n\n- **Format Preference:** The user prefers physical media, particularly valuing comprehensive box sets that include entire series without a strong emphasis on bonus features. They appreciate the practicality of packaging that fits well on their shelves, while still ensuring that the media is presented in high-quality audio and visual formats.\n\n- **Value Sensitivity:** The user remains sensitive to pricing, demonstrating a willingness to invest in quality entertainment that delivers enjoyment and nostalgia. Their purchasing decisions reflect an inclination towards obtaining complete series at a reasonable price.\n\n- **Viewing Habits:** A binge-watcher, the user enjoys revisiting a wide range of content. Their portfolio includes animated series, classic sitcoms, and dramas, particularly those that balance humor with strong storytelling.\n\n- **Reviewing Behavior:** They share their feedback enthusiastically, often emphasizing overall enjoyment over packaging and extra features. Their reviews consistently highlight humor, relatability, and enjoyment from a variety of media, including animated titles, showcasing their engagement with content that resonates with their tastes.",
  "metrics": {
    "rouge1_f": 0.09820585457979225,
    "rouge2_f": 0.011342155009451793,
    "rougeL_f": 0.04815864022662889,
    "meteor": 0.030917210580556506,
    "bleu1": 0.00010139831903047842,
    "bleu2": 3.325090212446553e-05,
    "bleu3": 4.654394759025078e-06,
    "bleu4": 1.7429765404836748e-06,
    "bertscore_precision": 0.3501356542110443,
    "bertscore_recall": 0.4976420998573303,
    "bertscore_f1": 0.41105642914772034
  }
}