{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Rob Dyrdek's Fantasy Factory: Season 5\nReview Date: 2013/05/16\nStore: Rob Dyrdek  (Actor),     Chris \"Drama\" Pfaff  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Sports\nProduct Description: ['The death-defying comedy genius of Rob Dyrdek reaches unprecedented levels of inspiration and laughter in the fifth season of Rob Dyrdeks Fantasy Factory, along with familiar faces Chris Drama Pfaff, Christopher Big Black Boykin, Scott The Big Cat Pfaff, Chanel West Coast, and his Ridiculousness co-host Sterling Steelo Brim. Dyrdek shocks the world in the Season 5 premier when he dubs himself \"Supersonic Rob\" and attempts a car stunt achieved by few men in daredevil history: The Corkscrew Flip -- a literal 360 degree \"kickflip\" car jump. Rob\\'s other adventures include: inviting Johnny Knoxville and Chris Pontius (Jackass) to train Drama in the fine art of getting \"mowed down\" by an angry bull, becoming an ordained minister in order to marry his sister to her boyfriend, and creating Dyrdek Day -- an official Los Angeles City-certified holiday celebrating kindness, hugs, and random charity toward everyone. Rob also reinvents his pop icon alter-ego Bobby Light as an overweight superstar named \"Blobby\" Light, emerging from retirement to record a new single with Big Black and company titled, Chunky as Charged -- a celebration of all big people. The adventure never seems to end for Rob and the Fantasy Factory cast. Season 5 proves that for every Fantasy, there is a hilarious episode of television behind it. Includes all 12 episodes, plus Deleted Scenes and the full Blobby Light music video for Chucky As Charged']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television/Reality Shows', 'Format': 'NTSC', 'Contributor': 'Sterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big BlackSterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big Black  See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 20, 2012', 'Actors': 'Rob Dyrdek, Chris \"Drama\" Pfaff, Big Black, Chanel West Coast, Scott \"Big Cat\" Pfaff', 'Studio': 'MTV Mod', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I don't usually find much on TV (much less MTV) that I want to waste time watching but MTV was marathoning this one day and I was almost in tears after two episodes. I immediately came on here and ordered all the seasons and have seen all of them. It's a silly but hilarious show and even my mom likes it--we're rewatching the seasons now and anytime my brothers are over, they're hooked too!\nReview Title: Great show\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Seinfeld: The Complete Series [DVD]\nJerry Seinfeld  (Actor, Writer),     Julia Louis-Dreyfus  (Actor),     Tom Cherones  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['No show captured the eccentricities of New York like the Larry David-created sitcom', 'Seinfeld', \". Helping to define America's view of New Yorkers, the series gained endless fans over its nine season run. Though it wasn't the first show to assert the rudeness of Gotham's citizens, its characters are selfish to a fault--not that there's anything wrong with that. Self-obsessed comedian Jerry Seinfeld is joined in the cast by his neurotic ex-girlfriend, Elaine (Julia Louis-Dreyfus); his chronically lazy pal, George (Jason Alexander); and Cosmo Kramer (Michael Richards), who takes the sitcom cliche of the weird neighbor to impressive new heights. Despite their faults (or perhaps because of them), they're some of the most hilariously watchable characters in television history. The entire series is presented here.\"]\n{'Genre': 'TV', 'Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Contributor': 'Ruth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz SheridanRuth Cohen, Michael Richards, Jerry Stiller, Estelle Harris, Heidi Swedberg, Julia Louis-Dreyfus, Larry David, Norman Brenner, Jason Alexander, Jerry Seinfeld, Wayne Knight, Tom Cherones, Liz Sheridan  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '33', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '11 x 7.5 x 3.75 inches; 5.88 Pounds', 'Director': 'Tom Cherones', 'Media Format': 'Box set, Closed-captioned, Color, DVD, Subtitled, NTSC', 'Run time': '68 hours and 41 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander, Ruth Cohen', 'Subtitles': 'English, Spanish, French, Portuguese', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Jerry Seinfeld, Larry David', 'Number of discs': '33'}\nI've been watching this show for years and have still never seen every episode, so it was a must have for me. Currently the price for this box set is too high, but I was lucky enough to score it on a lightning deal which definitely made it worth it.<br /><br />This is the best made box set I have seen/own. Not only is it sturdy (And extremely heavy) it doesn't do like most collector's sets and give you a nice box and crappy DVD cases, or vice versa. It also comes with a book about the show. I can't wait until I have a chance to sit down and watch the entire series!\nA must for Seinfeld fans!\nThe Sorcerer's Apprentice (Two-Disc Blu-ray / DVD Combo)\nNicolas Cage  (Actor),     Alfred Molina  (Actor),     Jon Turteltaub  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Action/Adventure', 'Format': 'Blu-ray', 'Contributor': 'Nicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton ListNicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton List  See more', 'Language': 'English, Spanish, French', 'Runtime': '1 hour and 49 minutes'}\nBy general rule of thumb I avoid anything \"new\" Disney. I grew up on the classics and felt that anything new would be horrid (ie Little Mermaid 2, Lady and the Tramp 2, etc). Because of that it took me months to even entertain the idea of watching this.<br /><br />With the nonsense background aside, I am in love with this movie. I've had it about two weeks and I've watched it probably 4 times, if not more. I don't often find movies I enjoy this much and can stand to watch this often, but it's definitely one of them. It's a fantastic movie, with what I thought was a very good plot and cast. I definite must, especially if you enjoy Nicholas Cage.\nA great live action Disney!\nRob Dyrdek's Fantasy Factory: Season 5\nRob Dyrdek  (Actor),     Chris \"Drama\" Pfaff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Sports\n['The death-defying comedy genius of Rob Dyrdek reaches unprecedented levels of inspiration and laughter in the fifth season of Rob Dyrdeks Fantasy Factory, along with familiar faces Chris Drama Pfaff, Christopher Big Black Boykin, Scott The Big Cat Pfaff, Chanel West Coast, and his Ridiculousness co-host Sterling Steelo Brim. Dyrdek shocks the world in the Season 5 premier when he dubs himself \"Supersonic Rob\" and attempts a car stunt achieved by few men in daredevil history: The Corkscrew Flip -- a literal 360 degree \"kickflip\" car jump. Rob\\'s other adventures include: inviting Johnny Knoxville and Chris Pontius (Jackass) to train Drama in the fine art of getting \"mowed down\" by an angry bull, becoming an ordained minister in order to marry his sister to her boyfriend, and creating Dyrdek Day -- an official Los Angeles City-certified holiday celebrating kindness, hugs, and random charity toward everyone. Rob also reinvents his pop icon alter-ego Bobby Light as an overweight superstar named \"Blobby\" Light, emerging from retirement to record a new single with Big Black and company titled, Chunky as Charged -- a celebration of all big people. The adventure never seems to end for Rob and the Fantasy Factory cast. Season 5 proves that for every Fantasy, there is a hilarious episode of television behind it. Includes all 12 episodes, plus Deleted Scenes and the full Blobby Light music video for Chucky As Charged']\n{'Genre': 'Television/Reality Shows', 'Format': 'NTSC', 'Contributor': 'Sterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big BlackSterling \"Steelo\" Brim, Chanel West Coast, Chris \"Drama\" Pfaff, Scott \"Big Cat\" Pfaff, Rob Dyrdek, Big Black  See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'NTSC', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 20, 2012', 'Actors': 'Rob Dyrdek, Chris \"Drama\" Pfaff, Big Black, Chanel West Coast, Scott \"Big Cat\" Pfaff', 'Studio': 'MTV Mod', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI don't usually find much on TV (much less MTV) that I want to waste time watching but MTV was marathoning this one day and I was almost in tears after two episodes. I immediately came on here and ordered all the seasons and have seen all of them. It's a silly but hilarious show and even my mom likes it--we're rewatching the seasons now and anytime my brothers are over, they're hooked too!\nGreat show",
  "profile": "**User Profile Summary:**\n\n- **Media Preference:** Strong interest in classic sitcoms and films, with a recent expansion into humorous reality shows that blend comedy and cultural insights. The user enjoys classic narratives but is also captivated by engaging newer content that evokes laughter and relatable moments.\n\n- **Format Preference:** Preference for physical media, such as DVD and Blu-ray collections, with a focus on quality packaging and bonus features that enhance the viewing experience. The user values high-quality audio and visual formats.\n\n- **Value Sensitivity:** While price-sensitive and keen on deals, the user is willing to invest in quality entertainment that offers substantial enjoyment, particularly when it involves nostalgic or comedic elements.\n\n- **Viewing Habits:** Avid binge-watcher who revisits favorite films and series, enjoying shows that provide both humor and engaging narratives. The user showcases a diverse viewing portfolio, embracing both classic and newer offerings.\n\n- **Reviewing Behavior:** Enthusiastic in sharing feedback, often rating content highly when it resonates with personal tastes. Reviews typically emphasize enjoyment, especially in terms of humor and relatability, reflecting strong engagement with the material.\n\nOverall, this user now displays a wider range of comedic interests, remaining steadfast in their nostalgic tendencies while embracing humor found in contemporary reality programming, indicating a versatile engagement with both classic and new media.",
  "metrics": {
    "rouge1_f": 0.12912912912912913,
    "rouge2_f": 0.007518796992481203,
    "rougeL_f": 0.06156156156156156,
    "meteor": 0.04363505228993869,
    "bleu1": 0.003417042193097349,
    "bleu2": 0.0008470924483680565,
    "bleu3": 0.0001360988739337759,
    "bleu4": 5.460450033648516e-05,
    "bertscore_precision": 0.34407371282577515,
    "bertscore_recall": 0.4698251783847809,
    "bertscore_f1": 0.39723479747772217
  }
}