{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: History of Notre Dame Football\nReview Date: 2019/10/03\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['This DVD celebrates the winning tradition of the Notre Dame Fighting Irish spanning 11 National Championships, 7 Heisman trophy winners, 78 consensus All-Americans, legendary coaches and a unique game-day atmosphere. The DVD is packed with interviews from the most memorable players and coaches in Notre Dame history along with tons of bonus features.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Item model number': 'TMM-TM1035', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '2 hours', 'Release date': 'September 5, 2006', 'Language': 'English (Dolby Digital 5.0)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nReview Text: Always good to review about Notre Dame\nReview Title: Love the history of Notre Dame\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Sopranos: The Complete Series\nVarious  (Actor, Director)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'For six seasons, fans have devotedly watched Tony Soprano deal with the difficulties of balancing his home life with the criminal organization he leads. Audiences everywhere tuned in to see the mob, the food, the family, and who was next to be whacked. Celebrate the show that Vanity Fair called, \"the greatest show in TV history\", in the ultimate Sopranos keepsake.', 'Review', 'The Sopranos: The Complete First Season-', 'The Sopranos', \", writer-producer-director David Chase's extraordinary television series, is nominally an urban gangster drama, but its true impact strikes closer to home: Like 1999's other screen touchstone,\", 'American Beauty', \", the HBO series chronicles a dysfunctional, suburban American family in bold relief. And for protagonist Tony Soprano, there's the added complexity posed by heading twin families, his collegial mob clan and his own, nouveau riche brood.\", \"The series' brilliant first season is built around what Tony learns when, whipsawed between those two worlds, he finds himself plunged into depression and seeks psychotherapy--a gesture at odds with his midlevel capo's machismo, yet instantly recognizable as a modern emotional test. With analysis built into the very spine of the show's elaborate episodic structure, creator Chase and his formidable corps of directors, writers, and actors weave an unpredictable series of parallel and intersecting plot arcs that twist from tragedy to farce to social realism. While creating for a smaller screen, they enjoy a far larger canvas than a single movie would afford, and the results, like the very best episodic television, attain a richness and scope far closer to a novel than movies normally get.\", \"Unlike Francis Coppola's operatic dramatization of Mario Puzo's\", 'Godfather', 'epic,', 'The Sopranos', 'sustains a poignant, even mundane intimacy in its focus on Tony, brought to vivid life by James Gandolfini\\'s mercurial performance. Alternately seductive, exasperated, fearful, and murderous, Gandolfini is utterly convincing even when executing brutal shifts between domestic comedy and dramatic violence. Both he and the superb team of Italian-American actors recruited as his loyal (and, sometimes, not-so-loyal) henchmen and their various \"associates\" make this mob as credible as the evocative Bronx and New Jersey locations where the episodes were filmed.', 'The first season\\'s other life force is Livia Soprano, Tony\\'s monstrous, meddlesome mother. As Livia, the late Nancy Marchand eclipses her long career of patrician performances to create an indelibly earthy, calculating matriarch who shakes up both families; Livia also serves as foil and rival to Tony\\'s loyal, usually level-headed wife, Carmela (Edie Falco). Lorraine Bracco makes Tony\\'s therapist, Dr. Melfi, a convincing confidante, by turns \"professional,\" perceptive, and sexy; the duo\\'s therapeutic relationship is also depicted with uncommon accuracy. Such grace notes only enrich what\\'s not merely an aesthetic high point for commercial television, but an absorbing film masterwork that deepens with subsequent screenings.', '--Sam Sutherland', 'The Sopranos: The Complete Second Season-', 'In its second season,', 'The Sopranos', \"sustains the edgy intelligence and unpredictable, genre-warping narrative momentum that made this modern mob saga the most critically acclaimed series of the late 1990s. Creator-producer David Chase repeatedly defies formula to let the narrative turn as a direct consequence of the characters' behavior, letting everyone in this rogue's gallery of Mafiosi, friends, and family evolve and deepen.\", \"That gamble is most apparent in the rupture of the relationship that formed the spine of the first season, the tangled ties between capo Tony Soprano (James Gandolfini) and monstrous matriarch Livia (Nancy Marchand), whose betrayal makes Tony's estrangement a logical response. Filling that vacuum, however, is prodigal sister Janice (Aida Turturro), whose New Age flakiness never successfully conceals her underlying calculation and opportunism. Soprano's relationship with therapist Jennifer Melfi (Lorraine Bracco) also frays during early episodes, as she struggles with escalating doubts about her mobbed-up patient. At home, Tony contends with wife Carmela's ruthless ambitions on behalf of college-bound Meadow, as well as son Anthony Jr.'s sullen adolescent flirtation with existentialism--the sort of touch that the show handles with a smart mix of sympathy and amusement.\", \"Without spoiling the surprise of the season's climactic last episode, it's worth noting that only on\", 'The Sopranos', \"could we expect a scene that sets up a mob hit with a perversely funny touch of magic realism--a talking fish, lying on a fishmonger's iced display, speaking with the voice of the victim. It's a touch at once morbid and goofy, and consistent with the show's undimmed brilliance.\", '--Sam Sutherland', 'The Sopranos: The Complete Third Season-', '\"So,\" Tony Soprano asks analyst Dr. Melfi in the wake of not-so-dearly-departed Livia\\'s death, \"we\\'re probably done here, right?\" Sorry, Tone, not by a long shot. Unresolved mother issues are the least of the Family man\\'s troubles in the brutal and controversial third season of', 'The Sopranos', '. Ranked by', 'TV Guide', 'among the top five greatest series ever,', 'The Sopranos', 'justified its eleven-month hiatus with some of its best, and most hotly debated, episodes that continue the saga of the New Jersey mob boss juggling the pressures of his often intersecting personal and professional lives. The third season garnered 22 Emmy nominations, earning Lead Actor and Actress honors for James Gandolfini and Edie Falco for their now-signature roles as Tony and his increasingly conflicted wife, Carmela.', 'The Sopranos', 'continued to upend convention and defy audience expectations with a deliberately paced, calm-before-the-storm season opener that revolves around the FBI\\'s attempts to bug the Soprano household, and a season finale that (for some) frustratingly leaves several plot lines unresolved. The second episode, \"Proshai, Livushka,\" confronts the death of the venerable Nancy Marchand, who capped her career with perhaps her greatest role as malignant matriarch Livia. A jarring scene between Tony and Livia that uses pre-existing footage is a distraction, but Carmela\\'s unsparing smackdown of Livia at the wake redeems the episode. \"Employee of the Month,\" in which Dr. Melfi is raped and considers whether to exact revenge by telling Tony of her attack, earned Emmys for its writers, and is perhaps Emmy nominee Lorraine Bracco\\'s finest hour. The darkly comic \"Pine Barrens\"--another memorable episode, directed by Steve Buscemi--strands Paulie (Tony Sirico) and Christopher (Michael Imperioli) in the forest with a runaway corpse. Other story arcs concern the rise of the seriously unstable Ralph Cifaretto (Joe Pantoliano) and Tony\\'s affair with \"full-blown loop-de-loo\" Gloria (Emmy nominee Annabella Sciorra). Plus, there is Tony\\'s estrangement from daughter Meadow (Jamie Lynn Sigler), his wayward delinquent son Anthony, Jr. (Robert Iler), Carmela\\'s crisis of conscience, bad seed Jackie Jr., and the FBI--which, as the season ends, assigns an undercover agent to befriend an unwitting figure in the Soprano family\\'s orbit. Stay tuned for season four.', '--Donald Liebenson', 'The Sopranos: The Complete Fourth Season-', 'Carmela to Tony: \"Everything comes to an end.\" True enough, Mrs. Sope, but on', 'The Sopranos', ', the end comes sooner for some than others. Though for some the widely debated fourth season contained too much yakking instead of whacking, and an emphasis on domestic family over business Family, what critic James Agee once said of the Marx Brothers applies to', 'The Sopranos', ': \"The worst thing they might ever make would be better worth seeing than most other things I can think of.\" And in most respects,', 'The Sopranos', 'remains television\\'s gold standard. The fourth season garnered 13 Emmy nominations, and subsequent best actor and actress wins for James Gandolfini and Edie Falco as Tony and Carmela, whose estrangement provides the season with its most powerful drama, as well as a win for Joe Pantoliano\\'s psychopath Ralph. The season finale, \"Whitecaps,\" was a long-time-coming episode, in which Carmela at last stands up to \"toxic\" Tony, and \"Whoever Did This\" was the season\\'s--and one of the series\\'--most shocking episodes.', 'Other narrative threads include Christopher\\'s (Emmy nominee Michael Imperioli) descent into heroin addiction, Uncle Junior\\'s (Dominic Chianese) trial, an unrequited and potentially fatal attraction between Carmela and Tony\\'s driver Furio, and a rude joke about Johnny Sack\\'s wife that has potentially fatal implications. Other indelible moments include Christopher\\'s girlfriend Adriana\\'s projectile reaction to discovering that her new best friend is an undercover FBI agent in the episode \"No Show,\" Janice giving Ralph a shove out of their relationship in \"Christopher,\" and the classic \"Quasimodo/Nostradamus\" exchange in the season-opener, which garnered HBO\\'s highest ratings to date. Freed from the understandably high expectations for the fourth season, heightened by the 16-month hiatus, these episodes can be better appreciated on their own considerable merits. They are pivotal chapters in television\\'s most novel saga.', '--Donald Liebenson', 'The Sopranos: The Complete Fifth Season-', 'Facing an indeterminate sentence of weeks/months/years until new episodes, fans of', 'The Sopranos', \"are advised to take the fifth; season, that is. At this point, superlatives don't do\", 'The Sopranos', 'justice, but justice was at last served to this benchmark series.', 'James Gandolfini as Tony Soprano in a not-so-nice mood For the first time,', 'The Sopranos', 'rubbed out', 'The West Wing', \"to take home its first Emmy® for Outstanding Dramatic Series. Michael Imperioli and Drea de Matteo also earned Best Supporting Actor and Actress honors for some of their finest hours as Christopher and Adriana. From the moment a wayward bear lumbers into the Sopranos' yard in the season opener, it is clear that\", 'The Sopranos', 'is in anything but a \"stagmire.\" The series benefits from an infusion of new blood, the so-called \"Class of 2004,\" imprisoned \"family\" members freshly released from jail. Most notable among these is Tony\\'s cousin, Tony Blundetto (Steve Buscemi, who directed the pivotal season three episode \"Pine Barrens\"! ), who initially wants to go straight, but proves himself to be something of a \"free agent,\" setting up a climactic stand-off between Tony and New York boss Johnny Sack.', 'Carmela and Tony These 13 mostly riveting episodes unfold with a page-turning intensity with many rich subplots. Estranged couple Tony and Carmela (the incomparable James Gandolfini and Edie Falco) work toward a reconciliation (greased by Tony\\'s purchase of a $600,000 piece of property for Carmela to develop). The Feds lean harder on an increasingly stressed-out and distraught Adriana to \"snitch\" with inevitable results. This season\\'s hot-button episode is \"The Test Dream,\" in which Tony is visited by some of the series\\' dear, and not-so-dearly, departed in a harrowing nightmare. With this set, fans can enjoy marathon viewings of an especially satisfying season, but considering the long wait ahead for season six, best to take Tony\\'s advice to his son, who, at one point, gulps down a champagne toast. \"Slow down,\" Tony says. \"You\\'re supposed to savor it.\"', '--Donald Liebenson', 'The Sopranos: Season 6, Part 1-', 'The Sopranos, Season 6, Part 1', 'is the most contentious release yet in the acclaimed series\\' history. While many fans think it jumped the shark at the exact moment Vito said \"I love you, Johnny Cakes\" , this season also contains some of the series finest moments and plumbs new depths of character, while continuing to add to the body count. Things get started with a bang, literally, that unexpectedly sends Tony (James Gandolfini) to the hospital and into a coma where he experiences an alternate reality while in limbo. At one point he awakes and asks \"Who am I? Where am I going?\" encapsulating this season\\'s central theme in a moment of desperation wrapped in a fever dream. But it\\'s not all existentialism. With Tony and Uncle Junior both of the picture, the capos in the Soprano crew try to take advantage of the situation and begin jockeying for position while a reluctant Silvio (Steve Van Zandt), acting in Tony’s place, struggles to keep everyone in check. Things aren’t going much better for Tony’s family, as A.J. (Robert Iler) confesses to Carmela (Edie Falco) that he flunked out of school, and while at Tony’s bedside, swears revenge for his injury. The stress of the situation finally gets to Carmela, who takes up Dr. Melfi’s (Lorraine Bracco) offer to help and finds herself in the strange position of confiding in her husband’s therapist, revealing for once that she feels some guilt over making the kids complicit in how Tony makes his living—plus there’s the issue of whether she really loves him. Christopher (Michael Imperioli) continues to provide much of the comic relief for the series, culminating in one of this season’s best episodes when he flies out to L.A. in a bumbling attempt to get Ben Kingsley to sign on for his fledgling movie (', 'Saw', 'meets', 'The Godfather', '), and ends up mugging Lauren Bacall for her goodie basket at an awards ceremony. Sowing further discord in the ranks, Vito (Joseph Gannoscoli) finally gets outed as homosexual, and is forced to flee for his life up to New Hampshire where he meets \"Johnny Cakes.\" Finally, even with New York boss Johnny \"Sack\" Sacramoni (Vince Curatola) in prison, Phil Leotardo (Frank Vincent) makes plays against Tony and eventually sets in motion a hit against someone on Tony’s crew, and now a larger war with Johnny Sack\\'s crew seems to be looming. Series creator David Chase seems to be saying with this season that character is destiny. If so, then Season Six, Part 1 is taking the necessary time to flesh out who these people really are, and is leaving the destiny part up for Part 2. The fact that the series’ writers have been able to maintain such a strong show with so many interweaving storylines for so long is a feat not to be taken lightly. That said, this season of', 'The Sopranos', \"does deserve some of the criticism it's received: the Vito storyline would have been better served by resolving it in fewer episodes, and the season ending is the most unsatisfying one yet, leaving many fans wanting more. But the bottom line is that this season deserves more praise than criticism, proving that even at its weakest,\", 'The Sopranos', 'is still the strongest show on TV.', '--Daniel Vancini', 'The Sopranos: Season 6, Part 2-', 'Completing the run of one of the most acclaimed television shows in broadcast history, season 6, part II of', 'The Sopranos', 'will be remembered mostly not for what happened during the season, but for what didn\\'t happen at the very end. Creator David Chase pulled off a series ending that was as controversial as it was surprising and unforgettable, leaving countless fans to look away from the show and to blogs and articles for answers to the biggest mystery since \"who shot J.R.?\": what happened to Tony Soprano? But before we get to that point, there are nine episodes to digest, and they are some of the best in the run of the show since season 3. As Tony\\'s (James Gandolfini) paranoia and suspicions grow, his family makes choices that are threatening to bring big changes to his personal life, and his other \"family\" is crashing headlong towards an inevitable showdown with Johnny Sack (Vincent Curatola) and the New York crew. Episode 1, \"Soprano Home Movies,\" starts off peacefully enough with Tony and Carmela (Edie Falco) enjoying a relaxing summer weekend at Bobby and Janice\\'s (Steve Schirripa and Aida Turturro) bucolic lake house, and by the end of the episode Tony has effectively taken Bobby\\'s soul, proving Tony\\'s ruthlessness and ending any doubt about his will to maintain dominance over his family. In \"Kennedy and Heidi,\" one of the season\\'s signature episodes, Christopher\\'s (Michael Imperioli) drug use continues to spiral out of control, forcing Tony to take matters into his own hands and resolve things with his nephew once and for all.', 'Inevitably it\\'s all leading up to that big finale, and it\\'s deftly handled over the last two episodes, \"The Blue Comet\" and \"Made in America\" (an episode replete with subtle references to', 'The Godfather', '). Things finally start to get resolved with Phil\\'s crew, Dr. Melfi (Lorraine Bracco), Uncle Junior (Dominic Chianese), A.J. (Robert Iler), and Meadow (Jamie-Lynn Sigler), and as for Tony… Cut to black. To quote from another hit HBO show of the same era, \"everything ends,\" even', 'The Sopranos', ', and while the way Chase chose to end', 'The Sopranos', 'may not be to the liking of fans hoping for a definitive resolution, give the man credit for not stooping to clichés or tired old scenarios for the sake of a closing. As A.J. says in the final scene, quoting his father, \"Try to remember the times that were good.\" Good advice.', '--Daniel Vancini']\n{'Genre': 'Drama/Television, Television, Drama', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '30', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1 Pounds', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '86 hours', 'Release date': 'October 21, 2014', 'Actors': 'Various', 'Subtitles': 'English, Spanish, French', 'Studio': 'HBO Studios', 'Number of discs': '30'}\nLove it delivered on time and in great shape looks so good hated to open it love this cd hopefully they find another way to go on with this show but he will be missed. The packaging was great will order again\nSupranos complete series\nThe Big Bang Theory: Season 6\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Big Bang Theory, The: The Complete Sixth Season (DVD)', 'The CalTech geniuses of The Big Bang Theory return for season six after being thrown for a bell curve in the phenomenally funny fifth season of the hit show. In “TV’s top-rated comedy” (New York Post), Leonard has to “debug” his relationship with Penny once more after accidentally proposing to her in the heat of the moment, while Sheldon, Howard, and Raj continue to discover the feminine mystique is something that cannot be easily graphed or calculated. With even greater personal contact with his not girlfriend but “friend-who-happens-to-be-a-girl” Amy Farrah Fowler, Sheldon might have to make even more begrudging amendments to his “Relationship Agreement” while Raj continues to look for a girl as nice as Siri, and Howard gets ready for splashdown in both his NASA space travels and wedding to the spirited Bernadette.', ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Johnny Galecki, Kaley Cuoco, Chuck Lorre, Kevin SussmanMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Johnny Galecki, Kaley Cuoco, Chuck Lorre, Kevin Sussman  See more', 'Initial release date': '2013-09-10', 'Language': 'English (Dolby Digital 5.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 7.52 Ounces', 'Item model number': '394951', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '11 hours', 'Release date': 'September 10, 2013', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar', 'Subtitles': 'Spanish, French, Korean, Thai, Portuguese', 'Producers': 'Chuck Lorre, Bill Prady, Steven Molaro', 'Studio': 'Studio Distribution Services', 'Writers': 'Chuck Lorre, Bill Prady', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI always buy Big Bang dvd's makes me laugh no matter how many times that I put this on to watch it again still laugh it is so great to be able to laugh so hard and laoug\nGot ot love Big Bang\nUnder the Dome: Season 1\nMike Vogel  (Actor),     Rachelle Lefevre  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['Product Description', 'Under the Dome', ', a new 13-episode miniseries based on Stephen King’s best-selling novel, is the story of a small town that is suddenly and inexplicably sealed off from the rest of the world by an enormous transparent dome. The town’s inhabitants must deal with surviving the post-apocalyptic conditions while searching for answers about the dome, where it came from and if and when it will go away.', 'Amazon.com', \"Stephen King's popular fantasy-thriller\", 'Under the Dome', 'makes a largely successful leap to weekly television series, as evidenced by this first-season set. Overseen by a host of high-profile creative figures, from King himself and Steven Spielberg (both executive producers) to', 'Lost', 'veterans Brian K. Vaughan (credited as series creator) and Jack Bender,', 'Under the Dome', \"expands considerably on King's central premise of a small town in Maine that finds itself cut off from the world by an invisible, impenetrable dome. Tasked with making order out of this sudden chaos is a cross-section of everyday citizens, including former Special Forces vet Dale (Mike Vogel), newspaper editor Julia (Rachelle Lefevre), newly minted sheriff Linda (Natalie Martinez), and scientifically inclined teen Joe (Colin Ford), as well as Machiavellian used car dealer Big Jim (Dean Norris of\", 'Breaking Bad', \") and his deranged son (Alexander Koch). Tension builds at an agreeably brisk clip over the course of the debut season's 13 episodes as forces outside the dome attempt to break through while residents trapped inside struggle to make sense of their fates while contending with the growing and insidious influence of Big Jim and his son. Expanding the already sizable\", 'Dome', \"(one of King's longest written works) into series format has its pros and cons: characters are given more time to develop, and many of the changes made to the book's premise--most notably to several characters and the nature of the dome itself--are mostly positive ones, and the large cast capably handles the material, with Norris and character actors Leon Rippy (\", 'Deadwood', \"), Mare Winningham, and Ned Bellamy, all in recurring roles, taking the lion's share of the laurels. On the downside, however, the story feels stretched thin over the course of 13 episodes instead of a miniseries length: certain characters' actions feel shaped by the need to extend their arcs (sheriff Linda and Koch's Junior, for example), and key discoveries that would normally change the direction of the main storyline are left dangling, undoubtedly to be addressed at a later date/season. Dialogue too remains a consistent weak spot, and may put off casual viewers drawn in by the considerable attention and high ratings generated during\", 'Dome', \"'s initial network run. As it stands,\", 'Dome', 'is a good if not great King adaptation--certainly better than most of the TV efforts to translate his work--but the jury remains out on whether it can hold its own over the course of multiple seasons.', 'Extras on the four-disc', 'Under the Dome', 'set are substantial and vary from behind-the-scenes material to viral content. The show\\'s inception and production is chronicled in several lengthy and detailed featurettes, including the 29-minute \"Filming the Pilot,\" which features interviews with Vaughn and most of the major on- and behind-the-camera talent, as well as numerous moments with King himself. The author is also featured in his own extra, which pairs him with longtime friend and fellow author Michael Connelly for a brief read-through of the book\\'s opening chapter and discussion of the show\\'s expansion of the source material. \"The First Season\" adds considerable making-of detail for all 13 episodes, while \"From Novel to Series\" and \"The World of', 'Under the Dome', '\" cover writing and casting and location work, respectively. Less compelling is \"Joe\\'s Blog,\" a series of 11 text and video posts generated by Ford\\'s character, while the de rigueur gag reel and deleted scenes are, for the most part, forgettable. Three-plus minutes of promotional spots round out the wealth of supplements.', '--Paul Gaita']\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Box set, Color, NTSC, Multiple Formats, Widescreen', 'Contributor': 'Britt Robertson, Alexander Koch, Dean Norris, Rachelle Lefevre, Natalie Martinez, Mike Vogel', 'Language': 'English', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Media Format': 'Box set, Color, NTSC, Multiple Formats, Widescreen', 'Run time': '9 hours and 1 minute', 'Release date': 'December 19, 2017', 'Actors': 'Mike Vogel, Rachelle Lefevre, Dean Norris, Natalie Martinez, Britt Robertson', 'Subtitles': 'Spanish, English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReceived this DVD today and love the style of this the picture of the Dome looks good and the DVD is on the front. Have not opened this yet just love the container. Can not wait until season 2\nUnder the Dome\nShelter Me\nKatherine Heigl  (Actor),     Steven Latham  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Documentary\n['Product Description', \"Shelter Me is an uplifting film about shelter pets improving the lives of those who adopt them. It is hosted by Katherine Heigl and sponsored by Ellen DeGeneres' company, Halo, Purely for Pets. The film celebrates the human animal bond with positive stories about shelter pets and their new homes. In the film, we see the journey of two stray dogs, from the day they are picked up on the streets and brought to the shelter until the day they became a beloved family pet. We go inside a women's prison where inmates train shelter dogs to become service animals for people with disabilities. We also show how shelter pets are helping our returning war veterans cope with PTSD. Shelter Me is about hope, redemption, helping others and making a difference.\", 'Review', '\"', 'Shelter Me', 'is single-minded in its goal: It wants people to consider adopting a dog from a shelter.\" --The New York Times\"', 'Shelter Me', 'is a must see documentary. It is moving, tear-jerking, and uplifting - all at the same time. This is a must see for all people who love dogs and love what humans and dogs can do for each other.\" --San Antonio Pets Examiner\"I was moved to tears of joy as I watched the bond develop between the humans and their new found companions. I think you will also be incredibly moved by this most-welcomed documentary that spills over with hope for those beings, nonhuman and human, who need help in a demanding world.\" --Psychology Today\"', 'Shelter Me', 'is a must see documentary. It is moving, tear-jerking, and uplifting - all at the same time. This is a must see for all people who love dogs and love what humans and dogs can do for each other.\" --San Antonio Pets Examiner\"I was moved to tears of joy as I watched the bond develop between the humans and their new found companions. I think you will also be incredibly moved by this most-welcomed documentary that spills over with hope for those beings, nonhuman and human, who need help in a demanding world.\" --Psychology Today', 'About the Director', 'Steven Latham is an award-winning filmmaker and the President of Steven Latham Productions. Mr. Latham produced and directed a film for NOVA/PBS about solar energy titled, SAVED BY THE SUN. He also produced and directed the feature documentary about the TED Conference, THE FUTURE WE WILL CREATE, with partner Daphne Zuniga. Mr. Latham created and was the producer/director of the PBS series, THE LIVING CENTURY, which told the amazing stories of the 20th Century through individuals who were at least 100 years old. He produced this with partners Barbra Streisand and Cis Corman of Barwood Films. He also was the producer and director of the film, THE LAST EDITOR: The Jim Bellows.', 'See more']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Item model number': '26406810', 'Director': 'Steven Latham', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '57 minutes', 'Release date': 'April 30, 2013', 'Actors': 'Katherine Heigl', 'Studio': 'Virgil Films', 'Number of discs': '1'}\nLove this so much is going on with shelter animals this needs to be watched to understand what happens if they do not get a home and when they do they show so much love. I have 3 rescues and this is a great dvd to watch\nwatch Shelter Me\nColumbo: The Complete Series\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Editor's Picks\n['Legendary Peter Falk is a four-time Primetime Emmy Award-winner for his iconic role as the beloved, trenchcoat-wearing Police Lieutenant Columbo. Columbo is the landmark series that inspired a genre. And now, for the first time ever, all 69 episodes from its seven seasons and all 24 television movies are together in this 34-disc anthology. Every criminal, every innocent victim (and some not-so-innocent ones), and every wily deduction are here in one definitive collection. Seemingly befuddled but always brilliant, the cigar-chomping detective will have you following the clues and asking \"just one more thing\" until the last case is cracked.   Note: This set contains 34 discs which are contained in 8 cases.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Pounds', 'Media Format': 'Color, Full Screen, Widescreen, NTSC', 'Run time': '99 hours and 52 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Peter Falk', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), Unknown (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal', 'Number of discs': '34'}\nI have always loved Columbo was glad when I got the whole series these are great\nFive Stars\nSALEM SEASON 1\nJane Montgomery, Shane West, Seth Gabel, Tazmin Merchant, Ashely Madekwe, Elise Eberle, Iddo Goldberg  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n[\"Set in the volatile world of 17th century Massachusetts, SALEM explores what really fueled the town's infamous witch trials and dares to uncover the dark, supernatural truth cloaked behind the veil of this infamous period in American history. In Salem, witches are real, but they are not who or what they seem to be. The series, which centers on an epic romance wrapped around this explosive revelation, delivers a bold new vision of Salem -- and an even bolder new vision of witches.\"]\n{'Genre': 'Television, Horror/Television', 'Format': 'NTSC', 'Contributor': 'Jane Montgomery, Shane West, Seth Gabel, Tazmin Merchant, Ashely Madekwe, Elise Eberle, Iddo Goldberg, Brannon Braga, Adam Simon, Josh S. Barry, Jeffrey Kwatinetz, Brannon Braga, Adam SimonJane Montgomery, Shane West, Seth Gabel, Tazmin Merchant, Ashely Madekwe, Elise Eberle, Iddo Goldberg, Brannon Braga, Adam Simon, Josh S. Barry, Jeffrey Kwatinetz, Brannon Braga, Adam Simon   See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'FXMD4399586DVD', 'Media Format': 'NTSC', 'Run time': '10 hours and 24 minutes', 'Release date': 'October 29, 2014', 'Actors': 'Jane Montgomery, Shane West, Seth Gabel, Tazmin Merchant, Ashely Madekwe, Elise Eberle, Iddo Goldberg', 'Subtitles': 'German, English, Spanish', 'Producers': 'Brannon Braga, Adam Simon, Josh S. Barry, Jeffrey Kwatinetz', 'Studio': 'Twentieth Century Fox Film Corporation', 'Writers': 'Brannon Braga, Adam Simon', 'Number of discs': '3'}\nLove this cd took awhile to get into this but it was nice\nFive Stars\nAfterlife: Series One\nAndrew Lincoln  (Actor),     Lesley Sharp  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Afterlife: Season One (2005/BBC/DVD)', 'Steel your nerves before you watch this chilling psychological drama starring Andrew Lincoln (Rick Grimes, The Walking Dead) and Lesley Sharp (Vera Drake, Clocking Off). University lecturer Robert Bridge feels skeptical about all things paranormal until he meets Alison Mundy, who has seen and heard spirits since she was a child. Robert thinks she’s the real deal—a genuine psychic who risks her life to help people heal from relationships torn apart by death. He’s in for a shock, though, when Allison tries to help him accept the accidental killing of his own son.', ']]>']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Color, NTSC, Subtitled', 'Contributor': 'Andrew Lincoln, Lesley Sharp', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '28941168', 'Media Format': 'Color, NTSC, Subtitled', 'Run time': '4 hours and 42 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Andrew Lincoln, Lesley Sharp', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nThis is a good movie to watch can not wait for series two\nFive Stars\nX-Files: The Complete TV Series and Movie Collection\nGillian Anderson  (Actor),     David Duchovny  (Actor),     Rob Bowman  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Alien Invasion\n['Collection Includes:', 'The X-Files: Complete Seasons 1-9', 'The X-Files: Complete Seasons 1-9', 'The X-Files: I Want to Believe', 'The X-Files: I Want to Believe', 'The X-Files (aka Fight the Future)', 'The X-Files (aka Fight the Future)', 'Note:Seasons 1-4 are full frame. The rest are widescreen.']\n{'Format': 'NTSC', 'Contributor': 'Gillian Anderson, David Duchovny, Rob Bowman', 'Language': 'English', 'Number Of Discs': '54', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.02 x 7.28 x 5.71 inches; 4.08 Pounds', 'Director': 'Rob Bowman', 'Media Format': 'NTSC', 'Actors': 'Gillian Anderson, David Duchovny', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '54'}\nLove the X files was waiting for the series finally got it\nFive Stars\nDominion: Season 1\nChristopher Egan  (Actor),     Tom Wisdom  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Dominion is an epic supernatural drama set in the near future. Specifically, 25 years after \"The Extinction War,\" when an army of lower angels, assembled by the archangel Gabriel, waged war against mankind. The archangel Michael, turning against his own kind, chose to side with humanity. Rising out of the ashes of this long battle are newly fortified cities which protect human survivors. At the center of the series is the city of Vega, a glistening empire that has formed from the ruins of what was once Las Vegas. Dominion stars Christopher Egan (Resident Evil: Extinction), Tom Wisdom (300), Roxanne McKee (Game of Thrones), Alan Dale (Lost), Anthony Stewart Head (Buffy the Vampire Slayer) and Luke Allen-Gale (The Borgias).']\n{'Genre': 'Science Fiction & Fantasy, Drama, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Tom Wisdom, Luke Allen-Gale, Christopher Egan, Alan Dale, Roxanne McKee, Anthony Stewart Head', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '30590430', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '6 hours and 19 minutes', 'Release date': 'December 23, 2014', 'Actors': 'Christopher Egan, Tom Wisdom, Roxanne McKee, Alan Dale, Anthony Stewart Head', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nwas interesting to watch\nFive Stars\nUnder the Dome: Season 2\nRachelle  LeFevre  (Actor),     Colin Ford  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['From executive producer Steven Spielberg and based on the best-selling novel by Stephen King, Under the Dome is the story of a small New England town that is suddenly and inexplicably sealed off from the rest of the world by an enormous transparent dome. The town’s inhabitants must deal with surviving the post-apocalyptic conditions while searching for answers to what this barrier is, where it came from and if and when it will go away.']\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Contributor': 'Alexander  Koch, Natalie  Martinez, Rachelle  LeFevre, Britt  Robertson, Dean  Norris, Colin Ford, Mike VogelAlexander  Koch, Natalie  Martinez, Rachelle  LeFevre, Britt  Robertson, Dean  Norris, Colin Ford, Mike Vogel  See more', 'Language': 'English', 'Runtime': '8 hours and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '947922', 'Media Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Run time': '8 hours and 52 minutes', 'Release date': 'December 19, 2017', 'Actors': 'Rachelle  LeFevre, Colin Ford, Dean  Norris, Britt  Robertson, Alexander  Koch', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nLoved this show was  upset to hear it went off the air would have bought each season sorry to hear about this the show was good\nThe show as good\nHistory of Notre Dame Football\nRated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['This DVD celebrates the winning tradition of the Notre Dame Fighting Irish spanning 11 National Championships, 7 Heisman trophy winners, 78 consensus All-Americans, legendary coaches and a unique game-day atmosphere. The DVD is packed with interviews from the most memorable players and coaches in Notre Dame history along with tons of bonus features.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Item model number': 'TMM-TM1035', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '2 hours', 'Release date': 'September 5, 2006', 'Language': 'English (Dolby Digital 5.0)', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nAlways good to review about Notre Dame\nLove the history of Notre Dame",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Love the history of Notre Dame",
    "text": "Always good to review about Notre Dame",
    "images": [],
    "asin": "B000FUF6Q8",
    "parent_asin": "B000FUF6Q8",
    "user_id": "AFAE5TN6ZBXFPCM7ROQKDHZKNZNA",
    "timestamp": "2019-10-03 23:29:18.626000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "History of Notre Dame Football",
    "average_rating": 4.7,
    "rating_number": 62,
    "features": [],
    "description": [
      "This DVD celebrates the winning tradition of the Notre Dame Fighting Irish spanning 11 National Championships, 7 Heisman trophy winners, 78 consensus All-Americans, legendary coaches and a unique game-day atmosphere. The DVD is packed with interviews from the most memorable players and coaches in Notre Dame history along with tons of bonus features."
    ],
    "price": 10.04,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/516DTTJCH7L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/516DTTJCH7L.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "Studio Specials",
      "Warner Home Video",
      "All Titles"
    ],
    "details": {
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Item model number": "TMM-TM1035",
      "Media Format": "Multiple Formats, Closed-captioned, Color, NTSC",
      "Run time": "2 hours",
      "Release date": "September 5, 2006",
      "Language": "English (Dolby Digital 5.0)",
      "Studio": "Warner Home Video",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}