{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Magnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nReview Date: 2020/07/04\nStore: Eyenjoy\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nReview Text: This was my first attempt to do faux eye lashes. I can not compare to other systems, but I love it! I use the 3 pair from the top. The look was pretty normal. I had to cut a little of them because it was too long for me.<br />The set comes with 2 eye liner, tweezer and 5 pairs of lashes.<br />The liner was easy to apply and then the lashes were stuck on it fast and easy.<br />I went to a barbecue with them and they stay in the entire time.<br />After, they go out without any pain. The eye liner was a little hard to take off. I use my makeup wipes in a hard way. Haha.<br />It did not make my sensitive skin hurt or burn.<br />I love it!\nReview Title: Big difference!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "6 Pack Soft Headband BEoffer Coral Fleece Women Makeup Spa Head Bands Turban Fashion Bow Bowknot Hairlace Headwear Wash Face Hair Holder Elastic Top Knot Bandage Girl Baby Hair Accessories 6 Colors\nBEoffer\n{'Age Range (Description)': 'Baby', 'Material': 'Elastic', 'Fabric Type': 'Fleece', 'Number of Items': '6', 'Recommended Uses For Product': 'Face Makeup', 'Product Dimensions': '7.28 x 1.97 x 0.67 inches; 1.16 Ounces', 'Item model number': 'BH-002', 'UPC': '799899729252'}\nI love this set! Even though I don’t need 6 of them.<br />They are well made, very stretchy, so I guess they fit a wide range of head sizes!<br />Super super soft. The fabric is thick.<br />Comfortable to use, it does not squeeze the head. But it holds all the hair back.<br />I use it when washing my face. It keeps my hair dry too.<br />I love the bow! Very 50’s!!!<br />Great colors. Like it a lot.\nFun and works great!\nBioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly, Top Japanese Makeup Remover, Gentle Skin Cleanser, Mild Floral Fragrance, Non-Greasy, 7.8 Ounce\nBioré\n['Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly is a non-greasy makeup remover that removes dirt and impurities from deep below the surface of your skin. This top Japanese makeup remover glides on gently and leaves no sticky residue. Formulated with conditioning beauty essence, this jelly leaves skin feeling moisturized and free of makeup. Satisfaction Guaranteed. Limitations may apply.']\n{'Product Dimensions': '1.56 x 2.5 x 7.25 inches; 10.08 Ounces', 'Item model number': '28077_obs', 'UPC': '019100264557', 'Manufacturer': 'Kao USA Inc.'}\nFirst of all, I don’t use to much makeup, no thick layers of foundations. Just some primer, concealer, eyes and mouth.<br />For me, they worked perfectly! They are pretty wet, so they took off all my makeup easily.<br />They are small, so if you use more layers of make up you maybe are going to need more than one.<br />They are soft and have a nice scent.<br />I have mixed skin and delicate. They did not hurt me, burn me, or leave my skin red.<br />After using them, my skin feels clean and moisturized. Not greasy or dry.<br />And they come in a super handy little box, perfect to carry around on your bag.\nWorks great!!\nlilah b. - Bronzed Beauty Bronzer Duo - b. sunkissed - Multipurpose Bronzer Duo to Highlight + Contour and Blend\nLILAH B\n{'Brand': 'LILAH B', 'Skin Tone': 'All', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Style': 'Compact', 'Package Dimensions': '3.8 x 3.5 x 1 inches; 0.32 Ounces', 'UPC': '851078006100'}\nThis is beautiful. Not only the box is very nice, but the case is stunning! Looks like a smooth shell. Very luxurious. Perfect as a gift!<br />It is however, because of the material, like a ceramic or something, very heavy. I think it will not be good as a pret a porter kind of makeup. But perfect for the one you leave on your makeup vanities.<br />The colors are perfect for my skin tone, I’m like a light brown tone. But I’ve found myself using it more as a eye shadow than bronzer.<br />The highlighter gives a pop of glow.<br />No scent on it and it stays perfectly during my days.<br />Like it. Beautiful!\nBeautiful case!\nMagnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nEyenjoy\n{'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nThis was my first attempt to do faux eye lashes. I can not compare to other systems, but I love it! I use the 3 pair from the top. The look was pretty normal. I had to cut a little of them because it was too long for me.<br />The set comes with 2 eye liner, tweezer and 5 pairs of lashes.<br />The liner was easy to apply and then the lashes were stuck on it fast and easy.<br />I went to a barbecue with them and they stay in the entire time.<br />After, they go out without any pain. The eye liner was a little hard to take off. I use my makeup wipes in a hard way. Haha.<br />It did not make my sensitive skin hurt or burn.<br />I love it!\nBig difference!",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Usage:** Enjoys using hair accessories for practical purposes like makeup application and facial care, with an increasing interest in innovative beauty tools and multi-functional products that enhance beauty routines and provide a playful experience.\n- **Material Preference:** Prefers soft, stretchy materials for comfort and a good fit, reflecting a broader appreciation for gentle, non-irritating formulations in skincare and well-designed beauty tools that are easy to use.\n- **Aesthetic Taste:** Drawn to playful and nostalgic designs, indicating a liking for fun, fashionable styles; this extends to an appreciation for beautifully designed, functional beauty tools and accessories.\n- **Quality Expectation:** Values well-made products that deliver comfort and functionality, with an emphasis on product durability and visual appeal, seeking reliable options that enhance the beauty experience.\n- **Practicality:** Appreciates stylish and effective accessories that seamlessly fit into personal care routines; shows an inclination toward versatile beauty products that simplify application and deliver multiple benefits.\n- **Multi-functionality:** Enjoys products that can serve various functions, such as tools that enhance makeup application and skincare benefits, demonstrating a preference for versatile solutions that add value and efficiency to beauty routines.\n\nThis user exhibits an engaged interest in beauty and personal care, balancing creativity, comfort, and practical effectiveness in both accessories and cosmetic choices.",
  "metrics": {
    "rouge1_f": 0.15934627170582227,
    "rouge2_f": 0.008188331627430911,
    "rougeL_f": 0.0735444330949949,
    "meteor": 0.06295630092053751,
    "bleu1": 0.020008278561403192,
    "bleu2": 0.004323079862404091,
    "bleu3": 0.0007594600507318576,
    "bleu4": 0.00031861421145738795,
    "bertscore_precision": 0.37396520376205444,
    "bertscore_recall": 0.4715811312198639,
    "bertscore_f1": 0.41713839769363403
  }
}