{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dr. Denese Cannabis Sativa Super Serum with Soothing Calming Organic Cold-Pressed Hemp Oil, Ginger, Bisabolol, Ceramides - Reduce Look of Wrinkles, Moisturize & Improved Tightness - Cruelty-Free - 2oz\nReview Date: 2020/08/05\nStore: Dr. Denese\nAverage Rating: 3.9\nProduct Details: {'Skin Type': 'All, Oily, Sensitive, Dry', 'Product Benefits': 'Dr. Denese', 'Scent': 'Aloe', 'Brand': 'Dr. Denese', 'Item Form': 'Serum', 'Package Dimensions': '4.6 x 2.6 x 1.7 inches; 2 Ounces', 'Manufacturer': 'Dr. Denese'}\nReview Text: After using this for several days now, I am officially in love with this. This serum has calmed my redness by miles, my blemishes don't last a long, and this stuff absorbs lightning fast. It feels so smooth, soft (like velvet), and the texture is thin and easy to work with. There is no smell and a little goes a long way. I definitely plan to keep this serum as a repeat staple in my routine.\nReview Title: Very nice\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mary Kay Makeup Finishing Spray by Skindinävia\nMary Kay\n{'Item Form': 'Spray', 'Skin Type': 'All', 'Package Information': 'Bottle', 'Brand': 'Mary Kay', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5 x 2 x 5 inches; 3.21 Ounces'}\nI loved how this made my makeup look but I don't feel like it made much of difference in longevity. And I am not sure my skin even likes this product because the past few times I have applied it, I would get one or two breakouts. It could be related to something else but the longer I go without this product, the few the problems I have. I prefer the skindinavia lines but don't take my word for it, this product could work for you!\nI loved how this made my makeup look but I don't ...\nSec Clinical Stress Respn Size 1.6z Secret Clinical Stress Response 1.6z\nSecret\n{'Brand': 'Secret', 'Number of Items': '4', 'Unit Count': '4.00 Count', 'Package Dimensions': '5.4 x 2.8 x 1.5 inches; 3.21 Ounces'}\nI have been using this for so long and I like it but I do not know if I will continue to repurchase because I think my body has stopped responding to it. If I was in a pinch and needed something asap, I would go back to this because I know it but currently I am trying other things to see if they compare.\n... have been using this for so long and I like it but I do not know if I will ...\nGarnier Fructis Volume Extend Instant Bodifier Dry Shampoo 3.40 oz (Pack of 2)\nGarnier\n{'Brand': 'Garnier', 'Hair Type': 'Dry', 'Item Form': 'Spray', 'Age Range (Description)': 'Adult', 'Item Weight': '0.01 Ounces', 'Package Dimensions': '8.2 x 2.7 x 1.8 inches; 0.01 Ounces', 'UPC': '603084294954'}\nI like this dry shampoo because it feels so light in my hair, it doesn’t feel sticky or tough. I do not feel it gives my hair volume but it does well in cancelling excess oils and smelling good. I would repurchase but I would have preferred more volume (hence my four stars).\nGood, not perfect for me.\nDr. Denese Cannabis Sativa Super Serum with Soothing Calming Organic Cold-Pressed Hemp Oil, Ginger, Bisabolol, Ceramides - Reduce Look of Wrinkles, Moisturize & Improved Tightness - Cruelty-Free - 2oz\nDr. Denese\n{'Skin Type': 'All, Oily, Sensitive, Dry', 'Product Benefits': 'Dr. Denese', 'Scent': 'Aloe', 'Brand': 'Dr. Denese', 'Item Form': 'Serum', 'Package Dimensions': '4.6 x 2.6 x 1.7 inches; 2 Ounces', 'Manufacturer': 'Dr. Denese'}\nAfter using this for several days now, I am officially in love with this. This serum has calmed my redness by miles, my blemishes don't last a long, and this stuff absorbs lightning fast. It feels so smooth, soft (like velvet), and the texture is thin and easy to work with. There is no smell and a little goes a long way. I definitely plan to keep this serum as a repeat staple in my routine.\nVery nice",
  "profile": "**Updated User Profile Summary:**\n\n- **Makeup and Hair Care Enthusiast**: Displays a strong interest in makeup application and hair care products, valuing aesthetics and presentation.\n\n- **Spray Preference**: Favors lightweight, easy-to-apply spray-form products for both makeup and hair, indicating a clear preference for practicality and ease of use.\n\n- **Skin and Scalp Sensitivity**: Prone to breakouts with certain makeup products and sensitive to hair product reactions, suggesting careful consideration of ingredients and a cautious approach to new items.\n\n- **Brand Loyalty**: Shows a preference for established brands and values trusted reputations, particularly in makeup and hair care.\n\n- **Mixed Experience with Performance**: Appreciates essential product benefits while remaining critical of performance and skin/scalp compatibility, leading to thorough evaluations of efficacy.\n\n- **Cautious Experimentation**: Open to trying new products, especially those that demonstrate proven skin and scalp health benefits, balancing familiarity with exploration.\n\n- **Positive Outcomes with New Additions**: Recently added a serum that's effectively calmed redness, reduced blemish duration, and impressed with its fast absorption and smooth texture, indicating a shift towards high-performing skincare products.\n\n- **Attention to Functionality**: Seeks improved performance outcomes, such as increased volume for hair care products, reflecting high standards for usability and results.\n\nOverall, the user values products for their enhancement capabilities while prioritizing skin and scalp health, showcasing a thoughtful and adaptable approach to experimentation with a newfound appreciation for effective skincare solutions.",
  "metrics": {
    "rouge1_f": 0.2078272604588394,
    "rouge2_f": 0.008119079837618403,
    "rougeL_f": 0.10256410256410257,
    "meteor": 0.09653259502843076,
    "bleu1": 0.09008736374365255,
    "bleu2": 0.018919107278608446,
    "bleu3": 0.0032918964697668633,
    "bleu4": 0.001374311298458221,
    "bertscore_precision": 0.36975187063217163,
    "bertscore_recall": 0.43144121766090393,
    "bertscore_f1": 0.39822158217430115
  }
}