{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Head & Shoulders Deep Moisture Masque Royal Oils 1.7 Ounce (10 Pieces) (50ml)\nReview Date: 2022/10/20\nStore: Head & Shoulders\nProduct Description: ['Pyrithione zinc dandruff masque. My Black is Beautiful: Proudly recommends Head & Shoulders. Intensely moisturizes hair & scalp long-lasting scalp relief (Associated with dandruff, with regular usage). Sulfate, paraben & dye free All Hair Types, textured Basic conditioning']\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '9.25 x 7.52 x 4.45 inches; 1.32 Pounds', 'UPC': '037000779735'}\nReview Text: This is a nice mask for the price. I have short hair & can get 2 uses from each packet (you get 10 packs). The softness is better if you also use the Royal Oils shampoo. When I used a different shampoo, the results weren't as good. Next time, I am going to use a cap and maybe even some wet heat to see if that helps. I think the issue is that my hair doesn't love coconut oil which is one of the ingredients - even though it's the 6th of 11 ingredients.<br /><br />The packs are pretty hefty and I think that I could stretch the use more by adding more water to my hair beforehand. But to be honest, I think that the R.O. conditioner works better than this mask!<br /><br />Love the R.O. line and I think this will work well if I use heat or leave it on longer than 5 minutes. Keep in mind that I have REALLY dry 4C hair... I have almost the entire R.O. line and love all of them but this is my least favorite of the set & I won't buy any more of the mask.\nReview Title: Works pretty good on dry 4C\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Frownies Immune Perfect Daily Moisturizer, 0.3 Ounce\nFROWNIES\n['Frownies Immune Perfect Continuous Active Hydration: Will make you experience continuous active hydration and dual protection against free radical. Helps prevent skin cell damage and helps nourish the DNA that reduces inflammation and boosts the immune system of the skin.']\n{'Brand': 'FROWNIES', 'Item Form': 'Cream', 'Number of Items': '1', 'Item Volume': '10 Milliliters', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 1.5 x 1 inches; 0.01 Ounces', 'UPC': '724498132578', 'Manufacturer': 'Buy Smart LLC'}\nLove, love, LOVE this moisturizer. I love it so much that I may have replaced my Avon Anew. This one costs quite a bit, but the tiny travel sized tube will last a while. This is a VERY watery product, but that's great for 2 reasons: 1) a little bit goes a long way, and 2) it absorbs really well into the skin. The best way that I have found to apply this is to tap the lotion onto my fingertips, then just sort of dab it onto my face before rubbing it in. This saves on product and keeps me from spilling any from the tube. Like I said, this has a very &#34;wet&#34; texture, so you won't have to use much. The price is way up there but, compared to using a lot of a cheaper product (that doesn't work as well), or a same-priced product (but using more of it), this is the best value overall. I'm going to see how long the travel-sized tube lasts while I save up for a larger size. Since this is something I have to save for, I really wish there were more size/price choices. Still, I love this and I think my skin is getting addicted to it!\nPretty Pricey But Worth It!\nEvery Beauty All in One Foot Smoother, 2 different smoothing surfaces\nEvery Beauty\n['Dermabrasion coatings removes rough dry cracked skin and calluses from feet. Custom forms to your foot to ensure even coverage on skin. Soft and flexible to get calluses in between and under toes. Proudly Made in the USA']\n{'Brand': 'Every Beauty', 'Color': 'Pink', 'Item Dimensions LxWxH': '3.75 x 1 x 2.75 inches', 'Number of Items': '24', 'Unit Count': '1.00 Count', 'Product Dimensions': '3.75 x 1 x 2.75 inches; 0.32 Ounces', 'Item model number': '3001001', 'UPC': '858651002061', 'Manufacturer': 'Consumer Inspired Products'}\nThis works and works well. The reason I can't give it a full  5-star review is because of the price. There is a very similar product that is way cheaper and works as well or better than this one. I found Sole Magic online for about a dollar cheaper than this one. In superstores and drug stores, I found it for a couple of bucks. This one does work and I can't say one negative thing about it - other than the price. When a pedicure is around $20 (even here in Alaska where prices are high), and I can do upkeep with a similar foot smoothing pad for about $2, I just can't see paying almost $9 for this one. If other customers do want this one, I can tell you that it works, the shape is nice and makes it easy to grip and use with either hand. It's also nice that their is a coarse side and a finer side. One thing that I disagree with is that you could use this anywhere but on your feet. I don't know what would have to be going on with anyone's elbows or knees for them to use this on! All in all, a great product, but a bit overpriced when there are cheaper alternative items that are just as effective.\nGreat item, but there are more affordable alternatives\nHair Growth Treatment Cream - Revitalizes Dry, Damaged Hair - Fast & Promotes Hair Long Healthy - Anti-Hair Loss–Moisturizing, Detangling & Lightweight Synthesis with Vitamin B5, Hydrolyzed Protein\n{'Item Form': 'Cream', 'Age Range (Description)': 'Adult', 'Hair Type': 'Dry', 'Package Dimensions': '4.3 x 4.2 x 3.6 inches; 1.25 Pounds'}\nThis has the very, very *very* faintest plant-like scent (which is clean and pleasing). It's also thicker than I expected - almost like a whipped lotion. Before I used it on my hair, I rubbed some into the back of my hand to see if I'd have any kind of skin reaction. I did not. What I noticed is that once this absorbed, there was absolutely zero residue. I don't know what that means, but I was just curious. When I rub in other types of hair masks & treatments, I always get a sense of something left that I need to wash off. When I used this on my hair in the shower, I left it on for about<br />2 to 3 minutes after I had massaged it in according to the directions. (I have to stop and mention that I was also using the Daelong shampoo and conditioner set beforehand. That might be why I got my results.) This rinses out extremely well. My hair felt conditioned but with a lot less of the residual slip from other conditioners. That kind of worried me. I like to know that a treatment is doing something & the only way to tell until you've used it for a while is by the way your hair feels. Where I became so happy with this is an hour after rinsing it out. I have coarse and &#34;nappy&#34; natural African American hair. My hair tends to be extremely dry - especially after washing. A good conditioner keeps things in check until I can apply my leave-in products (oils, butters, sprays, etc.), but this time, my hair stayed soft and easy to comb through for at least 2 hours. It might have been longer, but I went ahead and applied my usual leave-ins. Still, I know that this did soften my hair (the day after, my hair is retaining softness without any more leave-in applications) without making it feel fragile. With they type of hair I have, I have to worry about breakage. I realize that I have probably been clogging up my scalp by over-doing it with the oils and butters. I like that I haven't had to use more of them for my hair to feel manageable. As a test, I'm going to try easing up on using so much leave-in stuff while I continue to use this.I think these guys are on to something here. I will have to come back and update this review as I use this for a while but, for now, I love the way this makes my hair feel, even after just one treatment. Normally, I only fully wash my hair once every four weeks or so. I will do a co-wash about every other week to keep it clean without stripping it. While I am testing this out, I plan to use it at least once a week as my co-wash. Like I said, I am also using the shampoo & conditioner of this brand. That might be a big part of why this worked so well for me, but I think that this would work just as good on its own. By the way, I'm going to alter my washing regimen for a while to use the shampoo and conditioner at least every other week. I almost forgot to mention the other thing I was concerned about: the label says that this makes the hair &#34;straight and silky&#34; - which is exactly what I, personally, DO NOT want. I love my texture and want to keep it. My texture is the kind that is prone to slow growth (because of breakage) so... I'm not worried about losing my naps. I'm thinking that this aids in stopping breakage more than anything.<br />I got this at a very steep discount.\nLike the way it makes my natural & nappy hair feel\nColgate Optic White Toothpaste, Sparkling Mint, 3.5 Ounce (Pack of 3)\nOptic White\n['Colgate Optic White Sparkling Mint Toothpaste is specially designed to help you get a white smile while freshening your breath. It delivers whiter teeth in one week* and goes beyond surface stain removal to deeply whiten. Its enamel-safe, anti cavity fluoride formula helps protect teeth from cavities while removing stains for the white, fresh smile you’ve always wanted.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.2 x 5.9 x 1.6 inches; 3.5 Ounces', 'Manufacturer': 'Optic White'}\nFinally tried this after using a much pricier whitening toothpaste. This works as good (or better) and I can actually afford it. The other paste (well-known brand, starts with &#34;R&#34; lol) was good, but the price was too high and I stopped using it because of that. The other day, I found this in a two-pack at such a good price that I decided to give it a try. Guess what? I could see really good results after about the 3rd time using it. That's just as good as the other expensive brand. The taste of this one is nice and mild - which is a Plus because I don't like overpowering flavors. I can't believe it took me this long to try this one. I could've been saving so much money all this time...\nAs good (or better) than the expensive \"R\" brand!\n436 Fiji Purple - L.A. Colors Color Craze Nail Lacquer Polish .44 fl oz 13mL\nL.A. COLORS\n['Nail polish. 0.44 fl oz, 13 mL.']\n{'UPC': '081555544362', 'Manufacturer': 'L.A. Colors'}\n3.9 stars<br /><br />1. This is MUCH darker than expected (tho I happen to like it). One coat will give you a purple look but more than that, this gets dark enough to look purple-black.<br />2. This dries super fast - which is a big deal to me - and that's nice until you start getting to the end of the jar. Once this gets down to the last part of the jar and begins to get tackier, it's hard to get a smooth coat on. Adding any kind of thinner makes the polish effect dull and ugly.<br />3. This is kind of a small jar or the price.<br />4. This looks really nice and smooth when the bottle is new but the polish chips easily with more than 1 coat.<br /><br />Overall, this is a good polish if you want something of a darker color, but it doesn't last very long.<br /><br />I don't know what it means that I want to buy some more of this color - even though I think the price is too high.\nDeep color & fast drying but chips\nBee and You 100% Natural Moisturizing Lip Balm, Original Beeswax with Propolis + Raw Honey + Vitamin E + Shea Butter, 0.17 oz (5g)\nBee&You\n{'Brand': 'Bee&You', 'Item Form': 'Balm', 'Finish Type': 'Matte', 'Skin Type': 'Dry', 'Color': 'Colorless', 'Package Dimensions': '4.72 x 2.95 x 1.26 inches; 0.18 Ounces', 'UPC': '190853000781'}\nI got this because all 11 ingredients are things I recognize & are all \"natural\". The first ingredient is propolis and the honey is fourth. That's what is shown in the product photo. However, the ingredients are in a different order on the actual product. Still good, but not what I expected. (see my screenshot.)<br /><br />It's a tiny tube (see compared to a regular toothpick) and the actual stick of product is not very long.<br /><br />Overall, this is better than the usual basic lip balm I grab at the stores. It's kind of pricy for a lip product but I think that the ingredients are worth it & do make my lips feel more moisturized than they usually are.<br /><br />I side-eyed the price at first but then I look at the ingredients - even as shown on the package I got -  and realize it's worth it.\nGood ingredients, not perfect\nHead & Shoulders Deep Moisture Masque Royal Oils 1.7 Ounce (10 Pieces) (50ml)\nHead & Shoulders\n['Pyrithione zinc dandruff masque. My Black is Beautiful: Proudly recommends Head & Shoulders. Intensely moisturizes hair & scalp long-lasting scalp relief (Associated with dandruff, with regular usage). Sulfate, paraben & dye free All Hair Types, textured Basic conditioning']\n{'Package Dimensions': '9.25 x 7.52 x 4.45 inches; 1.32 Pounds', 'UPC': '037000779735'}\nThis is a nice mask for the price. I have short hair & can get 2 uses from each packet (you get 10 packs). The softness is better if you also use the Royal Oils shampoo. When I used a different shampoo, the results weren't as good. Next time, I am going to use a cap and maybe even some wet heat to see if that helps. I think the issue is that my hair doesn't love coconut oil which is one of the ingredients - even though it's the 6th of 11 ingredients.<br /><br />The packs are pretty hefty and I think that I could stretch the use more by adding more water to my hair beforehand. But to be honest, I think that the R.O. conditioner works better than this mask!<br /><br />Love the R.O. line and I think this will work well if I use heat or leave it on longer than 5 minutes. Keep in mind that I have REALLY dry 4C hair... I have almost the entire R.O. line and love all of them but this is my least favorite of the set & I won't buy any more of the mask.\nWorks pretty good on dry 4C",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Works pretty good on dry 4C",
    "text": "This is a nice mask for the price. I have short hair & can get 2 uses from each packet (you get 10 packs). The softness is better if you also use the Royal Oils shampoo. When I used a different shampoo, the results weren't as good. Next time, I am going to use a cap and maybe even some wet heat to see if that helps. I think the issue is that my hair doesn't love coconut oil which is one of the ingredients - even though it's the 6th of 11 ingredients.<br /><br />The packs are pretty hefty and I think that I could stretch the use more by adding more water to my hair beforehand. But to be honest, I think that the R.O. conditioner works better than this mask!<br /><br />Love the R.O. line and I think this will work well if I use heat or leave it on longer than 5 minutes. Keep in mind that I have REALLY dry 4C hair... I have almost the entire R.O. line and love all of them but this is my least favorite of the set & I won't buy any more of the mask.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71WLGrV-dYL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71WLGrV-dYL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71WLGrV-dYL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/8147HP+hIsL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/8147HP+hIsL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/8147HP+hIsL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/8147HP+hIsL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/8147HP+hIsL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/8147HP+hIsL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B07MQTMFM2",
    "parent_asin": "B07MQTMFM2",
    "user_id": "AHE6A2KMCMQSOHCMNE7JQHSAHTRQ",
    "timestamp": "2022-10-20 22:59:53.419000",
    "helpful_vote": 5,
    "verified_purchase": true,
    "main_category": "All Beauty",
    "title_meta": "Head & Shoulders Deep Moisture Masque Royal Oils 1.7 Ounce (10 Pieces) (50ml)",
    "average_rating": 4.5,
    "rating_number": 51,
    "features": [],
    "description": [
      "Pyrithione zinc dandruff masque. My Black is Beautiful: Proudly recommends Head & Shoulders. Intensely moisturizes hair & scalp long-lasting scalp relief (Associated with dandruff, with regular usage). Sulfate, paraben & dye free All Hair Types, textured Basic conditioning"
    ],
    "price": 7.98,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/519ForlP1SL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/519ForlP1SL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71nqqmfjN3L._SL1350_.jpg"
      }
    ],
    "videos": [
      {
        "title": "It really helps me with dry scalp and helps in retaining the moisture of hair and scalp! ",
        "url": "https://www.amazon.com/vdp/0e458ba8b4d14baebb2185a9b6871522?ref=dp_vse_rvc_0",
        "user_id": "/shop/remisworld"
      },
      {
        "title": "Royal Oils for Nourishing Scalp Care",
        "url": "https://www.amazon.com/vdp/094d32420d874f7ba6efa825c1ccbeba?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "EVE LOM Moisture Mask",
        "url": "https://www.amazon.com/vdp/04f1f8423f0744eca5e8920452dceb89?ref=dp_vse_rvc_2",
        "user_id": ""
      }
    ],
    "store": "Head & Shoulders",
    "categories": [],
    "details": {
      "Package Dimensions": "9.25 x 7.52 x 4.45 inches; 1.32 Pounds",
      "UPC": "037000779735"
    },
    "bought_together": null
  }
}