{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/06/21\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['J. Lee Thompson'], 'Producers': ['Arthur P. Jacobs'], 'Starring': ['Shirley MacLaine', 'Paul Newman', 'Robert Mitchum']}\nReview Text: ... and that was the line that I remembered from having seen this movie as a child.  It made an indelible impression.  I loved it then, and loved it now that Prime has made it available to watch again all these years later.  A shapely Shirley MacLaine in a multitude of weird and wonderful 60's outfits by Edith Head, takes the rags to riches story to another level.  All she wants is the simple life with a failure of a man, and each man she marries becomes a raging success, only adding to her growing and enormous fortune as their successes find a kitschy way to kill them, one by one, leaving poor Shirley with all that money.  As she describes her history to a psychologist throughout the movie, she compares each life to a kind of movie, starting out with a cute Charlie Chaplin-style (performed by Dick Van Dyke), and in my opinion, most memorable with \"Lush Budget Productions,\" performed with Robert Mitchum.  This movie was Hollywood laughing at itself, it's definitely worth a watch, with a bit of philosophy thrown in, and a joyous happy ending with four kids.  Enjoy!\nReview Title: Simplify, simplify, our lives are frittered away in details!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Steven Spielberg', 'Peter Jackson', 'Kathleen Kennedy'], 'Starring': ['Jamie Bell', 'Andy Serkis', 'Simon Pegg'], 'Studio': ['Epix']}\nSo maybe I'm a child at heart.  Sometimes you really get tired of blood 'n guts etc etc etc.  Sometimes a good ol' cute good guy mean bad guy lots of action adventure is just the thing.  So this is for those times.  I wouldn't mind watching this again.\nHappy ending youth oriented, I loved it\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Kay', 'Félix Enríquez Alcalá', 'Allan Kroeker', 'Jamie Barber', 'Emile B. Levisetti', 'Kate Woods', 'J. Miller Tobin', 'Christopher Gorham', 'Larysa Kondracki', 'Ken Girotti'], 'Starring': ['Piper Perabo', 'Christopher Gorham', 'Peter Gallagher']}\nNot many series hubby enjoys watching but this is one of them;  characters, plot, action, all enjoyable and fit what he likes.\nEnjoyable watchable series\nJack Reacher\nSuspense, Drama, Malicious, Tense\n[\"A homicide investigator digs deeper into a case involving a trained military sniper who shot five random victims. Based on a book in Lee Child's crime series.\"]\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher McQuarrie'], 'Producers': ['Tom Cruise', 'Don Granger', 'Paula Wagner', 'Gary Levinsohn', 'Jack Myers', 'Ken Kamins', 'Kevin Messick', 'David Ellison'], 'Starring': ['Tom Cruise', 'Rosamund Pike', 'Richard Jenkins']}\nBut then, I've read all the Jack Reacher BOOKS.  So I knew I would be watching hero-Reacher using his incredible powers of induction and deduction, muscle-power, fight-moxie, and the bad guys were in truuu-ble.  Action-packed, great chase-scene, only moderate blood and gore, solid view-ability ... so I actually watched it.\nI don't watch a lot of movies but I sat and watched this.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Quentin Tarantino'], 'Producers': ['Lawrence Bender'], 'Starring': ['Pam Grier', 'Samuel L. Jackson', 'Robert Forster']}\nPlot, plot, plot, is really excellent in this great old movie.  But the rest is pretty darned great, too, the actors/actresses, the acting, the camera work, well, everything that goes in to putting together a movie, it's all really really good;  you have to watch kind of carefully to put it all together, but it's definitely worth watching and re-watching.\nIt all holds together so cleverly\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Allan Dwan'], 'Producers': ['Nathan Scott'], 'Starring': ['Ruth Warrick', 'Natalie Wood', 'Walter Brennan'], 'Studio': ['Paramount']}\nThe little boy with the wild hair and glowering look and his sleek glib daddy were the &#34;villains&#34; of this delightful 1947 charmer.  Bad spoiled little boy with big slingshot and big &#34;something&#34; in the slingshot he kept threatening to whop cute little Jenny (Natalie Wood) with.  He never got to actually do it but I got the implication that slingshot well could have broken her arm.  As with old movies, the many details from the past (white picket fence full of rosebush after rosebush, glass dishes with ticks, old microscope, threat of Rocky Mountain Spotted Fever, male-female interactions, all have the charm and reasonable authenticity that can only be experienced by watching old movies.  &#34;Essence of charm.&#34;  And of course, Natalie Wood as a little girl had her own loveliness, perhaps SOMEbody was trying to find a Shirley Temple clone.  Personally, I am very glad to have had the opportunity to watch something that brings back the &#34;old days&#34; with an engaging plot handily concluded by happy coincidence thrown in.\nBlast from the Past with Class\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['J. Lee Thompson'], 'Producers': ['Arthur P. Jacobs'], 'Starring': ['Shirley MacLaine', 'Paul Newman', 'Robert Mitchum']}\n... and that was the line that I remembered from having seen this movie as a child.  It made an indelible impression.  I loved it then, and loved it now that Prime has made it available to watch again all these years later.  A shapely Shirley MacLaine in a multitude of weird and wonderful 60's outfits by Edith Head, takes the rags to riches story to another level.  All she wants is the simple life with a failure of a man, and each man she marries becomes a raging success, only adding to her growing and enormous fortune as their successes find a kitschy way to kill them, one by one, leaving poor Shirley with all that money.  As she describes her history to a psychologist throughout the movie, she compares each life to a kind of movie, starting out with a cute Charlie Chaplin-style (performed by Dick Van Dyke), and in my opinion, most memorable with \"Lush Budget Productions,\" performed with Robert Mitchum.  This movie was Hollywood laughing at itself, it's definitely worth a watch, with a bit of philosophy thrown in, and a joyous happy ending with four kids.  Enjoy!\nSimplify, simplify, our lives are frittered away in details!",
  "profile": "**User Profile Summary:**\n\n- **Genuine Preferences:**\n  - Enjoys heartwarming, adventurous narratives with a focus on character-driven stories, particularly those that feature clear hero vs. villain dynamics.\n  - Values uplifting, light-hearted themes with satisfying outcomes, showing a preference for content that evokes nostalgia and accessibility.\n  - While prioritizing family-friendly series, the user embraces action-packed thrillers and narratives with more mature themes as long as they maintain strong character arcs and clear heroic presences.\n  - Recently demonstrated a fondness for classic films, appreciating their charm and authenticity, especially stories that explore rags-to-riches themes with engaging plots and philosophical undertones.\n\n- **Behavior Patterns:**\n  - Tends to rate media products highly, with an average rating of 4.7, reflecting a consistent search for enjoyable, quality entertainment.\n  - Displays a refined taste for well-crafted storytelling from renowned directors, valuing high production values, engaging character development, and intricate plots.\n  - Engages with narratives that blend nostalgic elements with nuanced storytelling and character exploration while enjoying filmic self-reflection.\n\n- **Interaction Insights:**\n  - Maintains a playful approach to entertainment, often selecting series that resonate with both personal and shared family interests.\n  - Enjoys narratives featuring strong protagonists using their skills to overcome challenges, reinforcing a preference for adventurous stories with tension and resolution.\n  - Recently expressed a love for films that balance humor and depth, showcasing a broader appreciation for storytelling that is both entertaining and thought-provoking.\n\nOverall, this user is drawn to adventurous, engaging narratives that blend nostalgia, nuanced storytelling, and broader themes of heroism and self-discovery.",
  "metrics": {
    "rouge1_f": 0.1581818181818182,
    "rouge2_f": 0.012750455373406196,
    "rougeL_f": 0.07636363636363636,
    "meteor": 0.05285678328718853,
    "bleu1": 0.01225347606296794,
    "bleu2": 0.003247381856749546,
    "bleu3": 0.0005066915624924429,
    "bleu4": 0.00020031514342953605,
    "bertscore_precision": 0.38377395272254944,
    "bertscore_recall": 0.473619282245636,
    "bertscore_f1": 0.4239892065525055
  }
}