{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: A Beautiful Mind (Widescreen)(2001)\nReview Date: 2022/07/06\nStore: Russell Crowe  (Actor),     Jennifer Connelly  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\nProduct Description: ['Winner of 4 Academy Awards, including Best Picture, A Beautiful Mind is directed by Academy Award winner Ron Howard and produced by long-time partner and collaborator, Academy Award winner Brian Grazer. A Beautiful Mind stars Russell Crowe in an astonishing performance as brilliant mathematician John Nash, on the brink of international acclaim when he becomes entangled in a mysterious conspiracy. Now only his devoted wife (Academy Award winner Jennifer Connelly) can help him in this powerful story of courage, passion and triumph.', 'Bonus Content:', 'Feature Commentary with Director Ron Howard', 'Feature Commentary with Director Ron Howard', 'Feature Commentary with Screenwriter Akiva Goldsman', 'Feature Commentary with Screenwriter Akiva Goldsman', \"Deleted Scenes with Director's Commentary\", \"Deleted Scenes with Director's Commentary\", 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features', 'DVD-ROM Features', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Mike Hill, Judd Hirsch, Austin Pendleton, Jason Gray-Stanford, Jennifer Connelly, Adam Goldberg, Josh Lucas, Christopher Plummer, Russell Crowe, Ron Howard, Dan Hanley, Akiva Goldsman, Ed Harris, Brian Grazer, Anthony Rapp, Paul BettanyMike Hill, Judd Hirsch, Austin Pendleton, Jason Gray-Stanford, Jennifer Connelly, Adam Goldberg, Josh Lucas, Christopher Plummer, Russell Crowe, Ron Howard, Dan Hanley, Akiva Goldsman, Ed Harris, Brian Grazer, Anthony Rapp, Paul Bettany  See more', 'Initial release date': '2006-08-22', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.56 x 5.31 x 0.67 inches; 2.4 Ounces', 'Item model number': '61030265', 'Director': 'Ron Howard', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 16 minutes', 'Release date': 'August 22, 2006', 'Actors': 'Russell Crowe, Jennifer Connelly, Ed Harris, Paul Bettany, Adam Goldberg', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Producers': 'Brian Grazer, Ron Howard', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Akiva Goldsman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: His WIFE.  His WIFE!  supported him AND loved him even through the worst of her own despair.  When in the movie they had a conversation about what's real, and she took her hand or his hand, and caressed each others' face, to me, that was beautiful.  THIS is what's real, iirc, is what she said.  Love.<br /><br />my opinion:  love is part of spirit, which carries on after death.  Love is a mystery as mentioned in the movie;  love and the spirit, both mysteries above the realm of body and mind.\nReview Title: Love is what is real\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Steven Spielberg', 'Peter Jackson', 'Kathleen Kennedy'], 'Starring': ['Jamie Bell', 'Andy Serkis', 'Simon Pegg'], 'Studio': ['Epix']}\nSo maybe I'm a child at heart.  Sometimes you really get tired of blood 'n guts etc etc etc.  Sometimes a good ol' cute good guy mean bad guy lots of action adventure is just the thing.  So this is for those times.  I wouldn't mind watching this again.\nHappy ending youth oriented, I loved it\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Kay', 'Félix Enríquez Alcalá', 'Allan Kroeker', 'Jamie Barber', 'Emile B. Levisetti', 'Kate Woods', 'J. Miller Tobin', 'Christopher Gorham', 'Larysa Kondracki', 'Ken Girotti'], 'Starring': ['Piper Perabo', 'Christopher Gorham', 'Peter Gallagher']}\nNot many series hubby enjoys watching but this is one of them;  characters, plot, action, all enjoyable and fit what he likes.\nEnjoyable watchable series\nJack Reacher\nSuspense, Drama, Malicious, Tense\n[\"A homicide investigator digs deeper into a case involving a trained military sniper who shot five random victims. Based on a book in Lee Child's crime series.\"]\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher McQuarrie'], 'Producers': ['Tom Cruise', 'Don Granger', 'Paula Wagner', 'Gary Levinsohn', 'Jack Myers', 'Ken Kamins', 'Kevin Messick', 'David Ellison'], 'Starring': ['Tom Cruise', 'Rosamund Pike', 'Richard Jenkins']}\nBut then, I've read all the Jack Reacher BOOKS.  So I knew I would be watching hero-Reacher using his incredible powers of induction and deduction, muscle-power, fight-moxie, and the bad guys were in truuu-ble.  Action-packed, great chase-scene, only moderate blood and gore, solid view-ability ... so I actually watched it.\nI don't watch a lot of movies but I sat and watched this.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Quentin Tarantino'], 'Producers': ['Lawrence Bender'], 'Starring': ['Pam Grier', 'Samuel L. Jackson', 'Robert Forster']}\nPlot, plot, plot, is really excellent in this great old movie.  But the rest is pretty darned great, too, the actors/actresses, the acting, the camera work, well, everything that goes in to putting together a movie, it's all really really good;  you have to watch kind of carefully to put it all together, but it's definitely worth watching and re-watching.\nIt all holds together so cleverly\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Allan Dwan'], 'Producers': ['Nathan Scott'], 'Starring': ['Ruth Warrick', 'Natalie Wood', 'Walter Brennan'], 'Studio': ['Paramount']}\nThe little boy with the wild hair and glowering look and his sleek glib daddy were the &#34;villains&#34; of this delightful 1947 charmer.  Bad spoiled little boy with big slingshot and big &#34;something&#34; in the slingshot he kept threatening to whop cute little Jenny (Natalie Wood) with.  He never got to actually do it but I got the implication that slingshot well could have broken her arm.  As with old movies, the many details from the past (white picket fence full of rosebush after rosebush, glass dishes with ticks, old microscope, threat of Rocky Mountain Spotted Fever, male-female interactions, all have the charm and reasonable authenticity that can only be experienced by watching old movies.  &#34;Essence of charm.&#34;  And of course, Natalie Wood as a little girl had her own loveliness, perhaps SOMEbody was trying to find a Shirley Temple clone.  Personally, I am very glad to have had the opportunity to watch something that brings back the &#34;old days&#34; with an engaging plot handily concluded by happy coincidence thrown in.\nBlast from the Past with Class\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['J. Lee Thompson'], 'Producers': ['Arthur P. Jacobs'], 'Starring': ['Shirley MacLaine', 'Paul Newman', 'Robert Mitchum']}\n... and that was the line that I remembered from having seen this movie as a child.  It made an indelible impression.  I loved it then, and loved it now that Prime has made it available to watch again all these years later.  A shapely Shirley MacLaine in a multitude of weird and wonderful 60's outfits by Edith Head, takes the rags to riches story to another level.  All she wants is the simple life with a failure of a man, and each man she marries becomes a raging success, only adding to her growing and enormous fortune as their successes find a kitschy way to kill them, one by one, leaving poor Shirley with all that money.  As she describes her history to a psychologist throughout the movie, she compares each life to a kind of movie, starting out with a cute Charlie Chaplin-style (performed by Dick Van Dyke), and in my opinion, most memorable with \"Lush Budget Productions,\" performed with Robert Mitchum.  This movie was Hollywood laughing at itself, it's definitely worth a watch, with a bit of philosophy thrown in, and a joyous happy ending with four kids.  Enjoy!\nSimplify, simplify, our lives are frittered away in details!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jack Bender', 'Peter Leto', 'David Barrett', 'Sergio Mimica-Gezzan', 'Kari Skogland', 'Eriq La Salle', 'Edward Ornelas', 'Peter Weller', 'Roxann Dawson', 'Paul A. Edwards'], 'Starring': ['Mike Vogel', 'Rachelle Lefevre', 'Alexander Koch'], 'Studio': ['CBS']}\nThis show has caught me which is unusual because I don't watch much TV at all.  But this has been a gripper from the start.  I kind of hope the dome actually DOES have a mind of its own, actually IS protecting the people inside ... but things took a really weird twist a few weeks ago when, by jumping off an underground cliff, people from inside the dome somehow fell through to land outside the dome.  So totally weird that now there's no telling WHAT's going to happen next.  But I'm still caught in this show's grip.<br /><br />And if we miss an episode we're both happy to pull it up from Amazon, even nicer 'cause no commercials!\nIt's been a gripper from the start\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ethan Coen'], 'Producers': ['Ethan Coen'], 'Starring': ['Jeff Bridges', 'John Goodman', 'Julianne Moore']}\nI saw this years ago and thought it was hilarious.  But hey, the movie changed!  It can't be ME that has changed, can it?  Where before I found the Dude hapless and enjoyable, now I find him irresponsible and his friend Walter intolerable.  This movie has, I suppose, given me insight into the effect of about the last 15 years.  I am now more grim, and far less inclined to forgive or think funny the various stupidities and crazinesses so well acted by the players.  If you haven't watched this in over 10 years, try it again, just to see;  we all today have seen too many crazinesses end in real tragedies for some of the things we thought funny, then, to seem funny, now.\nInsight into time\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['Frank Mancuso Jr.'], 'Starring': ['Robert De Niro', 'Jean Reno']}\nGreat actors, great French scenery, horrifying chase scene, complex plot almost to the point of makng this a who-dun-it.  This is one of those you could easily watch again.  Enjoyable and engaging.\nWell done mix of action-adventure, thriller, and whodunit\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Randy Daudlin'], 'Producers': ['Joshua Gray'], 'Starring': ['Steve Byers', 'Kathleen Robinson', 'Maury Chaykin']}\nI enjoyed some parts of this.  The idea that somebody is going to invent a new technology and use it for their own benefit does make sense, doesn't it?  Nobody will suspect it's being used because nobody else knows it exists.<br />Could it be it's already happened ...\nTheir ignorance is my bliss\nA Beautiful Mind (Widescreen)(2001)\nRussell Crowe  (Actor),     Jennifer Connelly  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Winner of 4 Academy Awards, including Best Picture, A Beautiful Mind is directed by Academy Award winner Ron Howard and produced by long-time partner and collaborator, Academy Award winner Brian Grazer. A Beautiful Mind stars Russell Crowe in an astonishing performance as brilliant mathematician John Nash, on the brink of international acclaim when he becomes entangled in a mysterious conspiracy. Now only his devoted wife (Academy Award winner Jennifer Connelly) can help him in this powerful story of courage, passion and triumph.', 'Bonus Content:', 'Feature Commentary with Director Ron Howard', 'Feature Commentary with Director Ron Howard', 'Feature Commentary with Screenwriter Akiva Goldsman', 'Feature Commentary with Screenwriter Akiva Goldsman', \"Deleted Scenes with Director's Commentary\", \"Deleted Scenes with Director's Commentary\", 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features', 'DVD-ROM Features', ']]>']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Mike Hill, Judd Hirsch, Austin Pendleton, Jason Gray-Stanford, Jennifer Connelly, Adam Goldberg, Josh Lucas, Christopher Plummer, Russell Crowe, Ron Howard, Dan Hanley, Akiva Goldsman, Ed Harris, Brian Grazer, Anthony Rapp, Paul BettanyMike Hill, Judd Hirsch, Austin Pendleton, Jason Gray-Stanford, Jennifer Connelly, Adam Goldberg, Josh Lucas, Christopher Plummer, Russell Crowe, Ron Howard, Dan Hanley, Akiva Goldsman, Ed Harris, Brian Grazer, Anthony Rapp, Paul Bettany  See more', 'Initial release date': '2006-08-22', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.56 x 5.31 x 0.67 inches; 2.4 Ounces', 'Item model number': '61030265', 'Director': 'Ron Howard', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 16 minutes', 'Release date': 'August 22, 2006', 'Actors': 'Russell Crowe, Jennifer Connelly, Ed Harris, Paul Bettany, Adam Goldberg', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Producers': 'Brian Grazer, Ron Howard', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Akiva Goldsman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nHis WIFE.  His WIFE!  supported him AND loved him even through the worst of her own despair.  When in the movie they had a conversation about what's real, and she took her hand or his hand, and caressed each others' face, to me, that was beautiful.  THIS is what's real, iirc, is what she said.  Love.<br /><br />my opinion:  love is part of spirit, which carries on after death.  Love is a mystery as mentioned in the movie;  love and the spirit, both mysteries above the realm of body and mind.\nLove is what is real",
  "profile": "**User Profile Summary:**\n\n- **Genuine Preferences:**\n  - Enjoys heartwarming, character-driven narratives with clear hero vs. villain dynamics.\n  - Values uplifting themes with satisfying outcomes and nostalgic elements while also appreciating action-packed thrillers and complex, mature stories featuring strong character arcs.\n  - Recently shown an increasing interest in narratives that explore love and personal relationships, particularly those that echo themes of courage, support, and the deeper mysteries of existence.\n\n- **Behavior Patterns:**\n  - Consistently rates media highly, averaging around 4.7, but displays openness to lower-rated content if thematic resonance is strong.\n  - Favors well-crafted storytelling from renowned directors, demonstrating an appreciation for high production values and engaging character development.\n  - Engages with narratives enriched by humor and emotion, valuing unpredictability and profound character dynamics, especially those portraying personal growth and shifting perspectives.\n  - Shows a particular appreciation for stories exploring deeper philosophical themes, demonstrating nuanced insights into love as a transcendent experience.\n\n- **Interaction Insights:**\n  - Maintains a playful approach to entertainment, selecting family-friendly series that encourage shared viewing experiences.\n  - Enjoys narratives where characters confront unusual challenges, focusing on adventurous tales with tension, resolution, and depth.\n  - Engages thoughtfully with media, reflecting on contemporary issues and the evolving nature of character relationships over time.",
  "metrics": {
    "rouge1_f": 0.088,
    "rouge2_f": 0.009009009009009009,
    "rougeL_f": 0.039,
    "meteor": 0.02613875830766737,
    "bleu1": 1.8455943408616037e-05,
    "bleu2": 6.233977702217422e-06,
    "bleu3": 2.542342924635369e-06,
    "bleu4": 7.685104120522991e-07,
    "bertscore_precision": 0.3501100540161133,
    "bertscore_recall": 0.48203229904174805,
    "bertscore_f1": 0.40561413764953613
  }
}