{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 7JHH WIGS Long Wavy Curly Wig With Bangs Natural Hair Dye Wig for Women (25inch, Red)\nReview Date: 2021/08/13\nStore: 7JHH WIGS\nAverage Rating: 4.7\nProduct Details: {'Item Dimensions LxWxH': '13.78 x 8.66 x 1.57 inches', 'Hair Type': 'Wavy, Curly', 'Brand': '7JHH WIGS', 'Age Range (Description)': 'Adult', 'Product Dimensions': '13.78 x 8.66 x 1.57 inches; 12.7 Ounces', 'UPC': '682601933330'}\nReview Text: This wig is nice but a little thin, the value for money is great though. The bangs especially are really cute if you get them positioned correctly.\nReview Title: Nice wig, a little thin\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "3D Mink Eyelashes Natural Long Lashes 2 in 1 Self-adhesive Eyeliner Instead of Adhesive 5 Different Styles Pairs Kits Sets with Tweezers , NO NEED GLUE\nPURELEOR\n{'Brand': 'PURELEOR', 'Material': 'Mink Fur', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '5.00 Count', 'Package Dimensions': '9 x 6 x 1 inches; 2.4 Ounces', 'UPC': '750810450143'}\nPros: it came with everything pictured, a lash applicator, the tube of “eyeliner glue” and 5 pairs of lashes in varying thickness. The box itself was nicely packaged. For reference, I used the thinnest/most natural pair at the top for my review.<br /><br />Cons: the tube of eyeliner was either sitting so long it completely dried up, or the glue caused the eyeliner to adhere to the inside of the tube, but it was almost impossible to get ANY of the liner on my lid.<br /><br />When I finally got a line to go on, it was akin to what attempting to using a dried up Expo on whiteboard looks like- I had to scrub the pen on my eyelid in an attempt to lay down any product at all, resulting in a very pitiful looking eyeliner application.<br /><br /> I fixed the lashes to the appropriate area, and within 5 minutes they were coming off at the corners. I tried to remedy the overall result somewhat by adding my own liner, and that example is on the second photo, bottom right corner (photo with eyeshadow applied).<br /><br />The lashes themselves were the quality you’d expect from a multi pack at this price. Some of the individual lashes had fallen out as I opened the package as well.<br /><br />Final thoughts: just use eyelash glue and get quality lashes. It doesn’t take any more time to apply and at least you can apply eyeliner to suit your taste.\nGlue + Eyeliner probably shouldn’t mix\n7JHH WIGS Long Wavy Curly Wig With Bangs Natural Hair Dye Wig for Women (25inch, Red)\n7JHH WIGS\n{'Item Dimensions LxWxH': '13.78 x 8.66 x 1.57 inches', 'Hair Type': 'Wavy, Curly', 'Brand': '7JHH WIGS', 'Age Range (Description)': 'Adult', 'Product Dimensions': '13.78 x 8.66 x 1.57 inches; 12.7 Ounces', 'UPC': '682601933330'}\nThis wig is nice but a little thin, the value for money is great though. The bangs especially are really cute if you get them positioned correctly.\nNice wig, a little thin",
  "profile": "The user demonstrates a strong preference for beauty products, particularly focusing on practicality and ease of use with items like eyelashes and eyeliner. They value convenience and have shown interest in self-adhesive products; however, past experiences have led to dissatisfaction with product performance, particularly regarding the effectiveness of eyeliner and the quality of lashes. While they appreciate variety in lash styles and attractive packaging, the user tends to be critical of items that fail to meet their expectations, suggesting a return to traditional adhesive methods for superior results. \n\nTheir reviews reflect a preference for higher-quality items over budget options, emphasizing usability and effectiveness in enhancing makeup application experiences. They are open to investing in better-performing alternatives in the future.\n\nRecently, the user also purchased a wig, highlighting an interest in hair products. Although they found the wig to be a bit thin, they appreciated the overall value for money and the cute bangs. This suggests an evolving interest in different beauty products that extend beyond makeup, while still maintaining their critical eye for quality and performance. Overall, the user seeks beauty items that combine aesthetics with functionality, prioritizing comfort and usability in their beauty routine.",
  "metrics": {
    "rouge1_f": 0.2644628099173553,
    "rouge2_f": 0.023217247097844115,
    "rougeL_f": 0.12892561983471074,
    "meteor": 0.11169780666125102,
    "bleu1": 0.09449401275825628,
    "bleu2": 0.03427393611689088,
    "bleu3": 0.011007568968619888,
    "bleu4": 0.003512054955959133,
    "bertscore_precision": 0.36459118127822876,
    "bertscore_recall": 0.4447256326675415,
    "bertscore_f1": 0.40069112181663513
  }
}