{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 24K Gold Under Eye Mask– 20 Pairs- Under Eye Patches with Face Massager Roller, Anti-Aging Hyaluronic Acid Collagen Eye Masks for Dark Circles and Puffiness Dark Under Eyes Treatment\nReview Date: 2020/11/16\nStore: FRLEDM\nAverage Rating: 4.0\nProduct Details: {'Brand': 'FRLEDM', 'Special Feature': 'Anti Aging', 'Unit Count': '21.00 Count', 'Number of Items': '40', 'Package Dimensions': '7.5 x 7 x 1.5 inches; 11.99 Ounces', 'Batteries': '1 AA batteries required. (included)'}\nReview Text: These eye masks are great! They're individually wrapped (which I love). They actually stay put and are cool to the touch (which feels great under my tired eyes) I know many people like using them in the A.M. but I like using them before bedtime. I find that my eyes look refreshed upon waking, they hydrate the delicate area under my eyes. It also includes the pulse facial massager which actually feels nice (has even helped with minor headaches) and helps my night time fave serums to absorb nicely.\nReview Title: Individually wrapped pairs that are cool to the touch and hydrating.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Bath Pillow for Bathtub, Spa Pillows for Neck Head Shoulders Back Support, Thick Bath Tub Cushion with 6 Suction Cups Men Women Breathable Comfort 4D Air Mesh Quick Dry Headrest Bath Accessories\nAzun\n{'Brand': 'Azun', 'Material': 'Mesh', 'Item Dimensions LxWxH': '13 x 11 x 1 inches', 'Product Care Instructions': 'Hand Wash Only', 'Product Dimensions': '13 x 11 x 1 inches; 11.36 Ounces'}\nThis bath pillow is so soft and comfortable! It offers perfect neck support for true relaxation. I love that it has big suction cups that are durable and strong, it allows the pillow to stay in place and not float away like other neck pillows I've owned. I squeezed out the water and hung it in my shower until it stopped dripping all the access water, then I just hung in on my towel hooks to completely dry (it's lightweight and dried fast). This is the perfect bathtime accessory, I highly recommend it.\nPerfect for comfort and relaxation 🛀\nPumice Stone for Feet, 2 in 1 Double Sided Hard Skin Callus Remover for Feet,Hands and Body, Exfoliator Pedicure File Block Callus Remover Scrubber (Pack of 4)\nKSang\n{'Brand': 'KSang', 'Material': 'Volcanic Stone', 'Is Electric': 'No', 'Item Form': 'Scrubber, Filer', 'Unit Count': '4.00 Count', 'Package Dimensions': '6 x 5.6 x 2.7 inches; 3.21 Ounces', 'UPC': '192242957393'}\nPerfect duo! Each side has it's benefits. I like to start with the white side and finish with the color side for perfectly soft results.\nGreat 2 in 1 pumice stone\n24K Gold Under Eye Mask– 20 Pairs- Under Eye Patches with Face Massager Roller, Anti-Aging Hyaluronic Acid Collagen Eye Masks for Dark Circles and Puffiness Dark Under Eyes Treatment\nFRLEDM\n{'Brand': 'FRLEDM', 'Special Feature': 'Anti Aging', 'Unit Count': '21.00 Count', 'Number of Items': '40', 'Package Dimensions': '7.5 x 7 x 1.5 inches; 11.99 Ounces', 'Batteries': '1 AA batteries required. (included)'}\nThese eye masks are great! They're individually wrapped (which I love). They actually stay put and are cool to the touch (which feels great under my tired eyes) I know many people like using them in the A.M. but I like using them before bedtime. I find that my eyes look refreshed upon waking, they hydrate the delicate area under my eyes. It also includes the pulse facial massager which actually feels nice (has even helped with minor headaches) and helps my night time fave serums to absorb nicely.\nIndividually wrapped pairs that are cool to the touch and hydrating.",
  "profile": "**User Summary:**\n\n- **Comfort & Relaxation:** The user continues to prioritize comfort in their personal care routines, with a strong preference for products that enhance relaxation and provide soothing effects, as seen in their recent enjoyment of cooling eye masks that hydrate tired skin.\n- **Effective Design:** They value practical benefits, preferring multi-functional items which streamline their self-care practices, like products that not only treat but also provide a massaging effect for enhanced relaxation and efficacy.\n- **Durability & Care:** The user favors durable, low-maintenance items, underscoring their inclination towards products that are easy to use and provide lasting results, reinforcing their commitment to quality.\n- **Positive Experience Sharing:** They actively engage with brands, sharing positive feedback on products that meet their high standards for quality and utility, affirming their role as a knowledgeable consumer who appreciates effectiveness.\n- **High-Quality Materials:** Preference for effective, high-quality materials aligns with their goal of achieving optimal results in their beauty regimen, as they seek products that contribute positively to their self-care experiences.\n- **Wellness Focus:** The user’s commitment to wellness is strengthened by their choice of self-care tools that promote relaxation and relieve tension, demonstrating an ongoing dedication to enhancing their overall well-being through thoughtful grooming practices.\n\nOverall, the user embodies a desire for effective, functional, and high-quality personal care products that enhance their grooming routine and support their self-care journey.",
  "metrics": {
    "rouge1_f": 0.22324159021406728,
    "rouge2_f": 0.006134969325153374,
    "rougeL_f": 0.08256880733944953,
    "meteor": 0.10618756812979584,
    "bleu1": 0.12568533756982841,
    "bleu2": 0.019312926278252186,
    "bleu3": 0.003815337526093863,
    "bleu4": 0.0016972938390958708,
    "bertscore_precision": 0.36979013681411743,
    "bertscore_recall": 0.43739640712738037,
    "bertscore_f1": 0.40076208114624023
  }
}