{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Coach Carter\nReview Date: 2014/10/29\nStore: Various  (Actor, Director)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Coach Carter (DVD)', 'Academy Award nominee Samuel L. Jackson stars in the inspiring true stor y of controversial high school basketball coach Ken Carter, who benched his entire undefeated team for poor academic performance, in order to te ach his players the importance of education.', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Sports', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 5.1)', 'Runtime': '2 hours and 17 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '10309905', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 17 minutes', 'Release date': 'June 21, 2005', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Touching story! Not a super happy ending but it gives you hope!\nReview Title: Not a super happy ending but it gives you hope\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Crooklyn [DVD]\nAlfre Woodard  (Actor),     Delroy Lindo  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Make yourself at home with the Carmichael family as they experience one very special summer in their Brooklyn neighborhood that they\\'ve affectionately nicknamed \"Crooklyn.\" Renowned director Spike Lee fashions a bold, flavorful picture of family life that People Magazine calls his \"most affectionate work.\" Academy Award® nominee Alfre Woodard stars as Carolyn, a loving, but fiercely independent mother who along with her musician husband (Delroy Lindo) struggles to raise her family in difficult but often wonderful circumstances. Complemented by an energizing, vintage R&B soundtrack, this tender, colorful film is a fitting tribute to an American family.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', ']]>', 'Amazon.com', \"Spike Lee's semiautobiographical, 1994 film about the good and bad times for a Brooklyn family in the '70s has passion and nostalgic good feeling, but it is also a mess of random reflections and arbitrary storytelling. The centerpiece of the movie is a little girl (Zelda Harris) who views the ups and downs of her parents' experiences (mom and dad are played by Delroy Lindo and Alfre Woodard), and who navigates the life of her neighborhood. Lee tosses in a lot of '70s detail (watching\", 'The Partridge Family', \") and other diversions (Harris's journey through suburbia), but he has no master sensibility controlling the flow of it all. The film is more wearying than anything, although bright spots include Lindo's fine performance as a talented man suffering from irrelevance.\", '--Tom Keogh']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': '2020515', 'Director': 'Spike Lee', 'Media Format': 'Multiple Formats, Closed-captioned, Anamorphic, Color, NTSC, Widescreen, Dolby', 'Run time': '1 hour and 54 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Alfre Woodard, Delroy Lindo, Spike Lee, David Patrick Kelly, Zelda Harris', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Spike Lee', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Joie Susannah Lee, Cinque Lee, Spike Lee', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOne of my favorite films from my chilhood. My mom loves this movie. We had it on VHS and it didn't work anymore,\nFavorite Movie\nBlack Nativity\nForest Whitaker  (Actor),     Angela Bassett  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"In a contemporary adaptation of Langston Hughes' celebrated play, the holiday musical drama BLACK NATIVITY follows Langston (Jacob Latimore), a street-wise teen from Baltimore raised by a single mother, as he journeys to New York City to spend the Christmas holiday with his estranged relatives Reverend Cornell and Aretha Cobbs (Forest Whitaker and Angela Bassett). Unwilling to live by the imposing Reverend Cobbs' rules, a frustrated Langston is determined to return home to his mother, Naima (Jennifer Hudson). Langston embarks on a surprising and inspirational journey and along with his new friends, and a little divine intervention, he discovers the true meaning of faith, healing, and family.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, AC-3, NTSC, Subtitled, Dolby, Widescreen, Dubbed', 'Contributor': 'Forest Whitaker, Angela Bassett, Jennifer Hudson', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '120366', 'Media Format': 'Multiple Formats, Color, AC-3, NTSC, Subtitled, Dolby, Widescreen, Dubbed', 'Run time': '1 hour and 33 minutes', 'Release date': 'April 15, 2014', 'Actors': 'Forest Whitaker, Angela Bassett, Jennifer Hudson', 'Dubbed': 'Spanish', 'Subtitles': 'French, English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nGood Movie! Love the cast!!\nFive Stars\nJohnson Family Vacation\nCedric the Entertainer  (Actor),     Shannon Elizabeth  (Actor),     Christopher Erskin  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Buckle up for the wildest road trip of the year! Cedric the Entertainer leads an all-star cast in this hilarious comedy adventure about a misfit family trying to survive outrageous obstacles (including each other) on a cross-country trek to their annual f']\n{'Genre': 'Kids & Family, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Closed-captioned, Subtitled, Dubbed, Full Screen, WidescreenMultiple Formats, Anamorphic, Color, Dolby, NTSC, Closed-captioned, Subtitled, Dubbed, Full Screen, Widescreen  See more', 'Contributor': 'Vanessa Williams, Todd R. Jones, Christopher Erskin, Bow Wow, Shannon Elizabeth, Aloma Wright, Earl Richey Jones, Jennifer Freeman, Cedric the Entertainer, Gabby Soleil, Shari Headley, Steve Harvey, Rodney Perry, Solange Knowles, Philip BoldenVanessa Williams, Todd R. Jones, Christopher Erskin, Bow Wow, Shannon Elizabeth, Aloma Wright, Earl Richey Jones, Jennifer Freeman, Cedric the Entertainer, Gabby Soleil, Shari Headley, Steve Harvey, Rodney Perry, Solange Knowles, Philip Bolden  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.25 x 0.75 inches; 2.56 Ounces', 'Item model number': 'MFR024543133087#N', 'Director': 'Christopher Erskin', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Closed-captioned, Subtitled, Dubbed, Full Screen, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'August 10, 2004', 'Actors': 'Cedric the Entertainer, Shannon Elizabeth, Bow Wow, Vanessa Williams, Solange Knowles', 'Dubbed': 'English', 'Subtitles': 'English, Spanish, French', 'Studio': 'Fox Searchlight', 'Writers': 'Earl Richey Jones, Todd R. Jones', 'Number of discs': '1'}\nFunny family movie!\nFive Stars\nAre We Done Yet?\nIce Cube  (Actor, Producer),     Nia Long  (Actor),     Steve Carr  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Now married to Suzanne, Nick Persons has bought a quiet suburban house to escape the rat race of the big city and to provide more space for his new wife and kids Lindsey and Kevin. But when his new home quickly becomes a costly \"fixer upper\" and he finds himself at the mercy of an eccentric contractor, Nick\\'s suburban dream becomes a riotous nightmare.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'John C. McGinley, Ted Hartley, Ice Cube, Nia Long, Aleisha Allen, Nia Yes, Todd Garner, Matt Alvarez, Philip Daniel Bolden, Broken Road Productions; CubeVision; RKO Pictures, Steve CarrJohn C. McGinley, Ted Hartley, Ice Cube, Nia Long, Aleisha Allen, Nia Yes, Todd Garner, Matt Alvarez, Philip Daniel Bolden, Broken Road Productions; CubeVision; RKO Pictures, Steve Carr  See more', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), French (Dolby Digital 5.1), Thai (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '17743', 'Director': 'Steve Carr', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'August 7, 2007', 'Actors': 'Ice Cube, Nia Long, John C. McGinley, Aleisha Allen, Philip Daniel Bolden', 'Dubbed': 'French, Portuguese, Spanish', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese, Korean, Thai', 'Producers': 'Ice Cube, Todd Garner, Matt Alvarez, Ted Hartley', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nLove the chemistry between Ice Cube and John McGinley! Super funny movie!\nFive Stars\nCoach Carter\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Coach Carter (DVD)', 'Academy Award nominee Samuel L. Jackson stars in the inspiring true stor y of controversial high school basketball coach Ken Carter, who benched his entire undefeated team for poor academic performance, in order to te ach his players the importance of education.', ']]>']\n{'Genre': 'Drama, Sports', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 5.1)', 'Runtime': '2 hours and 17 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '10309905', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 17 minutes', 'Release date': 'June 21, 2005', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nTouching story! Not a super happy ending but it gives you hope!\nNot a super happy ending but it gives you hope",
  "profile": "**User Summary:**\n\n- **Film Preference:** Enjoys nostalgic and family-oriented films with meaningful storytelling and inspirational narratives. The user continues to appreciate comedies that highlight family dynamics and relationships, reinforcing their love for heartfelt narratives that blend humor with emotional depth.\n- **Sentimental Value:** Strong emotional connections to childhood favorites that emphasize family values and themes of perseverance, illustrating a passion for impactful storytelling.\n- **Director Interest:** Prefers works by notable directors recognized for cultural significance, and retains an appreciation for diverse voices in film, particularly those that offer uplifting messages.\n- **Actor Appreciation:** Favors performances by respected actors in family-centric roles, with admiration for versatile talents, indicating a preference for films that showcase strong on-screen chemistry.\n- **Home Media Format:** Values collecting physical media formats, especially DVDs, demonstrating a nostalgic appreciation for tangible film experiences.\n- **Ratings Behavior:** Consistently rates favorite films highly, particularly those that resonate personally, underscoring a preference for content that evokes joy and connection.\n- **Cultural Elements:** Interested in narratives that capture rich cultural contexts, enhancing the viewing experience with themes of faith, healing, and family togetherness.\n\nRecent interactions reaffirm the user’s ongoing interest in films that deliver uplifting stories, particularly those that provide hope, even when the narratives may not conclude with traditional happy endings.",
  "metrics": {
    "rouge1_f": 0.10869565217391304,
    "rouge2_f": 0.010882708585247884,
    "rougeL_f": 0.05434782608695652,
    "meteor": 0.03157693163557412,
    "bleu1": 0.0003207704358858207,
    "bleu2": 0.00011421189799626232,
    "bleu3": 6.053510732398711e-05,
    "bleu4": 4.171812455138443e-05,
    "bertscore_precision": 0.3435441851615906,
    "bertscore_recall": 0.46674561500549316,
    "bertscore_f1": 0.39577874541282654
  }
}