{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: facetheory FaceTheory Talc Free Loose Powder, Matte Translucent Powder, Absorbs Oil and Sets Makeup, Vegan and Cruelty-Free Pink POW 0\nReview Date: 2022/07/20\nStore: facetheory\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Facetheory', 'Item Form': 'Powder', 'Color': 'Pink, Lavender, White, Black', 'Finish Type': 'Shine,Matte', 'Coverage': 'Light', 'Item model number': 'POW'}\nReview Text: For reference, I have combination skin that is very picky. I struggle with breakouts, dry skin, and redness.<br />This is a great setting powder. I tend to do my skin care routine and then do a very LIGHT dusting of this product before applying my foundation. This I put on my foundation, blush, and contour, and then apply the setting spray. I then finish with another SMALL dusting of this product using my moist beauty blender.  The trick is to use a very small amount for a pore-less look.\nReview Title: Great setting powder\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "lootaan 500 Pieces False Nails French Acrylic Fake Nails Tips Half Cover Artificial Fake Nails With Box and False Nail Clipper for Women Girl\nlootaan\n{'Material': 'Acrylic', 'Brand': 'lootaan', 'Number of Pieces': '500', 'Package Dimensions': '9 x 6 x 2 inches; 8.01 Ounces', 'UPC': '710157699223'}\nThe nails are ok quality. They are thin and flexible. However, if your nails are on the small side, these may be challenging to use. I had to file the smallest size down to use on my pinky nails.  They were decently easy to work with, but I was a little frustrated that the listing was not as described. I filed them with an e file. I began dipping my nails at home due to COVID. I am not a professional, but I am decent at working with nails. I will still use these, but I would not purchase again-especially because I can only use half of them.\nA little large and I did not receive clippers\nBEPHOLAN Natural Eyelash Growth Serum and Brow Enhancer to Grow Thicker, Longer Lashes for Long, Luscious Lashes and Eyebrows|10ML\nBEPHOLAN\n{'Package Dimensions': '5.94 x 1.18 x 1.06 inches; 0.88 Ounces'}\nI have tried to use this product for 3 weeks, but I cannot see any difference. There is barely any product in the tube. It is practically dry. You have to reinsert the wand multiple times just to get any coverage on your lashes. I cannot tell any difference except maybe they are softer. I do feel like when I use mascara after this product, the lashes seem fuller. I was really hopeful to see growth.<br /><br />Once I tried this product on my eyebrows, it seemed to make them fuller (what little product I could get out). I do not think this product is worth the price.\nI wish I would have got the mascara wand\nMIZON Cicaluronic Line, Cicaluronic Cleansing Balm, Makeup Remover, Centella Asiatica,Hyaluronic Acid, One Step Cleansing (2.7 fl oz)\nMIZON\n{'Package Dimensions': '2.99 x 2.91 x 2.05 inches; 6.74 Ounces', 'Item model number': '8809606850345'}\nI do like this cleanser, but beware if you have oily skin. It is super oily. I also do not feel like it takes off the dirt as well as other cleaners. My skin feels super soft after. I also think the packaging is super cute, and I appreciate the included applicator.  I love products with hyaluronic acid, so I am a fan of this product, especially for morning use.\nGood\nRose Quartz Roller with Derma Roller 0.25mm, Facial Kit with Microneedle and Pink Jade Rollers\nLOLYSENTA\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.1 x 1.6 inches; 8.78 Ounces', 'Item model number': 'LS17', 'UPC': '850002524062', 'Manufacturer': 'LOLYSENTA, LLC'}\nI am by no means a professional. I just recently started derma rolling. I prefer to use the micro needle roller first. It isn’t the most comfortable feeling, but you get use to it. I do it while I am watching T.V. To distract myself. While rolling, I put the jade roller in the refrigerator. Once I finish with the micro needle, I apply hyaluronic acid, and then roll with the jade roller. It is SO SOOTHING. The roller has two sides- a large end for the planes of your face, and a small end to get in smaller areas like under your eyes. I only use the micro needle roller once a week-usually on Saturday nights. It does make your face a little red, but it goes away by morning. I use the jade roller a couple times a week, especially after stressful days. Just so you know, make sure to sterilize both rollers or you will have major breakouts from spreading bacteria around. I keep alcohol in a small spritzer to use on both before each use. The  packaging was sufficient, and I would feel comfortable giving it as a gift.\nGreat starter set!\nBH DERMCENTER Retinol Serum Restores Rejuvenates and Purifies Skin, 1 oz, Reduces Appearance of Fine Lines, Non-GMO, Vegan, Cruelty Free\nBH DERMCENTER\n{'Product Dimensions': '2 x 2 x 5 inches; 1 Ounces', 'Item model number': 'BHDRETSER', 'UPC': '850004068076'}\nMy garbage skin care routine finally caught up to me, so after doing some research, I decided on this retinol serum. I use it in the evening on clean skin. I like that the product is vegan and non gmo. They product has a nice scent and a great  consistency. Since using this product, I feel as if my pores are smaller and my skin is more even overall with both color and lines. I will continue to use this product in my daily routine.\nGreat affordable product\nMeetory 6 Pieces Korean Exfoliating Bath Washcloth, 2 Sizes Exfoliating Bath Cloth Towels Scrub Mitten for Skin Massage, Removing Dry Dead Skin Cells, Cleaning Pores(Blue Green Yellow Pink)\nMeetory\n{'Product Dimensions': '9.06 x 5.91 x 0.39 inches; 2.47 Ounces'}\nI did not realize how much dead skin I had. Once using this product, it little comes off like little toilet paper rolls (I know gross). I usually use them on my husbands back. These are great to use before shaving to avoid getting ingrown hairs. I also use these once a week before applying self tanner. I use these after I have been in the shower for a few minutes and my skin has softened. Great product!\nSeriously cannot live without these\nMINETAN BODY.SKIN Tan Booster Foam - Boosts Color Results for Deeper, Darker, Longer Lasting Results, 10.14 fl oz\n{'Brand': 'MINETAN BODY.SKIN', 'Product Benefits': 'Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.   See more', 'Skin Tone': 'All', 'Material Feature': 'Certified Organic', 'Item Weight': '0.36 Kilograms', 'Product Dimensions': '21.26 x 21.26 x 87.4 inches; 12.7 Ounces', 'Item model number': 'MIH201905'}\nThis is a tan extender to use after you have already tanned. It deepens your color and adds richness. The scent is not bad, and it is a pretty large pump bottle for around $30 at the time of purchase. I do apply this product with a mitt like regular self tanners, and I use a beauty blender or brush on my hands, feet, and neck for a better blend. My only major issue with this is it goes on clear so its super challenging to apply it evenly to avoid streaking. However if you already have a base tan, this is less noticeable.\nGood for extending but a bit challenging to apply\nGel Nail Polish Kit with Gel Base and Top Coat, 12 Pcs All Seasons Skin Tones Pink Neutral Brown Gel Polish Kit, Soak Off LED Gel Nail Kit Manicure DIY Nail Art Home Salon\nBEUXITUN\n{'Brand': 'BEUXITUN', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '4.32 Fl Oz', 'Number of Items': '15', 'Liquid Volume': '0.33 Fluid Ounces', 'Package Dimensions': '8.5 x 4 x 3 inches; 1.35 Pounds'}\nI feel like this polish would be suited for a children's set. The bottles aren't small, but they do not contain much product. The colors are beautiful, but unfortunately I had chipping by the end of the day. Spending an hour on my nails for them to chip by the end of the day is a no go for me. This would be a decent set for someone to practice with since you get 15 bottles for around $20 at the time of purchase, but unfortunately it isn't very good quality.\nNice price, poor quality\nfacetheory FaceTheory Talc Free Loose Powder, Matte Translucent Powder, Absorbs Oil and Sets Makeup, Vegan and Cruelty-Free Pink POW 0\nfacetheory\n{'Brand': 'Facetheory', 'Item Form': 'Powder', 'Color': 'Pink, Lavender, White, Black', 'Finish Type': 'Shine,Matte', 'Coverage': 'Light', 'Item model number': 'POW'}\nFor reference, I have combination skin that is very picky. I struggle with breakouts, dry skin, and redness.<br />This is a great setting powder. I tend to do my skin care routine and then do a very LIGHT dusting of this product before applying my foundation. This I put on my foundation, blush, and contour, and then apply the setting spray. I then finish with another SMALL dusting of this product using my moist beauty blender.  The trick is to use a very small amount for a pore-less look.\nGreat setting powder",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Great setting powder",
    "text": "For reference, I have combination skin that is very picky. I struggle with breakouts, dry skin, and redness.<br />This is a great setting powder. I tend to do my skin care routine and then do a very LIGHT dusting of this product before applying my foundation. This I put on my foundation, blush, and contour, and then apply the setting spray. I then finish with another SMALL dusting of this product using my moist beauty blender.  The trick is to use a very small amount for a pore-less look.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71wdrMe159L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71wdrMe159L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71wdrMe159L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09KGG7QNS",
    "parent_asin": "B09KGG7QNS",
    "user_id": "AESH4UBOA6VWZ36CIYMP4JVYPOLA",
    "timestamp": "2022-07-20 13:20:44.199000",
    "helpful_vote": 2,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "facetheory FaceTheory Talc Free Loose Powder, Matte Translucent Powder, Absorbs Oil and Sets Makeup, Vegan and Cruelty-Free Pink POW 0",
    "average_rating": 4.3,
    "rating_number": 128,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31+UocpVbZL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31+UocpVbZL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51vr520xoqL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/510EaRtuMFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/510EaRtuMFL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71hJijvzKtL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41O1BJ1GsJL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41O1BJ1GsJL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61-OyUuq30L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41XI7UzeiKL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41XI7UzeiKL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71-vX0H02jL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51qu2rVcHgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51qu2rVcHgL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71aK-uUhiQL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51gyAFc+xkL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51gyAFc+xkL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61VudWq2JXL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "facetheory",
    "categories": [],
    "details": {
      "Brand": "Facetheory",
      "Item Form": "Powder",
      "Color": "Pink, Lavender, White, Black",
      "Finish Type": "Shine,Matte",
      "Coverage": "Light",
      "Item model number": "POW"
    },
    "bought_together": null
  }
}