{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/12/15\nAverage Rating: 3.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Liza Johnson'], 'Producers': ['Holly Wiersma', 'Cassian Elwes', 'Cary Elwes'], 'Starring': ['Michael Shannon', 'Kevin Spacey', 'Alex Pettyfer'], 'Studio': ['Amazon Studios']}\nReview Text: Kevin Spacey does a really good job of being Nixon.  Michael Shannon does a good job of playing Elvis once you're able to get over the fact that he doesn't look too much like him. It took me a little while to get over that at the beginning of the movie, but once I did I enjoyed the movie. It is an intriguing subject for a movie, and the idea of what could or may have happened keeps you interested. Overall it is an entertaining movie.\nReview Title: Kevin Spacey does a really good job of being Nixon\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Death Row - A History of Capital Punishment in America - A 6-Part Documentary Series\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['This hard-hitting 6-part documentary series on 2 discs, featuring interviews from experts in the field as well as archival footage, examines America\\'s history with the death penalty: it\\'s roots in frontier justice, the technologies that changed nooses and firing squads to electric chairs and lethal injections, the legal battles defining exactly what is \"cruel and unusual punishment\", the ceremonial aspect of requested \"last meals\", and some of the most notorious killers who met it as a final end']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Director': 'Various', 'Media Format': 'NTSC', 'Run time': '5 hours and 34 minutes', 'Release date': 'February 2, 2016', 'Actors': 'Various', 'Studio': 'Centre Communication', 'Number of discs': '2'}\nCan be very informative. Some points should've been more in depth, but overall it is an informative and entertaining documentary if you are interested in the history of the subject.\nInformative\nThe Stanford Prison Experiment [Blu-ray]\nBilly Crudup  (Actor),     Ezra Miller  (Actor),     Kyle Patrick Alvarez  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['What happens when a college psych study goes shockingly wrong? Based on the notorious true story, THE STANFORD PRISON EXPERIMENT stars Billy Crudup (Watchmen) as Stanford University professor Dr. Philip Zimbardo, who, in 1971, cast 24 student volunteers as prisoners and guards in a simulated jail to examine the source of abusive behavior in the prison system. The results astonished the world, as participants went from middle-class undergrads to drunk-with-power sadists and submissive victims in just a few days. Featuring an extraordinary cast including Ezra Miller, Olivia Thirlby, Tye Sheridan, Keir Gilchrist, Michael Angarano, and Thomas Mann, and created with the close participation of Dr. Zimbardo himself, THE STANFORD PRISON EXPERIMENT is a chilling, edge-of-your-seat thriller about the dark side of power and the effects of imprisonment.']\n{'Genre': 'Action & Adventure/Thrillers', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Ezra Miller, Moises Arias, Billy Crudup, Gaius Charles, Kyle Patrick Alvarez, Tye Sheridan', 'Language': 'English', 'Runtime': '2 hours and 2 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35224399', 'Director': 'Kyle Patrick Alvarez', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '2 hours and 2 minutes', 'Release date': 'January 12, 2016', 'Actors': 'Billy Crudup, Ezra Miller, Tye Sheridan, Gaius Charles, Moises Arias', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nInteresting concept and film, but feels at points like it's dragging or was extended to make a certain time or length for the film. Acting is very good and keeps the viewer's attention even as the film hits some points that would otherwise lose the viewer's attention.\nInteresting\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Liza Johnson'], 'Producers': ['Holly Wiersma', 'Cassian Elwes', 'Cary Elwes'], 'Starring': ['Michael Shannon', 'Kevin Spacey', 'Alex Pettyfer'], 'Studio': ['Amazon Studios']}\nKevin Spacey does a really good job of being Nixon.  Michael Shannon does a good job of playing Elvis once you're able to get over the fact that he doesn't look too much like him. It took me a little while to get over that at the beginning of the movie, but once I did I enjoyed the movie. It is an intriguing subject for a movie, and the idea of what could or may have happened keeps you interested. Overall it is an entertaining movie.\nKevin Spacey does a really good job of being Nixon",
  "profile": "**Updated User Profile Summary:**\n\n- **Interest in Documentaries and Thematic Films:** The user has a strong preference for documentaries and films that tackle historical and psychological topics, particularly those involving social experiments and complex societal issues. This aligns with their appreciation for in-depth explorations of serious subjects.\n\n- **Desire for In-depth Content:** They continue to seek comprehensive analysis and depth in the content they consume, valuing informative materials that encourage critical thought.\n\n- **Balanced Enjoyment:** Showcasing a balanced view of media, the user appreciates engaging performances and concepts. They are willing to overlook initial discrepancies in casting if the film ultimately delivers an entertaining experience, as demonstrated in their recent review.\n\n- **Critical Engagement:** They maintain a keen critical perspective, analyzing narrative structures and the effectiveness of storytelling, particularly during slower segments. Their recent experience reflects an understanding of how intriguing subjects can sustain viewer interest.\n\n- **Mixed Ratings:** Their thoughtful approach to content evaluation is evident, with ratings typically hovering around 3.0 to 4.0. The user's recent rating of 3.5 indicates a nuanced appreciation for quality, acknowledging both the strengths and weaknesses of the films they watch.\n\nOverall, the user remains engaged with compelling media that stimulates reflection and offers a rich examination of significant themes, combining a preference for depth, performance, and effective storytelling in their viewing experiences.",
  "metrics": {
    "rouge1_f": 0.21914648212226068,
    "rouge2_f": 0.027745664739884397,
    "rougeL_f": 0.10380622837370243,
    "meteor": 0.07792903262607384,
    "bleu1": 0.03438254291045784,
    "bleu2": 0.012307265268566387,
    "bleu3": 0.0017738172459614487,
    "bleu4": 0.0006740372693214375,
    "bertscore_precision": 0.3539992570877075,
    "bertscore_recall": 0.4490925669670105,
    "bertscore_f1": 0.3959159553050995
  }
}