{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 24K Gold Under Eye Mask– 20 Pairs- Under Eye Patches with Face Massager Roller, Anti-Aging Hyaluronic Acid Collagen Eye Masks for Dark Circles and Puffiness Dark Under Eyes Treatment\nReview Date: 2020/11/06\nStore: FRLEDM\nAverage Rating: 4.0\nProduct Details: {'Brand': 'FRLEDM', 'Special Feature': 'Anti Aging', 'Unit Count': '21.00 Count', 'Number of Items': '40', 'Package Dimensions': '7.5 x 7 x 1.5 inches; 11.99 Ounces', 'Batteries': '1 AA batteries required. (included)'}\nReview Text: I don't really interested in face roller but I feel the eye masks really worth it and decrease puffiness. Especially after put it in the fridge.\nReview Title: Eye masks really worth it, face roller not so much.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Electric Shaver for Men, SOOCAS Mens Electric Razor, Wet & Dry IPX7 Waterproof Rotary Facial Shaver, Portable Face Shaver Cordless Travel USB Rechargeable for Husband Dad, Black\nSOOCAS\n{'Brand': 'SOOCAS', 'Special Feature': 'Portable,Rechargeable,Cordless,Waterproof,Compact', 'Power Source': 'Battery Powered', 'Included Components': 'Charger', 'Blade Material': 'Stainless Steel', 'Package Dimensions': '7.36 x 4.21 x 2.68 inches; 11.18 Ounces', 'Batteries': '1 Lithium Ion batteries required. (included)', 'Manufacturer': 'SOOCAS'}\ni'm surprise about the quality of this shaver, for most part it cuts really well and smooth.<br />the design is compact and not that heavy on hand, the battery last quite long, and i like the USB-C charging so i can use 1 charging for all. the battery last long enough.<br />over all this shaver is affordable and great purchase\nGood inexpensive shaver\nReusable Makeup Remover Pads| Dual- Texture Soft Reusable Face Microfiber Rounds For Mascara, Eye Shadow, Lipstick, Foundation (3 Pads+ Makeup Headband +Laundry Bag)\nTECHEALTH\n{'Product Dimensions': '11 x 7.5 x 2 inches; 2.82 Ounces', 'UPC': '860002480299'}\nThe pads really soft and there's another side textured pads for \"physical exfoliation\" skin. It really removes all the makeup.\nreally works removing makeup and have duo sides.\nKneipp Shower Foam Goodbye Stress Water Mint & Rosemary 6.81 Oz\nKneipp\n{'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'Kneipp', 'Scent': 'Rosemary', 'Material Feature': 'Plant Based', 'Package Dimensions': '8.2 x 2.5 x 2.5 inches; 9.59 Ounces'}\nI really enjoyed this soap. The scent is so good, its so practical change from gel to foam. I guess I used it too much for the first time, I only need 1 pump and spread it with loofah and that's enough for the whole body.\nThe scent is so good, really practical change from gel to foam.\n24K Gold Under Eye Mask– 20 Pairs- Under Eye Patches with Face Massager Roller, Anti-Aging Hyaluronic Acid Collagen Eye Masks for Dark Circles and Puffiness Dark Under Eyes Treatment\nFRLEDM\n{'Brand': 'FRLEDM', 'Special Feature': 'Anti Aging', 'Unit Count': '21.00 Count', 'Number of Items': '40', 'Package Dimensions': '7.5 x 7 x 1.5 inches; 11.99 Ounces', 'Batteries': '1 AA batteries required. (included)'}\nI don't really interested in face roller but I feel the eye masks really worth it and decrease puffiness. Especially after put it in the fridge.\nEye masks really worth it, face roller not so much.",
  "profile": "**User Profile Summary:**\n\n- **Preference for Quality and Performance:** The user values high-performance products, consistently achieving positive experiences with various grooming and beauty essentials, particularly those effective for targeted skin concerns.\n\n- **Compact and Portable Design:** The user continues to favor lightweight and easily transportable items, indicating a lifestyle that prioritizes convenience for both home and travel use.\n\n- **Rechargeable and Versatile Charging Options:** The user appreciates modern, rechargeable products with USB-C capabilities, reflecting their preference for multifunctional convenience.\n\n- **Affordability:** A consistent focus on effective yet budget-friendly products demonstrates the user’s commitment to obtaining good value for their investments across different categories.\n\n- **Waterproof Features:** Interest in waterproof functionalities remains important, showcasing the user's desire for durability and practicality in grooming tools.\n\n- **Soft and Exfoliating Properties:** The user values product formulations that enhance sensory experiences, favoring those with soft and dual-texture materials for versatile use.\n\n- **Scented Experiences:** The user enjoys products with appealing scents, further enhancing their daily routines through enjoyable sensory elements.\n\n- **Targeted Solutions:** The user has shown interest in products that address specific skin concerns, such as under-eye care, indicating a preference for solutions that combat issues like puffiness and dark circles.\n\nOverall, this user exemplifies a preference for smart, functional purchases that deliver quality, value, and convenience, continually enhancing their daily grooming and beauty practices while addressing specific skincare needs.",
  "metrics": {
    "rouge1_f": 0.2535657686212361,
    "rouge2_f": 0.022257551669316377,
    "rougeL_f": 0.1045958795562599,
    "meteor": 0.10911925175370227,
    "bleu1": 0.12070526143832638,
    "bleu2": 0.019117172876396596,
    "bleu3": 0.0038147501257564708,
    "bleu4": 0.0017055069551927826,
    "bertscore_precision": 0.3855751156806946,
    "bertscore_recall": 0.43902724981307983,
    "bertscore_f1": 0.4105687439441681
  }
}