{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/06/01\nAverage Rating: 4.9\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Paul McGuigan'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss', 'Rebecca Eaton', 'Bethan Jones'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nReview Text: It is always hard to re-do a classic especially when your attempting to bring classic characters into the twenty first century. Sherlock succeeds in all aspects. It is a role attempted by many and grasped by few. Cumberbatch joins the few who really grasp the Baker Street sleuth's persona.\nReview Title: Excellent series with quality actors\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Sackheim', 'Peter Markle', 'David Straiton', 'Elodie Keene', 'Adam Arkin', 'Paul McCrane', 'John Behring', 'Frederick King Keller', 'John Dahl', 'David Semel'], 'Studio': ['NBC']}\nThe Life series was one of those quirky shows that allowed Damian Lewis to hone his skills. Skills which have proven to be superb in Homeland and Band of Brothers just to name two. Sadly Life only lasted 2 seasons, but it did give us two excellent actors in Lewis and Shahi. We can still enjoy both on the small screen today.\nLife and then some\nTotal Recall\nScience Fiction, Suspense, Compelling, Tense\n['A factory worker (Colin Farrell) becomes a hunted man after a procedure goes awry that would convert his dreams of life as a spy into real memories.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Len Wiseman'], 'Producers': ['Neal H. Moritz', 'Toby Jaffe', 'Neal Moritz'], 'Starring': ['Colin Farrell', 'Leigh Folsom', 'Brian T. Delaney']}\nEnjoyed the twists that were different from the original and the Special Effects were excellent. The acting was so so but so was the acting in the original.\nGood Special effects sub-par acting\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Nutter', 'Alan Taylor', 'Alex Graves', 'Miguel Sapochnik', 'Mark Mylod', 'Jeremy Podeswa', 'Daniel Minahan', 'Alik Sakharov', 'Michelle MacLaren', 'Brian Kirk'], 'Producers': ['Mark Huffam', 'Carolyn Strauss', 'Joanna Burn', 'Frank Doelger', 'Guymon Casady', 'George R.R. Martin', 'Ralph Vicinanza', 'Vince Gerardis'], 'Starring': ['Sean Bean', 'Mark Addy', 'Peter Dinklage'], 'Studio': ['Discovery Global']}\nWas pleasantly surprised at the good flow of the movie story line in conjunction with the book. The gritty nature of the filming gave validity to the real nature of the times and made the story that much more compelling. Looking forward to the rest of the episodes in season 1.\nVery good at bringing the books to life\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Paul McGuigan'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss', 'Rebecca Eaton', 'Bethan Jones'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nIt is always hard to re-do a classic especially when your attempting to bring classic characters into the twenty first century. Sherlock succeeds in all aspects. It is a role attempted by many and grasped by few. Cumberbatch joins the few who really grasp the Baker Street sleuth's persona.\nExcellent series with quality actors",
  "profile": "**User Profile Summary:**\n\n**Keywords:**  \n- Genre Preferences: Quirky, Dramatic, Science Fiction, Fantasy, Mystery  \n- Content Type: Series  \n- Viewing Language: English  \n- Subtitles: English [CC]  \n- Actor Appreciation: Damian Lewis, Sarah Shahi, Colin Farrell, Sean Bean, Peter Dinklage, Benedict Cumberbatch, Martin Freeman  \n- Directors: Multiple directors with a focus on visionary storytelling, particularly those known for gritty and compelling narratives.  \n- Longevity Preference: Shows with short runs (noted preference for 2 seasons), indicating a gravitation towards unique narratives with impactful storytelling.  \n- Emotional Engagement: Strong emotional connection to character development and performances, valuing authenticity and depth in portrayals.\n\n**Trends:**  \n- The user continues to prioritize high-quality storytelling, as seen in their enthusiasm for adaptations that creatively reinterpret classic characters for modern audiences.\n- Their exploration into fantasy and mystery genres reflects a growing interest in immersive worlds and complex narratives, emphasizing a desire for depth and originality.\n- The user maintains a critical approach to cinematic execution, showcasing an appreciation for both technical elements and strong acting performances.\n- Consistent skepticism toward mainstream success drives their search for innovative and emotionally resonant content.\n\nOverall, the user actively seeks series that exhibit depth and originality, showcasing an affinity for strong performances, innovative storytelling techniques, and creative execution across a broader range of genres.",
  "metrics": {
    "rouge1_f": 0.23140495867768593,
    "rouge2_f": 0.046434494195688236,
    "rougeL_f": 0.1024793388429752,
    "meteor": 0.09784563360468153,
    "bleu1": 0.0828850471080586,
    "bleu2": 0.024097622232566705,
    "bleu3": 0.0100692884808623,
    "bleu4": 0.003080803982383942,
    "bertscore_precision": 0.40991300344467163,
    "bertscore_recall": 0.44292157888412476,
    "bertscore_f1": 0.42577847838401794
  }
}