{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/08/19\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Philip Martin'], 'Producers': ['Simon Moseley'], 'Starring': ['Kenneth Branagh', 'Sarah Smart', 'Jeany Spark']}\nReview Text: Wallander is a treat for those of us who want to have our gray mater tickled. A smart and complex inter-weaving of plots and subplots makes for great detective stories and character development of the finest kind. The cinematography is stunning and the supporting cast is gritty enough that they are believable. Dark detective work with excellent Ah Ha moments makes for a series that treats the viewer to a quality series to be viewed multiple times.\nReview Title: Depressing, grinding, enlightening and superb\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Sackheim', 'Peter Markle', 'David Straiton', 'Elodie Keene', 'Adam Arkin', 'Paul McCrane', 'John Behring', 'Frederick King Keller', 'John Dahl', 'David Semel'], 'Studio': ['NBC']}\nThe Life series was one of those quirky shows that allowed Damian Lewis to hone his skills. Skills which have proven to be superb in Homeland and Band of Brothers just to name two. Sadly Life only lasted 2 seasons, but it did give us two excellent actors in Lewis and Shahi. We can still enjoy both on the small screen today.\nLife and then some\nTotal Recall\nScience Fiction, Suspense, Compelling, Tense\n['A factory worker (Colin Farrell) becomes a hunted man after a procedure goes awry that would convert his dreams of life as a spy into real memories.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Len Wiseman'], 'Producers': ['Neal H. Moritz', 'Toby Jaffe', 'Neal Moritz'], 'Starring': ['Colin Farrell', 'Leigh Folsom', 'Brian T. Delaney']}\nEnjoyed the twists that were different from the original and the Special Effects were excellent. The acting was so so but so was the acting in the original.\nGood Special effects sub-par acting\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Nutter', 'Alan Taylor', 'Alex Graves', 'Miguel Sapochnik', 'Mark Mylod', 'Jeremy Podeswa', 'Daniel Minahan', 'Alik Sakharov', 'Michelle MacLaren', 'Brian Kirk'], 'Producers': ['Mark Huffam', 'Carolyn Strauss', 'Joanna Burn', 'Frank Doelger', 'Guymon Casady', 'George R.R. Martin', 'Ralph Vicinanza', 'Vince Gerardis'], 'Starring': ['Sean Bean', 'Mark Addy', 'Peter Dinklage'], 'Studio': ['Discovery Global']}\nWas pleasantly surprised at the good flow of the movie story line in conjunction with the book. The gritty nature of the filming gave validity to the real nature of the times and made the story that much more compelling. Looking forward to the rest of the episodes in season 1.\nVery good at bringing the books to life\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Paul McGuigan'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss', 'Rebecca Eaton', 'Bethan Jones'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nIt is always hard to re-do a classic especially when your attempting to bring classic characters into the twenty first century. Sherlock succeeds in all aspects. It is a role attempted by many and grasped by few. Cumberbatch joins the few who really grasp the Baker Street sleuth's persona.\nExcellent series with quality actors\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['John Moore'], 'Producers': ['Alex Young', 'Wyck Godfrey'], 'Starring': ['Bruce Willis', 'Jai Courtney', 'Sebastian Koch'], 'Studio': ['Fox']}\nThe special effects were as advertised, but the story was weak to the extreme. The movie was more for the action junkie than for the thoughtful viewer. I hope for the sake of Mr. Willis' career that he graciously turns down any producer that wants to do another installment.\nThe end of the road?\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Philip Martin'], 'Producers': ['Simon Moseley'], 'Starring': ['Kenneth Branagh', 'Sarah Smart', 'Jeany Spark']}\nWallander is a treat for those of us who want to have our gray mater tickled. A smart and complex inter-weaving of plots and subplots makes for great detective stories and character development of the finest kind. The cinematography is stunning and the supporting cast is gritty enough that they are believable. Dark detective work with excellent Ah Ha moments makes for a series that treats the viewer to a quality series to be viewed multiple times.\nDepressing, grinding, enlightening and superb",
  "profile": "**Updated User Profile Summary:**\n\n**Keywords:**  \n- Genre Preferences: Quirky, Dramatic, Science Fiction, Fantasy, Mystery, and Detective  \n- Content Type: Series  \n- Viewing Language: English  \n- Subtitles: English [CC]  \n- Actor Appreciation: Damian Lewis, Sarah Shahi, Colin Farrell, Sean Bean, Peter Dinklage, Benedict Cumberbatch, Martin Freeman, Kenneth Branagh  \n- Directors: Multiple directors focused on visionary storytelling, particularly those known for gritty and compelling narratives.  \n- Longevity Preference: Strong preference for shows with short runs (preferably 2 seasons), indicating a gravitation towards unique narratives with impactful storytelling.  \n- Emotional Engagement: Strong emotional connection to character development and performances, valuing authenticity and depth in portrayals.\n\n**Trends:**  \n- The user emphasizes high-quality storytelling, with a discerning taste that prioritizes substantive plots over flashy execution. They have recently shown an appreciation for complex detective stories with interwoven plots and substantial character development.\n- Their critical view of mainstream content fosters a search for innovative series that deliver emotional resonance, underscoring their affinity for original narratives.\n- Recent interactions indicate a commitment to character-driven stories that offer thought-provoking exploration, particularly in darker and complex themes.\n\nOverall, the user actively seeks series exemplifying strong performances, intricate storytelling, and emotional depth, reflecting a desire for authentic engagement across various genres, including detective narratives.",
  "metrics": {
    "rouge1_f": 0.21966794380587484,
    "rouge2_f": 0.05121638924455827,
    "rougeL_f": 0.10217113665389528,
    "meteor": 0.07881465225237311,
    "bleu1": 0.03249052579212958,
    "bleu2": 0.010751727495886427,
    "bleu3": 0.004097842504362188,
    "bleu4": 0.0011974380681572417,
    "bertscore_precision": 0.41030147671699524,
    "bertscore_recall": 0.4657614231109619,
    "bertscore_f1": 0.43627598881721497
  }
}