{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/06/01\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['John Moore'], 'Producers': ['Alex Young', 'Wyck Godfrey'], 'Starring': ['Bruce Willis', 'Jai Courtney', 'Sebastian Koch'], 'Studio': ['Fox']}\nReview Text: The special effects were as advertised, but the story was weak to the extreme. The movie was more for the action junkie than for the thoughtful viewer. I hope for the sake of Mr. Willis' career that he graciously turns down any producer that wants to do another installment.\nReview Title: The end of the road?\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Sackheim', 'Peter Markle', 'David Straiton', 'Elodie Keene', 'Adam Arkin', 'Paul McCrane', 'John Behring', 'Frederick King Keller', 'John Dahl', 'David Semel'], 'Studio': ['NBC']}\nThe Life series was one of those quirky shows that allowed Damian Lewis to hone his skills. Skills which have proven to be superb in Homeland and Band of Brothers just to name two. Sadly Life only lasted 2 seasons, but it did give us two excellent actors in Lewis and Shahi. We can still enjoy both on the small screen today.\nLife and then some\nTotal Recall\nScience Fiction, Suspense, Compelling, Tense\n['A factory worker (Colin Farrell) becomes a hunted man after a procedure goes awry that would convert his dreams of life as a spy into real memories.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Len Wiseman'], 'Producers': ['Neal H. Moritz', 'Toby Jaffe', 'Neal Moritz'], 'Starring': ['Colin Farrell', 'Leigh Folsom', 'Brian T. Delaney']}\nEnjoyed the twists that were different from the original and the Special Effects were excellent. The acting was so so but so was the acting in the original.\nGood Special effects sub-par acting\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Nutter', 'Alan Taylor', 'Alex Graves', 'Miguel Sapochnik', 'Mark Mylod', 'Jeremy Podeswa', 'Daniel Minahan', 'Alik Sakharov', 'Michelle MacLaren', 'Brian Kirk'], 'Producers': ['Mark Huffam', 'Carolyn Strauss', 'Joanna Burn', 'Frank Doelger', 'Guymon Casady', 'George R.R. Martin', 'Ralph Vicinanza', 'Vince Gerardis'], 'Starring': ['Sean Bean', 'Mark Addy', 'Peter Dinklage'], 'Studio': ['Discovery Global']}\nWas pleasantly surprised at the good flow of the movie story line in conjunction with the book. The gritty nature of the filming gave validity to the real nature of the times and made the story that much more compelling. Looking forward to the rest of the episodes in season 1.\nVery good at bringing the books to life\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Paul McGuigan'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss', 'Rebecca Eaton', 'Bethan Jones'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nIt is always hard to re-do a classic especially when your attempting to bring classic characters into the twenty first century. Sherlock succeeds in all aspects. It is a role attempted by many and grasped by few. Cumberbatch joins the few who really grasp the Baker Street sleuth's persona.\nExcellent series with quality actors\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['John Moore'], 'Producers': ['Alex Young', 'Wyck Godfrey'], 'Starring': ['Bruce Willis', 'Jai Courtney', 'Sebastian Koch'], 'Studio': ['Fox']}\nThe special effects were as advertised, but the story was weak to the extreme. The movie was more for the action junkie than for the thoughtful viewer. I hope for the sake of Mr. Willis' career that he graciously turns down any producer that wants to do another installment.\nThe end of the road?",
  "profile": "**User Profile Summary:**\n\n**Keywords:**  \n- Genre Preferences: Quirky, Dramatic, Science Fiction, Fantasy, Mystery  \n- Content Type: Series  \n- Viewing Language: English  \n- Subtitles: English [CC]  \n- Actor Appreciation: Damian Lewis, Sarah Shahi, Colin Farrell, Sean Bean, Peter Dinklage, Benedict Cumberbatch, Martin Freeman  \n- Directors: Multiple directors with a focus on visionary storytelling, particularly those known for gritty and compelling narratives.  \n- Longevity Preference: Shows with short runs (noted preference for 2 seasons), indicating a gravitation towards unique narratives with impactful storytelling.  \n- Emotional Engagement: Strong emotional connection to character development and performances, valuing authenticity and depth in portrayals.\n\n**Trends:**  \n- The user emphasizes high-quality storytelling, even criticizing weak narratives despite strong production elements. This indicates a discerning taste that values substantive plots over flashy execution.\n- Their interest in immersive worlds and complex narratives continues alongside a critical approach to cinematic quality, stressing the importance of character-driven stories.\n- Skepticism regarding mainstream success further fuels their search for innovative and emotionally resonant series, reinforcing their affinity for unique narratives.\n- Recent interactions highlight a growing awareness of the distinction between action-driven content and thought-provoking storytelling, underscoring their preference for depth and originality.\n\nOverall, the user actively seeks series that exemplify strong performances and innovative storytelling techniques, reflecting their desire for authentic and meaningful engagement with content across various genres.",
  "metrics": {
    "rouge1_f": 0.20143884892086333,
    "rouge2_f": 0.0404040404040404,
    "rougeL_f": 0.10071942446043167,
    "meteor": 0.08108707724613017,
    "bleu1": 0.052543571058598325,
    "bleu2": 0.015275545723016365,
    "bleu3": 0.006382640269555266,
    "bleu4": 0.0019527407491219438,
    "bertscore_precision": 0.3996797800064087,
    "bertscore_recall": 0.43903234601020813,
    "bertscore_f1": 0.4184328615665436
  }
}