{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Afro Curly Wig Headband Wigs for Black Women, Natural Black Afro Curly Hair Afro Wig Synthetic Wig with Headband Heat Resistant\nReview Date: 2021/02/16\nStore: FU SHEN\nAverage Rating: 4.3\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Curly, Coily', 'Special Feature': 'Heat Resistant', 'Brand': 'FU SHEN', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.94 x 8.39 x 3.58 inches; 5.93 Ounces'}\nReview Text: Afro Headband Wigs for Black Women Synthetic Head Wrap Wig Afro Curly Wigs Turban Wigs with Drawstring 2 In 1 Natural. Fun to wear and headband very Afrocentric. This would be nice for quick change artists because all you must do is put it on your head and with the headband it looks like you have a natural hairline.  OZ\nReview Title: Fun to wear and headband very Afrocentric.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Face and Body Paint Kit By Color Technik 24 Professional Oil Based Flash Colors, 2 Sets of 12 Color Palettes, 6 Paint Brushes 70 Stencils 2 Sponges Non-Toxic For Adults & Kids Halloween Painting Party\nColor Technik\n{'Brand': 'Color Technik', 'Package Information': 'Palette', 'Package Type': 'Palette', 'Skin Type': 'Sensitive', 'Package Dimensions': '9 x 5 x 1 inches; 8.78 Ounces', 'Item model number': 'CTFPS24'}\nFace and Body Paint Kit By Color Technik 24 Professional Oil Based Flash Colors, 2 Sets of 12 Color Palettes, 6 paint brushes is a fun to do thang to do.  You see all these TV shows these days with people painting their face, painting their body, you might just want to try it yourself and this is the perfect opportunity to do it, with this set of face painting paints. You can achieve many colors and effects with this set. What the heck, I might just wanna go green for a day, what do you say?  OZ\nEZ on EZ off Face Paint\nAfro Curly Wig Headband Wigs for Black Women, Natural Black Afro Curly Hair Afro Wig Synthetic Wig with Headband Heat Resistant\nFU SHEN\n{'Material': 'Human Hair', 'Hair Type': 'Curly, Coily', 'Special Feature': 'Heat Resistant', 'Brand': 'FU SHEN', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.94 x 8.39 x 3.58 inches; 5.93 Ounces'}\nAfro Headband Wigs for Black Women Synthetic Head Wrap Wig Afro Curly Wigs Turban Wigs with Drawstring 2 In 1 Natural. Fun to wear and headband very Afrocentric. This would be nice for quick change artists because all you must do is put it on your head and with the headband it looks like you have a natural hairline.  OZ\nFun to wear and headband very Afrocentric.",
  "profile": "### Updated User Profile Summary\n\n**Interests:**\n- Creative expression through face and body painting.\n- Engaging in family-oriented activities suitable for both adults and children.\n- Enjoyment of themed events, particularly Halloween or similar festivities.\n- Interest in versatile and easily wearable accessories to complement creative looks.\n\n**Preferences:**\n- Values non-toxic products, indicating a concern for safety and health.\n- Prefers products that are user-friendly and easy to apply/remove, reflecting a desire for convenience in creative pursuits.\n- Appreciates a variety of colors and effects, showcasing an artistic versatility.\n- Shows a preference for Afrocentric styles and fashion, particularly those that enhance creativity and personal expression.\n\n**Behavior Patterns:**\n- Positive engagement with products that enable fun, creativity, and quick transformations.\n- Likely to participate in social or community-driven artistic activities, as indicated by their engaged reviews and interest in versatile creative supplies.\n- Shows an appreciation for items that allow for easy styling and that embody cultural significance.\n\nOverall, this user favors artistic expression that combines safety, ease of use, enjoyment, and cultural representation, making them inclined toward versatile and family-friendly creative supplies and accessories.",
  "metrics": {
    "rouge1_f": 0.18336886993603413,
    "rouge2_f": 0.02569593147751606,
    "rougeL_f": 0.10660980810234542,
    "meteor": 0.10239400057686762,
    "bleu1": 0.13731174730857418,
    "bleu2": 0.026006828094240587,
    "bleu3": 0.011871691248542851,
    "bleu4": 0.004515530928774617,
    "bertscore_precision": 0.36561861634254456,
    "bertscore_recall": 0.42080092430114746,
    "bertscore_f1": 0.39127376675605774
  }
}