{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Aonkia Human Hair Dreadlock Extensions for Man/Women Loc Extensions Human Hair 0.2cm Width 18 inch 28 strands Full Hand-made Permanent Dread Locs Extensions Human Hair\nReview Date: 2022/11/04\nStore: AONKIA\nAverage Rating: 2.5\nProduct Details: {'Product Dimensions': '10 x 5 x 0.2 inches; 3.21 Ounces', 'UPC': '736020676023'}\nReview Text: I like to hear hair I just don't like the term dreadlocks because i do not dread my hair i love my hair i. Thank you. Brother Oran Z\nReview Title: I like the hair I hate the term dreadlocks I like lovelocks better.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Face and Body Paint Kit By Color Technik 24 Professional Oil Based Flash Colors, 2 Sets of 12 Color Palettes, 6 Paint Brushes 70 Stencils 2 Sponges Non-Toxic For Adults & Kids Halloween Painting Party\nColor Technik\n{'Brand': 'Color Technik', 'Package Information': 'Palette', 'Package Type': 'Palette', 'Skin Type': 'Sensitive', 'Package Dimensions': '9 x 5 x 1 inches; 8.78 Ounces', 'Item model number': 'CTFPS24'}\nFace and Body Paint Kit By Color Technik 24 Professional Oil Based Flash Colors, 2 Sets of 12 Color Palettes, 6 paint brushes is a fun to do thang to do.  You see all these TV shows these days with people painting their face, painting their body, you might just want to try it yourself and this is the perfect opportunity to do it, with this set of face painting paints. You can achieve many colors and effects with this set. What the heck, I might just wanna go green for a day, what do you say?  OZ\nEZ on EZ off Face Paint\nAfro Curly Wig Headband Wigs for Black Women, Natural Black Afro Curly Hair Afro Wig Synthetic Wig with Headband Heat Resistant\nFU SHEN\n{'Material': 'Human Hair', 'Hair Type': 'Curly, Coily', 'Special Feature': 'Heat Resistant', 'Brand': 'FU SHEN', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.94 x 8.39 x 3.58 inches; 5.93 Ounces'}\nAfro Headband Wigs for Black Women Synthetic Head Wrap Wig Afro Curly Wigs Turban Wigs with Drawstring 2 In 1 Natural. Fun to wear and headband very Afrocentric. This would be nice for quick change artists because all you must do is put it on your head and with the headband it looks like you have a natural hairline.  OZ\nFun to wear and headband very Afrocentric.\nBlackhead Remover Pore Vacuum Cleaner,2021 Electric Facial Black Head and Pimple Vacuum Removal Tool with Hot Compress,Comedone Acne Whitehead Extractor-USB Rechargeable,4 Porbes (Green)\nKeyHalo\n{'Package Dimensions': '8.03 x 3.62 x 1.73 inches; 8.78 Ounces', 'UPC': '747165327374'}\nThis is like a vacuum cleaner for your face. It sucks the impurities out of your pores, who could want more. Thank you for reading my review I hope it was helpful and entertaining for you. God bless you and yours, have a good day and may the rest of your life be the best of your life.  OZ\nThis thing really sucks, your blackheads really well.\nClear Nails Tips Coffin Shape, 480PCS Cosics 2IN1 Glossy Clear Press On Nails Almond Stiletto & Ballerina Shape Medium with Storage Box, Artificial Acrylic False Fake Nail Art Tips for Women DIY\nCOSICS\n{'Color': 'Green', 'Size': '480 Piece Assortment', 'Material': 'Plastic, Acrylic, Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'COSICS', 'Style': 'French', 'Package Dimensions': '9.53 x 6.54 x 1.3 inches; 2.12 Ounces'}\nThe thing I like about this set of tips is the fact that you can change them to look like any of the common fingernails or you can make your own nail your own design. They seem to work good with both powder and Gel, what the. Thank you for reading my review. I hope it is beneficial for you. May God bless you and yours. May the rest of your life, be the best of your life. OZ\nTake a tip, these are some nice tips.\nLXIANGN Nail Glass Cup With Lid Cute Dappen Dishes 2PCS Heart Shaped Bowl Glass Mini Crystal Bowls for Nail Art Manicure Care Tools\nLXIANGN\n{}\nHeart to heart from finish to start. These little dishes are quite small but that is what you need to do certain jobs. I use one of these hearts for my martemper and the other jar for my brush cleaner. I recommend it. Thank you for reading my review I hope it was beneficial for you. May God bless you. May the rest of your life be the best of your life.  OZ\nHeart to heart from finish to start\nPoly Nails Gel Kit - Glitter Poly Nails Gel 6 Colors Builder Gel Nude Nature Series Nail Extension Gel Nail Enhancement Manicure Kit for Gel Polish Starter and Professional Nail Technician\nBelle\n{'Brand': 'Belle', 'Included Components': 'Glitter, Gel Nail polish', 'Finish Type': 'Glitter', 'Item Form': 'Gels', 'Package Dimensions': '12.9 x 9.3 x 1.9 inches; 1.48 Pounds'}\nThere is a difference between gel nails and Poly gel nails. This is a nice set of Poly gel nails. This is an excellent set for extensions. I will definitely use this in my OZ fantasy nail summer addition. Thank you for reading my review. God bless you. May the rest of your life be the best of your life.  OZ\nPoly want some gel nails?\nBVENDANO 10×10gm Face Paint Kit One Stroke Split Cake Water Based Palette with 3 Professional Brushes Body Paint Makeup Birthday Party Halloween\nBvendano\n{'Brand': 'Bvendano', 'Item Form': 'Palette', 'Package Information': 'Palette', 'Package Type': 'Palette', 'Skin Type': 'All', 'Package Dimensions': '10.28 x 3.66 x 0.94 inches; 12.38 Ounces', 'UPC': '725188865783 725188146394 725188832396'}\nWith this kit you get more than just face paint painting cakes, you also get 3 professional brushes. I like the fact that each one of the cakes has three colors in it. The one drawback I find with this kit is that the three colors in each cake can sometimes affects you do not want, be careful not to get a color you do not want while trying to get one color out of the cakes that have three colors in it. Thank you, God bless, you and may the rest of your life be the best your life.  OZ\nMore than just a face painting kit\nNeelash False Eyelashes 40 Pairs Faux Mink Lashes Pack 8 Styles Fluffy Dramatic Fake Eyelashes Wholesale Mink Eye Lashes\nNeelash\n{'Package Dimensions': '13.39 x 7.68 x 0.55 inches; 2.4 Ounces'}\n40 lashes. I mean 40 pair of eyelashes is a lot of lashes. And they are reusable. I like to use them on my Gloria Dolls heads, to make them look better. I recommend my friend. Thank you. God bless you and may the rest of your life be the best of your life.  OZ\nYou get 40 Lashes.\nEyebrow Stamp Waterproof, Brow Stamp Shaping Kit Eyebrow Definer, Eyebrow Stamp Women Makeup Tools One Step Eyebrow Stamp Shaping Kit with 10 Reusable Eyebrow Stencils (black)\nYCNASSS\n{'Brand': 'YCNASSS', 'Item Form': 'Powder', 'Special Feature': 'Waterproof, Reusable', 'Material Feature': 'Reusable, Natural', 'Product Benefits': 'Softening', 'Package Dimensions': '3.23 x 1.73 x 1.54 inches; 1.13 Ounces'}\nGood for a minute but then you know it kind of didn't even do my second half mustache. Maybe it's a good for eyebrows but I can't recommend my friend, not for mustaches anyway from my end. God bless thank you. May the rest of your life be the Best of your life.  OZ\nOK for a little.\nPP OPOUNT 216 PCS Dreadlocks Accessories, DreadLock Beads Hair Decorations with Tube Beads Hair Braiding Metal Cuff, Wood Beads and Hair Pendants for Braids Hair Decoration\nPP OPOUNT\n{'Package Dimensions': '6.81 x 3.98 x 0.94 inches; 7.05 Ounces', 'Manufacturer': 'PP OPOUNT'}\nI hate the term dreadlock because I do not dread my hair. I love my hair, the term dreadlock was started by the British who dreaded seeing the Jamaicans the ones they call maroons, come down the hill when they were trying to go up the hill to get them. This is a beautiful set of decorations to go on your lovelocks and some of them really rock. I recommend my friend. Thank you. God bless you and may the rest of your life be the best of your life.  OZ\nI hate the term dreadlock, but I love these accessories.\nDARKLATER Tongue Scraper for Adults,Metal Tongue Cleaner,Tounge Scraper Cleaner,3 Pack\nDARKLATER\n{'Package Dimensions': '7.05 x 2.48 x 0.91 inches; 4.23 Ounces', 'UPC': '049500561932'}\nKeeping your tongue clean makes your food taste better. Having a clean tongue is healthier for you. I like the fact that this chunky cleaner has his own case to hide its demeanor. I recommend my friend keep your tongue clean again. Thank you. God bless you. May the rest of your life be the best of your life.  OZ\nKeeping your tongue clean makes your food taste better.\nO.M.CHIC Mannequin Head with shoulders for wig, Display wigs Eyeglasses Necklaces and Earrings\nO.M.CHIC\n{'Package Dimensions': '18.3 x 15.7 x 9 inches; 5.1 Pounds', 'UPC': '714676502699 714676502675'}\nI like the fact that this girl has shoulders and can set on its own. I like to enhance these Gloria heads with eyelashes and eyebrows to give him more of the pop you need in your shop. I recommend my friend. Thank you. God bless you. May the rest of your life be the best of your life. OZ\nThis girl is head and shoulders over most mannequin heads.\nStraight Razor with 10 Blades, Single Blade Barber Straight Edge Razor for Men Women, Manual Hair Shaving kit Fits Single Edge Blade, For Barbers, Salons, Hair Enthusiasts (Green Wood)\nLEYMIGA\n{'Brand': 'LEYMIGA', 'Number of Blades': '10', 'Unit Count': '1.00 Count', 'Skin Type': 'Sensitive', 'Handle Material': 'Wood,Wooden,Metal', 'Package Dimensions': '6.89 x 1.73 x 0.91 inches; 2.82 Ounces', 'UPC': '782932069323'}\nYou can change the blades and will Bill. It comes with two extra blades to keep your dealing in spades. I recommend my friend shave it close now and then. Thank you. God bless you. May the rest of your life be the best of your life.  OZ\nYou don't need a leather strap for this razor.\nElectric Eyelash Glue Shaker ,Automatic Eyelash Glue Mixer Portable Evenly Liquid Mixer Nail Gel Polish Shaker ,Tattoo Ink Pigment Liquid Shaking Machine with 2pcs Connector 6pcs Glue Cover Die\nSuprwin\n{'Brand': 'Suprwin', 'Item Form': 'Liquid, Gel', 'Type': 'Gel', 'Unit Count': '1.00 Count', 'Package Dimensions': '4.37 x 4.06 x 2.83 inches; 5.29 Ounces', 'UPC': '740069613789'}\n[[VIDEOID:2a3b24d571a05f44cc8ace5cc8909f81]] Hotep brothers and sisters and thank you for looking at my review of the spinner or shaker, good this is a good thing for mixing if you're a maker. I like the fact that they come with interchangeable sizes to use your spin. If you can't put in from the bottom you can put at the top my friend.<br /><br />I recommend my friend. Thank you for looking my review. I hope it is helpful for you. If so, you can check the helpful box below, it will help me review some More. God bless you. May the rest of your life be the best of your life.  O DEE thank you\nit's more of a spinner than a shaker.\nHMPRT 80s Costumes for Men, Halloween Heavy Metal Rocker Wig with Trucker Hat, Black T-Shirt Outfit, 90s Accessories Blow Up Guitar Music Costume Prop,L\nHMPRT\n['5Pcs Halloween 80s costume include:one 80s hatone 80s mullet wigone 80s black shirtone 80s guitarone wig cap. What you see is what you get.']\n{'Product Dimensions': '0.79 x 0.79 x 0.79 inches; 1.08 Pounds', 'Item model number': 'HM-WayneSet-L', 'Department': 'Men', 'Manufacturer': 'HMPRT'}\n[[VIDEOID:7cfc995b010d23bc7176b91f843fecfa]] Hotep and party on brothers and sisters and thank you for looking at my review of the HMPRT 80s 90s Costume, A Black Mullet Rocker Wig and Wig Cap, Black T-Shirt, Wayne’s World Baseball Cap, and Inflatable Guitar. What I like about this set it's a spoof of Wayne's World and it comes with a Wayne's World cap, a wig, T shirt and an inflatable guitar. The inflatable guitar gives a whole new meaning to the term air guitar. With this you can play Bohemian Rhapsody! “NOT” Long live, Queen.<br />“Wayne's World\" was originally a recurring sketch from the NBC television series Saturday Night Live. It evolved from a segment titled \"Wayne's Power Minute\" (1987) on the CBC Television series It's Only Rock & Roll, as the main character first appeared in that show. A prototype of the Wayne character had appeared several years prior on CITY-TV in Toronto's overnight show City Limits. The Saturday Night Live sketch spawned a hit 1992 film, its 1993 sequel, and several catchphrases which have since entered the pop-culture lexicon. The sketch centered on a local public-access television program in Aurora, Illinois, hosted by Wayne Campbell (Mike Myers, the same actor from \"Wayne's Power Minute\"), an enthusiastic and sardonic long-haired metalhead, and his timid and sometimes high-strung, yet equally metal-loving sidekick and best friend, Garth Algar (Dana Carvey). Wayne lives with his parents and broadcasts his show \"live\" from the basement of their house every Friday evening at 10:30. The first \"Wayne's World\" sketch appeared in the 13th Saturday Night Live episode of the 1988/1989 season. The only thing I didn't like about the Cap is that it clearly looks like a woven Cap on the ad, but the Cap that I was sent is definitely a screen print which I guess is, OK?  ” NOT”.  I recommend my friend. Party on brothers and sisters and thank you for looking at my review. I hope it is helpful for you. If so, you can check the helpful box below, it will help me review some More. God bless you. May the rest of your life be the best of your life.  O DEE thank you\nExcellent, party on brothers and sisters.\nWillie Morrow Eze-teze (Styling Comb) in Assorted Colors (Green & Orange)\nWillie Morrow\n{'Material': 'Rubber', 'Brand': 'Willie Morrow', 'Hair Type': 'All, textured, Curly', 'Color': 'Orange,Green,Assorted Colors', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'UPC': '658692300146'}\n[[VIDEOID:50c6456a14894703519e5e34115f6021]] I really like Willie Morrows products and this comb is excellent. I love to use this type of comb when I'm doing relaxers or Jerry curls. The loop is good for taking a section of the hair when it's in a base. The back of the Cove is good to smooth out the back of the head and the sides. I recommend this comb. I think you'd get a better deal when you buy the three black ones because when you buy this one you pay half the amount of the comb to ship which is not hip. Thank you for looking at my review and God bless you. May the rest of your life be the best of your life. Baba Oran Z\nI really like Willie Morrows products and this comb is excellent.\nAonkia Human Hair Dreadlock Extensions for Man/Women Loc Extensions Human Hair 0.2cm Width 18 inch 28 strands Full Hand-made Permanent Dread Locs Extensions Human Hair\nAONKIA\n{'Product Dimensions': '10 x 5 x 0.2 inches; 3.21 Ounces', 'UPC': '736020676023'}\nI like to hear hair I just don't like the term dreadlocks because i do not dread my hair i love my hair i. Thank you. Brother Oran Z\nI like the hair I hate the term dreadlocks I like lovelocks better.",
  "actual_interaction": {
    "rating": 5.0,
    "title": "I like the hair I hate the term dreadlocks I like lovelocks better.",
    "text": "I like to hear hair I just don't like the term dreadlocks because i do not dread my hair i love my hair i. Thank you. Brother Oran Z",
    "images": [],
    "asin": "B0B5Q9JK15",
    "parent_asin": "B0B5Q9JK15",
    "user_id": "AFHPJTBQYQHQXIFBAODXDAIGCGMQ",
    "timestamp": "2022-11-04 14:49:29.550000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Aonkia Human Hair Dreadlock Extensions for Man/Women Loc Extensions Human Hair 0.2cm Width 18 inch 28 strands Full Hand-made Permanent Dread Locs Extensions Human Hair",
    "average_rating": 2.5,
    "rating_number": 10,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51F0FL4ELDL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51F0FL4ELDL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/7104-sWFIYL._SL1300_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/515Gb3H19vL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/515Gb3H19vL.jpg",
        "variant": "PT01",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5105yM05HQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/5105yM05HQL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71yMUyQggWL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41-GUAQWbkL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41-GUAQWbkL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61ACeO7t7RL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51y2EY2nIrL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51y2EY2nIrL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61BYFuqqGyL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41DafOCtLgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41DafOCtLgL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/619PFMcdaCL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41xgc9CYI0L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41xgc9CYI0L.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71gMFj+fp6L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51w6+GwQ4mL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51w6+GwQ4mL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71ErbYN0l7L._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "AONKIA",
    "categories": [],
    "details": {
      "Product Dimensions": "10 x 5 x 0.2 inches; 3.21 Ounces",
      "UPC": "736020676023"
    },
    "bought_together": null
  }
}