{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: FantaLook Short Heart Styled Reddish Brown Heat Resistant Wig with Teeth Necklace Earrings for Halloween Party\nReview Date: 2022/07/23\nStore: FantaLook\nAverage Rating: 4.6\nProduct Details: {'Color': 'Reddish Brown', 'Material': 'Polyester', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': '耐热', 'Package Dimensions': '8.94 x 7.09 x 2.83 inches; 10.23 Ounces', 'Department': 'Womens', 'Manufacturer': 'MD'}\nReview Text: Good quality wig with lots of accessories. The instructions were good snd it came ready to use.\nReview Title: Fun set\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Kristin Ess The Oversized Satin Scrunchie ? Cheetah\nKristin Ess\n['But make it fashun! This chic satin, oversized scrunchie can be wrapped once or twice depending on the thickness of your hair. Try securing your ponytail with a regular elastic first and then put this over to maximize the look!']\n{'Material': 'Satin', 'Item Form': 'Scrunchie', 'Brand': 'Kristin Ess', 'Hair Type': 'All', 'Number of Pieces': '1', 'Package Dimensions': '10.55 x 6.26 x 1.46 inches; 1.13 Ounces', 'Item model number': '184-KES-0309', 'UPC': '840797141438'}\nthis rust/burnt orange colored scrunchie is exactly what I wanted. It holds bun in place overnight<br />I have both thin and fine hair and wrap it 3 times around a messy top knot bun<br />I feel it would look great and effortless wrapped once or twice for someone with thicker or fuller hair<br />it is accurately described oversized\nlove it! super soft large scrunchie great hold\nMarine Forest Eyebrow Stamp Stencil Kit, 2 Colors in 1 Waterproof and Long Lasting One Step Easy Color Brow Stamp with 24 Eyebrow Stencils Shaping Kit Reusable, 1 Brush and 1 Razor\nMarine Forest\n{'Brand': 'Marine Forest', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Smoothening', 'Product Dimensions': '4.65 x 0.71 x 0.71 inches; 2.08 Ounces'}\nI am pleasantly surprised the simplicity this product provides for brown definition. I have never used a similar product. Simple-just choose the right stencil for your born shape and tap the foam applicator on brows. Also comes with small brush used for finishing touches and small razor. I have not used the razor.<br />The natural brown shade was right for me with medium brown hair and brows.<br />Did not easily smear\neasy to use brow kit. did not easily smear\nEyebrow Stamp and Eyebrow Stencil Kit, One Step Eyebrow Stamp and Shaping Kit for Perfect Brow, Eyebrow Brush,Eyebrow soap kit ,Gel Brow Soap Wax, Eyeshadow Stick Shimmer Eyeshadow Pencil ,Eye Makeup\nArindar\n{'Brand': 'Arindar', 'Finish Type': 'Shimmer,Natural', 'Material Feature': 'Natural', 'Skin Type': 'All', 'Specialty': 'Sweatproof', 'Package Dimensions': '6.89 x 6.77 x 1.5 inches; 4.97 Ounces'}\nThis brow color was a bit too dark for me and I have yet to find a stencil that I can get used to.<br />This item came with lots of stencil options and I brow bar too<br />I really like both eyeshadow sticks and soft blenders\nlots of items for the price\nMRTREUP Hair Brush Spray Set With Detangling Wide Tooth Comb And Detanger Brush For Curly Hair With Hair Mist Spray Bottle 10oz Curl Hair Tools For Women Men Black Natural Hair 3a To 4c Hair Types\nMRTREUP\n{'Brand': 'MRTREUP', 'Shape': 'Oblong', 'Handle Material': 'Plastic', 'Product Benefits': 'Detangle', 'Unit Count': '1.00 Count', 'Product Dimensions': '10 x 2 x 5 inches; 9.59 Ounces'}\nI would buy this set just for the spray bottle.<br />I has an extended spray with a very fine mist! I would love to use this in the summer heat to spray cool water on face/body<br />the brush and comb are wide toothed and sturdy\nLove this spray bottle MISTING style\nTravel Bottles for Toiletries - Autdor 3OZ Travel Size Toiletries Set TSA Approved Travel Containers BPA Free LeakProof Refillable Liquid Travel Accessories for Shampoo Conditioner and Lotion\nAutdor\n{'Package Dimensions': '6.5 x 5.24 x 1.65 inches; 5.93 Ounces', 'UPC': '774848982001', 'Manufacturer': 'Autdor'}\nI can’t say enough good things about these. They feel great and were perfect for our camper. My wife loves that they come with labels. Seriously a great set.\nSo great\nBig Hair Claw Clips for Women and Girls - 4.3 Inch 8 Pcs Matte Claw Hair Clips for Thick Hair, Large Jaw Clips for Thin Hair, 2 Styles Strong Hold Hair Accessories for Girls\nHH Fashion\n{'Brand': 'HH Fashion', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Bow', 'Material': 'Plastic, Metal'}\nStrong hold. Open wide and finishing is good on these.\nGood quality and value.\nGlitter Eyeliner Liquid, Liquid Eyeliner Colorful Set, 10 Colors Liquid Glitter Eyeliner, Glitter Liquid Eyeshadow Set, Shimmer Sparkling Neon Eye liners for Women, Glitter Eyeliner Pencil\nReddhoon\n{'Package Dimensions': '8.03 x 3.86 x 0.67 inches; 4.66 Ounces'}\nGreat selection of colors. Shadow is color tinted each with fine matching glitter mixed well throughout\ngreat colors with same color glitter mixed in\nYouClean 300 Antibacterial Travel Hand Soap Sheets - Pocket/Purse/Wallet/Backpack -Great for Outdoor Camping or Daily Use (Tea Party) (Tea Party)\nYouClean\n['Brand:', 'YouClean', 'Item Form:', 'Sheet', 'Formulation:', 'Concentrated plant-based soap', 'Scent:', 'Tea Party (Chamomile, Green Tea, Tea Tree)', 'Package Box Size:', '2 x 1 x 1.5 inch', 'www.shopyouclean.com', \"We are changing our packaging. No more small plastic cases!   Our new packaging is 100% biodegradable paper. All 300 sheets are tightly packed in 3 tiny paper boxes (100 sheets/box) which nicely fit in any purse/wallet, handbag, and kids' pack-backs.   Check out our 9 scent collections:   - Tea Party  - Citrus Collection  - Purple Heart  - Pink Pamper  - Red Passion  - Blanca Elegance  - Seaside Vacation  - The Adventure  - The Nonsense (unscented)\"]\n{'Item Form': 'Sheet', 'Skin Type': 'All', 'Brand': 'YouClean', 'Scent': 'Tea Party', 'Material Type Free': 'Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)  See more', 'Product Dimensions': '2 x 1 x 1.25 inches; 2.4 Ounces', 'UPC': '609670421100', 'Manufacturer': 'YouClean'}\nThese tiny soaps are perfect for travel and I love them for camping.<br />Easy dissolve. Great packaging\nperfect travel size\nCombofix 2Pcs Silk Scrunchies Mulberry Silk Hair Ties Cute Large Scrunchie Elastic Bands Thick Curly Hair Black Brown Ponytail Fixing Hair Tie Suitable for Girls of all ages\ncombofix\n{'Color': 'Brown', 'Material': 'Silk', 'Item Form': 'Scrunchie', 'Brand': 'Combofix', 'Hair Type': 'Curly', 'Package Dimensions': '7.72 x 5.94 x 0.55 inches; 0.67 Ounces', 'UPC': '774848980564'}\nfeel like satin not silk<br />nice pure black and chocolate brown in color<br />can barely get around my thin ponytail twice. would not recommend for thick hair or full ponytail\nsmall scrunchies\nMRTREUP Chrome Nail Powder Palette , Metallic Mirror Effect Chrome Powder for Nails , Rose Gold Sliver Pink Holographic Nail Glitter Nail Pigment Powder for DIY Salon Nail Art Decorations\nMRTREUP\n{'Package Dimensions': '5.59 x 2.05 x 0.55 inches; 1.76 Ounces'}\nI like this as a touch of glitter option compared to glitter polishes that are using more chunky pieces of glitter. Tiny bit of product gives a great shimmer to manicure.<br />does not come with UV light, base or top coat\nsuper fine glittery effect\nFantaLook Short Heart Styled Reddish Brown Heat Resistant Wig with Teeth Necklace Earrings for Halloween Party\nFantaLook\n{'Color': 'Reddish Brown', 'Material': 'Polyester', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': '耐热', 'Package Dimensions': '8.94 x 7.09 x 2.83 inches; 10.23 Ounces', 'Department': 'Womens', 'Manufacturer': 'MD'}\nGood quality wig with lots of accessories. The instructions were good snd it came ready to use.\nFun set",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user demonstrates a continued interest in hair accessories and beauty tools, now expanding to include wigs as part of their beauty repertoire. Their recent purchase reflects a desire for items that enhance their personal style, particularly for themed events or special occasions.\n\n- **Color Trends:** They remain drawn to warm tones and earthy palettes, with a newfound appreciation for playful and vibrant shades that complement their evolving beauty interests.\n\n- **Functionality:** The user values practicality, as evidenced by their choice of products that combine aesthetic appeal with functional benefits, like heat-resistant materials and versatile styles ensuring ease of use.\n\n- **Aesthetic Appeal:** They appreciate visually charming items that enhance their overall grooming routine. Their recent selection highlights an inclination towards fun, stylish accessories that add a unique flair.\n\n- **Experience with Variability:** The user displays adaptability in their selections, consistently prioritizing quality and performance across a broadening range of beauty products—illustrating a willingness to explore different aspects of beauty.\n\n- **Feedback Trends:** Their reviews indicate a thoughtful evaluation process, blending considerations of style, utility, and performance, with positive experiences reinforcing their discerning tastes.\n\nOverall, the user is curating a diverse yet refined collection of quality beauty products, enhancing their lifestyle while embracing creativity and style in their beauty regimen, from haircare to thematic accessories.",
  "metrics": {
    "rouge1_f": 0.11739745403111738,
    "rouge2_f": 0.0070821529745042485,
    "rougeL_f": 0.05233380480905233,
    "meteor": 0.04431771334341074,
    "bleu1": 0.0031980999029740244,
    "bleu2": 0.0007350081247258914,
    "bleu3": 0.00012235507248039337,
    "bleu4": 4.996641086460071e-05,
    "bertscore_precision": 0.346570760011673,
    "bertscore_recall": 0.4565107822418213,
    "bertscore_f1": 0.39401552081108093
  }
}