{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: CNN Millennium 2000 [DVD]\nReview Date: 2019/07/10\nStore: Various  (Actor, Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Where were you when the clock rolled over from Dec. 31, 1999 to Jan. 1, 2000? CNN, the international cable news network, was in most of the major cities in the world, and it followed the new millennium as it traveled around the globe. This home video presents highlights from the network's live Millennium 2000 coverage, with special attention paid to Sydney (one of the first major cities to ring in the year 2000), Tokyo, Paris, London, and simultaneous celebrations in New York City and Washington, D.C.\"]\nAverage Rating: 4.1\nProduct Details: {'Format': 'Closed-captioned, Color, DVD, NTSC', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Number Of Discs': '1', 'Runtime': '2 hours', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.75 inches; 3.2 Ounces', 'Director': 'Various', 'Media Format': 'Closed-captioned, Color, DVD, NTSC', 'Run time': '2 hours', 'Release date': 'January 11, 2000', 'Actors': 'Various', 'Studio': 'Turner Home Ent', 'Number of discs': '1'}\nReview Text: I wanted this disk on dvd as I previously had it on tape.  I was delighted to see it on dvd.  It came in very excellent delivery time.  I was disappointed when I opened the box (the dvd protective box that comes with it) to find the disk rattling around inside the box instead of being secured on the spindle.  As a result, the disk has many marks on the surface of the dvd.  I haven't played it completely through yet but played the first few minutes and spot checked it and even with the marks it seems to be playing correctly.  I had to change boxes for it, because the disk does not seem to fit on the spindle in the box that it was made for.  The dvd hole is too small for the spindle and I didn't want to push it in case it broke the dvd.  I would have given this a 5 star rating IF the dvd did not have all those marks on the surface.\nReview Title: Not packaged very well.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Graham Theakston', 'Malcolm Mowbray', 'Herbert Wise', 'Rick Stroud', 'Ken Grieve', 'Mary McMurray'], 'Producers': ['ITV'], 'Starring': ['Derek Jacobi']}\nI loved this series.  I wish there were more.  The storylines are very interesting and watching it, it makes you feel like you were actually there living in the tim.  Derek Jacobi makes an excellent Cadfael.  After reading the whole series it was grand to see it put to life.  I would recommend this to anyone who has an interest in this time frame of life.\nPuts you into the picture\n101 Dalmatians II: Patch's London Adventure (Special Edition)\nJason Alexander  (Actor),     Jodi Benson  (Actor),     Jim Kammerud  (Director),     Brian Smith  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Anime\n['UPC:786936757125DESCRIPTION:Disney s irresistible classic continues in this delightful Special Edition, 101 Dalmatians II: Patch s London Adventure releasing for a limited time only on Disney DVD! All of the loveable Dalmatians return, including Patch who longs to be special not just one of the one hundred and one. When the villain Cruella De Vil kidnaps his brothers and sisters, Patch enlists the help of his TV-idol, Thunderbolt, to rescue the pups from Cruella s clutches. Non-stop thrills and inspiring messages of discovery make this animated adventure unforgettable fun for the entire family. END']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Jim Kammerud, Brian Smith', 'Media Format': 'Multiple Formats, Widescreen, Animated, NTSC, Dolby, Surround Sound', 'Run time': '1 hour and 10 minutes', 'Release date': 'September 16, 2008', 'Actors': 'Jason Alexander, Jodi Benson, Barry Bostwick, Maurice LaMarche, Michael Lerner', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, Spanish', 'Language': 'Unqualified', 'Studio': 'Walt Disney Home Entertainment', 'Number of discs': '1'}\nMy granddaughter loves this.  I could take it or leave it.\n6 year old delight\nCats (1999)\nElaine Paige  (Actor),     John Mills  (Actor),     David Mallet  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', '\"Cats\" opened at The Winter Garden on October 7, 1982, carrying an advance of $6.2 million, the largest in Broadway history. In 1997 it surpassed \"A Chorus Line\" as the longest running show in Broadway history. On September 10, 2000, after 7,485 shows and a run of nearly 18 years, the show closed - a Broadway record. For the first time ever, an Andrew Lloyd Webber show has been specially filmed and made available on video. With a star cast including Elaine Paige and Sir John Mills, and its stunning production values, Cats will no doubt set a new standard for the filming of all future musicals. Andrew Lloyd Webber\\'s Cats, the most famous musical of all time, first exploded onto the West End stage in 1981. \\'Memory\\', one of its many classic songs, became an instant worldwide hit. Since then Cats has smashed records and conquered the world. Using the latest technology, all the excitement, thrill, romance and intimacy of this theatrical legend has been captured on screen. Breathtaking visuals and full digital sound (that has been completely re-recorded with a seventy piece orchestra) will lead you deep into the mysterious world of Cats. Cats - as you\\'ll never see it again - more intoxicating and magical than you could possibly imagine.', 'Set Contains:', 'The 30-minute documentary \"What\\'s a Jellicle Cat? The Making of', 'Cats', 'the Video\" provides a backstage look at the video version of the longest-running show in Broadway history. After a brief discussion of the original show\\'s start in 1981, the bulk of the time is spent on the creation of the video and the advantages it had over a stage production--a larger orchestra, clearer lyrics, and close-ups for better story-telling. There\\'s plenty of rehearsal footage, plus comments by Lloyd Webber, director-choreographer Gillian Lynne, Elaine Paige (Grizabella), and other cast members. Of course \"Memory\" is discussed, and an excerpt of it played by the orchestra without vocals is positively gorgeous.', '--David Horiuchi']\n{'Genre': \"Cats: The Musical, Musicals & Performing Arts, Cats, DVD Movie, Blu-ray Movie, Broadway, Andrew Lloyd Webber's Cats, Musical, Cats 1999, Universal Blu-rayCats: The Musical, Musicals & Performing Arts, Cats, DVD Movie, Blu-ray Movie, Broadway, Andrew Lloyd Webber's Cats, Musical, Cats 1999, Universal Blu-ray  See more\", 'Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Widescreen, Letterboxed', 'Contributor': 'Ken Page, David Mallet, Andrew Lloyd Webber, Elaine Paige, John Mills', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.08 Ounces', 'Item model number': '1021116', 'Director': 'David Mallet', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Widescreen, Letterboxed', 'Run time': '2 hours and 1 minute', 'Release date': 'July 5, 2005', 'Actors': 'Elaine Paige, John Mills, Ken Page', 'Subtitles': 'English', 'Producers': 'Andrew Lloyd Webber', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nI love the costumes and the songs.\nHere Kitty\nFantastic Beasts and Where to Find Them (DVD)\nEddie Redmayne  (Actor),     Katherine Waterston  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Fantastic Beasts and Where to Find Them (DVD)', '“Fantastic Beasts and Where to Find Them” opens in 1926 as Newt Scamander has just completed a global excursion to find and document an extraordinary array of magical creatures. Arriving in New York for a brief stopover, he might have come and gone without incident…were it not for a No-Maj (American for Muggle) named Jacob, a misplaced magical case, and the escape of some of Newt’s fantastic beasts, which could spell trouble for both the wizarding and No-Maj worlds.', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Colin Farrell, Jon Voight, J.K. Rowling, Lionel Wigram, Samantha Morton, Carmen Ejogo, David Heyman, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Eddie Redmayne, Steve KlovesColin Farrell, Jon Voight, J.K. Rowling, Lionel Wigram, Samantha Morton, Carmen Ejogo, David Heyman, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Eddie Redmayne, Steve Kloves  See more', 'Language': 'English', 'Studio': 'WarnerBrothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.9 Ounces', 'Director': 'David Yates', 'Media Format': 'NTSC', 'Release date': 'October 3, 2017', 'Actors': 'Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller', 'Dubbed': 'English', 'Producers': 'David Heyman, J.K. Rowling, Steve Kloves, Lionel Wigram', 'Writers': 'J.K. Rowling', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt came in very good time and I gave it to my granddaughter as a Christmas gift.  She quite enjoyed it.\nI gave it as a gift\nCirque du Soleil: Worlds Away [Blu-ray]\nErica Linz  (Actor),     Dallas Barnett  (Actor),     Andrew Adamson  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Kids & Family\n['Visionary filmmakers James Cameron (', 'Avatar', ') and Andrew Adamson (', 'Shrek', ') invite you on a spectacular adventure unlike anything you’ve seen before. Leap, soar, swim and dance with the legendary performers of Cirque du Soleil as they transport a young couple on a “magical journey” worlds away and beyond imagination.', 'Experience Cirque du Soleil Live!', 'Receive a coupon for 20% off the total ticket price on select Cirque du Soleil live shows within the case of your copy of', 'Cirque du Soleil: Worlds Away', 'on Blu-ray or DVD. For a limited time only, additional restrictions apply; see offer in packaging for details.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Dolby, Subtitled, Dubbed, Widescreen', 'Contributor': 'Dallas Barnett, Erica Linz, Andrew Adamson', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Director': 'Andrew Adamson', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Dolby, Subtitled, Dubbed, Widescreen', 'Release date': 'March 12, 2013', 'Actors': 'Erica Linz, Dallas Barnett', 'Dubbed': 'French, Portuguese', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nAs usual it is a very entertaining program by Cirque Du Soleil.  Very prompt delivery\nIt's Cirque Du Soleil, What more can one say\nFantastic Beasts: The Crimes of Grindelwald (Blu-ray)\nEddie Redmayne  (Actor),     Katherine Waterston  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['From the imagination of Wizarding World creator J.K. Rowling comes the Fantastic Beasts film series, magical adventures set before the time of Harry Potter. At the end of the first film, the powerful Dark wizard Gellert Grindelwald (Johnny Depp) was captured by MACUSA (Magical Congress of the United States of America), with the help of Newt Scamander (Eddie Redmayne). But, making good on his threat, Grindelwald escaped custody and has set about gathering followers, most unsuspecting of his true agenda: to raise pure-blood wizards up to rule over all non-magical beings. In an effort to thwart Grindelwald’s plans, Albus Dumbledore (Jude Law) enlists his former student Newt Scamander, who agrees to help, unaware of the dangers that lie ahead. Lines are drawn as love and loyalty are tested, even among the truest friends and family, in an increasingly divided wizarding world.Your Digital Copy redemption code is printed on an insert inside your Blu-ray/DVD package.A Digital Copy is a digital version of the full-length movie that you get when you own specially-marked Blu-ray/DVD discs bearing the “Digital” logo. Owning the digital version of the movie extends your enjoyment because it enables you to download or stream your movie to a computer, mobile device, internet-connected TV, Blu-ray player, or set-top box.']\n{'Genre': 'Kids & Family, Action & Adventure, Science Fiction', 'Format': 'Blu-ray, Subtitled', 'Contributor': 'William Nadylam, Johnny Depp, J.K. Rowling, Kevin Guthrie, Zoë Kravitz, Callum Turner, Carmen Ejogo, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Poppy Corby-Tuech, Eddie Redmayne, Brontis Jodorowsky, Jude Law, Claudia KimWilliam Nadylam, Johnny Depp, J.K. Rowling, Kevin Guthrie, Zoë Kravitz, Callum Turner, Carmen Ejogo, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Poppy Corby-Tuech, Eddie Redmayne, Brontis Jodorowsky, Jude Law, Claudia Kim  See more', 'Initial release date': '2019-03-12', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Digital Copy Expiration Date': 'March 31, 2020', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Subtitled', 'Run time': '2 hours and 13 minutes', 'Release date': 'March 12, 2019', 'Actors': 'Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Portuguese, Spanish, English', 'Studio': 'Studio Distribution Services', 'Writers': 'J.K. Rowling', 'Country of Origin': 'USA', 'Number of discs': '1'}\nanother one for my collection.  The set is very good even if the movie could have been better.\none more for the collections\nCNN Millennium 2000 [DVD]\nVarious  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Where were you when the clock rolled over from Dec. 31, 1999 to Jan. 1, 2000? CNN, the international cable news network, was in most of the major cities in the world, and it followed the new millennium as it traveled around the globe. This home video presents highlights from the network's live Millennium 2000 coverage, with special attention paid to Sydney (one of the first major cities to ring in the year 2000), Tokyo, Paris, London, and simultaneous celebrations in New York City and Washington, D.C.\"]\n{'Format': 'Closed-captioned, Color, DVD, NTSC', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Number Of Discs': '1', 'Runtime': '2 hours', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.75 inches; 3.2 Ounces', 'Director': 'Various', 'Media Format': 'Closed-captioned, Color, DVD, NTSC', 'Run time': '2 hours', 'Release date': 'January 11, 2000', 'Actors': 'Various', 'Studio': 'Turner Home Ent', 'Number of discs': '1'}\nI wanted this disk on dvd as I previously had it on tape.  I was delighted to see it on dvd.  It came in very excellent delivery time.  I was disappointed when I opened the box (the dvd protective box that comes with it) to find the disk rattling around inside the box instead of being secured on the spindle.  As a result, the disk has many marks on the surface of the dvd.  I haven't played it completely through yet but played the first few minutes and spot checked it and even with the marks it seems to be playing correctly.  I had to change boxes for it, because the disk does not seem to fit on the spindle in the box that it was made for.  The dvd hole is too small for the spindle and I didn't want to push it in case it broke the dvd.  I would have given this a 5 star rating IF the dvd did not have all those marks on the surface.\nNot packaged very well.",
  "profile": "**User Profile Summary:**\n\n- **Interest in Historical Narratives**: The user appreciates content that immerses them in historical settings, particularly those with rich storytelling.\n\n- **Character Appreciation**: They have a strong affinity for well-developed characters, indicating that performances by skilled actors significantly enhance their viewing experience.\n\n- **Quality Over Quantity**: The user values well-crafted films and series, seeking depth and richness in storytelling.\n\n- **Moderate Content Sensitivity**: They are discerning regarding themes and are mindful of content advisories related to violence and strong language.\n\n- **Family-Oriented Content**: They enjoy animated and family-friendly films that engage younger audiences, emphasizing communal viewing experiences.\n\n- **Recommendation Inclination**: The user enjoys recommending content to others, reflecting an engaged approach to their entertainment choices.\n\n- **Theater and Musical Enthusiasm**: Their interest in celebrated theatrical performances, especially musicals, highlights a passion for live performance artistry.\n\n- **Gift Giving**: The user demonstrates thoughtfulness by gifting engaging, age-appropriate content to family members, valuing shared experiences through film.\n\n- **Preference for Fantasy and Adventure**: They have shown a growing interest in fantasy narratives that blend action and adventure, suitable for family viewing.\n\n- **Historical Documentaries**: Their recent purchase interest indicates a fascination with historical events, showcased through multimedia formats, reflecting their broader appreciation for narrative depth in both fiction and non-fiction contexts.",
  "metrics": {
    "rouge1_f": 0.08159934720522236,
    "rouge2_f": 0.003266639444671294,
    "rougeL_f": 0.03590371277029783,
    "meteor": 0.02445539059247953,
    "bleu1": 1.6634760615932797e-05,
    "bleu2": 3.671433132174503e-06,
    "bleu3": 6.029604700264452e-07,
    "bleu4": 2.4456506249952975e-07,
    "bertscore_precision": 0.3463602066040039,
    "bertscore_recall": 0.47624513506889343,
    "bertscore_f1": 0.40104860067367554
  }
}