{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fantastic Beasts and Where to Find Them (DVD)\nReview Date: 2019/01/15\nStore: Eddie Redmayne  (Actor),     Katherine Waterston  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Fantastic Beasts and Where to Find Them (DVD)', '“Fantastic Beasts and Where to Find Them” opens in 1926 as Newt Scamander has just completed a global excursion to find and document an extraordinary array of magical creatures. Arriving in New York for a brief stopover, he might have come and gone without incident…were it not for a No-Maj (American for Muggle) named Jacob, a misplaced magical case, and the escape of some of Newt’s fantastic beasts, which could spell trouble for both the wizarding and No-Maj worlds.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Colin Farrell, Jon Voight, J.K. Rowling, Lionel Wigram, Samantha Morton, Carmen Ejogo, David Heyman, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Eddie Redmayne, Steve KlovesColin Farrell, Jon Voight, J.K. Rowling, Lionel Wigram, Samantha Morton, Carmen Ejogo, David Heyman, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Eddie Redmayne, Steve Kloves  See more', 'Language': 'English', 'Studio': 'WarnerBrothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.9 Ounces', 'Director': 'David Yates', 'Media Format': 'NTSC', 'Release date': 'October 3, 2017', 'Actors': 'Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller', 'Dubbed': 'English', 'Producers': 'David Heyman, J.K. Rowling, Steve Kloves, Lionel Wigram', 'Writers': 'J.K. Rowling', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: It came in very good time and I gave it to my granddaughter as a Christmas gift.  She quite enjoyed it.\nReview Title: I gave it as a gift\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Graham Theakston', 'Malcolm Mowbray', 'Herbert Wise', 'Rick Stroud', 'Ken Grieve', 'Mary McMurray'], 'Producers': ['ITV'], 'Starring': ['Derek Jacobi']}\nI loved this series.  I wish there were more.  The storylines are very interesting and watching it, it makes you feel like you were actually there living in the tim.  Derek Jacobi makes an excellent Cadfael.  After reading the whole series it was grand to see it put to life.  I would recommend this to anyone who has an interest in this time frame of life.\nPuts you into the picture\n101 Dalmatians II: Patch's London Adventure (Special Edition)\nJason Alexander  (Actor),     Jodi Benson  (Actor),     Jim Kammerud  (Director),     Brian Smith  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Anime\n['UPC:786936757125DESCRIPTION:Disney s irresistible classic continues in this delightful Special Edition, 101 Dalmatians II: Patch s London Adventure releasing for a limited time only on Disney DVD! All of the loveable Dalmatians return, including Patch who longs to be special not just one of the one hundred and one. When the villain Cruella De Vil kidnaps his brothers and sisters, Patch enlists the help of his TV-idol, Thunderbolt, to rescue the pups from Cruella s clutches. Non-stop thrills and inspiring messages of discovery make this animated adventure unforgettable fun for the entire family. END']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Jim Kammerud, Brian Smith', 'Media Format': 'Multiple Formats, Widescreen, Animated, NTSC, Dolby, Surround Sound', 'Run time': '1 hour and 10 minutes', 'Release date': 'September 16, 2008', 'Actors': 'Jason Alexander, Jodi Benson, Barry Bostwick, Maurice LaMarche, Michael Lerner', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, Spanish', 'Language': 'Unqualified', 'Studio': 'Walt Disney Home Entertainment', 'Number of discs': '1'}\nMy granddaughter loves this.  I could take it or leave it.\n6 year old delight\nCats (1999)\nElaine Paige  (Actor),     John Mills  (Actor),     David Mallet  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', '\"Cats\" opened at The Winter Garden on October 7, 1982, carrying an advance of $6.2 million, the largest in Broadway history. In 1997 it surpassed \"A Chorus Line\" as the longest running show in Broadway history. On September 10, 2000, after 7,485 shows and a run of nearly 18 years, the show closed - a Broadway record. For the first time ever, an Andrew Lloyd Webber show has been specially filmed and made available on video. With a star cast including Elaine Paige and Sir John Mills, and its stunning production values, Cats will no doubt set a new standard for the filming of all future musicals. Andrew Lloyd Webber\\'s Cats, the most famous musical of all time, first exploded onto the West End stage in 1981. \\'Memory\\', one of its many classic songs, became an instant worldwide hit. Since then Cats has smashed records and conquered the world. Using the latest technology, all the excitement, thrill, romance and intimacy of this theatrical legend has been captured on screen. Breathtaking visuals and full digital sound (that has been completely re-recorded with a seventy piece orchestra) will lead you deep into the mysterious world of Cats. Cats - as you\\'ll never see it again - more intoxicating and magical than you could possibly imagine.', 'Set Contains:', 'The 30-minute documentary \"What\\'s a Jellicle Cat? The Making of', 'Cats', 'the Video\" provides a backstage look at the video version of the longest-running show in Broadway history. After a brief discussion of the original show\\'s start in 1981, the bulk of the time is spent on the creation of the video and the advantages it had over a stage production--a larger orchestra, clearer lyrics, and close-ups for better story-telling. There\\'s plenty of rehearsal footage, plus comments by Lloyd Webber, director-choreographer Gillian Lynne, Elaine Paige (Grizabella), and other cast members. Of course \"Memory\" is discussed, and an excerpt of it played by the orchestra without vocals is positively gorgeous.', '--David Horiuchi']\n{'Genre': \"Cats: The Musical, Musicals & Performing Arts, Cats, DVD Movie, Blu-ray Movie, Broadway, Andrew Lloyd Webber's Cats, Musical, Cats 1999, Universal Blu-rayCats: The Musical, Musicals & Performing Arts, Cats, DVD Movie, Blu-ray Movie, Broadway, Andrew Lloyd Webber's Cats, Musical, Cats 1999, Universal Blu-ray  See more\", 'Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Widescreen, Letterboxed', 'Contributor': 'Ken Page, David Mallet, Andrew Lloyd Webber, Elaine Paige, John Mills', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.08 Ounces', 'Item model number': '1021116', 'Director': 'David Mallet', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Widescreen, Letterboxed', 'Run time': '2 hours and 1 minute', 'Release date': 'July 5, 2005', 'Actors': 'Elaine Paige, John Mills, Ken Page', 'Subtitles': 'English', 'Producers': 'Andrew Lloyd Webber', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nI love the costumes and the songs.\nHere Kitty\nFantastic Beasts and Where to Find Them (DVD)\nEddie Redmayne  (Actor),     Katherine Waterston  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Fantastic Beasts and Where to Find Them (DVD)', '“Fantastic Beasts and Where to Find Them” opens in 1926 as Newt Scamander has just completed a global excursion to find and document an extraordinary array of magical creatures. Arriving in New York for a brief stopover, he might have come and gone without incident…were it not for a No-Maj (American for Muggle) named Jacob, a misplaced magical case, and the escape of some of Newt’s fantastic beasts, which could spell trouble for both the wizarding and No-Maj worlds.', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Colin Farrell, Jon Voight, J.K. Rowling, Lionel Wigram, Samantha Morton, Carmen Ejogo, David Heyman, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Eddie Redmayne, Steve KlovesColin Farrell, Jon Voight, J.K. Rowling, Lionel Wigram, Samantha Morton, Carmen Ejogo, David Heyman, Dan Fogler, Ezra Miller, Alison Sudol, David Yates, Katherine Waterston, Eddie Redmayne, Steve Kloves  See more', 'Language': 'English', 'Studio': 'WarnerBrothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.9 Ounces', 'Director': 'David Yates', 'Media Format': 'NTSC', 'Release date': 'October 3, 2017', 'Actors': 'Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller', 'Dubbed': 'English', 'Producers': 'David Heyman, J.K. Rowling, Steve Kloves, Lionel Wigram', 'Writers': 'J.K. Rowling', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt came in very good time and I gave it to my granddaughter as a Christmas gift.  She quite enjoyed it.\nI gave it as a gift",
  "profile": "**User Profile Summary:**\n\n- **Interest in Historical Narratives**: The user appreciates content that immerses them in historical settings, showing a strong preference for storylines that evoke a sense of being part of the time period.\n\n- **Character Appreciation**: They demonstrate a clear affinity for well-developed characters, indicating that performances by skilled actors, such as those in cinematic and theatrical works, significantly enhance their viewing experience.\n\n- **Quality Over Quantity**: Valuing well-crafted series, the user seeks depth and richness in storytelling, often desiring more content when they enjoy a particular series or film.\n\n- **Moderate Content Sensitivity**: They exhibit discernment regarding themes, being mindful of content advisories related to violence and strong language.\n\n- **Family-Oriented Content**: The user enjoys animated and family-friendly films that engage younger audiences and values experiences that resonate with family members, emphasizing communal viewing.\n\n- **Recommendation Inclination**: They are likely to recommend enjoyable content to others, reflecting an engaged approach to their entertainment choices.\n\n- **Theater and Musical Enthusiasm**: They have shown interest in celebrated theatrical performances, especially musicals, highlighting a love for the artistry of live performance and production values.\n\n- **Gift Giving**: The user expresses a thoughtful aspect of their personality by gifting engaging, age-appropriate content to family members, particularly enjoying shared experiences through film.\n\nOverall, the user is drawn to high-quality, character-driven stories across genres, combining a thoughtful, family-oriented approach with an appreciation for historical and theatrical elements.",
  "metrics": {
    "rouge1_f": 0.14254859611231105,
    "rouge2_f": 0.008651766402307139,
    "rougeL_f": 0.06623470122390208,
    "meteor": 0.04982299724662384,
    "bleu1": 0.004190792032303279,
    "bleu2": 0.0012061942203605853,
    "bleu3": 0.00038328377586035415,
    "bleu4": 0.00012159926620778089,
    "bertscore_precision": 0.3508647680282593,
    "bertscore_recall": 0.4633849859237671,
    "bertscore_f1": 0.3993503749370575
  }
}