{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Crazy from the Heart [VHS]\nReview Date: 2013/12/12\nStore: Format: VHS Tape\nCategories: Movies & TV, Featured Categories\nProduct Description: [\"A small-town, high-school principal still living at home with her mother shakes up her life in a way that even she never expected when she agrees to go out on a date with her school's Hispanic janitor.\"]\nAverage Rating: 4.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 0.01 Ounces', 'Media Format': 'VHS'}\nReview Text: Wonderful film, now available on DVD, do a google search! and It's worth what you have to pay for it!\nReview Title: Great film, now on DVD\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Sid the Science Kid: Sid in Motion\nSid the Science Kid  (Actor),     Katy Garretson  (Director),     David Gumpel  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"Sid the Science Kid ™ is trying out his new dance, Sid Slide to the Side, on his hardwood floors when he discovers that friction prevents him from sliding in his sneakers. When he plays ball, he quickly learns that if a ball doesn't have enough elasticity, it won't bounce! This calls for some serious investigating! After pretending to be Super Sid by kicking the ball with all his might, Sid and his friends take a trip to the Science Center to investigate how using lots of force makes things move far and fast! Join Sid and his friends as they explore the laws of motion!\"]\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '8646994', 'Director': 'Katy Garretson, David Gumpel', 'Media Format': 'Multiple Formats, Color, Animated, NTSC', 'Run time': '1 minute', 'Release date': 'January 10, 2012', 'Actors': 'Sid the Science Kid', 'Studio': 'Ncircle', 'Number of discs': '1'}\nSid the science kid is a must for young kids. My grandson starting watching it at age three and has picked up an amazing vocabulary and science concepts. I find it entertaining, too. Quick delivery, reliable seller.\nOne of the best!\nSid the Science Kid: Sense-Ational Adventures\nSid and Friends  (Actor),     The Jim Henson Company  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Did you hear that? Can you see this? What's that smell? Sid and his friends are embarking on a quest to explore vision, hearing, touch, smell and taste! Sid wonders why the tag on his shirt is really itchy so his class explores all the different textures around them. Sid is curious about why Grandma's glasses help her see clearly, but make things blurry for him. But when it comes to hearing, is it possible that Sid has super powers? Find out all about Sid's Super Duper Senses and find out about your own senses in these sense-sational stories!\"]\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6313446', 'Director': 'The Jim Henson Company', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'January 4, 2011', 'Actors': 'Sid and Friends', 'Studio': 'Ncircle', 'Number of discs': '1'}\nSid the science kid is a must for young kids. My grandson starting watching it at age three and has picked up an amazing vocabulary and science concepts. I find it entertaining, too. Quick delivery, reliable seller.\nSid is GREAT!!!!\nMcCabe & Mrs. Miller\nWarren Beatty  (Actor),     Julie Christie  (Actor),     Robert Altman  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['A frontier gambler and madam protect their booming business from outside investors. Directed by Robert Altman.']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Robert Altman', 'Media Format': 'Anamorphic, Closed-captioned, Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 1 minute', 'Release date': 'June 4, 2002', 'Actors': 'Warren Beatty, Julie Christie, Rene Auberjonois, William Devane, John Schuck', 'Subtitles': 'English, Spanish, French, Portuguese, Japanese', 'Language': 'Unqualified (DTS ES 6.1), French (Dolby Digital 2.0), English (Dolby Digital 2.0)', 'Studio': 'Warner Home Video', 'Writers': 'Edmund Naughton, Robert Altman, Brian McKay', 'Number of discs': '1'}\nIf you are a Beatty and Christy fan, you will enjoy this movie. My favorite part is the music, a lot of songs sung by Leonard Cohen.<br />Worth watching for the scenery and music!\nOne of my favorites\nBroadway Musicals: A Jewish Legacy\nJoel Grey  (Actor),     Michael Kantor  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Recent Peabody Award winner as seen on PBS', \"Performances by Matthew Broderick, Kelli O'Hara, Zero Mostel, Nathan Lane, Barbra Streisand, Idina Menzel, Kristin Chenoweth, and many more  Engaging, humorous, and provocative,\", 'Broadway Musicals: A Jewish Legacy', \"examines the unique role of Jewish composers and lyricists in the creation of the modern American musical. The film showcases the work of legends such as Irving Berlin, Jerome Kern, George and Ira Gershwin, Lorenz Hart, Richard Rodgers, Oscar Hammerstein II, Leonard Bernstein, and Stephen Sondheim. Interviews with songwriters and luminaries including Sheldon Harnick, Stephen Schwartz, Harold Prince, Arthur Laurents, Charles Strouse, and Mel Brooks provide insight, alongside standout performances and archival footage.  Narrated by Tony® and Academy Award® winner Joel Grey, this entertaining documentary mingles cultural history with illuminating perspectives on the origins and meanings of some of Broadway's most beloved songs, stories, and shows.\"]\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Joel Grey, Michael Kantor', 'Language': 'English', 'Runtime': '1 hour and 24 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26355977', 'Director': 'Michael Kantor', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 24 minutes', 'Release date': 'May 7, 2013', 'Actors': 'Joel Grey', 'Studio': 'Acorn', 'Number of discs': '2'}\nThis has great songs and music and raw footage of the old stars. It was both very informative and enjoyable!\nWonderful DVD\nCrazy from the Heart [VHS]\nFormat: VHS Tape\nMovies & TV, Featured Categories\n[\"A small-town, high-school principal still living at home with her mother shakes up her life in a way that even she never expected when she agrees to go out on a date with her school's Hispanic janitor.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 0.01 Ounces', 'Media Format': 'VHS'}\nWonderful film, now available on DVD, do a google search! and It's worth what you have to pay for it!\nGreat film, now on DVD",
  "profile": "**User Summary:**\n\n- **Target Audience**: Primarily focused on children’s educational content for preschool-aged kids, while maintaining a strong interest in classic films and Broadway musicals.\n- **Content Preference**: Predominantly enjoys animated, science-oriented shows that merge entertainment with learning, along with documentaries that explore music and cultural history. Recently expressed admiration for classic cinema, reflecting a well-rounded appreciation for artistic storytelling.\n- **Review Behavior**: Consistently leaves positive reviews emphasizing both educational value and entertainment quality. This includes a growing focus on documentaries and classic films, highlighting the user’s evolving taste in media. Strongly values a reliable purchasing experience and trustworthy sellers.\n- **Emotional Connection**: Connects personally with the content, often referencing a grandchild’s enjoyment, indicating a family-oriented approach to selecting media that fosters educational growth and personal enjoyment in films. \n- **Engagement Level**: Actively seeks materials that are both engaging for children and intellectually stimulating. Recently praised a classic film for its quality and cultural significance. Enjoys immersive aesthetic and auditory experiences in children's programming as well as cinematic classics.\n\nOverall, the user prioritizes high-quality children’s media that supports learning objectives while enriching their appreciation for classic films, reflecting a proactive engagement in enhancing educational growth through varied media.",
  "metrics": {
    "rouge1_f": 0.14285714285714285,
    "rouge2_f": 0.004934210526315789,
    "rougeL_f": 0.06568144499178982,
    "meteor": 0.04280564734154401,
    "bleu1": 0.0031753442564337406,
    "bleu2": 0.00048802596671293903,
    "bleu3": 9.643105055231185e-05,
    "bleu4": 4.29072319416402e-05,
    "bertscore_precision": 0.34547722339630127,
    "bertscore_recall": 0.4529383182525635,
    "bertscore_f1": 0.391975998878479
  }
}