{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Back to the Future: 25th Anniversary Trilogy [Blu-ray]\nReview Date: 2015/05/01\nStore: Michael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Experience one of the most popular movie series of all time like never before with the Back to the Future 25th Anniversary Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, these timeless films feature all-new 25th Anniversary restorations for enhanced picture and sound plus hours of exciting bonus features.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Triva Track', 'U-Control: Triva Track', 'Deleted Scenes', 'Deleted Scenes', 'Tales from the Future: In the Beginning...', 'Tales from the Future: In the Beginning...', 'Tales from the Future: Time to Go', 'Tales from the Future: Time to Go', 'Tales from the Future: Keeping Time', 'Tales from the Future: Keeping Time', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Back to the Future Night', 'Back to the Future Night', 'Michael J. Fox Q&A', 'Michael J. Fox Q&A', 'Original Makeup Tests', 'Original Makeup Tests', 'Outtakes', 'Outtakes', 'Nuclear Test Site Ending Storyboard Sequence', 'Nuclear Test Site Ending Storyboard Sequence', 'Photo Galleries', 'Photo Galleries', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Join TEAM FOX', 'Join TEAM FOX', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 2 - Back to the Future Part II:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Trivia Track', 'U-Control: Trivia Track', 'Deleted Scene', 'Deleted Scene', 'Tales from the Future: Time Flies', 'Tales from the Future: Time Flies', 'The Physics of Back to the Future', 'The Physics of Back to the Future', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Outtakes', 'Outtakes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLeorean', 'Designing the DeLeorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects', 'Evolution of Visual Effects', 'Photo Galleries', 'Photo Galleries', 'Trailer', 'Trailer', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 3 - Back to the Future Part III:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control Trivia Track', 'U-Control Trivia Track', 'Deleted Scene', 'Deleted Scene', \"Tales from the Future: Third Time's the Charm\", \"Tales from the Future: Third Time's the Charm\", 'Tales from the Future: The Test of Time', 'Tales from the Future: The Test of Time', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', 'Outtakes', 'Outtakes', 'Designing Hill Valley', 'Designing Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Photo Galleries', 'Photo Galleries', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Trailer', 'Trailer', 'Back to the Future: The Ride', 'Back to the Future: The Ride', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent MovieScience Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent Movie  See more', 'Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harry Carey, Jr., Elisabeth Shue, Casey Siemaszko, Frank Marshall, Bill Varney, Neil Canton, Claudia Wells, Robert Rutledge, Bob Gale, Charles L. CampbellChristopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harr…  See more', 'Language': 'French (DTS 5.1), Spanish (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '5 hours and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.55 x 0.75 inches; 7.2 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 43 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nReview Text: Very good films (for a very satisfing weekend binge!) that look better than I remember the film print looking!  It is far above the VHS versions I watched in the 80's.  The extras are great as well, a solid buy.\nReview Title: Looks great, many extras\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Kung Fu Panda Two-Disc Blu-ray Boxed Set (Kung Fu Panda / Kung Fu Panda 2 / Secrets of the Masters)\nJack Black  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Get both', 'Kung Fu Panda', 'movies plus the all-new Po adventure', 'Kung Fu Panda: Secrets of the Masters', ', and so much more!', 'Amazon.com', 'Kung Fu Panda', 'What\\'s a panda to do when his dreams of kung-fu awesomeness awake to the cold reality of noodle-making? Clumsy, overweight Po (Jack Black) dreams of becoming a kung fu master like China\\'s revered \"furious five,\" but instead seems destined to follow in the footsteps of his father and grandfather in the restaurant business. When great leader Oogway has a vision that the imprisoned kung fu warrior Tai Lung (Ian McShane) will soon escape, he declares it time to choose China\\'s dragon warrior--one kung fu master deemed worthy of possessing the dragon\\'s scroll and its secret to limitless power. Po and all the townspeople rush to the Jade Palace atop the highest mountain to witness the contest between Tigress (Angelina Jolie), Monkey (Jackie Chan), Mantis (Seth Rogan), Crane (David Cross) and Viper (Lucy Liu), but Po is locked outside the palace. After a miracle of sorts, Po lands inside the palace gates, where he is chosen as the dragon warrior and placed under the tutelage of the decidedly non-plussed master Shifu (Dustin Hoffman). An unconventional student to say the least, hilarity reigns as Shifu tries desperately to make Po into some semblance of a kung fu warrior. Can Po possibly fulfill his destiny as dragon warrior, or was Oogway\\'s final decision a critical mistake? A film rich with hilarious moments, superior animation, and an important message about believing in oneself and the power that comes from within,', 'Kung Fu Panda', 'is great entertainment that will have the whole family laughing and begging for more. (Ages 3 and older)', '--Tami Horiuchi', 'Kung Fu Panda 2', 'Kung Fu Panda 2', \"is a sequel that definitely lives up to its predecessor, thanks to excellent animation and a great mix of action, comedy, and important life lessons. Dragon Warrior Po (Jack Black) has matured and mastered many new challenges since learning the art of kung fu and defeating the snow leopard Tai Lung, but he hasn't lost his penchant for steamed buns, nor has he achieved what his teacher Master Shifu (Dustin Hoffman) describes as true inner peace. Before he can settle into the arduous task of self-discovery, word arrives that a nearby town of musicians has been attacked and their leader Master Thundering Rhino (Victor Garber) killed by a newly invented weapon that breathes fire and spits out metal--a weapon that is a harbinger of the end of kung fu and the domination of all of China by Lord Shen (Gary Oldman). Po and the Furious Five (Angelina Jolie, Seth Rogen, Jackie Chan, David Cross, and Lucy Liu) set out to destroy the mysterious weapon and save kung fu, encountering the imprisoned and very dispirited kung fu legends Master Oxen (Dennis Haysbert) and Master Croc (Jean-Claude Van Damme) along the way, but the group quickly discovers that their task is far from simple. Even as Soothsayer (Michelle Yeoh) adamantly foretells Lord Shen's defeat at the hands of a warrior of black and white, Po struggles with the realization that he must come to terms with his adoption in order to let go of the past and become who he chooses to be. Only then can he achieve the inner peace that will empower him to triumph over his personal insecurities and Lord Shen.\", 'Kung Fu Panda 2', 'offers excellent animation and 3-D effects, nice brisk pacing, great voice talent, life lessons that ring true, and a healthy dose of comedy that includes everything from wisecracks to a dragon that eats unsuspecting villagers and then poops them out, and a radish trained in the art of kung fu. (Ages 3 and older)', '--Tami Horiuchi']\n{'Genre': 'Music Videos & Concerts', 'Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Contributor': 'Jack Black', 'Runtime': '1 hour and 33 minutes', 'Studio': 'Universal Pictures Home Entertainment', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Media Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'December 13, 2011', 'Actors': 'Jack Black', 'Number of discs': '2'}\nI got major points from the kids AND the wife on this purchase!  Great movie, gorgeous Blu-Ray quality.\nA must-have for fans of the franchise!\nApocalypse Now (Apocalypse Now / Apocalypse Now Redux / Hearts of Darkness) (Three-Disc Full Disclosure Edition) [Blu-ray]\nMartin Sheen  (Actor),     Marlon Brando  (Actor),     Francis Ford Coppola  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Francis Ford Coppola's timeless classic comes to Blu-ray for the first time! This 3-Disc Full Disclosure Edition includes Apocalypse Now and Apocalypse Now Redux in stunning new transfers supervised by Francis Ford Coppola - and presented for the first time in their original 2.35:1 theatrical aspect ratios. Also included is the feature-length making-of documentary Hearts of Darkness, presented in a new 1080p HD transfer. Additional features include a 48-page collectible booklet with never-before-seen archives from the set, over 9 hours of bonus features, plus a storyboard gallery, image galleries, marketing archives and an original script excerpt from John Milius featuring hand-written notes from Coppola.\", 'Amazon.com', 'Apocalypse Now / Apocalypse Now: Redux', 'In the tradition of such obsessively driven directors as Erich von Stroheim and Werner Herzog, Francis Ford Coppola approached the production of', 'Apocalypse Now', 'as if it were his own epic mission into the heart of darkness. On location in the storm-ravaged Philippines, he quite literally went mad as the project threatened to devour him in a vortex of creative despair, but from this insanity came one of the greatest films ever made. It began as a John Milius screenplay, transposing Joseph Conrad\\'s classic story \"Heart of Darkness\" into the horrors of the Vietnam War, following a battle-weary Captain Willard (Martin Sheen) on a secret upriver mission to find and execute the renegade Colonel Kurtz (Marlon Brando), who has reverted to a state of murderous and mystical insanity. The journey is fraught with danger involving wartime action on epic and intimate scales. One measure of the film\\'s awesome visceral impact is the number of sequences, images, and lines of dialogue that have literally burned themselves into our cinematic consciousness, from the Wagnerian strike of helicopter gunships on a Vietnamese village to the brutal murder of stowaways on a peasant sampan and the unflinching fearlessness of the surfing warrior Lieutenant Colonel Kilgore (Robert Duvall), who speaks lovingly of \"the smell of napalm in the morning.\" Like Herzog\\'s Aguirre: The Wrath of God, this film is the product of genius cast into a pit of hell and emerging, phoenix-like, in triumph. Coppola\\'s obsession (effectively detailed in the riveting documentary', 'Hearts of Darkness', \", directed by Coppola's wife, Eleanor) informs every scene and every frame, and the result is a film for the ages. --\", 'Jeff Shannon', 'Hearts of Darkness', 'Hearts of Darkness', \"is an engrossing, unwavering look back at Francis Coppola's chaotic, catastrophe-plagued Vietnam production,\", 'Apocalypse Now', \". Filled with juicy gossip and a wonderful behind-the-scenes look at the stressful world of moviemaking, the documentary mixes on-location home movies shot in the Philippines by Eleanor Coppola, the director's wife, with revealing interviews with the cast and crew, shot 10 years later. Similar to Burden of Dreams, Les Blank's absorbing portrait of Werner Herzog's struggle to make Fitzcarraldo, the film chronicles Coppola's eventual decent into obsessive psychosis as everything that could go wrong does go wrong. Storms destroy sets, money evaporates, the Philippine government continually harasses the director, Coppola has romantic affairs, and he can't write the story's ending. Everything is captured on film. In the most disturbing scene, we watch Martin Sheen have a drunken nervous breakdown while his director goads him on (he eventually suffered a heart attack, but finished the film).  Other incredible footage is not visual, but aural as the film includes tapes Eleanor Coppola recorded without Francis's knowledge. In them, he truly sounds like a madman as he confesses his fears about making a bomb of a movie. But while Hearts of Darkness is an amazing, voyeuristic experience, its importance lies in the personal reflections offered by those involved. Sheen, Coppola, and Dennis Hopper speak frankly without embarrassment, offering us an essential piece of film history. --\", 'Dave McCoy']\n{'Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more', 'Contributor': 'Francis Ford Coppola, Martin Sheen, Marlon Brando', 'Language': 'English', 'Runtime': '7 hours and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '031398126195', 'Director': 'Francis Ford Coppola', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '7 hours and 31 minutes', 'Release date': 'October 19, 2010', 'Actors': 'Martin Sheen, Marlon Brando', 'Subtitles': 'English, French, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '3'}\nA must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the &#34;short&#34; version or the Redux with the restored plantation scene and some other ones as well.  The extras are an amazing insight into how the film was made and the included documentary Hearts of Darkness shows the toll the process took of the director.<br /><br />An amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nWhy would you not own this?!\nBlade Runner (30th Anniversary Collector's Edition) [Blu-ray]\nHarrison Ford  (Actor),     Ridley Scott  (Director)    Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Product Description', \"In a cyberpunk vision of the future, man has developed the technology to create replicants, human clones used to serve in the colonies outside Earth but with fixed lifespans. In Los Angeles, 2019, Deckard is a Blade Runner, a cop who specializes in terminating replicants. Originally in retirement, he is forced to re-enter the force when four replicants escape from an off-world colony to Earth. The #1 sci-fi film of all time is captured in this 3-disc Blu-ray/DVD and 30th Anniversary commemorative gift set. The set includes: the final cut on Blu-ray and DVD.The 30th Anniversary Collector's Edition box set features an all-new concept spinner car, action Lenticular and a 72-page art production book with never-before-seen Ridley sketches, poster art and photos from the set.\", 'Review', \"It is, in fact, an amazingly sophisticated, sumptuously visionary treatise on the consequences of attaining god-hood. --Rita Kempley, The Washington PostThe view of the future offered by Ridley Scott's muddled yet mesmerizing ''Blade Runner'' is as intricately detailed as anything a science-fiction film has yet envisioned. --The New York Times, Janet MaslinRidley Scott's 1982 masterpiece, back on the big screen in this definitive version, is an overwhelming experience --The Guardian, Mark Kermode\"]\n{'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.8 x 5.7 x 7 inches; 8.8 Ounces', 'Item model number': '313554', 'Director': 'Ridley Scott', 'Media Format': \"Multiple Formats, Blu-ray, Box set, NTSC, Widescreen, Collector's Edition\", 'Run time': '1 hour and 57 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Harrison Ford', 'Studio': 'Warner Home Video', 'Number of discs': '3'}\nA must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the original US version with the narration if you wish, the European version, the falsely named &#34;director's cut&#34; or Scott's &#34;Final Version.&#34;<br /><br />The extras are an amazing insight into how the film was restored and how some of the glaring problems were fixed (the scene where Zora is 'retired' and it is obviosuly a stunt woman, the horrible ADR inside the reptile seller's shop and the releasing of the dove at the end).  Otherwise the film was cleaned up and brightened to reveal all of the details in the amazing world Scott and his team created.  For those of us that grew up watching this on VHS it is nothing short of a revelation to see this gorgeous version.<br /><br />This is an amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nWhy would you not buy this?!\nBack to the Future: 25th Anniversary Trilogy [Blu-ray]\nMichael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Experience one of the most popular movie series of all time like never before with the Back to the Future 25th Anniversary Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, these timeless films feature all-new 25th Anniversary restorations for enhanced picture and sound plus hours of exciting bonus features.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Triva Track', 'U-Control: Triva Track', 'Deleted Scenes', 'Deleted Scenes', 'Tales from the Future: In the Beginning...', 'Tales from the Future: In the Beginning...', 'Tales from the Future: Time to Go', 'Tales from the Future: Time to Go', 'Tales from the Future: Keeping Time', 'Tales from the Future: Keeping Time', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Back to the Future Night', 'Back to the Future Night', 'Michael J. Fox Q&A', 'Michael J. Fox Q&A', 'Original Makeup Tests', 'Original Makeup Tests', 'Outtakes', 'Outtakes', 'Nuclear Test Site Ending Storyboard Sequence', 'Nuclear Test Site Ending Storyboard Sequence', 'Photo Galleries', 'Photo Galleries', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Join TEAM FOX', 'Join TEAM FOX', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 2 - Back to the Future Part II:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Trivia Track', 'U-Control: Trivia Track', 'Deleted Scene', 'Deleted Scene', 'Tales from the Future: Time Flies', 'Tales from the Future: Time Flies', 'The Physics of Back to the Future', 'The Physics of Back to the Future', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Outtakes', 'Outtakes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLeorean', 'Designing the DeLeorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects', 'Evolution of Visual Effects', 'Photo Galleries', 'Photo Galleries', 'Trailer', 'Trailer', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 3 - Back to the Future Part III:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control Trivia Track', 'U-Control Trivia Track', 'Deleted Scene', 'Deleted Scene', \"Tales from the Future: Third Time's the Charm\", \"Tales from the Future: Third Time's the Charm\", 'Tales from the Future: The Test of Time', 'Tales from the Future: The Test of Time', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', 'Outtakes', 'Outtakes', 'Designing Hill Valley', 'Designing Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Photo Galleries', 'Photo Galleries', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Trailer', 'Trailer', 'Back to the Future: The Ride', 'Back to the Future: The Ride', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent MovieScience Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent Movie  See more', 'Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harry Carey, Jr., Elisabeth Shue, Casey Siemaszko, Frank Marshall, Bill Varney, Neil Canton, Claudia Wells, Robert Rutledge, Bob Gale, Charles L. CampbellChristopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harr…  See more', 'Language': 'French (DTS 5.1), Spanish (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '5 hours and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.55 x 0.75 inches; 7.2 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 43 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nVery good films (for a very satisfing weekend binge!) that look better than I remember the film print looking!  It is far above the VHS versions I watched in the 80's.  The extras are great as well, a solid buy.\nLooks great, many extras",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interests:** Family-friendly animated movies, classic cinema, and iconic sci-fi classics, particularly those that blend humor with meaningful life lessons and a focus on filmmaking insights.\n- **Preferred Genre:** Animation, comedy, drama with emotional depth, adventure, and a strong appreciation for science fiction that explores complex themes and visionary storytelling.\n- **Media Format Preference:** Strong preference for Blu-ray and high-quality visual content, especially special editions with extensive bonus features that highlight cinematic craftsmanship and production insights.\n- **Shopping Behavior:** Values engaging family films that elicit positive reactions, with a focus on cultural landmark films and definitive editions for enhanced viewing experiences.\n- **Social Aspects:** Enjoys films celebrated within the family, seeking entertainment with educational value, and is interested in thought-provoking discussions on deeper themes.\n- **Review Style:** Provides detailed feedback emphasizing entertainment value, visual excellence, and thoughtful insights into production processes, reflecting a discerning taste for cinematic quality and documentaries on filmmaking.\n- **Favorite Elements:** Appreciates iconic voice actors, popular franchises, and classic films with substantial content, showcasing loyalty to significant narratives and character development, while expanding appreciation for noted science fiction works.\n- **Overall Rating Trend:** Consistently favorable ratings, emphasizing satisfaction across a diverse range of content and a commitment to recommending quality films that resonate across generations.",
  "metrics": {
    "rouge1_f": 0.06779661016949153,
    "rouge2_f": 0.010175240248728096,
    "rougeL_f": 0.03615819209039549,
    "meteor": 0.021340758041763955,
    "bleu1": 1.812862604812886e-07,
    "bleu2": 6.715719333082685e-08,
    "bleu3": 2.4144261762608007e-08,
    "bleu4": 6.8517278545272e-09,
    "bertscore_precision": 0.36407923698425293,
    "bertscore_recall": 0.5155179500579834,
    "bertscore_f1": 0.42676210403442383
  }
}