{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/11/05\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Lowery'], 'Producers': ['Toby Halbrooks', 'James M. Johnston', 'Adam Donaghey'], 'Starring': ['Casey Affleck', 'Rooney Mara'], 'Studio': ['A24 Distribution LLC']}\nReview Text: I hate reading any reviews before I watch a film.  It is hard not to though.<br />No, this isn't a &#34;scary&#34; Halloween movie , but it is about a ghost.  It is about a lot more.<br />It is meditative.  If you are in for an action flick.  This isn't it.<br /><br />But it is VERY good.  Give it a chance.  If you are in a calm, meditative and contemplative space this is for you.  Open yourself up to the quiet of this film.<br /><br />I won't give the plot away.  It is more about feeling and thinking and being and not being.. that is all I will say.<br /><br />Peace\nReview Title: A very good, meditative and contemplative movie and that is a GOOD thing.  Very recommended.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Doc Martin Special Collection: Series 1-5 plus the Movies\nClunes, Martin  (Actor),     Catz, Caroline  (Actor),     Ferguson, Craig  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['“Sweet, stirring, and completely addictive” ––', 'Slate', '“Delightfully quirky” —', 'Los Angeles Times', 'He’s surly, tactless, self-centered, and uptight—but he’s the only doctor in town.  Relocating to the picturesque village of Portwenn is not what this doctor ordered. After developing a crippling fear of blood, hotshot London surgeon Martin Ellingham (Martin Clunes,', 'Men Behaving Badly', ') reluctantly retrains as a GP and opens a practice in the quirky seaside town, where he quickly offends the villagers with his dour and dismissive bedside manner.  In these five complete series, Doc Martin catches the eye of the most beautiful woman in Portwenn (Caroline Catz,', 'Murder in Suburbia', '), tests the patience of his long-suffering aunt (Stephanie Cole,', 'Tenko', '), and repeatedly hurts feelings as he heals bodies. The two feature-length movies reveal the character’s first incarnation as Dr. Martin Bamford. He’s still ornery but less socially inept, an obstetrician fleeing to the coastal village to reassess his marriage and career.  Martin Clunes delivers an uproarious lead performance, aided by outstanding supporting casts, in this award-winning fish-out-of-water comedy.']\n{'Genre': 'Comedy', 'Format': 'Box set, Widescreen, Multiple Formats, NTSC, Color', 'Contributor': 'Absolom, Joe, Clunes, Martin, Catz, Caroline, McNeice, Ian, Ferguson, Craig', 'Language': 'English', 'Number Of Discs': '13', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 3.6 x 7.7 inches; 15.2 Ounces', 'Item model number': '21388', 'Director': 'Ferguson, Craig', 'Media Format': 'Box set, Widescreen, Multiple Formats, NTSC, Color', 'Run time': '32 hours and 45 minutes', 'Release date': 'May 7, 2013', 'Actors': 'Clunes, Martin, Catz, Caroline, McNeice, Ian, Absolom, Joe', 'Studio': 'ACORN MEDIA', 'Number of discs': '13'}\nI really love this series..<br />It is funny, the timing is great.<br />Well written and boy, I want to live in a village like Portwenn.<br /><br />The only criticism I have as I move through this series is more on the portrayal of alternative medicine.  Obviously Doc Martin is strickly Left brain my way or the highway medical science is best.  And the series generally portrays any alternative more natural theories as utterly quackish  I feel that I had to say something because in all honesty I do not feel that natural alternative medicine is portrayed very fairly.  It is completely maligned and mocked while Doc Ellingham is generally won out to be right all the time.<br /><br />I just wanted folks to know that this is not exacty a balanced portrayal.  Yes, some alternative theories can be take to extreme.. but so can very left brain approaches in medicine and science.<br /><br />For example.. overuse of antibiotics.  Antibiotics are useful but overprescribed generally by doctors for everything.  He is somewhat more mannered that Edith... his ex.. who is VERY elitist.<br /><br />Anyway.. that is my 2 cents\nI really love this series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Grant Baldwin'], 'Producers': ['Jenny Rustemeyer'], 'Starring': ['Jonathan Bloom', 'Tristram Stuart', 'Dana Gunders']}\nThis is a MUST WATCH Documentary!.  I have been wanting to see this for a while now because I know it is a horrendous issue. Furthermore, I know I am IMMENSELY GUILTY for wasting food.<br /><br />I am striving to change my ways and save $$ on food, on working not to waste so much food and to help bring awareness to this issue.<br /><br />I know &#34;shaming&#34; folks is frowned upon.. but maybe this is something we should shame .  People are supposidly going hungry and the question is WHY?<br /><br />It is our perceptions of food.  Those perceptions are cultivated by the ADVERTISING industry and so I think they need to do a lot more to focus on this. I think fast food companies, and markets and anyone that produces food needs to take responsibility for and UNDO the damage they have done.!\nMUST WATCH DOCUMENTARY.  !!!!\nPlanet X Nibiru and the Anunnaki\nSpecial Interest\n['Lloyd Pye reveals information regarding the genetic manipulation of the human species by an alien race from another planet. This planet is said to have a 3,600 year elliptical orbit which may currently be approaching our solar system. Is Planet X Nibiru inhabited and inbound?']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Sepehr'], 'Producers': ['Robert Sepehr'], 'Starring': ['LloydPye']}\nIt's not the content that I have an issue with but all this video is is a boring interview with Lloyd Pie<br />I thought I was getting a documentary but all it is is this guy talking.<br /><br />Not worth 2 dollars.. not worth one..<br /><br />Be warned this is not a documentary but a boring interview. This could have just been uploaded to You Tube ..\nJust a boring interview..\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Lowery'], 'Producers': ['Toby Halbrooks', 'James M. Johnston', 'Adam Donaghey'], 'Starring': ['Casey Affleck', 'Rooney Mara'], 'Studio': ['A24 Distribution LLC']}\nI hate reading any reviews before I watch a film.  It is hard not to though.<br />No, this isn't a &#34;scary&#34; Halloween movie , but it is about a ghost.  It is about a lot more.<br />It is meditative.  If you are in for an action flick.  This isn't it.<br /><br />But it is VERY good.  Give it a chance.  If you are in a calm, meditative and contemplative space this is for you.  Open yourself up to the quiet of this film.<br /><br />I won't give the plot away.  It is more about feeling and thinking and being and not being.. that is all I will say.<br /><br />Peace\nA very good, meditative and contemplative movie and that is a GOOD thing.  Very recommended.",
  "profile": "**User Profile Summary:**\n\n- **Interests:** This user enjoys comedy series with strong character development and humor, valuing well-written narratives and clever storytelling. They also have an increasing interest in impactful documentaries addressing social issues, particularly related to food waste and its broader implications.\n\n- **Themes:** They favor stories set in quaint or picturesque locations, aligning with a preference for feel-good, lighthearted settings while also engaging with narratives that highlight important societal concerns. Recently, they have shown appreciation for contemplative and meditative films that invite introspection.\n\n- **Perspectives on Medicine:** The user values balanced representations of medicine, critiquing portrayals of alternative therapies in popular media. They advocate for nuanced discussions around health and wellness topics, indicating a thoughtful approach.\n\n- **Review Engagement:** Actively reviewing products, the user shares thoughtful critiques and reflections. They emphasize authenticity and depth in their reviews and are not hesitant to express disappointment if content falls short of expectations. As evidenced by a recent review, they appreciate films that provoke thought and contemplation, highlighting their evolving engagement with diverse storytelling forms.\n\n- **Rating Habits:** With a high average rating, the user maintains discerning taste, celebrating content that aligns with their values and interests. They express satisfaction with quality engagement while also upholding their standards when faced with disappointing offerings.\n\nOverall, this user balances a love for comedic entertainment with a deepening appreciation for reflective and socially relevant narratives.",
  "metrics": {
    "rouge1_f": 0.152191894127378,
    "rouge2_f": 0.011599005799502899,
    "rougeL_f": 0.0727874276261373,
    "meteor": 0.05065123010130246,
    "bleu1": 0.006730462596636766,
    "bleu2": 0.0016194384901011241,
    "bleu3": 0.0002575902344657625,
    "bleu4": 0.00010282408159273249,
    "bertscore_precision": 0.35438603162765503,
    "bertscore_recall": 0.46692490577697754,
    "bertscore_f1": 0.40294522047042847
  }
}