{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/02/13\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Lulu Wang'], 'Producers': ['Lulu Wang', 'Dan Balgoyen', 'Joshua M. Cohen', 'Anita Gou', 'Daniele Tate Melia', 'Andrew Miano', 'Eddie Rubin', 'Peter Saraf', 'Marc Turtletaub', 'Chris Weitz'], 'Starring': ['Awkwafina', 'Tzi Ma', 'Diana Lin']}\nReview Text: This one was a bit hard for me because I lost my grandmother a little over a year ago. But, Awkwafina’s performance as well as the rest of the cast was truly beautiful. Their just raw emotions shown on film.!85 was a beautiful film to see .\nReview Title: Amazing movie of raw emotion\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Lord of the Rings: The Fellowship of the Ring (Four-Disc Special Extended Edition)\nElijah Wood  (Actor),     Ian McKellen  (Actor),     Peter Jackson  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Not seen in theaters, this unique version of the epic adventure features over 30 minutes of new and extended scenes integrated into the film by the director.', 'Amazon.com', \"In every aspect, the extended-edition DVD of Peter Jackson's epic fantasy\", 'The Lord of the Rings: The Fellowship of the Ring', \"blows away the theatrical-version DVD. No one who cares at all about the film should ever need to watch the original version again. Well, maybe the impatient and the squeamish will still prefer the theatrical version, because the extended edition makes a long film 30 minutes longer and there's a bit more violence (though both versions are rated PG-13). But the changes--sometimes whole scenes, sometimes merely a few seconds--make for a richer film. There's more of the spirit of J.R.R. Tolkien, embodied in more songs and a longer opening focusing on Hobbiton. There's more character development, and more background into what is to come in the two subsequent films, such as Galadriel's gifts to the Fellowship and Aragorn's burden of lineage. And some additions make more sense to the plot, or are merely worth seeing, such as the wood elves leaving Middle-earth or the view of Caras Galadhon (but sorry, there's still no Tom Bombadil). Extremely useful are the chapter menus that indicate which scenes are new or extended.\", 'Of the', 'four', \"commentary tracks, the ones with the greatest general appeal are the one by Jackson and cowriters Fran Walsh and Philippa Boyens, and the one by 10 cast members, but the more technically oriented commentaries by the creative and production staff are also worth hearing. The bonus features (encompassing two complete DVDs) are far superior to the largely promotional materials included on the theatrical release, delving into such matters as script development, casting, and visual effects. The only drawback is that the film is now spread over two discs, with a somewhat abrupt break following the council at Rivendell, due to the storage capacity required for the longer running time, the added DTS ES 6.1 audio, and the commentary tracks. But that's a minor inconvenience. Whether in this four-disc set or in the collector's gift set (which adds Argonath bookends and a DVD of\", 'National Geographic Beyond the Movie: The Lord of the Rings: The Fellowship of the Ring', '), the extended-edition DVD is the', 'Fellowship', 'DVD to rule them all.', '--David Horiuchi']\n{'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Widescreen, NTSC, Anamorphic', 'Contributor': 'Noel Appleby, Viggo Mortensen, J.R.R. Tolkien, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Philippa Boyens, Ian McKellen, Elijah Wood, Fran Walsh, Sean Astin, Dominic Monaghan, Liv Tyler, Hugo Weaving, Billy Boyd, Orlando Bloom, Alan HowardNoel Appleby, Viggo Mortensen, J.R.R. Tolkien, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Philippa Boyens, Ian McKellen, Elijah Wood, Fran Walsh, Sean Astin, Dominic Monaghan, Liv Tyler, Hugo Weaving, Billy Boyd, Orlando Bloom, Alan Howard  See more', 'Language': 'English (Dolby Digital 5.1 EX), English (Dolby Digital 2.0 Stereo), English (DTS ES 6.1), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 28 minutes', 'Studio': 'New Line Home Video', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.75 x 1.25 inches; 14.4 Ounces', 'Item model number': 'MFR794043554926#VG', 'Director': 'Peter Jackson', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Widescreen, NTSC, Anamorphic', 'Run time': '3 hours and 28 minutes', 'Release date': 'November 12, 2002', 'Actors': 'Elijah Wood, Ian McKellen, Sean Bean, Orlando Bloom, Viggo Mortensen', 'Subtitles': 'English', 'Writers': 'Fran Walsh, J.R.R. Tolkien, Peter Jackson, Philippa Boyens', 'Number of discs': '4'}\nThis version of the movie includes well over 30 minutes of extra footage, the footage that was added was amazing. If you were confused a bit by the movie since they did leave a lot of the explainatory backround out, then you will have a better understanding after watching this. The opening scene is extended, they give more information, the added scenes are amazing. It is like watching a whole new movie. I recommend that everyone if not watch this but own it! It is a masterpiece!\nMuch better then the theatrical version!\nThe Transporter\nJason Statham  (Actor),     Qi Shu  (Actor),     Corey Yuen  (Director),     Louis Leterrier  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Frank Martin (Jason Statham) is the best as what he does: transporting dangerous or illegal goods with no questions asked. But his last shipment, a beautiful young woman kidnapped by international slave traders, brings deadly complications to his delivery plans. Now Frank must kick into overdrive in a nonstop action-packed fight to save his precious cargo - and his life.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSCMultiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSC  See more', 'Contributor': 'Ric Young, Matt Schulze, Matthieu Albertini, Qi Shu, Didier Saint Melin, Laurent Desponds, Corey Yuen, Franois Berland, Jean-Yves Bilien, Jason Statham, Robert Mark Kamen, Louis Leterrier, Vincent Nemeth, Tonio Descanvelle, Doug Rand, Luc BessonRic Young, Matt Schulze, Matthieu Albertini, Qi Shu, Didier Saint Melin, Laurent Desponds, Corey Yuen, Franois Berland, Jean-Yves Bilien, Jason Statham, Robert Mark Kamen, Louis Leterrier, Vincent Nemeth, Tonio Descanvelle, Doug Rand, Luc Besson  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.34 x 7.47 inches; 2.72 Ounces', 'Director': 'Corey Yuen, Louis Leterrier', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'April 15, 2003', 'Actors': 'Jason Statham, Qi Shu, Matt Schulze, Franois Berland, Ric Young', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Luc Besson, Robert Mark Kamen', 'Number of discs': '1'}\nSeeing as there is an increase of all these movies on people being transporters [for example foreigner with steven segal] i expected it to be like the rest of them. ... and stupid. However this one was surprisingly good. There are 3 rules and Frank - the transporter manages to break all of them on just one transport. The acting is okay. The fight scenes are originally but in some poorly choreographed, however the originality of it all makes up for anything the movie itself lacked.\nSurprisingly Good.\nBig Eden\nArye Gross  (Actor),     Eric Schweig  (Actor),     Thomas Bezucha  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Big Eden tells a truly original tale of a thirty-something gay guy, Henry Hart (Arye Gross, Ellen, Six Feet Under) who returns to his childhood Montana home to confront his unrequited passion for his high school best friend. Big Eden is a tiny town tucked away in the timberland of northwestern Montana, where cowboys lounge on the porch of the general store to pass the time away. It\\'s also the childhood home of Henry Hart (Arye Gross), a successful but lonely New York artist, who returns after years away to care for his ailing grandfather. Back home, Henry confronts his unrequited passion for his high school best friend Dean (TimDeKay) and his feelings about being gay in a small town. But, as we quickly learn, Big Eden residents defy the stereotype of \"small town, small minds.\" As Henry works though his emotions, the townspeople quietly conspire to help him along, until Henry realizes new possibilities for both friendship and romance. Big Eden is a uniquely American fable about home and family. It hits upon the universal longing and hope we each have for finding a place where we are loved, and the unconditional desire to see those that we love find happiness.', 'Amazon.com', 'Big Eden', \"has won the audience awards at just about every gay and lesbian film festival there is. Henry (Arye Gross) is an artist living in New York but still carrying a torch for the guy he had a crush on in high school. When his grandfather has a stroke, Henry returns to his Montana hometown, Big Eden, where he rediscovers friends he hasn't seen in years. His high school crush has since married, had children, and divorced--and seems ready to take some very different steps with his life. Big Eden is one of those implausibly tolerant towns where lesbians kiss each other in public and old coots in cowboy hats try to play matchmaker with bashful gays. Still, it's this sweet warmth in\", 'Big Eden', 'that has made it a festival crowd-pleaser.', '--Bret Fetzer']\n{'Genre': 'Gay & Lesbian', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Letterboxed', 'Contributor': \"Veanne Cox, Thomas Bezucha, O'Neal Compton, Corinne Bohrer, Tim DeKay, Parker Livingston, Nan Martin, Eric Schweig, Louise Fletcher, George Coe, Douglas Sebern, Cody Wayne, Arye GrossVeanne Cox, Thomas Bezucha, O'Neal Compton, Corinne Bohrer, Tim DeKay, Parker Livingston, Nan Martin, Eric Schweig, Louise Fletcher, George Coe, Douglas Sebern, Cody Wayne, Arye Gross   See more\", 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.88 Ounces', 'Item model number': '2256539', 'Director': 'Thomas Bezucha', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Letterboxed', 'Run time': '1 hour and 58 minutes', 'Release date': 'April 30, 2002', 'Actors': 'Arye Gross, Eric Schweig, Tim DeKay, Louise Fletcher, George Coe', 'Studio': 'Wolfe Video', 'Writers': 'Thomas Bezucha', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI absolutely adored this movie. The ideals and the struggles this man goes through and how he has to work in the end to be himself, despite he never needed to work at all. I love the whole cast, the soundtrack everything. This is one of my favourite movies. I was surprised with how good it was. But it had me rooting for him throughout the whole movie.\nAbsolutely Fabulous and inspiring\nHemalayaa: Bollywood Party Workout\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Hemalayaa Bolly Party']\n{'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Hemalayaa', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '15173307', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '50 minutes', 'Release date': 'August 5, 2012', 'Studio': 'ACORN MEDIA', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy mother is obsessed with exercise and is always looking for something new to help keep the muscles moving and spice up the routine. If you do the same thing over and over again it seems you can get that even tone but do you end up hating it? Well yes you can. That is why its so important to mix it up and enjoy your routines. Hemalayaa makes them fun for the novice to the advanced. You really learn how to bollywood dance while gearing that body up for bathing suit season.\nWorks so well!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gary Fleder', 'Edward Ornelas', 'Norman Buckley', 'Zetna Fuentes', 'Michael Katleman', 'Michael Pressman', 'Elizabeth Allen Rosenbaum', 'Deran Sarafian', 'Oz Scott', 'Harry Sinclair'], 'Studio': ['The CW']}\nI am really happy I finally sat down to watch this. I have now instructed all my friends to do so and have gotten them all hooked. this show is addictive. I didn't watch it at first because I honestly thought this was going to be a Roswell remake. But, it isn't. This show is far better than I ever thought it would be. I bought the first episode on amazon and quickly bought a season pass. I couldn't pass this up.<br /><br />I have heard it may be cancelled so if we can save it that would be amazing.<br /><br />The show started to look like a love triangle but it quickly takes a sharp turn. I was really happy for it. There is just the right amount of teenage angst, romance, drama, and cheese factor that creates a beautiful mixture of addictive television.\nTook me a while to get around to watch it.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Copus', 'David Von Ancken', 'Alex Zakrzewski', 'David Grossman', 'Brannon Braga', 'Tim Andrew', 'Joe Dante', 'Peter Weller', 'Jennifer Lynch', 'Tricia Brock'], 'Producers': ['Fox']}\nI am writing this about the debut. I had to buy it on Amazon because my local channels don't get WGN. At first I thought it was a CW show and I was quickly corrected based on content. I honestly expected a show like this to be on FX. There is definitely quite a bit of sexual content. But, the writing is good. The plot line looks to be strong and well thought out. I hope it continues that way.\nInteresting\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Allan Arkush', 'Patrick R. Norris', 'John Scott', 'Joe Dante', 'Fred Gerber', 'Paul Holahan', 'Jonathan Kaplan', 'Peter Leto', 'David Solomon', 'Mark Waters'], 'Studio': ['Lifetime']}\nMy mother begged me to watch this show for ages. I finally sat down and watched it and it is awesome! I love the cheesy factor. I personally found it a little bit of a B movie but think more like B+ it's addictive. I'm gonna go for it: they definitely cast a spell on me.<br /><br />*cue groans from audience*\nAwesomely cheesy\n{'Subtitles': ['None available'], 'Directors': ['Mike Newell'], 'Producers': ['Lyn Greene & Richard Levine', 'Mike Newell', 'Michael De Luca', 'Lindsay Sloane'], 'Starring': ['Lauren Ambrose', 'Katie Balen', 'Matt Barr'], 'Studio': ['Amazon Studios']}\nI really liked it! I think there is such a great storyline there that really has something you can sink your teeth into. The switching between the years is good and not jolted. Very smooth transition! I definitely am interested in seeing where this story goes. I hope Amazon picks it up for a complete first season!!\nLooking forward to the rest of the season!\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Billy Ray'], 'Producers': ['Billy Ray', 'Alixandre Wiltin', 'Chris Keyser', 'David Stern', 'Joshua D. Maurer', 'Scott Hornbacher'], 'Starring': ['Matt Bomer', 'Kelsey Grammer', 'Lily Collins'], 'Studio': ['Amazon Studios']}\nIt was extremely slow building. I had quite a bit of a rough time having it capture my attention. I didn't feel any connection with the characters. I would like to continue watching it as I do love the actors cast for these roles and see where the story goes and if the story picks up\nIt's okay. But, willing to give a few more episodes a shot.\n{'Subtitles': ['None available'], 'Directors': ['Al Lougher'], 'Producers': ['Keri Maletto'], 'Starring': ['Jeremy Palko', 'Melanie Crim', 'Keri Maletto']}\nThe episodes are too short! I want more! It's definitely different.<br /><br />I think the choice of who the vampire is that guy is a great actor. The chick in the first episode could have been emotionally stronger for sure it would be interesting to see the balance but I really think this has the makings of something phenomenal\nGIVE ME MORE\n{'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Mark Cendrowski', 'Anthony Rich', 'Peter Chakos', 'Nikki Lorre', 'James Burrows', 'Howard Murray', 'Gay Linvill', 'Kristy Cecil', 'Ted Wass', 'Andrew D. Weyman'], 'Producers': ['Not Specified'], 'Starring': ['Johnny Galecki', 'Jim Parsons', 'Kaley Cuoco'], 'Studio': ['CBS']}\nI AM SO FREAKING EXCITED!!!!!\nOMG GIMMIE GIMMIE GIMMIE\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Chaves'], 'Producers': ['Richard Brener', 'Michael Clear', 'Gary Dauberman', 'Emile Gladstone', 'Walter Hamada', 'Michelle Morrissey', 'Dave Neustadter', 'Victoria Palmeri', 'Judson Scott'], 'Starring': ['Linda Cardellini', 'Raymond Cruz', 'Patricia Velasquez'], 'Studio': ['WARNER BROS.']}\nIt was jump scare for most of it but overall it’s a standard horror flick that’s being produced these days nothing really too exciting and unknown\nIt was okay at best\n{'Content advisory': ['Alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Lulu Wang'], 'Producers': ['Lulu Wang', 'Dan Balgoyen', 'Joshua M. Cohen', 'Anita Gou', 'Daniele Tate Melia', 'Andrew Miano', 'Eddie Rubin', 'Peter Saraf', 'Marc Turtletaub', 'Chris Weitz'], 'Starring': ['Awkwafina', 'Tzi Ma', 'Diana Lin']}\nThis one was a bit hard for me because I lost my grandmother a little over a year ago. But, Awkwafina’s performance as well as the rest of the cast was truly beautiful. Their just raw emotions shown on film.!85 was a beautiful film to see .\nAmazing movie of raw emotion",
  "profile": "**Updated User Profile Summary:**\n\nThe user continues to maintain a strong enthusiasm for epic fantasy films and storytelling, actively engaging with new series that offer intriguing narratives. Their appreciation for diverse genres, including comedy and drama-romance, emphasizes their love for captivating stories, regardless of production quality. This aligns with their preference for rich storytelling, particularly adaptations from literature, and a keen focus on unique character dynamics and strong performances.\n\nIn their latest interaction, the user expressed deep emotional resonance with a film, which they rated highly due to its portrayal of raw emotions and powerful performances. This reflects their discerning taste for narratives that delve into character depth and emotional engagement. It showcases their ability to connect personally with cinematic experiences, particularly those that touch on themes such as loss and family.\n\nTheir active lifestyle, supported by fitness routines like Bollywood dance exercise, highlights a balanced approach to health and cinema. Overall, the user remains an engaged film enthusiast who values meaningful and dynamic narratives, persistently seeking joy in their viewing experiences while eagerly anticipating captivating plot developments. This recent engagement reinforces their optimistic outlook on the evolving landscape of storytelling, showcasing their appreciation for quality narratives that evoke strong emotional responses.",
  "metrics": {
    "rouge1_f": 0.06624203821656051,
    "rouge2_f": 0.007648183556405352,
    "rougeL_f": 0.03248407643312102,
    "meteor": 0.018681235899808125,
    "bleu1": 1.058650352297647e-08,
    "bleu2": 4.291791676791529e-09,
    "bleu3": 1.2137894886475113e-09,
    "bleu4": 3.6339001441034077e-10,
    "bertscore_precision": 0.3188362121582031,
    "bertscore_recall": 0.4938777983188629,
    "bertscore_f1": 0.3875068724155426
  }
}