{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Transporter\nReview Date: 2003/04/27\nStore: Jason Statham  (Actor),     Qi Shu  (Actor),     Corey Yuen  (Director),     Louis Leterrier  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Frank Martin (Jason Statham) is the best as what he does: transporting dangerous or illegal goods with no questions asked. But his last shipment, a beautiful young woman kidnapped by international slave traders, brings deadly complications to his delivery plans. Now Frank must kick into overdrive in a nonstop action-packed fight to save his precious cargo - and his life.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSCMultiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSC  See more', 'Contributor': 'Ric Young, Matt Schulze, Matthieu Albertini, Qi Shu, Didier Saint Melin, Laurent Desponds, Corey Yuen, Franois Berland, Jean-Yves Bilien, Jason Statham, Robert Mark Kamen, Louis Leterrier, Vincent Nemeth, Tonio Descanvelle, Doug Rand, Luc BessonRic Young, Matt Schulze, Matthieu Albertini, Qi Shu, Didier Saint Melin, Laurent Desponds, Corey Yuen, Franois Berland, Jean-Yves Bilien, Jason Statham, Robert Mark Kamen, Louis Leterrier, Vincent Nemeth, Tonio Descanvelle, Doug Rand, Luc Besson  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.34 x 7.47 inches; 2.72 Ounces', 'Director': 'Corey Yuen, Louis Leterrier', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'April 15, 2003', 'Actors': 'Jason Statham, Qi Shu, Matt Schulze, Franois Berland, Ric Young', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Luc Besson, Robert Mark Kamen', 'Number of discs': '1'}\nReview Text: Seeing as there is an increase of all these movies on people being transporters [for example foreigner with steven segal] i expected it to be like the rest of them. ... and stupid. However this one was surprisingly good. There are 3 rules and Frank - the transporter manages to break all of them on just one transport. The acting is okay. The fight scenes are originally but in some poorly choreographed, however the originality of it all makes up for anything the movie itself lacked.\nReview Title: Surprisingly Good.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Lord of the Rings: The Fellowship of the Ring (Four-Disc Special Extended Edition)\nElijah Wood  (Actor),     Ian McKellen  (Actor),     Peter Jackson  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Not seen in theaters, this unique version of the epic adventure features over 30 minutes of new and extended scenes integrated into the film by the director.', 'Amazon.com', \"In every aspect, the extended-edition DVD of Peter Jackson's epic fantasy\", 'The Lord of the Rings: The Fellowship of the Ring', \"blows away the theatrical-version DVD. No one who cares at all about the film should ever need to watch the original version again. Well, maybe the impatient and the squeamish will still prefer the theatrical version, because the extended edition makes a long film 30 minutes longer and there's a bit more violence (though both versions are rated PG-13). But the changes--sometimes whole scenes, sometimes merely a few seconds--make for a richer film. There's more of the spirit of J.R.R. Tolkien, embodied in more songs and a longer opening focusing on Hobbiton. There's more character development, and more background into what is to come in the two subsequent films, such as Galadriel's gifts to the Fellowship and Aragorn's burden of lineage. And some additions make more sense to the plot, or are merely worth seeing, such as the wood elves leaving Middle-earth or the view of Caras Galadhon (but sorry, there's still no Tom Bombadil). Extremely useful are the chapter menus that indicate which scenes are new or extended.\", 'Of the', 'four', \"commentary tracks, the ones with the greatest general appeal are the one by Jackson and cowriters Fran Walsh and Philippa Boyens, and the one by 10 cast members, but the more technically oriented commentaries by the creative and production staff are also worth hearing. The bonus features (encompassing two complete DVDs) are far superior to the largely promotional materials included on the theatrical release, delving into such matters as script development, casting, and visual effects. The only drawback is that the film is now spread over two discs, with a somewhat abrupt break following the council at Rivendell, due to the storage capacity required for the longer running time, the added DTS ES 6.1 audio, and the commentary tracks. But that's a minor inconvenience. Whether in this four-disc set or in the collector's gift set (which adds Argonath bookends and a DVD of\", 'National Geographic Beyond the Movie: The Lord of the Rings: The Fellowship of the Ring', '), the extended-edition DVD is the', 'Fellowship', 'DVD to rule them all.', '--David Horiuchi']\n{'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Widescreen, NTSC, Anamorphic', 'Contributor': 'Noel Appleby, Viggo Mortensen, J.R.R. Tolkien, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Philippa Boyens, Ian McKellen, Elijah Wood, Fran Walsh, Sean Astin, Dominic Monaghan, Liv Tyler, Hugo Weaving, Billy Boyd, Orlando Bloom, Alan HowardNoel Appleby, Viggo Mortensen, J.R.R. Tolkien, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Philippa Boyens, Ian McKellen, Elijah Wood, Fran Walsh, Sean Astin, Dominic Monaghan, Liv Tyler, Hugo Weaving, Billy Boyd, Orlando Bloom, Alan Howard  See more', 'Language': 'English (Dolby Digital 5.1 EX), English (Dolby Digital 2.0 Stereo), English (DTS ES 6.1), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 28 minutes', 'Studio': 'New Line Home Video', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.75 x 1.25 inches; 14.4 Ounces', 'Item model number': 'MFR794043554926#VG', 'Director': 'Peter Jackson', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Widescreen, NTSC, Anamorphic', 'Run time': '3 hours and 28 minutes', 'Release date': 'November 12, 2002', 'Actors': 'Elijah Wood, Ian McKellen, Sean Bean, Orlando Bloom, Viggo Mortensen', 'Subtitles': 'English', 'Writers': 'Fran Walsh, J.R.R. Tolkien, Peter Jackson, Philippa Boyens', 'Number of discs': '4'}\nThis version of the movie includes well over 30 minutes of extra footage, the footage that was added was amazing. If you were confused a bit by the movie since they did leave a lot of the explainatory backround out, then you will have a better understanding after watching this. The opening scene is extended, they give more information, the added scenes are amazing. It is like watching a whole new movie. I recommend that everyone if not watch this but own it! It is a masterpiece!\nMuch better then the theatrical version!\nThe Transporter\nJason Statham  (Actor),     Qi Shu  (Actor),     Corey Yuen  (Director),     Louis Leterrier  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Frank Martin (Jason Statham) is the best as what he does: transporting dangerous or illegal goods with no questions asked. But his last shipment, a beautiful young woman kidnapped by international slave traders, brings deadly complications to his delivery plans. Now Frank must kick into overdrive in a nonstop action-packed fight to save his precious cargo - and his life.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSCMultiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSC  See more', 'Contributor': 'Ric Young, Matt Schulze, Matthieu Albertini, Qi Shu, Didier Saint Melin, Laurent Desponds, Corey Yuen, Franois Berland, Jean-Yves Bilien, Jason Statham, Robert Mark Kamen, Louis Leterrier, Vincent Nemeth, Tonio Descanvelle, Doug Rand, Luc BessonRic Young, Matt Schulze, Matthieu Albertini, Qi Shu, Didier Saint Melin, Laurent Desponds, Corey Yuen, Franois Berland, Jean-Yves Bilien, Jason Statham, Robert Mark Kamen, Louis Leterrier, Vincent Nemeth, Tonio Descanvelle, Doug Rand, Luc Besson  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.34 x 7.47 inches; 2.72 Ounces', 'Director': 'Corey Yuen, Louis Leterrier', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'April 15, 2003', 'Actors': 'Jason Statham, Qi Shu, Matt Schulze, Franois Berland, Ric Young', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Luc Besson, Robert Mark Kamen', 'Number of discs': '1'}\nSeeing as there is an increase of all these movies on people being transporters [for example foreigner with steven segal] i expected it to be like the rest of them. ... and stupid. However this one was surprisingly good. There are 3 rules and Frank - the transporter manages to break all of them on just one transport. The acting is okay. The fight scenes are originally but in some poorly choreographed, however the originality of it all makes up for anything the movie itself lacked.\nSurprisingly Good.",
  "profile": "**User Profile Summary:**\n\nThe user exhibits a strong preference for extended versions of films, particularly within the epic fantasy genre, valuing extra content and enhanced storytelling that provides deeper character development. Their enthusiasm for detailed critiques and analyses indicates a desire for insight into creative processes and production. The user favors high-quality formats with extensive bonus features, reflecting a commitment to collecting comprehensive film editions.\n\nRecent interactions reveal an openness to diverse genres, having purchased and reviewed an action film, which they found surprisingly enjoyable despite low expectations based on the genre. This suggests a pragmatic view towards films that may not fit their primary interests but can still deliver quality entertainment. The user maintains a discerning taste, often rating films highly, especially cinematic masterpieces derived from literary works. Their reviews typically offer thoughtful assessments, showcasing their passion for sharing valuable cinematic experiences with others. Overall, the user embodies a dedicated film fan who appreciates adaptations and extended narratives, remains critical yet open-minded, and enjoys exploring a variety of genres.",
  "metrics": {
    "rouge1_f": 0.11244377811094455,
    "rouge2_f": 0.012012012012012012,
    "rougeL_f": 0.06146926536731634,
    "meteor": 0.03816523861822235,
    "bleu1": 0.0003288686447683218,
    "bleu2": 0.00012769982691756955,
    "bleu3": 1.8920729057292295e-05,
    "bleu4": 7.292536493625459e-06,
    "bertscore_precision": 0.30738112330436707,
    "bertscore_recall": 0.46372276544570923,
    "bertscore_f1": 0.3697027862071991
  }
}