{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nReview Date: 2022/09/17\nStore: MilyBest\nAverage Rating: 4.1\nProduct Details: {'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nReview Text: I would not order these eyelashes again! They are very cheaply made! The first one i tried to peel off the packaging just RIPPED in half! And yes i know how to handle eyelashes!!! And once i finally got them on for some weird reason my eyes started itching!!! That has never happened to me before with false eyelashes ! I will not be ordering this kind again!\nReview Title: Cheap!\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Boiess Colognes Poppy mint For Moms, Babies & Kids | Natural Eau de Cologne | Clean & Fresh Scent | Children Fragrance For Soft & Sensitive Skin | Easy Use, Gentle on Baby | Size: 8.5 FL Oz\nBoiess\n{'Brand': 'Boiess', 'Item Form': 'Liquid', 'Item Volume': '8 Fluid Ounces', 'Scent': 'Poppymint', 'Special Feature': 'Dermatoligist tested, Pediatrician tested, Clean, Natural, Cruelty Free, Plant based, Hypoallegenic', 'Package Dimensions': '6.38 x 2.17 x 2.17 inches; 8.5 Ounces', 'UPC': '860007057533', 'Country of Origin': 'Spain'}\nThis is labeled as babys cologne but omg it smells good enough for ALL to wear!!!  Its clean yet lightly floral!\nSmells Soooo Good!!\nBoiess Colognes Poppy mint For Moms, Babies & Kids | Natural Eau de Cologne | Clean & Fresh Scent | Children Fragrance For Soft & Sensitive Skin | Easy Use, Gentle on Baby | Size: 8.5 FL Oz\nBoiess\n{'Brand': 'Boiess', 'Item Form': 'Liquid', 'Item Volume': '8 Fluid Ounces', 'Scent': 'Poppymint', 'Special Feature': 'Dermatoligist tested, Pediatrician tested, Clean, Natural, Cruelty Free, Plant based, Hypoallegenic', 'Package Dimensions': '6.38 x 2.17 x 2.17 inches; 8.5 Ounces', 'UPC': '860007057533', 'Country of Origin': 'Spain'}\nI really am loving this brand!!! I have 2 different scents now and they are both clean and floral smelling! It says its for babies but me and my teenage daughters prefer this soft scent vs bath and body works!!! Now i just need to buy the 3rd scent mint poppy !\nSmells soft and clean!!!\nAIFAIFA 9Pcs Gel Nail Polish Set, Burgundy Nail Polish Kits Red Colors Soak Off UV/LED Nail Polish Set, Gel Polish with Base Coat & Glossy & Matte Top All-Season Salon Manicure Art Design Red\nAIFAIFA\n{'Brand': 'AIFAIFA', 'Item Form': 'Gel', 'Color': 'Burgundy,Red', 'Type': 'Gel', 'Finish Type': 'Glossy, Matte', 'Special Feature': 'Long Lasting', 'Material Feature': 'Non-Toxic', 'Unit Count': '9.00 Count', 'Number of Items': '9', 'Package Dimensions': '7.99 x 4.21 x 2.83 inches; 11.99 Ounces'}\nThe shades are not exactly as pictured but still nice! I like that they cure QUICK!  Some brands are too thick or something and require a long time to cure but this one was done in one 5 min session!\nCured quickly!\nAllWell Beauty Masking Kit | Moisturizing Exfoliating Botanical Radiant Face and Body Mask | With Red Maple, Safflower, & Lavender | Made in the USA | Vegan, Cruelty-Free | 3.38 Fl Oz. Jar + Applicator (Self Care Kit)\nAllWell AllOver\n{'Brand': 'AllWell AllOver', 'Scent': 'Lavender', 'Skin Type': 'All', 'Unit Count': '3.38 Ounce', 'Material Feature': 'Natural', 'Product Dimensions': '5.25 x 4.25 x 4.13 inches; 12.31 Ounces', 'UPC': '850012824275'}\nOnly thing i liked is headband! It holds all your hair back securely! The mask made me itchy! Its extremely thick and the ingredients are not as clean as i hoped! The spatula it came with has sharp edges that im too scared to use looks like it would scratch my face!\nMask is weird\nMakeup Headband - 3PCS Spa Headband For Washing Face Skincare Towel Headbands Shower Hair Band\nTinpin\n{'Color': 'Pink,Silver', 'Material': 'Foam', 'Number of Items': '3', 'Brand': 'Tinpin', 'Size': '3 piece Set', 'Package Dimensions': '8.35 x 7.17 x 2.13 inches; 3.99 Ounces'}\nThese headbands are adorable! They are nice and tight and hold your hair back properly! Me and my daughters are using these for our momma daughter spa nights! So comfortable!\nToo freaking cute!\n10 Pcs Gel Nail Polish Kit, Unicorn Collection Soak off Nail Gel Polish Pastel Pink Yellow Blue Nail Polish Purple Green Glitter Gel Polish Starter Kit with Glossy & Matte Top and Base Coat\nMOCMAKI\n{'Brand': 'MOCMAKI', 'Item Form': 'Gel', 'Color': 'Pastel,Purple Green,Silver,White', 'Finish Type': 'Glossy', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '10', 'Package Dimensions': '11.5 x 3 x 1 inches; 7.2 Ounces', 'UPC': '774494158270'}\nDidnt really like this brand!! Colors are true to picture but they only lasted 5 days! Started to just peel off out of nowhere!\nPeels off!\nMagnetic Eyelashes with Eyeliner Kit, SOTICA 10Pairs Magnetic Lashes Natural False Eyelashes with Tweezers DIY Eyelash Extension Kit Authentic Eyelash Extension Look Easy to Use No Glue Needed…\nSotica\n{'Package Dimensions': '9.26 x 5.95 x 0.83 inches; 2.89 Ounces', 'Item model number': 'CS-JM-8'}\nReally impressed with these lashes they ACTUALLY WORK! I applied 2 layers of magnetic eyeliner and the lashes stuck on IMMEDIATELY!!! I also had no trouble when it was time to wash them off! I used my regular soap and whatever was left on my eyelids i wiped off with coconut oil! Super simple! Definitely recommend!\nWorks really good!\nMocossmy Cross Nail Art Charms Decoration,72 PCS Gold Silver 3D Mini Metal Punk Vintage Cross Designs Mixed Types Retro Acrylic Nail Jewelry Accessories for Women Girls DIY Manicure Crafts Decoration\nMocossmy\n{}\nThese charms arrived properly packaged! Very cute looking but unfortunately not very practical for me! It snags on my hair cuz of the size of it! I think they are really pretty but will have to put them to use on crafts or something!\nCute but snags hair!\nKpdoit Wireless Pen Mini Machine Pen and Kit Digital LED Display 2200mAh Professional Supply for Artists\nKpdoit\n{'Brand': 'Kpdoit', 'Style': 'German', 'Water Resistance Level': 'Waterproof', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '3.9 x 2.3 x 7.4 inches; 12.77 Ounces', 'Item model number': 'Kpdoit110', 'Manufacturer': 'Kpdoit'}\nThis is officially my new favorite tattoo pen! Wireless really is the best way to go especially for beginners! Easier to maneuver! It's not the lightest pen but it's not crazy heavy either! Battery life is CRAZY long too! Definitely recommend!\nWireless is best!\nANGNYA Acrylic Nail Brush，Kolinsky Nail Art Brushes for Acrylic Application，Size 8 Oval Crimped Sable Acrylic Brush for Professional Manicure DIY Home Salon(Pink)\nANGNYA\n{'Color': '4-Pink', 'Brand': 'ANGNYA', 'Unit Count': '1.0 Count', 'Package Dimensions': '7.28 x 1.14 x 0.55 inches; 0.32 Ounces', 'Manufacturer': 'ANGNYA', 'Country of Origin': 'China'}\nThis kolinsky brush is worth trying out! I like the long handle with slanted tip to help scrape off any side residue of polish or even acrylic powder before it drys for us beginners lol! The size seems to be true! Not<br />short teeny tiny bristles! The hair is soft but I don't feel it's 100% pure kolinsky! It's just not as soft or even high quality as my other truly true kolinskys from MelodieSusie!!!!\nNot sure if it's authentic kolinsky!\nProfessional Electric Nail Drill, Rechargeable 35000 RPM E-File Nail Drill Kit for Gel, Acrylic Nails, Manicure Pedicure Polishing Tools with 16 Pcs Bits, Great for Home or Salon (Black)\nPLIISLUP\n{'Brand': 'PLIISLUP', 'Color': 'Black', 'Material': 'Aluminum, Metal', 'Item Dimensions LxWxH': '6.8 x 2.7 x 0.9 inches', 'Power Source': 'Battery Powered', 'Product Dimensions': '6.8 x 2.7 x 0.9 inches; 1.32 Pounds', 'Batteries': '1 Lithium Ion batteries required. (included)', 'Manufacturer': 'PLIISLUP'}\nCute and lightweight nail drill! 35,00 rpm makes this a pretty powerful drill that is not as noisy as other drills i have tried! My teenage daughter loves it🤗\nPretty pink\nAonkia Human Hair Dreadlock Extensions for Man/Women Loc Extensions Human Hair 0.2cm Width 18 inch 28 strands Full Hand-made Permanent Dread Locs Extensions Human Hair\nAONKIA\n{'Product Dimensions': '10 x 5 x 0.2 inches; 3.21 Ounces', 'UPC': '736020676023'}\nThis hand made dred set is good quality and soft and  passed the hair strand test! No weird chemical scent! Would recommend!\nGood length!\nMilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nMilyBest\n{'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nI would not order these eyelashes again! They are very cheaply made! The first one i tried to peel off the packaging just RIPPED in half! And yes i know how to handle eyelashes!!! And once i finally got them on for some weird reason my eyes started itching!!! That has never happened to me before with false eyelashes ! I will not be ordering this kind again!\nCheap!",
  "profile": "**Updated User Profile Summary:**\n\n- **Fragrance Preference:** Enjoys clean, fresh scents with floral notes, particularly lavender, appealing to a broad demographic.\n\n- **Product Sensitivity:** Values gentle formulations suitable for children and sensitive skin, prioritizing safety and comfort in her choices.\n\n- **Natural Ingredients:** Strong preference for natural, cruelty-free, and hypoallergenic products, reflecting a commitment to environmentally friendly practices. Recent concerns regarding ingredient transparency remain prominent.\n\n- **Versatility:** Appreciates products aimed at children, engaging in bonding experiences with her daughters, showcasing a flexible consumer approach. Recent interests highlight a growing emphasis on tools that enhance shared beauty experiences.\n\n- **Quality Consideration:** Engages critically with products, prioritizing quality and effectiveness. Recent negative experiences, particularly with cosmetics, have heightened her focus on usability, reinforcing her cautious stance toward new beauty items.\n\n- **Artistic Exploration:** Demonstrates increasing interest in DIY beauty applications, reflecting a willingness to embrace creativity while maintaining high standards for product authenticity and performance.\n\n- **Positive Engagement:** Generally open to trying offerings from trusted brands but remains cautious after negative experiences, evolving her approach toward self-care and beauty tools.\n\n- **Diverse Beauty Interests:** Actively exploring various beauty care segments, including hair, nail, and eye products, while balancing aesthetics with functionality and quality.\n\nOverall, this user remains meticulous in her choices, combining safety, natural ingredients, and effective performance, while seeking enjoyable self-care experiences for herself and her children, with an emphasis on quality and reliability.",
  "metrics": {
    "rouge1_f": 0.10403916768665851,
    "rouge2_f": 0.00857843137254902,
    "rougeL_f": 0.04773561811505508,
    "meteor": 0.038597754048682424,
    "bleu1": 0.002037842911564143,
    "bleu2": 0.00021279785319398828,
    "bleu3": 4.656159606017401e-05,
    "bleu4": 2.179744562749955e-05,
    "bertscore_precision": 0.35806912183761597,
    "bertscore_recall": 0.4507884383201599,
    "bertscore_f1": 0.39911457896232605
  }
}