{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Tomorrow War\nReview Date: 2021/07/04\nCategories: Suspense, Drama, Compelling, Frightening\nProduct Description: ['Time travelers arrive from 2051 to deliver an urgent message: 30 years in the future mankind is losing a war against a deadly alien species. The only hope for survival is for soldiers and civilians to be transported to the future and join the fight. Determined to save the world for his daughter, Dan Forester teams up with a brilliant scientist and his estranged father to rewrite the planet’s fate.']\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Italiano', '日本語', 'Português', 'Deutsch', 'தமிழ்', 'हिन्दी', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'తెలుగు', 'Français (France)'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Chris McKay'], 'Producers': ['Rob Cowan', 'Leifur B. Dagfinnsson', 'Jules Daly', 'David Ellison', 'Bradley J. Fischer', 'Dana Goldberg', 'David S. Goyer', 'Don Granger', 'Hjortur Gretarsson'], 'Starring': ['Chris Pratt', 'J.K. Simmons', 'Yvonne Strahovski']}\nReview Text: This is a creature feature -- and the monsters are fanged, spiked, and terrifying. Expect guts being blasted everywhere. I expected a cheesy sci fi film, but in the end I found it a bit entertaining. There is Lots of green alien blood and missing limbs. There is action, humors, sci fi, war, and some warm emotional moments. Overall, a nice paced film with a decent ending as far as a sci fi film can go. Overall, characters are from all walks of life and make positive contributions with the skills they have, including women who are assured leaders and kids who love science.<br />Not for younger kids, or people who are a bit squeamish. Parents should also know that there is foul language as well. 👽👽👽\nReview Title: 👽👽👽 Action, aliens, guts, and more... 👽👽👽\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Star Wars: Attack of the Clones (Feature)\nEwan McGregor  (Actor),     Natalie Portman  (Actor),     George Lucas  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Watch the seeds of Anakin Skywalker's transformation take root in Star Wars: Episode II - Attack of the Clones. Ten years after the invasion of Naboo, the galaxy is on the brink of civil war. Under the leadership of a renegade Jedi named Count Dooku, thousands of solar systems threaten to break away from the Galactic Republic. When an assassination attempt is made on Senator Padme Amidala, the former Queen of Naboo, twenty-year-old Jedi apprentice Anakin Skywalker is assigned to protect her. In the course of his mission, Anakin discovers his love for Padme as well as his own darker side. Soon, Anakin, Padme, and Obi-Wan Kenobi are drawn into the heart of the Separatist movement and the beginning of the Clone Wars.\"]\n{'Genre': 'Action/Adventure', 'Format': 'NTSC, Subtitled', 'Contributor': 'Frank Oz, Christopher Lee, Jonathan Hales, Kenny Baker, Silas Carson, Natalie Portman, Samuel L. Jackson, George Lucas, Temuera Morrison, Ewan McGregor, Leeanna Walsman, Ronald Falk, Ahmed Best, Hayden Christensen, Pernilla August, Ian McDiarmid, Oliver Ford Davies, Jimmy Smits, Anthony Daniels, Jack ThompsonFrank Oz, Christopher Lee, Jonathan Hales, Kenny Baker, Silas Carson, Natalie Portman, Samuel L. Jackson, George Lucas, Temuera Morrison, Ewan McGregor, Leeanna Walsman, Ronald Falk, Ahmed Best, Hayden Christensen, Pernilla August, Ian McDiarmid, Oliver Ford…  See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'B07TQYSBQB', 'Director': 'George Lucas', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 22 minutes', 'Release date': 'September 22, 2019', 'Actors': 'Ewan McGregor, Natalie Portman, Hayden Christensen, Frank Oz, Ian McDiarmid', 'Dubbed': 'French, Portuguese, Spanish', 'Studio': 'LUCASFILM', 'Writers': 'George Lucas, Jonathan Hales', 'Number of discs': '1'}\nVery entertaining. This is the second prequel to the original Star Wars trilogy takes place ten years after the events of Star Wars: Episode I The Phantom Menace.  Nice action, great duels. Fun & exciting. Poor acting though and the CGI animation was still in the infancy stage. It was fun watching Anakin as a hot tempered impatient teenager. LoL.<br /><br />A must have DVD for your Star Wars collection.\nGreat movie. Great Star Wars scenes.\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Jodie Foster', 'So Yong Kim', 'Charlie McDowell', 'Tim Mielants', 'Mark Romanek', 'Andrew Stanton', 'Dearbhla Walsh', 'Ti West'], 'Producers': ['Nathaniel Halpern', 'Matt Reeves', 'Rafi Crohn', 'Adam Kassan', 'Mark Romanek', 'Mattias Montero', 'Samantha Taylor Pickett', 'Adam Berg', 'Robert Petrovicz', 'Simon Stalenhag', 'Mark Lafferty', 'Ellen Rutter'], 'Starring': ['Rebecca Hall', 'Paul Schneider', 'Duncan Joiner']}\nSlow moving, a bit weired, sci-fi story that leaves you with some important unaswered questions. I love scifi but many films and stories just can't cut it. I thought I would not even get through the first episode. But the more I watched it the more interesting it got. Each episode is its own story, but is also connected to the people and events of all the other episodes. The last eposide really got to me and was in tears. No spoilers, watch them all. The only dislike or warning is: no true details or explanations given for many things that happen in this show. very little true back stories or explanations.<br />If you found my  review helpful, kindly vote below so I can improve my future reviews.\nSlow burn, but worth watching\nMy Spy\nYoung Adult Audience, Comedy, Charming, Optimistic\n['My Spy follows JJ, a hardened CIA operative (Dave Bautista), who has been demoted and finds himself at the mercy of a precocious 9-year old girl named Sophie (Chloe Coleman) after he is sent undercover to surveil her family. In exchange for not blowing JJ’s cover, Sophie uses her charm and wit to convince him to spend time with her and teach her to be a spy.']\n{'Content advisory': ['Violence', 'alcohol use'], 'Audio languages': ['English', 'English [Audio Description]', 'Italiano', 'Français'], 'Subtitles': ['English [CC]', 'Français', 'Italiano', 'Nederlands'], 'Directors': ['Peter Segal'], 'Producers': ['Peter Segal', 'Chris Bender', 'Jake Weiner', 'Robert Simonds', 'Gigi Pritzker', 'Dave Bautista', 'Jonathan Meisner'], 'Starring': ['Dave Bautista', 'Chloe Coleman', 'Ken Jeong']}\nMy Spy is a fun \"movie of the week\" type flick. Its a light, action, and amusing family comedy (with a bit of too much violence for younglings).<br />JJ is a hardened CIA spy that has been demoted and finds himself at the mercy of a precocious 9-year-old girl, named Sophie where he has been sent undercover begrudgingly to surveil her family. Despite his reluctance, JJ finds he is no match for Sophie's disarming charm and wit. There has been many similiar such stories before, but I found this one a bit refreshing & cute. Keeps you entertained throughout the film. I do recommend.\nFun watch for the whole family\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Wellington', 'Steve DiMarco', 'Peter Wellington', 'Gregory Smith', 'James Genn', 'John Fawcett', 'Kelly Makin', 'T.W. Peacocke', 'Jason Priestley', 'David Wharnsby'], 'Producers': ['Kathy Avrich-Johnson', 'Linda Pope', 'Erica Durance'], 'Starring': ['Erica Durance', 'Michael Shanks', 'Daniel Gillies']}\nI dont know how over the years I missed this show or when or where it aired. But my wife and I were thrilled and couldnt get enough of it. I dont wont to write any details or spoilers of the story, but I do wish they would have explored a bit more about the ghost life ( why he was there, what was the purpose, etc ) as it is an important part of the storyline. Love Charlie and Alex together and Dr Shahir is very funny as well.<br />Like many shows, there isn't too much you can go with the storyline or charachters. Enjoyed it as long as it lasted.\nExcellent Show\n{'Subtitles': ['None available'], 'Directors': ['David Platt', 'Constantine Makris', 'Jonathan Kaplan', 'Peter Werner', 'Donna Deitch', 'Jonathan Demme', 'Adam Bernstein', 'John David Coles', 'Eriq La Salle', 'Peter Leto'], 'Studio': ['CBS']}\nA GIFTED MAN is a drama about a brilliant, charismatic surgeon whose life changes forever when his deceased ex-wife begins teaching him the meaning of life from the “hereafter.” Overall, a really good show and a decent limited series. To bad it didnt last into other season. If you like Ghost Whisperer, Saving Hope, and other simliar shows, you may like this one too.\nNice show, worth watching - even for one season\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Not Specified'], 'Starring': ['Tom Ellis', 'Lauren German', 'DB Woodside']}\nWatching Archangels intermingle with humans is quite interesting. There are so many cop shows today to choose from. Many of them are pretty simliar in style type murder.  I was a late comer to this show, but glad I started binge watching them. This series has a new Fresh twist for a crime show. The characters are amazing and there is great chemistry between Lucifer & Chloe. Tom Ellis as Lucifer is absolutely brilliant!!! His humor is infectious, and his relationships with the other characters are unique. The writers seem to deviate from the standard known text of bibles and religions and adjusts them to fit their narrative. Which I feel is a good thing. Its fun tv, not bible accuracy. Every episode comes up with an amazing plot and a moral value, which helps Lucifer learn more about human beings and of course His Dad.<br /><br />Tasteful, respectful, and charming as this show is, its most definately entertaining.<br /><br />Please click below vote if you found my review helpful to you so I may improve my other reviews  as well.\nFresh twist for a crime show\nThe Invisible Man (2020)\nScience Fiction, Suspense, Anxious, Harrowing\n['\"The Invisible Man\" stars Emmy® winner Elisabeth Moss (\"Us,\" \"The Handmaid\\'s Tale\") as a woman who fears she is being hunted by the unseen presence of her abusive ex (Oliver Jackson-Cohen).']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Leigh Whannell'], 'Producers': ['Jason Blum', 'Kylie Du Fresne'], 'Starring': ['Elisabeth Moss', 'Aldis Hodge', 'Storm Reid']}\nThis is another remake of a 120 year old movie originally written by H.G. Wells and is nothing alike. Many have attemted to rewrite the story based on this interesting concept. Elisabeth Moss performs her part very well, as she plays the victim again just like Handmaids Tale. The beginning of the movie is a slow burn, but eventually picks up on the suspense. Very little character development with no emotional connection to the main characters to make you care what happens to them. Overall, it was entertaining to watch for free, but not if you have to rent it for top dollar.\nWas expecting at least a little more.\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Starring': ['Sonequa Martin-Green', 'Doug Jones', 'Anthony Rapp', 'Mary Wiseman', 'David Ajala', 'Wilson Cruz'], 'Studio': ['CBS']}\nSequels and spinoffs are very dissicult to pull off. Some shows and movies did not quite hit the mark. But I feel that CBS has continued the torch for us Star Trek fans. I have been watching Star Trek since the 1970's and some spinoffs did not do it for me. Discovery Season 1 was a fresh take in the Star Trek experience and still trekking steady as she goes into its third season, with episode one done very well. I guess this story line no feels familiar a bit to Star Trek Voyager being lost in a diffrent universe or time. I have confidence that this season will continue to entertain us Trekies.<br /><br />Live long & Prosper\nCBS bodly going where no network has gone before!\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Barry J. Kelly', 'Juno John Lee', 'Jason Zurek', 'Kim Arndt', 'Bob Suarez', 'Michael Mullen', 'Fill Marc Sagadraca'], 'Producers': ['Aaron Baiers', 'Robyn Johnson', 'Heather Kadin'], 'Studio': ['CBS']}\nThis was was fun and refreshing to watch for kids and adult fans alike. The show was based on Star Trek's The Next Generation episode called “Lower Decks”  from the viewpoint of the junior officers on the lower decks of the enterprise. These episodes focus on the low ranking officers on one of the Starfleet’s least important ships, the U.S.S. Cerritos. I will not give away plot details or spoilers as they are already out there.<br />Overall, its light entertainment from the Star Trek universe. Will like to see more episodes or similiar story lines that they dont do in real films.<br /><br />Please click the below helpful button if you found my review helpful to you so I can improve my future reviews as well.\nFun & Enjoyable for any Trekkie\n{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Pepe Danquart'], 'Producers': ['Susa Kusche', 'Uwe Spiller'], 'Starring': ['Andrzej Tkacz', 'Kamil Tkacz', 'Elisabeth Duda'], 'Studio': ['Menemsha Films']}\nBased on a true story of Yoram Israel Fridman who was smuggled out of the Warsaw Ghetto at age eight. This is the tale of an eight-year old boy who escapes the Warsaw Ghetto and for three years survives on his own in Nazi-occupied Poland could easy defy belief!  Run Boy Run is a film well worth watching and showing the true horrors of the Holocaust and World War II. Without giving away any storylines or spoilers and you can stomach this heavy drama filled movie, it is a must see. I like when these types of movies focus on one family or person, as it shows the individual struggle to survive during that time. My mother and father both survived and told me stories of such horror, so I can relate very well as they were young children during the war as well.\nA must see film.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Terry Ingram', 'Sean McNamara', 'Siobhan Devine', 'Martin Wood', 'Anne Wheeler', 'Andy Mikita', 'Mike Rohl', 'Peter DeLuise', 'Alysse Leite-Rogers', 'Michael Robison'], 'Starring': ['Meghan Ory', 'Barbara Niven', 'Laci J Mailey']}\n( No Spoilers )<br />Abby returns to her hometown after hearing troubling news about the family inn facing foreclosure in the series premiere of this drama about a divorced mom dealing with her past. Chesapeake Shores is good, clean family show. The family is not perfect and have their struggles to deal with, and this is what gives the show its accuracy.<br />The series puts a high value on family and healthy relationships. Adult couples embrace and kiss, and in some scenes they drink beer or wine.<br />This feel-good drama is a great choice for teens and adults alike.  Appropriate for ages 11 and up.\nA Great family show\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Italiano', '日本語', 'Português', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Patrick Vollrath'], 'Producers': ['Maximilian Leo', 'Jonas Katzenstein', 'Franz Novotny', 'Alexander Glehr'], 'Starring': ['Joseph Gordon-Levitt', 'Omid Memar', 'Carlo Kitzlinger'], 'Studio': ['Amazon Studios']}\n( No Spoliers )<br />This b-movie is a good suspenseful thriller but really lacks the quality of real films. I did watch the whole film and it did keep me interested, so I have to say it wasn't a bad film, just cheaply made. If you have nothing better to do or cant sleep, this Flight-Hijacking Thriller is a decent film to watch. Your chances for enjoying this will depend on giving up a search for storyline depth and just strapping in for a B-movie thrill ride.\nSuspenseful thriller\nWestworld: S3: The New World (DVD)\nEvan Rachel Wood  (Actor),     Thandiwe Newton  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Escape is not freedom. Chaos is not revolution. Independence is not negotiable. And free will is not free. Welcome back to Westworld, the Emmy®-winning drama series that follows the dawn of artificial consciousness and the evolution of sin. In Season Three, the real gods are coming... and they are very angry. Born into a world of pain, Westworld’s android hosts were never allowed to go or see one place: our world. But now, at the end of the game, they’re here. With the help of Aaron Paul’s very human Caleb, Dolores is ready to start a revolution. And if that doesn’t work, she can do it the old-fashioned way... and kill everyone. Aaron Paul, Vincent Cassell, Lena Waithe and Scott Mescudi join Evan Rachel Wood’s Dolores, Jeffrey Wright’s Bernard, Thandie Newton’s Maeve and Ed Harris’s William in the new season, which explores the nature of our reality, free will and what makes us human.', ']]>']\n{'Genre': 'Fantasy, Westerns, Science Fiction', 'Format': 'NTSC', 'Contributor': \"Talulah Riley, Jonathan Nolan, Angela Sarafyan, Denise Thé, Clifton Collins, Jr., Luke Hemsworth, Louis Herthum, J.J. Abrams, Jeffrey Wright, Tao Okamoto, Michael Crichton, Vincent Cassel, Lena Waithe, David Witz, Roberto Patino, Noreen O'Toole, Evan Rachel Wood, Ingrid Bolsø Berdal, Shannon Woodward, Rodrigo Santoro, Thandiwe Newton, Tessa Thompson, Ben Stephenson, Jordan Goldberg, Katja Herbers, James Marsden, Lisa Joy, Fares Fares, Athena Wickham, Aaron Paul, Ed Harris, Gustaf Skarsgård, Richard J. Lewis, Simon QuartermanTalulah Riley, Jonathan Nolan, Angela Sarafyan, Denise Thé, Clifton Collins, Jr., Luke Hemsworth, Louis Herthum, J.J. Abrams, Jeffrey Wright, Tao Okamoto, Michael Crichton, Vincent Cassel, Lena Waithe, David Witz, Roberto Patino, Noreen O'Toole, Evan Rachel Wo…  See more\", 'Initial release date': '2020-11-17', 'Runtime': '470 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.64 Ounces', 'Item model number': 'D750132D', 'Media Format': 'NTSC', 'Run time': '470 minutes', 'Release date': 'November 17, 2020', 'Actors': 'Evan Rachel Wood, Thandiwe Newton, Jeffrey Wright, James Marsden, Tessa Thompson', 'Producers': \"Noreen O'Toole, Ben Stephenson, David Witz, Athena Wickham, Jordan Goldberg\", 'Studio': 'Warner Bros.', 'Number of discs': '3'}\n(No Spoilers) One of the best and creative shows I have ever seen. Sci-Fi in general is hard to pull off. You need a good story, realistic special effects, and believable characters. Dolores (Evan Rachel Wood) is now out in the real world, carrying five processing cores she stole from the park's mainframe....This season 3 with 8 episodes, storyline is intense with lots of action. Comes with 3 discs. “Westworld” is a well-made and engaging show you will love or want to own. Shipped and arrived quickly in perfect condition.\n'Free Will Isn't Free'\n{'Content advisory': ['Violence', 'substance use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'Français'], 'Directors': ['Michael Polish'], 'Producers': ['Randall Emmett', 'George Furla', 'Shaun Sanghani', 'Mark Stewart', 'Luillo Ruiz'], 'Starring': ['Emile Hirsch', 'Kate Bosworth', 'Mel Gibson']}\nOne of the worst movies I have ever seen. I can't believe they even made this, especially with some famous actors. Bad plot, makes no sense, low budget film. I saw 14,000 reviews and 4 stars so I was mislead to watch it. Not worth the time.\n🎬 Wow!..... 📽️\nThe Tomorrow War\nSuspense, Drama, Compelling, Frightening\n['Time travelers arrive from 2051 to deliver an urgent message: 30 years in the future mankind is losing a war against a deadly alien species. The only hope for survival is for soldiers and civilians to be transported to the future and join the fight. Determined to save the world for his daughter, Dan Forester teams up with a brilliant scientist and his estranged father to rewrite the planet’s fate.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Italiano', '日本語', 'Português', 'Deutsch', 'தமிழ்', 'हिन्दी', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'తెలుగు', 'Français (France)'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Chris McKay'], 'Producers': ['Rob Cowan', 'Leifur B. Dagfinnsson', 'Jules Daly', 'David Ellison', 'Bradley J. Fischer', 'Dana Goldberg', 'David S. Goyer', 'Don Granger', 'Hjortur Gretarsson'], 'Starring': ['Chris Pratt', 'J.K. Simmons', 'Yvonne Strahovski']}\nThis is a creature feature -- and the monsters are fanged, spiked, and terrifying. Expect guts being blasted everywhere. I expected a cheesy sci fi film, but in the end I found it a bit entertaining. There is Lots of green alien blood and missing limbs. There is action, humors, sci fi, war, and some warm emotional moments. Overall, a nice paced film with a decent ending as far as a sci fi film can go. Overall, characters are from all walks of life and make positive contributions with the skills they have, including women who are assured leaders and kids who love science.<br />Not for younger kids, or people who are a bit squeamish. Parents should also know that there is foul language as well. 👽👽👽\n👽👽👽 Action, aliens, guts, and more... 👽👽👽",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user retains a strong appreciation for science fiction and action/adventure genres, increasingly drawn to suspense narratives and thoughtful dramas that delve into family struggles, survival, and the human experience within historical contexts.\n\n- **Content Consumption:** Recent interactions indicate the user’s growing tolerance for lower-quality thrillers while maintaining a clear disdain for poorly executed narratives, even with notable actors. They value coherent storytelling, emotional impact, and authentic character development.\n\n- **Engagement Style:** The user offers perceptive reviews, rating content based on the quality of storytelling and character arcs. Their reviews reflect an appreciation for innovative sci-fi elements balanced with coherent plots and relatable characters.\n\n- **Community Involvement:** Actively engaging in discussions, the user often connects narratives to personal and familial histories, emphasizing resilience during adversity.\n\n- **Favorite Elements:** Emotional complexity, family resilience, and authentic relationships are central to their preferences. While their genre flexibility persists, the user remains steadfast in their demand for meaningful storytelling.\n\n- **Collecting Habits:** Their dedicated cinematic exploration is evident in a Blu-ray collection focused on films that portray vivid human experiences and familial dynamics.\n\nOverall, the user’s tastes continue to evolve while remaining anchored in emotional depth and authenticity, showcasing an appreciation for films that successfully blend action, humor, and emotional moments without sacrificing narrative quality.",
  "metrics": {
    "rouge1_f": 0.06627017841971113,
    "rouge2_f": 0.010201190138849533,
    "rougeL_f": 0.03625035400736335,
    "meteor": 0.019509105780674885,
    "bleu1": 2.495506913215249e-08,
    "bleu2": 1.082507234716041e-08,
    "bleu3": 3.583525493894894e-09,
    "bleu4": 9.758460353798044e-10,
    "bertscore_precision": 0.34839728474617004,
    "bertscore_recall": 0.520368218421936,
    "bertscore_f1": 0.4173620641231537
  }
}