{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/09/22\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jared Hess'], 'Producers': ['Jeremy Coon', 'Chris Wyatt', 'Sean Covel', 'Jory Weitz'], 'Starring': ['Jon Heder', 'Jon Gries', 'Aaron Ruell'], 'Studio': ['Crowd Pleasers']}\nReview Text: It is a great movie although it’s a little too quirky for my taste. I recommend it to anyone wanting to laugh!\nReview Title: Funny!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Heaven's Lost Property - The Angeloid of Clockwork (Blu-ray/DVD Combo)\nBrittany Karbowski  (Actor),     Greg Ayres  (Actor),     Christopher Bevins  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Anime\n['Product Description', 'BR/DVD.', 'Amazon.com', 'Although the', \"Heaven's Lost Property\", 'feature', 'The Angeloid of Clockwork', \"(2011) was released theatrically, it plays like a choppy series of OVA adventures cut together. Pretty high school student Hiyori Kazane nurtures a crush on Tomoki. She watches him with his friend Sohara and the Angeloids, but she's too shy to say anything to him. The first half of the movie echoes the original series: Tomoki and his friends go about their usual misadventures around town and at local festivals. The filmmakers include plenty of jiggle shots and underwear jokes. At one point, the girls' panties fly away like a swarm of butterflies, although the viewer never learns why. The last third of the film turns serious: apparently Hiyori is dreaming her everyday adventures while her body lies in the facility known as Synapse. When she's hit by a truck, Hiyori dies in her dream and reenters her real body. She wants to come back to Sorami so intensely, she returns as an Angeloid--to destroy Tomoki. The tragic romance plays oddly against the gross jokes. During much of the film, Tomoki is drawn as a sort of toy-avatar who argues with himself on the toilet and rides the conveyor belt in a sushi bar, naked on a plastic tray. Although\", \"Heaven's Lost Property\", 'has proved popular on both sides of the Pacific,', 'otaku', \"who watch it for the fan service shots probably won't enjoy the ill-starred romance, and romantics will be put off by the raw jokes. (Rated TV MA: risqué humor, toilet humor, nudity, cartoon violence, violence against women)\", '--Charles Solomon']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Animated', 'Contributor': 'Brittany Karbowski, Jamie Marchi, Christopher Bevins, Eric Vale, Greg Ayres', 'Language': 'Japanese, English', 'Number Of Discs': '2', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '704400058837', 'Director': 'Christopher Bevins', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Animated', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 26, 2013', 'Actors': 'Brittany Karbowski, Greg Ayres, Eric Vale, Jamie Marchi', 'Subtitles': 'English', 'Studio': 'Funimation Prod', 'Number of discs': '2'}\nThis is probably the most funny and cutest anime me and my hubs have ever seen. It's packed with pervy stuff, cuteness, and humor. This anime will strike the heartstrings and make your sides hurt from laughing too hard. It's perfectly scripted and made- it's just too much perfection in one show. Daisuki!\nSora no Otoshimono/Heaven's Lost Property...\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Aneesh Chaganty'], 'Producers': ['Timur Bekmambetov', 'Sev Ohanian', 'Natalie Qasabian', 'Adam Sidman'], 'Starring': ['John Cho', 'Debra Messing', 'Joseph Lee'], 'Studio': ['Screen Gems']}\nThe second I saw the trailer for this in theaters, I was beyond excited to see it. I was not disappointed at all and can’t wait to watch it again. It’s one of those movies where you’ll be playing detective in your head and think you have the right answer only to become stumped the next minute and second guess yourself. I highly recommend giving this a watch, you won’t regret it!\nKeeps you curious!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jared Hess'], 'Producers': ['Jeremy Coon', 'Chris Wyatt', 'Sean Covel', 'Jory Weitz'], 'Starring': ['Jon Heder', 'Jon Gries', 'Aaron Ruell'], 'Studio': ['Crowd Pleasers']}\nIt is a great movie although it’s a little too quirky for my taste. I recommend it to anyone wanting to laugh!\nFunny!",
  "profile": "**User Profile Summary:**\n\n- **Genre Preference:** The user primarily enjoys anime, particularly titles that blend humor, romance, and fanservice elements, alongside engaging narratives like suspenseful thrillers. They are open to quirky comedies, even if they may sometimes find them a bit excessive.\n\n- **Content Style:** Prefers lighthearted and comedic works featuring quirky characters, humorous situations, and narratives that maintain curiosity. However, they also appreciate films with intricate plots that encourage critical thinking and engagement. \n\n- **Quality Appreciation:** Values well-crafted storytelling and high production quality, consistently rating content highly when it effectively combines entertainment with execution. The recent interaction demonstrates an appreciation for humor, indicating a balanced taste for both comedy and quirkiness.\n\n- **Experience Seeking:** Looks for emotional experiences that provide both laughter and intensity, favoring a mix of comedic yet thought-provoking stories and thrillers that keep the audience guessing.\n\n- **Social Viewing:** Enjoys shared viewing experiences that enhance enjoyment, particularly for works containing humorous and romantic elements, as well as thrilling plots that spark conversation.\n\n- **Product Format:** Shows a strong preference for high-quality media formats, specifically Blu-ray, reflecting an interest in the best viewing experiences across both anime and other movie genres.\n\nOverall, this user is drawn to engaging content merging comedy and romance while also valuing intricate and thought-provoking narratives across genres. They prioritize quality production and shared experiences in their media consumption.",
  "metrics": {
    "rouge1_f": 0.17142857142857146,
    "rouge2_f": 0.013745704467353953,
    "rougeL_f": 0.07314285714285715,
    "meteor": 0.06832437275985663,
    "bleu1": 0.030640448179377985,
    "bleu2": 0.010174889765947593,
    "bleu3": 0.0032742602855920476,
    "bleu4": 0.0010454065998770305,
    "bertscore_precision": 0.36406630277633667,
    "bertscore_recall": 0.45759886503219604,
    "bertscore_f1": 0.40550902485847473
  }
}