{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/09/22\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Watts'], 'Producers': ['Kevin Feige', 'Amy Pascal'], 'Starring': ['Tom Holland', 'Jake Gyllenhaal', 'Michael Keaton']}\nReview Text: It was a great movie, but I will say NOTHING compares to Andrew Garfield’s Spiderman.\nReview Title: Funny and enjoyable!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Heaven's Lost Property - The Angeloid of Clockwork (Blu-ray/DVD Combo)\nBrittany Karbowski  (Actor),     Greg Ayres  (Actor),     Christopher Bevins  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Anime\n['Product Description', 'BR/DVD.', 'Amazon.com', 'Although the', \"Heaven's Lost Property\", 'feature', 'The Angeloid of Clockwork', \"(2011) was released theatrically, it plays like a choppy series of OVA adventures cut together. Pretty high school student Hiyori Kazane nurtures a crush on Tomoki. She watches him with his friend Sohara and the Angeloids, but she's too shy to say anything to him. The first half of the movie echoes the original series: Tomoki and his friends go about their usual misadventures around town and at local festivals. The filmmakers include plenty of jiggle shots and underwear jokes. At one point, the girls' panties fly away like a swarm of butterflies, although the viewer never learns why. The last third of the film turns serious: apparently Hiyori is dreaming her everyday adventures while her body lies in the facility known as Synapse. When she's hit by a truck, Hiyori dies in her dream and reenters her real body. She wants to come back to Sorami so intensely, she returns as an Angeloid--to destroy Tomoki. The tragic romance plays oddly against the gross jokes. During much of the film, Tomoki is drawn as a sort of toy-avatar who argues with himself on the toilet and rides the conveyor belt in a sushi bar, naked on a plastic tray. Although\", \"Heaven's Lost Property\", 'has proved popular on both sides of the Pacific,', 'otaku', \"who watch it for the fan service shots probably won't enjoy the ill-starred romance, and romantics will be put off by the raw jokes. (Rated TV MA: risqué humor, toilet humor, nudity, cartoon violence, violence against women)\", '--Charles Solomon']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Animated', 'Contributor': 'Brittany Karbowski, Jamie Marchi, Christopher Bevins, Eric Vale, Greg Ayres', 'Language': 'Japanese, English', 'Number Of Discs': '2', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '704400058837', 'Director': 'Christopher Bevins', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Animated', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 26, 2013', 'Actors': 'Brittany Karbowski, Greg Ayres, Eric Vale, Jamie Marchi', 'Subtitles': 'English', 'Studio': 'Funimation Prod', 'Number of discs': '2'}\nThis is probably the most funny and cutest anime me and my hubs have ever seen. It's packed with pervy stuff, cuteness, and humor. This anime will strike the heartstrings and make your sides hurt from laughing too hard. It's perfectly scripted and made- it's just too much perfection in one show. Daisuki!\nSora no Otoshimono/Heaven's Lost Property...\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Aneesh Chaganty'], 'Producers': ['Timur Bekmambetov', 'Sev Ohanian', 'Natalie Qasabian', 'Adam Sidman'], 'Starring': ['John Cho', 'Debra Messing', 'Joseph Lee'], 'Studio': ['Screen Gems']}\nThe second I saw the trailer for this in theaters, I was beyond excited to see it. I was not disappointed at all and can’t wait to watch it again. It’s one of those movies where you’ll be playing detective in your head and think you have the right answer only to become stumped the next minute and second guess yourself. I highly recommend giving this a watch, you won’t regret it!\nKeeps you curious!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jared Hess'], 'Producers': ['Jeremy Coon', 'Chris Wyatt', 'Sean Covel', 'Jory Weitz'], 'Starring': ['Jon Heder', 'Jon Gries', 'Aaron Ruell'], 'Studio': ['Crowd Pleasers']}\nIt is a great movie although it’s a little too quirky for my taste. I recommend it to anyone wanting to laugh!\nFunny!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Lars Klevberg'], 'Producers': ['Jason Cloth', 'Chris Ferguson', 'Aaron L. Gilbert', 'Seth Grahame-Smith', 'David Katzenberg', 'Aaron Schmidt', 'Michael Williams'], 'Starring': ['Tim Matheson', 'Ben Daon', 'Zahra Anderson']}\nWasn’t awful, wasn’t great. It was fun to watch so I’d recommend!\nEntertaining\n{'Audio languages': ['English (US) [Audio Description]', 'English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gary Dauberman'], 'Producers': ['Richard Brener', 'Michael Clear', 'Michelle Morrissey', 'Dave Neustadter', 'Victoria Palmeri', 'Peter Safran', 'Judson Scott', 'James Wan'], 'Starring': ['Vera Farmiga', 'Patrick Wilson', 'Mckenna Grace']}\nIt was okay, a bit all over the place. I wouldn’t watch again or buy it, but I’d recommend for people to watch at least once if they’re a fan of the Conjuring universe.\nNot awful, not great...\n{'Content advisory': ['Nudity', 'violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ari Aster'], 'Producers': ['Patrik Andersson', 'Thomas Benski', 'Tyler Campellone', 'Scott E. Chester', 'Beau Ferris', 'Fredrik Heinig', 'Lars Knudsen', 'Pelle Nilsson', 'Jeffrey Penman'], 'Starring': ['Florence Pugh', 'Jack Reynor', 'William Jackson Harper'], 'Studio': ['A24 Distribution LLC']}\nI love this movie because it has every element a true horror film should have. Unsettling atmosphere, brow-shifting moments, creepy scenes that make you thankful for not having to experience them yourself, disturbing characters that make your skin crawl- you name it. I’m a horror fan and honestly I don’t do well with watching this alone, even in daylight. I highly recommend Midsommar to anyone who loves being weirded/freaked out or enjoys thought-provoking subjects. By the way, this is a movie that you need to actually watch from start to finish (as well as pay attention to the small details).. so set aside time, put down the phone, and prepare yourself for this bizarre ride!\nIncredibly dark and thrilling!\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Gene Stupnitsky'], 'Producers': ['Lee Eisenberg', 'Evan Goldberg', 'Seth Rogen', 'James Weaver'], 'Starring': ['Jacob Tremblay', 'Keith L. Williams', 'Brady Noon'], 'Studio': ['Universal Pictures']}\nMy boyfriend and I enjoyed it.\nFunny!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Watts'], 'Producers': ['Kevin Feige', 'Amy Pascal'], 'Starring': ['Tom Holland', 'Jake Gyllenhaal', 'Michael Keaton']}\nIt was a great movie, but I will say NOTHING compares to Andrew Garfield’s Spiderman.\nFunny and enjoyable!",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference:** The user enjoys a mix of humor, romance, and fanservice with suspenseful thrillers, while also developing a strong appreciation for horror films that explore unsettling atmospheres and intricate narratives.\n\n- **Content Style:** They favor lighthearted, comedic works featuring quirky characters but are increasingly drawn to darker, thought-provoking horror that challenges emotional and psychological landscapes. Their sophisticated taste for complex plots enhances their critical thinking.\n\n- **Quality Appreciation:** The recent purchase and positive review of a humorous, action-packed film highlight their preference for narratives that balance enjoyment with engaging themes. They value well-crafted storytelling and high production quality.\n\n- **Experience Seeking:** They aim for emotional experiences that evoke both laughter and intensity, enjoying narratives that fuse comedy with suspense and psychological complexity in horror.\n\n- **Social Viewing:** Thriving in shared viewing experiences, they particularly enjoy humor and romance while appreciating discussions inspired by thrillers and horror films that explore deeper themes.\n\n- **Product Format:** They prefer high-quality media formats like Blu-ray to ensure optimal viewing experiences across genres.\n\nOverall, the user remains captivated by content that harmonizes comedy, romance, and horror, emphasizing intricate narratives, production quality, and a discerning eye for storytelling. Their recent interactions reflect a sustained enjoyment of humorous films, particularly in shared settings, while maintaining an appreciation for both lighthearted and darker thematic explorations.",
  "metrics": {
    "rouge1_f": 0.13917122752150116,
    "rouge2_f": 0.009397024275646045,
    "rougeL_f": 0.06098514464425332,
    "meteor": 0.04276321656824248,
    "bleu1": 0.0023544235580611997,
    "bleu2": 0.0006209246196925837,
    "bleu3": 0.00020840273019686917,
    "bleu4": 6.795499163886506e-05,
    "bertscore_precision": 0.3537794351577759,
    "bertscore_recall": 0.4678409993648529,
    "bertscore_f1": 0.4028928875923157
  }
}