{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/09/22\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English (US) [Audio Description]', 'English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gary Dauberman'], 'Producers': ['Richard Brener', 'Michael Clear', 'Michelle Morrissey', 'Dave Neustadter', 'Victoria Palmeri', 'Peter Safran', 'Judson Scott', 'James Wan'], 'Starring': ['Vera Farmiga', 'Patrick Wilson', 'Mckenna Grace']}\nReview Text: It was okay, a bit all over the place. I wouldn’t watch again or buy it, but I’d recommend for people to watch at least once if they’re a fan of the Conjuring universe.\nReview Title: Not awful, not great...\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Heaven's Lost Property - The Angeloid of Clockwork (Blu-ray/DVD Combo)\nBrittany Karbowski  (Actor),     Greg Ayres  (Actor),     Christopher Bevins  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Anime\n['Product Description', 'BR/DVD.', 'Amazon.com', 'Although the', \"Heaven's Lost Property\", 'feature', 'The Angeloid of Clockwork', \"(2011) was released theatrically, it plays like a choppy series of OVA adventures cut together. Pretty high school student Hiyori Kazane nurtures a crush on Tomoki. She watches him with his friend Sohara and the Angeloids, but she's too shy to say anything to him. The first half of the movie echoes the original series: Tomoki and his friends go about their usual misadventures around town and at local festivals. The filmmakers include plenty of jiggle shots and underwear jokes. At one point, the girls' panties fly away like a swarm of butterflies, although the viewer never learns why. The last third of the film turns serious: apparently Hiyori is dreaming her everyday adventures while her body lies in the facility known as Synapse. When she's hit by a truck, Hiyori dies in her dream and reenters her real body. She wants to come back to Sorami so intensely, she returns as an Angeloid--to destroy Tomoki. The tragic romance plays oddly against the gross jokes. During much of the film, Tomoki is drawn as a sort of toy-avatar who argues with himself on the toilet and rides the conveyor belt in a sushi bar, naked on a plastic tray. Although\", \"Heaven's Lost Property\", 'has proved popular on both sides of the Pacific,', 'otaku', \"who watch it for the fan service shots probably won't enjoy the ill-starred romance, and romantics will be put off by the raw jokes. (Rated TV MA: risqué humor, toilet humor, nudity, cartoon violence, violence against women)\", '--Charles Solomon']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Animated', 'Contributor': 'Brittany Karbowski, Jamie Marchi, Christopher Bevins, Eric Vale, Greg Ayres', 'Language': 'Japanese, English', 'Number Of Discs': '2', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '704400058837', 'Director': 'Christopher Bevins', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Animated', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 26, 2013', 'Actors': 'Brittany Karbowski, Greg Ayres, Eric Vale, Jamie Marchi', 'Subtitles': 'English', 'Studio': 'Funimation Prod', 'Number of discs': '2'}\nThis is probably the most funny and cutest anime me and my hubs have ever seen. It's packed with pervy stuff, cuteness, and humor. This anime will strike the heartstrings and make your sides hurt from laughing too hard. It's perfectly scripted and made- it's just too much perfection in one show. Daisuki!\nSora no Otoshimono/Heaven's Lost Property...\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Aneesh Chaganty'], 'Producers': ['Timur Bekmambetov', 'Sev Ohanian', 'Natalie Qasabian', 'Adam Sidman'], 'Starring': ['John Cho', 'Debra Messing', 'Joseph Lee'], 'Studio': ['Screen Gems']}\nThe second I saw the trailer for this in theaters, I was beyond excited to see it. I was not disappointed at all and can’t wait to watch it again. It’s one of those movies where you’ll be playing detective in your head and think you have the right answer only to become stumped the next minute and second guess yourself. I highly recommend giving this a watch, you won’t regret it!\nKeeps you curious!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jared Hess'], 'Producers': ['Jeremy Coon', 'Chris Wyatt', 'Sean Covel', 'Jory Weitz'], 'Starring': ['Jon Heder', 'Jon Gries', 'Aaron Ruell'], 'Studio': ['Crowd Pleasers']}\nIt is a great movie although it’s a little too quirky for my taste. I recommend it to anyone wanting to laugh!\nFunny!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Lars Klevberg'], 'Producers': ['Jason Cloth', 'Chris Ferguson', 'Aaron L. Gilbert', 'Seth Grahame-Smith', 'David Katzenberg', 'Aaron Schmidt', 'Michael Williams'], 'Starring': ['Tim Matheson', 'Ben Daon', 'Zahra Anderson']}\nWasn’t awful, wasn’t great. It was fun to watch so I’d recommend!\nEntertaining\n{'Audio languages': ['English (US) [Audio Description]', 'English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gary Dauberman'], 'Producers': ['Richard Brener', 'Michael Clear', 'Michelle Morrissey', 'Dave Neustadter', 'Victoria Palmeri', 'Peter Safran', 'Judson Scott', 'James Wan'], 'Starring': ['Vera Farmiga', 'Patrick Wilson', 'Mckenna Grace']}\nIt was okay, a bit all over the place. I wouldn’t watch again or buy it, but I’d recommend for people to watch at least once if they’re a fan of the Conjuring universe.\nNot awful, not great...",
  "profile": "**User Profile Summary:**\n\n- **Genre Preference:** The user enjoys anime that combines humor, romance, and fanservice with suspenseful thrillers. They maintain an openness to quirky comedies, finding them entertaining despite occasional excess.\n\n- **Content Style:** Prefers lighthearted and comedic works featuring quirky characters while also appreciating intricate plots that stimulate critical thinking. Recent interactions reveal a tendency to rate content as enjoyable but not necessarily memorable, indicating a desire for entertainment that balances humor with deeper storytelling.\n\n- **Quality Appreciation:** Values well-crafted storytelling and high production quality. They have recently rated a title positively for its entertainment value, yet expressed a more critical stance towards less cohesive narratives, emphasizing the need for improved storytelling depth.\n\n- **Experience Seeking:** Aims for emotional experiences that evoke both laughter and intensity, favoring comedic and thought-provoking narratives alongside thrillers that sustain suspense.\n\n- **Social Viewing:** Enjoys shared viewing experiences that enhance enjoyment, particularly for works with humorous and romantic elements that ignite conversation.\n\n- **Product Format:** Prefers high-quality media formats like Blu-ray for an optimal viewing experience across anime and other genres.\n\nOverall, the user is drawn to engaging content that fuses comedy and romance while valuing intricate narratives and quality production. Recent feedback indicates a growing awareness of storytelling cohesion, suggesting a refined perspective towards media consumption.",
  "metrics": {
    "rouge1_f": 0.13813813813813813,
    "rouge2_f": 0.010030090270812439,
    "rougeL_f": 0.06406406406406408,
    "meteor": 0.04714071724381003,
    "bleu1": 0.008327155432715056,
    "bleu2": 0.0022991351058295607,
    "bleu3": 0.0008249149577995654,
    "bleu4": 0.00027812331973567703,
    "bertscore_precision": 0.34944960474967957,
    "bertscore_recall": 0.4554932713508606,
    "bertscore_f1": 0.39548632502555847
  }
}