{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Clio Kill Cover Conceal Dation SPF45 PA+++ Foundation (#002)\nReview Date: 2017/04/06\nStore: CLIO\nAverage Rating: 2.0\nProduct Details: {'Brand': 'CLIO', 'Item Form': 'Pressed', 'Number of Items': '1', 'Package Information': 'Jar', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.1 x 2 inches; 4 Ounces'}\nReview Text: The color of this is way too light and they don't offer too many colors.  The consistency is kind of powdery and dries resembling same.  Mixes well with my Estee Lauder Doublewear though.\nReview Title: Too Light - Powdery\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Miracalis - Best Face Cream Moisturizer With Advanced Anti Aging Wrinkle Formula. Clinically Proven To Reduce Wrinkle Depth, Smooth Fine Lines & Soften Skin. Cruelty Free, Hypoallergenic\nMiracalis\n['* Face Moisturizer * Face Anti Aging * Deep Hydration Face Cream * Hydrating Anti Aging Moisturizer * Aging Cream * Hydration Cream For Face * Regenerating Day Cream * Face Moisturizing Cream * Facial Moisturizers Anti Aging * Anti Aging Facial Cream * Hydrating Moisturizer for Face * Deep Moisturizing Face Cream * Face Moisturizer Anti Aging * Moisturizing Cream Anti Aging * Peptide Face Cream * Moisturizer Facial Cream * Deep Face Moisturizer * Hydrating Facial Moisturizer * Best Face Moisturizer Anti Aging * Anti Aging Skin Care * Bare Mineral * Neck Moisturizer * Neck Cream * Skin Cream * Anti Aging Skin', 'Your Face Will Look Lovelier In Only 15 Days!', 'Reduces the depth of your facial wrinkles with daily use.', 'You will quickly look noticeably younger, healthier, and more attractive.', 'Simply apply Miracalis Anti-Aging Moisturizer Cream right after washing your face in the morning and again at night.', 'What About My Skin Type?', 'A safe, gentle, hypoallergenic formula that is tested and recommended for all 4 major skin types: Normal, Sensitive, Dry or Oily Skin', 'Your Shield Against The Signs Of Aging', \"Your skin is under daily attack - air pollution, the sun's harmful rays, germs and time itself all wear down your skin's natural barriers. The result is dry, cracked and tired looking skin.\", 'Our formula restores the two natural antioxidants (Vitamin E and Co-Enzyme Q10) that your skin needs to properly repair and maintain this barrier.', 'Your skin will look younger, be less sensitive. You will have healthier, attractive and glowing skin again.', '100% Satisfaction Guaranteed, Made in the USA']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.63 x 2.63 x 2.05 inches; 4 Ounces', 'Item model number': 'MIR-AAM001', 'UPC': '820103882309 794168056596', 'Manufacturer': 'Miracalis'}\nAlthough I was excited at first that this product would deliver, it caused a reaction after having used for about 3 days.  My undereye area is an issue with slight crepiness (sp?) and fine wrinkles.  I decided to return because of the reaction.  I have realized that sticking with brand name, proven products for the undereye area are always better for me - Murad works better for me and I'll stick with that line.  I'm 59 and cannot afford to experiment with my sensitive skin at this point.  The customer service for this product (Miracalis) is excellent, though!\n) and fine wrinkles. I decided to return because of the ...\nMary Kay Signature Cheek Color / Blush Duet ~ Island Spice\nMary Kay\n{'Brand': 'Mary Kay', 'Number of Items': '1', 'Style': 'Compact', 'Item Weight': '0.02 Pounds', 'Package Type': 'Palette', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.1 x 1.1 x 0.4 inches; 0.32 Ounces', 'Item model number': '606300', 'UPC': '060410070321'}\nExactly what I wanted.  The darker tone is good for checkbones and lighter on the apples of cheeks.  Very natural color - coral and bronze but no glitter which I cannot stand.  Worth every penny!\nBuy This! Wonderful!\nMary Kay TimeWise Luminous Wear Liquid Foundation, Beige 5\nMary Kay\n['Formulated with skin-loving jojoba to provide moisturization and contains a light-reflecting mineral that brightens skin and gives it a more radiant look. Infused with vitamin E and a patented blend of collagen-building peptides for skin that instantly looks firmer, younger and healthier.']\n{'Item Form': 'Liquid', 'Color': 'Beige', 'Skin Type': 'Dry,Normal', 'Finish Type': 'Luminous', 'Package Information': 'Bottle', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 0.2 x 4 inches; 0.64 Ounces', 'Item model number': '038709', 'UPC': '890357850393 571121100783 885612768643 881147860043 885415948938 092510001264 885815414934', 'Manufacturer': 'Chom'}\nWonderful foundation.  Covers well (not completely but is buildable and works well).  No color changes and wears all day with no drying.  Recommend highly!\nGreat Foundation!\nMary Kay Gel Eyeliner with Expandable Brush Applicator\nMary Kay\n{'Brand': 'Mary Kay', 'Item Form': 'Gel', 'Number of Items': '2', 'Unit Count': '1.85 Fl Oz', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2 x 1.4 x 1.2 inches; 1.6 Ounces'}\nGreat product but does not stay on completely.  Some traveling that needs to be wiped with tissue or cotton swab during the day.\nBuy Estee Lauder instead...\nVictoria Featherlight (2 Pads) Chest Pads For Decollete, Chest Wrinkles Prevention, Silicone Wrinkle Pad (The original design, clear color instead of blue)\nVictoria Featherlight\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8 x 7.8 x 0.7 inches; 0.63 Ounces', 'UPC': '636156553970', 'Manufacturer': 'Victoria Featherlight'}\nWas skeptical when received thinking they were too small or wouldn't stick well enough (per online reviews) - however, I was pleasantly surprised that the pad stayed on all night, wasn't too uncomfortable (none are really that comfortable), and woke with no chest wrinkles from sleeping on side.  So far I would recommend - will write later after having used for one week or so.\nGood Product So Far\nClio Kill Cover Conceal Dation SPF45 PA+++ Foundation (#002)\nCLIO\n{'Brand': 'CLIO', 'Item Form': 'Pressed', 'Number of Items': '1', 'Package Information': 'Jar', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.1 x 2 inches; 4 Ounces'}\nThe color of this is way too light and they don't offer too many colors.  The consistency is kind of powdery and dries resembling same.  Mixes well with my Estee Lauder Doublewear though.\nToo Light - Powdery",
  "profile": "**Updated User Profile Summary:**\n\n- **Skincare Focus**: The user emphasizes effective face moisturizers featuring anti-aging benefits and deep hydration to support youthful skin health, with recent interest in targeted products for wrinkle prevention, particularly in the chest area.\n\n- **Makeup Interest**: Their focus on color cosmetics includes a preference for foundations that provide a natural finish and luminous formulas. They remain critical of product performance, specifically the color selection and consistency, and seek high-performing items for better longevity and wear.\n\n- **Product Preference**: The user favors well-established, reputable brands known for clinical efficacy and skin sensitivity suitability, maintaining a vigilant stance on hypoallergenic and gentle formulas.\n\n- **Skin Sensitivity**: A priority continues to be products that minimize the risk of skin reactions, particularly in their makeup choices.\n\n- **Aging Concerns**: Actively seeking solutions for fine lines and wrinkles, the user emphasizes products that promote a youthful appearance throughout their skincare and cosmetic routines.\n\n- **Product Performance**: Rising expectations for product effectiveness reflect a growing demand for high-performing beauty items, with specific criticism on color matching and texture.\n\n- **Customer Experience**: High-quality customer service and reliable brand support remain crucial, along with thoughtful return policy considerations.\n\n- **Age Awareness**: At 59 years old, the user is committed to finding trustworthy solutions for long-term results, embodying a conscientious approach to beauty care that blends efficacy, comfort, and dependable performance.\n\nOverall, the user maintains a careful and informed approach to skincare and cosmetics, focusing on effective solutions for aging and skin sensitivity.",
  "metrics": {
    "rouge1_f": 0.22280701754385968,
    "rouge2_f": 0.021089630931458703,
    "rougeL_f": 0.1,
    "meteor": 0.08973120829631415,
    "bleu1": 0.029737690760989303,
    "bleu2": 0.007153949071920369,
    "bleu3": 0.0009938764416037452,
    "bleu4": 0.00037073845605786727,
    "bertscore_precision": 0.3843806982040405,
    "bertscore_recall": 0.4790416955947876,
    "bertscore_f1": 0.4265221357345581
  }
}