{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mary Kay Gel Eyeliner with Expandable Brush Applicator\nReview Date: 2016/09/19\nStore: Mary Kay\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Mary Kay', 'Item Form': 'Gel', 'Number of Items': '2', 'Unit Count': '1.85 Fl Oz', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2 x 1.4 x 1.2 inches; 1.6 Ounces'}\nReview Text: Great product but does not stay on completely.  Some traveling that needs to be wiped with tissue or cotton swab during the day.\nReview Title: Buy Estee Lauder instead...\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Miracalis - Best Face Cream Moisturizer With Advanced Anti Aging Wrinkle Formula. Clinically Proven To Reduce Wrinkle Depth, Smooth Fine Lines & Soften Skin. Cruelty Free, Hypoallergenic\nMiracalis\n['* Face Moisturizer * Face Anti Aging * Deep Hydration Face Cream * Hydrating Anti Aging Moisturizer * Aging Cream * Hydration Cream For Face * Regenerating Day Cream * Face Moisturizing Cream * Facial Moisturizers Anti Aging * Anti Aging Facial Cream * Hydrating Moisturizer for Face * Deep Moisturizing Face Cream * Face Moisturizer Anti Aging * Moisturizing Cream Anti Aging * Peptide Face Cream * Moisturizer Facial Cream * Deep Face Moisturizer * Hydrating Facial Moisturizer * Best Face Moisturizer Anti Aging * Anti Aging Skin Care * Bare Mineral * Neck Moisturizer * Neck Cream * Skin Cream * Anti Aging Skin', 'Your Face Will Look Lovelier In Only 15 Days!', 'Reduces the depth of your facial wrinkles with daily use.', 'You will quickly look noticeably younger, healthier, and more attractive.', 'Simply apply Miracalis Anti-Aging Moisturizer Cream right after washing your face in the morning and again at night.', 'What About My Skin Type?', 'A safe, gentle, hypoallergenic formula that is tested and recommended for all 4 major skin types: Normal, Sensitive, Dry or Oily Skin', 'Your Shield Against The Signs Of Aging', \"Your skin is under daily attack - air pollution, the sun's harmful rays, germs and time itself all wear down your skin's natural barriers. The result is dry, cracked and tired looking skin.\", 'Our formula restores the two natural antioxidants (Vitamin E and Co-Enzyme Q10) that your skin needs to properly repair and maintain this barrier.', 'Your skin will look younger, be less sensitive. You will have healthier, attractive and glowing skin again.', '100% Satisfaction Guaranteed, Made in the USA']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.63 x 2.63 x 2.05 inches; 4 Ounces', 'Item model number': 'MIR-AAM001', 'UPC': '820103882309 794168056596', 'Manufacturer': 'Miracalis'}\nAlthough I was excited at first that this product would deliver, it caused a reaction after having used for about 3 days.  My undereye area is an issue with slight crepiness (sp?) and fine wrinkles.  I decided to return because of the reaction.  I have realized that sticking with brand name, proven products for the undereye area are always better for me - Murad works better for me and I'll stick with that line.  I'm 59 and cannot afford to experiment with my sensitive skin at this point.  The customer service for this product (Miracalis) is excellent, though!\n) and fine wrinkles. I decided to return because of the ...\nMary Kay Signature Cheek Color / Blush Duet ~ Island Spice\nMary Kay\n{'Brand': 'Mary Kay', 'Number of Items': '1', 'Style': 'Compact', 'Item Weight': '0.02 Pounds', 'Package Type': 'Palette', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.1 x 1.1 x 0.4 inches; 0.32 Ounces', 'Item model number': '606300', 'UPC': '060410070321'}\nExactly what I wanted.  The darker tone is good for checkbones and lighter on the apples of cheeks.  Very natural color - coral and bronze but no glitter which I cannot stand.  Worth every penny!\nBuy This! Wonderful!\nMary Kay TimeWise Luminous Wear Liquid Foundation, Beige 5\nMary Kay\n['Formulated with skin-loving jojoba to provide moisturization and contains a light-reflecting mineral that brightens skin and gives it a more radiant look. Infused with vitamin E and a patented blend of collagen-building peptides for skin that instantly looks firmer, younger and healthier.']\n{'Item Form': 'Liquid', 'Color': 'Beige', 'Skin Type': 'Dry,Normal', 'Finish Type': 'Luminous', 'Package Information': 'Bottle', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 0.2 x 4 inches; 0.64 Ounces', 'Item model number': '038709', 'UPC': '890357850393 571121100783 885612768643 881147860043 885415948938 092510001264 885815414934', 'Manufacturer': 'Chom'}\nWonderful foundation.  Covers well (not completely but is buildable and works well).  No color changes and wears all day with no drying.  Recommend highly!\nGreat Foundation!\nMary Kay Gel Eyeliner with Expandable Brush Applicator\nMary Kay\n{'Brand': 'Mary Kay', 'Item Form': 'Gel', 'Number of Items': '2', 'Unit Count': '1.85 Fl Oz', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2 x 1.4 x 1.2 inches; 1.6 Ounces'}\nGreat product but does not stay on completely.  Some traveling that needs to be wiped with tissue or cotton swab during the day.\nBuy Estee Lauder instead...",
  "profile": "**Updated User Profile Summary:**\n\n- **Skincare Focus**: The user emphasizes the importance of effective face moisturizers with anti-aging benefits and deep hydration to maintain youthful skin health.\n\n- **Makeup Interest**: Their interest in color cosmetics continues to evolve, now with a specific inclination towards foundations that offer a natural finish and luminous formulas to enhance skin radiance. However, recent experiences indicate a need for higher-performing products in their makeup selection.\n\n- **Product Preference**: They prefer well-established, brand-name products recognized for clinical efficacy and sensitivity suitability. \n\n- **Skin Sensitivity**: The user remains vigilant about skin sensitivity, firmly opting for hypoallergenic and gentle formulas, particularly in makeup choices. \n\n- **Aging Concerns**: They actively seek solutions for fine lines and wrinkles, prioritizing products that promote a youthful appearance.\n\n- **Product Performance**: The user has grown critical regarding product longevity and effectiveness, seeking options that provide reliable wear throughout the day. \n\n- **Customer Experience**: High-quality customer service remains a priority, alongside expectations of adequate support from brands.\n\n- **Return Policy**: Their careful purchasing strategy ensures that products selected are unlikely to provoke reactions as they expand their color cosmetic repertoire.\n\n- **Age Awareness**: At 59 years old, the user is dedicated to finding reliable solutions that yield long-term results, demonstrating a thoughtful approach to beauty care.\n\nOverall, the user maintains a conscientious stance on skincare and cosmetics, focusing on efficacy, comfort, and dependable product performance.",
  "metrics": {
    "rouge1_f": 0.21743810548977394,
    "rouge2_f": 0.017259978425026967,
    "rougeL_f": 0.0968783638320775,
    "meteor": 0.09482714029213278,
    "bleu1": 0.051562212745353636,
    "bleu2": 0.011893355335347619,
    "bleu3": 0.0038171399436140556,
    "bleu4": 0.0012170618942189669,
    "bertscore_precision": 0.3877214193344116,
    "bertscore_recall": 0.4673994779586792,
    "bertscore_f1": 0.42384833097457886
  }
}