{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mary Kay Signature Cheek Color / Blush Duet ~ Island Spice\nReview Date: 2016/08/02\nStore: Mary Kay\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Mary Kay', 'Number of Items': '1', 'Style': 'Compact', 'Item Weight': '0.02 Pounds', 'Package Type': 'Palette', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.1 x 1.1 x 0.4 inches; 0.32 Ounces', 'Item model number': '606300', 'UPC': '060410070321'}\nReview Text: Exactly what I wanted.  The darker tone is good for checkbones and lighter on the apples of cheeks.  Very natural color - coral and bronze but no glitter which I cannot stand.  Worth every penny!\nReview Title: Buy This! Wonderful!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Miracalis - Best Face Cream Moisturizer With Advanced Anti Aging Wrinkle Formula. Clinically Proven To Reduce Wrinkle Depth, Smooth Fine Lines & Soften Skin. Cruelty Free, Hypoallergenic\nMiracalis\n['* Face Moisturizer * Face Anti Aging * Deep Hydration Face Cream * Hydrating Anti Aging Moisturizer * Aging Cream * Hydration Cream For Face * Regenerating Day Cream * Face Moisturizing Cream * Facial Moisturizers Anti Aging * Anti Aging Facial Cream * Hydrating Moisturizer for Face * Deep Moisturizing Face Cream * Face Moisturizer Anti Aging * Moisturizing Cream Anti Aging * Peptide Face Cream * Moisturizer Facial Cream * Deep Face Moisturizer * Hydrating Facial Moisturizer * Best Face Moisturizer Anti Aging * Anti Aging Skin Care * Bare Mineral * Neck Moisturizer * Neck Cream * Skin Cream * Anti Aging Skin', 'Your Face Will Look Lovelier In Only 15 Days!', 'Reduces the depth of your facial wrinkles with daily use.', 'You will quickly look noticeably younger, healthier, and more attractive.', 'Simply apply Miracalis Anti-Aging Moisturizer Cream right after washing your face in the morning and again at night.', 'What About My Skin Type?', 'A safe, gentle, hypoallergenic formula that is tested and recommended for all 4 major skin types: Normal, Sensitive, Dry or Oily Skin', 'Your Shield Against The Signs Of Aging', \"Your skin is under daily attack - air pollution, the sun's harmful rays, germs and time itself all wear down your skin's natural barriers. The result is dry, cracked and tired looking skin.\", 'Our formula restores the two natural antioxidants (Vitamin E and Co-Enzyme Q10) that your skin needs to properly repair and maintain this barrier.', 'Your skin will look younger, be less sensitive. You will have healthier, attractive and glowing skin again.', '100% Satisfaction Guaranteed, Made in the USA']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.63 x 2.63 x 2.05 inches; 4 Ounces', 'Item model number': 'MIR-AAM001', 'UPC': '820103882309 794168056596', 'Manufacturer': 'Miracalis'}\nAlthough I was excited at first that this product would deliver, it caused a reaction after having used for about 3 days.  My undereye area is an issue with slight crepiness (sp?) and fine wrinkles.  I decided to return because of the reaction.  I have realized that sticking with brand name, proven products for the undereye area are always better for me - Murad works better for me and I'll stick with that line.  I'm 59 and cannot afford to experiment with my sensitive skin at this point.  The customer service for this product (Miracalis) is excellent, though!\n) and fine wrinkles. I decided to return because of the ...\nMary Kay Signature Cheek Color / Blush Duet ~ Island Spice\nMary Kay\n{'Brand': 'Mary Kay', 'Number of Items': '1', 'Style': 'Compact', 'Item Weight': '0.02 Pounds', 'Package Type': 'Palette', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.1 x 1.1 x 0.4 inches; 0.32 Ounces', 'Item model number': '606300', 'UPC': '060410070321'}\nExactly what I wanted.  The darker tone is good for checkbones and lighter on the apples of cheeks.  Very natural color - coral and bronze but no glitter which I cannot stand.  Worth every penny!\nBuy This! Wonderful!",
  "profile": "**User Profile Summary:**\n\n- **Skincare Focus**: Continues to prioritize effective face moisturizers, specifically those with anti-aging properties and deep hydration. \n\n- **Makeup Interest**: Recently expanded interest to color cosmetics, specifically preferring natural-looking options without glitter that complement skin tones, indicating a shift towards enhancing overall appearance. \n\n- **Product Preference**: Maintains preference for well-established, brand-name products that are clinically proven and suitable for sensitive skin types.\n\n- **Skin Sensitivity**: Remains cautious due to skin sensitivity, favoring hypoallergenic and gentle formulations, particularly important when exploring color cosmetics.\n\n- **Aging Concerns**: Still actively seeks solutions for fine lines and wrinkles, focusing on maintaining youthful appearance and skin health.\n\n- **Customer Experience**: Continues to value customer service, demonstrating a commitment to sharing positive experiences while expecting high-quality support.\n\n- **Return Policy**: Engaged in a careful purchasing process, emphasizing the importance of products that won’t trigger reactions, which remains relevant even with the introduction of color cosmetics.\n\n- **Age Awareness**: Acknowledges aging (59 years old) and expresses a desire for proven options, showing a preference for reliability and long-term results in both skincare and makeup.\n\nOverall, the user demonstrates a conscientious approach to beauty, balancing skincare and makeup needs while prioritizing efficacy, comfort, and dependable product support.",
  "metrics": {
    "rouge1_f": 0.24320457796852643,
    "rouge2_f": 0.025824964131994265,
    "rougeL_f": 0.10586552217453506,
    "meteor": 0.12826889220757814,
    "bleu1": 0.10616097190669849,
    "bleu2": 0.02734690989553349,
    "bleu3": 0.0040431702335043404,
    "bleu4": 0.0015560636111185537,
    "bertscore_precision": 0.3825263977050781,
    "bertscore_recall": 0.4370568096637726,
    "bertscore_f1": 0.40797755122184753
  }
}