{
  "user_id": "AHIUDIC4IOC3TUWC25ISKZZ4W6JA",
  "summary": "=== Purchase Information ===\nProduct Title: Magic of Belle Isle\nReview Date: 2016/04/08\nStore: Morgan Freeman  (Actor),     Virginia Madsen  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Reuniting with director Rob Reiner from the hit film, THE BUCKET LIST, Freeman plays Monte Wildhorn, a famous Western novelist whose struggle with alcoholism has sapped his passion for writing. He takes a lakeside cabin for the summer in picturesque Belle Isle, and befriends the family next door-an attractive single mom (Madsen) and her young daughters-who help him find inspiration again.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Morgan Freeman, Virginia Madsen, Rob Reiner', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '262098', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'September 18, 2012', 'Actors': 'Morgan Freeman, Virginia Madsen', 'Subtitles': 'Spanish', 'Studio': 'Magnolia Home Ent', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie!!! Hated to see it end!!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hachi: A Dog's Tale\nReview Date: 2016/04/08\nStore: Richard Gere  (Actor),     Joan Allen  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"From Academy Award®-nominated director Lasse Hallström (2000, The Cider House Rules) comes HACHI: A DOG’S TALE, a film based on one of the most treasured and heartwarming true stories ever told. Golden Globe winner Richard Gere (2002, Best Actor in a Musical or Comedy, Chicago) stars as Professor Parker Wilson, a distinguished scholar who discovers a lost Akita puppy on his way home from work. Despite initial objections from Wilson’s wife, Cate (Academy Award® nominee Joan Allen – 2000, Best Actress, The Contender), Hachi endears himself into the Wilson family and grows to be Parker's loyal companion. As their bond grows deeper, a beautiful relationship unfolds embodying the true spirit of family and loyalty, while inspiring the hearts of an entire town.\", 'Amazon.com', 'Based on a true story from Japan,', \"Hachi: A Dog's Tale\", \"is a moving film about loyalty and the rare, invincible bonds that occasionally form almost instantaneously in the most unlikely places. College professor Parker Wilson (Richard Gere) finds a young Akita puppy that's been abandoned at the local train station, and he's instantly captivated by the dog. Assuming the dog's owner will return to the train station to claim him in the morning, Parker takes the puppy home overnight. But when no one comes to get the dog, Parker convinces his wife, Cate (Joan Allen), to welcome him as part of the family. He dubs the puppy Hachiko--Hachi, for short--because of the Japanese symbol for good luck that's hanging from his collar. Hachi is a somewhat peculiar dog that refuses to learn to fetch or master other people-pleasing tricks, but he is a faithful companion and friend to Parker, alerting him of potential dangers and accompanying him to the train station each morning and meeting him there after his return trip each evening. An unforeseen event will continually test Hachi's devotion. This film is neither overwrought nor sappy; it is heartfelt and immensely powerful despite its tendency to drag in a few places. Prepare to be moved to tears by this beautiful, seemingly simple film--it's about so much more than just the relationship between a man and his dog.\", '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '043396321403', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 9, 2010', 'Actors': 'Richard Gere, Joan Allen', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie!!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Lost Valentine (Hallmark Hall of Fame)\nReview Date: 2016/04/08\nStore: Jennifer Love Hewitt  (Actor),     Betty White  (Actor),     Darnell Martin  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"During World War II, Navy Lt. Neil Thomas bids his pregnant young wife, Caroline, farewell at Union Station. But even before their son is born, Neil's plane goes down in the Pacific and he's declared missing in action. Caroline is devastated. Neil was Caroline's one great love... and for the next 65 years Caroline (Betty White) returns to Union Station on the anniversary of the day they said goodbye forever (Valentine's Day), to salute the memory of her brave and beloved husband. Eventually, a TV journalist (Jennifer Love Hewitt) learns of the touching story and sets out to investigate just what happened to Neil during the war. Neil and Caroline's grandson encourages his initially-reluctant grandmother to cooperate; the TV reporter and the grandson fall in love themselves.\", 'Special Features:', '- \"The Making of', 'The Lost Valentine', '\" feature', '- \"Conversations\" feature', '- \"About the Production\" feature', '- \"Cast & Credits\" feature', '- \"Biographies\" feature']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Romance', 'Format': 'Widescreen, Color, NTSC, Closed-captioned, DVD', 'Contributor': 'Darnell Martin, Sean Faris, Andrew Gottlieb, Nadia Dajani, 2011 release new productions 2010 making of behind the scenes features, Jennifer Love Hewitt, Billy Magnussen, Will Chase drama love story sad, Betty White, Meghann FahyDarnell Martin, Sean Faris, Andrew Gottlieb, Nadia Dajani, 2011 release new productions 2010 making of behind the scenes features, Jennifer Love Hewitt, Billy Magnussen, Will Chase drama love story sad, Betty White, Meghann Fahy  See more', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Darnell Martin', 'Media Format': 'Widescreen, Color, NTSC, Closed-captioned, DVD', 'Run time': '1 hour and 36 minutes', 'Actors': 'Jennifer Love Hewitt, Betty White, Sean Faris, Billy Magnussen, Meghann Fahy', 'Subtitles': 'English', 'Producers': 'Andrew Gottlieb', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': 'Hallmark', 'Number of discs': '1'}\nReview Text: Good movie!!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Long, Long Trailer\nReview Date: 2016/04/08\nStore: Vincente Minnelli  (Director),     Lucille Ball  (Actor),     Desi Arnaz  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Product Description', 'Long, Long Trailer, The (DVD)', 'Lucille Ball and Desi Arnaz live slaphappily ever after as newlyweds honeymooning in The Long, Long Trailer, breezily directed by Vincente Minnelli. They quickly find that the interior of a moving trailer is ideal for tossing a Caesar salad – and everything else. That backing up their 40-foot, three-ton home is only a little more difficult than threading a needle wearing boxing gloves. And that trailer-park folks are neighborly sorts who turn the lovebirds’ rig into the wrong, wrong trailer by crashing the wedding night. Costarring comedy pros Marjorie Main and Keenan Wynn (Ball’s frequent costar in her M-G-M days), this smash was filmed at the height of the I Love Lucy craze and is packed with the inventive sight gags and physical humor that made the series a TV landmark. If you like the Trailer, you’re going to love the movie!', ']]>', 'Amazon.com', \"Besides making television history as the producers and stars of television's immensely popular\", 'I Love Lucy', 'and', 'The Lucy-Desi Comedy Hour', \", Lucille Ball and her husband, Desi Arnaz, starred in three quite agreeable feature films. The second of these, 1954's\", 'The Long, Long Trailer', \", in gorgeous Technicolor and directed by Vincente Minnelli, is a somewhat allegorical tale of a newly married couple who invest in a 40-foot trailer as their first home--and immediately regret it. Well, at least Arnaz's character does; he's the one who has anxiety attacks over operating electric brakes while steering up and down one-lane, mountain roads. Sight gags are plentiful: a scene in which Ball tries to make beef stew, a Caesar salad, and cake in a wobbling, moving trailer is classic Lucy. But there are some genuine dramatic sequences in this handsome movie, too, and the stars rise to the occasion.\", '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, Multiple Formats, Closed-captioned, Subtitled, NTSC', 'Contributor': 'Vincente Minnelli, Madge Blake, Keenan Wynn, Perry Sheehan, Oliver Blake, Pandro S. Berman, Frances Goodrich, Bert Freed, Albert Hackett, Marjorie Main, Gladys Hurlbut, Clinton Twiss, Desi Arnaz, Moroni Olsen, Walter Baldwin, Lucille BallVincente Minnelli, Madge Blake, Keenan Wynn, Perry Sheehan, Oliver Blake, Pandro S. Berman, Frances Goodrich, Bert Freed, Albert Hackett, Marjorie Main, Gladys Hurlbut, Clinton Twiss, Desi Arnaz, Moroni Olsen, Walter Baldwin, Lucille Ball  See more', 'Initial release date': '2006-05-02', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.2 inches; 2.4 Ounces', 'Item model number': '2210488', 'Director': 'Vincente Minnelli', 'Media Format': 'Color, Multiple Formats, Closed-captioned, Subtitled, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'May 2, 2006', 'Actors': 'Lucille Ball, Desi Arnaz, Marjorie Main, Keenan Wynn, Gladys Hurlbut', 'Subtitles': 'Spanish, French, English', 'Producers': 'Pandro S. Berman', 'Studio': 'Studio Distribution Services', 'Writers': 'Albert Hackett, Frances Goodrich', 'Number of discs': '1'}\nReview Text: Love this movie!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Supernatural: Season 2\nReview Date: 2016/04/14\nStore: Jared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Product Description', 'Supernatural: The Complete Second Season (DVD)', 'Twenty-two years ago, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force, so their father, John, raised the brothers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America...and he taught them how to kill it. Sam, however, wanted nothing to do with this violent and dangerous life, and he left it behind, until the day Dean appeared on his doorstep with troubling news. Their father had gone missing on a \"hunting trip.\" Sam and Dean have spent the last year cruising the highways of the United States searching for their lost father and encountering creatures that most people believe exist only in folklore, superstition and nightmares. Along the way, they have battled the various supernatural threats--and each other as well, for their sibling rivalries and conflicts were never far from the surface.', ']]>', 'Amazon.com', 'As programs ranging from', 'Kolchak: The Night Stalker', 'to, well,', 'Night Stalker', \"have proven, it's difficult to scare TV audiences on a weekly basis, but\", 'Supernatural', 'seems to broken the trend. Not only has its blend of', 'Route 66', 'and', 'The X-Files', 'provided some of the more chilling TV moments in recent history, but its core story--two brothers, Sam and Dean Winchester (Jensen Ackles and Jared Padalecki) battle the forces of evil to avenge their late mother--has been compelling enough to warrant a second season, which is compiled in its entirety on this six-disc set. Season Two maintains the show\\'s \"Monster of the Week\" approach while adding compelling layers to the main characters and their history; in \"What Is And What Should Never Be,\" a djinn offers the boys a glimpse of how their lives might\\'ve played out had their mother not succumbed to demonic forces, while the two-part \"All Hell Breaks Loose\" brings the season to a close with not only a rift between Sam and Dean, but the gates of Hell swinging open to unleash monstrous spirits. And if that\\'s not enough of a creepshow for you, the boys also encounter a cannibal clown (\"Everybody Loves a Clown\"), seductive demons (\"Crossroad Blues\"), a town gripped by mass psychosis (\"Croatoan\"), as well as a barrage of ghosts, vampires and werewolves. If it\\'s chills you want, the second season of', 'Supernatural', \"has them by the score. There's also a wealth of extras on the\", 'Complete Second Season', 'set that should please longtime fans and help newcomers catch up with developments since the show\\'s debut. Informative and entertaining commentaries are featured on three episodes: \"In My Time of Dying\" (by Ackles and Padalecki), \"What Is And What Never Should Be\" (by series creator Eric Kripke), and \"All Hell Breaks Loose, Part 1\" (by Kripke, writer Sera Gambles, and director Robert Singer). There\\'s also a featurette on \"All Hell Breaks Loose Part 2\" that offers observations by the cast and crew on the season as a whole; viewers should note that the 11-minute short is difficult to find and is accessible only after accessing \"The Devil\\'s Road Map,\" a virtual tour of the places (and monsters) visited throughout the show\\'s history. Padalecki\\'s screen test for the role of Sam is also included, as well as three webisodes about the writers, visual effects and props for the show, and an amusing gag reel.', '-- Paul Gaita']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Contributor': 'Jared Padalecki, Jensen Ackles', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.5 x 1.25 inches; 12 Ounces', 'Media Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Run time': '15 hours and 3 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Jared Padalecki, Jensen Ackles', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese', 'Studio': 'WarnerBrothers', 'Number of discs': '6'}\nReview Text: love the series\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: WILD\nReview Date: 2019/11/17\nStore: Reese Witherspoon  (Actor),     Laura Dern  (Actor),     Jean-Marc Vallee  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Academy Award Winner Reese Witherspoon stars in this inspirational true story from the director of Dallas Buyers Club and based on the best-selling book by Cheryl Strayed. After years of reckless behavior and being haunted by memories of her mother Bobbi (Academy Award Nominee Laura Dern), Cheryl (Witherspoon) makes a rash decision to embark on a challenging trek across the Pacific Crest Trail. With absolutely no experience, she sets out to hike more than a thousand miles all on her own - in what becomes a remarkable journey of self-discovery and redemption that strengthens and ultimately heals her.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffmann, Keene McRae, Mo McRae, Leigh Parker, Ted De Chatelet, Laura DernKevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffm…  See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2297160', 'Director': 'Jean-Marc Vallee', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'March 31, 2015', 'Actors': 'Reese Witherspoon, Laura Dern, Thomas Sadoski, Michiel Huisman, Gaby Hoffmann', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Nick Hornby', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: liked this movie\nReview Title: movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Emily Brontë's Wuthering Heights\nReview Date: 2019/11/17\nStore: Juliette Binoche  (Actor),     Ralph Fiennes  (Actor),     Peter Kosminsky  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'AC-3, Dolby, Subtitled, Widescreen, NTSC', 'Contributor': 'Sophie Ward, Simon Ward, Janet McTeer, Simon Shepherd, Peter Kosminsky, Paul Geoffrey, Juliette Binoche, Ralph Fiennes, Robert Demeger, Jeremy Northam, Jason RiddingtonSophie Ward, Simon Ward, Janet McTeer, Simon Shepherd, Peter Kosminsky, Paul Geoffrey, Juliette Binoche, Ralph Fiennes, Robert Demeger, Jeremy Northam, Jason Riddington   See more', 'Language': 'English', 'Runtime': '106 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.59 Ounces', 'Item model number': 'D59191719D', 'Director': 'Peter Kosminsky', 'Media Format': 'AC-3, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '106 minutes', 'Release date': 'October 10, 2017', 'Actors': 'Juliette Binoche, Ralph Fiennes, Janet McTeer, Sophie Ward, Simon Shepherd', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: liked it\nReview Title: movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Last of the Dogmen\nReview Date: 2019/11/17\nStore: Tom Berenger  (Actor),     Barbara Hershey  (Actor),     Tab Murphy  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['A mountain man goes on a routine manhunt and finds himself embroiled in solving a supernatural mystery in this fantasy/adventure, The tale is set in the wilds of Montana, Lewis Gates is a heavy-drinking tracker who is called to sober up and hit the backcountry to find three murderous fugitives from the local prison, For him it is a routine assignment, But then a strange thing happens, He is almost upon their camp when he hears several whoops and shouts, He goes to the site, but finds nothing but blood, a lone arrow, and a brief sight of someone fleeing on horseback, He travels back to town and tells his story, but no one believes him, least of all the sheriff whose late daughter had been married to the mountain man before she drowned - something the sheriff still blames the tracker for, But Gates is by then obsessed with solving the mystery and so forces himself into the library to do a little research, He soon learns that over the years 17 such unsolved mysteries have occurred and that in 1935 authorities brought to jail a naked Indian boy found running along the railroad tracks, They locked him in jail, but the boy somehow escaped and disappeared, The tracker enlists the aide of a female anthropologist who explains that over a century ago Cheyenne dog soldiers had lived in the area until the Europeans slaughtered them, The two travel deep into the wilderness and at last discover a strange waterfall, Behind it lies an ancient Cheyenne village, a peaceful place much like the Shangri-La of adventure-fantasy movies past. Note : The wide screen would not fit an entire screen.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Import', 'Contributor': 'Gregory Scott Cummins, Steve Reevis, Barbara Hershey, Kurtwood Smith, Wilford Brimley, Mark Boone Junior, Helen Calahasen, Andrew Miller, Eugene Blackbear, Tom Berenger, Tab MurphyGregory Scott Cummins, Steve Reevis, Barbara Hershey, Kurtwood Smith, Wilford Brimley, Mark Boone Junior, Helen Calahasen, Andrew Miller, Eugene Blackbear, Tom Berenger, Tab Murphy  See more', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Runtime': '118 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.35 x 7.56 x 0.67 inches; 2.82 Ounces', 'Director': 'Tab Murphy', 'Media Format': 'Import', 'Run time': '118 minutes', 'Release date': 'July 22, 2014', 'Actors': 'Tom Berenger, Barbara Hershey, Kurtwood Smith, Steve Reevis, Andrew Miller', 'Subtitles': 'English, Spanish, French', 'Studio': 'La Entertainment', 'Number of discs': '1'}\nReview Text: good movie\nReview Title: movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Into The Wild\nReview Date: 2020/08/24\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Into The Wild (DVD)', 'This is the true story of Christopher McCandless (Emile Hirsch). Freshly graduated from college with a promising future ahead, McCan dless inste ad walked out of his privileged life and into the wild in search of adve nture. What happened to him on the way transforme d this young wanderer into an enduring symbol for countless people -- a fearless risk-taker wh o wrestled with the precarious balance between man and nature.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '10529206', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 29 minutes', 'Release date': 'March 4, 2008', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Kind of boring\nReview Title: Book\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Island of the Blue Dolphins DVD 1964 Celia Milius\nReview Date: 2020/08/24\nStore: Format: Kitchen\nCategories: Movies & TV, Movies\nProduct Description: ['Title: Island of the Blue Dolphins Release Year: 1964 Director: James B. Clark Starring: Celia Milius, Larry Domasin, Ann Daniel Format: DVD Region: Region 1 Video Format: NTSC (USA) Language: English Storyline: Karana is a young native girl who is forced to flee the island of her birth with the rest of her tribe when white hunters threaten the area. Realizing her young brother has been left behind, she jumps ships and swims back. The two remain on the island and endure solitude for nearly 20 years. She learns to hunt and fish, make a home and domesticate a wild dog, although her brother is not so resourceful and falls victim to a pack of wild animals. Distrustful, she passes up a chance to be rescued when another group of white hunters arrives on the island. Years later, after her loyal canine companion has died, she goes with hunters, bringing her collection of pets along for the ride.']\nAverage Rating: 5.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.31 x 0.59 inches; 0.01 Ounces', 'Media Format': 'DVD'}\nReview Text: One of my favorite movies!  Glad I could finally get it on DVD\nReview Title: DVD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night in Rodanthe\nReview Date: 2020/08/24\nCategories: Prime Video, Prime Video, TV\nAverage Rating: 4.5\nProduct Details: {'Language': 'English', 'Item Weight': '3.2 ounces'}\nReview Text: Good\nReview Title: Book\nRating: 5.0\n--------------------------------------------------",
  "reference": "Magic of Belle Isle\nMorgan Freeman  (Actor),     Virginia Madsen  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Reuniting with director Rob Reiner from the hit film, THE BUCKET LIST, Freeman plays Monte Wildhorn, a famous Western novelist whose struggle with alcoholism has sapped his passion for writing. He takes a lakeside cabin for the summer in picturesque Belle Isle, and befriends the family next door-an attractive single mom (Madsen) and her young daughters-who help him find inspiration again.']\n{'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Morgan Freeman, Virginia Madsen, Rob Reiner', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '262098', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'September 18, 2012', 'Actors': 'Morgan Freeman, Virginia Madsen', 'Subtitles': 'Spanish', 'Studio': 'Magnolia Home Ent', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie!!! Hated to see it end!!!\nFive Stars\nHachi: A Dog's Tale\nRichard Gere  (Actor),     Joan Allen  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"From Academy Award®-nominated director Lasse Hallström (2000, The Cider House Rules) comes HACHI: A DOG’S TALE, a film based on one of the most treasured and heartwarming true stories ever told. Golden Globe winner Richard Gere (2002, Best Actor in a Musical or Comedy, Chicago) stars as Professor Parker Wilson, a distinguished scholar who discovers a lost Akita puppy on his way home from work. Despite initial objections from Wilson’s wife, Cate (Academy Award® nominee Joan Allen – 2000, Best Actress, The Contender), Hachi endears himself into the Wilson family and grows to be Parker's loyal companion. As their bond grows deeper, a beautiful relationship unfolds embodying the true spirit of family and loyalty, while inspiring the hearts of an entire town.\", 'Amazon.com', 'Based on a true story from Japan,', \"Hachi: A Dog's Tale\", \"is a moving film about loyalty and the rare, invincible bonds that occasionally form almost instantaneously in the most unlikely places. College professor Parker Wilson (Richard Gere) finds a young Akita puppy that's been abandoned at the local train station, and he's instantly captivated by the dog. Assuming the dog's owner will return to the train station to claim him in the morning, Parker takes the puppy home overnight. But when no one comes to get the dog, Parker convinces his wife, Cate (Joan Allen), to welcome him as part of the family. He dubs the puppy Hachiko--Hachi, for short--because of the Japanese symbol for good luck that's hanging from his collar. Hachi is a somewhat peculiar dog that refuses to learn to fetch or master other people-pleasing tricks, but he is a faithful companion and friend to Parker, alerting him of potential dangers and accompanying him to the train station each morning and meeting him there after his return trip each evening. An unforeseen event will continually test Hachi's devotion. This film is neither overwrought nor sappy; it is heartfelt and immensely powerful despite its tendency to drag in a few places. Prepare to be moved to tears by this beautiful, seemingly simple film--it's about so much more than just the relationship between a man and his dog.\", '--Tami Horiuchi']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '043396321403', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 9, 2010', 'Actors': 'Richard Gere, Joan Allen', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie!!!\nFive Stars\nThe Lost Valentine (Hallmark Hall of Fame)\nJennifer Love Hewitt  (Actor),     Betty White  (Actor),     Darnell Martin  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"During World War II, Navy Lt. Neil Thomas bids his pregnant young wife, Caroline, farewell at Union Station. But even before their son is born, Neil's plane goes down in the Pacific and he's declared missing in action. Caroline is devastated. Neil was Caroline's one great love... and for the next 65 years Caroline (Betty White) returns to Union Station on the anniversary of the day they said goodbye forever (Valentine's Day), to salute the memory of her brave and beloved husband. Eventually, a TV journalist (Jennifer Love Hewitt) learns of the touching story and sets out to investigate just what happened to Neil during the war. Neil and Caroline's grandson encourages his initially-reluctant grandmother to cooperate; the TV reporter and the grandson fall in love themselves.\", 'Special Features:', '- \"The Making of', 'The Lost Valentine', '\" feature', '- \"Conversations\" feature', '- \"About the Production\" feature', '- \"Cast & Credits\" feature', '- \"Biographies\" feature']\n{'Genre': 'Romance', 'Format': 'Widescreen, Color, NTSC, Closed-captioned, DVD', 'Contributor': 'Darnell Martin, Sean Faris, Andrew Gottlieb, Nadia Dajani, 2011 release new productions 2010 making of behind the scenes features, Jennifer Love Hewitt, Billy Magnussen, Will Chase drama love story sad, Betty White, Meghann FahyDarnell Martin, Sean Faris, Andrew Gottlieb, Nadia Dajani, 2011 release new productions 2010 making of behind the scenes features, Jennifer Love Hewitt, Billy Magnussen, Will Chase drama love story sad, Betty White, Meghann Fahy  See more', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Darnell Martin', 'Media Format': 'Widescreen, Color, NTSC, Closed-captioned, DVD', 'Run time': '1 hour and 36 minutes', 'Actors': 'Jennifer Love Hewitt, Betty White, Sean Faris, Billy Magnussen, Meghann Fahy', 'Subtitles': 'English', 'Producers': 'Andrew Gottlieb', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': 'Hallmark', 'Number of discs': '1'}\nGood movie!!!\nFive Stars\nThe Long, Long Trailer\nVincente Minnelli  (Director),     Lucille Ball  (Actor),     Desi Arnaz  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Product Description', 'Long, Long Trailer, The (DVD)', 'Lucille Ball and Desi Arnaz live slaphappily ever after as newlyweds honeymooning in The Long, Long Trailer, breezily directed by Vincente Minnelli. They quickly find that the interior of a moving trailer is ideal for tossing a Caesar salad – and everything else. That backing up their 40-foot, three-ton home is only a little more difficult than threading a needle wearing boxing gloves. And that trailer-park folks are neighborly sorts who turn the lovebirds’ rig into the wrong, wrong trailer by crashing the wedding night. Costarring comedy pros Marjorie Main and Keenan Wynn (Ball’s frequent costar in her M-G-M days), this smash was filmed at the height of the I Love Lucy craze and is packed with the inventive sight gags and physical humor that made the series a TV landmark. If you like the Trailer, you’re going to love the movie!', ']]>', 'Amazon.com', \"Besides making television history as the producers and stars of television's immensely popular\", 'I Love Lucy', 'and', 'The Lucy-Desi Comedy Hour', \", Lucille Ball and her husband, Desi Arnaz, starred in three quite agreeable feature films. The second of these, 1954's\", 'The Long, Long Trailer', \", in gorgeous Technicolor and directed by Vincente Minnelli, is a somewhat allegorical tale of a newly married couple who invest in a 40-foot trailer as their first home--and immediately regret it. Well, at least Arnaz's character does; he's the one who has anxiety attacks over operating electric brakes while steering up and down one-lane, mountain roads. Sight gags are plentiful: a scene in which Ball tries to make beef stew, a Caesar salad, and cake in a wobbling, moving trailer is classic Lucy. But there are some genuine dramatic sequences in this handsome movie, too, and the stars rise to the occasion.\", '--Tom Keogh']\n{'Genre': 'Comedy', 'Format': 'Color, Multiple Formats, Closed-captioned, Subtitled, NTSC', 'Contributor': 'Vincente Minnelli, Madge Blake, Keenan Wynn, Perry Sheehan, Oliver Blake, Pandro S. Berman, Frances Goodrich, Bert Freed, Albert Hackett, Marjorie Main, Gladys Hurlbut, Clinton Twiss, Desi Arnaz, Moroni Olsen, Walter Baldwin, Lucille BallVincente Minnelli, Madge Blake, Keenan Wynn, Perry Sheehan, Oliver Blake, Pandro S. Berman, Frances Goodrich, Bert Freed, Albert Hackett, Marjorie Main, Gladys Hurlbut, Clinton Twiss, Desi Arnaz, Moroni Olsen, Walter Baldwin, Lucille Ball  See more', 'Initial release date': '2006-05-02', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.2 inches; 2.4 Ounces', 'Item model number': '2210488', 'Director': 'Vincente Minnelli', 'Media Format': 'Color, Multiple Formats, Closed-captioned, Subtitled, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'May 2, 2006', 'Actors': 'Lucille Ball, Desi Arnaz, Marjorie Main, Keenan Wynn, Gladys Hurlbut', 'Subtitles': 'Spanish, French, English', 'Producers': 'Pandro S. Berman', 'Studio': 'Studio Distribution Services', 'Writers': 'Albert Hackett, Frances Goodrich', 'Number of discs': '1'}\nLove this movie!!\nFive Stars\nSupernatural: Season 2\nJared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'Supernatural: The Complete Second Season (DVD)', 'Twenty-two years ago, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force, so their father, John, raised the brothers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America...and he taught them how to kill it. Sam, however, wanted nothing to do with this violent and dangerous life, and he left it behind, until the day Dean appeared on his doorstep with troubling news. Their father had gone missing on a \"hunting trip.\" Sam and Dean have spent the last year cruising the highways of the United States searching for their lost father and encountering creatures that most people believe exist only in folklore, superstition and nightmares. Along the way, they have battled the various supernatural threats--and each other as well, for their sibling rivalries and conflicts were never far from the surface.', ']]>', 'Amazon.com', 'As programs ranging from', 'Kolchak: The Night Stalker', 'to, well,', 'Night Stalker', \"have proven, it's difficult to scare TV audiences on a weekly basis, but\", 'Supernatural', 'seems to broken the trend. Not only has its blend of', 'Route 66', 'and', 'The X-Files', 'provided some of the more chilling TV moments in recent history, but its core story--two brothers, Sam and Dean Winchester (Jensen Ackles and Jared Padalecki) battle the forces of evil to avenge their late mother--has been compelling enough to warrant a second season, which is compiled in its entirety on this six-disc set. Season Two maintains the show\\'s \"Monster of the Week\" approach while adding compelling layers to the main characters and their history; in \"What Is And What Should Never Be,\" a djinn offers the boys a glimpse of how their lives might\\'ve played out had their mother not succumbed to demonic forces, while the two-part \"All Hell Breaks Loose\" brings the season to a close with not only a rift between Sam and Dean, but the gates of Hell swinging open to unleash monstrous spirits. And if that\\'s not enough of a creepshow for you, the boys also encounter a cannibal clown (\"Everybody Loves a Clown\"), seductive demons (\"Crossroad Blues\"), a town gripped by mass psychosis (\"Croatoan\"), as well as a barrage of ghosts, vampires and werewolves. If it\\'s chills you want, the second season of', 'Supernatural', \"has them by the score. There's also a wealth of extras on the\", 'Complete Second Season', 'set that should please longtime fans and help newcomers catch up with developments since the show\\'s debut. Informative and entertaining commentaries are featured on three episodes: \"In My Time of Dying\" (by Ackles and Padalecki), \"What Is And What Never Should Be\" (by series creator Eric Kripke), and \"All Hell Breaks Loose, Part 1\" (by Kripke, writer Sera Gambles, and director Robert Singer). There\\'s also a featurette on \"All Hell Breaks Loose Part 2\" that offers observations by the cast and crew on the season as a whole; viewers should note that the 11-minute short is difficult to find and is accessible only after accessing \"The Devil\\'s Road Map,\" a virtual tour of the places (and monsters) visited throughout the show\\'s history. Padalecki\\'s screen test for the role of Sam is also included, as well as three webisodes about the writers, visual effects and props for the show, and an amusing gag reel.', '-- Paul Gaita']\n{'Genre': 'Science Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Contributor': 'Jared Padalecki, Jensen Ackles', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.5 x 1.25 inches; 12 Ounces', 'Media Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Run time': '15 hours and 3 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Jared Padalecki, Jensen Ackles', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese', 'Studio': 'WarnerBrothers', 'Number of discs': '6'}\nlove the series\nFive Stars\nWILD\nReese Witherspoon  (Actor),     Laura Dern  (Actor),     Jean-Marc Vallee  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Academy Award Winner Reese Witherspoon stars in this inspirational true story from the director of Dallas Buyers Club and based on the best-selling book by Cheryl Strayed. After years of reckless behavior and being haunted by memories of her mother Bobbi (Academy Award Nominee Laura Dern), Cheryl (Witherspoon) makes a rash decision to embark on a challenging trek across the Pacific Crest Trail. With absolutely no experience, she sets out to hike more than a thousand miles all on her own - in what becomes a remarkable journey of self-discovery and redemption that strengthens and ultimately heals her.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffmann, Keene McRae, Mo McRae, Leigh Parker, Ted De Chatelet, Laura DernKevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffm…  See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2297160', 'Director': 'Jean-Marc Vallee', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'March 31, 2015', 'Actors': 'Reese Witherspoon, Laura Dern, Thomas Sadoski, Michiel Huisman, Gaby Hoffmann', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Nick Hornby', 'Country of Origin': 'USA', 'Number of discs': '1'}\nliked this movie\nmovie\nEmily Brontë's Wuthering Heights\nJuliette Binoche  (Actor),     Ralph Fiennes  (Actor),     Peter Kosminsky  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n{'Genre': 'Drama', 'Format': 'AC-3, Dolby, Subtitled, Widescreen, NTSC', 'Contributor': 'Sophie Ward, Simon Ward, Janet McTeer, Simon Shepherd, Peter Kosminsky, Paul Geoffrey, Juliette Binoche, Ralph Fiennes, Robert Demeger, Jeremy Northam, Jason RiddingtonSophie Ward, Simon Ward, Janet McTeer, Simon Shepherd, Peter Kosminsky, Paul Geoffrey, Juliette Binoche, Ralph Fiennes, Robert Demeger, Jeremy Northam, Jason Riddington   See more', 'Language': 'English', 'Runtime': '106 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.59 Ounces', 'Item model number': 'D59191719D', 'Director': 'Peter Kosminsky', 'Media Format': 'AC-3, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '106 minutes', 'Release date': 'October 10, 2017', 'Actors': 'Juliette Binoche, Ralph Fiennes, Janet McTeer, Sophie Ward, Simon Shepherd', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nliked it\nmovie\nLast of the Dogmen\nTom Berenger  (Actor),     Barbara Hershey  (Actor),     Tab Murphy  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['A mountain man goes on a routine manhunt and finds himself embroiled in solving a supernatural mystery in this fantasy/adventure, The tale is set in the wilds of Montana, Lewis Gates is a heavy-drinking tracker who is called to sober up and hit the backcountry to find three murderous fugitives from the local prison, For him it is a routine assignment, But then a strange thing happens, He is almost upon their camp when he hears several whoops and shouts, He goes to the site, but finds nothing but blood, a lone arrow, and a brief sight of someone fleeing on horseback, He travels back to town and tells his story, but no one believes him, least of all the sheriff whose late daughter had been married to the mountain man before she drowned - something the sheriff still blames the tracker for, But Gates is by then obsessed with solving the mystery and so forces himself into the library to do a little research, He soon learns that over the years 17 such unsolved mysteries have occurred and that in 1935 authorities brought to jail a naked Indian boy found running along the railroad tracks, They locked him in jail, but the boy somehow escaped and disappeared, The tracker enlists the aide of a female anthropologist who explains that over a century ago Cheyenne dog soldiers had lived in the area until the Europeans slaughtered them, The two travel deep into the wilderness and at last discover a strange waterfall, Behind it lies an ancient Cheyenne village, a peaceful place much like the Shangri-La of adventure-fantasy movies past. Note : The wide screen would not fit an entire screen.']\n{'Genre': 'Action & Adventure', 'Format': 'Import', 'Contributor': 'Gregory Scott Cummins, Steve Reevis, Barbara Hershey, Kurtwood Smith, Wilford Brimley, Mark Boone Junior, Helen Calahasen, Andrew Miller, Eugene Blackbear, Tom Berenger, Tab MurphyGregory Scott Cummins, Steve Reevis, Barbara Hershey, Kurtwood Smith, Wilford Brimley, Mark Boone Junior, Helen Calahasen, Andrew Miller, Eugene Blackbear, Tom Berenger, Tab Murphy  See more', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Runtime': '118 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.35 x 7.56 x 0.67 inches; 2.82 Ounces', 'Director': 'Tab Murphy', 'Media Format': 'Import', 'Run time': '118 minutes', 'Release date': 'July 22, 2014', 'Actors': 'Tom Berenger, Barbara Hershey, Kurtwood Smith, Steve Reevis, Andrew Miller', 'Subtitles': 'English, Spanish, French', 'Studio': 'La Entertainment', 'Number of discs': '1'}\ngood movie\nmovie\nInto The Wild\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Into The Wild (DVD)', 'This is the true story of Christopher McCandless (Emile Hirsch). Freshly graduated from college with a promising future ahead, McCan dless inste ad walked out of his privileged life and into the wild in search of adve nture. What happened to him on the way transforme d this young wanderer into an enduring symbol for countless people -- a fearless risk-taker wh o wrestled with the precarious balance between man and nature.', ']]>']\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '10529206', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 29 minutes', 'Release date': 'March 4, 2008', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nKind of boring\nBook\nIsland of the Blue Dolphins DVD 1964 Celia Milius\nFormat: Kitchen\nMovies & TV, Movies\n['Title: Island of the Blue Dolphins Release Year: 1964 Director: James B. Clark Starring: Celia Milius, Larry Domasin, Ann Daniel Format: DVD Region: Region 1 Video Format: NTSC (USA) Language: English Storyline: Karana is a young native girl who is forced to flee the island of her birth with the rest of her tribe when white hunters threaten the area. Realizing her young brother has been left behind, she jumps ships and swims back. The two remain on the island and endure solitude for nearly 20 years. She learns to hunt and fish, make a home and domesticate a wild dog, although her brother is not so resourceful and falls victim to a pack of wild animals. Distrustful, she passes up a chance to be rescued when another group of white hunters arrives on the island. Years later, after her loyal canine companion has died, she goes with hunters, bringing her collection of pets along for the ride.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.31 x 0.59 inches; 0.01 Ounces', 'Media Format': 'DVD'}\nOne of my favorite movies!  Glad I could finally get it on DVD\nDVD\nNight in Rodanthe\nPrime Video, Prime Video, TV\n{'Language': 'English', 'Item Weight': '3.2 ounces'}\nGood\nBook",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Magic of Belle Isle\nReview Date: 2016/04/08\nStore: Morgan Freeman  (Actor),     Virginia Madsen  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Reuniting with director Rob Reiner from the hit film, THE BUCKET LIST, Freeman plays Monte Wildhorn, a famous Western novelist whose struggle with alcoholism has sapped his passion for writing. He takes a lakeside cabin for the summer in picturesque Belle Isle, and befriends the family next door-an attractive single mom (Madsen) and her young daughters-who help him find inspiration again.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Morgan Freeman, Virginia Madsen, Rob Reiner', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '262098', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'September 18, 2012', 'Actors': 'Morgan Freeman, Virginia Madsen', 'Subtitles': 'Spanish', 'Studio': 'Magnolia Home Ent', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie!!! Hated to see it end!!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hachi: A Dog's Tale\nReview Date: 2016/04/08\nStore: Richard Gere  (Actor),     Joan Allen  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"From Academy Award®-nominated director Lasse Hallström (2000, The Cider House Rules) comes HACHI: A DOG’S TALE, a film based on one of the most treasured and heartwarming true stories ever told. Golden Globe winner Richard Gere (2002, Best Actor in a Musical or Comedy, Chicago) stars as Professor Parker Wilson, a distinguished scholar who discovers a lost Akita puppy on his way home from work. Despite initial objections from Wilson’s wife, Cate (Academy Award® nominee Joan Allen – 2000, Best Actress, The Contender), Hachi endears himself into the Wilson family and grows to be Parker's loyal companion. As their bond grows deeper, a beautiful relationship unfolds embodying the true spirit of family and loyalty, while inspiring the hearts of an entire town.\", 'Amazon.com', 'Based on a true story from Japan,', \"Hachi: A Dog's Tale\", \"is a moving film about loyalty and the rare, invincible bonds that occasionally form almost instantaneously in the most unlikely places. College professor Parker Wilson (Richard Gere) finds a young Akita puppy that's been abandoned at the local train station, and he's instantly captivated by the dog. Assuming the dog's owner will return to the train station to claim him in the morning, Parker takes the puppy home overnight. But when no one comes to get the dog, Parker convinces his wife, Cate (Joan Allen), to welcome him as part of the family. He dubs the puppy Hachiko--Hachi, for short--because of the Japanese symbol for good luck that's hanging from his collar. Hachi is a somewhat peculiar dog that refuses to learn to fetch or master other people-pleasing tricks, but he is a faithful companion and friend to Parker, alerting him of potential dangers and accompanying him to the train station each morning and meeting him there after his return trip each evening. An unforeseen event will continually test Hachi's devotion. This film is neither overwrought nor sappy; it is heartfelt and immensely powerful despite its tendency to drag in a few places. Prepare to be moved to tears by this beautiful, seemingly simple film--it's about so much more than just the relationship between a man and his dog.\", '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '043396321403', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 9, 2010', 'Actors': 'Richard Gere, Joan Allen', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie!!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Lost Valentine (Hallmark Hall of Fame)\nReview Date: 2016/04/08\nStore: Jennifer Love Hewitt  (Actor),     Betty White  (Actor),     Darnell Martin  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"During World War II, Navy Lt. Neil Thomas bids his pregnant young wife, Caroline, farewell at Union Station. But even before their son is born, Neil's plane goes down in the Pacific and he's declared missing in action. Caroline is devastated. Neil was Caroline's one great love... and for the next 65 years Caroline (Betty White) returns to Union Station on the anniversary of the day they said goodbye forever (Valentine's Day), to salute the memory of her brave and beloved husband. Eventually, a TV journalist (Jennifer Love Hewitt) learns of the touching story and sets out to investigate just what happened to Neil during the war. Neil and Caroline's grandson encourages his initially-reluctant grandmother to cooperate; the TV reporter and the grandson fall in love themselves.\", 'Special Features:', '- \"The Making of', 'The Lost Valentine', '\" feature', '- \"Conversations\" feature', '- \"About the Production\" feature', '- \"Cast & Credits\" feature', '- \"Biographies\" feature']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Romance', 'Format': 'Widescreen, Color, NTSC, Closed-captioned, DVD', 'Contributor': 'Darnell Martin, Sean Faris, Andrew Gottlieb, Nadia Dajani, 2011 release new productions 2010 making of behind the scenes features, Jennifer Love Hewitt, Billy Magnussen, Will Chase drama love story sad, Betty White, Meghann FahyDarnell Martin, Sean Faris, Andrew Gottlieb, Nadia Dajani, 2011 release new productions 2010 making of behind the scenes features, Jennifer Love Hewitt, Billy Magnussen, Will Chase drama love story sad, Betty White, Meghann Fahy  See more', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Darnell Martin', 'Media Format': 'Widescreen, Color, NTSC, Closed-captioned, DVD', 'Run time': '1 hour and 36 minutes', 'Actors': 'Jennifer Love Hewitt, Betty White, Sean Faris, Billy Magnussen, Meghann Fahy', 'Subtitles': 'English', 'Producers': 'Andrew Gottlieb', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': 'Hallmark', 'Number of discs': '1'}\nReview Text: Good movie!!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Long, Long Trailer\nReview Date: 2016/04/08\nStore: Vincente Minnelli  (Director),     Lucille Ball  (Actor),     Desi Arnaz  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Product Description', 'Long, Long Trailer, The (DVD)', 'Lucille Ball and Desi Arnaz live slaphappily ever after as newlyweds honeymooning in The Long, Long Trailer, breezily directed by Vincente Minnelli. They quickly find that the interior of a moving trailer is ideal for tossing a Caesar salad – and everything else. That backing up their 40-foot, three-ton home is only a little more difficult than threading a needle wearing boxing gloves. And that trailer-park folks are neighborly sorts who turn the lovebirds’ rig into the wrong, wrong trailer by crashing the wedding night. Costarring comedy pros Marjorie Main and Keenan Wynn (Ball’s frequent costar in her M-G-M days), this smash was filmed at the height of the I Love Lucy craze and is packed with the inventive sight gags and physical humor that made the series a TV landmark. If you like the Trailer, you’re going to love the movie!', ']]>', 'Amazon.com', \"Besides making television history as the producers and stars of television's immensely popular\", 'I Love Lucy', 'and', 'The Lucy-Desi Comedy Hour', \", Lucille Ball and her husband, Desi Arnaz, starred in three quite agreeable feature films. The second of these, 1954's\", 'The Long, Long Trailer', \", in gorgeous Technicolor and directed by Vincente Minnelli, is a somewhat allegorical tale of a newly married couple who invest in a 40-foot trailer as their first home--and immediately regret it. Well, at least Arnaz's character does; he's the one who has anxiety attacks over operating electric brakes while steering up and down one-lane, mountain roads. Sight gags are plentiful: a scene in which Ball tries to make beef stew, a Caesar salad, and cake in a wobbling, moving trailer is classic Lucy. But there are some genuine dramatic sequences in this handsome movie, too, and the stars rise to the occasion.\", '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, Multiple Formats, Closed-captioned, Subtitled, NTSC', 'Contributor': 'Vincente Minnelli, Madge Blake, Keenan Wynn, Perry Sheehan, Oliver Blake, Pandro S. Berman, Frances Goodrich, Bert Freed, Albert Hackett, Marjorie Main, Gladys Hurlbut, Clinton Twiss, Desi Arnaz, Moroni Olsen, Walter Baldwin, Lucille BallVincente Minnelli, Madge Blake, Keenan Wynn, Perry Sheehan, Oliver Blake, Pandro S. Berman, Frances Goodrich, Bert Freed, Albert Hackett, Marjorie Main, Gladys Hurlbut, Clinton Twiss, Desi Arnaz, Moroni Olsen, Walter Baldwin, Lucille Ball  See more', 'Initial release date': '2006-05-02', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.2 inches; 2.4 Ounces', 'Item model number': '2210488', 'Director': 'Vincente Minnelli', 'Media Format': 'Color, Multiple Formats, Closed-captioned, Subtitled, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'May 2, 2006', 'Actors': 'Lucille Ball, Desi Arnaz, Marjorie Main, Keenan Wynn, Gladys Hurlbut', 'Subtitles': 'Spanish, French, English', 'Producers': 'Pandro S. Berman', 'Studio': 'Studio Distribution Services', 'Writers': 'Albert Hackett, Frances Goodrich', 'Number of discs': '1'}\nReview Text: Love this movie!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Supernatural: Season 2\nReview Date: 2016/04/14\nStore: Jared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Product Description', 'Supernatural: The Complete Second Season (DVD)', 'Twenty-two years ago, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force, so their father, John, raised the brothers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America...and he taught them how to kill it. Sam, however, wanted nothing to do with this violent and dangerous life, and he left it behind, until the day Dean appeared on his doorstep with troubling news. Their father had gone missing on a \"hunting trip.\" Sam and Dean have spent the last year cruising the highways of the United States searching for their lost father and encountering creatures that most people believe exist only in folklore, superstition and nightmares. Along the way, they have battled the various supernatural threats--and each other as well, for their sibling rivalries and conflicts were never far from the surface.', ']]>', 'Amazon.com', 'As programs ranging from', 'Kolchak: The Night Stalker', 'to, well,', 'Night Stalker', \"have proven, it's difficult to scare TV audiences on a weekly basis, but\", 'Supernatural', 'seems to broken the trend. Not only has its blend of', 'Route 66', 'and', 'The X-Files', 'provided some of the more chilling TV moments in recent history, but its core story--two brothers, Sam and Dean Winchester (Jensen Ackles and Jared Padalecki) battle the forces of evil to avenge their late mother--has been compelling enough to warrant a second season, which is compiled in its entirety on this six-disc set. Season Two maintains the show\\'s \"Monster of the Week\" approach while adding compelling layers to the main characters and their history; in \"What Is And What Should Never Be,\" a djinn offers the boys a glimpse of how their lives might\\'ve played out had their mother not succumbed to demonic forces, while the two-part \"All Hell Breaks Loose\" brings the season to a close with not only a rift between Sam and Dean, but the gates of Hell swinging open to unleash monstrous spirits. And if that\\'s not enough of a creepshow for you, the boys also encounter a cannibal clown (\"Everybody Loves a Clown\"), seductive demons (\"Crossroad Blues\"), a town gripped by mass psychosis (\"Croatoan\"), as well as a barrage of ghosts, vampires and werewolves. If it\\'s chills you want, the second season of', 'Supernatural', \"has them by the score. There's also a wealth of extras on the\", 'Complete Second Season', 'set that should please longtime fans and help newcomers catch up with developments since the show\\'s debut. Informative and entertaining commentaries are featured on three episodes: \"In My Time of Dying\" (by Ackles and Padalecki), \"What Is And What Never Should Be\" (by series creator Eric Kripke), and \"All Hell Breaks Loose, Part 1\" (by Kripke, writer Sera Gambles, and director Robert Singer). There\\'s also a featurette on \"All Hell Breaks Loose Part 2\" that offers observations by the cast and crew on the season as a whole; viewers should note that the 11-minute short is difficult to find and is accessible only after accessing \"The Devil\\'s Road Map,\" a virtual tour of the places (and monsters) visited throughout the show\\'s history. Padalecki\\'s screen test for the role of Sam is also included, as well as three webisodes about the writers, visual effects and props for the show, and an amusing gag reel.', '-- Paul Gaita']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Contributor': 'Jared Padalecki, Jensen Ackles', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.5 x 1.25 inches; 12 Ounces', 'Media Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Run time': '15 hours and 3 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Jared Padalecki, Jensen Ackles', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese', 'Studio': 'WarnerBrothers', 'Number of discs': '6'}\nReview Text: love the series\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: WILD\nReview Date: 2019/11/17\nStore: Reese Witherspoon  (Actor),     Laura Dern  (Actor),     Jean-Marc Vallee  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Academy Award Winner Reese Witherspoon stars in this inspirational true story from the director of Dallas Buyers Club and based on the best-selling book by Cheryl Strayed. After years of reckless behavior and being haunted by memories of her mother Bobbi (Academy Award Nominee Laura Dern), Cheryl (Witherspoon) makes a rash decision to embark on a challenging trek across the Pacific Crest Trail. With absolutely no experience, she sets out to hike more than a thousand miles all on her own - in what becomes a remarkable journey of self-discovery and redemption that strengthens and ultimately heals her.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffmann, Keene McRae, Mo McRae, Leigh Parker, Ted De Chatelet, Laura DernKevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffm…  See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2297160', 'Director': 'Jean-Marc Vallee', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'March 31, 2015', 'Actors': 'Reese Witherspoon, Laura Dern, Thomas Sadoski, Michiel Huisman, Gaby Hoffmann', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Nick Hornby', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: liked this movie\nReview Title: movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Emily Brontë's Wuthering Heights\nReview Date: 2019/11/17\nStore: Juliette Binoche  (Actor),     Ralph Fiennes  (Actor),     Peter Kosminsky  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'AC-3, Dolby, Subtitled, Widescreen, NTSC', 'Contributor': 'Sophie Ward, Simon Ward, Janet McTeer, Simon Shepherd, Peter Kosminsky, Paul Geoffrey, Juliette Binoche, Ralph Fiennes, Robert Demeger, Jeremy Northam, Jason RiddingtonSophie Ward, Simon Ward, Janet McTeer, Simon Shepherd, Peter Kosminsky, Paul Geoffrey, Juliette Binoche, Ralph Fiennes, Robert Demeger, Jeremy Northam, Jason Riddington   See more', 'Language': 'English', 'Runtime': '106 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.59 Ounces', 'Item model number': 'D59191719D', 'Director': 'Peter Kosminsky', 'Media Format': 'AC-3, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '106 minutes', 'Release date': 'October 10, 2017', 'Actors': 'Juliette Binoche, Ralph Fiennes, Janet McTeer, Sophie Ward, Simon Shepherd', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: liked it\nReview Title: movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Last of the Dogmen\nReview Date: 2019/11/17\nStore: Tom Berenger  (Actor),     Barbara Hershey  (Actor),     Tab Murphy  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['A mountain man goes on a routine manhunt and finds himself embroiled in solving a supernatural mystery in this fantasy/adventure, The tale is set in the wilds of Montana, Lewis Gates is a heavy-drinking tracker who is called to sober up and hit the backcountry to find three murderous fugitives from the local prison, For him it is a routine assignment, But then a strange thing happens, He is almost upon their camp when he hears several whoops and shouts, He goes to the site, but finds nothing but blood, a lone arrow, and a brief sight of someone fleeing on horseback, He travels back to town and tells his story, but no one believes him, least of all the sheriff whose late daughter had been married to the mountain man before she drowned - something the sheriff still blames the tracker for, But Gates is by then obsessed with solving the mystery and so forces himself into the library to do a little research, He soon learns that over the years 17 such unsolved mysteries have occurred and that in 1935 authorities brought to jail a naked Indian boy found running along the railroad tracks, They locked him in jail, but the boy somehow escaped and disappeared, The tracker enlists the aide of a female anthropologist who explains that over a century ago Cheyenne dog soldiers had lived in the area until the Europeans slaughtered them, The two travel deep into the wilderness and at last discover a strange waterfall, Behind it lies an ancient Cheyenne village, a peaceful place much like the Shangri-La of adventure-fantasy movies past. Note : The wide screen would not fit an entire screen.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Import', 'Contributor': 'Gregory Scott Cummins, Steve Reevis, Barbara Hershey, Kurtwood Smith, Wilford Brimley, Mark Boone Junior, Helen Calahasen, Andrew Miller, Eugene Blackbear, Tom Berenger, Tab MurphyGregory Scott Cummins, Steve Reevis, Barbara Hershey, Kurtwood Smith, Wilford Brimley, Mark Boone Junior, Helen Calahasen, Andrew Miller, Eugene Blackbear, Tom Berenger, Tab Murphy  See more', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Runtime': '118 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.35 x 7.56 x 0.67 inches; 2.82 Ounces', 'Director': 'Tab Murphy', 'Media Format': 'Import', 'Run time': '118 minutes', 'Release date': 'July 22, 2014', 'Actors': 'Tom Berenger, Barbara Hershey, Kurtwood Smith, Steve Reevis, Andrew Miller', 'Subtitles': 'English, Spanish, French', 'Studio': 'La Entertainment', 'Number of discs': '1'}\nReview Text: good movie\nReview Title: movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Into The Wild\nReview Date: 2020/08/24\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Into The Wild (DVD)', 'This is the true story of Christopher McCandless (Emile Hirsch). Freshly graduated from college with a promising future ahead, McCan dless inste ad walked out of his privileged life and into the wild in search of adve nture. What happened to him on the way transforme d this young wanderer into an enduring symbol for countless people -- a fearless risk-taker wh o wrestled with the precarious balance between man and nature.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '10529206', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 29 minutes', 'Release date': 'March 4, 2008', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Kind of boring\nReview Title: Book\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Island of the Blue Dolphins DVD 1964 Celia Milius\nReview Date: 2020/08/24\nStore: Format: Kitchen\nCategories: Movies & TV, Movies\nProduct Description: ['Title: Island of the Blue Dolphins Release Year: 1964 Director: James B. Clark Starring: Celia Milius, Larry Domasin, Ann Daniel Format: DVD Region: Region 1 Video Format: NTSC (USA) Language: English Storyline: Karana is a young native girl who is forced to flee the island of her birth with the rest of her tribe when white hunters threaten the area. Realizing her young brother has been left behind, she jumps ships and swims back. The two remain on the island and endure solitude for nearly 20 years. She learns to hunt and fish, make a home and domesticate a wild dog, although her brother is not so resourceful and falls victim to a pack of wild animals. Distrustful, she passes up a chance to be rescued when another group of white hunters arrives on the island. Years later, after her loyal canine companion has died, she goes with hunters, bringing her collection of pets along for the ride.']\nAverage Rating: 5.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.31 x 0.59 inches; 0.01 Ounces', 'Media Format': 'DVD'}\nReview Text: One of my favorite movies!  Glad I could finally get it on DVD\nReview Title: DVD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night in Rodanthe\nReview Date: 2020/08/24\nCategories: Prime Video, Prime Video, TV\nAverage Rating: 4.5\nProduct Details: {'Language': 'English', 'Item Weight': '3.2 ounces'}\nReview Text: Good\nReview Title: Book\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a strong preference for heartfelt dramas, comedies, and films grounded in loyalty, love, and human connection, often featuring renowned actors and directors. Consistently high ratings (mostly 4.8 and above) reflect a genuine appreciation for storytelling that evokes emotional responses. Common themes in purchases include stories centered on relationships (both human and animal), poignant life journeys, and uplifting narratives of redemption or self-discovery.\n\nQuality is a recurring priority, as reflected in the selection of acclaimed films, highlighting a preference for well-produced content with strong acting and direction. All movies received ratings of at least 4.5, showcasing a clear expectation for quality and impactful storytelling.\n\nPrice sensitivity appears minimal, given the range of formats and special edition purchases, suggesting a willingness to invest in meaningful cinematic experiences rather than prioritizing budget constraints. \n\nOverall, key preferences include: emotional and inspiring narratives, high-quality films with strong casts, and diverse genres that range from heartwarming family stories to character-driven dramas. The individual values films that prompt reflection and resonate deeply, indicating a sophisticated taste in cinema.",
  "target_interaction": {
    "rating": 5.0,
    "title": "DVD",
    "text": "Liked",
    "images": [],
    "asin": "B0001NBLVI",
    "parent_asin": "B0001NBLVI",
    "user_id": "AHIUDIC4IOC3TUWC25ISKZZ4W6JA",
    "timestamp": "2020-08-24 21:16:12.733000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Saving Private Ryan (Two-Disc Special Edition)",
    "average_rating": 4.8,
    "rating_number": 477,
    "features": [],
    "description": [
      "Product Description",
      "Tom Hanks, Matt Damon, Edward Burns. An explosive WWII drama in which Private James Ryan becomes the object of a desperate and dangerous rescue mission in war-torn Germany after authorities learn his three other brothers already have been killed in combat. 2 DVDs. 1999/color/169 min/R/widescreen.",
      "Set Contains:",
      "In many ways, the extras from this 2004 version could have been included in the initial 1999 DVD release. Laurent Bouzeraeu, the usual director of Spielberg DVD features, smoothly creates several segments on the making of the film, a refreshing change after Spielberg's other lauded World War II DVD,",
      "Schindler's List",
      ", did not give fans anything on the film's craft. About 90 minutes of new material is here, showing how the famous D-Day invasion was created, the historical facts of the story, and how the actors were trained through an abbreviated \"basic training.\" There are plenty of interview snippets with Spielberg and his cast, but all of them were shot on the film's set; there is no years-later retrospection about the film. Only a new interview, with Oscar-winning sound designer Gary Rydstrom, puts the film in perspective--and hails the arrival of DVD. The same excellent DVD presentation of the film is on this new set; however, a DTS soundtrack can only be found on the",
      "World War II Collection",
      ".",
      "--Doug Thomas"
    ],
    "price": 11.18,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51WHkJtwQWL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51WHkJtwQWL.jpg",
        "variant": "MAIN",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51-egi7C00L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-egi7C00L.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/91K3KkSMBcL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Tom Hanks  (Actor),     Matt Damon  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    R    Format: DVD",
    "categories": [
      "Movies & TV",
      "Paramount Home Entertainment",
      "Action & Adventure"
    ],
    "details": {
      "Genre": "Military & War/World War II",
      "Format": "Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen  See more",
      "Contributor": "Matt Damon, Ted Danson, Robert Rodat, Steven Spielberg, Gary Levinsohn, Paul Giamatti, Giovanni Ribisi, Tom Sizemore, Adam Goldberg, Edward Burns, Dennis Farina, Kevin De La Noy, Allison Lyon Segan, Tom Hanks, Jeremy Davies, Ian Bryce, Barry Pepper, Vin Diesel, Bonnie Curtis, Mark GordonMatt Damon, Ted Danson, Robert Rodat, Steven Spielberg, Gary Levinsohn, Paul Giamatti, Giovanni Ribisi, Tom Sizemore, Adam Goldberg, Edward Burns, Dennis Farina, Kevin De La Noy, Allison Lyon Segan, Tom Hanks, Jeremy Davies, Ian Bryce, Barry Pepper, Vin Diesel, Bo…  See more",
      "Language": "English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 5.1), Unqualified",
      "Runtime": "2 hours and 49 minutes",
      "Aspect Ratio": "1.85:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "5.63 x 7.76 x 0.91 inches; 8 Ounces",
      "Item model number": "3235184",
      "Director": "Steven Spielberg",
      "Media Format": "Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen",
      "Run time": "2 hours and 49 minutes",
      "Release date": "November 2, 1999",
      "Actors": "Tom Hanks, Matt Damon, Tom Sizemore, Edward Burns, Barry Pepper",
      "Dubbed": "English, French",
      "Subtitles": "English, French, Spanish",
      "Producers": "Allison Lyon Segan, Bonnie Curtis, Gary Levinsohn, Ian Bryce, Kevin De La Noy",
      "Studio": "Dreamworks Video",
      "Writers": "Robert Rodat",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}