{
  "user_id": "AGAOC6HMU7ALP6YIG6TEVUPSGHOQ",
  "summary": "=== Purchase Information ===\nProduct Title: The Lion in Winter\nReview Date: 2013/03/06\nStore: Peter O'Toole  (Actor),     Katharine Hepburn  (Actor),     Anthony Harvey  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: [\"Katharine Hepburn, Peter O'Toole. The strong-willed Queen Eleanor of Aquitane fights a battle of wills for England's future against King Henry II in this classic historical drama. 1968/color/134 min/PG/widescreen.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Anamorphic, Color, Multiple Formats, NTSC, Subtitled, Closed-captioned, Widescreen', 'Contributor': \"Katharine Hepburn, Nigel Terry, John Castle, Ella More, James Goldman, Jane Merrow, Peter O'Toole, Anthony Hopkins, O.Z. Whitehead, Fran Stafford, Timothy Dalton, Nigel Stock, Anthony Harvey, Kenneth IvesKatharine Hepburn, Nigel Terry, John Castle, Ella More, James Goldman, Jane Merrow, Peter O'Toole, Anthony Hopkins, O.Z. Whitehead, Fran Stafford, Timothy Dalton, Nigel Stock, Anthony Harvey, Kenneth Ives  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 14 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2221841', 'Director': 'Anthony Harvey', 'Media Format': 'Anamorphic, Color, Multiple Formats, NTSC, Subtitled, Closed-captioned, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 31, 2006', 'Actors': \"Peter O'Toole, Katharine Hepburn, Anthony Hopkins, John Castle, Nigel Terry\", 'Subtitles': 'Spanish, French', 'Studio': '20th Century Fox', 'Writers': 'James Goldman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This film is one of the best combinations of writing and acting to ever be put on film.  The brilliantly written script is brought to life by a truly amazing cast.  Extraordinary performances by Katherine Hepburn and Peter O'Toole as the main leads - and they are supported by a phenomenal supporting cast  It is hard to believe that this is considered Anthony Hopkins film debut.  He brings Richard to vivid life, with all his failings and strengths.  There isn't a weak performance in the bunch.  This is a film that can be watched again and again, since each showing brings even more to discover.  Watching Hepburn and O'Toole go &#34;toe to toe&#34; is an extra special treat.  This is the first and only time they are in a film together and they make the most of every moment.  I promise you, you will not be disappointed in this film.\nReview Title: One of the very best\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Downton Abbey: Season 4\nReview Date: 2014/02/01\nStore: Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nReview Text: Many of the reviews have complained that there was no info on this item about whether it contains the season finale and I also was frustrated about the lack of this info.  I just received the DVD and thought I would make it easier for others to get the answer.  I am very happy to report that this item does contain the season finale, which this year takes place at the families home in London.  So it is the full regular season plus the season finale, which is the UK was shown at Christmas time.  Hope this helps.\nReview Title: YES IT CONTAINS THE SEASON FINALE EPISODE\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sneakers\nReview Date: 2014/05/09\nStore: Robert Redford  (Actor),     Dan Akyroyd  (Actor),     Phil Alden Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Robert Redford leads an all-star cast in one of the most satisfying suspense films! Computer expert Martin Bishop (Redford) heads a team of renegade hackers - including a former CIA employee (Sidney Poitier), a gadgets wizard (Dan Aykroyd), a young genius (River Phoenix) and a blind soundman (David Strathairn) - who are routinely hired to test security systems. But Bishop\\'s past comes back to haunt him when government agents blackmail the \"sneakers\" into carrying out a covert operation: tracking down an elusive black box. Along with his former girlfriend (Mary McDonnell), Bishop\\'s team retrieves the box and makes a stunning discovery - the device can break into any computer system in the world. With factions from all sides willing to kill for the powerful box, Bishop and his team embark on their most dangerous assignment ever in this exhilarating high-tech caper from Phil Alden Robinson (Field of Dreams).Bonus Content:', 'The Making of Sneakers', 'The Making of Sneakers', 'Feature Commentary with Writer/Director Phil Alden Robinson', 'Feature Commentary with Writer/Director Phil Alden Robinson', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseDrama, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': \"Widescreen, Collector's Edition\", 'Contributor': 'Sidney Poitier, Dan Akyroyd, Hanyee, Phil Alden Robinson, Time Winters, Lee Garlington, Jun Asai, Robert Redford, Donal Logue, Ellaraino, Timothy Busfield, River Phoenix, Bodhi Elfman, David Strathairn, Denise Dowse, Ben Kingsley, John Shepard, Eddie Jones, Mary McDonnel, George HearnSidney Poitier, Dan Akyroyd, Hanyee, Phil Alden Robinson, Time Winters, Lee Garlington, Jun Asai, Robert Redford, Donal Logue, Ellaraino, Timothy Busfield, River Phoenix, Bodhi Elfman, David Strathairn, Denise Dowse, Ben Kingsley, John Shepard, Eddie Jones, Mary McDonnel,…  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 6 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.08 Ounces', 'Item model number': '25192330421', 'Director': 'Phil Alden Robinson', 'Media Format': \"Widescreen, Collector's Edition\", 'Run time': '2 hours and 6 minutes', 'Release date': 'December 28, 2004', 'Actors': 'Robert Redford, Dan Akyroyd, Ben Kingsley, Mary McDonnel, River Phoenix', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This film is a real treasure.  Not only is the cast outstanding, they also work brilliantly off each other.  The script is well written with great dialogue for each character.  The story moves along very quickly with many twists and turns.  This film would appeal to a very wide audience.  Great entertainment and even after you know all the answers and surprises you will want to watch it again just to catch all the superb performances.  Can not recommend it highly enough.  You will not be disappointed.  Make sure you get the widescreen edition, so you don't miss anything.\nReview Title: Great Flick\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night at the Museum (Widescreen Edition) [DVD]\nReview Date: 2015/05/29\nStore: Ben Stiller  (Actor),     Dick Van Dyke  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\nProduct Description: ['Product Description', \"Good-hearted dreamer Larry Daley, despite being perpetually down on his luck, thinks he's destined for something big. But even he could never have imagined how big, when he accepts what appears to be a menial job as a graveyard-shift security guard at a museum of natural history. During Larry's watch, extraordinary things begin to occur: Mayans, Roman Gladiators, and cowboys emerge from their diorama to wage epic battles; in his quest for fire, a Neanderthal burns down his own display; Attila the Hun pillages his neighboring exhibits, and a T-Rex reminds everyone why he's history's fiercest predator. Amidst the chaos, the only person Larry can turn to for advice is a wax figure of President Teddy Roosevelt, who helps our hero harness the bedlam, stop a nefarious plot, and save the museum.\", 'Amazon.com', \"An irresistible concept meets computer-generated wonders in Night at the Museum, inspired by a 1993 children's book by Milan Trenc. Ben Stiller stars as Larry Daley, an underachieving inventor waiting for his ship to come in while getting evicted from one apartment after another for lack of funds. Larry's son needs some stability, so the well-meaning ne'er-do-well takes a job as night watchman at New York City's Museum of Natural History. What the soon-to-retire guards (Dick Van Dyke, Mickey Rooney, Bill Cobbs) don't tell him is that an ancient pharaoh's tablet in the museum causes everything on display to come to life at night. Thus, Larry meets representations of Teddy Roosevelt, Attila the Hun, fire-worshipping cavemen, and Roman Empire soldiers, and learns to cope with an excitable T-Rex and man-eating, ancient animals. The film might have left things at that, but an added story element gives Night at the Museum some extra urgency and excitement, especially fo! r kids: Larry becomes responsible for keeping this nightly miracle going and preventing anything in the museum from dying due to exposure to sunrise. Computer effects, as well as wildly imaginative costumes and makeup, help make the film appeal to the 8-year-old in everyone. Director Shawn Levy (The Pink Panther) works with a hugely talented cast, including Robin Williams, Owen Wilson, Ricky Gervais, Carla Gugino, and Steve Coogan. --\", 'Tom Keogh', 'Night at the Museum', 'Extras', 'Ben Stiller on Director Shawn Levy', 'Ricky Gervais on', 'the size of his trailer', 'and', 'eating cheese', '.', 'Beyond', 'Night at the Museum', 'See What DVDs Meant Special Effects to Amazon DVD Editors As Kids', 'More Adventure Films for Kids & Family', 'The Night at the Museum', 'Paperback Book', 'Stills from', 'Night at the Museum']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, DTS Surround Sound, Dubbed, Widescreen, NTSC', 'Contributor': 'Bill Cobbs, Mickey Rooney, Dick Van Dyke, Shawn Levy, Ben Stiller', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (DTS ES), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.25 inches; 0.71 Ounces', 'Item model number': '2241717', 'Director': 'Shawn Levy', 'Media Format': 'Multiple Formats, Color, Dolby, DTS Surround Sound, Dubbed, Widescreen, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'April 24, 2007', 'Actors': 'Ben Stiller, Dick Van Dyke, Mickey Rooney, Bill Cobbs', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Wonderful film and got it for a great price.\nReview Title: Great film - Great Price\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NIGHT AT THE MUSEUM: SECRET OF THE TOMB\nReview Date: 2015/05/29\nStore: Ben Stiller  (Actor),     Robin Williams  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\nProduct Description: [\"If it's laughter you're after, get ready for the most hilarious night ever! Ben Stiller leads an all-star comedy cast, including Robin Williams, Owen Wilson, Rebel Wilson and Ricky Gervais, for one final, fun-filled Night at the Museum. This time, Larry Daley (Stiller) and his heroic friends embark on their greatest adventure yet as they travel to London in order to save the magic that brings the museum exhibits to life!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Rachael Harris, Rami Malek, Michael Handelman, Ricky Gervais, Mickey Rooney, Mizuo Peck, Crystal the Monkey, Owen Wilson, Dick Van Dyke, Shawn Levy, Andrea Martin, David Guion, Ben Stiller, Robin Williams, Matt Frewer, Bill Cobbs, Skyler Gisondo, Dan Stevens, Rebel Wilson, Patrick Gallagher, Ben Kingsley, Steve CooganRachael Harris, Rami Malek, Michael Handelman, Ricky Gervais, Mickey Rooney, Mizuo Peck, Crystal the Monkey, Owen Wilson, Dick Van Dyke, Shawn Levy, Andrea Martin, David Guion, Ben Stiller, Robin Williams, Matt Frewer, Bill Cobbs, Skyler Gisondo, Dan Stevens, Rebel Wil…   See more', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '33569564', 'Director': 'Shawn Levy', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'March 10, 2015', 'Actors': 'Ben Stiller, Robin Williams, Owen Wilson, Steve Coogan, Ricky Gervais', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'David Guion, Michael Handelman', 'Number of discs': '1'}\nReview Text: Great film and I got it for a great price.  Really enjoy this series.\nReview Title: Great Film for a Great Price\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Masterpiece: Downton Abbey Season 6\nReview Date: 2016/01/30\nStore: Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter  (Actor),     .  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Return to Downton Abbey for the sixth and final season to discover the fates of the Crawley family, and the servants who work for them, as they face new challenges and begin forging different paths in a rapidly changing world. Creator Julian Fellowes brings the top PBS drama of all time to its climactic chapter, with the beloved ensemble led by Hugh Bonneville, Michelle Dockery, Elizabeth McGovern, and Maggie Smith.']\nAverage Rating: 4.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': '02578', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '9 hours', 'Release date': 'January 26, 2016', 'Actors': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nReview Text: After receiving this today I am finally able to confirm that it does contain the season finale episode.  Can't wait to watch.\nReview Title: CONTAINS THE SEASON FINALE EPISODE\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Lion in Winter\nPeter O'Toole  (Actor),     Katharine Hepburn  (Actor),     Anthony Harvey  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Katharine Hepburn, Peter O'Toole. The strong-willed Queen Eleanor of Aquitane fights a battle of wills for England's future against King Henry II in this classic historical drama. 1968/color/134 min/PG/widescreen.\"]\n{'Genre': 'Drama', 'Format': 'Anamorphic, Color, Multiple Formats, NTSC, Subtitled, Closed-captioned, Widescreen', 'Contributor': \"Katharine Hepburn, Nigel Terry, John Castle, Ella More, James Goldman, Jane Merrow, Peter O'Toole, Anthony Hopkins, O.Z. Whitehead, Fran Stafford, Timothy Dalton, Nigel Stock, Anthony Harvey, Kenneth IvesKatharine Hepburn, Nigel Terry, John Castle, Ella More, James Goldman, Jane Merrow, Peter O'Toole, Anthony Hopkins, O.Z. Whitehead, Fran Stafford, Timothy Dalton, Nigel Stock, Anthony Harvey, Kenneth Ives  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 14 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2221841', 'Director': 'Anthony Harvey', 'Media Format': 'Anamorphic, Color, Multiple Formats, NTSC, Subtitled, Closed-captioned, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 31, 2006', 'Actors': \"Peter O'Toole, Katharine Hepburn, Anthony Hopkins, John Castle, Nigel Terry\", 'Subtitles': 'Spanish, French', 'Studio': '20th Century Fox', 'Writers': 'James Goldman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis film is one of the best combinations of writing and acting to ever be put on film.  The brilliantly written script is brought to life by a truly amazing cast.  Extraordinary performances by Katherine Hepburn and Peter O'Toole as the main leads - and they are supported by a phenomenal supporting cast  It is hard to believe that this is considered Anthony Hopkins film debut.  He brings Richard to vivid life, with all his failings and strengths.  There isn't a weak performance in the bunch.  This is a film that can be watched again and again, since each showing brings even more to discover.  Watching Hepburn and O'Toole go &#34;toe to toe&#34; is an extra special treat.  This is the first and only time they are in a film together and they make the most of every moment.  I promise you, you will not be disappointed in this film.\nOne of the very best\nDownton Abbey: Season 4\nFormat: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nMany of the reviews have complained that there was no info on this item about whether it contains the season finale and I also was frustrated about the lack of this info.  I just received the DVD and thought I would make it easier for others to get the answer.  I am very happy to report that this item does contain the season finale, which this year takes place at the families home in London.  So it is the full regular season plus the season finale, which is the UK was shown at Christmas time.  Hope this helps.\nYES IT CONTAINS THE SEASON FINALE EPISODE\nSneakers\nRobert Redford  (Actor),     Dan Akyroyd  (Actor),     Phil Alden Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Robert Redford leads an all-star cast in one of the most satisfying suspense films! Computer expert Martin Bishop (Redford) heads a team of renegade hackers - including a former CIA employee (Sidney Poitier), a gadgets wizard (Dan Aykroyd), a young genius (River Phoenix) and a blind soundman (David Strathairn) - who are routinely hired to test security systems. But Bishop\\'s past comes back to haunt him when government agents blackmail the \"sneakers\" into carrying out a covert operation: tracking down an elusive black box. Along with his former girlfriend (Mary McDonnell), Bishop\\'s team retrieves the box and makes a stunning discovery - the device can break into any computer system in the world. With factions from all sides willing to kill for the powerful box, Bishop and his team embark on their most dangerous assignment ever in this exhilarating high-tech caper from Phil Alden Robinson (Field of Dreams).Bonus Content:', 'The Making of Sneakers', 'The Making of Sneakers', 'Feature Commentary with Writer/Director Phil Alden Robinson', 'Feature Commentary with Writer/Director Phil Alden Robinson', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseDrama, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': \"Widescreen, Collector's Edition\", 'Contributor': 'Sidney Poitier, Dan Akyroyd, Hanyee, Phil Alden Robinson, Time Winters, Lee Garlington, Jun Asai, Robert Redford, Donal Logue, Ellaraino, Timothy Busfield, River Phoenix, Bodhi Elfman, David Strathairn, Denise Dowse, Ben Kingsley, John Shepard, Eddie Jones, Mary McDonnel, George HearnSidney Poitier, Dan Akyroyd, Hanyee, Phil Alden Robinson, Time Winters, Lee Garlington, Jun Asai, Robert Redford, Donal Logue, Ellaraino, Timothy Busfield, River Phoenix, Bodhi Elfman, David Strathairn, Denise Dowse, Ben Kingsley, John Shepard, Eddie Jones, Mary McDonnel,…  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 6 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.08 Ounces', 'Item model number': '25192330421', 'Director': 'Phil Alden Robinson', 'Media Format': \"Widescreen, Collector's Edition\", 'Run time': '2 hours and 6 minutes', 'Release date': 'December 28, 2004', 'Actors': 'Robert Redford, Dan Akyroyd, Ben Kingsley, Mary McDonnel, River Phoenix', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nThis film is a real treasure.  Not only is the cast outstanding, they also work brilliantly off each other.  The script is well written with great dialogue for each character.  The story moves along very quickly with many twists and turns.  This film would appeal to a very wide audience.  Great entertainment and even after you know all the answers and surprises you will want to watch it again just to catch all the superb performances.  Can not recommend it highly enough.  You will not be disappointed.  Make sure you get the widescreen edition, so you don't miss anything.\nGreat Flick\nNight at the Museum (Widescreen Edition) [DVD]\nBen Stiller  (Actor),     Dick Van Dyke  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\n['Product Description', \"Good-hearted dreamer Larry Daley, despite being perpetually down on his luck, thinks he's destined for something big. But even he could never have imagined how big, when he accepts what appears to be a menial job as a graveyard-shift security guard at a museum of natural history. During Larry's watch, extraordinary things begin to occur: Mayans, Roman Gladiators, and cowboys emerge from their diorama to wage epic battles; in his quest for fire, a Neanderthal burns down his own display; Attila the Hun pillages his neighboring exhibits, and a T-Rex reminds everyone why he's history's fiercest predator. Amidst the chaos, the only person Larry can turn to for advice is a wax figure of President Teddy Roosevelt, who helps our hero harness the bedlam, stop a nefarious plot, and save the museum.\", 'Amazon.com', \"An irresistible concept meets computer-generated wonders in Night at the Museum, inspired by a 1993 children's book by Milan Trenc. Ben Stiller stars as Larry Daley, an underachieving inventor waiting for his ship to come in while getting evicted from one apartment after another for lack of funds. Larry's son needs some stability, so the well-meaning ne'er-do-well takes a job as night watchman at New York City's Museum of Natural History. What the soon-to-retire guards (Dick Van Dyke, Mickey Rooney, Bill Cobbs) don't tell him is that an ancient pharaoh's tablet in the museum causes everything on display to come to life at night. Thus, Larry meets representations of Teddy Roosevelt, Attila the Hun, fire-worshipping cavemen, and Roman Empire soldiers, and learns to cope with an excitable T-Rex and man-eating, ancient animals. The film might have left things at that, but an added story element gives Night at the Museum some extra urgency and excitement, especially fo! r kids: Larry becomes responsible for keeping this nightly miracle going and preventing anything in the museum from dying due to exposure to sunrise. Computer effects, as well as wildly imaginative costumes and makeup, help make the film appeal to the 8-year-old in everyone. Director Shawn Levy (The Pink Panther) works with a hugely talented cast, including Robin Williams, Owen Wilson, Ricky Gervais, Carla Gugino, and Steve Coogan. --\", 'Tom Keogh', 'Night at the Museum', 'Extras', 'Ben Stiller on Director Shawn Levy', 'Ricky Gervais on', 'the size of his trailer', 'and', 'eating cheese', '.', 'Beyond', 'Night at the Museum', 'See What DVDs Meant Special Effects to Amazon DVD Editors As Kids', 'More Adventure Films for Kids & Family', 'The Night at the Museum', 'Paperback Book', 'Stills from', 'Night at the Museum']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, DTS Surround Sound, Dubbed, Widescreen, NTSC', 'Contributor': 'Bill Cobbs, Mickey Rooney, Dick Van Dyke, Shawn Levy, Ben Stiller', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (DTS ES), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.25 inches; 0.71 Ounces', 'Item model number': '2241717', 'Director': 'Shawn Levy', 'Media Format': 'Multiple Formats, Color, Dolby, DTS Surround Sound, Dubbed, Widescreen, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'April 24, 2007', 'Actors': 'Ben Stiller, Dick Van Dyke, Mickey Rooney, Bill Cobbs', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWonderful film and got it for a great price.\nGreat film - Great Price\nNIGHT AT THE MUSEUM: SECRET OF THE TOMB\nBen Stiller  (Actor),     Robin Williams  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\n[\"If it's laughter you're after, get ready for the most hilarious night ever! Ben Stiller leads an all-star comedy cast, including Robin Williams, Owen Wilson, Rebel Wilson and Ricky Gervais, for one final, fun-filled Night at the Museum. This time, Larry Daley (Stiller) and his heroic friends embark on their greatest adventure yet as they travel to London in order to save the magic that brings the museum exhibits to life!\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Rachael Harris, Rami Malek, Michael Handelman, Ricky Gervais, Mickey Rooney, Mizuo Peck, Crystal the Monkey, Owen Wilson, Dick Van Dyke, Shawn Levy, Andrea Martin, David Guion, Ben Stiller, Robin Williams, Matt Frewer, Bill Cobbs, Skyler Gisondo, Dan Stevens, Rebel Wilson, Patrick Gallagher, Ben Kingsley, Steve CooganRachael Harris, Rami Malek, Michael Handelman, Ricky Gervais, Mickey Rooney, Mizuo Peck, Crystal the Monkey, Owen Wilson, Dick Van Dyke, Shawn Levy, Andrea Martin, David Guion, Ben Stiller, Robin Williams, Matt Frewer, Bill Cobbs, Skyler Gisondo, Dan Stevens, Rebel Wil…   See more', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '33569564', 'Director': 'Shawn Levy', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'March 10, 2015', 'Actors': 'Ben Stiller, Robin Williams, Owen Wilson, Steve Coogan, Ricky Gervais', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'David Guion, Michael Handelman', 'Number of discs': '1'}\nGreat film and I got it for a great price.  Really enjoy this series.\nGreat Film for a Great Price\nMasterpiece: Downton Abbey Season 6\nHugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter  (Actor),     .  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Return to Downton Abbey for the sixth and final season to discover the fates of the Crawley family, and the servants who work for them, as they face new challenges and begin forging different paths in a rapidly changing world. Creator Julian Fellowes brings the top PBS drama of all time to its climactic chapter, with the beloved ensemble led by Hugh Bonneville, Michelle Dockery, Elizabeth McGovern, and Maggie Smith.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': '02578', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '9 hours', 'Release date': 'January 26, 2016', 'Actors': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nAfter receiving this today I am finally able to confirm that it does contain the season finale episode.  Can't wait to watch.\nCONTAINS THE SEASON FINALE EPISODE",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: The Lion in Winter\nReview Date: 2013/03/06\nStore: Peter O'Toole  (Actor),     Katharine Hepburn  (Actor),     Anthony Harvey  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: [\"Katharine Hepburn, Peter O'Toole. The strong-willed Queen Eleanor of Aquitane fights a battle of wills for England's future against King Henry II in this classic historical drama. 1968/color/134 min/PG/widescreen.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Anamorphic, Color, Multiple Formats, NTSC, Subtitled, Closed-captioned, Widescreen', 'Contributor': \"Katharine Hepburn, Nigel Terry, John Castle, Ella More, James Goldman, Jane Merrow, Peter O'Toole, Anthony Hopkins, O.Z. Whitehead, Fran Stafford, Timothy Dalton, Nigel Stock, Anthony Harvey, Kenneth IvesKatharine Hepburn, Nigel Terry, John Castle, Ella More, James Goldman, Jane Merrow, Peter O'Toole, Anthony Hopkins, O.Z. Whitehead, Fran Stafford, Timothy Dalton, Nigel Stock, Anthony Harvey, Kenneth Ives  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 14 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2221841', 'Director': 'Anthony Harvey', 'Media Format': 'Anamorphic, Color, Multiple Formats, NTSC, Subtitled, Closed-captioned, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 31, 2006', 'Actors': \"Peter O'Toole, Katharine Hepburn, Anthony Hopkins, John Castle, Nigel Terry\", 'Subtitles': 'Spanish, French', 'Studio': '20th Century Fox', 'Writers': 'James Goldman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This film is one of the best combinations of writing and acting to ever be put on film.  The brilliantly written script is brought to life by a truly amazing cast.  Extraordinary performances by Katherine Hepburn and Peter O'Toole as the main leads - and they are supported by a phenomenal supporting cast  It is hard to believe that this is considered Anthony Hopkins film debut.  He brings Richard to vivid life, with all his failings and strengths.  There isn't a weak performance in the bunch.  This is a film that can be watched again and again, since each showing brings even more to discover.  Watching Hepburn and O'Toole go &#34;toe to toe&#34; is an extra special treat.  This is the first and only time they are in a film together and they make the most of every moment.  I promise you, you will not be disappointed in this film.\nReview Title: One of the very best\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Downton Abbey: Season 4\nReview Date: 2014/02/01\nStore: Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nReview Text: Many of the reviews have complained that there was no info on this item about whether it contains the season finale and I also was frustrated about the lack of this info.  I just received the DVD and thought I would make it easier for others to get the answer.  I am very happy to report that this item does contain the season finale, which this year takes place at the families home in London.  So it is the full regular season plus the season finale, which is the UK was shown at Christmas time.  Hope this helps.\nReview Title: YES IT CONTAINS THE SEASON FINALE EPISODE\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sneakers\nReview Date: 2014/05/09\nStore: Robert Redford  (Actor),     Dan Akyroyd  (Actor),     Phil Alden Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Robert Redford leads an all-star cast in one of the most satisfying suspense films! Computer expert Martin Bishop (Redford) heads a team of renegade hackers - including a former CIA employee (Sidney Poitier), a gadgets wizard (Dan Aykroyd), a young genius (River Phoenix) and a blind soundman (David Strathairn) - who are routinely hired to test security systems. But Bishop\\'s past comes back to haunt him when government agents blackmail the \"sneakers\" into carrying out a covert operation: tracking down an elusive black box. Along with his former girlfriend (Mary McDonnell), Bishop\\'s team retrieves the box and makes a stunning discovery - the device can break into any computer system in the world. With factions from all sides willing to kill for the powerful box, Bishop and his team embark on their most dangerous assignment ever in this exhilarating high-tech caper from Phil Alden Robinson (Field of Dreams).Bonus Content:', 'The Making of Sneakers', 'The Making of Sneakers', 'Feature Commentary with Writer/Director Phil Alden Robinson', 'Feature Commentary with Writer/Director Phil Alden Robinson', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseDrama, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': \"Widescreen, Collector's Edition\", 'Contributor': 'Sidney Poitier, Dan Akyroyd, Hanyee, Phil Alden Robinson, Time Winters, Lee Garlington, Jun Asai, Robert Redford, Donal Logue, Ellaraino, Timothy Busfield, River Phoenix, Bodhi Elfman, David Strathairn, Denise Dowse, Ben Kingsley, John Shepard, Eddie Jones, Mary McDonnel, George HearnSidney Poitier, Dan Akyroyd, Hanyee, Phil Alden Robinson, Time Winters, Lee Garlington, Jun Asai, Robert Redford, Donal Logue, Ellaraino, Timothy Busfield, River Phoenix, Bodhi Elfman, David Strathairn, Denise Dowse, Ben Kingsley, John Shepard, Eddie Jones, Mary McDonnel,…  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 6 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.08 Ounces', 'Item model number': '25192330421', 'Director': 'Phil Alden Robinson', 'Media Format': \"Widescreen, Collector's Edition\", 'Run time': '2 hours and 6 minutes', 'Release date': 'December 28, 2004', 'Actors': 'Robert Redford, Dan Akyroyd, Ben Kingsley, Mary McDonnel, River Phoenix', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This film is a real treasure.  Not only is the cast outstanding, they also work brilliantly off each other.  The script is well written with great dialogue for each character.  The story moves along very quickly with many twists and turns.  This film would appeal to a very wide audience.  Great entertainment and even after you know all the answers and surprises you will want to watch it again just to catch all the superb performances.  Can not recommend it highly enough.  You will not be disappointed.  Make sure you get the widescreen edition, so you don't miss anything.\nReview Title: Great Flick\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night at the Museum (Widescreen Edition) [DVD]\nReview Date: 2015/05/29\nStore: Ben Stiller  (Actor),     Dick Van Dyke  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\nProduct Description: ['Product Description', \"Good-hearted dreamer Larry Daley, despite being perpetually down on his luck, thinks he's destined for something big. But even he could never have imagined how big, when he accepts what appears to be a menial job as a graveyard-shift security guard at a museum of natural history. During Larry's watch, extraordinary things begin to occur: Mayans, Roman Gladiators, and cowboys emerge from their diorama to wage epic battles; in his quest for fire, a Neanderthal burns down his own display; Attila the Hun pillages his neighboring exhibits, and a T-Rex reminds everyone why he's history's fiercest predator. Amidst the chaos, the only person Larry can turn to for advice is a wax figure of President Teddy Roosevelt, who helps our hero harness the bedlam, stop a nefarious plot, and save the museum.\", 'Amazon.com', \"An irresistible concept meets computer-generated wonders in Night at the Museum, inspired by a 1993 children's book by Milan Trenc. Ben Stiller stars as Larry Daley, an underachieving inventor waiting for his ship to come in while getting evicted from one apartment after another for lack of funds. Larry's son needs some stability, so the well-meaning ne'er-do-well takes a job as night watchman at New York City's Museum of Natural History. What the soon-to-retire guards (Dick Van Dyke, Mickey Rooney, Bill Cobbs) don't tell him is that an ancient pharaoh's tablet in the museum causes everything on display to come to life at night. Thus, Larry meets representations of Teddy Roosevelt, Attila the Hun, fire-worshipping cavemen, and Roman Empire soldiers, and learns to cope with an excitable T-Rex and man-eating, ancient animals. The film might have left things at that, but an added story element gives Night at the Museum some extra urgency and excitement, especially fo! r kids: Larry becomes responsible for keeping this nightly miracle going and preventing anything in the museum from dying due to exposure to sunrise. Computer effects, as well as wildly imaginative costumes and makeup, help make the film appeal to the 8-year-old in everyone. Director Shawn Levy (The Pink Panther) works with a hugely talented cast, including Robin Williams, Owen Wilson, Ricky Gervais, Carla Gugino, and Steve Coogan. --\", 'Tom Keogh', 'Night at the Museum', 'Extras', 'Ben Stiller on Director Shawn Levy', 'Ricky Gervais on', 'the size of his trailer', 'and', 'eating cheese', '.', 'Beyond', 'Night at the Museum', 'See What DVDs Meant Special Effects to Amazon DVD Editors As Kids', 'More Adventure Films for Kids & Family', 'The Night at the Museum', 'Paperback Book', 'Stills from', 'Night at the Museum']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, DTS Surround Sound, Dubbed, Widescreen, NTSC', 'Contributor': 'Bill Cobbs, Mickey Rooney, Dick Van Dyke, Shawn Levy, Ben Stiller', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (DTS ES), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.25 inches; 0.71 Ounces', 'Item model number': '2241717', 'Director': 'Shawn Levy', 'Media Format': 'Multiple Formats, Color, Dolby, DTS Surround Sound, Dubbed, Widescreen, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'April 24, 2007', 'Actors': 'Ben Stiller, Dick Van Dyke, Mickey Rooney, Bill Cobbs', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Wonderful film and got it for a great price.\nReview Title: Great film - Great Price\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NIGHT AT THE MUSEUM: SECRET OF THE TOMB\nReview Date: 2015/05/29\nStore: Ben Stiller  (Actor),     Robin Williams  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\nProduct Description: [\"If it's laughter you're after, get ready for the most hilarious night ever! Ben Stiller leads an all-star comedy cast, including Robin Williams, Owen Wilson, Rebel Wilson and Ricky Gervais, for one final, fun-filled Night at the Museum. This time, Larry Daley (Stiller) and his heroic friends embark on their greatest adventure yet as they travel to London in order to save the magic that brings the museum exhibits to life!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Rachael Harris, Rami Malek, Michael Handelman, Ricky Gervais, Mickey Rooney, Mizuo Peck, Crystal the Monkey, Owen Wilson, Dick Van Dyke, Shawn Levy, Andrea Martin, David Guion, Ben Stiller, Robin Williams, Matt Frewer, Bill Cobbs, Skyler Gisondo, Dan Stevens, Rebel Wilson, Patrick Gallagher, Ben Kingsley, Steve CooganRachael Harris, Rami Malek, Michael Handelman, Ricky Gervais, Mickey Rooney, Mizuo Peck, Crystal the Monkey, Owen Wilson, Dick Van Dyke, Shawn Levy, Andrea Martin, David Guion, Ben Stiller, Robin Williams, Matt Frewer, Bill Cobbs, Skyler Gisondo, Dan Stevens, Rebel Wil…   See more', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '33569564', 'Director': 'Shawn Levy', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'March 10, 2015', 'Actors': 'Ben Stiller, Robin Williams, Owen Wilson, Steve Coogan, Ricky Gervais', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'David Guion, Michael Handelman', 'Number of discs': '1'}\nReview Text: Great film and I got it for a great price.  Really enjoy this series.\nReview Title: Great Film for a Great Price\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Masterpiece: Downton Abbey Season 6\nReview Date: 2016/01/30\nStore: Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter  (Actor),     .  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Return to Downton Abbey for the sixth and final season to discover the fates of the Crawley family, and the servants who work for them, as they face new challenges and begin forging different paths in a rapidly changing world. Creator Julian Fellowes brings the top PBS drama of all time to its climactic chapter, with the beloved ensemble led by Hugh Bonneville, Michelle Dockery, Elizabeth McGovern, and Maggie Smith.']\nAverage Rating: 4.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': '02578', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '9 hours', 'Release date': 'January 26, 2016', 'Actors': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nReview Text: After receiving this today I am finally able to confirm that it does contain the season finale episode.  Can't wait to watch.\nReview Title: CONTAINS THE SEASON FINALE EPISODE\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe individual's purchase history reveals a strong preference for high-quality dramas and family-friendly comedies, often focusing on well-written scripts and exceptional acting performances. Consistently favorable ratings (4.7-5.0) indicate a discerning taste, particularly appreciating historical and character-driven narratives, as seen in classic films and acclaimed series. \n\nCommon themes arise around family-oriented entertainment and historical dramas, suggesting an interest in both engaging storytelling and character development. The preference leans towards productions from reputable studios, often with substantial casts, highlighting an appreciation for ensemble performances and classic storytelling.\n\nQuality is a crucial preference, as the buyer clearly favors well-rated items, reflecting low price sensitivity when purchasing beloved classics or popular series; they often place higher value on content quality than cost. This trend is further evidenced by repeated purchases from collections, such as the \"Downton Abbey\" series, showing loyalty to established franchises.\n\nOverall, the core preferences center around high-quality dramatizations, significant ensemble casts, family-friendly content, and an appreciation for both timeless classics and modern succeeds in entertainment. The person favors memorable experiences over cost, as reflected in their consistent investing in treasured cinematic and television works.",
  "target_interaction": {
    "rating": 1.0,
    "title": "BE WARNED - BONUS DISC IS BLUE-RAY ONLY",
    "text": "When I purchased this as a pre-order the only thing available was the Blue-Ray/DVD combo pack. I only had a DVD player but I thought this pack would be fine. Nowhere in the product description supplied by Amazon did it say that the bonus disc was Blue-ray ONLY.  Instead of the bonus features I was looking forward to I am stuck with a disc that is totally useless to me and I don't get to see any bonus features.  Just want those with a DVD player only to be aware of this.",
    "images": [],
    "asin": "B018FK66TU",
    "parent_asin": "B018FK66TU",
    "user_id": "AGAOC6HMU7ALP6YIG6TEVUPSGHOQ",
    "timestamp": "2016-04-09 02:04:43",
    "helpful_vote": 16,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Star Wars: The Force Awakens",
    "average_rating": 4.6,
    "rating_number": 29237,
    "features": [],
    "description": [
      "Product Description",
      "Visionary director J.J. Abrams brings to life the motion picture event of a generation. As Kylo Ren and the sinister First Order rise from the ashes of the Empire, Luke Skywalker is missing when the galaxy needs him most. It's up to Rey, a desert scavenger, and Finn, a defecting stormtrooper, to join forces with Han Solo and Chewbacca in a desperate search for the one hope of restoring peace to the galaxy.",
      "Additional Features",
      "How to redeem your digital code:  1. Find Code on Insert  2. Enter Code   3. Select Provider   4. Enjoy Movie!"
    ],
    "price": 4.0,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51KZnS7sghL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51KZnS7sghL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71kliP+CIfL._SL1399_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61IZnxTnaKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61IZnxTnaKL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/815sNabP6AL._SL1399_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/316wEuKtlTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/316wEuKtlTL.jpg",
        "variant": "PT03",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "New Star Wars Trailer",
        "url": "https://www.amazon.com/vdp/8b0fb50d43d346969c890cd66ba1e8d1?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Harrison Ford  (Actor),     Mark Hamill  (Actor),     J.J. Abrams  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "Blu-ray"
    ],
    "details": {
      "Aspect Ratio": "2.40:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 4.8 Ounces",
      "Director": "J.J. Abrams",
      "Media Format": "Blu-ray, Digital_copy, DVD+Blu-ray",
      "Run time": "2 hours and 16 minutes",
      "Release date": "April 5, 2016",
      "Actors": "Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley",
      "Subtitles": "French, Spanish, English",
      "Language": "French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)",
      "Studio": "Walt Disney Studios",
      "Writers": "Screenplay by Lawrence Kasdan & J.J. Abrams and Mi",
      "Number of discs": "3"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}