{
  "user_id": "AHB4RUFBEQPILLJZZ24QG2DPC74Q",
  "summary": "=== Purchase Information ===\nProduct Title: Prometheus (Blu-ray/ DVD + Digital Copy)\nReview Date: 2015/03/27\nStore: Noomi Rapace  (Actor),     Michael Fassbender  (Actor),     Ridley Scott  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Ridley Scott, director of \"Alien\" and \"Blade Runner,\" returns to the genre he helped define. With PROMETHEUS, he creates a groundbreaking mythology, in which a team of explorers discover a clue to the origins of mankind on Earth, leading them on a thrilling journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.', 'Amazon.com', 'You want an alien world created anew, with wonders and horrors lurking in its furrows? You go to Ridley Scott, of course, spectacle maker and pictorialist par excellence. So', 'Prometheus', 'is bound to be eye filling, with fully wrought planetary vistas and occasionally jaw-dropping visual coups. And did we use the word', 'alien', 'back there? Yes, folks,', 'Prometheus', \"is a prequel, in a sideways sort of fashion, to Scott's 1979\", 'Alien', \"original--or at least it's a long-distant stage setter for that story. This one begins with a space mission that could reveal the extraterrestrial roots of Earth, although what's buried out on the planet turns out to be much more complicated than expected. In the midst of suspenseful episodes (and a few contrived plot turns),\", 'Prometheus', \"reaches for Big Answers to Big Questions, in a grand old sci-fi tradition. This lends the movie a hint of metaphysical energy, even if Scott's reach extends well, well beyond his grasp. The hokier moments are carried off with brio by Michael Fassbender (the robot on board), Charlize Theron, and Idris Elba, and then you've got Noomi Rapace entering the badass hall of fame for a long, oh-no-they-didn't sequence involving radical surgery, which might just induce the vapors in a few viewers. Even if\", 'Prometheus', 'has its holes, the sheer size of the thing is exciting to be around. Because this movie is gigantic.', '--Robert Horton', '.', 'A team of scientists journey through the universe on the spaceship \"Prometheus\" on a voyage to investigate Alien life forms. The team of scientists becomes stranded on an Alien world, and as they struggle to survive it becomes clear that the horrors they experience are not just a threat to themselves, but to all of mankind. -', 'WellardRockard', 'Synopsis', 'A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.', 'Meet the Characters', 'Elizabeth Shaw', 'View larger', 'Noomi Rapace', 'as', 'Elizabeth Shaw', \"captured the eyes of the international entertainment community with her commanding, unnerving and critically acclaimed portrayal of Lisbeth Salander in the film adaptations of Stieg Larsson's\", 'Millennium Trilogy: The Girl With the Dragon Tattoo', ',', 'The Girl Who Played With Fire', ', and', \"The Girl Who Kicked The Hornet's Nest\", \". Rapace began her acting career at the age of seven, in Iceland's\", 'In the Shadow of the Raven', '. She has since gone to appear in over twenty films and television shows. Born in Sweden, Rapace is the daughter of Flamenco singer Rogelio Duran.  Shaw, an archaeologist, discovers a clue to the origins of mankind on Earth, leading her and a team of scientists and explorers on a thrilling journey, aboard the spaceship Prometheus, to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race. Shaw and her team aboard the Prometheus are on nothing less than a journey to discover answers to some of life’s most profound questions. She is a scientist filled with faith and hope, but who transforms into a warrior when faced with the danger she encounters at her destination. Michael Fassbender as David', 'View larger', 'Michael Fassbender', 'as', 'David', 'enjoyed a phenomenal run of critically acclaimed performances in 2011 and 2012, garnering numerous accolades and awards. The National Board of Review awarded Fassbender the Spotlight Award, and the Los Angeles Film Critics Association named him Best Actor for his performances in', 'Shame', 'and Davide Cronenberg’s drama', 'A Dangerous Method', ', in which Fassbender plays Carl Jung opposite Keira Knightley and Viggo Mortensen. Fassbender was also recently seen in Matthew Vaughn’s', 'X-Men: First Class', ', as Erik Lehnsherr, better known as super-villain Magneto; as Rochester in Cary Joji Fukunaga’s', 'Jane Eyre', '; and as an assassin opposite Ewan McGregor and Gina Carano in Steven Soderbergh’s', 'Haywire', '. Fassbender is a graduate of London\\'s prestigious Drama Centre. His breakthrough role came as Sgt. Burton \"Pat\" Christenson in HBO\\'s epic, award-winning miniseries', 'Band of Brothers', '. David is an android creation of Weyland Industries. While David possesses extraordinary intelligence and other capabilities, his principal tasks aboard the Prometheus are servile. David is however far more “human” than one might expect of a synthetic person. He is jealous and arrogant because he realizes that his knowledge is all-encompassing and therefore he is superior to the human crew members. David’s allegiances are unclear, and he can be very bold in the decisions he makes.  Meredith Vickers', 'View larger', 'Charlize Theron', 'as', 'Meredith Vickers', 'demands the audience’s full attention as soon as she appears on screen. This South African captivated audiences as female serial killer Aileen Wuornos in the independent gem', 'Monster', '. Charlize’s feature film debut was MGM’s 2', 'Days in the Valley', ', with Jeff Daniels. In 2001, Theron starred in the Warner Bros. tearjerker', 'Sweet November', 'alongside Keanu Reeves, as well as in Woody Allen’s', 'Curse of the Jade Scorpion', '. In 2002 Theron starred opposite Patrick Swayze and Billy Bob Thornton in', 'Waking Up in Reno', ', and opposite Kevin Bacon, Courtney Love, and Dakota Fanning in the feature film', 'Trapped', ', directed by Luis Mandoki. Vickers is a “suit” representing the interests of the mega-corporation funding the Prometheus’ journey to a distant, foreboding world. Her perspective on the mission is at odds with the rest of the crew’s. For Vickers, this epic, two-year journey to a distant planet has been boiled down to economics. But as with so much else about the mission, there are deeper layers and mysteries to Vickers’ ultimate goals.  Logan Marshall-Green as Charlie Holloway', 'View larger', 'Logan Marshall-Green', 'as', 'Charlie Holloway', ') appeared on the big screen in', 'Devil', ', produced by M. Night Shyamalan. He is best-known to film audiences for playing radical activist Paco in Julie Taymor’s', 'Across the Universe', '. He has also co-starred in the films', 'Brooklyn’s Finest', ',', 'The Kindness of Strangers', 'and', 'The Great Raid', '. A graduate of New York University’s Tisch Graduate Acting Program and a prolific stage actor, Marshall-Green earned a Drama League nomination for his work in', 'King Lear', \"with Kevin Klein at the Public Theatre, and Greg Kotis'\", 'Pig Farm', 'at the Roundabout Theatre off-Broadway. He earned Lortel Award nominations for his performances in', 'Dog Sees God', \"and Neil LaBute's\", 'The Distance from Here', ', the latter also earning him a Drama Desk Ensemble Award. Holloway is Shaw’s partner, both personally and professionally, in a quest for answers to some of humanity’s most important questions. Like Shaw, Holloway is a scientist with a thirst for answers, but he thinks the end of their search will yield very different results from those Shaw expects. While Shaw is the heart of the search, Holloway is its guts. He is constantly pushing the envelope, going to the extreme in everything he does. He is driven by the thrill of the quest.', 'More Images', 'View larger.', 'View larger.', 'View larger.', 'View larger.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy, Color', 'Contributor': 'Ridley Scott, Guy Pearce, Idris Elba, Logan Marshall-Green, Noomi Rapace, Michael Fassbender, Charlize TheronRidley Scott, Guy Pearce, Idris Elba, Logan Marshall-Green, Noomi Rapace, Michael Fassbender, Charlize Theron  See more', 'Language': 'English, French', 'Runtime': '2 hours and 4 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 3.2 Ounces', 'Item model number': '2281407', 'Director': 'Ridley Scott', 'Media Format': 'Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 4 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Noomi Rapace, Michael Fassbender, Charlize Theron, Idris Elba, Guy Pearce', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: Love this movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2010: The Year We Make Contact [Blu-ray]\nReview Date: 2015/03/27\nStore: Douglas Rain  (Actor),     Roy Scheider  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['2010: The Year We Make Contact (BD)', 'A new time, a new odyssey, a new chance to confront enigmas arising from the daring Jupiter mission of 2001. Crew members aboard the Leonov will rendezvous with the still-orbiting Discovery. And their fate will rest on the silicon shoulders of the computer they reawaken, HAL-9000. Based on Arthur C. Clarkes 2001: A Space Odyssey sequel, director Peter Hyams spellbinder nominated for 5 Academy Awards* stars Roy Scheider, John Lithgow, Oscar winner** Helen Mirren, Bob Balaban and Keir Dullea.', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 6.81 x 0.55 inches; 1.98 Ounces', 'Item model number': '883929051069', 'Director': 'Peter Hyams', 'Media Format': 'Multiple Formats, Color, NTSC, Blu-ray', 'Run time': '1 hour and 56 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Douglas Rain, Roy Scheider, Candice Bergen, John Lithgow, Helen Mirren', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, German, Dutch, French, Portuguese, Swedish, Finnish, Italian, Danish, Norwegian', 'Producers': 'Peter Hyams', 'Studio': 'Warner Home Video', 'Writers': 'Peter Hyams', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie, one of my faves!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Close Encounters of the Third Kind [Blu-ray]\nReview Date: 2015/03/27\nStore: Richard Dreyfuss  (Actor),     Francois Truffaut  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Richard Dreyfuss stars as cable worker Roy Neary, who along with several other stunned bystanders experience a close encounter of the first kind - witnessing UFOs soaring across the sky. After this life-changing event, the inexplicable vision of a strange, mountain-like formation haunts him. He becomes obsessed with discovering what it represents, much to the dismay of his wife and family. Meanwhile, bizarre occurrences are happening around the world. Government agents have close encounters of the second kind - discovering physical evidence of extraterrestrial visitors in the form of a lost fighter aircraft from World War II and a stranded military ship that disappeared decades earlier only to suddenly reappear in unusual places. Roy continues to chase his vision to a remote area where he and the agents follow the clues that have drawn them to reach a site where they will have a close encounter of the third kind - contact.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Sci-Fi/Fantasy', 'Format': 'Blu-ray, Closed-captioned, NTSC, Dubbed, Widescreen, Subtitled', 'Contributor': 'Teri Garr, Melinda Dillon, Julia Phillips, Francois Truffaut, Steven Spielberg, Close Encounters Prods., Michael Phillips, Richard DreyfussTeri Garr, Melinda Dillon, Julia Phillips, Francois Truffaut, Steven Spielberg, Close Encounters Prods., Michael Phillips, Richard Dreyfuss   See more', 'Language': 'English', 'Runtime': '6 hours and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.44 Ounces', 'Item model number': '25832775', 'Director': 'Steven Spielberg', 'Media Format': 'Blu-ray, Closed-captioned, NTSC, Dubbed, Widescreen, Subtitled', 'Run time': '6 hours and 44 minutes', 'Release date': 'February 14, 2011', 'Actors': 'Richard Dreyfuss, Francois Truffaut, Teri Garr, Melinda Dillon', 'Dubbed': 'French, Spanish', 'Subtitles': 'Arabic, Thai, Korean, English, Portuguese, Mandarin Chinese, French, Spanish', 'Producers': 'Michael Phillips, Julia Phillips', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie, was great price, quality and delivery!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Contact [Blu-ray]\nReview Date: 2015/03/27\nStore: Jodie Foster  (Actor),     Matthew McConaughey  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['Contact (BD)', \"Two-time Oscar winner Jodie Foster stars in this visionary drama based on Carl Sagan's novel about human kind's first encounter with extraterrestial life, directed by another Oscar winner, Robert Zemeckis.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'NTSC, Color, Blu-ray, Blu-ray, Dolby, Anamorphic', 'Contributor': 'Tom Skerritt, Matthew McConaughey, Jodie Foster, James Woods, Robert Zemeckis, John Hurt, Angela BassettTom Skerritt, Matthew McConaughey, Jodie Foster, James Woods, Robert Zemeckis, John Hurt, Angela Bassett   See more', 'Initial release date': '2009-10-06', 'Language': 'German (Dolby Digital 5.1), Italian (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby TrueHD 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1), Portuguese (Dolby Digital 2.0 Stereo)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '883929064144', 'Director': 'Robert Zemeckis', 'Media Format': 'NTSC, Color, Blu-ray, Blu-ray, Dolby, Anamorphic', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Jodie Foster, Matthew McConaughey, James Woods, John Hurt, Tom Skerritt', 'Dubbed': 'Spanish', 'Subtitles': 'English, Italian, German', 'Studio': 'Warner Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie, was great price, quality and delivery!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2001: A Space Odyssey [Blu-ray]\nReview Date: 2015/03/27\nStore: Keir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Love this movie, was great price, quality and delivery!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference": "Prometheus (Blu-ray/ DVD + Digital Copy)\nNoomi Rapace  (Actor),     Michael Fassbender  (Actor),     Ridley Scott  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Ridley Scott, director of \"Alien\" and \"Blade Runner,\" returns to the genre he helped define. With PROMETHEUS, he creates a groundbreaking mythology, in which a team of explorers discover a clue to the origins of mankind on Earth, leading them on a thrilling journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.', 'Amazon.com', 'You want an alien world created anew, with wonders and horrors lurking in its furrows? You go to Ridley Scott, of course, spectacle maker and pictorialist par excellence. So', 'Prometheus', 'is bound to be eye filling, with fully wrought planetary vistas and occasionally jaw-dropping visual coups. And did we use the word', 'alien', 'back there? Yes, folks,', 'Prometheus', \"is a prequel, in a sideways sort of fashion, to Scott's 1979\", 'Alien', \"original--or at least it's a long-distant stage setter for that story. This one begins with a space mission that could reveal the extraterrestrial roots of Earth, although what's buried out on the planet turns out to be much more complicated than expected. In the midst of suspenseful episodes (and a few contrived plot turns),\", 'Prometheus', \"reaches for Big Answers to Big Questions, in a grand old sci-fi tradition. This lends the movie a hint of metaphysical energy, even if Scott's reach extends well, well beyond his grasp. The hokier moments are carried off with brio by Michael Fassbender (the robot on board), Charlize Theron, and Idris Elba, and then you've got Noomi Rapace entering the badass hall of fame for a long, oh-no-they-didn't sequence involving radical surgery, which might just induce the vapors in a few viewers. Even if\", 'Prometheus', 'has its holes, the sheer size of the thing is exciting to be around. Because this movie is gigantic.', '--Robert Horton', '.', 'A team of scientists journey through the universe on the spaceship \"Prometheus\" on a voyage to investigate Alien life forms. The team of scientists becomes stranded on an Alien world, and as they struggle to survive it becomes clear that the horrors they experience are not just a threat to themselves, but to all of mankind. -', 'WellardRockard', 'Synopsis', 'A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.', 'Meet the Characters', 'Elizabeth Shaw', 'View larger', 'Noomi Rapace', 'as', 'Elizabeth Shaw', \"captured the eyes of the international entertainment community with her commanding, unnerving and critically acclaimed portrayal of Lisbeth Salander in the film adaptations of Stieg Larsson's\", 'Millennium Trilogy: The Girl With the Dragon Tattoo', ',', 'The Girl Who Played With Fire', ', and', \"The Girl Who Kicked The Hornet's Nest\", \". Rapace began her acting career at the age of seven, in Iceland's\", 'In the Shadow of the Raven', '. She has since gone to appear in over twenty films and television shows. Born in Sweden, Rapace is the daughter of Flamenco singer Rogelio Duran.  Shaw, an archaeologist, discovers a clue to the origins of mankind on Earth, leading her and a team of scientists and explorers on a thrilling journey, aboard the spaceship Prometheus, to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race. Shaw and her team aboard the Prometheus are on nothing less than a journey to discover answers to some of life’s most profound questions. She is a scientist filled with faith and hope, but who transforms into a warrior when faced with the danger she encounters at her destination. Michael Fassbender as David', 'View larger', 'Michael Fassbender', 'as', 'David', 'enjoyed a phenomenal run of critically acclaimed performances in 2011 and 2012, garnering numerous accolades and awards. The National Board of Review awarded Fassbender the Spotlight Award, and the Los Angeles Film Critics Association named him Best Actor for his performances in', 'Shame', 'and Davide Cronenberg’s drama', 'A Dangerous Method', ', in which Fassbender plays Carl Jung opposite Keira Knightley and Viggo Mortensen. Fassbender was also recently seen in Matthew Vaughn’s', 'X-Men: First Class', ', as Erik Lehnsherr, better known as super-villain Magneto; as Rochester in Cary Joji Fukunaga’s', 'Jane Eyre', '; and as an assassin opposite Ewan McGregor and Gina Carano in Steven Soderbergh’s', 'Haywire', '. Fassbender is a graduate of London\\'s prestigious Drama Centre. His breakthrough role came as Sgt. Burton \"Pat\" Christenson in HBO\\'s epic, award-winning miniseries', 'Band of Brothers', '. David is an android creation of Weyland Industries. While David possesses extraordinary intelligence and other capabilities, his principal tasks aboard the Prometheus are servile. David is however far more “human” than one might expect of a synthetic person. He is jealous and arrogant because he realizes that his knowledge is all-encompassing and therefore he is superior to the human crew members. David’s allegiances are unclear, and he can be very bold in the decisions he makes.  Meredith Vickers', 'View larger', 'Charlize Theron', 'as', 'Meredith Vickers', 'demands the audience’s full attention as soon as she appears on screen. This South African captivated audiences as female serial killer Aileen Wuornos in the independent gem', 'Monster', '. Charlize’s feature film debut was MGM’s 2', 'Days in the Valley', ', with Jeff Daniels. In 2001, Theron starred in the Warner Bros. tearjerker', 'Sweet November', 'alongside Keanu Reeves, as well as in Woody Allen’s', 'Curse of the Jade Scorpion', '. In 2002 Theron starred opposite Patrick Swayze and Billy Bob Thornton in', 'Waking Up in Reno', ', and opposite Kevin Bacon, Courtney Love, and Dakota Fanning in the feature film', 'Trapped', ', directed by Luis Mandoki. Vickers is a “suit” representing the interests of the mega-corporation funding the Prometheus’ journey to a distant, foreboding world. Her perspective on the mission is at odds with the rest of the crew’s. For Vickers, this epic, two-year journey to a distant planet has been boiled down to economics. But as with so much else about the mission, there are deeper layers and mysteries to Vickers’ ultimate goals.  Logan Marshall-Green as Charlie Holloway', 'View larger', 'Logan Marshall-Green', 'as', 'Charlie Holloway', ') appeared on the big screen in', 'Devil', ', produced by M. Night Shyamalan. He is best-known to film audiences for playing radical activist Paco in Julie Taymor’s', 'Across the Universe', '. He has also co-starred in the films', 'Brooklyn’s Finest', ',', 'The Kindness of Strangers', 'and', 'The Great Raid', '. A graduate of New York University’s Tisch Graduate Acting Program and a prolific stage actor, Marshall-Green earned a Drama League nomination for his work in', 'King Lear', \"with Kevin Klein at the Public Theatre, and Greg Kotis'\", 'Pig Farm', 'at the Roundabout Theatre off-Broadway. He earned Lortel Award nominations for his performances in', 'Dog Sees God', \"and Neil LaBute's\", 'The Distance from Here', ', the latter also earning him a Drama Desk Ensemble Award. Holloway is Shaw’s partner, both personally and professionally, in a quest for answers to some of humanity’s most important questions. Like Shaw, Holloway is a scientist with a thirst for answers, but he thinks the end of their search will yield very different results from those Shaw expects. While Shaw is the heart of the search, Holloway is its guts. He is constantly pushing the envelope, going to the extreme in everything he does. He is driven by the thrill of the quest.', 'More Images', 'View larger.', 'View larger.', 'View larger.', 'View larger.']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy, Color', 'Contributor': 'Ridley Scott, Guy Pearce, Idris Elba, Logan Marshall-Green, Noomi Rapace, Michael Fassbender, Charlize TheronRidley Scott, Guy Pearce, Idris Elba, Logan Marshall-Green, Noomi Rapace, Michael Fassbender, Charlize Theron  See more', 'Language': 'English, French', 'Runtime': '2 hours and 4 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 3.2 Ounces', 'Item model number': '2281407', 'Director': 'Ridley Scott', 'Media Format': 'Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 4 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Noomi Rapace, Michael Fassbender, Charlize Theron, Idris Elba, Guy Pearce', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nLove this movie!\nFive Stars\n2010: The Year We Make Contact [Blu-ray]\nDouglas Rain  (Actor),     Roy Scheider  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['2010: The Year We Make Contact (BD)', 'A new time, a new odyssey, a new chance to confront enigmas arising from the daring Jupiter mission of 2001. Crew members aboard the Leonov will rendezvous with the still-orbiting Discovery. And their fate will rest on the silicon shoulders of the computer they reawaken, HAL-9000. Based on Arthur C. Clarkes 2001: A Space Odyssey sequel, director Peter Hyams spellbinder nominated for 5 Academy Awards* stars Roy Scheider, John Lithgow, Oscar winner** Helen Mirren, Bob Balaban and Keir Dullea.', ']]>']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 6.81 x 0.55 inches; 1.98 Ounces', 'Item model number': '883929051069', 'Director': 'Peter Hyams', 'Media Format': 'Multiple Formats, Color, NTSC, Blu-ray', 'Run time': '1 hour and 56 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Douglas Rain, Roy Scheider, Candice Bergen, John Lithgow, Helen Mirren', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, German, Dutch, French, Portuguese, Swedish, Finnish, Italian, Danish, Norwegian', 'Producers': 'Peter Hyams', 'Studio': 'Warner Home Video', 'Writers': 'Peter Hyams', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie, one of my faves!\nFive Stars\nClose Encounters of the Third Kind [Blu-ray]\nRichard Dreyfuss  (Actor),     Francois Truffaut  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Richard Dreyfuss stars as cable worker Roy Neary, who along with several other stunned bystanders experience a close encounter of the first kind - witnessing UFOs soaring across the sky. After this life-changing event, the inexplicable vision of a strange, mountain-like formation haunts him. He becomes obsessed with discovering what it represents, much to the dismay of his wife and family. Meanwhile, bizarre occurrences are happening around the world. Government agents have close encounters of the second kind - discovering physical evidence of extraterrestrial visitors in the form of a lost fighter aircraft from World War II and a stranded military ship that disappeared decades earlier only to suddenly reappear in unusual places. Roy continues to chase his vision to a remote area where he and the agents follow the clues that have drawn them to reach a site where they will have a close encounter of the third kind - contact.']\n{'Genre': 'Sci-Fi/Fantasy', 'Format': 'Blu-ray, Closed-captioned, NTSC, Dubbed, Widescreen, Subtitled', 'Contributor': 'Teri Garr, Melinda Dillon, Julia Phillips, Francois Truffaut, Steven Spielberg, Close Encounters Prods., Michael Phillips, Richard DreyfussTeri Garr, Melinda Dillon, Julia Phillips, Francois Truffaut, Steven Spielberg, Close Encounters Prods., Michael Phillips, Richard Dreyfuss   See more', 'Language': 'English', 'Runtime': '6 hours and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.44 Ounces', 'Item model number': '25832775', 'Director': 'Steven Spielberg', 'Media Format': 'Blu-ray, Closed-captioned, NTSC, Dubbed, Widescreen, Subtitled', 'Run time': '6 hours and 44 minutes', 'Release date': 'February 14, 2011', 'Actors': 'Richard Dreyfuss, Francois Truffaut, Teri Garr, Melinda Dillon', 'Dubbed': 'French, Spanish', 'Subtitles': 'Arabic, Thai, Korean, English, Portuguese, Mandarin Chinese, French, Spanish', 'Producers': 'Michael Phillips, Julia Phillips', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie, was great price, quality and delivery!\nFive Stars\nContact [Blu-ray]\nJodie Foster  (Actor),     Matthew McConaughey  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Contact (BD)', \"Two-time Oscar winner Jodie Foster stars in this visionary drama based on Carl Sagan's novel about human kind's first encounter with extraterrestial life, directed by another Oscar winner, Robert Zemeckis.\", ']]>']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'NTSC, Color, Blu-ray, Blu-ray, Dolby, Anamorphic', 'Contributor': 'Tom Skerritt, Matthew McConaughey, Jodie Foster, James Woods, Robert Zemeckis, John Hurt, Angela BassettTom Skerritt, Matthew McConaughey, Jodie Foster, James Woods, Robert Zemeckis, John Hurt, Angela Bassett   See more', 'Initial release date': '2009-10-06', 'Language': 'German (Dolby Digital 5.1), Italian (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby TrueHD 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1), Portuguese (Dolby Digital 2.0 Stereo)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '883929064144', 'Director': 'Robert Zemeckis', 'Media Format': 'NTSC, Color, Blu-ray, Blu-ray, Dolby, Anamorphic', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Jodie Foster, Matthew McConaughey, James Woods, John Hurt, Tom Skerritt', 'Dubbed': 'Spanish', 'Subtitles': 'English, Italian, German', 'Studio': 'Warner Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie, was great price, quality and delivery!\nFive Stars\n2001: A Space Odyssey [Blu-ray]\nKeir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nLove this movie, was great price, quality and delivery!\nFive Stars",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Prometheus (Blu-ray/ DVD + Digital Copy)\nReview Date: 2015/03/27\nStore: Noomi Rapace  (Actor),     Michael Fassbender  (Actor),     Ridley Scott  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Ridley Scott, director of \"Alien\" and \"Blade Runner,\" returns to the genre he helped define. With PROMETHEUS, he creates a groundbreaking mythology, in which a team of explorers discover a clue to the origins of mankind on Earth, leading them on a thrilling journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.', 'Amazon.com', 'You want an alien world created anew, with wonders and horrors lurking in its furrows? You go to Ridley Scott, of course, spectacle maker and pictorialist par excellence. So', 'Prometheus', 'is bound to be eye filling, with fully wrought planetary vistas and occasionally jaw-dropping visual coups. And did we use the word', 'alien', 'back there? Yes, folks,', 'Prometheus', \"is a prequel, in a sideways sort of fashion, to Scott's 1979\", 'Alien', \"original--or at least it's a long-distant stage setter for that story. This one begins with a space mission that could reveal the extraterrestrial roots of Earth, although what's buried out on the planet turns out to be much more complicated than expected. In the midst of suspenseful episodes (and a few contrived plot turns),\", 'Prometheus', \"reaches for Big Answers to Big Questions, in a grand old sci-fi tradition. This lends the movie a hint of metaphysical energy, even if Scott's reach extends well, well beyond his grasp. The hokier moments are carried off with brio by Michael Fassbender (the robot on board), Charlize Theron, and Idris Elba, and then you've got Noomi Rapace entering the badass hall of fame for a long, oh-no-they-didn't sequence involving radical surgery, which might just induce the vapors in a few viewers. Even if\", 'Prometheus', 'has its holes, the sheer size of the thing is exciting to be around. Because this movie is gigantic.', '--Robert Horton', '.', 'A team of scientists journey through the universe on the spaceship \"Prometheus\" on a voyage to investigate Alien life forms. The team of scientists becomes stranded on an Alien world, and as they struggle to survive it becomes clear that the horrors they experience are not just a threat to themselves, but to all of mankind. -', 'WellardRockard', 'Synopsis', 'A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.', 'Meet the Characters', 'Elizabeth Shaw', 'View larger', 'Noomi Rapace', 'as', 'Elizabeth Shaw', \"captured the eyes of the international entertainment community with her commanding, unnerving and critically acclaimed portrayal of Lisbeth Salander in the film adaptations of Stieg Larsson's\", 'Millennium Trilogy: The Girl With the Dragon Tattoo', ',', 'The Girl Who Played With Fire', ', and', \"The Girl Who Kicked The Hornet's Nest\", \". Rapace began her acting career at the age of seven, in Iceland's\", 'In the Shadow of the Raven', '. She has since gone to appear in over twenty films and television shows. Born in Sweden, Rapace is the daughter of Flamenco singer Rogelio Duran.  Shaw, an archaeologist, discovers a clue to the origins of mankind on Earth, leading her and a team of scientists and explorers on a thrilling journey, aboard the spaceship Prometheus, to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race. Shaw and her team aboard the Prometheus are on nothing less than a journey to discover answers to some of life’s most profound questions. She is a scientist filled with faith and hope, but who transforms into a warrior when faced with the danger she encounters at her destination. Michael Fassbender as David', 'View larger', 'Michael Fassbender', 'as', 'David', 'enjoyed a phenomenal run of critically acclaimed performances in 2011 and 2012, garnering numerous accolades and awards. The National Board of Review awarded Fassbender the Spotlight Award, and the Los Angeles Film Critics Association named him Best Actor for his performances in', 'Shame', 'and Davide Cronenberg’s drama', 'A Dangerous Method', ', in which Fassbender plays Carl Jung opposite Keira Knightley and Viggo Mortensen. Fassbender was also recently seen in Matthew Vaughn’s', 'X-Men: First Class', ', as Erik Lehnsherr, better known as super-villain Magneto; as Rochester in Cary Joji Fukunaga’s', 'Jane Eyre', '; and as an assassin opposite Ewan McGregor and Gina Carano in Steven Soderbergh’s', 'Haywire', '. Fassbender is a graduate of London\\'s prestigious Drama Centre. His breakthrough role came as Sgt. Burton \"Pat\" Christenson in HBO\\'s epic, award-winning miniseries', 'Band of Brothers', '. David is an android creation of Weyland Industries. While David possesses extraordinary intelligence and other capabilities, his principal tasks aboard the Prometheus are servile. David is however far more “human” than one might expect of a synthetic person. He is jealous and arrogant because he realizes that his knowledge is all-encompassing and therefore he is superior to the human crew members. David’s allegiances are unclear, and he can be very bold in the decisions he makes.  Meredith Vickers', 'View larger', 'Charlize Theron', 'as', 'Meredith Vickers', 'demands the audience’s full attention as soon as she appears on screen. This South African captivated audiences as female serial killer Aileen Wuornos in the independent gem', 'Monster', '. Charlize’s feature film debut was MGM’s 2', 'Days in the Valley', ', with Jeff Daniels. In 2001, Theron starred in the Warner Bros. tearjerker', 'Sweet November', 'alongside Keanu Reeves, as well as in Woody Allen’s', 'Curse of the Jade Scorpion', '. In 2002 Theron starred opposite Patrick Swayze and Billy Bob Thornton in', 'Waking Up in Reno', ', and opposite Kevin Bacon, Courtney Love, and Dakota Fanning in the feature film', 'Trapped', ', directed by Luis Mandoki. Vickers is a “suit” representing the interests of the mega-corporation funding the Prometheus’ journey to a distant, foreboding world. Her perspective on the mission is at odds with the rest of the crew’s. For Vickers, this epic, two-year journey to a distant planet has been boiled down to economics. But as with so much else about the mission, there are deeper layers and mysteries to Vickers’ ultimate goals.  Logan Marshall-Green as Charlie Holloway', 'View larger', 'Logan Marshall-Green', 'as', 'Charlie Holloway', ') appeared on the big screen in', 'Devil', ', produced by M. Night Shyamalan. He is best-known to film audiences for playing radical activist Paco in Julie Taymor’s', 'Across the Universe', '. He has also co-starred in the films', 'Brooklyn’s Finest', ',', 'The Kindness of Strangers', 'and', 'The Great Raid', '. A graduate of New York University’s Tisch Graduate Acting Program and a prolific stage actor, Marshall-Green earned a Drama League nomination for his work in', 'King Lear', \"with Kevin Klein at the Public Theatre, and Greg Kotis'\", 'Pig Farm', 'at the Roundabout Theatre off-Broadway. He earned Lortel Award nominations for his performances in', 'Dog Sees God', \"and Neil LaBute's\", 'The Distance from Here', ', the latter also earning him a Drama Desk Ensemble Award. Holloway is Shaw’s partner, both personally and professionally, in a quest for answers to some of humanity’s most important questions. Like Shaw, Holloway is a scientist with a thirst for answers, but he thinks the end of their search will yield very different results from those Shaw expects. While Shaw is the heart of the search, Holloway is its guts. He is constantly pushing the envelope, going to the extreme in everything he does. He is driven by the thrill of the quest.', 'More Images', 'View larger.', 'View larger.', 'View larger.', 'View larger.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy, Color', 'Contributor': 'Ridley Scott, Guy Pearce, Idris Elba, Logan Marshall-Green, Noomi Rapace, Michael Fassbender, Charlize TheronRidley Scott, Guy Pearce, Idris Elba, Logan Marshall-Green, Noomi Rapace, Michael Fassbender, Charlize Theron  See more', 'Language': 'English, French', 'Runtime': '2 hours and 4 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 3.2 Ounces', 'Item model number': '2281407', 'Director': 'Ridley Scott', 'Media Format': 'Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 4 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Noomi Rapace, Michael Fassbender, Charlize Theron, Idris Elba, Guy Pearce', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: Love this movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2010: The Year We Make Contact [Blu-ray]\nReview Date: 2015/03/27\nStore: Douglas Rain  (Actor),     Roy Scheider  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['2010: The Year We Make Contact (BD)', 'A new time, a new odyssey, a new chance to confront enigmas arising from the daring Jupiter mission of 2001. Crew members aboard the Leonov will rendezvous with the still-orbiting Discovery. And their fate will rest on the silicon shoulders of the computer they reawaken, HAL-9000. Based on Arthur C. Clarkes 2001: A Space Odyssey sequel, director Peter Hyams spellbinder nominated for 5 Academy Awards* stars Roy Scheider, John Lithgow, Oscar winner** Helen Mirren, Bob Balaban and Keir Dullea.', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 6.81 x 0.55 inches; 1.98 Ounces', 'Item model number': '883929051069', 'Director': 'Peter Hyams', 'Media Format': 'Multiple Formats, Color, NTSC, Blu-ray', 'Run time': '1 hour and 56 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Douglas Rain, Roy Scheider, Candice Bergen, John Lithgow, Helen Mirren', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, German, Dutch, French, Portuguese, Swedish, Finnish, Italian, Danish, Norwegian', 'Producers': 'Peter Hyams', 'Studio': 'Warner Home Video', 'Writers': 'Peter Hyams', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie, one of my faves!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Close Encounters of the Third Kind [Blu-ray]\nReview Date: 2015/03/27\nStore: Richard Dreyfuss  (Actor),     Francois Truffaut  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Richard Dreyfuss stars as cable worker Roy Neary, who along with several other stunned bystanders experience a close encounter of the first kind - witnessing UFOs soaring across the sky. After this life-changing event, the inexplicable vision of a strange, mountain-like formation haunts him. He becomes obsessed with discovering what it represents, much to the dismay of his wife and family. Meanwhile, bizarre occurrences are happening around the world. Government agents have close encounters of the second kind - discovering physical evidence of extraterrestrial visitors in the form of a lost fighter aircraft from World War II and a stranded military ship that disappeared decades earlier only to suddenly reappear in unusual places. Roy continues to chase his vision to a remote area where he and the agents follow the clues that have drawn them to reach a site where they will have a close encounter of the third kind - contact.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Sci-Fi/Fantasy', 'Format': 'Blu-ray, Closed-captioned, NTSC, Dubbed, Widescreen, Subtitled', 'Contributor': 'Teri Garr, Melinda Dillon, Julia Phillips, Francois Truffaut, Steven Spielberg, Close Encounters Prods., Michael Phillips, Richard DreyfussTeri Garr, Melinda Dillon, Julia Phillips, Francois Truffaut, Steven Spielberg, Close Encounters Prods., Michael Phillips, Richard Dreyfuss   See more', 'Language': 'English', 'Runtime': '6 hours and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.44 Ounces', 'Item model number': '25832775', 'Director': 'Steven Spielberg', 'Media Format': 'Blu-ray, Closed-captioned, NTSC, Dubbed, Widescreen, Subtitled', 'Run time': '6 hours and 44 minutes', 'Release date': 'February 14, 2011', 'Actors': 'Richard Dreyfuss, Francois Truffaut, Teri Garr, Melinda Dillon', 'Dubbed': 'French, Spanish', 'Subtitles': 'Arabic, Thai, Korean, English, Portuguese, Mandarin Chinese, French, Spanish', 'Producers': 'Michael Phillips, Julia Phillips', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie, was great price, quality and delivery!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Contact [Blu-ray]\nReview Date: 2015/03/27\nStore: Jodie Foster  (Actor),     Matthew McConaughey  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['Contact (BD)', \"Two-time Oscar winner Jodie Foster stars in this visionary drama based on Carl Sagan's novel about human kind's first encounter with extraterrestial life, directed by another Oscar winner, Robert Zemeckis.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'NTSC, Color, Blu-ray, Blu-ray, Dolby, Anamorphic', 'Contributor': 'Tom Skerritt, Matthew McConaughey, Jodie Foster, James Woods, Robert Zemeckis, John Hurt, Angela BassettTom Skerritt, Matthew McConaughey, Jodie Foster, James Woods, Robert Zemeckis, John Hurt, Angela Bassett   See more', 'Initial release date': '2009-10-06', 'Language': 'German (Dolby Digital 5.1), Italian (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby TrueHD 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1), Portuguese (Dolby Digital 2.0 Stereo)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '883929064144', 'Director': 'Robert Zemeckis', 'Media Format': 'NTSC, Color, Blu-ray, Blu-ray, Dolby, Anamorphic', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Jodie Foster, Matthew McConaughey, James Woods, John Hurt, Tom Skerritt', 'Dubbed': 'Spanish', 'Subtitles': 'English, Italian, German', 'Studio': 'Warner Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie, was great price, quality and delivery!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2001: A Space Odyssey [Blu-ray]\nReview Date: 2015/03/27\nStore: Keir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Love this movie, was great price, quality and delivery!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual exhibits a strong preference for high-quality science fiction and fantasy films, consistently rating them five stars. They favor works by renowned directors like Ridley Scott and Stanley Kubrick, indicating a bias towards established filmmaking excellence and thought-provoking narratives. \n\nCommon themes in their selections revolve around extraterrestrial encounters and existential inquiries, suggesting a fascination with the universe and humanity's role within it. They often prioritize Blu-ray formats and appreciate the visual and audio quality of media, pointing towards a preference for immersive viewing experiences.\n\nQuality is a recurring theme in their feedback, as they consistently praise the overall production value, story depth, and performance of actors, while highlighting the importance of pricing and delivery as factors for repeat purchases. Despite their willingness to pay more for quality films, they express satisfaction when finding good deals, signaling moderate price sensitivity.\n\nOverall, their core preferences align with a love for engaging, high-caliber science fiction films, which combine spectacular visuals with profound thematic explorations, alongside a desire for favorable pricing and quality assurance in purchasing.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Five Stars",
    "text": "Love this movie, was great price, quality and delivery!",
    "images": [],
    "asin": "B00H83EUL2",
    "parent_asin": "B00H83EUL2",
    "user_id": "AHB4RUFBEQPILLJZZ24QG2DPC74Q",
    "timestamp": "2015-03-27 14:59:29",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Gravity",
    "average_rating": 4.5,
    "rating_number": 17610,
    "features": [],
    "description": [
      "Gravity (Blu-Ray)",
      "GRAVITY, directed by Oscar nominee Alfonso Cuaron, stars Oscar winners Sandra Bullock and George Clooney in a heart-pounding thriller that pulls you into the infinite and unforgiving realm of deep space. Bullock plays Dr. Ryan Stone, a brilliant medical engineer on her first shuttle mission, with veteran astronaut Matt Kowalsky (Clooney). But on a seemingly routine spacewalk, disaster strikes. The shuttle is destroyed, leaving Stone and Kowalsky completely alone.",
      "]]>"
    ],
    "price": 8.73,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/511vv0w+3eL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/511vv0w+3eL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81-RRhYFBIL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61ePyAti6lL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61ePyAti6lL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/915A6mOGJGL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Sandra Bullock  (Actor),     George Clooney  (Actor),     Alfonso Cuarón  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Award Winners in Movies & TV",
      "Oscar Central",
      "Past Oscar Winners"
    ],
    "details": {
      "Genre": "Drama, Mystery & Suspense",
      "Format": "Color, Dubbed, NTSC",
      "Contributor": "Sandra Bullock, George Clooney, Alfonso Cuarón",
      "Language": "English",
      "Runtime": "1 hour and 31 minutes",
      "Aspect Ratio": "2.40:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.6 x 5.4 x 6.8 inches; 2.88 Ounces",
      "Item model number": "WHV1000292717BR",
      "Director": "Alfonso Cuarón",
      "Media Format": "Color, Dubbed, NTSC",
      "Run time": "1 hour and 31 minutes",
      "Release date": "February 25, 2014",
      "Actors": "Sandra Bullock, George Clooney",
      "Dubbed": "French, Portuguese, Spanish",
      "Subtitles": "English, French, Portuguese, Spanish",
      "Studio": "WarnerBrothers",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}