{
  "user_id": "AGKIZZF56FLX6Q5KECXCYF5FVGUA",
  "summary": "=== Purchase Information ===\nProduct Title: Charlton Heston Presents the Bible (Four-Pack DVD)\nReview Date: 2002/10/16\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Documentary\nProduct Description: ['In this incredible production, shot on location in the Holy Land. OSCAR winning actor Charleton Heston (Ben-Hur) recaptures all of the passion, power, drama and sheer beauty of these \"Greatest Stories Ever Told\".']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Box set, Color, DVD, NTSC', 'Contributor': 'Heston, Charlton', 'Language': 'English', 'Runtime': '5 hours and 15 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.7 x 5.4 x 2.3 inches; 15.2 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '5 hours and 15 minutes', 'Release date': 'May 29, 2001', 'Actors': 'Heston, Charlton', 'Studio': 'Good Times Video', 'Number of discs': '4'}\nReview Text: I like this tape series, but the DVD scans are VERY POOR quality. They are grainy and almost blurred. The quality of the VHS tapes are much better. There is no reason for this.<br />Save your money. Buy the tapes if you want this series. We can't support people who put out a poor quality product to save money on decent DVD scanning.\nReview Title: Poor Quality\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Matthew: Visual Bible\nReview Date: 2006/12/06\nStore: Richard Kiley  (Actor),     Bruce Marchiano  (Actor),     Regardt van den Bergh  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Experience The Visual Bible\\'s Matthew. This powerful and entertaining film is taken word for word from the text of the New International Version translation. This multi-million dollar production appeals to all ages, and it offers educational, spiritual and entertainment value. \"The goal of The Visual Bible is to put the entire Bible on film using only Scripture to tell the story.\" Filmed on location in Tunisia, Morocco and South Africa, Matthew features a cast of thousands, historically accurate costuming and award-winning directing. The film stars Emmy award-winning actor Richard Kiley as Matthew, and introduces Bruce Marchiano as Jesus.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '019393', 'Director': 'Regardt van den Bergh', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '4 hours and 25 minutes', 'Release date': 'March 11, 2011', 'Actors': 'Richard Kiley, Bruce Marchiano, Gerrit Schoonhoven, Dawid Minnaar, Kevin Smith', 'Studio': 'Edge J27900', 'Number of discs': '2'}\nReview Text: As much as I would like to recommend this movie, I have to admit it is not one of the best movies of Jesus life. It does follow the text of Matthew's gospel essentially word for word, which is, at times, a useful tool.<br /><br />That said, the acting is mediocre. Bruce Marchiano as Jesus is a flop. He just doesn't pull it off convincingly. I often teach a class where I show people clips from different Jesus movies. Marchiano's poor acting often evokes laughter in the group.<br /><br />If you what the best Jesus movie ever done, nothing beats Zeffirelli's TV mini-series Jesus of Nazareth.<br /><br />The two other parts to this series, Acts and John, are done very well.\nReview Title: Good idea...poor acting.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fantastic Four: Rise of the Silver Surfer\nReview Date: 2008/05/03\nStore: Jessica Alba  (Actor),     Ioan Gruffudd  (Actor),     Tim Story  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'Catch a wave of \"terrific adventure\" and \"non-stop action\" (CBS-TV) in this fun and fantastically entertaining smash-hit! \"Invisible Woman: Sue Storm and \"Mr. Fantastic\" Dr. Reed Richards are about to be married when a mysterious alien... the Silver Surfer... crashes the proceedings and heralds Earth\\'s impending destruction. With time running out, the Fantastic Four reluctantly teams up with the nefarious Dr. Doom in a thrilling effort to save our planet!', 'Amazon.com', 'Fantastic Four: Rise of the Silver Surfer', \"is another entertaining romp for the Marvel-superhero franchise. Reed Richards, Mr. Fantastic (Ioan Gruffudd), is treading on thin ice when his fiancée, Sue Storm, the Invisible Woman (Jessica Alba), thinks he's more interested in a series of cosmic phenomena occurring around the earth than in the preparations for their upcoming wedding. Sorry, ladies, but Reed is right. The disturbances are caused by a surge of cosmic power from a mysterious being called the Silver Surfer (an all-CGI creation, modeled by Doug Jones and voiced by Laurence Fishburne), who not only zooms around the skies on his board, but also has enough power to fight the FF, sometimes by turning their own power against them, not only mixing up Sue and Reed, but also Johnny Storm, the Human Torch (Chris Evans), and Ben Grimm, the Thing (Michael Chiklis). But that's not the worst of it. The Surfer is only an opening act, a herald looking for planets that his master, Galactus, can consume for his sustenance.\", 'With its initial installment,', 'Fantastic Four', \"established itself as the superhero franchise that didn't take itself too seriously, and that continues here. There are numerous moments of laugh-out-loud humor, and the most angst they suffer is whether Sue and Reed will ever be able to live a normal family life. (That, and whether they'll ever really get married, of course.) If\", 'Fantastic Four', 'were a normal superhero franchise, the ending would be a knock-down drag-out war with Galactus, featuring the FF in a colossal battle for the planet Earth and the lives of everyone on it.', 'Fantastic Four: Rise of the Silver Surfer', \"just doesn't do that, and we don't quite get the payoff we expected. Effects are dazzling, but the Surfer looks too metallic, more like a skyriding T-1000 robot.\", '--David Horiuchi', 'Fantastic Four: Rise of the Silver Surfer', 'Extras', 'View exclusive clips (including interviews with', 'Fantastic Four', 'Creator Stan Lee and Screenwriter Don Payne), download AIM icons and wallpapers and browse the extensive photo gallery at our', 'Fantastic Four: Rise of the Silver Surfer', 'minisite', '.', 'Beyond', 'Fantastic Four: Rise of the Silver Surfer', 'Fantastic Four', 'Toys & Games', 'Fantastic Four', 'Paperback Series', 'Fantastic Four', 'Comics & Graphic Novels', 'Fantastic Four', 'Video Games', 'Fantastic Four', 'Posters, Stickers and More', 'Fantastic Four', 'Apparel', 'More of the', 'Four', 'on DVD', 'Fantastic Four', 'Extended Cut', 'The Fantastic Four', 'Animated Series', 'Fantastic Four', 'on Blu-Ray', 'Stills from', 'Fantastic Four: Rise of the Silver Surfer']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Michael Chiklis, Jessica Alba, Andre Braugher, Kerry Washington, Tim Story, Julian McMahon, Chris Evans, Laurence Fishburne, Ioan GruffuddMichael Chiklis, Jessica Alba, Andre Braugher, Kerry Washington, Tim Story, Julian McMahon, Chris Evans, Laurence Fishburne, Ioan Gruffudd  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.33 x 7.46 inches; 2.72 Ounces', 'Item model number': '2247077', 'Director': 'Tim Story', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 2, 2007', 'Actors': 'Jessica Alba, Ioan Gruffudd, Chris Evans, Michael Chiklis, Julian McMahon', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: I have in a box in my garage all the Fantastic Four comics that have the Silver Surfer in them and issues 1-15 of the Surfer comics themselves. I was really ready for this movie.<br /><br />What a disappointment! 90% of the movie is banal, uninteresting dialogue. The acting is weak. The sequences with the Surfer are stunning and the movie begs for more interaction with his character and more action between the FF and him.<br /><br />The end is simply a colossal disappointment. I can only guess they ran out of special effects funding before the movie was over and had to end quickly and without a grand battle. As you see the Surfer floating is space, you can almost imagine him saying \"I can't believe I let them blow this movie like this.\"<br /><br />Two stars for the Surfer sequences, nothing for the rest. Save your money. Move along. Nothing to see here!\nReview Title: Missed Opportunity\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Book Of Ruth\nReview Date: 2010/07/27\nStore: Dan Haggerty  (Actor),     Lana Wood  (Actor),     Stephen Patrick Walker  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['The Book of Ruth, is a triumphant love story in the face of adversity.This selfless journey of love and devotion is seen through the eyes of a young widow. Choosing to leave her homeland of Moab, she follows her mother-in-law Naomi to Israel after the death of her husband. Upon reaching Bethlehem, she meets and marries a man named Boz, who is of the Royal House of Judah. This chain of seemingly unrelated events sets the stage for the future kings of the nation of Israel, and the glorious coming of the Messiah.  A Biblical Cinderella story from the archives of the royal Jewish bloodline, this story reveals the redemption of their inheritance through the child Obed, who was the grandfather of King David. Starring Dan Haggerty ( Grizzly Adams ), Lana Wood ( Diamonds are Forever ), Eleese Lester ( Friday Night Lights ), Carman of Carman World Ministries, and newcomer Sherri Morris as Ruth.FOR FANS OF: One Night With The King, Amazing Grace, The Final Inquiry, Ultimate Gift, Faith Like Potatoes']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Faith_&_spirituality', 'Format': 'NTSC, Multiple Formats, Color', 'Contributor': 'Carmen, DJ Perry, Eleese Lester, Lana Wood, Ray Nikolaison, Stephen Patrick Walker, Dan Haggerty, Sherri MorrisCarmen, DJ Perry, Eleese Lester, Lana Wood, Ray Nikolaison, Stephen Patrick Walker, Dan Haggerty, Sherri Morris   See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.4 inches; 2.4 Ounces', 'Item model number': '781868', 'Director': 'Stephen Patrick Walker', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 12, 2010', 'Actors': 'Dan Haggerty, Lana Wood, DJ Perry, Carmen, Sherri Morris', 'Producers': 'Ray Nikolaison, DJ Perry', 'Studio': 'Pure Flix Entertainment', 'Number of discs': '1'}\nReview Text: I really wanted to like this movie. I knew it was a lower budget productiuon and I also understand that the short book of Ruth isn't much material to make a full length movie. And to be fair, they did a good job of not straying too far from the Biblical text.<br /><br />However, the acting is weak and the script worse, really bad at points. Dan Haggerty is the only one who can deliver a line and he has just a few. The characters all look like the came from Iowa, not the Middle East. Little things like all the clothes looking brand new and clean make it look more like a Sunday school play than a modern period piece.<br /><br />With a little better directing and a few different actors, this could have been pretty good. Don't expect too much and you won't be too disappointed.\nReview Title: Disappointed\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bible In Vision: Gospel of Luke\nReview Date: 2013/07/16\nStore: various  (Actor),     David Cohen  (Director)    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: [\"For the first time ever you can see The Bible read from beginning to end, accompanied by images of the art that it inspired. Taking place at the historic church of St. Anne's Lime house , 'The Bible in Vision', which is read by many familiar public figures, is a truly unique opportunity to experience the books of The Bible as never before. The Gospel of Luke tells the traditional story from Jesus birth to his Crucifixion and Resurrection. Luke may not have been an eye witness of Jesus Ministry but wrote after the events, having gathered the best information he could. He may well have been a doctor as he describes eighteen instances of healing.\"]\nAverage Rating: 2.6\nProduct Details: {'Format': 'PAL', 'Contributor': 'David Cohen, Various', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'David Cohen', 'Media Format': 'PAL', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 14, 2012', 'Actors': 'various', 'Studio': 'Haycoh', 'Number of discs': '1'}\nReview Text: Yes, it's basically different people simply reading Luke's Gospel. Most of the readers do a good job. There are some sections where the reading is illustrated with art or video. but a lot of it is simply head shots of the readers. Some of the reading is done very well and is easy to understand. But a number of sections are done in a large church sanctuary and there is a major echo that makes understanding the reading a struggle. Simple sound engineering could have recorded these voices without the echo with a direct line.<br /><br />The disk is too boring to watch and the sound quality too uneven to listen to. The production value is very low. With a little more attention, this could have been very good.\nReview Title: Uneven\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Keith Emerson Band featuring Marc Bonilla- Moscow DVD\nReview Date: 2014/04/23\nStore: Keith Emerson  (Actor),     Marc Bonilla  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Musicals\nProduct Description: ['Keith Emerson is hailed as a keyboard legend. He is known as one of the mostprominent leaders in the progressive rock movement, fusing rock n roll with amyriad of musical styles, such as classical, jazz and world music.Marc Bonilla has played guitar and toured with Toy Matinee as well asrecording two critically acclaimed guitar instrumental albums. For over adecade he has composed and performed for numerous television shows suchas Justified, The PJ s and 90210 as well as major motion pictures including IronMan 2, The Replacements, Scorpion King, and Falling Down, collaborating withsuch notables as James Newton Howard, John Debney, Joel McNeely and SnuffyWalden, and receiving an Emmy award nomination in 2001 for his score forDavid Milch s Big Apple.Filmed 2008 in Moscow, Russia with Dolby Digital 5.1 surround sound.Last year marked Keith Emerson s return as composer and performer with thehighly acclaimed CD, The Keith Emerson Band Featuring Marc Bonilla. This DVDcaptures the live recordings of six songs from that CD.Highlights include re-workings of several classic ELP tracks such as a full versionof Tarkus, Karn Evil 9, Lucky Man, Bitches Crystal and The Barbarian. What distingushes these new arrangements has been the addition of guitarwizard, Marc Bonilla, both as singer and co-arranger. When interviewed recentlyKeith confessed that these new re-constructions with guitar reflected moreaccurately the way he had originally envisioned them.Besides Emerson and Bonilla, the band members include drummer Tony Pia (whohas played with Edgar Winter, Brian Setzer, and is currently with the DoobieBrothers) and multi-faceted newcomer Travis Davis on bass and backing vocals.TRACK LISTING1. Karn Evil 9 (1st impression)2. Piano Concerto (3rd movement)3. Bitches Crystal 4. Malambo 5. Touch And Go6. Lucky Man 7. Miles Away (pt.1)8. Miles Away (pt. 2) 9. Crusaders Cross10. Fugue 11. Marche Train 12. Finale13. The Barbarian 14. Tarkus 15. Nutrocker']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Musicals', 'Format': 'Multiple Formats, Color, NTSC, Dolby, Surround Sound', 'Contributor': 'Marc Bonilla, Keith Emerson, Travs Davis, Tony Pia', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Surround Sound', 'Run time': '1 hour and 10 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Keith Emerson, Marc Bonilla, Travs Davis, Tony Pia', 'Studio': 'Varese Fontana', 'Number of discs': '1'}\nReview Text: If you are an old and grizzled ELP fan like I am and miss the old days, you will love this. This is not simply dull retreads of the old stuff or poorly recorded old concerts. It's some really good retakes on the old ELP songs with enough variation and weaving of new and old tunes and themes to make it truly interesting. Marc Bonilla seem to restrain his tendencies to sound like a lounge lizard and does  a good job of covering the lyrics. Yeah, the drummer is good, but not Carl Palmer.<br /><br />Even so, this is the best music purchase I've made in a log time. Essential for the ELP/Emerson fan.\nReview Title: Absloutely Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/04/05\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Luc Besson'], 'Producers': ['Fanny Besson', 'Luc Besson', 'Virginie Besson-Silla', 'Jc Cheng', 'Camille Courau', 'Mark Gao', 'Dylan Haggerty', 'Gregory Ouanhon'], 'Starring': ['Dane DeHaan', 'Cara Delevingne', 'Clive Owen'], 'Studio': ['EuropaCorp']}\nReview Text: Imaginative idea, great special effects, interesting story ruined by infantile dialogue and a teen age quality love story. Could have been an amazing movie.\nReview Title: Avatar meets Glee without the singing.\nRating: 2.0\n--------------------------------------------------",
  "reference": "Charlton Heston Presents the Bible (Four-Pack DVD)\nRated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Documentary\n['In this incredible production, shot on location in the Holy Land. OSCAR winning actor Charleton Heston (Ben-Hur) recaptures all of the passion, power, drama and sheer beauty of these \"Greatest Stories Ever Told\".']\n{'Genre': 'Drama', 'Format': 'Box set, Color, DVD, NTSC', 'Contributor': 'Heston, Charlton', 'Language': 'English', 'Runtime': '5 hours and 15 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.7 x 5.4 x 2.3 inches; 15.2 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '5 hours and 15 minutes', 'Release date': 'May 29, 2001', 'Actors': 'Heston, Charlton', 'Studio': 'Good Times Video', 'Number of discs': '4'}\nI like this tape series, but the DVD scans are VERY POOR quality. They are grainy and almost blurred. The quality of the VHS tapes are much better. There is no reason for this.<br />Save your money. Buy the tapes if you want this series. We can't support people who put out a poor quality product to save money on decent DVD scanning.\nPoor Quality\nMatthew: Visual Bible\nRichard Kiley  (Actor),     Bruce Marchiano  (Actor),     Regardt van den Bergh  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Experience The Visual Bible\\'s Matthew. This powerful and entertaining film is taken word for word from the text of the New International Version translation. This multi-million dollar production appeals to all ages, and it offers educational, spiritual and entertainment value. \"The goal of The Visual Bible is to put the entire Bible on film using only Scripture to tell the story.\" Filmed on location in Tunisia, Morocco and South Africa, Matthew features a cast of thousands, historically accurate costuming and award-winning directing. The film stars Emmy award-winning actor Richard Kiley as Matthew, and introduces Bruce Marchiano as Jesus.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '019393', 'Director': 'Regardt van den Bergh', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '4 hours and 25 minutes', 'Release date': 'March 11, 2011', 'Actors': 'Richard Kiley, Bruce Marchiano, Gerrit Schoonhoven, Dawid Minnaar, Kevin Smith', 'Studio': 'Edge J27900', 'Number of discs': '2'}\nAs much as I would like to recommend this movie, I have to admit it is not one of the best movies of Jesus life. It does follow the text of Matthew's gospel essentially word for word, which is, at times, a useful tool.<br /><br />That said, the acting is mediocre. Bruce Marchiano as Jesus is a flop. He just doesn't pull it off convincingly. I often teach a class where I show people clips from different Jesus movies. Marchiano's poor acting often evokes laughter in the group.<br /><br />If you what the best Jesus movie ever done, nothing beats Zeffirelli's TV mini-series Jesus of Nazareth.<br /><br />The two other parts to this series, Acts and John, are done very well.\nGood idea...poor acting.\nFantastic Four: Rise of the Silver Surfer\nJessica Alba  (Actor),     Ioan Gruffudd  (Actor),     Tim Story  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'Catch a wave of \"terrific adventure\" and \"non-stop action\" (CBS-TV) in this fun and fantastically entertaining smash-hit! \"Invisible Woman: Sue Storm and \"Mr. Fantastic\" Dr. Reed Richards are about to be married when a mysterious alien... the Silver Surfer... crashes the proceedings and heralds Earth\\'s impending destruction. With time running out, the Fantastic Four reluctantly teams up with the nefarious Dr. Doom in a thrilling effort to save our planet!', 'Amazon.com', 'Fantastic Four: Rise of the Silver Surfer', \"is another entertaining romp for the Marvel-superhero franchise. Reed Richards, Mr. Fantastic (Ioan Gruffudd), is treading on thin ice when his fiancée, Sue Storm, the Invisible Woman (Jessica Alba), thinks he's more interested in a series of cosmic phenomena occurring around the earth than in the preparations for their upcoming wedding. Sorry, ladies, but Reed is right. The disturbances are caused by a surge of cosmic power from a mysterious being called the Silver Surfer (an all-CGI creation, modeled by Doug Jones and voiced by Laurence Fishburne), who not only zooms around the skies on his board, but also has enough power to fight the FF, sometimes by turning their own power against them, not only mixing up Sue and Reed, but also Johnny Storm, the Human Torch (Chris Evans), and Ben Grimm, the Thing (Michael Chiklis). But that's not the worst of it. The Surfer is only an opening act, a herald looking for planets that his master, Galactus, can consume for his sustenance.\", 'With its initial installment,', 'Fantastic Four', \"established itself as the superhero franchise that didn't take itself too seriously, and that continues here. There are numerous moments of laugh-out-loud humor, and the most angst they suffer is whether Sue and Reed will ever be able to live a normal family life. (That, and whether they'll ever really get married, of course.) If\", 'Fantastic Four', 'were a normal superhero franchise, the ending would be a knock-down drag-out war with Galactus, featuring the FF in a colossal battle for the planet Earth and the lives of everyone on it.', 'Fantastic Four: Rise of the Silver Surfer', \"just doesn't do that, and we don't quite get the payoff we expected. Effects are dazzling, but the Surfer looks too metallic, more like a skyriding T-1000 robot.\", '--David Horiuchi', 'Fantastic Four: Rise of the Silver Surfer', 'Extras', 'View exclusive clips (including interviews with', 'Fantastic Four', 'Creator Stan Lee and Screenwriter Don Payne), download AIM icons and wallpapers and browse the extensive photo gallery at our', 'Fantastic Four: Rise of the Silver Surfer', 'minisite', '.', 'Beyond', 'Fantastic Four: Rise of the Silver Surfer', 'Fantastic Four', 'Toys & Games', 'Fantastic Four', 'Paperback Series', 'Fantastic Four', 'Comics & Graphic Novels', 'Fantastic Four', 'Video Games', 'Fantastic Four', 'Posters, Stickers and More', 'Fantastic Four', 'Apparel', 'More of the', 'Four', 'on DVD', 'Fantastic Four', 'Extended Cut', 'The Fantastic Four', 'Animated Series', 'Fantastic Four', 'on Blu-Ray', 'Stills from', 'Fantastic Four: Rise of the Silver Surfer']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Michael Chiklis, Jessica Alba, Andre Braugher, Kerry Washington, Tim Story, Julian McMahon, Chris Evans, Laurence Fishburne, Ioan GruffuddMichael Chiklis, Jessica Alba, Andre Braugher, Kerry Washington, Tim Story, Julian McMahon, Chris Evans, Laurence Fishburne, Ioan Gruffudd  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.33 x 7.46 inches; 2.72 Ounces', 'Item model number': '2247077', 'Director': 'Tim Story', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 2, 2007', 'Actors': 'Jessica Alba, Ioan Gruffudd, Chris Evans, Michael Chiklis, Julian McMahon', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nI have in a box in my garage all the Fantastic Four comics that have the Silver Surfer in them and issues 1-15 of the Surfer comics themselves. I was really ready for this movie.<br /><br />What a disappointment! 90% of the movie is banal, uninteresting dialogue. The acting is weak. The sequences with the Surfer are stunning and the movie begs for more interaction with his character and more action between the FF and him.<br /><br />The end is simply a colossal disappointment. I can only guess they ran out of special effects funding before the movie was over and had to end quickly and without a grand battle. As you see the Surfer floating is space, you can almost imagine him saying \"I can't believe I let them blow this movie like this.\"<br /><br />Two stars for the Surfer sequences, nothing for the rest. Save your money. Move along. Nothing to see here!\nMissed Opportunity\nThe Book Of Ruth\nDan Haggerty  (Actor),     Lana Wood  (Actor),     Stephen Patrick Walker  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['The Book of Ruth, is a triumphant love story in the face of adversity.This selfless journey of love and devotion is seen through the eyes of a young widow. Choosing to leave her homeland of Moab, she follows her mother-in-law Naomi to Israel after the death of her husband. Upon reaching Bethlehem, she meets and marries a man named Boz, who is of the Royal House of Judah. This chain of seemingly unrelated events sets the stage for the future kings of the nation of Israel, and the glorious coming of the Messiah.  A Biblical Cinderella story from the archives of the royal Jewish bloodline, this story reveals the redemption of their inheritance through the child Obed, who was the grandfather of King David. Starring Dan Haggerty ( Grizzly Adams ), Lana Wood ( Diamonds are Forever ), Eleese Lester ( Friday Night Lights ), Carman of Carman World Ministries, and newcomer Sherri Morris as Ruth.FOR FANS OF: One Night With The King, Amazing Grace, The Final Inquiry, Ultimate Gift, Faith Like Potatoes']\n{'Genre': 'Faith_&_spirituality', 'Format': 'NTSC, Multiple Formats, Color', 'Contributor': 'Carmen, DJ Perry, Eleese Lester, Lana Wood, Ray Nikolaison, Stephen Patrick Walker, Dan Haggerty, Sherri MorrisCarmen, DJ Perry, Eleese Lester, Lana Wood, Ray Nikolaison, Stephen Patrick Walker, Dan Haggerty, Sherri Morris   See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.4 inches; 2.4 Ounces', 'Item model number': '781868', 'Director': 'Stephen Patrick Walker', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 12, 2010', 'Actors': 'Dan Haggerty, Lana Wood, DJ Perry, Carmen, Sherri Morris', 'Producers': 'Ray Nikolaison, DJ Perry', 'Studio': 'Pure Flix Entertainment', 'Number of discs': '1'}\nI really wanted to like this movie. I knew it was a lower budget productiuon and I also understand that the short book of Ruth isn't much material to make a full length movie. And to be fair, they did a good job of not straying too far from the Biblical text.<br /><br />However, the acting is weak and the script worse, really bad at points. Dan Haggerty is the only one who can deliver a line and he has just a few. The characters all look like the came from Iowa, not the Middle East. Little things like all the clothes looking brand new and clean make it look more like a Sunday school play than a modern period piece.<br /><br />With a little better directing and a few different actors, this could have been pretty good. Don't expect too much and you won't be too disappointed.\nDisappointed\nBible In Vision: Gospel of Luke\nvarious  (Actor),     David Cohen  (Director)    Format: DVD\nMovies & TV, Featured Categories, DVD\n[\"For the first time ever you can see The Bible read from beginning to end, accompanied by images of the art that it inspired. Taking place at the historic church of St. Anne's Lime house , 'The Bible in Vision', which is read by many familiar public figures, is a truly unique opportunity to experience the books of The Bible as never before. The Gospel of Luke tells the traditional story from Jesus birth to his Crucifixion and Resurrection. Luke may not have been an eye witness of Jesus Ministry but wrote after the events, having gathered the best information he could. He may well have been a doctor as he describes eighteen instances of healing.\"]\n{'Format': 'PAL', 'Contributor': 'David Cohen, Various', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'David Cohen', 'Media Format': 'PAL', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 14, 2012', 'Actors': 'various', 'Studio': 'Haycoh', 'Number of discs': '1'}\nYes, it's basically different people simply reading Luke's Gospel. Most of the readers do a good job. There are some sections where the reading is illustrated with art or video. but a lot of it is simply head shots of the readers. Some of the reading is done very well and is easy to understand. But a number of sections are done in a large church sanctuary and there is a major echo that makes understanding the reading a struggle. Simple sound engineering could have recorded these voices without the echo with a direct line.<br /><br />The disk is too boring to watch and the sound quality too uneven to listen to. The production value is very low. With a little more attention, this could have been very good.\nUneven\nKeith Emerson Band featuring Marc Bonilla- Moscow DVD\nKeith Emerson  (Actor),     Marc Bonilla  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Musicals\n['Keith Emerson is hailed as a keyboard legend. He is known as one of the mostprominent leaders in the progressive rock movement, fusing rock n roll with amyriad of musical styles, such as classical, jazz and world music.Marc Bonilla has played guitar and toured with Toy Matinee as well asrecording two critically acclaimed guitar instrumental albums. For over adecade he has composed and performed for numerous television shows suchas Justified, The PJ s and 90210 as well as major motion pictures including IronMan 2, The Replacements, Scorpion King, and Falling Down, collaborating withsuch notables as James Newton Howard, John Debney, Joel McNeely and SnuffyWalden, and receiving an Emmy award nomination in 2001 for his score forDavid Milch s Big Apple.Filmed 2008 in Moscow, Russia with Dolby Digital 5.1 surround sound.Last year marked Keith Emerson s return as composer and performer with thehighly acclaimed CD, The Keith Emerson Band Featuring Marc Bonilla. This DVDcaptures the live recordings of six songs from that CD.Highlights include re-workings of several classic ELP tracks such as a full versionof Tarkus, Karn Evil 9, Lucky Man, Bitches Crystal and The Barbarian. What distingushes these new arrangements has been the addition of guitarwizard, Marc Bonilla, both as singer and co-arranger. When interviewed recentlyKeith confessed that these new re-constructions with guitar reflected moreaccurately the way he had originally envisioned them.Besides Emerson and Bonilla, the band members include drummer Tony Pia (whohas played with Edgar Winter, Brian Setzer, and is currently with the DoobieBrothers) and multi-faceted newcomer Travis Davis on bass and backing vocals.TRACK LISTING1. Karn Evil 9 (1st impression)2. Piano Concerto (3rd movement)3. Bitches Crystal 4. Malambo 5. Touch And Go6. Lucky Man 7. Miles Away (pt.1)8. Miles Away (pt. 2) 9. Crusaders Cross10. Fugue 11. Marche Train 12. Finale13. The Barbarian 14. Tarkus 15. Nutrocker']\n{'Genre': 'Musicals', 'Format': 'Multiple Formats, Color, NTSC, Dolby, Surround Sound', 'Contributor': 'Marc Bonilla, Keith Emerson, Travs Davis, Tony Pia', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Surround Sound', 'Run time': '1 hour and 10 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Keith Emerson, Marc Bonilla, Travs Davis, Tony Pia', 'Studio': 'Varese Fontana', 'Number of discs': '1'}\nIf you are an old and grizzled ELP fan like I am and miss the old days, you will love this. This is not simply dull retreads of the old stuff or poorly recorded old concerts. It's some really good retakes on the old ELP songs with enough variation and weaving of new and old tunes and themes to make it truly interesting. Marc Bonilla seem to restrain his tendencies to sound like a lounge lizard and does  a good job of covering the lyrics. Yeah, the drummer is good, but not Carl Palmer.<br /><br />Even so, this is the best music purchase I've made in a log time. Essential for the ELP/Emerson fan.\nAbsloutely Wonderful\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Luc Besson'], 'Producers': ['Fanny Besson', 'Luc Besson', 'Virginie Besson-Silla', 'Jc Cheng', 'Camille Courau', 'Mark Gao', 'Dylan Haggerty', 'Gregory Ouanhon'], 'Starring': ['Dane DeHaan', 'Cara Delevingne', 'Clive Owen'], 'Studio': ['EuropaCorp']}\nImaginative idea, great special effects, interesting story ruined by infantile dialogue and a teen age quality love story. Could have been an amazing movie.\nAvatar meets Glee without the singing.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Charlton Heston Presents the Bible (Four-Pack DVD)\nReview Date: 2002/10/16\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Documentary\nProduct Description: ['In this incredible production, shot on location in the Holy Land. OSCAR winning actor Charleton Heston (Ben-Hur) recaptures all of the passion, power, drama and sheer beauty of these \"Greatest Stories Ever Told\".']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Box set, Color, DVD, NTSC', 'Contributor': 'Heston, Charlton', 'Language': 'English', 'Runtime': '5 hours and 15 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.7 x 5.4 x 2.3 inches; 15.2 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '5 hours and 15 minutes', 'Release date': 'May 29, 2001', 'Actors': 'Heston, Charlton', 'Studio': 'Good Times Video', 'Number of discs': '4'}\nReview Text: I like this tape series, but the DVD scans are VERY POOR quality. They are grainy and almost blurred. The quality of the VHS tapes are much better. There is no reason for this.<br />Save your money. Buy the tapes if you want this series. We can't support people who put out a poor quality product to save money on decent DVD scanning.\nReview Title: Poor Quality\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Matthew: Visual Bible\nReview Date: 2006/12/06\nStore: Richard Kiley  (Actor),     Bruce Marchiano  (Actor),     Regardt van den Bergh  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Experience The Visual Bible\\'s Matthew. This powerful and entertaining film is taken word for word from the text of the New International Version translation. This multi-million dollar production appeals to all ages, and it offers educational, spiritual and entertainment value. \"The goal of The Visual Bible is to put the entire Bible on film using only Scripture to tell the story.\" Filmed on location in Tunisia, Morocco and South Africa, Matthew features a cast of thousands, historically accurate costuming and award-winning directing. The film stars Emmy award-winning actor Richard Kiley as Matthew, and introduces Bruce Marchiano as Jesus.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '019393', 'Director': 'Regardt van den Bergh', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '4 hours and 25 minutes', 'Release date': 'March 11, 2011', 'Actors': 'Richard Kiley, Bruce Marchiano, Gerrit Schoonhoven, Dawid Minnaar, Kevin Smith', 'Studio': 'Edge J27900', 'Number of discs': '2'}\nReview Text: As much as I would like to recommend this movie, I have to admit it is not one of the best movies of Jesus life. It does follow the text of Matthew's gospel essentially word for word, which is, at times, a useful tool.<br /><br />That said, the acting is mediocre. Bruce Marchiano as Jesus is a flop. He just doesn't pull it off convincingly. I often teach a class where I show people clips from different Jesus movies. Marchiano's poor acting often evokes laughter in the group.<br /><br />If you what the best Jesus movie ever done, nothing beats Zeffirelli's TV mini-series Jesus of Nazareth.<br /><br />The two other parts to this series, Acts and John, are done very well.\nReview Title: Good idea...poor acting.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fantastic Four: Rise of the Silver Surfer\nReview Date: 2008/05/03\nStore: Jessica Alba  (Actor),     Ioan Gruffudd  (Actor),     Tim Story  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'Catch a wave of \"terrific adventure\" and \"non-stop action\" (CBS-TV) in this fun and fantastically entertaining smash-hit! \"Invisible Woman: Sue Storm and \"Mr. Fantastic\" Dr. Reed Richards are about to be married when a mysterious alien... the Silver Surfer... crashes the proceedings and heralds Earth\\'s impending destruction. With time running out, the Fantastic Four reluctantly teams up with the nefarious Dr. Doom in a thrilling effort to save our planet!', 'Amazon.com', 'Fantastic Four: Rise of the Silver Surfer', \"is another entertaining romp for the Marvel-superhero franchise. Reed Richards, Mr. Fantastic (Ioan Gruffudd), is treading on thin ice when his fiancée, Sue Storm, the Invisible Woman (Jessica Alba), thinks he's more interested in a series of cosmic phenomena occurring around the earth than in the preparations for their upcoming wedding. Sorry, ladies, but Reed is right. The disturbances are caused by a surge of cosmic power from a mysterious being called the Silver Surfer (an all-CGI creation, modeled by Doug Jones and voiced by Laurence Fishburne), who not only zooms around the skies on his board, but also has enough power to fight the FF, sometimes by turning their own power against them, not only mixing up Sue and Reed, but also Johnny Storm, the Human Torch (Chris Evans), and Ben Grimm, the Thing (Michael Chiklis). But that's not the worst of it. The Surfer is only an opening act, a herald looking for planets that his master, Galactus, can consume for his sustenance.\", 'With its initial installment,', 'Fantastic Four', \"established itself as the superhero franchise that didn't take itself too seriously, and that continues here. There are numerous moments of laugh-out-loud humor, and the most angst they suffer is whether Sue and Reed will ever be able to live a normal family life. (That, and whether they'll ever really get married, of course.) If\", 'Fantastic Four', 'were a normal superhero franchise, the ending would be a knock-down drag-out war with Galactus, featuring the FF in a colossal battle for the planet Earth and the lives of everyone on it.', 'Fantastic Four: Rise of the Silver Surfer', \"just doesn't do that, and we don't quite get the payoff we expected. Effects are dazzling, but the Surfer looks too metallic, more like a skyriding T-1000 robot.\", '--David Horiuchi', 'Fantastic Four: Rise of the Silver Surfer', 'Extras', 'View exclusive clips (including interviews with', 'Fantastic Four', 'Creator Stan Lee and Screenwriter Don Payne), download AIM icons and wallpapers and browse the extensive photo gallery at our', 'Fantastic Four: Rise of the Silver Surfer', 'minisite', '.', 'Beyond', 'Fantastic Four: Rise of the Silver Surfer', 'Fantastic Four', 'Toys & Games', 'Fantastic Four', 'Paperback Series', 'Fantastic Four', 'Comics & Graphic Novels', 'Fantastic Four', 'Video Games', 'Fantastic Four', 'Posters, Stickers and More', 'Fantastic Four', 'Apparel', 'More of the', 'Four', 'on DVD', 'Fantastic Four', 'Extended Cut', 'The Fantastic Four', 'Animated Series', 'Fantastic Four', 'on Blu-Ray', 'Stills from', 'Fantastic Four: Rise of the Silver Surfer']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Michael Chiklis, Jessica Alba, Andre Braugher, Kerry Washington, Tim Story, Julian McMahon, Chris Evans, Laurence Fishburne, Ioan GruffuddMichael Chiklis, Jessica Alba, Andre Braugher, Kerry Washington, Tim Story, Julian McMahon, Chris Evans, Laurence Fishburne, Ioan Gruffudd  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.33 x 7.46 inches; 2.72 Ounces', 'Item model number': '2247077', 'Director': 'Tim Story', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 2, 2007', 'Actors': 'Jessica Alba, Ioan Gruffudd, Chris Evans, Michael Chiklis, Julian McMahon', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: I have in a box in my garage all the Fantastic Four comics that have the Silver Surfer in them and issues 1-15 of the Surfer comics themselves. I was really ready for this movie.<br /><br />What a disappointment! 90% of the movie is banal, uninteresting dialogue. The acting is weak. The sequences with the Surfer are stunning and the movie begs for more interaction with his character and more action between the FF and him.<br /><br />The end is simply a colossal disappointment. I can only guess they ran out of special effects funding before the movie was over and had to end quickly and without a grand battle. As you see the Surfer floating is space, you can almost imagine him saying \"I can't believe I let them blow this movie like this.\"<br /><br />Two stars for the Surfer sequences, nothing for the rest. Save your money. Move along. Nothing to see here!\nReview Title: Missed Opportunity\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Book Of Ruth\nReview Date: 2010/07/27\nStore: Dan Haggerty  (Actor),     Lana Wood  (Actor),     Stephen Patrick Walker  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['The Book of Ruth, is a triumphant love story in the face of adversity.This selfless journey of love and devotion is seen through the eyes of a young widow. Choosing to leave her homeland of Moab, she follows her mother-in-law Naomi to Israel after the death of her husband. Upon reaching Bethlehem, she meets and marries a man named Boz, who is of the Royal House of Judah. This chain of seemingly unrelated events sets the stage for the future kings of the nation of Israel, and the glorious coming of the Messiah.  A Biblical Cinderella story from the archives of the royal Jewish bloodline, this story reveals the redemption of their inheritance through the child Obed, who was the grandfather of King David. Starring Dan Haggerty ( Grizzly Adams ), Lana Wood ( Diamonds are Forever ), Eleese Lester ( Friday Night Lights ), Carman of Carman World Ministries, and newcomer Sherri Morris as Ruth.FOR FANS OF: One Night With The King, Amazing Grace, The Final Inquiry, Ultimate Gift, Faith Like Potatoes']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Faith_&_spirituality', 'Format': 'NTSC, Multiple Formats, Color', 'Contributor': 'Carmen, DJ Perry, Eleese Lester, Lana Wood, Ray Nikolaison, Stephen Patrick Walker, Dan Haggerty, Sherri MorrisCarmen, DJ Perry, Eleese Lester, Lana Wood, Ray Nikolaison, Stephen Patrick Walker, Dan Haggerty, Sherri Morris   See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.4 inches; 2.4 Ounces', 'Item model number': '781868', 'Director': 'Stephen Patrick Walker', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 12, 2010', 'Actors': 'Dan Haggerty, Lana Wood, DJ Perry, Carmen, Sherri Morris', 'Producers': 'Ray Nikolaison, DJ Perry', 'Studio': 'Pure Flix Entertainment', 'Number of discs': '1'}\nReview Text: I really wanted to like this movie. I knew it was a lower budget productiuon and I also understand that the short book of Ruth isn't much material to make a full length movie. And to be fair, they did a good job of not straying too far from the Biblical text.<br /><br />However, the acting is weak and the script worse, really bad at points. Dan Haggerty is the only one who can deliver a line and he has just a few. The characters all look like the came from Iowa, not the Middle East. Little things like all the clothes looking brand new and clean make it look more like a Sunday school play than a modern period piece.<br /><br />With a little better directing and a few different actors, this could have been pretty good. Don't expect too much and you won't be too disappointed.\nReview Title: Disappointed\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bible In Vision: Gospel of Luke\nReview Date: 2013/07/16\nStore: various  (Actor),     David Cohen  (Director)    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: [\"For the first time ever you can see The Bible read from beginning to end, accompanied by images of the art that it inspired. Taking place at the historic church of St. Anne's Lime house , 'The Bible in Vision', which is read by many familiar public figures, is a truly unique opportunity to experience the books of The Bible as never before. The Gospel of Luke tells the traditional story from Jesus birth to his Crucifixion and Resurrection. Luke may not have been an eye witness of Jesus Ministry but wrote after the events, having gathered the best information he could. He may well have been a doctor as he describes eighteen instances of healing.\"]\nAverage Rating: 2.6\nProduct Details: {'Format': 'PAL', 'Contributor': 'David Cohen, Various', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'David Cohen', 'Media Format': 'PAL', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 14, 2012', 'Actors': 'various', 'Studio': 'Haycoh', 'Number of discs': '1'}\nReview Text: Yes, it's basically different people simply reading Luke's Gospel. Most of the readers do a good job. There are some sections where the reading is illustrated with art or video. but a lot of it is simply head shots of the readers. Some of the reading is done very well and is easy to understand. But a number of sections are done in a large church sanctuary and there is a major echo that makes understanding the reading a struggle. Simple sound engineering could have recorded these voices without the echo with a direct line.<br /><br />The disk is too boring to watch and the sound quality too uneven to listen to. The production value is very low. With a little more attention, this could have been very good.\nReview Title: Uneven\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Keith Emerson Band featuring Marc Bonilla- Moscow DVD\nReview Date: 2014/04/23\nStore: Keith Emerson  (Actor),     Marc Bonilla  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Musicals\nProduct Description: ['Keith Emerson is hailed as a keyboard legend. He is known as one of the mostprominent leaders in the progressive rock movement, fusing rock n roll with amyriad of musical styles, such as classical, jazz and world music.Marc Bonilla has played guitar and toured with Toy Matinee as well asrecording two critically acclaimed guitar instrumental albums. For over adecade he has composed and performed for numerous television shows suchas Justified, The PJ s and 90210 as well as major motion pictures including IronMan 2, The Replacements, Scorpion King, and Falling Down, collaborating withsuch notables as James Newton Howard, John Debney, Joel McNeely and SnuffyWalden, and receiving an Emmy award nomination in 2001 for his score forDavid Milch s Big Apple.Filmed 2008 in Moscow, Russia with Dolby Digital 5.1 surround sound.Last year marked Keith Emerson s return as composer and performer with thehighly acclaimed CD, The Keith Emerson Band Featuring Marc Bonilla. This DVDcaptures the live recordings of six songs from that CD.Highlights include re-workings of several classic ELP tracks such as a full versionof Tarkus, Karn Evil 9, Lucky Man, Bitches Crystal and The Barbarian. What distingushes these new arrangements has been the addition of guitarwizard, Marc Bonilla, both as singer and co-arranger. When interviewed recentlyKeith confessed that these new re-constructions with guitar reflected moreaccurately the way he had originally envisioned them.Besides Emerson and Bonilla, the band members include drummer Tony Pia (whohas played with Edgar Winter, Brian Setzer, and is currently with the DoobieBrothers) and multi-faceted newcomer Travis Davis on bass and backing vocals.TRACK LISTING1. Karn Evil 9 (1st impression)2. Piano Concerto (3rd movement)3. Bitches Crystal 4. Malambo 5. Touch And Go6. Lucky Man 7. Miles Away (pt.1)8. Miles Away (pt. 2) 9. Crusaders Cross10. Fugue 11. Marche Train 12. Finale13. The Barbarian 14. Tarkus 15. Nutrocker']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Musicals', 'Format': 'Multiple Formats, Color, NTSC, Dolby, Surround Sound', 'Contributor': 'Marc Bonilla, Keith Emerson, Travs Davis, Tony Pia', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Surround Sound', 'Run time': '1 hour and 10 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Keith Emerson, Marc Bonilla, Travs Davis, Tony Pia', 'Studio': 'Varese Fontana', 'Number of discs': '1'}\nReview Text: If you are an old and grizzled ELP fan like I am and miss the old days, you will love this. This is not simply dull retreads of the old stuff or poorly recorded old concerts. It's some really good retakes on the old ELP songs with enough variation and weaving of new and old tunes and themes to make it truly interesting. Marc Bonilla seem to restrain his tendencies to sound like a lounge lizard and does  a good job of covering the lyrics. Yeah, the drummer is good, but not Carl Palmer.<br /><br />Even so, this is the best music purchase I've made in a log time. Essential for the ELP/Emerson fan.\nReview Title: Absloutely Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/04/05\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Luc Besson'], 'Producers': ['Fanny Besson', 'Luc Besson', 'Virginie Besson-Silla', 'Jc Cheng', 'Camille Courau', 'Mark Gao', 'Dylan Haggerty', 'Gregory Ouanhon'], 'Starring': ['Dane DeHaan', 'Cara Delevingne', 'Clive Owen'], 'Studio': ['EuropaCorp']}\nReview Text: Imaginative idea, great special effects, interesting story ruined by infantile dialogue and a teen age quality love story. Could have been an amazing movie.\nReview Title: Avatar meets Glee without the singing.\nRating: 2.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a strong preference for movies with biblical or historical themes, as seen in their consistent purchases of faith-based and documentary films. Despite their interest, they often express disappointment with the quality of both production and acting, regularly rating these films poorly when faced with subpar execution, particularly citing issues with acting and script quality.\n\nCommon themes across their selections indicate a taste for both educational and entertainment values. This shopper is drawn to genres such as drama and action, but expectations for quality are critical. They show a low tolerance for poor production value, frequently labeling items as a disappointment when they don't meet anticipated standards. Their feedback suggests a blend of value-seeking behavior, particularly for products reflecting their interests in biblical narratives or significant historical retellings.\n\nPrice sensitivity appears moderate: while they assess value based on production quality, they have shown willingness to purchase lower-budget options, albeit with expressed caution regarding their expectations of quality. Overall, their core preferences revolve around high-quality, meaningful content related to biblical themes, with a notable critique of execution in acting and overall production.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Classic Western Comody",
    "text": "They don't make 'em like this anymore. Fantastic cast. Great farce storyline that holds together. You will love this!",
    "images": [],
    "asin": "B000056H2I",
    "parent_asin": "B000056H2I",
    "user_id": "AGKIZZF56FLX6Q5KECXCYF5FVGUA",
    "timestamp": "2021-12-02 03:36:36.565000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The Hallelujah Trail [DVD]",
    "average_rating": 4.5,
    "rating_number": 479,
    "features": [],
    "description": [
      "Acclaimed director John Sturges (The Magnificent Seven, Bad Day at Black Rock, Gunfight at the O.K. Corral) turns the legends of the West upside down in this rip-roaring western comedy about the year Denver was nearly devastated by a droughtof whiskeyand had to have fortywagonloads imported through very harshand very thirstyterritory! Academy AwardÂ(r) winners* Burt Lancaster and Martin Landau team with OscarÂ(r) nominee** Lee Remick inthis beautifully filmed epic adventure that \"wins both laughs and thrills\" (The Hollywood Reporter)! Also starring Jim Hutton, Brian Keith and Donald Pleasence, this irreverent and literally dry look at frontier life is \"possibly the funniest western ever made\" (Los Angeles Times)!"
    ],
    "price": 23.0,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51MCS93FXHL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51MCS93FXHL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Burt Lancaster  (Actor),     Lee Remick  (Actor),     John Sturges  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD",
    "categories": [
      "Movies & TV",
      "MGM Home Entertainment",
      "All MGM Titles"
    ],
    "details": {
      "Genre": "Comedy, Westerns, Action & Adventure",
      "Format": "Closed-captioned, Color, DVD, Subtitled, Widescreen, NTSC",
      "Contributor": "John Sturges, Martin Landau, Jim Hutton, John Gay, John Anderson, Brian Keith, Lee Remick, Tom Stern, Donald Pleasence, Dub Taylor, William Gulick, Whit Bissell, Burt Lancaster, Pamela Tiffin, Robert J. WilkeJohn Sturges, Martin Landau, Jim Hutton, John Gay, John Anderson, Brian Keith, Lee Remick, Tom Stern, Donald Pleasence, Dub Taylor, William Gulick, Whit Bissell, Burt Lancaster, Pamela Tiffin, Robert J. Wilke  See more",
      "Language": "Unqualified, English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo)",
      "Runtime": "2 hours and 45 minutes",
      "Aspect Ratio": "2.35:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "Unrated (Not Rated)",
      "Product Dimensions": "7.75 x 5.5 x 0.5 inches; 0.01 Ounces",
      "Director": "John Sturges",
      "Media Format": "Closed-captioned, Color, DVD, Subtitled, Widescreen, NTSC",
      "Run time": "2 hours and 45 minutes",
      "Release date": "March 20, 2001",
      "Actors": "Burt Lancaster, Lee Remick, Jim Hutton, Pamela Tiffin, Donald Pleasence",
      "Subtitles": "Spanish, French",
      "Studio": "MGM (Video & DVD)",
      "Writers": "John Gay, William Gulick",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}