{
  "user_id": "AFPF2CONJ33FNFKOEQ2TUNWQJTFQ",
  "summary": "=== Purchase Information ===\nProduct Title: Creature Comforts - The Complete Second Season\nReview Date: 2007/01/27\nStore: Nick Park  (Director),     Richard Goleszowski  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Funnier and wittier than ever before, Creature Comforts returns for a second series of the highly acclaimed animation from Nick Park and Aardman. CREATURE COMFORTS is a brilliant and hilarious claymation series about the lives of animals as told by the animals themselves. Unscripted and unashamedly funny, the British public once again speaks through the mouths of their plasticine counterparts. Interviews with these lovable claymation creatures leave no stone unturned, no tree unclimbed, no sea uncrossed in the quest to discover what our fine-finned, furred and feathered friends really think about the issues that are closest to their hearts. Join the return of some favorite characters including Trixie and Captain Cuddlepuss, the Dog and Cat, Fluffy the Hampster and Clement the Bloodhound.', 'Amazon.com', 'Like everything else from the geniuses at Aardman Animations, the second season of', 'Creature Comforts', 'is absolutely brilliant. As conceived by Oscar®-winning', 'Creature Comforts', 'animator Nick Park (of Wallace and Gromit fame), the premise of this limited series is deceptively simple, but when you add the Aardman magic, it evolves into something utterly sublime: an endlessly clever and intimately revealing portrait of contemporary British society, originating as live recordings of \"the great British public\" then transformed through Aardman animation into a menagerie of talking animals, each bursting with humor, insight, and a rich variety of slapstick gags and memorable expressions. It\\'s a rare kind of creative alchemy that takes place before our eyes: From original voice recordings to the finished product, each nine-minute episode is a masterpiece of anthropomorphic ingenuity, introducing us to a colorful cast of critters that reflect their real-life human counterparts as well as the cleverness of the animators themselves. Think of it as an inter-species exchange program, where chatty old ladies in a retirement home are transformed into chatty old bats dangling from a rafter, or a pair of buddies in their early 30s turn into witty slugs with a knack for whistling and making faces.', 'The perfectionism that has become Aardman\\'s trademark is evident throughout these 12 hilarious episodes, each devoted to a single topic (Impressions, Sport, Monarchy Business, Communication, Self-Image, etc.) and animated in plasticene to emphasize wildly inventive visual translations of everyday conversation. The \"casting\" is flawless, comedic timing is impeccable, and abundant bits of throwaway business ensure that you\\'ll see something new with every viewing. Meticulously crafted sets, props, and backdrops complete the illusion, and the final result is artistry of the highest order, combined with a heartwarming humanism that\\'s both universally appealing and quintessentially British. For everyone involved,', 'Creature Comforts', 'guarantees a delightful kind of immortality, and the rest of us get to share in the fun.', 'This two-disc set also includes the acclaimed Aardman holiday short', 'Merry Christmas Everybody!', ', and disc 2 includes a wealth of behind-the-scenes features delving into all aspects of Aardman\\'s arduous animation process. There\\'s a \"making of Season 2\" featurette covering the overall production process; \"The People Behind the Puppets\" shows how the British interviewees are matched with their animated animal counterparts; and \"Animated Conversations\" follows several animators as they struggle with the painstaking process of matching their creatures\\' mouth-movements with pre-recorded dialogue. Also included is \"The Countryside Code,\" an Aardman-animated public service ecology commercial promoting preservation of the British countryside.', '--Jeff Shannon']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Animation, Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Richard Goleszowski, Nick Park', 'Language': 'Unqualified, English (Dolby Digital 2.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 2.88 Ounces', 'Director': 'Nick Park, Richard Goleszowski', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 26 minutes', 'Release date': 'October 24, 2006', 'Subtitles': 'English', 'Studio': 'Sony Pictures', 'Number of discs': '2'}\nReview Text: I love this series! The animals are hilarious, and The Great British Public who provide the wry, grumpy, hilarious, and thoughtful voices for the animals are a real hit as always. The DVD contains all the episodes in the second season on one disc, plus the special Merry Christmas Everybody on a second disc.<br /><br />This season was not quite as funny and charming as season one, but it still gets five stars because it is head and shoulders above most other DVD's. My boyfriend and I laughed all the way through, and both of us agreed that we would like to keep this in our permanent collection for rewatching (and rewatching soon!).<br /><br />I would think this series is much more suitable for adults than children, just because you need to concentrate to understand the accents, and the humor is often more subtle or dry than children like. But I didn't hear anything that would really be unsafe for children's ears, I just don't think they'd like it as much as adults would.\nReview Title: If you liked the first season then you will like this one as well\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Robbie the Reindeer - Hooves of Fire/Legend of the Lost Tribe (US Versions)\nReview Date: 2007/01/27\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Robbie the Reindeer in Hooves of Fire and the Legend of the Lost Tribe (DVD)', \"Two fabulously funny animated holiday classics brought to you by a brilliant creative team including writer Richard Curtis and Bridget Jones' Diary, Four Weddings and a Funeral, Notting Hill) and directed by Richard Goleszowski (Wallace & Gromit, Rex The Runt)\", 'Robbie the Reindeer in Hooves of Fire', \"- He's a bit lazy, a bit chubby, and totally lovesick. Robbie is at a crossroad in life and is soon convinced he's hopelessly unfit to join Santa's sleigh team. So begins his first hilariously hip adventure, as Robbie learns there is no easy route to success and that hard work and talent get rewarded in the end.Robbie the Reindeer i Legend of the Lost Tribe - Follow Robbie as he sets out to discover a mythical tribe of lost Viking warriors to help him save his friends from another dastardly plot by the evil Blitzen and his new-found partner-in-crime The White Rabbit. Robbie is having girl trouble too - Donner is feeling neglected and decides to give Robbie an ultimatum. Can Robbie save the day, keep his girl and unravel the mystery of the Legend of the Lost Tribe?\", ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Animated, Color, Closed-captioned, NTSC', 'Contributor': 'Various', 'Language': 'English, Unqualified', 'Runtime': '1 hour', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'Relay Time: 60 min', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Color, Closed-captioned, NTSC', 'Run time': '1 hour', 'Release date': 'October 3, 2006', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '1'}\nReview Text: I certainly enjoyed my time watching Robbie, but I wouldn't go so far as to recommend it to anyone but animation buffs. I listened to it with the British soundtrack (an option you can select on the American disc), and I enjoyed the humor and the storyline, but there was very little that made me laugh out loud or that I thought about even an hour later.<br /><br />The humor was crass at times and definitely not suitable for children. I think the crassness of the humor made it less funny, like they were trading cleverness for crassness and hoping we wouldn't notice the difference.<br /><br />I'd love to see more from the animators, because this was a near miss. A little bit more time spent writing good dialogue or a funny plot would have gone a long way towards making this a five star show.<br /><br />Until then, try Wallace and Gromit or Creature Comforts - both are cleverly  hilarious and have truly fantastic claymation.\nReview Title: Enjoyable way to spend time but nothing outstanding\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Creature Comforts - The Complete First Season\nReview Date: 2007/01/27\nStore: Richard \"Golly\" Goleszowski  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['CREATURE COMFORTS is a brilliant and hilarious clay animation series about the lives of animals as told by the animals themselves. Interviews with these lovable claymation creatures leave no stone unturned, no tree unclimbed, no sea uncrossed in the quest to discover what our fine-finned, furred and feathered friends really think about the issues that are closest to their hearts. It\\x92s a \"mockumentary\" like none you\\x92ve ever seen, and it could only come from Nick Park and the untamed minds at Aardman Animation.']\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.54 x 0.75 x 0.07 inches; 3.2 Ounces', 'Director': 'Richard \"Golly\" Goleszowski', 'Media Format': 'Multiple Formats, Animated, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 13 minutes', 'Release date': 'September 27, 2005', 'Subtitles': 'English', 'Producers': 'Gareth Owen, Julie Lockhart', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: The first season of this clever series shines on this DVD. You get the first 13 episodes of the series, with hilarious claymation animals talking in the voices of The Great British Public about any number of interesting topics. It sounds like the makers interviewed ordinary British citizens and then took the best bits and animated a character for each voice.<br /><br />The premise is awesome, but what truly brings this to brilliant new heights is the skill and loving care with which the series was created. I guffawed my way through the first one, watching in disbelief at how clever and funny it was, and finally dragged my unwilling boyfriend in to watch it with me. After about ten minutes he was chortling along with me and we enjoyed the rest with great enthusiasm.<br /><br />This is meant more for teens and adults than children, because the humor is often subtle or dry and the accents can be hard to understand for Americans. But there isn't anything unsafe for younger kids in here as far as I could tell, I just don't think they'd really \"get\" it.<br /><br />If you like Wallace and Gromit and want to try something new, give this winner a try - it is well worth the money and is one that I intend to watch over and over again.\nReview Title: A gigantic rave for this clever, sweet, funny claymation series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Viniyoga Therapy for the Low Back, Sacrum & Hips with Gary Kraftsow\nReview Date: 2009/04/16\nStore: Gary Kraftsow  (Actor),     Ian Albert and Mark Holmes  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['Product Description', \"Viniyoga Therapy for the Low Back, Sacrum and Hips features short, simple therapeutic yoga practices carefully designed to alleviate pain and promote health in the low back, sacrum and hips. For the first time ever on DVD, benefit from the expert guidance of Gary Kraftsow, one of the world's leading yoga therapists. Founder of the American Viniyoga Institute, Gary is the designer of the only yoga practices demonstrated to be effective for back pain in a National Institutes of Health-sponsored clinical study. If you are one of the 8 out of 10 Americans who have or will experience back pain, make the powerful therapeutic practices on this DVD a part of your everyday regimen for health and well-being! Highlights from this DVD include: Presentation on Understanding Back Pain and the application of yoga therapy. Technique Workshop on how to safely perform postures and movements. Focused practice for Low Back and Sacrum Therapy. Focused practice for Hip Therapy. Integrated practice for sustained low back Strength and Stability. Bonus MP3s of all practices for audio-only classes at home or on the go.\", 'Review', 'Gary Kraftsow, founder, director and senior teacher of the American Viniyoga Institute, elevates the genre of yoga DVDs to a whole new level...Whether you endure back pain or not, these are some of the best yoga DVDs on the market. --Fit YogaViniyoga master Gary Kraftsow developed protocols for a recent National Institutes of Health-sponsored study of treatment for back pain. This excellent two-DVD series is based on this work and on his 30 years of experience as a yoga therapist. The detailed instruction, gentle repetitive movements, and focus on moving with awareness and the breath make these ideal practices for a wide range of people, including those who may not have pain but can benefit from strengthening and stabilizing their backs. --Yoga + Joyful Living']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Color, Dolby, Multiple Formats, NTSC', 'Contributor': 'Gary Kraftsow, Ian Albert and Mark Holmes', 'Language': 'Unqualified', 'Runtime': '2 hours and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 3.2 Ounces', 'Director': 'Ian Albert and Mark Holmes', 'Media Format': 'Color, Dolby, Multiple Formats, NTSC', 'Run time': '2 hours and 35 minutes', 'Release date': 'February 3, 2009', 'Actors': 'Gary Kraftsow', 'Subtitles': 'English', 'Studio': 'Bayview Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: [[VIDEOID:33534111]]I hate doing this yoga DVD because the exercises are so boring and the narrator's voice drones. But I return to it time and time again, because it's the only thing besides a Chiropractor visit which fixes my hips and gets me aligned and ready to work again. It is extremely effective.<br /><br />Suck it up, buy the DVD, and use it regularly, and your hips will thank you.\nReview Title: Boring exercises but supremely effective\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Olivia: Merry Christmas Olivia\nReview Date: 2011/02/17\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['Olivia spreads Christmas cheer at Francine’s July beach party! Then, with her favorite doll, Matilda, missing, Olivia dreams of being a Santa who returns lost toys. Merry Christmas Olivia!']\nAverage Rating: 4.4\nProduct Details: {'Genre': \"Children's\", 'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Gray, Emily', 'Language': 'Unqualified', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.41 x 7.53 inches; 2.4 Ounces', 'Item model number': '6182722', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Release date': 'October 5, 2010', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I don't have cable, so I've been greedily buying up all the Olivia DVD's I can. I know I'm a grownup, but something about Olivia's sweetness really resonates with me, and I find Olivia a pleasure to read and watch.<br /><br />This DVD made me feel warm and fuzzy inside during the cold, overly busy leadup to the holidays. There were four shows that were related in some tangential way to Christmas, and four that were not... All were a pleasure to watch. Two of the Christmas ones could be watched any time of the year, while two were Christmas-specific.<br /><br />If you're a fan of Olivia, don't be put off by the mention of Christmas - go ahead and pick up this DVD even in other times of the year. She's her usual charming self, and your kids will love her.\nReview Title: How I loved these little Olivia shows!\nRating: 5.0\n--------------------------------------------------",
  "reference": "Creature Comforts - The Complete Second Season\nNick Park  (Director),     Richard Goleszowski  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Funnier and wittier than ever before, Creature Comforts returns for a second series of the highly acclaimed animation from Nick Park and Aardman. CREATURE COMFORTS is a brilliant and hilarious claymation series about the lives of animals as told by the animals themselves. Unscripted and unashamedly funny, the British public once again speaks through the mouths of their plasticine counterparts. Interviews with these lovable claymation creatures leave no stone unturned, no tree unclimbed, no sea uncrossed in the quest to discover what our fine-finned, furred and feathered friends really think about the issues that are closest to their hearts. Join the return of some favorite characters including Trixie and Captain Cuddlepuss, the Dog and Cat, Fluffy the Hampster and Clement the Bloodhound.', 'Amazon.com', 'Like everything else from the geniuses at Aardman Animations, the second season of', 'Creature Comforts', 'is absolutely brilliant. As conceived by Oscar®-winning', 'Creature Comforts', 'animator Nick Park (of Wallace and Gromit fame), the premise of this limited series is deceptively simple, but when you add the Aardman magic, it evolves into something utterly sublime: an endlessly clever and intimately revealing portrait of contemporary British society, originating as live recordings of \"the great British public\" then transformed through Aardman animation into a menagerie of talking animals, each bursting with humor, insight, and a rich variety of slapstick gags and memorable expressions. It\\'s a rare kind of creative alchemy that takes place before our eyes: From original voice recordings to the finished product, each nine-minute episode is a masterpiece of anthropomorphic ingenuity, introducing us to a colorful cast of critters that reflect their real-life human counterparts as well as the cleverness of the animators themselves. Think of it as an inter-species exchange program, where chatty old ladies in a retirement home are transformed into chatty old bats dangling from a rafter, or a pair of buddies in their early 30s turn into witty slugs with a knack for whistling and making faces.', 'The perfectionism that has become Aardman\\'s trademark is evident throughout these 12 hilarious episodes, each devoted to a single topic (Impressions, Sport, Monarchy Business, Communication, Self-Image, etc.) and animated in plasticene to emphasize wildly inventive visual translations of everyday conversation. The \"casting\" is flawless, comedic timing is impeccable, and abundant bits of throwaway business ensure that you\\'ll see something new with every viewing. Meticulously crafted sets, props, and backdrops complete the illusion, and the final result is artistry of the highest order, combined with a heartwarming humanism that\\'s both universally appealing and quintessentially British. For everyone involved,', 'Creature Comforts', 'guarantees a delightful kind of immortality, and the rest of us get to share in the fun.', 'This two-disc set also includes the acclaimed Aardman holiday short', 'Merry Christmas Everybody!', ', and disc 2 includes a wealth of behind-the-scenes features delving into all aspects of Aardman\\'s arduous animation process. There\\'s a \"making of Season 2\" featurette covering the overall production process; \"The People Behind the Puppets\" shows how the British interviewees are matched with their animated animal counterparts; and \"Animated Conversations\" follows several animators as they struggle with the painstaking process of matching their creatures\\' mouth-movements with pre-recorded dialogue. Also included is \"The Countryside Code,\" an Aardman-animated public service ecology commercial promoting preservation of the British countryside.', '--Jeff Shannon']\n{'Genre': 'Animation, Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Richard Goleszowski, Nick Park', 'Language': 'Unqualified, English (Dolby Digital 2.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 2.88 Ounces', 'Director': 'Nick Park, Richard Goleszowski', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 26 minutes', 'Release date': 'October 24, 2006', 'Subtitles': 'English', 'Studio': 'Sony Pictures', 'Number of discs': '2'}\nI love this series! The animals are hilarious, and The Great British Public who provide the wry, grumpy, hilarious, and thoughtful voices for the animals are a real hit as always. The DVD contains all the episodes in the second season on one disc, plus the special Merry Christmas Everybody on a second disc.<br /><br />This season was not quite as funny and charming as season one, but it still gets five stars because it is head and shoulders above most other DVD's. My boyfriend and I laughed all the way through, and both of us agreed that we would like to keep this in our permanent collection for rewatching (and rewatching soon!).<br /><br />I would think this series is much more suitable for adults than children, just because you need to concentrate to understand the accents, and the humor is often more subtle or dry than children like. But I didn't hear anything that would really be unsafe for children's ears, I just don't think they'd like it as much as adults would.\nIf you liked the first season then you will like this one as well\nRobbie the Reindeer - Hooves of Fire/Legend of the Lost Tribe (US Versions)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Robbie the Reindeer in Hooves of Fire and the Legend of the Lost Tribe (DVD)', \"Two fabulously funny animated holiday classics brought to you by a brilliant creative team including writer Richard Curtis and Bridget Jones' Diary, Four Weddings and a Funeral, Notting Hill) and directed by Richard Goleszowski (Wallace & Gromit, Rex The Runt)\", 'Robbie the Reindeer in Hooves of Fire', \"- He's a bit lazy, a bit chubby, and totally lovesick. Robbie is at a crossroad in life and is soon convinced he's hopelessly unfit to join Santa's sleigh team. So begins his first hilariously hip adventure, as Robbie learns there is no easy route to success and that hard work and talent get rewarded in the end.Robbie the Reindeer i Legend of the Lost Tribe - Follow Robbie as he sets out to discover a mythical tribe of lost Viking warriors to help him save his friends from another dastardly plot by the evil Blitzen and his new-found partner-in-crime The White Rabbit. Robbie is having girl trouble too - Donner is feeling neglected and decides to give Robbie an ultimatum. Can Robbie save the day, keep his girl and unravel the mystery of the Legend of the Lost Tribe?\", ']]>']\n{'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Animated, Color, Closed-captioned, NTSC', 'Contributor': 'Various', 'Language': 'English, Unqualified', 'Runtime': '1 hour', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'Relay Time: 60 min', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Color, Closed-captioned, NTSC', 'Run time': '1 hour', 'Release date': 'October 3, 2006', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '1'}\nI certainly enjoyed my time watching Robbie, but I wouldn't go so far as to recommend it to anyone but animation buffs. I listened to it with the British soundtrack (an option you can select on the American disc), and I enjoyed the humor and the storyline, but there was very little that made me laugh out loud or that I thought about even an hour later.<br /><br />The humor was crass at times and definitely not suitable for children. I think the crassness of the humor made it less funny, like they were trading cleverness for crassness and hoping we wouldn't notice the difference.<br /><br />I'd love to see more from the animators, because this was a near miss. A little bit more time spent writing good dialogue or a funny plot would have gone a long way towards making this a five star show.<br /><br />Until then, try Wallace and Gromit or Creature Comforts - both are cleverly  hilarious and have truly fantastic claymation.\nEnjoyable way to spend time but nothing outstanding\nCreature Comforts - The Complete First Season\nRichard \"Golly\" Goleszowski  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['CREATURE COMFORTS is a brilliant and hilarious clay animation series about the lives of animals as told by the animals themselves. Interviews with these lovable claymation creatures leave no stone unturned, no tree unclimbed, no sea uncrossed in the quest to discover what our fine-finned, furred and feathered friends really think about the issues that are closest to their hearts. It\\x92s a \"mockumentary\" like none you\\x92ve ever seen, and it could only come from Nick Park and the untamed minds at Aardman Animation.']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.54 x 0.75 x 0.07 inches; 3.2 Ounces', 'Director': 'Richard \"Golly\" Goleszowski', 'Media Format': 'Multiple Formats, Animated, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 13 minutes', 'Release date': 'September 27, 2005', 'Subtitles': 'English', 'Producers': 'Gareth Owen, Julie Lockhart', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThe first season of this clever series shines on this DVD. You get the first 13 episodes of the series, with hilarious claymation animals talking in the voices of The Great British Public about any number of interesting topics. It sounds like the makers interviewed ordinary British citizens and then took the best bits and animated a character for each voice.<br /><br />The premise is awesome, but what truly brings this to brilliant new heights is the skill and loving care with which the series was created. I guffawed my way through the first one, watching in disbelief at how clever and funny it was, and finally dragged my unwilling boyfriend in to watch it with me. After about ten minutes he was chortling along with me and we enjoyed the rest with great enthusiasm.<br /><br />This is meant more for teens and adults than children, because the humor is often subtle or dry and the accents can be hard to understand for Americans. But there isn't anything unsafe for younger kids in here as far as I could tell, I just don't think they'd really \"get\" it.<br /><br />If you like Wallace and Gromit and want to try something new, give this winner a try - it is well worth the money and is one that I intend to watch over and over again.\nA gigantic rave for this clever, sweet, funny claymation series\nViniyoga Therapy for the Low Back, Sacrum & Hips with Gary Kraftsow\nGary Kraftsow  (Actor),     Ian Albert and Mark Holmes  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['Product Description', \"Viniyoga Therapy for the Low Back, Sacrum and Hips features short, simple therapeutic yoga practices carefully designed to alleviate pain and promote health in the low back, sacrum and hips. For the first time ever on DVD, benefit from the expert guidance of Gary Kraftsow, one of the world's leading yoga therapists. Founder of the American Viniyoga Institute, Gary is the designer of the only yoga practices demonstrated to be effective for back pain in a National Institutes of Health-sponsored clinical study. If you are one of the 8 out of 10 Americans who have or will experience back pain, make the powerful therapeutic practices on this DVD a part of your everyday regimen for health and well-being! Highlights from this DVD include: Presentation on Understanding Back Pain and the application of yoga therapy. Technique Workshop on how to safely perform postures and movements. Focused practice for Low Back and Sacrum Therapy. Focused practice for Hip Therapy. Integrated practice for sustained low back Strength and Stability. Bonus MP3s of all practices for audio-only classes at home or on the go.\", 'Review', 'Gary Kraftsow, founder, director and senior teacher of the American Viniyoga Institute, elevates the genre of yoga DVDs to a whole new level...Whether you endure back pain or not, these are some of the best yoga DVDs on the market. --Fit YogaViniyoga master Gary Kraftsow developed protocols for a recent National Institutes of Health-sponsored study of treatment for back pain. This excellent two-DVD series is based on this work and on his 30 years of experience as a yoga therapist. The detailed instruction, gentle repetitive movements, and focus on moving with awareness and the breath make these ideal practices for a wide range of people, including those who may not have pain but can benefit from strengthening and stabilizing their backs. --Yoga + Joyful Living']\n{'Genre': 'Exercise & Fitness', 'Format': 'Color, Dolby, Multiple Formats, NTSC', 'Contributor': 'Gary Kraftsow, Ian Albert and Mark Holmes', 'Language': 'Unqualified', 'Runtime': '2 hours and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 3.2 Ounces', 'Director': 'Ian Albert and Mark Holmes', 'Media Format': 'Color, Dolby, Multiple Formats, NTSC', 'Run time': '2 hours and 35 minutes', 'Release date': 'February 3, 2009', 'Actors': 'Gary Kraftsow', 'Subtitles': 'English', 'Studio': 'Bayview Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\n[[VIDEOID:33534111]]I hate doing this yoga DVD because the exercises are so boring and the narrator's voice drones. But I return to it time and time again, because it's the only thing besides a Chiropractor visit which fixes my hips and gets me aligned and ready to work again. It is extremely effective.<br /><br />Suck it up, buy the DVD, and use it regularly, and your hips will thank you.\nBoring exercises but supremely effective\nOlivia: Merry Christmas Olivia\nRated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Olivia spreads Christmas cheer at Francine’s July beach party! Then, with her favorite doll, Matilda, missing, Olivia dreams of being a Santa who returns lost toys. Merry Christmas Olivia!']\n{'Genre': \"Children's\", 'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Gray, Emily', 'Language': 'Unqualified', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.41 x 7.53 inches; 2.4 Ounces', 'Item model number': '6182722', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Release date': 'October 5, 2010', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI don't have cable, so I've been greedily buying up all the Olivia DVD's I can. I know I'm a grownup, but something about Olivia's sweetness really resonates with me, and I find Olivia a pleasure to read and watch.<br /><br />This DVD made me feel warm and fuzzy inside during the cold, overly busy leadup to the holidays. There were four shows that were related in some tangential way to Christmas, and four that were not... All were a pleasure to watch. Two of the Christmas ones could be watched any time of the year, while two were Christmas-specific.<br /><br />If you're a fan of Olivia, don't be put off by the mention of Christmas - go ahead and pick up this DVD even in other times of the year. She's her usual charming self, and your kids will love her.\nHow I loved these little Olivia shows!",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Creature Comforts - The Complete Second Season\nReview Date: 2007/01/27\nStore: Nick Park  (Director),     Richard Goleszowski  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Funnier and wittier than ever before, Creature Comforts returns for a second series of the highly acclaimed animation from Nick Park and Aardman. CREATURE COMFORTS is a brilliant and hilarious claymation series about the lives of animals as told by the animals themselves. Unscripted and unashamedly funny, the British public once again speaks through the mouths of their plasticine counterparts. Interviews with these lovable claymation creatures leave no stone unturned, no tree unclimbed, no sea uncrossed in the quest to discover what our fine-finned, furred and feathered friends really think about the issues that are closest to their hearts. Join the return of some favorite characters including Trixie and Captain Cuddlepuss, the Dog and Cat, Fluffy the Hampster and Clement the Bloodhound.', 'Amazon.com', 'Like everything else from the geniuses at Aardman Animations, the second season of', 'Creature Comforts', 'is absolutely brilliant. As conceived by Oscar®-winning', 'Creature Comforts', 'animator Nick Park (of Wallace and Gromit fame), the premise of this limited series is deceptively simple, but when you add the Aardman magic, it evolves into something utterly sublime: an endlessly clever and intimately revealing portrait of contemporary British society, originating as live recordings of \"the great British public\" then transformed through Aardman animation into a menagerie of talking animals, each bursting with humor, insight, and a rich variety of slapstick gags and memorable expressions. It\\'s a rare kind of creative alchemy that takes place before our eyes: From original voice recordings to the finished product, each nine-minute episode is a masterpiece of anthropomorphic ingenuity, introducing us to a colorful cast of critters that reflect their real-life human counterparts as well as the cleverness of the animators themselves. Think of it as an inter-species exchange program, where chatty old ladies in a retirement home are transformed into chatty old bats dangling from a rafter, or a pair of buddies in their early 30s turn into witty slugs with a knack for whistling and making faces.', 'The perfectionism that has become Aardman\\'s trademark is evident throughout these 12 hilarious episodes, each devoted to a single topic (Impressions, Sport, Monarchy Business, Communication, Self-Image, etc.) and animated in plasticene to emphasize wildly inventive visual translations of everyday conversation. The \"casting\" is flawless, comedic timing is impeccable, and abundant bits of throwaway business ensure that you\\'ll see something new with every viewing. Meticulously crafted sets, props, and backdrops complete the illusion, and the final result is artistry of the highest order, combined with a heartwarming humanism that\\'s both universally appealing and quintessentially British. For everyone involved,', 'Creature Comforts', 'guarantees a delightful kind of immortality, and the rest of us get to share in the fun.', 'This two-disc set also includes the acclaimed Aardman holiday short', 'Merry Christmas Everybody!', ', and disc 2 includes a wealth of behind-the-scenes features delving into all aspects of Aardman\\'s arduous animation process. There\\'s a \"making of Season 2\" featurette covering the overall production process; \"The People Behind the Puppets\" shows how the British interviewees are matched with their animated animal counterparts; and \"Animated Conversations\" follows several animators as they struggle with the painstaking process of matching their creatures\\' mouth-movements with pre-recorded dialogue. Also included is \"The Countryside Code,\" an Aardman-animated public service ecology commercial promoting preservation of the British countryside.', '--Jeff Shannon']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Animation, Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Richard Goleszowski, Nick Park', 'Language': 'Unqualified, English (Dolby Digital 2.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 2.88 Ounces', 'Director': 'Nick Park, Richard Goleszowski', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 26 minutes', 'Release date': 'October 24, 2006', 'Subtitles': 'English', 'Studio': 'Sony Pictures', 'Number of discs': '2'}\nReview Text: I love this series! The animals are hilarious, and The Great British Public who provide the wry, grumpy, hilarious, and thoughtful voices for the animals are a real hit as always. The DVD contains all the episodes in the second season on one disc, plus the special Merry Christmas Everybody on a second disc.<br /><br />This season was not quite as funny and charming as season one, but it still gets five stars because it is head and shoulders above most other DVD's. My boyfriend and I laughed all the way through, and both of us agreed that we would like to keep this in our permanent collection for rewatching (and rewatching soon!).<br /><br />I would think this series is much more suitable for adults than children, just because you need to concentrate to understand the accents, and the humor is often more subtle or dry than children like. But I didn't hear anything that would really be unsafe for children's ears, I just don't think they'd like it as much as adults would.\nReview Title: If you liked the first season then you will like this one as well\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Robbie the Reindeer - Hooves of Fire/Legend of the Lost Tribe (US Versions)\nReview Date: 2007/01/27\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Robbie the Reindeer in Hooves of Fire and the Legend of the Lost Tribe (DVD)', \"Two fabulously funny animated holiday classics brought to you by a brilliant creative team including writer Richard Curtis and Bridget Jones' Diary, Four Weddings and a Funeral, Notting Hill) and directed by Richard Goleszowski (Wallace & Gromit, Rex The Runt)\", 'Robbie the Reindeer in Hooves of Fire', \"- He's a bit lazy, a bit chubby, and totally lovesick. Robbie is at a crossroad in life and is soon convinced he's hopelessly unfit to join Santa's sleigh team. So begins his first hilariously hip adventure, as Robbie learns there is no easy route to success and that hard work and talent get rewarded in the end.Robbie the Reindeer i Legend of the Lost Tribe - Follow Robbie as he sets out to discover a mythical tribe of lost Viking warriors to help him save his friends from another dastardly plot by the evil Blitzen and his new-found partner-in-crime The White Rabbit. Robbie is having girl trouble too - Donner is feeling neglected and decides to give Robbie an ultimatum. Can Robbie save the day, keep his girl and unravel the mystery of the Legend of the Lost Tribe?\", ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Animated, Color, Closed-captioned, NTSC', 'Contributor': 'Various', 'Language': 'English, Unqualified', 'Runtime': '1 hour', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'Relay Time: 60 min', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Color, Closed-captioned, NTSC', 'Run time': '1 hour', 'Release date': 'October 3, 2006', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '1'}\nReview Text: I certainly enjoyed my time watching Robbie, but I wouldn't go so far as to recommend it to anyone but animation buffs. I listened to it with the British soundtrack (an option you can select on the American disc), and I enjoyed the humor and the storyline, but there was very little that made me laugh out loud or that I thought about even an hour later.<br /><br />The humor was crass at times and definitely not suitable for children. I think the crassness of the humor made it less funny, like they were trading cleverness for crassness and hoping we wouldn't notice the difference.<br /><br />I'd love to see more from the animators, because this was a near miss. A little bit more time spent writing good dialogue or a funny plot would have gone a long way towards making this a five star show.<br /><br />Until then, try Wallace and Gromit or Creature Comforts - both are cleverly  hilarious and have truly fantastic claymation.\nReview Title: Enjoyable way to spend time but nothing outstanding\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Creature Comforts - The Complete First Season\nReview Date: 2007/01/27\nStore: Richard \"Golly\" Goleszowski  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['CREATURE COMFORTS is a brilliant and hilarious clay animation series about the lives of animals as told by the animals themselves. Interviews with these lovable claymation creatures leave no stone unturned, no tree unclimbed, no sea uncrossed in the quest to discover what our fine-finned, furred and feathered friends really think about the issues that are closest to their hearts. It\\x92s a \"mockumentary\" like none you\\x92ve ever seen, and it could only come from Nick Park and the untamed minds at Aardman Animation.']\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.54 x 0.75 x 0.07 inches; 3.2 Ounces', 'Director': 'Richard \"Golly\" Goleszowski', 'Media Format': 'Multiple Formats, Animated, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 13 minutes', 'Release date': 'September 27, 2005', 'Subtitles': 'English', 'Producers': 'Gareth Owen, Julie Lockhart', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: The first season of this clever series shines on this DVD. You get the first 13 episodes of the series, with hilarious claymation animals talking in the voices of The Great British Public about any number of interesting topics. It sounds like the makers interviewed ordinary British citizens and then took the best bits and animated a character for each voice.<br /><br />The premise is awesome, but what truly brings this to brilliant new heights is the skill and loving care with which the series was created. I guffawed my way through the first one, watching in disbelief at how clever and funny it was, and finally dragged my unwilling boyfriend in to watch it with me. After about ten minutes he was chortling along with me and we enjoyed the rest with great enthusiasm.<br /><br />This is meant more for teens and adults than children, because the humor is often subtle or dry and the accents can be hard to understand for Americans. But there isn't anything unsafe for younger kids in here as far as I could tell, I just don't think they'd really \"get\" it.<br /><br />If you like Wallace and Gromit and want to try something new, give this winner a try - it is well worth the money and is one that I intend to watch over and over again.\nReview Title: A gigantic rave for this clever, sweet, funny claymation series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Viniyoga Therapy for the Low Back, Sacrum & Hips with Gary Kraftsow\nReview Date: 2009/04/16\nStore: Gary Kraftsow  (Actor),     Ian Albert and Mark Holmes  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['Product Description', \"Viniyoga Therapy for the Low Back, Sacrum and Hips features short, simple therapeutic yoga practices carefully designed to alleviate pain and promote health in the low back, sacrum and hips. For the first time ever on DVD, benefit from the expert guidance of Gary Kraftsow, one of the world's leading yoga therapists. Founder of the American Viniyoga Institute, Gary is the designer of the only yoga practices demonstrated to be effective for back pain in a National Institutes of Health-sponsored clinical study. If you are one of the 8 out of 10 Americans who have or will experience back pain, make the powerful therapeutic practices on this DVD a part of your everyday regimen for health and well-being! Highlights from this DVD include: Presentation on Understanding Back Pain and the application of yoga therapy. Technique Workshop on how to safely perform postures and movements. Focused practice for Low Back and Sacrum Therapy. Focused practice for Hip Therapy. Integrated practice for sustained low back Strength and Stability. Bonus MP3s of all practices for audio-only classes at home or on the go.\", 'Review', 'Gary Kraftsow, founder, director and senior teacher of the American Viniyoga Institute, elevates the genre of yoga DVDs to a whole new level...Whether you endure back pain or not, these are some of the best yoga DVDs on the market. --Fit YogaViniyoga master Gary Kraftsow developed protocols for a recent National Institutes of Health-sponsored study of treatment for back pain. This excellent two-DVD series is based on this work and on his 30 years of experience as a yoga therapist. The detailed instruction, gentle repetitive movements, and focus on moving with awareness and the breath make these ideal practices for a wide range of people, including those who may not have pain but can benefit from strengthening and stabilizing their backs. --Yoga + Joyful Living']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Color, Dolby, Multiple Formats, NTSC', 'Contributor': 'Gary Kraftsow, Ian Albert and Mark Holmes', 'Language': 'Unqualified', 'Runtime': '2 hours and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 3.2 Ounces', 'Director': 'Ian Albert and Mark Holmes', 'Media Format': 'Color, Dolby, Multiple Formats, NTSC', 'Run time': '2 hours and 35 minutes', 'Release date': 'February 3, 2009', 'Actors': 'Gary Kraftsow', 'Subtitles': 'English', 'Studio': 'Bayview Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: [[VIDEOID:33534111]]I hate doing this yoga DVD because the exercises are so boring and the narrator's voice drones. But I return to it time and time again, because it's the only thing besides a Chiropractor visit which fixes my hips and gets me aligned and ready to work again. It is extremely effective.<br /><br />Suck it up, buy the DVD, and use it regularly, and your hips will thank you.\nReview Title: Boring exercises but supremely effective\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Olivia: Merry Christmas Olivia\nReview Date: 2011/02/17\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['Olivia spreads Christmas cheer at Francine’s July beach party! Then, with her favorite doll, Matilda, missing, Olivia dreams of being a Santa who returns lost toys. Merry Christmas Olivia!']\nAverage Rating: 4.4\nProduct Details: {'Genre': \"Children's\", 'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Gray, Emily', 'Language': 'Unqualified', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.41 x 7.53 inches; 2.4 Ounces', 'Item model number': '6182722', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Release date': 'October 5, 2010', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I don't have cable, so I've been greedily buying up all the Olivia DVD's I can. I know I'm a grownup, but something about Olivia's sweetness really resonates with me, and I find Olivia a pleasure to read and watch.<br /><br />This DVD made me feel warm and fuzzy inside during the cold, overly busy leadup to the holidays. There were four shows that were related in some tangential way to Christmas, and four that were not... All were a pleasure to watch. Two of the Christmas ones could be watched any time of the year, while two were Christmas-specific.<br /><br />If you're a fan of Olivia, don't be put off by the mention of Christmas - go ahead and pick up this DVD even in other times of the year. She's her usual charming self, and your kids will love her.\nReview Title: How I loved these little Olivia shows!\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe analyzed purchase history indicates a strong preference for animated content, particularly claymation, with a focus on British humor and creativity. The individual rates series highly for cleverness and the emotional resonance of storytelling, often enjoying both lighthearted comedy and deeper, more contemplative themes.\n\nAcross multiple purchases, there is a consistent appreciation for series that blend humor with relatable narratives, often targeted at adults rather than children. The viewer displays a discernable affinity for quality animation, as reflected in the high ratings for series that feature sophisticated humor and artistic craftsmanship. However, they show some distinction in taste; the appreciation for features like subtlety suggests a disfavor for crass humor.\n\nPrice sensitivity also emerges, as reflected in the intent to build a permanent collection of favored titles, while still expressing some disappointment when the content does not meet elevated expectations. Collectively, these patterns showcase a distinct preference for thoughtfully crafted, humorous animated works over more superficial or conventional children’s content. The individual values quality storytelling alongside engaging visuals, often revisiting these selections for comfort and entertainment.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Really fun to watch Napoleon Hill sit behind a desk and deliver his key concepts to 1950s television viewers",
    "text": "Anyone who has put any energy at all into changing their financial and success mindset will be familiar with Napoleon Hill and his basic philosophical ideas about shaping yourself to have a pleasant, generous personality and using strength of character and personal discipline as the basis for imagining and then achieving a uniquely successful life that is suited to who you are and the strengths you have to provide the world.<br /><br />After Reading Think and Grow Rich and Grow Rich with Peace of Mind, I didn't find much new here in terms of the concepts. However, the charm of watching Napoleon Hill himself speak these concepts in a simple manner towards the television viewers of the 1950s is certainly worth the paltry amount of money and the enjoyable and brief amount of time you'll spend you'll invest in this program. Hill's voice takes a few minutes of getting used to, but has an open character to it that makes me feel inspired and inclined to remember and follow his ideals.<br /><br />Is this dated? No doubt about it. He talks in kind of a dry manner and shares his concepts, sometimes repetitively, while sitting at a desk. There's no way this would get on TV nowadays. However, maybe that's part of what's wrong with TV nowadays. Do you need to have flash to share life-changing information with other humans? After readjusting my perceptions and expectations for the show, I found I thoroughly enjoyed delving into what Napoleon Hill wanted to share with me, and these classic and timeless ideas definitely took on a newly inspiring quality when delivered by the original person responsible for getting them into the world.<br /><br />These haven't been remastered in any way, so there is crackling and there are lines across the screen. Not a problem, just something you should be aware of.<br /><br />Overall, this would be a wonderful thing to watch if you are a fan of Napoleon Hill or have a success mindset and enjoy old television. I'm so glad they've made it available on DVD for modern students of this great business mind.",
    "images": [],
    "asin": "B01HU5MKHI",
    "parent_asin": "B01HU5MKHI",
    "user_id": "AFPF2CONJ33FNFKOEQ2TUNWQJTFQ",
    "timestamp": "2016-09-06 22:47:13",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Napoleon Hill's Master Key",
    "average_rating": 4.8,
    "rating_number": 301,
    "features": [],
    "description": [
      "In 1954, Napoleon Hill and W. Clement Stone, produced a historic television broadcast.  Now, for the first time, the archived films are presented to you in their",
      "original and complete",
      "format. In addition, we ve included a 28-page booklet and previously unreleased lecture presentations on the Cosmic Habit Force and having a Positive Mental Attitude.  Using Napoleon Hill's Master Key, you will learn to take control of your mind and live a life that is truly yours. You will unlock your life's purpose, and start living a life of success, wealth, and happiness.  Special Features on the DVD:",
      "13 Original and Complete Episodes",
      "13 Original and Complete Episodes",
      "Subtitles in English, French, and Spanish",
      "Subtitles in English, French, and Spanish",
      "25-minute previously unreleased, lecture presentation Cosmic Habit Force",
      "25-minute previously unreleased, lecture presentation Cosmic Habit Force",
      "31-minute previously unreleased lecture presentation Positive Mental Attitude",
      "31-minute previously unreleased lecture presentation Positive Mental Attitude",
      "28-page booklet with photographs and summary of Hill s 17 principles",
      "28-page booklet with photographs and summary of Hill s 17 principles",
      "All Regions",
      "All Regions",
      "Remastered Video and Audio Whatever the mind can conceive and believe, the mind can achieve! - Napoleon Hill",
      "Remastered Video and Audio",
      "Whatever the mind can conceive and believe, the mind can achieve!",
      "- Napoleon Hill"
    ],
    "price": null,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51Duu6TMPqL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Duu6TMPqL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71sL+Djw+-L._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Napoleon Hill  (Actor, Director)    Format: DVD",
    "categories": [
      "Movies & TV",
      "Movies"
    ],
    "details": {
      "Format": "Dolby, NTSC, Widescreen, Anamorphic",
      "Contributor": "Napoleon Hill",
      "Runtime": "3 hours and 36 minutes",
      "Package Dimensions": "7.1 x 5.42 x 0.58 inches; 2.93 Ounces",
      "Director": "Napoleon Hill",
      "Media Format": "Dolby, NTSC, Widescreen, Anamorphic",
      "Run time": "3 hours and 36 minutes",
      "Release date": "August 2, 2016",
      "Actors": "Napoleon Hill",
      "Studio": "Cine-O-Matic, Inc.",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}