{
  "user_id": "AHAWKQJ7CKJQAHWZBL2G3HKSUSGQ",
  "summary": "=== Purchase Information ===\nProduct Title: State of Play [Blu-ray]\nReview Date: 2012/06/13\nStore: Russell Crowe  (Actor),     Ben Affleck  (Actor)    Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Academy Award®-winner Russell Crowe leads an all-star cast, including Ben Affleck, Rachel McAdams & Helen Mirren in the blistering thriller about deception, manipulation & corruption. When D.C. Reporter Cal McCaffrey (Crowe) is assigned to investigate the murder of an assistant to an up-and-coming politician (Affleck), he uncovers a conspiracy that threatens to bring down the nation’s power structures. In a town of spin-doctors and wealthy power brokers, he will discover one truth: when fortunes are at stake, no one’s integrity, love or life is safe. From director Kevin Macdonald of The Last King of Scotland, State of Play brings together gripping performances, riveting suspense and is “sophisticated, intelligent and powerful” (Shawn Edwards, Fox-TV).', 'Amazon.com', \"The superlative British miniseries becomes a smart, soap opera-free film courtesy The Last King of Scotland's Kevin Macdonald. His writers, including Tony Gilroy (the Bourne series) and Billy Ray (Breach), haven't simply condensed and Americanized the six-hour series--they've reinvented it. Now set in Washington D.C., veteran journalist Cal McAffrey (Russell Crowe, replacing Brad Pitt, who dropped out over script changes) still collaborates with editor Cameron Lynne (a delectably imperious Helen Mirren) and junior reporter Della Frye (Rachel McAdams) on a story involving Cal's politico pal, Stephen Collins (Ben Affleck), but there's a new subtext behind their plunge into sex scandals and corporate malfeasance, since this State of Play also eulogizes old-school beat reporting, and in interviews, Macdonald has acknowledged the influence of newsprint classics like All the President's Men (the Watergate Hotel even shows up as a location). So, while Cal and Della, the Globe’s blogger, try to determine whether the congressman’s aide Sonia (with whom he was having an affair) died at her own hands or the hands of another, they're also fighting for their careers and the survival of their ailing paper. Stephen's political rival Senator Fergus (Jeff Daniels), does his best to stymie their efforts, but PR flack Dominic Foy (Jason Bateman) becomes a reluctant ally. Though fans of the series may miss a few characters, like Cameron's son (played by James McAvoy in the BBC version), Oscar-winning documentarian-turned-filmmaker Macdonald remains true to its spirit. Be sure to stay through the poignant end credits, during which he returns to his doc roots. --\", 'Kathleen C. Fennessy', 'Stills from', 'State of Play', '(Click for larger image)']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen  See more', 'Contributor': 'Russell Crowe, Rachel McAdams, Helen Mirren, Ben Affleck', 'Initial release date': '2017-07-04', 'Language': 'English (DTS-HD Master Audio 5.1), French (DTS 5.1), Spanish (DTS 5.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 115min', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'July 4, 2017', 'Actors': 'Russell Crowe, Ben Affleck, Rachel McAdams, Helen Mirren', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: We received the movie in a reasonable time, considering it ships to our APO. I think it took about a week. Amazon has always been very good about the shipping time. The dvd was new, no problems with it. As for the movie itself, it was far better than I had anticipated. I figured just some light entertainment, but was pleasantly surprised. The plot was very well presented by an exceptional cast.\nReview Title: Very good Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hannibal Lecter Collection (Manhunter / Silence of the Lambs / Hannibal) [Blu-ray]\nReview Date: 2012/09/06\nStore: Jodie Foster  (Actor),     Anthony Hopkins  (Actor),     Jonathan Demme  (Director),     Michael Mann  (Director, Writer)    &                   1                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Hannibal Lecter Triple Feature (BD)', ']]>', 'Amazon.com', 'Manhunter', 'Though it will always be remembered as the movie featuring the \"other\" Hannibal Lecter, Michael Mann\\'s 1986 thriller Manhunter is nearly as good as The Silence of the Lambs, and in some respects it\\'s arguably even better. Based on Thomas Harris\\'s novel Red Dragon, which introduced the world to the nefarious killer Hannibal \"the Cannibal\" Lecter, the film stars William Petersen (giving a suitably brooding performance) as ex-FBI agent Will Graham, who is coaxed out of semiretirement to track down a serial killer who has thwarted the authorities at every turn.', 'Graham\\'s approach to the case is a perilous one. First he seeks counsel with Lecter (Brian Cox) in the latter\\'s high-security prison cell--an encounter that is utterly horrifying in its psychological effect--and then he begins to mold his own psyche to that of the killer, with potentially devastating results. As directed by Mann (who was at the acme of his success with TV\\'s Miami Vice), this sophisticated cat-and-mouse game never resorts to the compromise of cheap thrills. Predating Anthony Hopkins\\'s portrayal of Lecter by four years, Cox plays the character closer to Harris\\'s original, lower-key conception, and he\\'s no less compelling in the role. Petersen is equally well cast, and as always Mann employs rock music to astonishing effect, using nearly all of Iron Butterfly\\'s heavy-metal epic \"In-A-Gadda-Da-Vida\" to accompany the film\\'s heart-stopping climactic sequence. All of this makes Manhunter one of the finest films of its kind, as well as further proof that Harris\\'s fiction is a blessing to any filmmaker brave enough to adapt it. --', 'Jeff Shannon', 'The Silence of the Lambs', \"Based on Thomas Harris's novel, this terrifying film by Jonathan Demme really only contains a couple of genuinely shocking moments (one involving an autopsy, the other a prison break). The rest of the film is a splatter-free visual and psychological descent into the hell of madness, redeemed astonishingly by an unlikely connection between a monster and a haunted young woman. Anthony Hopkins is extraordinary as the cannibalistic psychiatrist Dr. Hannibal Lecter, virtually entombed in a subterranean prison for the criminally insane. At the behest of the FBI, agent-in-training Clarice Starling (Jodie Foster) approaches Lecter, requesting his insights into the identity and methods of a serial killer named Buffalo Bill (Ted Levine). In exchange, Lecter demands the right to penetrate Starling's most painful memories, creating a bizarre but palpable intimacy that liberates them both under separate but equally horrific circumstances. Demme, a filmmaker with a uniquely populist vision (Melvin and Howard, Something Wild), also spent his early years making pulp for Roger Corman (Caged Heat), and he hasn't forgotten the significance of tone, atmosphere, and the unsettling nature of a crudely effective close-up. Much of the film, in fact, consists of actors staring straight into the camera (usually from Clarice's point of view), making every bridge between one set of eyes to another seem terribly dangerous. --\", 'Tom Keogh', 'Hannibal', 'Yes, he\\'s back, and he\\'s still hungry. Ten years after The Silence of the Lambs, Dr. Hannibal \"the Cannibal\" Lecter (Anthony Hopkins, reprising his Oscar-winning role) is living the good life in Italy, studying art and sipping espresso. FBI agent Clarice Starling (Julianne Moore, replacing Jodie Foster), on the other hand, hasn\\'t had it so good--an outsider from the start, she\\'s now a quiet, moody loner who doesn\\'t play bureaucratic games and suffers for it. A botched drug raid results in her demotion--and a request from Lecter\\'s only living victim, Mason Verger (Gary Oldman, uncredited), for a little Q and A. Little does Clarice realize that the hideously deformed Verger--who, upon suggestion from Dr. Lecter, peeled off his own face--is using her as bait to lure Dr. Lecter out of hiding, quite certain he\\'ll capture the good doctor.', \"Taking the basic plot contraptions from Thomas Harris's baroque novel, Hannibal is so stylistically different from its predecessor that it forces you to take it on its own terms. Director Ridley Scott gives the film a sleek, almost European look that lets you know that, unlike the first film (which was about the quintessentially American Clarice), this movie is all Hannibal. Does it work? Yes--but only up to a point. Scott adeptly sets up an atmosphere of foreboding, but it's all buildup for anticlimax, as Verger's plot for abducting Hannibal (and feeding him to man-eating wild boars) doesn't really deliver the requisite visceral thrills, and the much-ballyhooed climatic dinner sequence between Clarice, Dr. Lecter, and a third unlucky guest wobbles between parody and horror. Hopkins and Moore are both first-rate, but the film contrives to keep them as far apart as possible, when what made Silence so amazing was their interaction. When they do connect it's quite thrilling, but it's unfortunately too little too late. --\", 'Mark Englehart']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror/Slasher Flicks, Mystery & Suspense', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Rhys Ifans, Anthony Heald, William Petersen, Michael Mann, Lawrence A. Bonney, Kasi Lemmons, Peter Webber, Anthony Hopkins, Li Gong, David Mamet, Jodie Foster, Scott Glenn, Ridley Scott, Julianne Moore, Jonathan Demme, Steven Zaillian, Lawrence T. Wrentz, Ted TallyRhys Ifans, Anthony Heald, William Petersen, Michael Mann, Lawrence A. Bonney, Kasi Lemmons, Peter Webber, Anthony Hopkins, Li Gong, David Mamet, Jodie Foster, Scott Glenn, Ridley Scott, Julianne Moore, Jonathan Demme, Steven Zaillian, Lawrence T. Wrentz, Ted…  See more', 'Initial release date': '2020-07-06', 'Language': 'English', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': '2200', 'Director': 'Jonathan Demme, Michael Mann, Peter Webber, Ridley Scott', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 9 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Jodie Foster, Anthony Hopkins, Julianne Moore, Rhys Ifans, Li Gong', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Mann, David Mamet, Steven Zaillian, Ted Tally', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I was expecting a different storyline, not just a different version of the same. It was an ok version with different actors, but not great, and not what I was hoping for based on the description of the product.\nReview Title: Disappointed\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/02/06\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino']}\nReview Text: I have read many of Connelly's books and love them, so I was looking forward to this series. I was, however, a little disappointed with this first show. I think that Welliver did a great job portraying Bosch, but the story was just not as well put together as I think it could be. I would love to see more to see if it improves. I hope so. I know it is not the story lines that are lacking, so maybe just a bit more polishing to be done.\nReview Title: Hoping for more.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Friends: The Complete Series\nReview Date: 2014/02/21\nStore: Courteney Cox  (Actor),     David Schwimmer  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"All the laughs, all the loves, all the lattes--all yours! Settle in with the hilarious and acclaimed series about a family based on friendship. Rachel, Monica, Phoebe, Joey, Chandler and Ross were always there for each other. Now they're here for you in the complete 10-season set of\", 'Friends', '.', 'Note on Boxed Sets:', \"During shipping, discs in boxed sets occasionally become dislodged without damage. Please examine and play these discs. If you are not completely satisfied, we'll refund your purchase.\", 'Amazon.com', 'A sitcom behemoth of the last 10 years,', 'Friends', 'shot out of the gate in 1994 with snappy writing and an attractive cast. The exploits of sensitive paleontologist Ross Geller (David Schwimmer), his obsessive-compulsive sister Monica Geller (Courteney Cox); Monica\\'s roommate Rachel Green (Jennifer Aniston), a spoiled rich girl trying to live on her own; earthy aromatherapist/masseuse Phoebe Buffay (Lisa Kudrow); and Monica\\'s neighbors across the hall-- sarcastic Chandler Bing (Matthew Perry) and his dim-bulb roommate Joey Tribbiani (Matt LeBlanc) became a nationwide obsession, a pop-culture icon (remember \"The Rachel\" haircut?) and a top Nielsen hit for its entire run.', 'See the', '10 or more seasons club', '. The first two seasons were mostly centered on the on-off saga of Ross and Rachel, and while their relationship remained a strong presence through romantic rivals and even a baby, the other characters eventually moved from sideshow players into a shared comedic lead. But', 'Friends', \"was not without its heart. Most of the cast had dysfunctional relationships with their parents and went through loss, divorce, marriage, parenthood, and love triangles. The emotional pregnancies of Rachel (by Ross) and Phoebe (surrogate to her half-brother's triplets) won the actresses Emmy Awards, and Joey's tender feelings for Rachel in Season 8 won LeBlanc, the most improved actor in the series, a nomination.\", 'Most sitcoms run out of ideas by the fifth season, but', 'Friends', 'gave itself a refreshing jolt the minute Monica and Chandler wound up in bed together. Their budding romance was not only the one of the funniest arcs of the series, but one of the most sentimental, as they planned a wedding, struggled to have a child and eventually turned to adoption. By seasons seven and on, the characters had each \"grown up\" from young singletons to thirtysomethings finding permanence in their careers and love lives but never losing the laughs.', 'Just friends? See our guide to', 'who kissed whom', 'on', 'Friends', '.', 'Friends', 'featured a parade of celebrity guests, but unlike', 'Will & Grace', \", it actually utilized most of the stars as more than cameos: The sextet's parents were all brilliantly cast, particularly Kathleen Turner as Chandler's drag-queen father and Teri Garr as Phoebe's dizzy mom. Everyone from George Clooney to Sean Penn to Julia Roberts to Bruce Willis has appeared on the sitcom, and Tom Selleck certainly enjoyed a career resuscitation after his recurring role as Monica's older man.\", 'But no star power ever penetrated the bond between the six stars, and their unmatchable chemistry worked for 10 seasons. Even if the show is on reruns daily, this boxed set of', 'Friends', 'remains watchable over and over again--even if that theme song grates on your nerves.', \"Standout episodes include The One With All The Poker (Season 1), The One With The Birth (1), The One With the Prom Video (2), The One With the Flashback (3), The One Where Monica and Richard are Just Friends (3), The One Where Ross and Rachel Take a Break (3), The One With the Embryos (4), The One With All the Wedding Dresses (4), The One With the Thanksgiving Flashbacks (5), The One Where Everybody Finds Out (5), The One Where Ross Got High (6), The One With the Videotape (8), The One With the Rumor (8), The One With the Male Nanny (9), The One With Rachel's Other Sister (9), The One With Ross' Tan (10), and The One Where the Stripper Cries (10).\", '--Ellen A. Kim']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC', 'Contributor': 'Courteney Cox, Jennifer Aniston, Lisa Kudrow, David Schwimmer, Matthew Perry, Matt LeBlanc', 'Language': 'Unqualified', 'Number Of Discs': '40', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.81 Pounds', 'Item model number': '83268', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC', 'Release date': 'November 14, 2006', 'Actors': 'Courteney Cox, David Schwimmer, Jennifer Aniston, Lisa Kudrow, Matthew Perry', 'Subtitles': 'English, Spanish, Korean, French', 'Studio': 'Warner Home Video', 'Number of discs': '40'}\nReview Text: I love the packaging of this set. It is in a nice box, well organized and has a book to tell you what is on each disc.\nReview Title: Love it!\nRating: 5.0\n--------------------------------------------------",
  "reference": "State of Play [Blu-ray]\nRussell Crowe  (Actor),     Ben Affleck  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Academy Award®-winner Russell Crowe leads an all-star cast, including Ben Affleck, Rachel McAdams & Helen Mirren in the blistering thriller about deception, manipulation & corruption. When D.C. Reporter Cal McCaffrey (Crowe) is assigned to investigate the murder of an assistant to an up-and-coming politician (Affleck), he uncovers a conspiracy that threatens to bring down the nation’s power structures. In a town of spin-doctors and wealthy power brokers, he will discover one truth: when fortunes are at stake, no one’s integrity, love or life is safe. From director Kevin Macdonald of The Last King of Scotland, State of Play brings together gripping performances, riveting suspense and is “sophisticated, intelligent and powerful” (Shawn Edwards, Fox-TV).', 'Amazon.com', \"The superlative British miniseries becomes a smart, soap opera-free film courtesy The Last King of Scotland's Kevin Macdonald. His writers, including Tony Gilroy (the Bourne series) and Billy Ray (Breach), haven't simply condensed and Americanized the six-hour series--they've reinvented it. Now set in Washington D.C., veteran journalist Cal McAffrey (Russell Crowe, replacing Brad Pitt, who dropped out over script changes) still collaborates with editor Cameron Lynne (a delectably imperious Helen Mirren) and junior reporter Della Frye (Rachel McAdams) on a story involving Cal's politico pal, Stephen Collins (Ben Affleck), but there's a new subtext behind their plunge into sex scandals and corporate malfeasance, since this State of Play also eulogizes old-school beat reporting, and in interviews, Macdonald has acknowledged the influence of newsprint classics like All the President's Men (the Watergate Hotel even shows up as a location). So, while Cal and Della, the Globe’s blogger, try to determine whether the congressman’s aide Sonia (with whom he was having an affair) died at her own hands or the hands of another, they're also fighting for their careers and the survival of their ailing paper. Stephen's political rival Senator Fergus (Jeff Daniels), does his best to stymie their efforts, but PR flack Dominic Foy (Jason Bateman) becomes a reluctant ally. Though fans of the series may miss a few characters, like Cameron's son (played by James McAvoy in the BBC version), Oscar-winning documentarian-turned-filmmaker Macdonald remains true to its spirit. Be sure to stay through the poignant end credits, during which he returns to his doc roots. --\", 'Kathleen C. Fennessy', 'Stills from', 'State of Play', '(Click for larger image)']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen  See more', 'Contributor': 'Russell Crowe, Rachel McAdams, Helen Mirren, Ben Affleck', 'Initial release date': '2017-07-04', 'Language': 'English (DTS-HD Master Audio 5.1), French (DTS 5.1), Spanish (DTS 5.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 115min', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'July 4, 2017', 'Actors': 'Russell Crowe, Ben Affleck, Rachel McAdams, Helen Mirren', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nWe received the movie in a reasonable time, considering it ships to our APO. I think it took about a week. Amazon has always been very good about the shipping time. The dvd was new, no problems with it. As for the movie itself, it was far better than I had anticipated. I figured just some light entertainment, but was pleasantly surprised. The plot was very well presented by an exceptional cast.\nVery good Movie\nThe Hannibal Lecter Collection (Manhunter / Silence of the Lambs / Hannibal) [Blu-ray]\nJodie Foster  (Actor),     Anthony Hopkins  (Actor),     Jonathan Demme  (Director),     Michael Mann  (Director, Writer)    &                   1                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Hannibal Lecter Triple Feature (BD)', ']]>', 'Amazon.com', 'Manhunter', 'Though it will always be remembered as the movie featuring the \"other\" Hannibal Lecter, Michael Mann\\'s 1986 thriller Manhunter is nearly as good as The Silence of the Lambs, and in some respects it\\'s arguably even better. Based on Thomas Harris\\'s novel Red Dragon, which introduced the world to the nefarious killer Hannibal \"the Cannibal\" Lecter, the film stars William Petersen (giving a suitably brooding performance) as ex-FBI agent Will Graham, who is coaxed out of semiretirement to track down a serial killer who has thwarted the authorities at every turn.', 'Graham\\'s approach to the case is a perilous one. First he seeks counsel with Lecter (Brian Cox) in the latter\\'s high-security prison cell--an encounter that is utterly horrifying in its psychological effect--and then he begins to mold his own psyche to that of the killer, with potentially devastating results. As directed by Mann (who was at the acme of his success with TV\\'s Miami Vice), this sophisticated cat-and-mouse game never resorts to the compromise of cheap thrills. Predating Anthony Hopkins\\'s portrayal of Lecter by four years, Cox plays the character closer to Harris\\'s original, lower-key conception, and he\\'s no less compelling in the role. Petersen is equally well cast, and as always Mann employs rock music to astonishing effect, using nearly all of Iron Butterfly\\'s heavy-metal epic \"In-A-Gadda-Da-Vida\" to accompany the film\\'s heart-stopping climactic sequence. All of this makes Manhunter one of the finest films of its kind, as well as further proof that Harris\\'s fiction is a blessing to any filmmaker brave enough to adapt it. --', 'Jeff Shannon', 'The Silence of the Lambs', \"Based on Thomas Harris's novel, this terrifying film by Jonathan Demme really only contains a couple of genuinely shocking moments (one involving an autopsy, the other a prison break). The rest of the film is a splatter-free visual and psychological descent into the hell of madness, redeemed astonishingly by an unlikely connection between a monster and a haunted young woman. Anthony Hopkins is extraordinary as the cannibalistic psychiatrist Dr. Hannibal Lecter, virtually entombed in a subterranean prison for the criminally insane. At the behest of the FBI, agent-in-training Clarice Starling (Jodie Foster) approaches Lecter, requesting his insights into the identity and methods of a serial killer named Buffalo Bill (Ted Levine). In exchange, Lecter demands the right to penetrate Starling's most painful memories, creating a bizarre but palpable intimacy that liberates them both under separate but equally horrific circumstances. Demme, a filmmaker with a uniquely populist vision (Melvin and Howard, Something Wild), also spent his early years making pulp for Roger Corman (Caged Heat), and he hasn't forgotten the significance of tone, atmosphere, and the unsettling nature of a crudely effective close-up. Much of the film, in fact, consists of actors staring straight into the camera (usually from Clarice's point of view), making every bridge between one set of eyes to another seem terribly dangerous. --\", 'Tom Keogh', 'Hannibal', 'Yes, he\\'s back, and he\\'s still hungry. Ten years after The Silence of the Lambs, Dr. Hannibal \"the Cannibal\" Lecter (Anthony Hopkins, reprising his Oscar-winning role) is living the good life in Italy, studying art and sipping espresso. FBI agent Clarice Starling (Julianne Moore, replacing Jodie Foster), on the other hand, hasn\\'t had it so good--an outsider from the start, she\\'s now a quiet, moody loner who doesn\\'t play bureaucratic games and suffers for it. A botched drug raid results in her demotion--and a request from Lecter\\'s only living victim, Mason Verger (Gary Oldman, uncredited), for a little Q and A. Little does Clarice realize that the hideously deformed Verger--who, upon suggestion from Dr. Lecter, peeled off his own face--is using her as bait to lure Dr. Lecter out of hiding, quite certain he\\'ll capture the good doctor.', \"Taking the basic plot contraptions from Thomas Harris's baroque novel, Hannibal is so stylistically different from its predecessor that it forces you to take it on its own terms. Director Ridley Scott gives the film a sleek, almost European look that lets you know that, unlike the first film (which was about the quintessentially American Clarice), this movie is all Hannibal. Does it work? Yes--but only up to a point. Scott adeptly sets up an atmosphere of foreboding, but it's all buildup for anticlimax, as Verger's plot for abducting Hannibal (and feeding him to man-eating wild boars) doesn't really deliver the requisite visceral thrills, and the much-ballyhooed climatic dinner sequence between Clarice, Dr. Lecter, and a third unlucky guest wobbles between parody and horror. Hopkins and Moore are both first-rate, but the film contrives to keep them as far apart as possible, when what made Silence so amazing was their interaction. When they do connect it's quite thrilling, but it's unfortunately too little too late. --\", 'Mark Englehart']\n{'Genre': 'Horror/Slasher Flicks, Mystery & Suspense', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Rhys Ifans, Anthony Heald, William Petersen, Michael Mann, Lawrence A. Bonney, Kasi Lemmons, Peter Webber, Anthony Hopkins, Li Gong, David Mamet, Jodie Foster, Scott Glenn, Ridley Scott, Julianne Moore, Jonathan Demme, Steven Zaillian, Lawrence T. Wrentz, Ted TallyRhys Ifans, Anthony Heald, William Petersen, Michael Mann, Lawrence A. Bonney, Kasi Lemmons, Peter Webber, Anthony Hopkins, Li Gong, David Mamet, Jodie Foster, Scott Glenn, Ridley Scott, Julianne Moore, Jonathan Demme, Steven Zaillian, Lawrence T. Wrentz, Ted…  See more', 'Initial release date': '2020-07-06', 'Language': 'English', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': '2200', 'Director': 'Jonathan Demme, Michael Mann, Peter Webber, Ridley Scott', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 9 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Jodie Foster, Anthony Hopkins, Julianne Moore, Rhys Ifans, Li Gong', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Mann, David Mamet, Steven Zaillian, Ted Tally', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI was expecting a different storyline, not just a different version of the same. It was an ok version with different actors, but not great, and not what I was hoping for based on the description of the product.\nDisappointed\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino']}\nI have read many of Connelly's books and love them, so I was looking forward to this series. I was, however, a little disappointed with this first show. I think that Welliver did a great job portraying Bosch, but the story was just not as well put together as I think it could be. I would love to see more to see if it improves. I hope so. I know it is not the story lines that are lacking, so maybe just a bit more polishing to be done.\nHoping for more.\nFriends: The Complete Series\nCourteney Cox  (Actor),     David Schwimmer  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"All the laughs, all the loves, all the lattes--all yours! Settle in with the hilarious and acclaimed series about a family based on friendship. Rachel, Monica, Phoebe, Joey, Chandler and Ross were always there for each other. Now they're here for you in the complete 10-season set of\", 'Friends', '.', 'Note on Boxed Sets:', \"During shipping, discs in boxed sets occasionally become dislodged without damage. Please examine and play these discs. If you are not completely satisfied, we'll refund your purchase.\", 'Amazon.com', 'A sitcom behemoth of the last 10 years,', 'Friends', 'shot out of the gate in 1994 with snappy writing and an attractive cast. The exploits of sensitive paleontologist Ross Geller (David Schwimmer), his obsessive-compulsive sister Monica Geller (Courteney Cox); Monica\\'s roommate Rachel Green (Jennifer Aniston), a spoiled rich girl trying to live on her own; earthy aromatherapist/masseuse Phoebe Buffay (Lisa Kudrow); and Monica\\'s neighbors across the hall-- sarcastic Chandler Bing (Matthew Perry) and his dim-bulb roommate Joey Tribbiani (Matt LeBlanc) became a nationwide obsession, a pop-culture icon (remember \"The Rachel\" haircut?) and a top Nielsen hit for its entire run.', 'See the', '10 or more seasons club', '. The first two seasons were mostly centered on the on-off saga of Ross and Rachel, and while their relationship remained a strong presence through romantic rivals and even a baby, the other characters eventually moved from sideshow players into a shared comedic lead. But', 'Friends', \"was not without its heart. Most of the cast had dysfunctional relationships with their parents and went through loss, divorce, marriage, parenthood, and love triangles. The emotional pregnancies of Rachel (by Ross) and Phoebe (surrogate to her half-brother's triplets) won the actresses Emmy Awards, and Joey's tender feelings for Rachel in Season 8 won LeBlanc, the most improved actor in the series, a nomination.\", 'Most sitcoms run out of ideas by the fifth season, but', 'Friends', 'gave itself a refreshing jolt the minute Monica and Chandler wound up in bed together. Their budding romance was not only the one of the funniest arcs of the series, but one of the most sentimental, as they planned a wedding, struggled to have a child and eventually turned to adoption. By seasons seven and on, the characters had each \"grown up\" from young singletons to thirtysomethings finding permanence in their careers and love lives but never losing the laughs.', 'Just friends? See our guide to', 'who kissed whom', 'on', 'Friends', '.', 'Friends', 'featured a parade of celebrity guests, but unlike', 'Will & Grace', \", it actually utilized most of the stars as more than cameos: The sextet's parents were all brilliantly cast, particularly Kathleen Turner as Chandler's drag-queen father and Teri Garr as Phoebe's dizzy mom. Everyone from George Clooney to Sean Penn to Julia Roberts to Bruce Willis has appeared on the sitcom, and Tom Selleck certainly enjoyed a career resuscitation after his recurring role as Monica's older man.\", 'But no star power ever penetrated the bond between the six stars, and their unmatchable chemistry worked for 10 seasons. Even if the show is on reruns daily, this boxed set of', 'Friends', 'remains watchable over and over again--even if that theme song grates on your nerves.', \"Standout episodes include The One With All The Poker (Season 1), The One With The Birth (1), The One With the Prom Video (2), The One With the Flashback (3), The One Where Monica and Richard are Just Friends (3), The One Where Ross and Rachel Take a Break (3), The One With the Embryos (4), The One With All the Wedding Dresses (4), The One With the Thanksgiving Flashbacks (5), The One Where Everybody Finds Out (5), The One Where Ross Got High (6), The One With the Videotape (8), The One With the Rumor (8), The One With the Male Nanny (9), The One With Rachel's Other Sister (9), The One With Ross' Tan (10), and The One Where the Stripper Cries (10).\", '--Ellen A. Kim']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC', 'Contributor': 'Courteney Cox, Jennifer Aniston, Lisa Kudrow, David Schwimmer, Matthew Perry, Matt LeBlanc', 'Language': 'Unqualified', 'Number Of Discs': '40', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.81 Pounds', 'Item model number': '83268', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC', 'Release date': 'November 14, 2006', 'Actors': 'Courteney Cox, David Schwimmer, Jennifer Aniston, Lisa Kudrow, Matthew Perry', 'Subtitles': 'English, Spanish, Korean, French', 'Studio': 'Warner Home Video', 'Number of discs': '40'}\nI love the packaging of this set. It is in a nice box, well organized and has a book to tell you what is on each disc.\nLove it!",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: State of Play [Blu-ray]\nReview Date: 2012/06/13\nStore: Russell Crowe  (Actor),     Ben Affleck  (Actor)    Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Academy Award®-winner Russell Crowe leads an all-star cast, including Ben Affleck, Rachel McAdams & Helen Mirren in the blistering thriller about deception, manipulation & corruption. When D.C. Reporter Cal McCaffrey (Crowe) is assigned to investigate the murder of an assistant to an up-and-coming politician (Affleck), he uncovers a conspiracy that threatens to bring down the nation’s power structures. In a town of spin-doctors and wealthy power brokers, he will discover one truth: when fortunes are at stake, no one’s integrity, love or life is safe. From director Kevin Macdonald of The Last King of Scotland, State of Play brings together gripping performances, riveting suspense and is “sophisticated, intelligent and powerful” (Shawn Edwards, Fox-TV).', 'Amazon.com', \"The superlative British miniseries becomes a smart, soap opera-free film courtesy The Last King of Scotland's Kevin Macdonald. His writers, including Tony Gilroy (the Bourne series) and Billy Ray (Breach), haven't simply condensed and Americanized the six-hour series--they've reinvented it. Now set in Washington D.C., veteran journalist Cal McAffrey (Russell Crowe, replacing Brad Pitt, who dropped out over script changes) still collaborates with editor Cameron Lynne (a delectably imperious Helen Mirren) and junior reporter Della Frye (Rachel McAdams) on a story involving Cal's politico pal, Stephen Collins (Ben Affleck), but there's a new subtext behind their plunge into sex scandals and corporate malfeasance, since this State of Play also eulogizes old-school beat reporting, and in interviews, Macdonald has acknowledged the influence of newsprint classics like All the President's Men (the Watergate Hotel even shows up as a location). So, while Cal and Della, the Globe’s blogger, try to determine whether the congressman’s aide Sonia (with whom he was having an affair) died at her own hands or the hands of another, they're also fighting for their careers and the survival of their ailing paper. Stephen's political rival Senator Fergus (Jeff Daniels), does his best to stymie their efforts, but PR flack Dominic Foy (Jason Bateman) becomes a reluctant ally. Though fans of the series may miss a few characters, like Cameron's son (played by James McAvoy in the BBC version), Oscar-winning documentarian-turned-filmmaker Macdonald remains true to its spirit. Be sure to stay through the poignant end credits, during which he returns to his doc roots. --\", 'Kathleen C. Fennessy', 'Stills from', 'State of Play', '(Click for larger image)']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen  See more', 'Contributor': 'Russell Crowe, Rachel McAdams, Helen Mirren, Ben Affleck', 'Initial release date': '2017-07-04', 'Language': 'English (DTS-HD Master Audio 5.1), French (DTS 5.1), Spanish (DTS 5.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 115min', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'July 4, 2017', 'Actors': 'Russell Crowe, Ben Affleck, Rachel McAdams, Helen Mirren', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: We received the movie in a reasonable time, considering it ships to our APO. I think it took about a week. Amazon has always been very good about the shipping time. The dvd was new, no problems with it. As for the movie itself, it was far better than I had anticipated. I figured just some light entertainment, but was pleasantly surprised. The plot was very well presented by an exceptional cast.\nReview Title: Very good Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hannibal Lecter Collection (Manhunter / Silence of the Lambs / Hannibal) [Blu-ray]\nReview Date: 2012/09/06\nStore: Jodie Foster  (Actor),     Anthony Hopkins  (Actor),     Jonathan Demme  (Director),     Michael Mann  (Director, Writer)    &                   1                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Hannibal Lecter Triple Feature (BD)', ']]>', 'Amazon.com', 'Manhunter', 'Though it will always be remembered as the movie featuring the \"other\" Hannibal Lecter, Michael Mann\\'s 1986 thriller Manhunter is nearly as good as The Silence of the Lambs, and in some respects it\\'s arguably even better. Based on Thomas Harris\\'s novel Red Dragon, which introduced the world to the nefarious killer Hannibal \"the Cannibal\" Lecter, the film stars William Petersen (giving a suitably brooding performance) as ex-FBI agent Will Graham, who is coaxed out of semiretirement to track down a serial killer who has thwarted the authorities at every turn.', 'Graham\\'s approach to the case is a perilous one. First he seeks counsel with Lecter (Brian Cox) in the latter\\'s high-security prison cell--an encounter that is utterly horrifying in its psychological effect--and then he begins to mold his own psyche to that of the killer, with potentially devastating results. As directed by Mann (who was at the acme of his success with TV\\'s Miami Vice), this sophisticated cat-and-mouse game never resorts to the compromise of cheap thrills. Predating Anthony Hopkins\\'s portrayal of Lecter by four years, Cox plays the character closer to Harris\\'s original, lower-key conception, and he\\'s no less compelling in the role. Petersen is equally well cast, and as always Mann employs rock music to astonishing effect, using nearly all of Iron Butterfly\\'s heavy-metal epic \"In-A-Gadda-Da-Vida\" to accompany the film\\'s heart-stopping climactic sequence. All of this makes Manhunter one of the finest films of its kind, as well as further proof that Harris\\'s fiction is a blessing to any filmmaker brave enough to adapt it. --', 'Jeff Shannon', 'The Silence of the Lambs', \"Based on Thomas Harris's novel, this terrifying film by Jonathan Demme really only contains a couple of genuinely shocking moments (one involving an autopsy, the other a prison break). The rest of the film is a splatter-free visual and psychological descent into the hell of madness, redeemed astonishingly by an unlikely connection between a monster and a haunted young woman. Anthony Hopkins is extraordinary as the cannibalistic psychiatrist Dr. Hannibal Lecter, virtually entombed in a subterranean prison for the criminally insane. At the behest of the FBI, agent-in-training Clarice Starling (Jodie Foster) approaches Lecter, requesting his insights into the identity and methods of a serial killer named Buffalo Bill (Ted Levine). In exchange, Lecter demands the right to penetrate Starling's most painful memories, creating a bizarre but palpable intimacy that liberates them both under separate but equally horrific circumstances. Demme, a filmmaker with a uniquely populist vision (Melvin and Howard, Something Wild), also spent his early years making pulp for Roger Corman (Caged Heat), and he hasn't forgotten the significance of tone, atmosphere, and the unsettling nature of a crudely effective close-up. Much of the film, in fact, consists of actors staring straight into the camera (usually from Clarice's point of view), making every bridge between one set of eyes to another seem terribly dangerous. --\", 'Tom Keogh', 'Hannibal', 'Yes, he\\'s back, and he\\'s still hungry. Ten years after The Silence of the Lambs, Dr. Hannibal \"the Cannibal\" Lecter (Anthony Hopkins, reprising his Oscar-winning role) is living the good life in Italy, studying art and sipping espresso. FBI agent Clarice Starling (Julianne Moore, replacing Jodie Foster), on the other hand, hasn\\'t had it so good--an outsider from the start, she\\'s now a quiet, moody loner who doesn\\'t play bureaucratic games and suffers for it. A botched drug raid results in her demotion--and a request from Lecter\\'s only living victim, Mason Verger (Gary Oldman, uncredited), for a little Q and A. Little does Clarice realize that the hideously deformed Verger--who, upon suggestion from Dr. Lecter, peeled off his own face--is using her as bait to lure Dr. Lecter out of hiding, quite certain he\\'ll capture the good doctor.', \"Taking the basic plot contraptions from Thomas Harris's baroque novel, Hannibal is so stylistically different from its predecessor that it forces you to take it on its own terms. Director Ridley Scott gives the film a sleek, almost European look that lets you know that, unlike the first film (which was about the quintessentially American Clarice), this movie is all Hannibal. Does it work? Yes--but only up to a point. Scott adeptly sets up an atmosphere of foreboding, but it's all buildup for anticlimax, as Verger's plot for abducting Hannibal (and feeding him to man-eating wild boars) doesn't really deliver the requisite visceral thrills, and the much-ballyhooed climatic dinner sequence between Clarice, Dr. Lecter, and a third unlucky guest wobbles between parody and horror. Hopkins and Moore are both first-rate, but the film contrives to keep them as far apart as possible, when what made Silence so amazing was their interaction. When they do connect it's quite thrilling, but it's unfortunately too little too late. --\", 'Mark Englehart']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror/Slasher Flicks, Mystery & Suspense', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Rhys Ifans, Anthony Heald, William Petersen, Michael Mann, Lawrence A. Bonney, Kasi Lemmons, Peter Webber, Anthony Hopkins, Li Gong, David Mamet, Jodie Foster, Scott Glenn, Ridley Scott, Julianne Moore, Jonathan Demme, Steven Zaillian, Lawrence T. Wrentz, Ted TallyRhys Ifans, Anthony Heald, William Petersen, Michael Mann, Lawrence A. Bonney, Kasi Lemmons, Peter Webber, Anthony Hopkins, Li Gong, David Mamet, Jodie Foster, Scott Glenn, Ridley Scott, Julianne Moore, Jonathan Demme, Steven Zaillian, Lawrence T. Wrentz, Ted…  See more', 'Initial release date': '2020-07-06', 'Language': 'English', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': '2200', 'Director': 'Jonathan Demme, Michael Mann, Peter Webber, Ridley Scott', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 9 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Jodie Foster, Anthony Hopkins, Julianne Moore, Rhys Ifans, Li Gong', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Mann, David Mamet, Steven Zaillian, Ted Tally', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I was expecting a different storyline, not just a different version of the same. It was an ok version with different actors, but not great, and not what I was hoping for based on the description of the product.\nReview Title: Disappointed\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/02/06\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino']}\nReview Text: I have read many of Connelly's books and love them, so I was looking forward to this series. I was, however, a little disappointed with this first show. I think that Welliver did a great job portraying Bosch, but the story was just not as well put together as I think it could be. I would love to see more to see if it improves. I hope so. I know it is not the story lines that are lacking, so maybe just a bit more polishing to be done.\nReview Title: Hoping for more.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Friends: The Complete Series\nReview Date: 2014/02/21\nStore: Courteney Cox  (Actor),     David Schwimmer  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"All the laughs, all the loves, all the lattes--all yours! Settle in with the hilarious and acclaimed series about a family based on friendship. Rachel, Monica, Phoebe, Joey, Chandler and Ross were always there for each other. Now they're here for you in the complete 10-season set of\", 'Friends', '.', 'Note on Boxed Sets:', \"During shipping, discs in boxed sets occasionally become dislodged without damage. Please examine and play these discs. If you are not completely satisfied, we'll refund your purchase.\", 'Amazon.com', 'A sitcom behemoth of the last 10 years,', 'Friends', 'shot out of the gate in 1994 with snappy writing and an attractive cast. The exploits of sensitive paleontologist Ross Geller (David Schwimmer), his obsessive-compulsive sister Monica Geller (Courteney Cox); Monica\\'s roommate Rachel Green (Jennifer Aniston), a spoiled rich girl trying to live on her own; earthy aromatherapist/masseuse Phoebe Buffay (Lisa Kudrow); and Monica\\'s neighbors across the hall-- sarcastic Chandler Bing (Matthew Perry) and his dim-bulb roommate Joey Tribbiani (Matt LeBlanc) became a nationwide obsession, a pop-culture icon (remember \"The Rachel\" haircut?) and a top Nielsen hit for its entire run.', 'See the', '10 or more seasons club', '. The first two seasons were mostly centered on the on-off saga of Ross and Rachel, and while their relationship remained a strong presence through romantic rivals and even a baby, the other characters eventually moved from sideshow players into a shared comedic lead. But', 'Friends', \"was not without its heart. Most of the cast had dysfunctional relationships with their parents and went through loss, divorce, marriage, parenthood, and love triangles. The emotional pregnancies of Rachel (by Ross) and Phoebe (surrogate to her half-brother's triplets) won the actresses Emmy Awards, and Joey's tender feelings for Rachel in Season 8 won LeBlanc, the most improved actor in the series, a nomination.\", 'Most sitcoms run out of ideas by the fifth season, but', 'Friends', 'gave itself a refreshing jolt the minute Monica and Chandler wound up in bed together. Their budding romance was not only the one of the funniest arcs of the series, but one of the most sentimental, as they planned a wedding, struggled to have a child and eventually turned to adoption. By seasons seven and on, the characters had each \"grown up\" from young singletons to thirtysomethings finding permanence in their careers and love lives but never losing the laughs.', 'Just friends? See our guide to', 'who kissed whom', 'on', 'Friends', '.', 'Friends', 'featured a parade of celebrity guests, but unlike', 'Will & Grace', \", it actually utilized most of the stars as more than cameos: The sextet's parents were all brilliantly cast, particularly Kathleen Turner as Chandler's drag-queen father and Teri Garr as Phoebe's dizzy mom. Everyone from George Clooney to Sean Penn to Julia Roberts to Bruce Willis has appeared on the sitcom, and Tom Selleck certainly enjoyed a career resuscitation after his recurring role as Monica's older man.\", 'But no star power ever penetrated the bond between the six stars, and their unmatchable chemistry worked for 10 seasons. Even if the show is on reruns daily, this boxed set of', 'Friends', 'remains watchable over and over again--even if that theme song grates on your nerves.', \"Standout episodes include The One With All The Poker (Season 1), The One With The Birth (1), The One With the Prom Video (2), The One With the Flashback (3), The One Where Monica and Richard are Just Friends (3), The One Where Ross and Rachel Take a Break (3), The One With the Embryos (4), The One With All the Wedding Dresses (4), The One With the Thanksgiving Flashbacks (5), The One Where Everybody Finds Out (5), The One Where Ross Got High (6), The One With the Videotape (8), The One With the Rumor (8), The One With the Male Nanny (9), The One With Rachel's Other Sister (9), The One With Ross' Tan (10), and The One Where the Stripper Cries (10).\", '--Ellen A. Kim']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC', 'Contributor': 'Courteney Cox, Jennifer Aniston, Lisa Kudrow, David Schwimmer, Matthew Perry, Matt LeBlanc', 'Language': 'Unqualified', 'Number Of Discs': '40', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.81 Pounds', 'Item model number': '83268', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC', 'Release date': 'November 14, 2006', 'Actors': 'Courteney Cox, David Schwimmer, Jennifer Aniston, Lisa Kudrow, Matthew Perry', 'Subtitles': 'English, Spanish, Korean, French', 'Studio': 'Warner Home Video', 'Number of discs': '40'}\nReview Text: I love the packaging of this set. It is in a nice box, well organized and has a book to tell you what is on each disc.\nReview Title: Love it!\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe individual's purchase history reveals a strong preference for Blu-ray and DVD formats, particularly in the genres of drama, suspense, horror, and comedy, indicating a tendency towards high-quality audiovisual experiences. Consistently high ratings suggest a discerning taste for well-crafted narratives, with a specific appreciation for films featuring talented actors and strong storytelling elements, as reflected in several reviews highlighting pleasantly surprising plot developments.\n\nFrequent purchases of suspenseful and compelling narratives, like political thrillers and classic horror series, illustrate a fondness for gripping storytelling and psychological complexity. Reviews show a slight disappointment when expectations for unique storylines are not met, indicating a desire for innovation within familiar formats.\n\nQuality is paramount, with high average ratings across different purchases, indicating a low tolerance for subpar productions. The reviewer's engagement with products like box sets highlights a preference for comprehensive collections over single releases and an appreciation for organized packaging.\n\nWhile price sensitivity is less discernable, the choice of premium formats suggests a willingness to invest in quality entertainment. Overall, this consumer exhibits a preference for critically acclaimed, well-acted films and series with intricate plots, delivered in quality formats, reflecting a sophisticated approach to home entertainment.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Good Movie Bad Ending",
    "text": "You know when you watch a really good, captivating movie, where you just can't wait to see how things develop, and then it just suddenly ends, like &#34;oh, we just ran out of film; oh, well, guess we will just stop here.&#34; Yeah, that is how I felt about this movie! Good story, love Denzel, interesting idea, but the ending just wasn't what I would have wanted. Guess I want everything spelled out a bit more. Definitely worth watching, though!",
    "images": [],
    "asin": "B003SI9WMS",
    "parent_asin": "B003SI9WMS",
    "user_id": "AHAWKQJ7CKJQAHWZBL2G3HKSUSGQ",
    "timestamp": "2014-05-11 06:49:07",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": "Deja Vu",
    "average_rating": 4.7,
    "rating_number": 5855,
    "features": [
      "IMDb 7.1",
      "2 h 5 min",
      "2006",
      "X-Ray",
      "PG-13"
    ],
    "description": [
      "After a ferry is bombed in New Orleans, an ATF agent joins a unique investigation using experimental surveillance technology to find the bomber - but finds himself becoming obsessed with one of the victims. Denzel Washington stars."
    ],
    "price": 19.49,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1ae192aa3033a3575b38b34df73c71e60e5e0b569b7ece724ac6ed9aaf3c0a61._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1ae192aa3033a3575b38b34df73c71e60e5e0b569b7ece724ac6ed9aaf3c0a61._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1ae192aa3033a3575b38b34df73c71e60e5e0b569b7ece724ac6ed9aaf3c0a61._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1ae192aa3033a3575b38b34df73c71e60e5e0b569b7ece724ac6ed9aaf3c0a61._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1ae192aa3033a3575b38b34df73c71e60e5e0b569b7ece724ac6ed9aaf3c0a61._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1ae192aa3033a3575b38b34df73c71e60e5e0b569b7ece724ac6ed9aaf3c0a61._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": [
      "Science Fiction",
      "Suspense",
      "Cerebral",
      "Tense"
    ],
    "details": {
      "Content advisory": [
        "Violence",
        "alcohol use",
        "smoking",
        "foul language"
      ],
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]",
        "Español"
      ],
      "Directors": [
        "Tony Scott"
      ],
      "Producers": [
        "Jerry Bruckheimer"
      ],
      "Starring": [
        "Denzel Washington",
        "Val Kilmer",
        "Paula Patton"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}