{
  "user_id": "AFWAHIDJIOIPKYXMVEESGKAIXN3A",
  "summary": "=== Purchase Information ===\nProduct Title: Bound [DVD]\nReview Date: 2007/05/25\nStore: Jennifer Tilly  (Actor),     Gina Gershon  (Actor),     Andy Wachowski  (Director, Writer),     Lana Wachowski  (Director, Writer)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, Lionsgate Indie Selects\nAverage Rating: 4.6\nProduct Details: {'Format': 'Closed-captioned, Color, DVD, NTSC, Widescreen, Letterboxed', 'Contributor': 'John P. Ryan, Mary Mara, Andy Wachowski, Susie Bright, Barry Kivel, Lana Wachowski, Ivan Kane, Joe Pantoliano, Richard C. Sarafian, Gina Gershon, Christopher Meloni, Margaret Smith, Jennifer Tilly, Peter SpellosJohn P. Ryan, Mary Mara, Andy Wachowski, Susie Bright, Barry Kivel, Lana Wachowski, Ivan Kane, Joe Pantoliano, Richard C. Sarafian, Gina Gershon, Christopher Meloni, Margaret Smith, Jennifer Tilly, Peter Spellos   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Director': 'Andy Wachowski, Lana Wachowski', 'Media Format': 'Closed-captioned, Color, DVD, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 14, 2001', 'Actors': 'Jennifer Tilly, Gina Gershon, Joe Pantoliano, John P. Ryan, Christopher Meloni', 'Subtitles': 'Spanish', 'Studio': 'Republic Pictures', 'Writers': 'Andy Wachowski, Lana Wachowski', 'Number of discs': '1'}\nReview Text: A great suspense movie with a lesbian main characters. This is not often seen in the many of the lesbian films. The roles are well portrayed by the actors and a great lesbian sex scene.\nReview Title: Bound\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: D.E.B.S. (Special Edition)\nReview Date: 2007/05/25\nStore: Sarah Foster  (Actor),     Jordana Brewster  (Actor),     Angela Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Sultry crime boss Lucy Diamond (Jordana Brewster, The Fast and the Furious) is back in the states and the D.E.B.S.- an elite team of paramilitary college co-ed superspies- are hot on her trail. But when their top agent, gorgeous Amy Bradshaw (Sara Foster, The Big Bounce), mysteriously disappears after coming face to face with the attractive young villainess, the D.E.B.S. begin a full-scale search for Lucy's secret lair, never suspecting that Amy may not want to be rescued after all, in this smart and sexy spy spoof about love at first gun sight.\", 'Amazon.com', 'You can say this about', 'D.E.B.S.', ': director Angela Robinson\\x92s 2005 feature isn\\x92t very good, but it is surprisingly entertaining. The premise, which bears a passing resemblance to any number of previous films (from', 'Heathers', 'and', 'Clueless', 'to', 'Charlie\\x92s Angels', 'and the', 'Austin Powers', 'franchise), involves a secret government agency recruiting young women as spies, based on their smarts, their ability to lie convincingly, and the fact that they look fetching in ultra-miniskirts. Four of the D.E.B.S. are then charged with collaring \"criminal mastermind\" Lucy Diamond (Jordana Brewster), who has returned to the States after hatching all manner of nefarious plots overseas. Then comes the twist: Diamond is gay, and one of our heroines, Amy Bradshaw (Sara Foster), unexpectedly finds herself falling in love with her. Out goes the espionage element; in comes the love story, and therein lies the surprise, as this burgeoning lesbian relationship is handled with unexpected sympathy, even tenderness. Sure, the acting, even by veteran grownups like Holland Taylor and Michael Clarke Duncan, is almost uniformly lame, and the script is silly; overall, the film would have to put on considerable weight to even be considered frothy. Still,', 'D.E.B.S.', 'isn\\x92t a bad way to kill a couple of hours. DVD bonus features include a making-of featurette and commentary by Robinson and the cast.', '--Sam Graham']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Jasmine Kosovic, Sarah Foster, Devon Aoki, Holland Taylor, Geoff Stults, Angela Robinson, Meagan Good, Jordana Brewster, Jill Ritchie, Michael Clarke Duncan, Anonymous Content, Jimmi Simpson, Andrea SperlingJasmine Kosovic, Sarah Foster, Devon Aoki, Holland Taylor, Geoff Stults, Angela Robinson, Meagan Good, Jordana Brewster, Jill Ritchie, Michael Clarke Duncan, Anonymous Content, Jimmi Simpson, Andrea Sperling   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.35:1, 1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Angela Robinson', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'June 7, 2005', 'Actors': 'Sarah Foster, Jordana Brewster, Meagan Good, Devon Aoki, Jill Ritchie', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Jasmine Kosovic, Andrea Sperling', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: A great movie to have fun with. The best satorical comment on lesbian coming out and dating. A film that can make anyone laugh at that first chance meeting. One that can be watched more than once and still laugh.\nReview Title: D.E.B.S.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Loving Annabelle\nReview Date: 2007/05/25\nStore: Diane Gaidry  (Actor),     Erin Kelly (III)  (Actor),     Katherine Brooks  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: ['Product Description', \"Rising star Erin Kelly (Waking Madison) is Annabelle, a precocious Senator's daughter who falls for her Catholic school teacher, Simone (Diane Gaidry, the Dogwalker). After Simone is assigned to control the rebellious student, she instead finds herself drawn into Annabelle's world. As their attraction builds, the two women must cope with the reactions of those around them. Writer-Director Katherine Brooks unveils this smoldering tale of forbidden love with intelligence, wit and sensitivity.\", 'Amazon.com', 'A lot of taboos are broken in', 'Loving Annabelle', ', even if the film itself remains remarkably tasteful--even demure. The central characters are two women, a teacher and her student, and the setting is an all-girls school (shades of', 'Lost and Delirious', \"). Annabelle (the smoldering Erin Kelly), a senior, is a rebellious rocker chick--the Beverly Hills version that is, i.e. highlighted hair, black eyeliner, and nose ring. Her senatorial mother ships her off to boarding school to shape up. Annabelle's hard-partying ways are starting to become an embarrassment. Miss Simone Bradley (the sympathetic Diane Gaidry) is a popular poetry teacher. She's a Catholic. Annabelle is not. Simone has a boyfriend, Annabelle is gay. Looks can be deceiving, however, and there's more to both than meets the eye. For one, Simone's relationship is not as secure as it appears. For another, Annabelle's ardor is so relentless it threatens to sway sympathy against her. She seems to have no regard for the damage an affair would inflict on her teacher's career. Nonetheless, Simone is not entirely resistant to her charms. Inspired by 1931's\", 'Mädchen in Uniform', \", writer/director Katherine Brooks preserves the forbidden relationship at the heart of the Weimar-era classic, but drops the political subtext. Consequently, she doesn't take on more than she can handle, but\", 'Loving Annabelle', 'still feels a little slight.', '--Kathleen C. Fennessy', 'Review', 'Absolute visual treat... engrossing from beginning to end... viewers will be riveted. DVD Talk Guilty pleasure. Dennis Harvey, Variety Lively, thought-provoking, compelling, slickly produced. Curve --wolfe', 'See more']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Gay & Lesbian', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Wendy Schaal, Erin Kelly (III), Steve Sabo, Josh Silberman, Kari Lane, Jennie Floyd, Michelle Horn, Katherine Brooks, Jake Newton, Karen Teliha, Ilene Graff, Diane Gaidry, Greg Joelson, John Farley, Stephen Rue, Gustine Fudickar, Marla Maples, Leslie Andrews (II), Kevin McCarthy, Laura Breckenridge, Markus FlanaganWendy Schaal, Erin Kelly (III), Steve Sabo, Josh Silberman, Kari Lane, Jennie Floyd, Michelle Horn, Katherine Brooks, Jake Newton, Karen Teliha, Ilene Graff, Diane Gaidry, Greg Joelson, John Farley, Stephen Rue, Gustine Fudickar, Marla Maples, Leslie Andrews (II), Kevin McCart…  See more', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 16 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '4315', 'Director': 'Katherine Brooks', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 16 minutes', 'Release date': 'December 12, 2006', 'Actors': 'Diane Gaidry, Erin Kelly (III), Laura Breckenridge, Jennie Floyd, Greg Joelson', 'Studio': 'Wolfe Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The acting is terrific but the ending left many questions unanswered. Not unlike the movie it is based upon \"Maedchen in Uniform.\"\nReview Title: Loving Annabelle\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Another Way [DVD]\nReview Date: 2008/03/25\nStore: Jadwiga Jankowska-Cieslak  (Actor),     Ildik Bnsgi  (Actor),     Jnos Xantus  (Director),     Kroly Makk  (Director, Writer)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"An army officer's wife and a lesbian journalist fall in love in the aftermath of the failed 1956 Hungarian uprising.\"]\nAverage Rating: 3.7\nProduct Details: {'Genre': 'International', 'Format': 'DVD, Subtitled, Widescreen, NTSC, Color', 'Contributor': 'Gyula Szab, Anette Antal, Jadwiga Jankowska-Cieslak, Judit Herndi, Zoltn Benkczy, Grazyna Szapolowska, Pter Andorai, Gyrgyi Fy, Ildik Bnsgi, Va Ig, Kroly Makk, Jozef Krner, Ferenc Bcs, Erzsbet Galgczi, Jnos XantusGyula Szab, Anette Antal, Jadwiga Jankowska-Cieslak, Judit Herndi, Zoltn Benkczy, Grazyna Szapolowska, Pter Andorai, Gyrgyi Fy, Ildik Bnsgi, Va Ig, Kroly Makk, Jozef Krner, Ferenc Bcs, Erzsbet Galgczi, Jnos Xantus  See more', 'Language': 'Hungarian', 'Runtime': '1 hour and 42 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Jnos Xantus, Kroly Makk', 'Media Format': 'DVD, Subtitled, Widescreen, NTSC, Color', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 26, 2006', 'Actors': 'Jadwiga Jankowska-Cieslak, Ildik Bnsgi, Grazyna Szapolowska, Judit Herndi, Jozef Krner', 'Subtitles': 'English', 'Studio': 'Bunyik Entertainment', 'Writers': 'Erzsbet Galgczi, Kroly Makk', 'Number of discs': '1'}\nReview Text: Under the influence of communism the view of homosexuality is very contrary to the western view shared today. There are still countries that treat homosexuality as depicted in this film, a definite must for the person interested in historical persepectives on the subject.<br />Wonderfully acted and cinematography.\nReview Title: good historical perspective\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Beautiful Creatures (DVD)\nReview Date: 2013/10/26\nStore: Alden Ehrenreich  (Actor),     Alice Englert  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Beautiful Creatures (DVD)', 'Based on the New York Times best-selling young adult novel, this hauntingly intense coming-of-age story about two teenage star-crossed lovers in a small South Carolina town who uncover dark secrets about their families, their history and their town has been adapted and directed by Oscar®-nominated filmmaker Richard LaGravenese (The Fisher King). Oscar® winners Emma Thompson (Harry Potter films) and Jeremy Irons (The Mission), Oscar® nominee Viola Davis (The Help), Golden Globe nominee Emmy Rossum (Shameless) and more play the cursed denizens of the small-town in this supernatural love story.', ']]>', 'Amazon.com', 'Beautiful Creatures', 'flies into the otherworldly romantic sphere occupied by the', 'Twilight', 'films,', 'Buffy', ',', 'The Vampire Diaries', ',', 'True Blood', '--even', 'Charmed', '. Based on the best-selling young adult book by Kami Garcia, the film adaptation of', 'Beautiful Creatures', \"tells a romantic tale between two young people with mysterious, dark backgrounds--and more than one secret. The young stars, Alice Englert as Lena and Alden Ehrenreich as Ethan, to whom she's mysteriously drawn, have a sweet, believable chemistry. And because it's directed by pro Richard LaGravenese (the underrated but fabulous\", 'Living Out Loud', ',', 'P.S. I Love You', '),', 'Beautiful Creatures', \"is blessed with high production values; a quick, satisfying pace; and a supporting cast to die for (maybe literally). Emma Thompson, Viola Davis, Emmy Rossum, and Jeremy Irons, especially, seem to be enjoying themselves immensely as titular grownups in a teenage love story. This cast--and Lena's unexpected but badass supernatural power--all help add up to a delicious guilty pleasure.\", 'Beautiful Creatures', 'shines with much more polish than some of the', 'Twilight', 'films, but carries just as much dramatic yearning. As well it should. --', 'A.T. Hurley']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Drama/Love & Romance', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Ultraviolet', 'Contributor': 'Emmy Rossum, Andrew A. Kosove, Emma Thompson, Molly Mickler Smith, Alice Englert, Erwin Stoff, Jeremy Irons, Richard LaGravenese, Broderick Johnson, Yolanda T. Cochran, Margaret Stohl, Viola Davis, David Valdes, Alden Ehrenreich, Thomas Mann, Kami GarciaEmmy Rossum, Andrew A. Kosove, Emma Thompson, Molly Mickler Smith, Alice Englert, Erwin Stoff, Jeremy Irons, Richard LaGravenese, Broderick Johnson, Yolanda T. Cochran, Margaret Stohl, Viola Davis, David Valdes, Alden Ehrenreich, Thomas Mann, Kami Garcia   See more', 'Language': 'English', 'Studio': 'WarnerBrothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000336965DVD', 'Director': 'Richard LaGravenese', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Ultraviolet', 'Release date': 'May 21, 2013', 'Actors': 'Alden Ehrenreich, Alice Englert, Jeremy Irons, Viola Davis, Emmy Rossum', 'Producers': 'Erwin Stoff, Yolanda T. Cochran, Andrew A. Kosove, Broderick Johnson, Molly Mickler Smith', 'Writers': 'Richard LaGravenese', 'Number of discs': '1'}\nReview Text: The premise is good and the special effects are wonderful. Not a scary or great movie but worth a bowl of popcorn and watching.\nReview Title: It is entertaining\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: April's Shower\nReview Date: 2013/10/26\nStore: Maria Cina  (Actor),     Trish Doolan  (Actor, Director, Writer)    Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['A COMEDY ABOUT LOVE, ROMANCE & EXPECTATION THAT DEMANDS YOU TO ASK HOW FAR YOU WOULD GO FOR TRUE LOVE & IF YOU HAVE THE STRENGTH TO LIVE IN YOUR TRUTH.']\nAverage Rating: 3.8\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Director': 'Trish Doolan', 'Media Format': 'Multiple Formats, Color, Closed-captioned, Dolby, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 23, 2006', 'Actors': 'Maria Cina, Trish Doolan, Randall Batinkoff, Denise Miller, Joe Tabb', 'Language': 'Unqualified', 'Studio': 'Liberation Ent', 'Writers': 'Trish Doolan', 'Number of discs': '1'}\nReview Text: It was fun to watch. A feel good comedy because hopefully your life isn't like the one in the movie. The movies would be a good date movie to curl up on the couch and watch with a friend and have some laughs.\nReview Title: Good comedy\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Three Veils\nReview Date: 2013/10/26\nStore: Sheetal Sheth  (Actor),     Angela Zahra  (Actor),     Rolla Selbak  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Winner of 10 international awards, Three Veils is a poignant and daring film about three young Middle-Eastern women living in the U.S, each with her own personal story. Leila, taken by fantasies of the perfect lover, agrees to an arranged marriage that goes terribly wrong. Amira, a devout Muslim, finds herself in a desperate battle between her faith and her repressed feelings towards women. And, Nikki, a troubled soul who spirals downward on a self-destructive path when her dark and painful past finally catches up to her. As the three stories tenderly unfold, the lives of these three women intertwine while they each struggle to defy tradition and create their own realities.', 'Review', \"Heartily Recommended... The performances are fantastic of course, Sheetal Sheth is amazing and beautiful and Angela Zahra is phenomenal... It's one of the most bold and daring films out there. --AfterEllen.comThree Veils has great production values and a beautiful cast. It is unusual to see a film completely set in the Arab-American community, so it is worth taking a closer look underneath these women's metaphoric veils. --Echo MagazineRolla Selbak, director of Three Veils, paints a rare portrait about life in America for three women with Middle Eastern roots in the Muslim world. --San Diego Gay & Lesbian News\"]\nAverage Rating: 3.8\nProduct Details: {'Format': 'Multiple Formats, NTSC, Widescreen, Dolby, Surround Sound', 'Contributor': 'Madline Tabar, Sheetal Sheth, Angela Zahra, Eric Avari, Rolla Selbak, Mercedes Masöhn', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Rolla Selbak', 'Media Format': 'Multiple Formats, NTSC, Widescreen, Dolby, Surround Sound', 'Run time': '1 hour and 57 minutes', 'Release date': 'August 10, 2012', 'Actors': 'Sheetal Sheth, Angela Zahra, Mercedes Masöhn, Madline Tabar, Eric Avari', 'Studio': 'Zahra Pictures', 'Number of discs': '1'}\nReview Text: Some will not like the culture education but it really shows the differences and similarity in how it all comes down to being human. No matter what your ethnicity, size, sexuality, or religion, we all crave acceptance. Without acceptance the pain is often numbing and paralyzing to the one considered the outsider. These actors portray this very well and you feel their pain. I recommend watching this and opening your heart and mind.\nReview Title: I liked it\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Orange Is The New Black: Season 1 [DVD]\nReview Date: 2014/07/21\nStore: Taylor Schilling  (Actor),     Jason Biggs  (Actor),     Michael Trim  (Director),     Uta Briesewitz  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Award Winners in Movies & TV, Golden Globe Central, Golden Globe Nominees\nProduct Description: [\"From the creator of WEEDS comes a heartbreaking and hilarious new series set in a women's prison. Based on Piper Kerman's acclaimed memoir, Orange Is the New Black follows engaged Brooklynite Piper Chapman, whose wild past comes back to haunt her and results in her arrest and detention in a federal penitentiary. To pay her debt to society, Piper trades her comfortable New York life for an orange prison jumpsuit and finds unexpected conflict and camaraderie amidst an eccentric group of inmates.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, UltravioletMultiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, Ultraviolet   See more', 'Contributor': 'Kate Mulgrew, Uzo Aduba, Pablo Schreiber, Laverne Cox, Yael Stone, Natasha Lyonne, Andrew McCarthy, Danielle Brooks, Samira Wiley, Phil Abraham, Constantine Makris, Jason Biggs, Taylor Schilling, Uta Briesewitz, Jodie Foster, Matt Penn, Elizabeth Rodriguez, Michael Trim, Selenis Leyva, Taryn Manning, Matt McGorry, Laura Prepon, Dascha PolancoKate Mulgrew, Uzo Aduba, Pablo Schreiber, Laverne Cox, Yael Stone, Natasha Lyonne, Andrew McCarthy, Danielle Brooks, Samira Wiley, Phil Abraham, Constantine Makris, Jason Biggs, Taylor Schilling, Uta Briesewitz, Jodie Foster, Matt Penn, Elizabeth Rodriguez, Micha…   See more', 'Language': 'English', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '1775', 'Director': 'Michael Trim, Uta Briesewitz, Jodie Foster, Andrew McCarthy, Matt Penn', 'Media Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, Ultraviolet', 'Run time': '12 hours and 10 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Taylor Schilling, Jason Biggs, Laura Prepon, Kate Mulgrew, Danielle Brooks', 'Subtitles': 'English, French, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '4'}\nReview Text: I didn't think I would like this series but it is very captivating. I sat and watched the season in two days. The writing and acting are above par. The intimacy of the background stories make the characters whole. Most of us could see ourselves or people we know in the same situations that these women and we wonder how we would cope being locked up in prison.\nReview Title: A Must See Series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Reaching for the Moon\nReview Date: 2014/07/21\nStore: Glória Pires  (Actor),     Miranda Otto  (Actor),     Bruno Barreto  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', \"This sumptuous English-language '50s period piece recounts the years of Pulitzer Prize-winning poet Elizabeth Bishop (Miranda Otto, Lord of the Rings) when she left America to live and write in Rio de Janiero - where she would fall in love with well-off architect Lota de Macedo Soares (beautifully handsome Brazilian star Glória Pires).\", 'Review', 'Gorgeously shot against the lush postcard backdrops of 50s and 60s South America. --Entertainment WeeklyImagines Elizabeth Bishop s extraordinary relationship with the Brazilian architect Lota de Macedo Soares... a battle of creative and romantic egos. --New York Times', 'About the Director', 'BRUNO BARRETO (Director) Biography Born in1955 in Rio de Janeiro, Bruno Barreto has directed to date 18 feature films. His first was \"Tati\" in 1972, at the age of 17, followed by A Estrela Sobe (The Rising Star) and Dona Flor and Her Two Husbands, the biggest box office hit in Brazil until 2011, with more than 12 million tickets sold, and a Golden Globe Nomination for Best Foreign Language Film. Among other notable films are: Four Days in September nominated for an Oscar for Best Foreign Film in 1998, Bossa Nova (with Amy Irving and Antonio Fagundes), a valentine for the city of Rio de Janeiro where he was born, and Romeo and Juliet Get Married which won several best film (audience award) in many international festivals. Since 1990, Bruno Barreto has divided his career between Brazil and the United States, where he made six feature films with major stars such as Robert Duvall, Andy Garcia, Kevin Spacey and Amy Irving in A Show of Force, Dennis Hopper and Amy Irving in Carried Away, Gwyneth Paltrow and Mike Myers in View from the Top. In 2005 Bruno Barreto returned to Brazil and based himself in São Paulo, where he made Romeo and Juliet Get Marred and Money on the Side. In 2007, BrLIMITED THEATRICAL: NEW YORK, LOS ANGELES, ENCINO, PASADENA, WEST HOLLYWOOD, SAN FRANCISCO, SAN DIEGO uno directed Last Stop 174, which premiered at the 2008 Toronto International Film Festival to rave reviews and sold out screenings. Bruno has recently finished Reaching for the Moon, starring Miranda Otto and Glória Pires which tells the story of Elizabeth Bishop, one of the greatest poets of the English language, and her long relationship with the Brazilian architect Lota de Macedo Soares.', 'See more']\nAverage Rating: 4.3\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': '28935790', 'Director': 'Bruno Barreto', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Full Screen, Surround Sound', 'Run time': '1 hour and 58 minutes', 'Release date': 'February 4, 2014', 'Actors': 'Glória Pires, Miranda Otto, Tracy Middendorf', 'Studio': 'Wolfe Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: How can the strong be broken and the broken so strong? This love story is monumental. It changes the way one thinks of strong. Elizabeth seems like such the lost soul and Lota helps her recover but when Lota falls does Elizabeth abandon her or just moves out of her way. You must make that decision for yourself. A riveting story and played wonderfully on the screen. I recommend watching this one.\nReview Title: A Love to Relish and Remember.\nRating: 5.0\n--------------------------------------------------",
  "reference": "Bound [DVD]\nJennifer Tilly  (Actor),     Gina Gershon  (Actor),     Andy Wachowski  (Director, Writer),     Lana Wachowski  (Director, Writer)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, Lionsgate Indie Selects\n{'Format': 'Closed-captioned, Color, DVD, NTSC, Widescreen, Letterboxed', 'Contributor': 'John P. Ryan, Mary Mara, Andy Wachowski, Susie Bright, Barry Kivel, Lana Wachowski, Ivan Kane, Joe Pantoliano, Richard C. Sarafian, Gina Gershon, Christopher Meloni, Margaret Smith, Jennifer Tilly, Peter SpellosJohn P. Ryan, Mary Mara, Andy Wachowski, Susie Bright, Barry Kivel, Lana Wachowski, Ivan Kane, Joe Pantoliano, Richard C. Sarafian, Gina Gershon, Christopher Meloni, Margaret Smith, Jennifer Tilly, Peter Spellos   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Director': 'Andy Wachowski, Lana Wachowski', 'Media Format': 'Closed-captioned, Color, DVD, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 14, 2001', 'Actors': 'Jennifer Tilly, Gina Gershon, Joe Pantoliano, John P. Ryan, Christopher Meloni', 'Subtitles': 'Spanish', 'Studio': 'Republic Pictures', 'Writers': 'Andy Wachowski, Lana Wachowski', 'Number of discs': '1'}\nA great suspense movie with a lesbian main characters. This is not often seen in the many of the lesbian films. The roles are well portrayed by the actors and a great lesbian sex scene.\nBound\nD.E.B.S. (Special Edition)\nSarah Foster  (Actor),     Jordana Brewster  (Actor),     Angela Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Sultry crime boss Lucy Diamond (Jordana Brewster, The Fast and the Furious) is back in the states and the D.E.B.S.- an elite team of paramilitary college co-ed superspies- are hot on her trail. But when their top agent, gorgeous Amy Bradshaw (Sara Foster, The Big Bounce), mysteriously disappears after coming face to face with the attractive young villainess, the D.E.B.S. begin a full-scale search for Lucy's secret lair, never suspecting that Amy may not want to be rescued after all, in this smart and sexy spy spoof about love at first gun sight.\", 'Amazon.com', 'You can say this about', 'D.E.B.S.', ': director Angela Robinson\\x92s 2005 feature isn\\x92t very good, but it is surprisingly entertaining. The premise, which bears a passing resemblance to any number of previous films (from', 'Heathers', 'and', 'Clueless', 'to', 'Charlie\\x92s Angels', 'and the', 'Austin Powers', 'franchise), involves a secret government agency recruiting young women as spies, based on their smarts, their ability to lie convincingly, and the fact that they look fetching in ultra-miniskirts. Four of the D.E.B.S. are then charged with collaring \"criminal mastermind\" Lucy Diamond (Jordana Brewster), who has returned to the States after hatching all manner of nefarious plots overseas. Then comes the twist: Diamond is gay, and one of our heroines, Amy Bradshaw (Sara Foster), unexpectedly finds herself falling in love with her. Out goes the espionage element; in comes the love story, and therein lies the surprise, as this burgeoning lesbian relationship is handled with unexpected sympathy, even tenderness. Sure, the acting, even by veteran grownups like Holland Taylor and Michael Clarke Duncan, is almost uniformly lame, and the script is silly; overall, the film would have to put on considerable weight to even be considered frothy. Still,', 'D.E.B.S.', 'isn\\x92t a bad way to kill a couple of hours. DVD bonus features include a making-of featurette and commentary by Robinson and the cast.', '--Sam Graham']\n{'Genre': 'Action, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Jasmine Kosovic, Sarah Foster, Devon Aoki, Holland Taylor, Geoff Stults, Angela Robinson, Meagan Good, Jordana Brewster, Jill Ritchie, Michael Clarke Duncan, Anonymous Content, Jimmi Simpson, Andrea SperlingJasmine Kosovic, Sarah Foster, Devon Aoki, Holland Taylor, Geoff Stults, Angela Robinson, Meagan Good, Jordana Brewster, Jill Ritchie, Michael Clarke Duncan, Anonymous Content, Jimmi Simpson, Andrea Sperling   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.35:1, 1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Angela Robinson', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'June 7, 2005', 'Actors': 'Sarah Foster, Jordana Brewster, Meagan Good, Devon Aoki, Jill Ritchie', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Jasmine Kosovic, Andrea Sperling', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nA great movie to have fun with. The best satorical comment on lesbian coming out and dating. A film that can make anyone laugh at that first chance meeting. One that can be watched more than once and still laugh.\nD.E.B.S.\nLoving Annabelle\nDiane Gaidry  (Actor),     Erin Kelly (III)  (Actor),     Katherine Brooks  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Independently Distributed, Drama\n['Product Description', \"Rising star Erin Kelly (Waking Madison) is Annabelle, a precocious Senator's daughter who falls for her Catholic school teacher, Simone (Diane Gaidry, the Dogwalker). After Simone is assigned to control the rebellious student, she instead finds herself drawn into Annabelle's world. As their attraction builds, the two women must cope with the reactions of those around them. Writer-Director Katherine Brooks unveils this smoldering tale of forbidden love with intelligence, wit and sensitivity.\", 'Amazon.com', 'A lot of taboos are broken in', 'Loving Annabelle', ', even if the film itself remains remarkably tasteful--even demure. The central characters are two women, a teacher and her student, and the setting is an all-girls school (shades of', 'Lost and Delirious', \"). Annabelle (the smoldering Erin Kelly), a senior, is a rebellious rocker chick--the Beverly Hills version that is, i.e. highlighted hair, black eyeliner, and nose ring. Her senatorial mother ships her off to boarding school to shape up. Annabelle's hard-partying ways are starting to become an embarrassment. Miss Simone Bradley (the sympathetic Diane Gaidry) is a popular poetry teacher. She's a Catholic. Annabelle is not. Simone has a boyfriend, Annabelle is gay. Looks can be deceiving, however, and there's more to both than meets the eye. For one, Simone's relationship is not as secure as it appears. For another, Annabelle's ardor is so relentless it threatens to sway sympathy against her. She seems to have no regard for the damage an affair would inflict on her teacher's career. Nonetheless, Simone is not entirely resistant to her charms. Inspired by 1931's\", 'Mädchen in Uniform', \", writer/director Katherine Brooks preserves the forbidden relationship at the heart of the Weimar-era classic, but drops the political subtext. Consequently, she doesn't take on more than she can handle, but\", 'Loving Annabelle', 'still feels a little slight.', '--Kathleen C. Fennessy', 'Review', 'Absolute visual treat... engrossing from beginning to end... viewers will be riveted. DVD Talk Guilty pleasure. Dennis Harvey, Variety Lively, thought-provoking, compelling, slickly produced. Curve --wolfe', 'See more']\n{'Genre': 'Gay & Lesbian', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Wendy Schaal, Erin Kelly (III), Steve Sabo, Josh Silberman, Kari Lane, Jennie Floyd, Michelle Horn, Katherine Brooks, Jake Newton, Karen Teliha, Ilene Graff, Diane Gaidry, Greg Joelson, John Farley, Stephen Rue, Gustine Fudickar, Marla Maples, Leslie Andrews (II), Kevin McCarthy, Laura Breckenridge, Markus FlanaganWendy Schaal, Erin Kelly (III), Steve Sabo, Josh Silberman, Kari Lane, Jennie Floyd, Michelle Horn, Katherine Brooks, Jake Newton, Karen Teliha, Ilene Graff, Diane Gaidry, Greg Joelson, John Farley, Stephen Rue, Gustine Fudickar, Marla Maples, Leslie Andrews (II), Kevin McCart…  See more', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 16 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '4315', 'Director': 'Katherine Brooks', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 16 minutes', 'Release date': 'December 12, 2006', 'Actors': 'Diane Gaidry, Erin Kelly (III), Laura Breckenridge, Jennie Floyd, Greg Joelson', 'Studio': 'Wolfe Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe acting is terrific but the ending left many questions unanswered. Not unlike the movie it is based upon \"Maedchen in Uniform.\"\nLoving Annabelle\nAnother Way [DVD]\nJadwiga Jankowska-Cieslak  (Actor),     Ildik Bnsgi  (Actor),     Jnos Xantus  (Director),     Kroly Makk  (Director, Writer)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"An army officer's wife and a lesbian journalist fall in love in the aftermath of the failed 1956 Hungarian uprising.\"]\n{'Genre': 'International', 'Format': 'DVD, Subtitled, Widescreen, NTSC, Color', 'Contributor': 'Gyula Szab, Anette Antal, Jadwiga Jankowska-Cieslak, Judit Herndi, Zoltn Benkczy, Grazyna Szapolowska, Pter Andorai, Gyrgyi Fy, Ildik Bnsgi, Va Ig, Kroly Makk, Jozef Krner, Ferenc Bcs, Erzsbet Galgczi, Jnos XantusGyula Szab, Anette Antal, Jadwiga Jankowska-Cieslak, Judit Herndi, Zoltn Benkczy, Grazyna Szapolowska, Pter Andorai, Gyrgyi Fy, Ildik Bnsgi, Va Ig, Kroly Makk, Jozef Krner, Ferenc Bcs, Erzsbet Galgczi, Jnos Xantus  See more', 'Language': 'Hungarian', 'Runtime': '1 hour and 42 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Jnos Xantus, Kroly Makk', 'Media Format': 'DVD, Subtitled, Widescreen, NTSC, Color', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 26, 2006', 'Actors': 'Jadwiga Jankowska-Cieslak, Ildik Bnsgi, Grazyna Szapolowska, Judit Herndi, Jozef Krner', 'Subtitles': 'English', 'Studio': 'Bunyik Entertainment', 'Writers': 'Erzsbet Galgczi, Kroly Makk', 'Number of discs': '1'}\nUnder the influence of communism the view of homosexuality is very contrary to the western view shared today. There are still countries that treat homosexuality as depicted in this film, a definite must for the person interested in historical persepectives on the subject.<br />Wonderfully acted and cinematography.\ngood historical perspective\nBeautiful Creatures (DVD)\nAlden Ehrenreich  (Actor),     Alice Englert  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Beautiful Creatures (DVD)', 'Based on the New York Times best-selling young adult novel, this hauntingly intense coming-of-age story about two teenage star-crossed lovers in a small South Carolina town who uncover dark secrets about their families, their history and their town has been adapted and directed by Oscar®-nominated filmmaker Richard LaGravenese (The Fisher King). Oscar® winners Emma Thompson (Harry Potter films) and Jeremy Irons (The Mission), Oscar® nominee Viola Davis (The Help), Golden Globe nominee Emmy Rossum (Shameless) and more play the cursed denizens of the small-town in this supernatural love story.', ']]>', 'Amazon.com', 'Beautiful Creatures', 'flies into the otherworldly romantic sphere occupied by the', 'Twilight', 'films,', 'Buffy', ',', 'The Vampire Diaries', ',', 'True Blood', '--even', 'Charmed', '. Based on the best-selling young adult book by Kami Garcia, the film adaptation of', 'Beautiful Creatures', \"tells a romantic tale between two young people with mysterious, dark backgrounds--and more than one secret. The young stars, Alice Englert as Lena and Alden Ehrenreich as Ethan, to whom she's mysteriously drawn, have a sweet, believable chemistry. And because it's directed by pro Richard LaGravenese (the underrated but fabulous\", 'Living Out Loud', ',', 'P.S. I Love You', '),', 'Beautiful Creatures', \"is blessed with high production values; a quick, satisfying pace; and a supporting cast to die for (maybe literally). Emma Thompson, Viola Davis, Emmy Rossum, and Jeremy Irons, especially, seem to be enjoying themselves immensely as titular grownups in a teenage love story. This cast--and Lena's unexpected but badass supernatural power--all help add up to a delicious guilty pleasure.\", 'Beautiful Creatures', 'shines with much more polish than some of the', 'Twilight', 'films, but carries just as much dramatic yearning. As well it should. --', 'A.T. Hurley']\n{'Genre': 'Drama, Drama/Love & Romance', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Ultraviolet', 'Contributor': 'Emmy Rossum, Andrew A. Kosove, Emma Thompson, Molly Mickler Smith, Alice Englert, Erwin Stoff, Jeremy Irons, Richard LaGravenese, Broderick Johnson, Yolanda T. Cochran, Margaret Stohl, Viola Davis, David Valdes, Alden Ehrenreich, Thomas Mann, Kami GarciaEmmy Rossum, Andrew A. Kosove, Emma Thompson, Molly Mickler Smith, Alice Englert, Erwin Stoff, Jeremy Irons, Richard LaGravenese, Broderick Johnson, Yolanda T. Cochran, Margaret Stohl, Viola Davis, David Valdes, Alden Ehrenreich, Thomas Mann, Kami Garcia   See more', 'Language': 'English', 'Studio': 'WarnerBrothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000336965DVD', 'Director': 'Richard LaGravenese', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Ultraviolet', 'Release date': 'May 21, 2013', 'Actors': 'Alden Ehrenreich, Alice Englert, Jeremy Irons, Viola Davis, Emmy Rossum', 'Producers': 'Erwin Stoff, Yolanda T. Cochran, Andrew A. Kosove, Broderick Johnson, Molly Mickler Smith', 'Writers': 'Richard LaGravenese', 'Number of discs': '1'}\nThe premise is good and the special effects are wonderful. Not a scary or great movie but worth a bowl of popcorn and watching.\nIt is entertaining\nApril's Shower\nMaria Cina  (Actor),     Trish Doolan  (Actor, Director, Writer)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['A COMEDY ABOUT LOVE, ROMANCE & EXPECTATION THAT DEMANDS YOU TO ASK HOW FAR YOU WOULD GO FOR TRUE LOVE & IF YOU HAVE THE STRENGTH TO LIVE IN YOUR TRUTH.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Director': 'Trish Doolan', 'Media Format': 'Multiple Formats, Color, Closed-captioned, Dolby, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 23, 2006', 'Actors': 'Maria Cina, Trish Doolan, Randall Batinkoff, Denise Miller, Joe Tabb', 'Language': 'Unqualified', 'Studio': 'Liberation Ent', 'Writers': 'Trish Doolan', 'Number of discs': '1'}\nIt was fun to watch. A feel good comedy because hopefully your life isn't like the one in the movie. The movies would be a good date movie to curl up on the couch and watch with a friend and have some laughs.\nGood comedy\nThree Veils\nSheetal Sheth  (Actor),     Angela Zahra  (Actor),     Rolla Selbak  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Winner of 10 international awards, Three Veils is a poignant and daring film about three young Middle-Eastern women living in the U.S, each with her own personal story. Leila, taken by fantasies of the perfect lover, agrees to an arranged marriage that goes terribly wrong. Amira, a devout Muslim, finds herself in a desperate battle between her faith and her repressed feelings towards women. And, Nikki, a troubled soul who spirals downward on a self-destructive path when her dark and painful past finally catches up to her. As the three stories tenderly unfold, the lives of these three women intertwine while they each struggle to defy tradition and create their own realities.', 'Review', \"Heartily Recommended... The performances are fantastic of course, Sheetal Sheth is amazing and beautiful and Angela Zahra is phenomenal... It's one of the most bold and daring films out there. --AfterEllen.comThree Veils has great production values and a beautiful cast. It is unusual to see a film completely set in the Arab-American community, so it is worth taking a closer look underneath these women's metaphoric veils. --Echo MagazineRolla Selbak, director of Three Veils, paints a rare portrait about life in America for three women with Middle Eastern roots in the Muslim world. --San Diego Gay & Lesbian News\"]\n{'Format': 'Multiple Formats, NTSC, Widescreen, Dolby, Surround Sound', 'Contributor': 'Madline Tabar, Sheetal Sheth, Angela Zahra, Eric Avari, Rolla Selbak, Mercedes Masöhn', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Rolla Selbak', 'Media Format': 'Multiple Formats, NTSC, Widescreen, Dolby, Surround Sound', 'Run time': '1 hour and 57 minutes', 'Release date': 'August 10, 2012', 'Actors': 'Sheetal Sheth, Angela Zahra, Mercedes Masöhn, Madline Tabar, Eric Avari', 'Studio': 'Zahra Pictures', 'Number of discs': '1'}\nSome will not like the culture education but it really shows the differences and similarity in how it all comes down to being human. No matter what your ethnicity, size, sexuality, or religion, we all crave acceptance. Without acceptance the pain is often numbing and paralyzing to the one considered the outsider. These actors portray this very well and you feel their pain. I recommend watching this and opening your heart and mind.\nI liked it\nOrange Is The New Black: Season 1 [DVD]\nTaylor Schilling  (Actor),     Jason Biggs  (Actor),     Michael Trim  (Director),     Uta Briesewitz  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Golden Globe Central, Golden Globe Nominees\n[\"From the creator of WEEDS comes a heartbreaking and hilarious new series set in a women's prison. Based on Piper Kerman's acclaimed memoir, Orange Is the New Black follows engaged Brooklynite Piper Chapman, whose wild past comes back to haunt her and results in her arrest and detention in a federal penitentiary. To pay her debt to society, Piper trades her comfortable New York life for an orange prison jumpsuit and finds unexpected conflict and camaraderie amidst an eccentric group of inmates.\"]\n{'Genre': 'Drama/Television, Television', 'Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, UltravioletMultiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, Ultraviolet   See more', 'Contributor': 'Kate Mulgrew, Uzo Aduba, Pablo Schreiber, Laverne Cox, Yael Stone, Natasha Lyonne, Andrew McCarthy, Danielle Brooks, Samira Wiley, Phil Abraham, Constantine Makris, Jason Biggs, Taylor Schilling, Uta Briesewitz, Jodie Foster, Matt Penn, Elizabeth Rodriguez, Michael Trim, Selenis Leyva, Taryn Manning, Matt McGorry, Laura Prepon, Dascha PolancoKate Mulgrew, Uzo Aduba, Pablo Schreiber, Laverne Cox, Yael Stone, Natasha Lyonne, Andrew McCarthy, Danielle Brooks, Samira Wiley, Phil Abraham, Constantine Makris, Jason Biggs, Taylor Schilling, Uta Briesewitz, Jodie Foster, Matt Penn, Elizabeth Rodriguez, Micha…   See more', 'Language': 'English', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '1775', 'Director': 'Michael Trim, Uta Briesewitz, Jodie Foster, Andrew McCarthy, Matt Penn', 'Media Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, Ultraviolet', 'Run time': '12 hours and 10 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Taylor Schilling, Jason Biggs, Laura Prepon, Kate Mulgrew, Danielle Brooks', 'Subtitles': 'English, French, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '4'}\nI didn't think I would like this series but it is very captivating. I sat and watched the season in two days. The writing and acting are above par. The intimacy of the background stories make the characters whole. Most of us could see ourselves or people we know in the same situations that these women and we wonder how we would cope being locked up in prison.\nA Must See Series\nReaching for the Moon\nGlória Pires  (Actor),     Miranda Otto  (Actor),     Bruno Barreto  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', \"This sumptuous English-language '50s period piece recounts the years of Pulitzer Prize-winning poet Elizabeth Bishop (Miranda Otto, Lord of the Rings) when she left America to live and write in Rio de Janiero - where she would fall in love with well-off architect Lota de Macedo Soares (beautifully handsome Brazilian star Glória Pires).\", 'Review', 'Gorgeously shot against the lush postcard backdrops of 50s and 60s South America. --Entertainment WeeklyImagines Elizabeth Bishop s extraordinary relationship with the Brazilian architect Lota de Macedo Soares... a battle of creative and romantic egos. --New York Times', 'About the Director', 'BRUNO BARRETO (Director) Biography Born in1955 in Rio de Janeiro, Bruno Barreto has directed to date 18 feature films. His first was \"Tati\" in 1972, at the age of 17, followed by A Estrela Sobe (The Rising Star) and Dona Flor and Her Two Husbands, the biggest box office hit in Brazil until 2011, with more than 12 million tickets sold, and a Golden Globe Nomination for Best Foreign Language Film. Among other notable films are: Four Days in September nominated for an Oscar for Best Foreign Film in 1998, Bossa Nova (with Amy Irving and Antonio Fagundes), a valentine for the city of Rio de Janeiro where he was born, and Romeo and Juliet Get Married which won several best film (audience award) in many international festivals. Since 1990, Bruno Barreto has divided his career between Brazil and the United States, where he made six feature films with major stars such as Robert Duvall, Andy Garcia, Kevin Spacey and Amy Irving in A Show of Force, Dennis Hopper and Amy Irving in Carried Away, Gwyneth Paltrow and Mike Myers in View from the Top. In 2005 Bruno Barreto returned to Brazil and based himself in São Paulo, where he made Romeo and Juliet Get Marred and Money on the Side. In 2007, BrLIMITED THEATRICAL: NEW YORK, LOS ANGELES, ENCINO, PASADENA, WEST HOLLYWOOD, SAN FRANCISCO, SAN DIEGO uno directed Last Stop 174, which premiered at the 2008 Toronto International Film Festival to rave reviews and sold out screenings. Bruno has recently finished Reaching for the Moon, starring Miranda Otto and Glória Pires which tells the story of Elizabeth Bishop, one of the greatest poets of the English language, and her long relationship with the Brazilian architect Lota de Macedo Soares.', 'See more']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': '28935790', 'Director': 'Bruno Barreto', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Full Screen, Surround Sound', 'Run time': '1 hour and 58 minutes', 'Release date': 'February 4, 2014', 'Actors': 'Glória Pires, Miranda Otto, Tracy Middendorf', 'Studio': 'Wolfe Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nHow can the strong be broken and the broken so strong? This love story is monumental. It changes the way one thinks of strong. Elizabeth seems like such the lost soul and Lota helps her recover but when Lota falls does Elizabeth abandon her or just moves out of her way. You must make that decision for yourself. A riveting story and played wonderfully on the screen. I recommend watching this one.\nA Love to Relish and Remember.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Bound [DVD]\nReview Date: 2007/05/25\nStore: Jennifer Tilly  (Actor),     Gina Gershon  (Actor),     Andy Wachowski  (Director, Writer),     Lana Wachowski  (Director, Writer)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, Lionsgate Indie Selects\nAverage Rating: 4.6\nProduct Details: {'Format': 'Closed-captioned, Color, DVD, NTSC, Widescreen, Letterboxed', 'Contributor': 'John P. Ryan, Mary Mara, Andy Wachowski, Susie Bright, Barry Kivel, Lana Wachowski, Ivan Kane, Joe Pantoliano, Richard C. Sarafian, Gina Gershon, Christopher Meloni, Margaret Smith, Jennifer Tilly, Peter SpellosJohn P. Ryan, Mary Mara, Andy Wachowski, Susie Bright, Barry Kivel, Lana Wachowski, Ivan Kane, Joe Pantoliano, Richard C. Sarafian, Gina Gershon, Christopher Meloni, Margaret Smith, Jennifer Tilly, Peter Spellos   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Director': 'Andy Wachowski, Lana Wachowski', 'Media Format': 'Closed-captioned, Color, DVD, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 14, 2001', 'Actors': 'Jennifer Tilly, Gina Gershon, Joe Pantoliano, John P. Ryan, Christopher Meloni', 'Subtitles': 'Spanish', 'Studio': 'Republic Pictures', 'Writers': 'Andy Wachowski, Lana Wachowski', 'Number of discs': '1'}\nReview Text: A great suspense movie with a lesbian main characters. This is not often seen in the many of the lesbian films. The roles are well portrayed by the actors and a great lesbian sex scene.\nReview Title: Bound\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: D.E.B.S. (Special Edition)\nReview Date: 2007/05/25\nStore: Sarah Foster  (Actor),     Jordana Brewster  (Actor),     Angela Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Sultry crime boss Lucy Diamond (Jordana Brewster, The Fast and the Furious) is back in the states and the D.E.B.S.- an elite team of paramilitary college co-ed superspies- are hot on her trail. But when their top agent, gorgeous Amy Bradshaw (Sara Foster, The Big Bounce), mysteriously disappears after coming face to face with the attractive young villainess, the D.E.B.S. begin a full-scale search for Lucy's secret lair, never suspecting that Amy may not want to be rescued after all, in this smart and sexy spy spoof about love at first gun sight.\", 'Amazon.com', 'You can say this about', 'D.E.B.S.', ': director Angela Robinson\\x92s 2005 feature isn\\x92t very good, but it is surprisingly entertaining. The premise, which bears a passing resemblance to any number of previous films (from', 'Heathers', 'and', 'Clueless', 'to', 'Charlie\\x92s Angels', 'and the', 'Austin Powers', 'franchise), involves a secret government agency recruiting young women as spies, based on their smarts, their ability to lie convincingly, and the fact that they look fetching in ultra-miniskirts. Four of the D.E.B.S. are then charged with collaring \"criminal mastermind\" Lucy Diamond (Jordana Brewster), who has returned to the States after hatching all manner of nefarious plots overseas. Then comes the twist: Diamond is gay, and one of our heroines, Amy Bradshaw (Sara Foster), unexpectedly finds herself falling in love with her. Out goes the espionage element; in comes the love story, and therein lies the surprise, as this burgeoning lesbian relationship is handled with unexpected sympathy, even tenderness. Sure, the acting, even by veteran grownups like Holland Taylor and Michael Clarke Duncan, is almost uniformly lame, and the script is silly; overall, the film would have to put on considerable weight to even be considered frothy. Still,', 'D.E.B.S.', 'isn\\x92t a bad way to kill a couple of hours. DVD bonus features include a making-of featurette and commentary by Robinson and the cast.', '--Sam Graham']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Jasmine Kosovic, Sarah Foster, Devon Aoki, Holland Taylor, Geoff Stults, Angela Robinson, Meagan Good, Jordana Brewster, Jill Ritchie, Michael Clarke Duncan, Anonymous Content, Jimmi Simpson, Andrea SperlingJasmine Kosovic, Sarah Foster, Devon Aoki, Holland Taylor, Geoff Stults, Angela Robinson, Meagan Good, Jordana Brewster, Jill Ritchie, Michael Clarke Duncan, Anonymous Content, Jimmi Simpson, Andrea Sperling   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.35:1, 1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Angela Robinson', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'June 7, 2005', 'Actors': 'Sarah Foster, Jordana Brewster, Meagan Good, Devon Aoki, Jill Ritchie', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Jasmine Kosovic, Andrea Sperling', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: A great movie to have fun with. The best satorical comment on lesbian coming out and dating. A film that can make anyone laugh at that first chance meeting. One that can be watched more than once and still laugh.\nReview Title: D.E.B.S.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Loving Annabelle\nReview Date: 2007/05/25\nStore: Diane Gaidry  (Actor),     Erin Kelly (III)  (Actor),     Katherine Brooks  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: ['Product Description', \"Rising star Erin Kelly (Waking Madison) is Annabelle, a precocious Senator's daughter who falls for her Catholic school teacher, Simone (Diane Gaidry, the Dogwalker). After Simone is assigned to control the rebellious student, she instead finds herself drawn into Annabelle's world. As their attraction builds, the two women must cope with the reactions of those around them. Writer-Director Katherine Brooks unveils this smoldering tale of forbidden love with intelligence, wit and sensitivity.\", 'Amazon.com', 'A lot of taboos are broken in', 'Loving Annabelle', ', even if the film itself remains remarkably tasteful--even demure. The central characters are two women, a teacher and her student, and the setting is an all-girls school (shades of', 'Lost and Delirious', \"). Annabelle (the smoldering Erin Kelly), a senior, is a rebellious rocker chick--the Beverly Hills version that is, i.e. highlighted hair, black eyeliner, and nose ring. Her senatorial mother ships her off to boarding school to shape up. Annabelle's hard-partying ways are starting to become an embarrassment. Miss Simone Bradley (the sympathetic Diane Gaidry) is a popular poetry teacher. She's a Catholic. Annabelle is not. Simone has a boyfriend, Annabelle is gay. Looks can be deceiving, however, and there's more to both than meets the eye. For one, Simone's relationship is not as secure as it appears. For another, Annabelle's ardor is so relentless it threatens to sway sympathy against her. She seems to have no regard for the damage an affair would inflict on her teacher's career. Nonetheless, Simone is not entirely resistant to her charms. Inspired by 1931's\", 'Mädchen in Uniform', \", writer/director Katherine Brooks preserves the forbidden relationship at the heart of the Weimar-era classic, but drops the political subtext. Consequently, she doesn't take on more than she can handle, but\", 'Loving Annabelle', 'still feels a little slight.', '--Kathleen C. Fennessy', 'Review', 'Absolute visual treat... engrossing from beginning to end... viewers will be riveted. DVD Talk Guilty pleasure. Dennis Harvey, Variety Lively, thought-provoking, compelling, slickly produced. Curve --wolfe', 'See more']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Gay & Lesbian', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Wendy Schaal, Erin Kelly (III), Steve Sabo, Josh Silberman, Kari Lane, Jennie Floyd, Michelle Horn, Katherine Brooks, Jake Newton, Karen Teliha, Ilene Graff, Diane Gaidry, Greg Joelson, John Farley, Stephen Rue, Gustine Fudickar, Marla Maples, Leslie Andrews (II), Kevin McCarthy, Laura Breckenridge, Markus FlanaganWendy Schaal, Erin Kelly (III), Steve Sabo, Josh Silberman, Kari Lane, Jennie Floyd, Michelle Horn, Katherine Brooks, Jake Newton, Karen Teliha, Ilene Graff, Diane Gaidry, Greg Joelson, John Farley, Stephen Rue, Gustine Fudickar, Marla Maples, Leslie Andrews (II), Kevin McCart…  See more', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 16 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '4315', 'Director': 'Katherine Brooks', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 16 minutes', 'Release date': 'December 12, 2006', 'Actors': 'Diane Gaidry, Erin Kelly (III), Laura Breckenridge, Jennie Floyd, Greg Joelson', 'Studio': 'Wolfe Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The acting is terrific but the ending left many questions unanswered. Not unlike the movie it is based upon \"Maedchen in Uniform.\"\nReview Title: Loving Annabelle\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Another Way [DVD]\nReview Date: 2008/03/25\nStore: Jadwiga Jankowska-Cieslak  (Actor),     Ildik Bnsgi  (Actor),     Jnos Xantus  (Director),     Kroly Makk  (Director, Writer)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"An army officer's wife and a lesbian journalist fall in love in the aftermath of the failed 1956 Hungarian uprising.\"]\nAverage Rating: 3.7\nProduct Details: {'Genre': 'International', 'Format': 'DVD, Subtitled, Widescreen, NTSC, Color', 'Contributor': 'Gyula Szab, Anette Antal, Jadwiga Jankowska-Cieslak, Judit Herndi, Zoltn Benkczy, Grazyna Szapolowska, Pter Andorai, Gyrgyi Fy, Ildik Bnsgi, Va Ig, Kroly Makk, Jozef Krner, Ferenc Bcs, Erzsbet Galgczi, Jnos XantusGyula Szab, Anette Antal, Jadwiga Jankowska-Cieslak, Judit Herndi, Zoltn Benkczy, Grazyna Szapolowska, Pter Andorai, Gyrgyi Fy, Ildik Bnsgi, Va Ig, Kroly Makk, Jozef Krner, Ferenc Bcs, Erzsbet Galgczi, Jnos Xantus  See more', 'Language': 'Hungarian', 'Runtime': '1 hour and 42 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Jnos Xantus, Kroly Makk', 'Media Format': 'DVD, Subtitled, Widescreen, NTSC, Color', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 26, 2006', 'Actors': 'Jadwiga Jankowska-Cieslak, Ildik Bnsgi, Grazyna Szapolowska, Judit Herndi, Jozef Krner', 'Subtitles': 'English', 'Studio': 'Bunyik Entertainment', 'Writers': 'Erzsbet Galgczi, Kroly Makk', 'Number of discs': '1'}\nReview Text: Under the influence of communism the view of homosexuality is very contrary to the western view shared today. There are still countries that treat homosexuality as depicted in this film, a definite must for the person interested in historical persepectives on the subject.<br />Wonderfully acted and cinematography.\nReview Title: good historical perspective\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Beautiful Creatures (DVD)\nReview Date: 2013/10/26\nStore: Alden Ehrenreich  (Actor),     Alice Englert  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Beautiful Creatures (DVD)', 'Based on the New York Times best-selling young adult novel, this hauntingly intense coming-of-age story about two teenage star-crossed lovers in a small South Carolina town who uncover dark secrets about their families, their history and their town has been adapted and directed by Oscar®-nominated filmmaker Richard LaGravenese (The Fisher King). Oscar® winners Emma Thompson (Harry Potter films) and Jeremy Irons (The Mission), Oscar® nominee Viola Davis (The Help), Golden Globe nominee Emmy Rossum (Shameless) and more play the cursed denizens of the small-town in this supernatural love story.', ']]>', 'Amazon.com', 'Beautiful Creatures', 'flies into the otherworldly romantic sphere occupied by the', 'Twilight', 'films,', 'Buffy', ',', 'The Vampire Diaries', ',', 'True Blood', '--even', 'Charmed', '. Based on the best-selling young adult book by Kami Garcia, the film adaptation of', 'Beautiful Creatures', \"tells a romantic tale between two young people with mysterious, dark backgrounds--and more than one secret. The young stars, Alice Englert as Lena and Alden Ehrenreich as Ethan, to whom she's mysteriously drawn, have a sweet, believable chemistry. And because it's directed by pro Richard LaGravenese (the underrated but fabulous\", 'Living Out Loud', ',', 'P.S. I Love You', '),', 'Beautiful Creatures', \"is blessed with high production values; a quick, satisfying pace; and a supporting cast to die for (maybe literally). Emma Thompson, Viola Davis, Emmy Rossum, and Jeremy Irons, especially, seem to be enjoying themselves immensely as titular grownups in a teenage love story. This cast--and Lena's unexpected but badass supernatural power--all help add up to a delicious guilty pleasure.\", 'Beautiful Creatures', 'shines with much more polish than some of the', 'Twilight', 'films, but carries just as much dramatic yearning. As well it should. --', 'A.T. Hurley']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Drama/Love & Romance', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Ultraviolet', 'Contributor': 'Emmy Rossum, Andrew A. Kosove, Emma Thompson, Molly Mickler Smith, Alice Englert, Erwin Stoff, Jeremy Irons, Richard LaGravenese, Broderick Johnson, Yolanda T. Cochran, Margaret Stohl, Viola Davis, David Valdes, Alden Ehrenreich, Thomas Mann, Kami GarciaEmmy Rossum, Andrew A. Kosove, Emma Thompson, Molly Mickler Smith, Alice Englert, Erwin Stoff, Jeremy Irons, Richard LaGravenese, Broderick Johnson, Yolanda T. Cochran, Margaret Stohl, Viola Davis, David Valdes, Alden Ehrenreich, Thomas Mann, Kami Garcia   See more', 'Language': 'English', 'Studio': 'WarnerBrothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000336965DVD', 'Director': 'Richard LaGravenese', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Ultraviolet', 'Release date': 'May 21, 2013', 'Actors': 'Alden Ehrenreich, Alice Englert, Jeremy Irons, Viola Davis, Emmy Rossum', 'Producers': 'Erwin Stoff, Yolanda T. Cochran, Andrew A. Kosove, Broderick Johnson, Molly Mickler Smith', 'Writers': 'Richard LaGravenese', 'Number of discs': '1'}\nReview Text: The premise is good and the special effects are wonderful. Not a scary or great movie but worth a bowl of popcorn and watching.\nReview Title: It is entertaining\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: April's Shower\nReview Date: 2013/10/26\nStore: Maria Cina  (Actor),     Trish Doolan  (Actor, Director, Writer)    Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['A COMEDY ABOUT LOVE, ROMANCE & EXPECTATION THAT DEMANDS YOU TO ASK HOW FAR YOU WOULD GO FOR TRUE LOVE & IF YOU HAVE THE STRENGTH TO LIVE IN YOUR TRUTH.']\nAverage Rating: 3.8\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Director': 'Trish Doolan', 'Media Format': 'Multiple Formats, Color, Closed-captioned, Dolby, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 23, 2006', 'Actors': 'Maria Cina, Trish Doolan, Randall Batinkoff, Denise Miller, Joe Tabb', 'Language': 'Unqualified', 'Studio': 'Liberation Ent', 'Writers': 'Trish Doolan', 'Number of discs': '1'}\nReview Text: It was fun to watch. A feel good comedy because hopefully your life isn't like the one in the movie. The movies would be a good date movie to curl up on the couch and watch with a friend and have some laughs.\nReview Title: Good comedy\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Three Veils\nReview Date: 2013/10/26\nStore: Sheetal Sheth  (Actor),     Angela Zahra  (Actor),     Rolla Selbak  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Winner of 10 international awards, Three Veils is a poignant and daring film about three young Middle-Eastern women living in the U.S, each with her own personal story. Leila, taken by fantasies of the perfect lover, agrees to an arranged marriage that goes terribly wrong. Amira, a devout Muslim, finds herself in a desperate battle between her faith and her repressed feelings towards women. And, Nikki, a troubled soul who spirals downward on a self-destructive path when her dark and painful past finally catches up to her. As the three stories tenderly unfold, the lives of these three women intertwine while they each struggle to defy tradition and create their own realities.', 'Review', \"Heartily Recommended... The performances are fantastic of course, Sheetal Sheth is amazing and beautiful and Angela Zahra is phenomenal... It's one of the most bold and daring films out there. --AfterEllen.comThree Veils has great production values and a beautiful cast. It is unusual to see a film completely set in the Arab-American community, so it is worth taking a closer look underneath these women's metaphoric veils. --Echo MagazineRolla Selbak, director of Three Veils, paints a rare portrait about life in America for three women with Middle Eastern roots in the Muslim world. --San Diego Gay & Lesbian News\"]\nAverage Rating: 3.8\nProduct Details: {'Format': 'Multiple Formats, NTSC, Widescreen, Dolby, Surround Sound', 'Contributor': 'Madline Tabar, Sheetal Sheth, Angela Zahra, Eric Avari, Rolla Selbak, Mercedes Masöhn', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Rolla Selbak', 'Media Format': 'Multiple Formats, NTSC, Widescreen, Dolby, Surround Sound', 'Run time': '1 hour and 57 minutes', 'Release date': 'August 10, 2012', 'Actors': 'Sheetal Sheth, Angela Zahra, Mercedes Masöhn, Madline Tabar, Eric Avari', 'Studio': 'Zahra Pictures', 'Number of discs': '1'}\nReview Text: Some will not like the culture education but it really shows the differences and similarity in how it all comes down to being human. No matter what your ethnicity, size, sexuality, or religion, we all crave acceptance. Without acceptance the pain is often numbing and paralyzing to the one considered the outsider. These actors portray this very well and you feel their pain. I recommend watching this and opening your heart and mind.\nReview Title: I liked it\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Orange Is The New Black: Season 1 [DVD]\nReview Date: 2014/07/21\nStore: Taylor Schilling  (Actor),     Jason Biggs  (Actor),     Michael Trim  (Director),     Uta Briesewitz  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Award Winners in Movies & TV, Golden Globe Central, Golden Globe Nominees\nProduct Description: [\"From the creator of WEEDS comes a heartbreaking and hilarious new series set in a women's prison. Based on Piper Kerman's acclaimed memoir, Orange Is the New Black follows engaged Brooklynite Piper Chapman, whose wild past comes back to haunt her and results in her arrest and detention in a federal penitentiary. To pay her debt to society, Piper trades her comfortable New York life for an orange prison jumpsuit and finds unexpected conflict and camaraderie amidst an eccentric group of inmates.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, UltravioletMultiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, Ultraviolet   See more', 'Contributor': 'Kate Mulgrew, Uzo Aduba, Pablo Schreiber, Laverne Cox, Yael Stone, Natasha Lyonne, Andrew McCarthy, Danielle Brooks, Samira Wiley, Phil Abraham, Constantine Makris, Jason Biggs, Taylor Schilling, Uta Briesewitz, Jodie Foster, Matt Penn, Elizabeth Rodriguez, Michael Trim, Selenis Leyva, Taryn Manning, Matt McGorry, Laura Prepon, Dascha PolancoKate Mulgrew, Uzo Aduba, Pablo Schreiber, Laverne Cox, Yael Stone, Natasha Lyonne, Andrew McCarthy, Danielle Brooks, Samira Wiley, Phil Abraham, Constantine Makris, Jason Biggs, Taylor Schilling, Uta Briesewitz, Jodie Foster, Matt Penn, Elizabeth Rodriguez, Micha…   See more', 'Language': 'English', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '1775', 'Director': 'Michael Trim, Uta Briesewitz, Jodie Foster, Andrew McCarthy, Matt Penn', 'Media Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Widescreen, Digital_copy, Ultraviolet', 'Run time': '12 hours and 10 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Taylor Schilling, Jason Biggs, Laura Prepon, Kate Mulgrew, Danielle Brooks', 'Subtitles': 'English, French, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '4'}\nReview Text: I didn't think I would like this series but it is very captivating. I sat and watched the season in two days. The writing and acting are above par. The intimacy of the background stories make the characters whole. Most of us could see ourselves or people we know in the same situations that these women and we wonder how we would cope being locked up in prison.\nReview Title: A Must See Series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Reaching for the Moon\nReview Date: 2014/07/21\nStore: Glória Pires  (Actor),     Miranda Otto  (Actor),     Bruno Barreto  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', \"This sumptuous English-language '50s period piece recounts the years of Pulitzer Prize-winning poet Elizabeth Bishop (Miranda Otto, Lord of the Rings) when she left America to live and write in Rio de Janiero - where she would fall in love with well-off architect Lota de Macedo Soares (beautifully handsome Brazilian star Glória Pires).\", 'Review', 'Gorgeously shot against the lush postcard backdrops of 50s and 60s South America. --Entertainment WeeklyImagines Elizabeth Bishop s extraordinary relationship with the Brazilian architect Lota de Macedo Soares... a battle of creative and romantic egos. --New York Times', 'About the Director', 'BRUNO BARRETO (Director) Biography Born in1955 in Rio de Janeiro, Bruno Barreto has directed to date 18 feature films. His first was \"Tati\" in 1972, at the age of 17, followed by A Estrela Sobe (The Rising Star) and Dona Flor and Her Two Husbands, the biggest box office hit in Brazil until 2011, with more than 12 million tickets sold, and a Golden Globe Nomination for Best Foreign Language Film. Among other notable films are: Four Days in September nominated for an Oscar for Best Foreign Film in 1998, Bossa Nova (with Amy Irving and Antonio Fagundes), a valentine for the city of Rio de Janeiro where he was born, and Romeo and Juliet Get Married which won several best film (audience award) in many international festivals. Since 1990, Bruno Barreto has divided his career between Brazil and the United States, where he made six feature films with major stars such as Robert Duvall, Andy Garcia, Kevin Spacey and Amy Irving in A Show of Force, Dennis Hopper and Amy Irving in Carried Away, Gwyneth Paltrow and Mike Myers in View from the Top. In 2005 Bruno Barreto returned to Brazil and based himself in São Paulo, where he made Romeo and Juliet Get Marred and Money on the Side. In 2007, BrLIMITED THEATRICAL: NEW YORK, LOS ANGELES, ENCINO, PASADENA, WEST HOLLYWOOD, SAN FRANCISCO, SAN DIEGO uno directed Last Stop 174, which premiered at the 2008 Toronto International Film Festival to rave reviews and sold out screenings. Bruno has recently finished Reaching for the Moon, starring Miranda Otto and Glória Pires which tells the story of Elizabeth Bishop, one of the greatest poets of the English language, and her long relationship with the Brazilian architect Lota de Macedo Soares.', 'See more']\nAverage Rating: 4.3\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': '28935790', 'Director': 'Bruno Barreto', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Full Screen, Surround Sound', 'Run time': '1 hour and 58 minutes', 'Release date': 'February 4, 2014', 'Actors': 'Glória Pires, Miranda Otto, Tracy Middendorf', 'Studio': 'Wolfe Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: How can the strong be broken and the broken so strong? This love story is monumental. It changes the way one thinks of strong. Elizabeth seems like such the lost soul and Lota helps her recover but when Lota falls does Elizabeth abandon her or just moves out of her way. You must make that decision for yourself. A riveting story and played wonderfully on the screen. I recommend watching this one.\nReview Title: A Love to Relish and Remember.\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual's purchase history reveals a strong preference for films centering on LGBTQ+ themes, particularly those featuring female relationships. The consistently high ratings (averaging around 4.5) across products indicate a reliable enjoyment of well-acted and thoughtfully written narratives. Key sentiments highlight appreciation for films that portray lesbian characters and relationships positively, often emphasizing themes of love, romance, and societal challenges.\n\nCommon use cases for these purchases illustrate a tendency toward seeking escapism and entertainment through comedy and drama, particularly in stories that blend romance with elements of action or suspense. The recurring quality expectation suggests the buyer prioritizes films with strong acting and engaging plots, often opting for independent or lesser-known titles that feature character-driven stories.\n\nPrice sensitivity appears minimal, as evidenced by consistent purchases of DVDs that likely range across various price points, indicating a willingness to invest in quality films. However, a few entries suggest a desire for value, looking for compelling narratives that ensure repeat viewing potential.\n\nOverall, the core preferences highlight a passion for emotional and nuanced storytelling within LGBTQ+ contexts, reinforced by an appreciation for humor, quality production, and compelling performances. These patterns indicate a loyal patron motivated by diverse, engaging narratives that reflect both personal and broader societal themes.",
  "target_interaction": {
    "rating": 4.0,
    "title": "I recommend this to all that like to walk away from a movie saying what if!!!!!!!!!!",
    "text": "Wow, can one get that bored with life? Is it alright if your partner does not seem to care? Is it just sex? All these questions are topics for this movie. I liked it. This was done with great acting and taste. The emotions seem raw and real. If you want a great drama and are not afraid of the lesbian content then this is for you.",
    "images": [],
    "asin": "B00FKPJ3VM",
    "parent_asin": "B00FKPJ3VM",
    "user_id": "AFWAHIDJIOIPKYXMVEESGKAIXN3A",
    "timestamp": "2014-07-21 21:52:25",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Concussion",
    "average_rating": 3.8,
    "rating_number": 1242,
    "features": [],
    "description": [
      "Robin Weigert – best known as Calamity Jane on",
      "Deadwood",
      "– stars as Abby, a suburban wife and mother married to her overachieving partner Kate (Julie Fain Lawrence). But soon after Abby is hit in the head in a playground accident, she will shed her boring soccer-mom life to become a high-priced call girl for women. And when her worlds collide, the lines between love and desire may experience the most unexpected traumas of all. Maggie Siff (",
      "Sons Of Anarchy",
      "), Janel Moloney (",
      "The West Wing",
      "), Ben Shenkman (",
      "Royal Pains",
      ") and Emily Kinney (",
      "The Walking Dead",
      ") co-star in this provocative and acclaimed debut feature from writer/director Stacie Passon."
    ],
    "price": null,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51Gifzj4C0L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Gifzj4C0L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81kIjHAAt6L._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Robin Weigert  (Actor),     Maggie Siff  (Actor),     Stacie Passon  (Director)    &                   0                  more   Rated:    R    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Drama"
    ],
    "details": {
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.72 Ounces",
      "Item model number": "28928267",
      "Director": "Stacie Passon",
      "Media Format": "Multiple Formats, Color, NTSC, Widescreen",
      "Run time": "1 hour and 36 minutes",
      "Release date": "January 28, 2014",
      "Actors": "Robin Weigert, Maggie Siff, Jonathan Tchaikovsky, Ben Shenkman, Julie Fain Lawrence",
      "Producers": "Anthony Cupo, Cliff Chenfeld, Rose Troche",
      "Studio": "Lionsgate Home Entertainment",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}