{
  "user_id": "AHGONLBPMXIJRW3JUB6HO4UVPP6Q",
  "summary": "=== Purchase Information ===\nProduct Title: Peter's Friends [DVD]\nReview Date: 2014/07/20\nStore: Rita Rudner  (Actor),     Stephen Fry  (Actor),     Kenneth Branagh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'R', 'Release Date:', '12-FEB-2008', 'Media Type:', 'DVD', 'Amazon.com', 'What if you could go back to your glory days?', \"Peter's Friends\", ', sort of', 'The Big Chill', 'reconceived as an Agatha Christie country-estate drama, lets a group of university pals ponder that question while they must deal with their present-day demons. Kenneth Branagh\\'s film, written by costar Rita Rudner and Martin Bergman, is buoyed by its vast and talented cast, whose chemistry keeps the action crackling, even when most of the action is the characters speaking. The friends are reunited at Peter\\'s posh country home after the death of his father, for one last New Year\\'s Eve. The bons mots fly, and the interaction of the actors is, as the Brits say, brilliant. Peter (played by the sublime Stephen Fry): \"It\\'s funny, with both my parents gone, I suddenly have this overwhelming urge to act maturely.\" Andrew (Branagh): \"Oh, well, I don\\'t think anybody really matures. Adults are just children who owe money.\" Yet buried among the one-liners and drawing-room manners are disappointment, heartbreak, and a heavy secret (which, many years after the film\\'s original 1992 release, doesn\\'t pack the same wallop). Emma Thompson shows nuance and delight as Maggie while Hugh Laurie shows his dramatic capabilities. Other winning performances are given by Imelda Staunton and Tony Slattery. The setting is an absolute stunner, and viewers will wish they could spend a holiday at the manor. And the soundtrack will transport them to a sweeter time in the early \\'80s, when \"Everybody Wants to Rule the World.\" Cozy up for a delightfully unexpected evening with these', 'Friends', '. --', 'A.T. Hurley']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, Dubbed, DVD, Subtitled, Widescreen, Closed-captioned, NTSC', 'Contributor': 'Tony Slattery, Jacques Offenbach, Emma Thompson, Imelda Staunton, Kenneth Branagh, Hugh Laurie, Stephen Fry, Phyllida Law, Alphonsia Emmanuel, Rita RudnerTony Slattery, Jacques Offenbach, Emma Thompson, Imelda Staunton, Kenneth Branagh, Hugh Laurie, Stephen Fry, Phyllida Law, Alphonsia Emmanuel, Rita Rudner  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 41 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.5 inches; 2.4 Ounces', 'Director': 'Kenneth Branagh', 'Media Format': 'Color, Dubbed, DVD, Subtitled, Widescreen, Closed-captioned, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Rita Rudner, Stephen Fry, Hugh Laurie, Emma Thompson, Tony Slattery', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nReview Text: Great old movie I love!!!<br />My husband and I were lucky enough to see Hugh Laurie play with the Copper Bottom Band (which I highly recommend if you love old New Orleans blues/jazz and want to hear songs you might not know) my husband and I were talking before the band hit the stage about this movie and I just had to get a copy and show it to my husband who hadn't seen it before. He loved it!! It's very much like The Big Chill and has a WONDERFUL soundtrack!\nReview Title: Love this movie!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Victor/Victoria\nReview Date: 2015/02/16\nStore: Julie Andrews  (Actor),     James Garner  (Actor),     Blake Edwards  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"A man impersonating a woman on stage? Piece of cake. But a woman whose livelihood depends on pretending to be a man who pretends to be a woman? Now you've got problems! You've also got laughs when Julie Andrews plays Victor and Victoria in this clever delight, from filmmaker Blake Edwards, boasting a marvelous Academy Award -winning* score by Henry Mancini and Leslie Bricusse. Robert Preston plays a cabaret performer who devises the gender-bender stage act. Farcically complicating matters are James Garner as a mobster suspecting Victor is a Victoria and Lesley Ann Warren as a short-fused floozy. Of this movie's seven Oscar nominations*, three went to Golden Globe Winner Andrews (Actress), National Board of Review Award winner Preston (Supporting Actor) and Warren (Supporting Actress).\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Musicals & Performing Arts/Musicals/General', 'Format': 'NTSC', 'Contributor': 'Julie Andrews, Alex Karras, James Garner, Robert Preston, Lesley Ann Warren, Blake Edwards', 'Language': 'English', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '297790', 'Director': 'Blake Edwards', 'Media Format': 'NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'May 17, 2012', 'Actors': 'Julie Andrews, James Garner, Robert Preston, Lesley Ann Warren, Alex Karras', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: haven't seen this since I was a kid! I have to cut all my hair off due to thinning and this was the first thing I thought of. so I had to buy it. it totally holds up and if you think about the time it came out and the fact that we are talking about Julie Andrews it is a shockingly wonderful film that really was groundbreaking in fight for gay acceptance. I can't say enough good stuff about this film and it was wonderful seeing it so beautifully hold up!!\nReview Title: a movie I've always loved looking gorgeous!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The New Statesman\nReview Date: 2015/02/16\nStore: Mayall, Rik  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: [\"The hilarious Rik Mayall (The Young Ones, Bottom) stars as the cunning politician Alan B'Stard in this outrageously satirical British TV series. In his ruthless pursuit of power and money, there are no depths to which B'Stard will not happily sink, no plot too dastardly. With the help of his equally deceitful wife and his wimpy assistant, B'Stard schemes his way through his career. You'll be gasping with laughter through all 26 irresistible episodes of this award-winning series, plus the feature-length special, Who Shot Alan B'Stard? EPISODES: Happiness Is a Warm Gun - Passport to Freedom - Sex Is Wrong - Waste Not, Want Not - Friends of St. James - Three Line Whipping - Baa Baa Black Sheep - Labour of Love - The Party's Over - Let Them Sniff Cake - Keeping Mum - Natural Selection - Profit of Boom - Fatal Extraction - Live from Westminster - A Wapping Conspiracy - The Haltemprice Bunker - California Here I Come - May the Best Man Win - Piers of the Realm - Back from the Mort - H*A*S*H - Speaking in Tongues - Heil and Farewell - A Bigger Splash - The Irresistible Rise of Alan B'Stard\"]\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 12.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '10 hours and 40 minutes', 'Release date': 'June 26, 2007', 'Actors': 'Mayall, Rik', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Image Entertainment', 'Number of discs': '4'}\nReview Text: great and weird!!! what can I say...just happy to have this!!!!!\nReview Title: Rik and his meanest....so funny!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Assume the Position with Mr. Wuhl [DVD]\nReview Date: 2015/05/13\nStore: Robert Wuhl  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Assume the Position with Mr. Wuhl (DVD)']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Closed-captioned, Color, Dubbed, DVD, NTSC, Widescreen', 'Contributor': 'Louis C.K., Robert Wuhl, David Cross', 'Language': 'Unqualified, English (Dolby Digital 2.0)', 'Number Of Discs': '1', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 0.71 Ounces', 'Media Format': 'Closed-captioned, Color, Dubbed, DVD, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'October 9, 2007', 'Actors': 'Robert Wuhl', 'Dubbed': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '1'}\nReview Text: My husband had seen this somewhere and loved it! He could only remember that it was the guy from batman being really entertaining. I did some digging and found this. I got it for him as a surprise and he was super excited when it came in the mail and he opened the package! We watched it together and laughed and laughed! What an awesome lecture!! I wish I could take a class like this!! These kids were so lucky to be a part of this!\nReview Title: Awesomely funny and VERY informative!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Drop Dead Fred [DVD]\nReview Date: 2015/05/13\nStore: Phoebe Cates  (Actor),     Rik Mayall  (Actor),     Ate de Jong  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Elizabeth who just split from her husband, ends up going back home to mom. She comes across one of her childhood toys, a Jack-in-the-box, which was the very same one her frustrated mother imprisoned her childhood \"imaginary\" friend Fred, many years ago. Low and behold Elizabeth now opens the box, and out springs Fred with 21 years of pranks stored up!']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Closed-captioned, Color, DVD, Full Screen, NTSC', 'Contributor': 'Tim Matheson, Keith Charles, Ate de Jong, Eleanor Mondale, Marsha Mason, Carrie Fisher, Daniel Gerroll, Phoebe Cates, Carlos Davis, Ashley Peldon, Anthony Fingleton, Elizabeth Livingston, Peter Thoemke, Rik Mayall, Bob Reid, Ron EldardTim Matheson, Keith Charles, Ate de Jong, Eleanor Mondale, Marsha Mason, Carrie Fisher, Daniel Gerroll, Phoebe Cates, Carlos Davis, Ashley Peldon, Anthony Fingleton, Elizabeth Livingston, Peter Thoemke, Rik Mayall, Bob Reid, Ron Eldard   See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Director': 'Ate de Jong', 'Media Format': 'Closed-captioned, Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'July 22, 2003', 'Actors': 'Phoebe Cates, Rik Mayall, Marsha Mason, Tim Matheson, Carrie Fisher', 'Studio': 'Lions Gate', 'Writers': 'Anthony Fingleton, Carlos Davis, Elizabeth Livingston', 'Number of discs': '1'}\nReview Text: I've had this for quite a while now but after the unfortunate passing of THE Rik Mayall I found myself watching anything with him in it! I have quite the collection now but this still sits on top of the list along with the inevitable Young Ones.<br />Love this move, love this guy!!<br />Remember: equality, opportunity, wisdom, freedom, and love!<br /><br />P.S. PLEASE put this out on blue ray!!!!!\nReview Title: One of my all time favorite movies!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter: Complete 8-Film Collection\nReview Date: 2015/08/17\nStore: Daniel Radcliffe  (Actor),     Emma Watson  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Imported from UK', 'Extra Content:', \"Harry Potter and the Half-Blood Prince Create your own Picture-in-Picture commentary J.K. Rowling: A Year in the Life Cast members guide to moviemaking What's on your mind? - Q & A with cast/crew One-Minute Drills - Cast members sum up their characters Harry Potter and the Deathly Hallows - Part 1 The Last Days of Privet Drive - Maximum Movie Mode Hagrid's Motorbike - Maximum Movie Mode Death Eaters Attack Cafe - Maximum Movie Mode Creating Dobby and Kreacher - Maximum Movie Mode Magical Tents! - Maximum Movie Mode The Return of Griphook - Maximum Movie Mode The Seven Harry's On the Green with Rupert, Tom, Oliver, and James Deleted Scenes Godric's Hollow/Harry Nagini Battle The Frozen Lake Harry Potter and the Deathly Hallows Part 1: Behind the Soundtrack The Wizarding World of Harry Potter Promotional Trailer Dan, Rupert, and Emma's Running Competition Harry Potter and the Deathly Hallows - Part 2 Maximum Movie Mode: Aberforth Dumbledore Deathly Hallows Costume Changes Harry Returns to Hogwarts The Hogwarts Shield The Room of Requirement Set The Fiery Escape Neville's Stand Molly Takes Down Bellatrix Final Farewells from Cast and Crew Pottermore Preview When Harry Left Hogwarts The Goblins of Gringotts The Women of Harry Potter Deleted Scenes Warner Bros. Studio Tour London A Conversation with JK Rowling and Daniel Radcliffe\"]\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '2.68 x 6.89 x 5.35 inches; 14.46 Ounces', 'Audio Description': 'English', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Import', 'Run time': '19 hours and 59 minutes', 'Release date': 'May 14, 2013', 'Actors': 'Daniel Radcliffe, Emma Watson, Rupert Grint, Ralph Fiennes, Helena Bonham Carter', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital-Plus 5.1)', 'Studio': 'Imports', 'Number of discs': '11'}\nReview Text: Beautiful films! I love having such a quality product both region free and so affordable!! I had a wonderful weekend binge watching these movies!!!  Thank you!!!!!\nReview Title: And region free too?? Great!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monarchy Complete Collection\nReview Date: 2015/10/20\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Special Interests\nProduct Description: ['“Delightful and informative” —', 'San Francisco Chronicle', 'See this U.K. broadcast edition with episodes not seen on PBS documenting a 1,500-year history of power, passion and glory.', 'Over more than a millennium, the British monarchy has survived brutality, betrayal, and bloodshed to emerge as the oldest functioning political institution in Europe. Join eminent historian David Starkey (', 'The Six Wives of Henry VIII', ') as he probes the personalities of the men and women who wore the crown. Meet the Anglo-Saxon king Offa, who ruled more like a mafioso than a monarch; Henry VIII, who cultivated celebrity like a modern rock star; and Victoria, who remade the monarchy into the model of middle-class morality. Through it all, visit the very sites where history happened: Hastings, Bosworth Field, the Tower of London, and more.', 'In this captivating 16-part series, Starkey advances a unifying narrative—the dynamic tension between authoritarian order and rule by consent of the governed—that makes Britain unique among the world’s nations.', 'An honorary fellow at Cambridge University and a member of London’s Society of Royal Antiquaries, David Starkey (CBE) has taught history at the London School of Economics, written more than a dozen books, and presented many acclaimed television documentaries.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Monarchy', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.8 Ounces', 'Item model number': '7507868', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '12 hours and 56 minutes', 'Release date': 'August 3, 2010', 'Actors': 'Monarchy', 'Studio': 'ACORN MEDIA', 'Number of discs': '5'}\nReview Text: I absolutely love this series!!!! I used to watch it on Netflix when I would start missing Britain and at a very down moment I went to put it on and it had been taken down off Netflix.<br />It always seemed to end abruptly with the end of Oliver Cromwell (lord protector) and I was wondering where Victoria was. When I got this box it was complete!! There wa Victoria and how royalty was restored to Britain that I was so puzzled at the absence of on Netflix! I'm more than happy with this purchase! Gorgeous locations and fascinating stories! I've come to be so interested in different spots in British history that keep changing and adding to deeper research! I can't say enough good things about this series!!!!\nReview Title: I absolutely love this!!!!!!\nRating: 5.0\n--------------------------------------------------",
  "reference": "Peter's Friends [DVD]\nRita Rudner  (Actor),     Stephen Fry  (Actor),     Kenneth Branagh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'R', 'Release Date:', '12-FEB-2008', 'Media Type:', 'DVD', 'Amazon.com', 'What if you could go back to your glory days?', \"Peter's Friends\", ', sort of', 'The Big Chill', 'reconceived as an Agatha Christie country-estate drama, lets a group of university pals ponder that question while they must deal with their present-day demons. Kenneth Branagh\\'s film, written by costar Rita Rudner and Martin Bergman, is buoyed by its vast and talented cast, whose chemistry keeps the action crackling, even when most of the action is the characters speaking. The friends are reunited at Peter\\'s posh country home after the death of his father, for one last New Year\\'s Eve. The bons mots fly, and the interaction of the actors is, as the Brits say, brilliant. Peter (played by the sublime Stephen Fry): \"It\\'s funny, with both my parents gone, I suddenly have this overwhelming urge to act maturely.\" Andrew (Branagh): \"Oh, well, I don\\'t think anybody really matures. Adults are just children who owe money.\" Yet buried among the one-liners and drawing-room manners are disappointment, heartbreak, and a heavy secret (which, many years after the film\\'s original 1992 release, doesn\\'t pack the same wallop). Emma Thompson shows nuance and delight as Maggie while Hugh Laurie shows his dramatic capabilities. Other winning performances are given by Imelda Staunton and Tony Slattery. The setting is an absolute stunner, and viewers will wish they could spend a holiday at the manor. And the soundtrack will transport them to a sweeter time in the early \\'80s, when \"Everybody Wants to Rule the World.\" Cozy up for a delightfully unexpected evening with these', 'Friends', '. --', 'A.T. Hurley']\n{'Genre': 'Comedy', 'Format': 'Color, Dubbed, DVD, Subtitled, Widescreen, Closed-captioned, NTSC', 'Contributor': 'Tony Slattery, Jacques Offenbach, Emma Thompson, Imelda Staunton, Kenneth Branagh, Hugh Laurie, Stephen Fry, Phyllida Law, Alphonsia Emmanuel, Rita RudnerTony Slattery, Jacques Offenbach, Emma Thompson, Imelda Staunton, Kenneth Branagh, Hugh Laurie, Stephen Fry, Phyllida Law, Alphonsia Emmanuel, Rita Rudner  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 41 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.5 inches; 2.4 Ounces', 'Director': 'Kenneth Branagh', 'Media Format': 'Color, Dubbed, DVD, Subtitled, Widescreen, Closed-captioned, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Rita Rudner, Stephen Fry, Hugh Laurie, Emma Thompson, Tony Slattery', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nGreat old movie I love!!!<br />My husband and I were lucky enough to see Hugh Laurie play with the Copper Bottom Band (which I highly recommend if you love old New Orleans blues/jazz and want to hear songs you might not know) my husband and I were talking before the band hit the stage about this movie and I just had to get a copy and show it to my husband who hadn't seen it before. He loved it!! It's very much like The Big Chill and has a WONDERFUL soundtrack!\nLove this movie!!!\nVictor/Victoria\nJulie Andrews  (Actor),     James Garner  (Actor),     Blake Edwards  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"A man impersonating a woman on stage? Piece of cake. But a woman whose livelihood depends on pretending to be a man who pretends to be a woman? Now you've got problems! You've also got laughs when Julie Andrews plays Victor and Victoria in this clever delight, from filmmaker Blake Edwards, boasting a marvelous Academy Award -winning* score by Henry Mancini and Leslie Bricusse. Robert Preston plays a cabaret performer who devises the gender-bender stage act. Farcically complicating matters are James Garner as a mobster suspecting Victor is a Victoria and Lesley Ann Warren as a short-fused floozy. Of this movie's seven Oscar nominations*, three went to Golden Globe Winner Andrews (Actress), National Board of Review Award winner Preston (Supporting Actor) and Warren (Supporting Actress).\"]\n{'Genre': 'Comedy, Musicals & Performing Arts/Musicals/General', 'Format': 'NTSC', 'Contributor': 'Julie Andrews, Alex Karras, James Garner, Robert Preston, Lesley Ann Warren, Blake Edwards', 'Language': 'English', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '297790', 'Director': 'Blake Edwards', 'Media Format': 'NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'May 17, 2012', 'Actors': 'Julie Andrews, James Garner, Robert Preston, Lesley Ann Warren, Alex Karras', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nhaven't seen this since I was a kid! I have to cut all my hair off due to thinning and this was the first thing I thought of. so I had to buy it. it totally holds up and if you think about the time it came out and the fact that we are talking about Julie Andrews it is a shockingly wonderful film that really was groundbreaking in fight for gay acceptance. I can't say enough good stuff about this film and it was wonderful seeing it so beautifully hold up!!\na movie I've always loved looking gorgeous!!\nThe New Statesman\nMayall, Rik  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n[\"The hilarious Rik Mayall (The Young Ones, Bottom) stars as the cunning politician Alan B'Stard in this outrageously satirical British TV series. In his ruthless pursuit of power and money, there are no depths to which B'Stard will not happily sink, no plot too dastardly. With the help of his equally deceitful wife and his wimpy assistant, B'Stard schemes his way through his career. You'll be gasping with laughter through all 26 irresistible episodes of this award-winning series, plus the feature-length special, Who Shot Alan B'Stard? EPISODES: Happiness Is a Warm Gun - Passport to Freedom - Sex Is Wrong - Waste Not, Want Not - Friends of St. James - Three Line Whipping - Baa Baa Black Sheep - Labour of Love - The Party's Over - Let Them Sniff Cake - Keeping Mum - Natural Selection - Profit of Boom - Fatal Extraction - Live from Westminster - A Wapping Conspiracy - The Haltemprice Bunker - California Here I Come - May the Best Man Win - Piers of the Realm - Back from the Mort - H*A*S*H - Speaking in Tongues - Heil and Farewell - A Bigger Splash - The Irresistible Rise of Alan B'Stard\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 12.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '10 hours and 40 minutes', 'Release date': 'June 26, 2007', 'Actors': 'Mayall, Rik', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Image Entertainment', 'Number of discs': '4'}\ngreat and weird!!! what can I say...just happy to have this!!!!!\nRik and his meanest....so funny!!!\nAssume the Position with Mr. Wuhl [DVD]\nRobert Wuhl  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Assume the Position with Mr. Wuhl (DVD)']\n{'Format': 'Closed-captioned, Color, Dubbed, DVD, NTSC, Widescreen', 'Contributor': 'Louis C.K., Robert Wuhl, David Cross', 'Language': 'Unqualified, English (Dolby Digital 2.0)', 'Number Of Discs': '1', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 0.71 Ounces', 'Media Format': 'Closed-captioned, Color, Dubbed, DVD, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'October 9, 2007', 'Actors': 'Robert Wuhl', 'Dubbed': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '1'}\nMy husband had seen this somewhere and loved it! He could only remember that it was the guy from batman being really entertaining. I did some digging and found this. I got it for him as a surprise and he was super excited when it came in the mail and he opened the package! We watched it together and laughed and laughed! What an awesome lecture!! I wish I could take a class like this!! These kids were so lucky to be a part of this!\nAwesomely funny and VERY informative!\nDrop Dead Fred [DVD]\nPhoebe Cates  (Actor),     Rik Mayall  (Actor),     Ate de Jong  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Elizabeth who just split from her husband, ends up going back home to mom. She comes across one of her childhood toys, a Jack-in-the-box, which was the very same one her frustrated mother imprisoned her childhood \"imaginary\" friend Fred, many years ago. Low and behold Elizabeth now opens the box, and out springs Fred with 21 years of pranks stored up!']\n{'Format': 'Closed-captioned, Color, DVD, Full Screen, NTSC', 'Contributor': 'Tim Matheson, Keith Charles, Ate de Jong, Eleanor Mondale, Marsha Mason, Carrie Fisher, Daniel Gerroll, Phoebe Cates, Carlos Davis, Ashley Peldon, Anthony Fingleton, Elizabeth Livingston, Peter Thoemke, Rik Mayall, Bob Reid, Ron EldardTim Matheson, Keith Charles, Ate de Jong, Eleanor Mondale, Marsha Mason, Carrie Fisher, Daniel Gerroll, Phoebe Cates, Carlos Davis, Ashley Peldon, Anthony Fingleton, Elizabeth Livingston, Peter Thoemke, Rik Mayall, Bob Reid, Ron Eldard   See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Director': 'Ate de Jong', 'Media Format': 'Closed-captioned, Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'July 22, 2003', 'Actors': 'Phoebe Cates, Rik Mayall, Marsha Mason, Tim Matheson, Carrie Fisher', 'Studio': 'Lions Gate', 'Writers': 'Anthony Fingleton, Carlos Davis, Elizabeth Livingston', 'Number of discs': '1'}\nI've had this for quite a while now but after the unfortunate passing of THE Rik Mayall I found myself watching anything with him in it! I have quite the collection now but this still sits on top of the list along with the inevitable Young Ones.<br />Love this move, love this guy!!<br />Remember: equality, opportunity, wisdom, freedom, and love!<br /><br />P.S. PLEASE put this out on blue ray!!!!!\nOne of my all time favorite movies!\nHarry Potter: Complete 8-Film Collection\nDaniel Radcliffe  (Actor),     Emma Watson  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Imported from UK', 'Extra Content:', \"Harry Potter and the Half-Blood Prince Create your own Picture-in-Picture commentary J.K. Rowling: A Year in the Life Cast members guide to moviemaking What's on your mind? - Q & A with cast/crew One-Minute Drills - Cast members sum up their characters Harry Potter and the Deathly Hallows - Part 1 The Last Days of Privet Drive - Maximum Movie Mode Hagrid's Motorbike - Maximum Movie Mode Death Eaters Attack Cafe - Maximum Movie Mode Creating Dobby and Kreacher - Maximum Movie Mode Magical Tents! - Maximum Movie Mode The Return of Griphook - Maximum Movie Mode The Seven Harry's On the Green with Rupert, Tom, Oliver, and James Deleted Scenes Godric's Hollow/Harry Nagini Battle The Frozen Lake Harry Potter and the Deathly Hallows Part 1: Behind the Soundtrack The Wizarding World of Harry Potter Promotional Trailer Dan, Rupert, and Emma's Running Competition Harry Potter and the Deathly Hallows - Part 2 Maximum Movie Mode: Aberforth Dumbledore Deathly Hallows Costume Changes Harry Returns to Hogwarts The Hogwarts Shield The Room of Requirement Set The Fiery Escape Neville's Stand Molly Takes Down Bellatrix Final Farewells from Cast and Crew Pottermore Preview When Harry Left Hogwarts The Goblins of Gringotts The Women of Harry Potter Deleted Scenes Warner Bros. Studio Tour London A Conversation with JK Rowling and Daniel Radcliffe\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '2.68 x 6.89 x 5.35 inches; 14.46 Ounces', 'Audio Description': 'English', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Import', 'Run time': '19 hours and 59 minutes', 'Release date': 'May 14, 2013', 'Actors': 'Daniel Radcliffe, Emma Watson, Rupert Grint, Ralph Fiennes, Helena Bonham Carter', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital-Plus 5.1)', 'Studio': 'Imports', 'Number of discs': '11'}\nBeautiful films! I love having such a quality product both region free and so affordable!! I had a wonderful weekend binge watching these movies!!!  Thank you!!!!!\nAnd region free too?? Great!!!!\nMonarchy Complete Collection\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n['“Delightful and informative” —', 'San Francisco Chronicle', 'See this U.K. broadcast edition with episodes not seen on PBS documenting a 1,500-year history of power, passion and glory.', 'Over more than a millennium, the British monarchy has survived brutality, betrayal, and bloodshed to emerge as the oldest functioning political institution in Europe. Join eminent historian David Starkey (', 'The Six Wives of Henry VIII', ') as he probes the personalities of the men and women who wore the crown. Meet the Anglo-Saxon king Offa, who ruled more like a mafioso than a monarch; Henry VIII, who cultivated celebrity like a modern rock star; and Victoria, who remade the monarchy into the model of middle-class morality. Through it all, visit the very sites where history happened: Hastings, Bosworth Field, the Tower of London, and more.', 'In this captivating 16-part series, Starkey advances a unifying narrative—the dynamic tension between authoritarian order and rule by consent of the governed—that makes Britain unique among the world’s nations.', 'An honorary fellow at Cambridge University and a member of London’s Society of Royal Antiquaries, David Starkey (CBE) has taught history at the London School of Economics, written more than a dozen books, and presented many acclaimed television documentaries.']\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Monarchy', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.8 Ounces', 'Item model number': '7507868', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '12 hours and 56 minutes', 'Release date': 'August 3, 2010', 'Actors': 'Monarchy', 'Studio': 'ACORN MEDIA', 'Number of discs': '5'}\nI absolutely love this series!!!! I used to watch it on Netflix when I would start missing Britain and at a very down moment I went to put it on and it had been taken down off Netflix.<br />It always seemed to end abruptly with the end of Oliver Cromwell (lord protector) and I was wondering where Victoria was. When I got this box it was complete!! There wa Victoria and how royalty was restored to Britain that I was so puzzled at the absence of on Netflix! I'm more than happy with this purchase! Gorgeous locations and fascinating stories! I've come to be so interested in different spots in British history that keep changing and adding to deeper research! I can't say enough good things about this series!!!!\nI absolutely love this!!!!!!",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Peter's Friends [DVD]\nReview Date: 2014/07/20\nStore: Rita Rudner  (Actor),     Stephen Fry  (Actor),     Kenneth Branagh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'R', 'Release Date:', '12-FEB-2008', 'Media Type:', 'DVD', 'Amazon.com', 'What if you could go back to your glory days?', \"Peter's Friends\", ', sort of', 'The Big Chill', 'reconceived as an Agatha Christie country-estate drama, lets a group of university pals ponder that question while they must deal with their present-day demons. Kenneth Branagh\\'s film, written by costar Rita Rudner and Martin Bergman, is buoyed by its vast and talented cast, whose chemistry keeps the action crackling, even when most of the action is the characters speaking. The friends are reunited at Peter\\'s posh country home after the death of his father, for one last New Year\\'s Eve. The bons mots fly, and the interaction of the actors is, as the Brits say, brilliant. Peter (played by the sublime Stephen Fry): \"It\\'s funny, with both my parents gone, I suddenly have this overwhelming urge to act maturely.\" Andrew (Branagh): \"Oh, well, I don\\'t think anybody really matures. Adults are just children who owe money.\" Yet buried among the one-liners and drawing-room manners are disappointment, heartbreak, and a heavy secret (which, many years after the film\\'s original 1992 release, doesn\\'t pack the same wallop). Emma Thompson shows nuance and delight as Maggie while Hugh Laurie shows his dramatic capabilities. Other winning performances are given by Imelda Staunton and Tony Slattery. The setting is an absolute stunner, and viewers will wish they could spend a holiday at the manor. And the soundtrack will transport them to a sweeter time in the early \\'80s, when \"Everybody Wants to Rule the World.\" Cozy up for a delightfully unexpected evening with these', 'Friends', '. --', 'A.T. Hurley']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, Dubbed, DVD, Subtitled, Widescreen, Closed-captioned, NTSC', 'Contributor': 'Tony Slattery, Jacques Offenbach, Emma Thompson, Imelda Staunton, Kenneth Branagh, Hugh Laurie, Stephen Fry, Phyllida Law, Alphonsia Emmanuel, Rita RudnerTony Slattery, Jacques Offenbach, Emma Thompson, Imelda Staunton, Kenneth Branagh, Hugh Laurie, Stephen Fry, Phyllida Law, Alphonsia Emmanuel, Rita Rudner  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 41 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.5 inches; 2.4 Ounces', 'Director': 'Kenneth Branagh', 'Media Format': 'Color, Dubbed, DVD, Subtitled, Widescreen, Closed-captioned, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Rita Rudner, Stephen Fry, Hugh Laurie, Emma Thompson, Tony Slattery', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nReview Text: Great old movie I love!!!<br />My husband and I were lucky enough to see Hugh Laurie play with the Copper Bottom Band (which I highly recommend if you love old New Orleans blues/jazz and want to hear songs you might not know) my husband and I were talking before the band hit the stage about this movie and I just had to get a copy and show it to my husband who hadn't seen it before. He loved it!! It's very much like The Big Chill and has a WONDERFUL soundtrack!\nReview Title: Love this movie!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Victor/Victoria\nReview Date: 2015/02/16\nStore: Julie Andrews  (Actor),     James Garner  (Actor),     Blake Edwards  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"A man impersonating a woman on stage? Piece of cake. But a woman whose livelihood depends on pretending to be a man who pretends to be a woman? Now you've got problems! You've also got laughs when Julie Andrews plays Victor and Victoria in this clever delight, from filmmaker Blake Edwards, boasting a marvelous Academy Award -winning* score by Henry Mancini and Leslie Bricusse. Robert Preston plays a cabaret performer who devises the gender-bender stage act. Farcically complicating matters are James Garner as a mobster suspecting Victor is a Victoria and Lesley Ann Warren as a short-fused floozy. Of this movie's seven Oscar nominations*, three went to Golden Globe Winner Andrews (Actress), National Board of Review Award winner Preston (Supporting Actor) and Warren (Supporting Actress).\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Musicals & Performing Arts/Musicals/General', 'Format': 'NTSC', 'Contributor': 'Julie Andrews, Alex Karras, James Garner, Robert Preston, Lesley Ann Warren, Blake Edwards', 'Language': 'English', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '297790', 'Director': 'Blake Edwards', 'Media Format': 'NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'May 17, 2012', 'Actors': 'Julie Andrews, James Garner, Robert Preston, Lesley Ann Warren, Alex Karras', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: haven't seen this since I was a kid! I have to cut all my hair off due to thinning and this was the first thing I thought of. so I had to buy it. it totally holds up and if you think about the time it came out and the fact that we are talking about Julie Andrews it is a shockingly wonderful film that really was groundbreaking in fight for gay acceptance. I can't say enough good stuff about this film and it was wonderful seeing it so beautifully hold up!!\nReview Title: a movie I've always loved looking gorgeous!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The New Statesman\nReview Date: 2015/02/16\nStore: Mayall, Rik  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: [\"The hilarious Rik Mayall (The Young Ones, Bottom) stars as the cunning politician Alan B'Stard in this outrageously satirical British TV series. In his ruthless pursuit of power and money, there are no depths to which B'Stard will not happily sink, no plot too dastardly. With the help of his equally deceitful wife and his wimpy assistant, B'Stard schemes his way through his career. You'll be gasping with laughter through all 26 irresistible episodes of this award-winning series, plus the feature-length special, Who Shot Alan B'Stard? EPISODES: Happiness Is a Warm Gun - Passport to Freedom - Sex Is Wrong - Waste Not, Want Not - Friends of St. James - Three Line Whipping - Baa Baa Black Sheep - Labour of Love - The Party's Over - Let Them Sniff Cake - Keeping Mum - Natural Selection - Profit of Boom - Fatal Extraction - Live from Westminster - A Wapping Conspiracy - The Haltemprice Bunker - California Here I Come - May the Best Man Win - Piers of the Realm - Back from the Mort - H*A*S*H - Speaking in Tongues - Heil and Farewell - A Bigger Splash - The Irresistible Rise of Alan B'Stard\"]\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 12.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '10 hours and 40 minutes', 'Release date': 'June 26, 2007', 'Actors': 'Mayall, Rik', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Image Entertainment', 'Number of discs': '4'}\nReview Text: great and weird!!! what can I say...just happy to have this!!!!!\nReview Title: Rik and his meanest....so funny!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Assume the Position with Mr. Wuhl [DVD]\nReview Date: 2015/05/13\nStore: Robert Wuhl  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Assume the Position with Mr. Wuhl (DVD)']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Closed-captioned, Color, Dubbed, DVD, NTSC, Widescreen', 'Contributor': 'Louis C.K., Robert Wuhl, David Cross', 'Language': 'Unqualified, English (Dolby Digital 2.0)', 'Number Of Discs': '1', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 0.71 Ounces', 'Media Format': 'Closed-captioned, Color, Dubbed, DVD, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'October 9, 2007', 'Actors': 'Robert Wuhl', 'Dubbed': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '1'}\nReview Text: My husband had seen this somewhere and loved it! He could only remember that it was the guy from batman being really entertaining. I did some digging and found this. I got it for him as a surprise and he was super excited when it came in the mail and he opened the package! We watched it together and laughed and laughed! What an awesome lecture!! I wish I could take a class like this!! These kids were so lucky to be a part of this!\nReview Title: Awesomely funny and VERY informative!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Drop Dead Fred [DVD]\nReview Date: 2015/05/13\nStore: Phoebe Cates  (Actor),     Rik Mayall  (Actor),     Ate de Jong  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Elizabeth who just split from her husband, ends up going back home to mom. She comes across one of her childhood toys, a Jack-in-the-box, which was the very same one her frustrated mother imprisoned her childhood \"imaginary\" friend Fred, many years ago. Low and behold Elizabeth now opens the box, and out springs Fred with 21 years of pranks stored up!']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Closed-captioned, Color, DVD, Full Screen, NTSC', 'Contributor': 'Tim Matheson, Keith Charles, Ate de Jong, Eleanor Mondale, Marsha Mason, Carrie Fisher, Daniel Gerroll, Phoebe Cates, Carlos Davis, Ashley Peldon, Anthony Fingleton, Elizabeth Livingston, Peter Thoemke, Rik Mayall, Bob Reid, Ron EldardTim Matheson, Keith Charles, Ate de Jong, Eleanor Mondale, Marsha Mason, Carrie Fisher, Daniel Gerroll, Phoebe Cates, Carlos Davis, Ashley Peldon, Anthony Fingleton, Elizabeth Livingston, Peter Thoemke, Rik Mayall, Bob Reid, Ron Eldard   See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Director': 'Ate de Jong', 'Media Format': 'Closed-captioned, Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'July 22, 2003', 'Actors': 'Phoebe Cates, Rik Mayall, Marsha Mason, Tim Matheson, Carrie Fisher', 'Studio': 'Lions Gate', 'Writers': 'Anthony Fingleton, Carlos Davis, Elizabeth Livingston', 'Number of discs': '1'}\nReview Text: I've had this for quite a while now but after the unfortunate passing of THE Rik Mayall I found myself watching anything with him in it! I have quite the collection now but this still sits on top of the list along with the inevitable Young Ones.<br />Love this move, love this guy!!<br />Remember: equality, opportunity, wisdom, freedom, and love!<br /><br />P.S. PLEASE put this out on blue ray!!!!!\nReview Title: One of my all time favorite movies!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter: Complete 8-Film Collection\nReview Date: 2015/08/17\nStore: Daniel Radcliffe  (Actor),     Emma Watson  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Imported from UK', 'Extra Content:', \"Harry Potter and the Half-Blood Prince Create your own Picture-in-Picture commentary J.K. Rowling: A Year in the Life Cast members guide to moviemaking What's on your mind? - Q & A with cast/crew One-Minute Drills - Cast members sum up their characters Harry Potter and the Deathly Hallows - Part 1 The Last Days of Privet Drive - Maximum Movie Mode Hagrid's Motorbike - Maximum Movie Mode Death Eaters Attack Cafe - Maximum Movie Mode Creating Dobby and Kreacher - Maximum Movie Mode Magical Tents! - Maximum Movie Mode The Return of Griphook - Maximum Movie Mode The Seven Harry's On the Green with Rupert, Tom, Oliver, and James Deleted Scenes Godric's Hollow/Harry Nagini Battle The Frozen Lake Harry Potter and the Deathly Hallows Part 1: Behind the Soundtrack The Wizarding World of Harry Potter Promotional Trailer Dan, Rupert, and Emma's Running Competition Harry Potter and the Deathly Hallows - Part 2 Maximum Movie Mode: Aberforth Dumbledore Deathly Hallows Costume Changes Harry Returns to Hogwarts The Hogwarts Shield The Room of Requirement Set The Fiery Escape Neville's Stand Molly Takes Down Bellatrix Final Farewells from Cast and Crew Pottermore Preview When Harry Left Hogwarts The Goblins of Gringotts The Women of Harry Potter Deleted Scenes Warner Bros. Studio Tour London A Conversation with JK Rowling and Daniel Radcliffe\"]\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '2.68 x 6.89 x 5.35 inches; 14.46 Ounces', 'Audio Description': 'English', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Import', 'Run time': '19 hours and 59 minutes', 'Release date': 'May 14, 2013', 'Actors': 'Daniel Radcliffe, Emma Watson, Rupert Grint, Ralph Fiennes, Helena Bonham Carter', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital-Plus 5.1)', 'Studio': 'Imports', 'Number of discs': '11'}\nReview Text: Beautiful films! I love having such a quality product both region free and so affordable!! I had a wonderful weekend binge watching these movies!!!  Thank you!!!!!\nReview Title: And region free too?? Great!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monarchy Complete Collection\nReview Date: 2015/10/20\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Special Interests\nProduct Description: ['“Delightful and informative” —', 'San Francisco Chronicle', 'See this U.K. broadcast edition with episodes not seen on PBS documenting a 1,500-year history of power, passion and glory.', 'Over more than a millennium, the British monarchy has survived brutality, betrayal, and bloodshed to emerge as the oldest functioning political institution in Europe. Join eminent historian David Starkey (', 'The Six Wives of Henry VIII', ') as he probes the personalities of the men and women who wore the crown. Meet the Anglo-Saxon king Offa, who ruled more like a mafioso than a monarch; Henry VIII, who cultivated celebrity like a modern rock star; and Victoria, who remade the monarchy into the model of middle-class morality. Through it all, visit the very sites where history happened: Hastings, Bosworth Field, the Tower of London, and more.', 'In this captivating 16-part series, Starkey advances a unifying narrative—the dynamic tension between authoritarian order and rule by consent of the governed—that makes Britain unique among the world’s nations.', 'An honorary fellow at Cambridge University and a member of London’s Society of Royal Antiquaries, David Starkey (CBE) has taught history at the London School of Economics, written more than a dozen books, and presented many acclaimed television documentaries.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Monarchy', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.8 Ounces', 'Item model number': '7507868', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '12 hours and 56 minutes', 'Release date': 'August 3, 2010', 'Actors': 'Monarchy', 'Studio': 'ACORN MEDIA', 'Number of discs': '5'}\nReview Text: I absolutely love this series!!!! I used to watch it on Netflix when I would start missing Britain and at a very down moment I went to put it on and it had been taken down off Netflix.<br />It always seemed to end abruptly with the end of Oliver Cromwell (lord protector) and I was wondering where Victoria was. When I got this box it was complete!! There wa Victoria and how royalty was restored to Britain that I was so puzzled at the absence of on Netflix! I'm more than happy with this purchase! Gorgeous locations and fascinating stories! I've come to be so interested in different spots in British history that keep changing and adding to deeper research! I can't say enough good things about this series!!!!\nReview Title: I absolutely love this!!!!!!\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual demonstrates a clear preference for comedic and nostalgic films, particularly those with rich storytelling and strong character interactions. They consistently rate movies highly, often reflecting sentiments of joy and appreciation for humor, as seen in their enthusiasm for classic comedies and musicals. \n\nCommon themes in their purchases indicate a fondness for films with unique narratives that challenge societal norms, particularly those addressing themes such as friendship and identity. They show an affinity for British comedy, highlighted by repeated selections featuring notable British actors and creators. \n\nQuality emerges as a recurring priority, evidenced by their choice of DVDs and boxed sets that notably emphasize superior production values and soundtracks. There is also a slight price sensitivity, as several comments reflect satisfaction with affordable, high-quality collections that enrich their viewing experiences.\n\nOverall, the core preferences reveal a deep appreciation for comedy that blends clever writing with cultural resonance, coupled with a preference for nostalgic and character-driven narratives within the realms of film and television.",
  "target_interaction": {
    "rating": 5.0,
    "title": "I really liked this!",
    "text": "I really liked this!! Loved some of my favorite British actors: Burn Gorman, Phil Davis, and Carey Mulligan. The story was interesting and the sets and costumes top notch! Its always going to be a little odd seeing Gillian Anderson playing a Brit even though I keep hearing that she comes by the accent naturally having grown up in the U.K... its just years of watching her on the X-Files...<br />all-in-all I loved it!!",
    "images": [],
    "asin": "B00406MX46",
    "parent_asin": "B00406MX46",
    "user_id": "AHGONLBPMXIJRW3JUB6HO4UVPP6Q",
    "timestamp": "2017-01-10 02:54:45",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.5,
    "rating_number": 4090,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/8f3590291da98053c3d0ddce091b8f557ca586c1502d2df734aa2327c10f2ccc._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/8f3590291da98053c3d0ddce091b8f557ca586c1502d2df734aa2327c10f2ccc._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/8f3590291da98053c3d0ddce091b8f557ca586c1502d2df734aa2327c10f2ccc._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/8f3590291da98053c3d0ddce091b8f557ca586c1502d2df734aa2327c10f2ccc._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/8f3590291da98053c3d0ddce091b8f557ca586c1502d2df734aa2327c10f2ccc._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/8f3590291da98053c3d0ddce091b8f557ca586c1502d2df734aa2327c10f2ccc._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Nigel Stafford-Clark"
      ],
      "Producers": [
        "Nigel Stafford-Clark"
      ],
      "Starring": [
        "Gillian Anderson",
        "Denis Lawson",
        "Charles Dance"
      ],
      "Studio": [
        "BBC America"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}