{
  "user_id": "AHSYGE3ZINZM33J76ACQX45QGUYA",
  "summary": "=== Purchase Information ===\nProduct Title: Italian Fascism in Color\nReview Date: 2009/12/06\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['This is the untold story of how Mussolini seized power through systematic intimidation, violence and murder.']\nAverage Rating: 4.0\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'SHA-DV995', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 11, 2007', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Shanchie Records', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I really enjoyed this documentary, and it is a product I recommend. The color isnt bad, all things considered and it allows you to look at the dictator in a new light. I found that their was human emotion in it as well and a greater view for understanding what took plae at this time. I found it fascinating really, to look at the developement and views of the Italian people at this time. A job well done, truely!\nReview Title: A very good documentary\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Avatar (Original Theatrical Edition)\nReview Date: 2010/04/20\nStore: Sam Worthington  (Actor),     Zoe Saldana  (Actor),     James Cameron  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', \"A reluctant hero. An epic journey. A choice between the life he left behind and the incredible new world he's learned to call home. James Cameron's Avatar - the greatest adventure of all time.\", 'Amazon.com', 'After 12 years of thinking about it (and waiting for movie technology to catch up with his visions), James Cameron followed up his unsinkable', 'Titanic', 'with', 'Avatar', ', a sci-fi epic meant to trump all previous sci-fi epics. Set in the future on a distant planet,', 'Avatar', \"spins a simple little parable about greedy colonizers (that would be mankind) messing up the lush tribal world of Pandora. A paraplegic Marine named Jake (Sam Worthington) acts through a 9-foot-tall avatar that allows him to roam the planet and pass as one of the Na'vi, the blue-skinned, large-eyed native people who would very much like to live their peaceful lives without the interference of the visitors. Although he's supposed to be gathering intel for the badass general (Stephen Lang) who'd like to lay waste to the planet and its inhabitants, Jake naturally begins to take a liking to the Na'vi, especially the feisty Neytiri (Zoë Saldana, whose entire performance, recorded by Cameron's complicated motion-capture system, exists as a digitally rendered Na'vi). The movie uses state-of-the-art 3D technology to plunge the viewer deep into Cameron's crazy toy box of planetary ecosystems and high-tech machinery. Maybe it's the fact that Cameron seems torn between his two loves--awesome destructive gizmos and flower-power message mongering--that makes\", 'Avatar', '\\'s pursuit of its point ultimately uncertain. That, and the fact that Cameron\\'s dialogue continues to clunk badly. If you\\'re won over by the movie\\'s trippy new world, the characters will be forgivable as broad, useful archetypes rather than standard-issue stereotypes, and you might be able to overlook the unsurprising central plot. (The overextended \"take that, Michael Bay\" final battle sequences could tax even Cameron enthusiasts, however.) It doesn\\'t measure up to the hype (what could?) yet', 'Avatar', 'frequently hits a giddy delirium all its own. The film itself is our Pandora, a sensation-saturated universe only the movies could create.', '--Robert Horton']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Stephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Sam WorthingtonStephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Sam Worthington  See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': 'MFR024543656067#VG', 'Director': 'James Cameron', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Release date': 'April 22, 2010', 'Actors': 'Sam Worthington, Zoe Saldana, Sigourney Weaver, Michelle Rodriguez, Stephen Lang', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Writers': 'James Cameron', 'Number of discs': '1'}\nReview Text: This movies was the greatest I have seen in a long time. Every aspect about it is cool, from the action, to the romance, to the drama, to the digital effect, to sooo much more. Brilliantly directed too! I keep hearing about this first release not having all the features, and my motto \"Me ne frego\", or I dont give a damn. this is a terrific movie! One for the ages, and at the price is fine by me. ALSO really? Do you REALLY want to wait for some bonus features that your gonna watch one or twice? Get this edition then when the third edition comes out grab that. Dont even bother with it. This IS the movie that was in theaters, what won crowds over globaly! Get it, you wont regret it!\nReview Title: Worth the Money, and the wait.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Wolfman (2010)\nReview Date: 2010/12/05\nStore: Anthony Hopkins  (Actor),     Benicio Del Toro  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Academy Award® winners Anthony Hopkins (The Silence of the Lambs) and Benicio Del Toro (Traffic) tear up the screen in this action-packed thriller. Lawrence Talbot (Del Toro) is lured back to his family estate to investigate the savage murder of his brother by a bloodthirsty beast. There, Talbot must confront his childhood demons, his estranged father (Hopkins), his brother’s grieving fiancée (Emily Blunt, The Devil Wears Prada) and a suspicious Scotland Yard Inspector (Hugo Weaving, The Matrix Trilogy). When Talbot is bitten by the creature, he becomes eternally cursed and soon discovers a fate far worse than death. Inspired by the classic Universal film that launched a legacy of horror, The Wolfman brings the myth of a cursed man back to its iconic origins.', 'Amazon.com', 'The mist rising over the moors feels right, and so does the slant of moonlight coming over a Victorian village-scape. And if the moon is full, this must be', 'The Wolfman', \", Universal's 2010 attempt to revive one of the crown jewels in its deservedly legendary horror stable. Benicio Del Toro takes on the old Lon Chaney Jr. role of Lawrence Talbot, an American visitor to his ancestral home in England. Talbot's brother has recently been torn to bits by a beast in the forest, leaving behind a grieving fiancée (Emily Blunt) and a not-visibly-grieving father (Anthony Hopkins). This central situation seems drained of blood even before the full-moon transfigurations begin to bloom, and Del Toro's Talbot--an actor by trade, which raises interesting possibilities for a story of a man divided by different personalities--is mystifyingly blank. The intriguing casting of Del Toro (what an opportunity for a cool werewolf!) comes to naught as Talbot seems to languish on the periphery of his own story. Hugo Weaving tries to generate some interest as the police inspector on the case, but he too is defeated by the combination of mechanical storytelling and bland computer-generated werewolves. The script skips from one exposition scene to the next, but nothing registers long enough to create character, tension, or the slimmest desire to see what happens in the next scene. Every once in a while director Joe Johnston (\", 'Jumanji', ') finds a grand staircase or CGI fog that conjures up the atmosphere of the old Universal horror classics, but otherwise this is a clueless affair--not as bad as', 'Van Helsing', ', but flat-out dull. The movie can\\'t even find a way to get the old Gypsy lady (Geraldine Chaplin stepping into Maria Ouspenskaya\\'s tiny shoes) to deliver a proper recitation of screenwriter Curt Siodmak\\'s great \"Even a man who is pure in heart\" doggerel from the 1941 film. Instead, it\\'s thrown away in a voice-over at the beginning--one hairy way to start the movie.', '--Robert Horton']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Horror, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, Dolby, Dubbed, NTSC', 'Contributor': 'Emily Blunt, Benicio Del Toro, Anthony Hopkins', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': 'MFR025195038430#VG', 'Media Format': 'Multiple Formats, Color, Widescreen, Dolby, Dubbed, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'January 16, 2011', 'Actors': 'Anthony Hopkins, Benicio Del Toro, Emily Blunt', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: People keep going on about how much this movie \"sucked\". Well I fail to see their reasoning. This movie was full of action, the main actress was pretty cute ;), the plot was cool, the only things holding me back from giving it a 5 star were reasons as followed, dim lighting and hard to see some scenes, special effects weren't exactly the greatest (though not bad), and even though they made the wolves look more like the original wolfman, I still think a more wolf kinda look (like Van Helsing look) would have been prefered in my book, although I do realize it takes away from the whole WolfMAN thing, and I got that and all but I still prefer the werewolf look in this fashion. I just think it's cooler. That said this was pretty good. Oh, and the one other complaint would be that everything happened a little too fast for my taste as far as scene to scene goes. But ya, good movie!\nReview Title: Quit The Hate!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dragon Ball Z: Season 1\nReview Date: 2011/07/18\nStore: Shigeru Chiba  (Actor),     Justin Cook  (Actor),     Daisuke Nishio  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Anime\nProduct Description: ['Product Description', 'The Saiyans are coming! The last survivors of a cruel, warrior race, these ruthless villains have carved a path of destruction across the galaxy, and now they have set their sights on Earth. They will stop at nothing until they have the wish-granting powers of the seven magic Dragon Balls for their very own.', \"With the fate of his family, friends and the entire human race hanging in the balance, Goku, the Earth's greatest hero, must rise to meet the approaching threat. As he prepares for the fight of his life, Goku embarks on an epic journey that will take him to other worlds, pit him against new and old enemies alike, and force him to confront the dark secrets of his own past. At the end of his path, the most powerful opponent he has ever faced awaits - the evil Saiyan Prince Vegeta!\", 'This Dragon Ball Season Set is the definitive collection!', 'Digitally re-mastered in High Definition', 'Digitally re-mastered in High Definition', 'Transferred from the original Japanese film', 'Transferred from the original Japanese film', 'The complete season one - contains 39 episodes on 5 discs', 'The complete season one - contains 39 episodes on 5 discs', 'Over 900 minutes of action', 'Over 900 minutes of action', 'Revised English dialogue and original Japanese music  Extra features include: Footage on the re-mastering  The ultimate Dragon Ball Z - Collect them all!', 'Revised English dialogue and original Japanese music', 'Extra features include: Footage on the re-mastering', 'The ultimate Dragon Ball Z - Collect them all!', 'Amazon.com', 'One of the most popular franchises in anime history,', 'Dragon Ball', 'began in 1984 as a manga by Akira Toriyama in', 'Shonen Jump', '.', 'Dragon Ball Z', '(1989), the second TV adaptation, is the most beloved: it ran for 291 episodes--more than', 'Dragon Ball', '(1986) and', 'Dragon Ball GT', \"(1996) combined. Over the years, the program has introduced countless boys to the world of Japanese animation. The first season re-introduces the main characters and sets up a new threat. Goku learns he's not an Earthling, but a Saiyan from the planet Vegeta. Only three other Saiyans survive, all of them extremely powerful and destructive. Goku destroys Raditz with the help of Piccolo, but dies in the process. He spends much of the season training in the Other World with King Kai. Piccolo takes over training Goku's son Gohan, anticipating he will have to face the remaining Saiyans, Nappa and Vegeta. These episodes set the pattern for the combination of martial arts training, fantasy-battles and slapstick comedy that make the series so popular. The storyline rambles, with lots of digressions, repeats, and false endings--none of which bother the fans. Although\", 'Dragon Ball Z', 'has been released previously in the US, Funimation pulled out all the stops for this edition. The entire series has been remastered from the original prints, and the Japanese language track is included for the first time. (Goku and Krillin have higher-pitched, younger voices than they do in the American dub.) For', 'Dragon Ball Z', 'fans, this version clearly supercedes all previous ones. (Rated TV PG. suitable for ages 8 and older: violence; minor incidents of risqué and toilet humor, ethnic stereotyping and alcohol use)', '--Charles Solomon']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.1 x 7.4 x 5.5 inches; 2.72 Ounces', 'Item model number': '1-4210-0004-0', 'Director': 'Daisuke Nishio', 'Media Format': 'Widescreen, Color, NTSC, Subtitled', 'Run time': '15 hours and 25 minutes', 'Release date': 'February 6, 2007', 'Actors': 'Shigeru Chiba, Justin Cook, Cynthia Cranz, Toshio Furukawa, Kyle Hebert', 'Subtitles': 'English', 'Language': 'Japanese (Dolby Digital 1.0), English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Stereo)', 'Studio': 'Funimation', 'Number of discs': '6'}\nReview Text: I am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the coolest race of Humanoids....THE SAIYANS! Radditz, Vegeta, Nappa, you just cant go wrong their!\nReview Title: Great Saga!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dragon Ball Z - Season 2 (Namek and Captain Ginyu Sagas)\nReview Date: 2011/07/18\nStore: Sean Schemmel  (Actor),     Christopher Sabat  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Boxed Sets, Anime\nProduct Description: ['Product Description', \"Click Here for Trailer Having suffered heavy losses in the battle with the Saiyans, and with Goku still recovering from his injuries, the remaining Z-Fighters must embark on a perilous journey to Planet Namek in search of the Namekian Dragon Balls. Unbeknownst to them, however, a powerful new enemy has set his sights on the same prize - the ruthless tyrant Freiza! Beset on all sides by danger, Goah, Krillin, and Bulma must fight for their lives as they struggle to keep the Dragon Balls from falling to evil hands. Meanwhile, Goku races against time to join his friends in their quest, but waiting for him on Planet Namek is an army of the most powerful villains the universe has ever known, led by Frieza's most elite fighting unit - the unstoppable Ginyu Force!\", 'Amazon.com', 'The second season of the wildly popular', 'Dragon Ball Z', 'comprises the \"Namek\" and \"Captain Ginyu\" sagas. Gohan, Krillin, and Bulma travel to the planet Namek to find an even more powerful set of Dragon Balls that can restore the lives of Tenshinhan, Yamucha, Chaozu and Piccolo, who were killed by Vegeta during the first season. (Their souls continue to train with King Kai in the Other World.) All is not well on Namek: the arch-villain Frieza, who looks and sounds a bit like Truman Capote, also desires the Dragon Balls. If he uses them to obtain eternal life, he\\'ll rule the universe forever. With a cadre of lieutenants that includes Vegeta, he slaughters the Namekians to gain the supernatural orbs. After his injuries have been healed by a magic senzu bean, Goku heads to Namek. En route, he trains at 100 gravities, raising his powers enormously. Vegeta believes Goku may be the legendary Super Saiyan that appears once a millennium--except he lacks the requisite love of battle. This version of Goku is less aggressive, and he uncharacteristically uses his brain (never his greatest asset) to defeat Ginyu, Frieza\\'s second-in-command. Unlike', 'Season 1--Vegeta Saga', ',', 'Season 2', \"ends on a cliff-hanger. Skeptics may find Goku's adventures needlessly protracted, over the top, and even silly. But for millions of boys, they provide the special blend of comradeship, martial arts training, and take-no-prisoners battles they love. The newly remastered edition includes the original Japanese dialogue for the first time. (Rated TV PG. suitable for ages 8 and older: violence, minor risqué humor, brief nudity, tobacco and alcohol use)\", '--Charles Solomon']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Animated, Box set, Color, NTSC', 'Contributor': 'Christopher Sabat, Sean Schemmel', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Japanese (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.6 Ounces', 'Item model number': '1-4210-0006-7', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC', 'Run time': '13 hours and 55 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Sean Schemmel, Christopher Sabat', 'Subtitles': 'English', 'Studio': 'Funimation', 'Number of discs': '6'}\nReview Text: I am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the Namekians who are cool and you get some flashbacks of the past! You see Dodoria, Zarbon, and one of my favorite villains in the series, Frieza! You also get a peek at the Ginyu Force which brings a refreshing sense of humor to the story along with a roster of villains!\nReview Title: GREAT SAGA!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dragon Ball Z - Season 3 (Frieza Saga)\nReview Date: 2011/07/18\nStore: Toshio Furukawa  (Actor),     Ryô Horikawa  (Actor),     Daisuke Nishio  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', \"This popular anime series follows the skilled Warrior Goku and his band of Z-Fighters as they search for the Powerful Dragon Balls. The adventures continue with every episode from the series' third season. Director Daisuke Nishio Special Features: Audio: Dolby Digital 5.1 - Japanese, English Stereo - Japanese, English Subtitles - English - Optional Interactive Features: Additional interactive features - Marathon play runtime: 790 Minutes year of release: 1989.\", 'Amazon.com', 'The third season of the popular', 'shonen', \"(boy's) show\", 'Dragon Ball Z', \"continues the adventures of Goku and Gohan on Namek, Piccolo's home planet. Goku, who has been in a regeneration tank since the end of season 2, recovers just in time to challenge the sniggering Frieza, one of the most grating villains in anime history. Having defeated Gohan, Krillin, Vegeta, and Piccolo, Frieza takes on Goku in a protracted duel. When he begins to doubt his ability to overcome Goku, Frieza destroys the core of Namek, ensuring it will explode in a matter of minutes. Enraged by the death of Krillin and so many others, Goku transforms into the one thing Frieza fears: a Super Saiyan, a legendary warrior who appears once every 1,000 years. As the seconds tick away, the two most powerful individuals in the universe duke it out. While they're beating the\", 'soba', 'out of each other, King Kai hatches a plan to use the Dragon Balls of Earth and Namek to ensure a happy ending. As the battle between Goku and Frieza intensifies, the kicks and punches fly, producing titanic explosions. But the duel goes on for more than 20 episodes: With only a limited budget and crude special-effects techniques at their disposal, the filmmakers have to recycle footage endlessly.', 'Dragon Ball Z: Season 3', 'is more entertaining when the viewer allows a few days to elapse between episodes, rather than indulging in a Super Saiyan marathon. (Rated TV PG. suitable for ages 8 and older: violence, brief nudity, tobacco use, ethnic stereotypes)', '--Charles Solomon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Subtitled, Surround Sound', 'Contributor': 'Mayumi Tanaka, Ryô Horikawa, Toshio Furukawa, Daisuke Nishio, Stephanie Nadolny, Sean Schemmel, Masako Nozawa, Christopher Sabat, Ryûsei Nakao, Jôji Yanami, Linda Young, Sonny Strait, Dale KellyMayumi Tanaka, Ryô Horikawa, Toshio Furukawa, Daisuke Nishio, Stephanie Nadolny, Sean Schemmel, Masako Nozawa, Christopher Sabat, Ryûsei Nakao, Jôji Yanami, Linda Young, Sonny Strait, Dale Kelly  See more', 'Language': 'Japanese (Dolby Digital 1.0), English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '3343442', 'Director': 'Daisuke Nishio', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Subtitled, Surround Sound', 'Run time': '13 hours and 50 minutes', 'Release date': 'September 18, 2007', 'Actors': 'Toshio Furukawa, Ryô Horikawa, Dale Kelly, Stephanie Nadolny, Ryûsei Nakao', 'Subtitles': 'English', 'Studio': 'Funimation', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: I am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the Infamous Frieza! I love the guy personally. He is so egotistical and cold! A ruthless fighter like non seen before! And For the first time a Super Saiyan is born on screen! This revolutionized the series into a whole new level of hardcore action!\nReview Title: GREAT SAGA!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus\nReview Date: 2013/08/12\nStore: Goran Visnjic  (Actor),     Robert Dornhelm  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Color, Widescreen, AC-3', 'Contributor': 'Robert Dornhelm, Goran Visnjic', 'Language': 'English', 'Number Of Discs': '1'}\nReview Text: I wont say this  movie is terrible but its not very good. I found it rather boring and lacking in action for a movie about a Gladiator. The action is crap and the movie jumps along too fast and lacks  details crucial to the story of  Spartacus. Honestly I'd say just rent or skip it. Its not worth buying. If you want Spartacus go with the Star TV series (as long as you don't mind nudity). Neither is 100% accurate but at least The TV series has action and suspense and a  lot  of moments where  you get blind  sided with something you may  not  have seen coming. All and  all this  movie left me more  than a little Depressed as I liked the  older  Spartacus movie as  well. This one  just didn't live  up to expectations. Hope  this  helps.\nReview Title: Meh\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Predator (2018)\nReview Date: 2020/04/03\nStore: Boyd Holbrook  (Actor),     Trevante Rhodes  (Actor),     Shane Black  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Predators, The Most Dangerous Hunters In The Universe, Have Been Genetically Upgrading Themselves Using Dna From Other Species To Be Stronger, Smarter And More Lethal Than Ever Before. When A Young Boy Accidentally Activates A Mysterious Alien Device And Becomes The Target Of These Upgraded Predators, Only His Father And The Most Unlikely Band Of Crazy Ex-Soldiers Can Save Him - And The Human Race From Obliteration. From The Director Of Iron Man 3 And The Nice Guys Comes The Action Thriller That Takes The Original 80S Cult Classic To The Next Level. With Trevante Rhodes, Keegan-Michael Key, Sterling K. Brown; co-written and directed by Shane Black (who co-starred in the original \"Predator\"). 107 min. Widescreen.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Horror', 'Format': 'Subtitled', 'Contributor': 'Olivia Munn, Alfie Allen, Niall Matter, Mike Dopud, Javier Lacroix, Trevante Rhodes, Augusto Aguilera, Thomas Jane, Jake Busey, Yvonne Strahovski, Brian A. Prince, Boyd Holbrook, Shane Black, Jacob Tremblay, Sterling K. Brown, Keegan-Michael KeyOlivia Munn, Alfie Allen, Niall Matter, Mike Dopud, Javier Lacroix, Trevante Rhodes, Augusto Aguilera, Thomas Jane, Jake Busey, Yvonne Strahovski, Brian A. Prince, Boyd Holbrook, Shane Black, Jacob Tremblay, Sterling K. Brown, Keegan-Michael Key  See more', 'Language': 'English, French, Spanish', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Shane Black', 'Media Format': 'Subtitled', 'Release date': 'December 18, 2018', 'Actors': 'Boyd Holbrook, Trevante Rhodes, Jacob Tremblay, Keegan-Michael Key, Olivia Munn', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '2'}\nReview Text: The writer and director are a joke. This movie is to Predator what Jason X was to Friday The 13th franchise. This movie completely breaks the established lore at every conceivable turn for no reason whatsoever. It's not even worth the huge write up on why this movie is so absolutely asinine so just gonna have to take my word for it. I'll give you the gist of the issues. Predators are no longer hunters, they never had honor, they dont hunt for trophies, they cloak themselves by swallowing a pill, they collect spinal fluid to \"improve\" themselves, and this movie has a dumb political message for global warming. My God man, you can't make this crap up. Oh and some kid is smart enough to know how predator gear works and can use it. LOL what? Also tons of jokes about the male genitalia for no reason at all. Why? Just why? Who thought this was a good idea? Chase them out of Hollywood, they have no business in film.\nReview Title: Tries to be funny and it's not.\nRating: 1.0\n--------------------------------------------------",
  "reference": "Italian Fascism in Color\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['This is the untold story of how Mussolini seized power through systematic intimidation, violence and murder.']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'SHA-DV995', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 11, 2007', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Shanchie Records', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI really enjoyed this documentary, and it is a product I recommend. The color isnt bad, all things considered and it allows you to look at the dictator in a new light. I found that their was human emotion in it as well and a greater view for understanding what took plae at this time. I found it fascinating really, to look at the developement and views of the Italian people at this time. A job well done, truely!\nA very good documentary\nAvatar (Original Theatrical Edition)\nSam Worthington  (Actor),     Zoe Saldana  (Actor),     James Cameron  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', \"A reluctant hero. An epic journey. A choice between the life he left behind and the incredible new world he's learned to call home. James Cameron's Avatar - the greatest adventure of all time.\", 'Amazon.com', 'After 12 years of thinking about it (and waiting for movie technology to catch up with his visions), James Cameron followed up his unsinkable', 'Titanic', 'with', 'Avatar', ', a sci-fi epic meant to trump all previous sci-fi epics. Set in the future on a distant planet,', 'Avatar', \"spins a simple little parable about greedy colonizers (that would be mankind) messing up the lush tribal world of Pandora. A paraplegic Marine named Jake (Sam Worthington) acts through a 9-foot-tall avatar that allows him to roam the planet and pass as one of the Na'vi, the blue-skinned, large-eyed native people who would very much like to live their peaceful lives without the interference of the visitors. Although he's supposed to be gathering intel for the badass general (Stephen Lang) who'd like to lay waste to the planet and its inhabitants, Jake naturally begins to take a liking to the Na'vi, especially the feisty Neytiri (Zoë Saldana, whose entire performance, recorded by Cameron's complicated motion-capture system, exists as a digitally rendered Na'vi). The movie uses state-of-the-art 3D technology to plunge the viewer deep into Cameron's crazy toy box of planetary ecosystems and high-tech machinery. Maybe it's the fact that Cameron seems torn between his two loves--awesome destructive gizmos and flower-power message mongering--that makes\", 'Avatar', '\\'s pursuit of its point ultimately uncertain. That, and the fact that Cameron\\'s dialogue continues to clunk badly. If you\\'re won over by the movie\\'s trippy new world, the characters will be forgivable as broad, useful archetypes rather than standard-issue stereotypes, and you might be able to overlook the unsurprising central plot. (The overextended \"take that, Michael Bay\" final battle sequences could tax even Cameron enthusiasts, however.) It doesn\\'t measure up to the hype (what could?) yet', 'Avatar', 'frequently hits a giddy delirium all its own. The film itself is our Pandora, a sensation-saturated universe only the movies could create.', '--Robert Horton']\n{'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Stephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Sam WorthingtonStephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Sam Worthington  See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': 'MFR024543656067#VG', 'Director': 'James Cameron', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Release date': 'April 22, 2010', 'Actors': 'Sam Worthington, Zoe Saldana, Sigourney Weaver, Michelle Rodriguez, Stephen Lang', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Writers': 'James Cameron', 'Number of discs': '1'}\nThis movies was the greatest I have seen in a long time. Every aspect about it is cool, from the action, to the romance, to the drama, to the digital effect, to sooo much more. Brilliantly directed too! I keep hearing about this first release not having all the features, and my motto \"Me ne frego\", or I dont give a damn. this is a terrific movie! One for the ages, and at the price is fine by me. ALSO really? Do you REALLY want to wait for some bonus features that your gonna watch one or twice? Get this edition then when the third edition comes out grab that. Dont even bother with it. This IS the movie that was in theaters, what won crowds over globaly! Get it, you wont regret it!\nWorth the Money, and the wait.\nThe Wolfman (2010)\nAnthony Hopkins  (Actor),     Benicio Del Toro  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Academy Award® winners Anthony Hopkins (The Silence of the Lambs) and Benicio Del Toro (Traffic) tear up the screen in this action-packed thriller. Lawrence Talbot (Del Toro) is lured back to his family estate to investigate the savage murder of his brother by a bloodthirsty beast. There, Talbot must confront his childhood demons, his estranged father (Hopkins), his brother’s grieving fiancée (Emily Blunt, The Devil Wears Prada) and a suspicious Scotland Yard Inspector (Hugo Weaving, The Matrix Trilogy). When Talbot is bitten by the creature, he becomes eternally cursed and soon discovers a fate far worse than death. Inspired by the classic Universal film that launched a legacy of horror, The Wolfman brings the myth of a cursed man back to its iconic origins.', 'Amazon.com', 'The mist rising over the moors feels right, and so does the slant of moonlight coming over a Victorian village-scape. And if the moon is full, this must be', 'The Wolfman', \", Universal's 2010 attempt to revive one of the crown jewels in its deservedly legendary horror stable. Benicio Del Toro takes on the old Lon Chaney Jr. role of Lawrence Talbot, an American visitor to his ancestral home in England. Talbot's brother has recently been torn to bits by a beast in the forest, leaving behind a grieving fiancée (Emily Blunt) and a not-visibly-grieving father (Anthony Hopkins). This central situation seems drained of blood even before the full-moon transfigurations begin to bloom, and Del Toro's Talbot--an actor by trade, which raises interesting possibilities for a story of a man divided by different personalities--is mystifyingly blank. The intriguing casting of Del Toro (what an opportunity for a cool werewolf!) comes to naught as Talbot seems to languish on the periphery of his own story. Hugo Weaving tries to generate some interest as the police inspector on the case, but he too is defeated by the combination of mechanical storytelling and bland computer-generated werewolves. The script skips from one exposition scene to the next, but nothing registers long enough to create character, tension, or the slimmest desire to see what happens in the next scene. Every once in a while director Joe Johnston (\", 'Jumanji', ') finds a grand staircase or CGI fog that conjures up the atmosphere of the old Universal horror classics, but otherwise this is a clueless affair--not as bad as', 'Van Helsing', ', but flat-out dull. The movie can\\'t even find a way to get the old Gypsy lady (Geraldine Chaplin stepping into Maria Ouspenskaya\\'s tiny shoes) to deliver a proper recitation of screenwriter Curt Siodmak\\'s great \"Even a man who is pure in heart\" doggerel from the 1941 film. Instead, it\\'s thrown away in a voice-over at the beginning--one hairy way to start the movie.', '--Robert Horton']\n{'Genre': 'Horror, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, Dolby, Dubbed, NTSC', 'Contributor': 'Emily Blunt, Benicio Del Toro, Anthony Hopkins', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': 'MFR025195038430#VG', 'Media Format': 'Multiple Formats, Color, Widescreen, Dolby, Dubbed, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'January 16, 2011', 'Actors': 'Anthony Hopkins, Benicio Del Toro, Emily Blunt', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPeople keep going on about how much this movie \"sucked\". Well I fail to see their reasoning. This movie was full of action, the main actress was pretty cute ;), the plot was cool, the only things holding me back from giving it a 5 star were reasons as followed, dim lighting and hard to see some scenes, special effects weren't exactly the greatest (though not bad), and even though they made the wolves look more like the original wolfman, I still think a more wolf kinda look (like Van Helsing look) would have been prefered in my book, although I do realize it takes away from the whole WolfMAN thing, and I got that and all but I still prefer the werewolf look in this fashion. I just think it's cooler. That said this was pretty good. Oh, and the one other complaint would be that everything happened a little too fast for my taste as far as scene to scene goes. But ya, good movie!\nQuit The Hate!\nDragon Ball Z: Season 1\nShigeru Chiba  (Actor),     Justin Cook  (Actor),     Daisuke Nishio  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Anime\n['Product Description', 'The Saiyans are coming! The last survivors of a cruel, warrior race, these ruthless villains have carved a path of destruction across the galaxy, and now they have set their sights on Earth. They will stop at nothing until they have the wish-granting powers of the seven magic Dragon Balls for their very own.', \"With the fate of his family, friends and the entire human race hanging in the balance, Goku, the Earth's greatest hero, must rise to meet the approaching threat. As he prepares for the fight of his life, Goku embarks on an epic journey that will take him to other worlds, pit him against new and old enemies alike, and force him to confront the dark secrets of his own past. At the end of his path, the most powerful opponent he has ever faced awaits - the evil Saiyan Prince Vegeta!\", 'This Dragon Ball Season Set is the definitive collection!', 'Digitally re-mastered in High Definition', 'Digitally re-mastered in High Definition', 'Transferred from the original Japanese film', 'Transferred from the original Japanese film', 'The complete season one - contains 39 episodes on 5 discs', 'The complete season one - contains 39 episodes on 5 discs', 'Over 900 minutes of action', 'Over 900 minutes of action', 'Revised English dialogue and original Japanese music  Extra features include: Footage on the re-mastering  The ultimate Dragon Ball Z - Collect them all!', 'Revised English dialogue and original Japanese music', 'Extra features include: Footage on the re-mastering', 'The ultimate Dragon Ball Z - Collect them all!', 'Amazon.com', 'One of the most popular franchises in anime history,', 'Dragon Ball', 'began in 1984 as a manga by Akira Toriyama in', 'Shonen Jump', '.', 'Dragon Ball Z', '(1989), the second TV adaptation, is the most beloved: it ran for 291 episodes--more than', 'Dragon Ball', '(1986) and', 'Dragon Ball GT', \"(1996) combined. Over the years, the program has introduced countless boys to the world of Japanese animation. The first season re-introduces the main characters and sets up a new threat. Goku learns he's not an Earthling, but a Saiyan from the planet Vegeta. Only three other Saiyans survive, all of them extremely powerful and destructive. Goku destroys Raditz with the help of Piccolo, but dies in the process. He spends much of the season training in the Other World with King Kai. Piccolo takes over training Goku's son Gohan, anticipating he will have to face the remaining Saiyans, Nappa and Vegeta. These episodes set the pattern for the combination of martial arts training, fantasy-battles and slapstick comedy that make the series so popular. The storyline rambles, with lots of digressions, repeats, and false endings--none of which bother the fans. Although\", 'Dragon Ball Z', 'has been released previously in the US, Funimation pulled out all the stops for this edition. The entire series has been remastered from the original prints, and the Japanese language track is included for the first time. (Goku and Krillin have higher-pitched, younger voices than they do in the American dub.) For', 'Dragon Ball Z', 'fans, this version clearly supercedes all previous ones. (Rated TV PG. suitable for ages 8 and older: violence; minor incidents of risqué and toilet humor, ethnic stereotyping and alcohol use)', '--Charles Solomon']\n{'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.1 x 7.4 x 5.5 inches; 2.72 Ounces', 'Item model number': '1-4210-0004-0', 'Director': 'Daisuke Nishio', 'Media Format': 'Widescreen, Color, NTSC, Subtitled', 'Run time': '15 hours and 25 minutes', 'Release date': 'February 6, 2007', 'Actors': 'Shigeru Chiba, Justin Cook, Cynthia Cranz, Toshio Furukawa, Kyle Hebert', 'Subtitles': 'English', 'Language': 'Japanese (Dolby Digital 1.0), English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Stereo)', 'Studio': 'Funimation', 'Number of discs': '6'}\nI am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the coolest race of Humanoids....THE SAIYANS! Radditz, Vegeta, Nappa, you just cant go wrong their!\nGreat Saga!\nDragon Ball Z - Season 2 (Namek and Captain Ginyu Sagas)\nSean Schemmel  (Actor),     Christopher Sabat  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Boxed Sets, Anime\n['Product Description', \"Click Here for Trailer Having suffered heavy losses in the battle with the Saiyans, and with Goku still recovering from his injuries, the remaining Z-Fighters must embark on a perilous journey to Planet Namek in search of the Namekian Dragon Balls. Unbeknownst to them, however, a powerful new enemy has set his sights on the same prize - the ruthless tyrant Freiza! Beset on all sides by danger, Goah, Krillin, and Bulma must fight for their lives as they struggle to keep the Dragon Balls from falling to evil hands. Meanwhile, Goku races against time to join his friends in their quest, but waiting for him on Planet Namek is an army of the most powerful villains the universe has ever known, led by Frieza's most elite fighting unit - the unstoppable Ginyu Force!\", 'Amazon.com', 'The second season of the wildly popular', 'Dragon Ball Z', 'comprises the \"Namek\" and \"Captain Ginyu\" sagas. Gohan, Krillin, and Bulma travel to the planet Namek to find an even more powerful set of Dragon Balls that can restore the lives of Tenshinhan, Yamucha, Chaozu and Piccolo, who were killed by Vegeta during the first season. (Their souls continue to train with King Kai in the Other World.) All is not well on Namek: the arch-villain Frieza, who looks and sounds a bit like Truman Capote, also desires the Dragon Balls. If he uses them to obtain eternal life, he\\'ll rule the universe forever. With a cadre of lieutenants that includes Vegeta, he slaughters the Namekians to gain the supernatural orbs. After his injuries have been healed by a magic senzu bean, Goku heads to Namek. En route, he trains at 100 gravities, raising his powers enormously. Vegeta believes Goku may be the legendary Super Saiyan that appears once a millennium--except he lacks the requisite love of battle. This version of Goku is less aggressive, and he uncharacteristically uses his brain (never his greatest asset) to defeat Ginyu, Frieza\\'s second-in-command. Unlike', 'Season 1--Vegeta Saga', ',', 'Season 2', \"ends on a cliff-hanger. Skeptics may find Goku's adventures needlessly protracted, over the top, and even silly. But for millions of boys, they provide the special blend of comradeship, martial arts training, and take-no-prisoners battles they love. The newly remastered edition includes the original Japanese dialogue for the first time. (Rated TV PG. suitable for ages 8 and older: violence, minor risqué humor, brief nudity, tobacco and alcohol use)\", '--Charles Solomon']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Animated, Box set, Color, NTSC', 'Contributor': 'Christopher Sabat, Sean Schemmel', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Japanese (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.6 Ounces', 'Item model number': '1-4210-0006-7', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC', 'Run time': '13 hours and 55 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Sean Schemmel, Christopher Sabat', 'Subtitles': 'English', 'Studio': 'Funimation', 'Number of discs': '6'}\nI am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the Namekians who are cool and you get some flashbacks of the past! You see Dodoria, Zarbon, and one of my favorite villains in the series, Frieza! You also get a peek at the Ginyu Force which brings a refreshing sense of humor to the story along with a roster of villains!\nGREAT SAGA!\nDragon Ball Z - Season 3 (Frieza Saga)\nToshio Furukawa  (Actor),     Ryô Horikawa  (Actor),     Daisuke Nishio  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"This popular anime series follows the skilled Warrior Goku and his band of Z-Fighters as they search for the Powerful Dragon Balls. The adventures continue with every episode from the series' third season. Director Daisuke Nishio Special Features: Audio: Dolby Digital 5.1 - Japanese, English Stereo - Japanese, English Subtitles - English - Optional Interactive Features: Additional interactive features - Marathon play runtime: 790 Minutes year of release: 1989.\", 'Amazon.com', 'The third season of the popular', 'shonen', \"(boy's) show\", 'Dragon Ball Z', \"continues the adventures of Goku and Gohan on Namek, Piccolo's home planet. Goku, who has been in a regeneration tank since the end of season 2, recovers just in time to challenge the sniggering Frieza, one of the most grating villains in anime history. Having defeated Gohan, Krillin, Vegeta, and Piccolo, Frieza takes on Goku in a protracted duel. When he begins to doubt his ability to overcome Goku, Frieza destroys the core of Namek, ensuring it will explode in a matter of minutes. Enraged by the death of Krillin and so many others, Goku transforms into the one thing Frieza fears: a Super Saiyan, a legendary warrior who appears once every 1,000 years. As the seconds tick away, the two most powerful individuals in the universe duke it out. While they're beating the\", 'soba', 'out of each other, King Kai hatches a plan to use the Dragon Balls of Earth and Namek to ensure a happy ending. As the battle between Goku and Frieza intensifies, the kicks and punches fly, producing titanic explosions. But the duel goes on for more than 20 episodes: With only a limited budget and crude special-effects techniques at their disposal, the filmmakers have to recycle footage endlessly.', 'Dragon Ball Z: Season 3', 'is more entertaining when the viewer allows a few days to elapse between episodes, rather than indulging in a Super Saiyan marathon. (Rated TV PG. suitable for ages 8 and older: violence, brief nudity, tobacco use, ethnic stereotypes)', '--Charles Solomon']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Subtitled, Surround Sound', 'Contributor': 'Mayumi Tanaka, Ryô Horikawa, Toshio Furukawa, Daisuke Nishio, Stephanie Nadolny, Sean Schemmel, Masako Nozawa, Christopher Sabat, Ryûsei Nakao, Jôji Yanami, Linda Young, Sonny Strait, Dale KellyMayumi Tanaka, Ryô Horikawa, Toshio Furukawa, Daisuke Nishio, Stephanie Nadolny, Sean Schemmel, Masako Nozawa, Christopher Sabat, Ryûsei Nakao, Jôji Yanami, Linda Young, Sonny Strait, Dale Kelly  See more', 'Language': 'Japanese (Dolby Digital 1.0), English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '3343442', 'Director': 'Daisuke Nishio', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Subtitled, Surround Sound', 'Run time': '13 hours and 50 minutes', 'Release date': 'September 18, 2007', 'Actors': 'Toshio Furukawa, Ryô Horikawa, Dale Kelly, Stephanie Nadolny, Ryûsei Nakao', 'Subtitles': 'English', 'Studio': 'Funimation', 'Country of Origin': 'USA', 'Number of discs': '6'}\nI am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the Infamous Frieza! I love the guy personally. He is so egotistical and cold! A ruthless fighter like non seen before! And For the first time a Super Saiyan is born on screen! This revolutionized the series into a whole new level of hardcore action!\nGREAT SAGA!\nSpartacus\nGoran Visnjic  (Actor),     Robert Dornhelm  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Color, Widescreen, AC-3', 'Contributor': 'Robert Dornhelm, Goran Visnjic', 'Language': 'English', 'Number Of Discs': '1'}\nI wont say this  movie is terrible but its not very good. I found it rather boring and lacking in action for a movie about a Gladiator. The action is crap and the movie jumps along too fast and lacks  details crucial to the story of  Spartacus. Honestly I'd say just rent or skip it. Its not worth buying. If you want Spartacus go with the Star TV series (as long as you don't mind nudity). Neither is 100% accurate but at least The TV series has action and suspense and a  lot  of moments where  you get blind  sided with something you may  not  have seen coming. All and  all this  movie left me more  than a little Depressed as I liked the  older  Spartacus movie as  well. This one  just didn't live  up to expectations. Hope  this  helps.\nMeh\nThe Predator (2018)\nBoyd Holbrook  (Actor),     Trevante Rhodes  (Actor),     Shane Black  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Predators, The Most Dangerous Hunters In The Universe, Have Been Genetically Upgrading Themselves Using Dna From Other Species To Be Stronger, Smarter And More Lethal Than Ever Before. When A Young Boy Accidentally Activates A Mysterious Alien Device And Becomes The Target Of These Upgraded Predators, Only His Father And The Most Unlikely Band Of Crazy Ex-Soldiers Can Save Him - And The Human Race From Obliteration. From The Director Of Iron Man 3 And The Nice Guys Comes The Action Thriller That Takes The Original 80S Cult Classic To The Next Level. With Trevante Rhodes, Keegan-Michael Key, Sterling K. Brown; co-written and directed by Shane Black (who co-starred in the original \"Predator\"). 107 min. Widescreen.']\n{'Genre': 'Science Fiction & Fantasy, Horror', 'Format': 'Subtitled', 'Contributor': 'Olivia Munn, Alfie Allen, Niall Matter, Mike Dopud, Javier Lacroix, Trevante Rhodes, Augusto Aguilera, Thomas Jane, Jake Busey, Yvonne Strahovski, Brian A. Prince, Boyd Holbrook, Shane Black, Jacob Tremblay, Sterling K. Brown, Keegan-Michael KeyOlivia Munn, Alfie Allen, Niall Matter, Mike Dopud, Javier Lacroix, Trevante Rhodes, Augusto Aguilera, Thomas Jane, Jake Busey, Yvonne Strahovski, Brian A. Prince, Boyd Holbrook, Shane Black, Jacob Tremblay, Sterling K. Brown, Keegan-Michael Key  See more', 'Language': 'English, French, Spanish', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Shane Black', 'Media Format': 'Subtitled', 'Release date': 'December 18, 2018', 'Actors': 'Boyd Holbrook, Trevante Rhodes, Jacob Tremblay, Keegan-Michael Key, Olivia Munn', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '2'}\nThe writer and director are a joke. This movie is to Predator what Jason X was to Friday The 13th franchise. This movie completely breaks the established lore at every conceivable turn for no reason whatsoever. It's not even worth the huge write up on why this movie is so absolutely asinine so just gonna have to take my word for it. I'll give you the gist of the issues. Predators are no longer hunters, they never had honor, they dont hunt for trophies, they cloak themselves by swallowing a pill, they collect spinal fluid to \"improve\" themselves, and this movie has a dumb political message for global warming. My God man, you can't make this crap up. Oh and some kid is smart enough to know how predator gear works and can use it. LOL what? Also tons of jokes about the male genitalia for no reason at all. Why? Just why? Who thought this was a good idea? Chase them out of Hollywood, they have no business in film.\nTries to be funny and it's not.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Italian Fascism in Color\nReview Date: 2009/12/06\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['This is the untold story of how Mussolini seized power through systematic intimidation, violence and murder.']\nAverage Rating: 4.0\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'SHA-DV995', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 11, 2007', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Shanchie Records', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I really enjoyed this documentary, and it is a product I recommend. The color isnt bad, all things considered and it allows you to look at the dictator in a new light. I found that their was human emotion in it as well and a greater view for understanding what took plae at this time. I found it fascinating really, to look at the developement and views of the Italian people at this time. A job well done, truely!\nReview Title: A very good documentary\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Avatar (Original Theatrical Edition)\nReview Date: 2010/04/20\nStore: Sam Worthington  (Actor),     Zoe Saldana  (Actor),     James Cameron  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', \"A reluctant hero. An epic journey. A choice between the life he left behind and the incredible new world he's learned to call home. James Cameron's Avatar - the greatest adventure of all time.\", 'Amazon.com', 'After 12 years of thinking about it (and waiting for movie technology to catch up with his visions), James Cameron followed up his unsinkable', 'Titanic', 'with', 'Avatar', ', a sci-fi epic meant to trump all previous sci-fi epics. Set in the future on a distant planet,', 'Avatar', \"spins a simple little parable about greedy colonizers (that would be mankind) messing up the lush tribal world of Pandora. A paraplegic Marine named Jake (Sam Worthington) acts through a 9-foot-tall avatar that allows him to roam the planet and pass as one of the Na'vi, the blue-skinned, large-eyed native people who would very much like to live their peaceful lives without the interference of the visitors. Although he's supposed to be gathering intel for the badass general (Stephen Lang) who'd like to lay waste to the planet and its inhabitants, Jake naturally begins to take a liking to the Na'vi, especially the feisty Neytiri (Zoë Saldana, whose entire performance, recorded by Cameron's complicated motion-capture system, exists as a digitally rendered Na'vi). The movie uses state-of-the-art 3D technology to plunge the viewer deep into Cameron's crazy toy box of planetary ecosystems and high-tech machinery. Maybe it's the fact that Cameron seems torn between his two loves--awesome destructive gizmos and flower-power message mongering--that makes\", 'Avatar', '\\'s pursuit of its point ultimately uncertain. That, and the fact that Cameron\\'s dialogue continues to clunk badly. If you\\'re won over by the movie\\'s trippy new world, the characters will be forgivable as broad, useful archetypes rather than standard-issue stereotypes, and you might be able to overlook the unsurprising central plot. (The overextended \"take that, Michael Bay\" final battle sequences could tax even Cameron enthusiasts, however.) It doesn\\'t measure up to the hype (what could?) yet', 'Avatar', 'frequently hits a giddy delirium all its own. The film itself is our Pandora, a sensation-saturated universe only the movies could create.', '--Robert Horton']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Stephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Sam WorthingtonStephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Sam Worthington  See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': 'MFR024543656067#VG', 'Director': 'James Cameron', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Release date': 'April 22, 2010', 'Actors': 'Sam Worthington, Zoe Saldana, Sigourney Weaver, Michelle Rodriguez, Stephen Lang', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Writers': 'James Cameron', 'Number of discs': '1'}\nReview Text: This movies was the greatest I have seen in a long time. Every aspect about it is cool, from the action, to the romance, to the drama, to the digital effect, to sooo much more. Brilliantly directed too! I keep hearing about this first release not having all the features, and my motto \"Me ne frego\", or I dont give a damn. this is a terrific movie! One for the ages, and at the price is fine by me. ALSO really? Do you REALLY want to wait for some bonus features that your gonna watch one or twice? Get this edition then when the third edition comes out grab that. Dont even bother with it. This IS the movie that was in theaters, what won crowds over globaly! Get it, you wont regret it!\nReview Title: Worth the Money, and the wait.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Wolfman (2010)\nReview Date: 2010/12/05\nStore: Anthony Hopkins  (Actor),     Benicio Del Toro  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Academy Award® winners Anthony Hopkins (The Silence of the Lambs) and Benicio Del Toro (Traffic) tear up the screen in this action-packed thriller. Lawrence Talbot (Del Toro) is lured back to his family estate to investigate the savage murder of his brother by a bloodthirsty beast. There, Talbot must confront his childhood demons, his estranged father (Hopkins), his brother’s grieving fiancée (Emily Blunt, The Devil Wears Prada) and a suspicious Scotland Yard Inspector (Hugo Weaving, The Matrix Trilogy). When Talbot is bitten by the creature, he becomes eternally cursed and soon discovers a fate far worse than death. Inspired by the classic Universal film that launched a legacy of horror, The Wolfman brings the myth of a cursed man back to its iconic origins.', 'Amazon.com', 'The mist rising over the moors feels right, and so does the slant of moonlight coming over a Victorian village-scape. And if the moon is full, this must be', 'The Wolfman', \", Universal's 2010 attempt to revive one of the crown jewels in its deservedly legendary horror stable. Benicio Del Toro takes on the old Lon Chaney Jr. role of Lawrence Talbot, an American visitor to his ancestral home in England. Talbot's brother has recently been torn to bits by a beast in the forest, leaving behind a grieving fiancée (Emily Blunt) and a not-visibly-grieving father (Anthony Hopkins). This central situation seems drained of blood even before the full-moon transfigurations begin to bloom, and Del Toro's Talbot--an actor by trade, which raises interesting possibilities for a story of a man divided by different personalities--is mystifyingly blank. The intriguing casting of Del Toro (what an opportunity for a cool werewolf!) comes to naught as Talbot seems to languish on the periphery of his own story. Hugo Weaving tries to generate some interest as the police inspector on the case, but he too is defeated by the combination of mechanical storytelling and bland computer-generated werewolves. The script skips from one exposition scene to the next, but nothing registers long enough to create character, tension, or the slimmest desire to see what happens in the next scene. Every once in a while director Joe Johnston (\", 'Jumanji', ') finds a grand staircase or CGI fog that conjures up the atmosphere of the old Universal horror classics, but otherwise this is a clueless affair--not as bad as', 'Van Helsing', ', but flat-out dull. The movie can\\'t even find a way to get the old Gypsy lady (Geraldine Chaplin stepping into Maria Ouspenskaya\\'s tiny shoes) to deliver a proper recitation of screenwriter Curt Siodmak\\'s great \"Even a man who is pure in heart\" doggerel from the 1941 film. Instead, it\\'s thrown away in a voice-over at the beginning--one hairy way to start the movie.', '--Robert Horton']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Horror, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, Dolby, Dubbed, NTSC', 'Contributor': 'Emily Blunt, Benicio Del Toro, Anthony Hopkins', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': 'MFR025195038430#VG', 'Media Format': 'Multiple Formats, Color, Widescreen, Dolby, Dubbed, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'January 16, 2011', 'Actors': 'Anthony Hopkins, Benicio Del Toro, Emily Blunt', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: People keep going on about how much this movie \"sucked\". Well I fail to see their reasoning. This movie was full of action, the main actress was pretty cute ;), the plot was cool, the only things holding me back from giving it a 5 star were reasons as followed, dim lighting and hard to see some scenes, special effects weren't exactly the greatest (though not bad), and even though they made the wolves look more like the original wolfman, I still think a more wolf kinda look (like Van Helsing look) would have been prefered in my book, although I do realize it takes away from the whole WolfMAN thing, and I got that and all but I still prefer the werewolf look in this fashion. I just think it's cooler. That said this was pretty good. Oh, and the one other complaint would be that everything happened a little too fast for my taste as far as scene to scene goes. But ya, good movie!\nReview Title: Quit The Hate!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dragon Ball Z: Season 1\nReview Date: 2011/07/18\nStore: Shigeru Chiba  (Actor),     Justin Cook  (Actor),     Daisuke Nishio  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Anime\nProduct Description: ['Product Description', 'The Saiyans are coming! The last survivors of a cruel, warrior race, these ruthless villains have carved a path of destruction across the galaxy, and now they have set their sights on Earth. They will stop at nothing until they have the wish-granting powers of the seven magic Dragon Balls for their very own.', \"With the fate of his family, friends and the entire human race hanging in the balance, Goku, the Earth's greatest hero, must rise to meet the approaching threat. As he prepares for the fight of his life, Goku embarks on an epic journey that will take him to other worlds, pit him against new and old enemies alike, and force him to confront the dark secrets of his own past. At the end of his path, the most powerful opponent he has ever faced awaits - the evil Saiyan Prince Vegeta!\", 'This Dragon Ball Season Set is the definitive collection!', 'Digitally re-mastered in High Definition', 'Digitally re-mastered in High Definition', 'Transferred from the original Japanese film', 'Transferred from the original Japanese film', 'The complete season one - contains 39 episodes on 5 discs', 'The complete season one - contains 39 episodes on 5 discs', 'Over 900 minutes of action', 'Over 900 minutes of action', 'Revised English dialogue and original Japanese music  Extra features include: Footage on the re-mastering  The ultimate Dragon Ball Z - Collect them all!', 'Revised English dialogue and original Japanese music', 'Extra features include: Footage on the re-mastering', 'The ultimate Dragon Ball Z - Collect them all!', 'Amazon.com', 'One of the most popular franchises in anime history,', 'Dragon Ball', 'began in 1984 as a manga by Akira Toriyama in', 'Shonen Jump', '.', 'Dragon Ball Z', '(1989), the second TV adaptation, is the most beloved: it ran for 291 episodes--more than', 'Dragon Ball', '(1986) and', 'Dragon Ball GT', \"(1996) combined. Over the years, the program has introduced countless boys to the world of Japanese animation. The first season re-introduces the main characters and sets up a new threat. Goku learns he's not an Earthling, but a Saiyan from the planet Vegeta. Only three other Saiyans survive, all of them extremely powerful and destructive. Goku destroys Raditz with the help of Piccolo, but dies in the process. He spends much of the season training in the Other World with King Kai. Piccolo takes over training Goku's son Gohan, anticipating he will have to face the remaining Saiyans, Nappa and Vegeta. These episodes set the pattern for the combination of martial arts training, fantasy-battles and slapstick comedy that make the series so popular. The storyline rambles, with lots of digressions, repeats, and false endings--none of which bother the fans. Although\", 'Dragon Ball Z', 'has been released previously in the US, Funimation pulled out all the stops for this edition. The entire series has been remastered from the original prints, and the Japanese language track is included for the first time. (Goku and Krillin have higher-pitched, younger voices than they do in the American dub.) For', 'Dragon Ball Z', 'fans, this version clearly supercedes all previous ones. (Rated TV PG. suitable for ages 8 and older: violence; minor incidents of risqué and toilet humor, ethnic stereotyping and alcohol use)', '--Charles Solomon']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.1 x 7.4 x 5.5 inches; 2.72 Ounces', 'Item model number': '1-4210-0004-0', 'Director': 'Daisuke Nishio', 'Media Format': 'Widescreen, Color, NTSC, Subtitled', 'Run time': '15 hours and 25 minutes', 'Release date': 'February 6, 2007', 'Actors': 'Shigeru Chiba, Justin Cook, Cynthia Cranz, Toshio Furukawa, Kyle Hebert', 'Subtitles': 'English', 'Language': 'Japanese (Dolby Digital 1.0), English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Stereo)', 'Studio': 'Funimation', 'Number of discs': '6'}\nReview Text: I am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the coolest race of Humanoids....THE SAIYANS! Radditz, Vegeta, Nappa, you just cant go wrong their!\nReview Title: Great Saga!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dragon Ball Z - Season 2 (Namek and Captain Ginyu Sagas)\nReview Date: 2011/07/18\nStore: Sean Schemmel  (Actor),     Christopher Sabat  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Boxed Sets, Anime\nProduct Description: ['Product Description', \"Click Here for Trailer Having suffered heavy losses in the battle with the Saiyans, and with Goku still recovering from his injuries, the remaining Z-Fighters must embark on a perilous journey to Planet Namek in search of the Namekian Dragon Balls. Unbeknownst to them, however, a powerful new enemy has set his sights on the same prize - the ruthless tyrant Freiza! Beset on all sides by danger, Goah, Krillin, and Bulma must fight for their lives as they struggle to keep the Dragon Balls from falling to evil hands. Meanwhile, Goku races against time to join his friends in their quest, but waiting for him on Planet Namek is an army of the most powerful villains the universe has ever known, led by Frieza's most elite fighting unit - the unstoppable Ginyu Force!\", 'Amazon.com', 'The second season of the wildly popular', 'Dragon Ball Z', 'comprises the \"Namek\" and \"Captain Ginyu\" sagas. Gohan, Krillin, and Bulma travel to the planet Namek to find an even more powerful set of Dragon Balls that can restore the lives of Tenshinhan, Yamucha, Chaozu and Piccolo, who were killed by Vegeta during the first season. (Their souls continue to train with King Kai in the Other World.) All is not well on Namek: the arch-villain Frieza, who looks and sounds a bit like Truman Capote, also desires the Dragon Balls. If he uses them to obtain eternal life, he\\'ll rule the universe forever. With a cadre of lieutenants that includes Vegeta, he slaughters the Namekians to gain the supernatural orbs. After his injuries have been healed by a magic senzu bean, Goku heads to Namek. En route, he trains at 100 gravities, raising his powers enormously. Vegeta believes Goku may be the legendary Super Saiyan that appears once a millennium--except he lacks the requisite love of battle. This version of Goku is less aggressive, and he uncharacteristically uses his brain (never his greatest asset) to defeat Ginyu, Frieza\\'s second-in-command. Unlike', 'Season 1--Vegeta Saga', ',', 'Season 2', \"ends on a cliff-hanger. Skeptics may find Goku's adventures needlessly protracted, over the top, and even silly. But for millions of boys, they provide the special blend of comradeship, martial arts training, and take-no-prisoners battles they love. The newly remastered edition includes the original Japanese dialogue for the first time. (Rated TV PG. suitable for ages 8 and older: violence, minor risqué humor, brief nudity, tobacco and alcohol use)\", '--Charles Solomon']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Animated, Box set, Color, NTSC', 'Contributor': 'Christopher Sabat, Sean Schemmel', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Japanese (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.6 Ounces', 'Item model number': '1-4210-0006-7', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC', 'Run time': '13 hours and 55 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Sean Schemmel, Christopher Sabat', 'Subtitles': 'English', 'Studio': 'Funimation', 'Number of discs': '6'}\nReview Text: I am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the Namekians who are cool and you get some flashbacks of the past! You see Dodoria, Zarbon, and one of my favorite villains in the series, Frieza! You also get a peek at the Ginyu Force which brings a refreshing sense of humor to the story along with a roster of villains!\nReview Title: GREAT SAGA!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dragon Ball Z - Season 3 (Frieza Saga)\nReview Date: 2011/07/18\nStore: Toshio Furukawa  (Actor),     Ryô Horikawa  (Actor),     Daisuke Nishio  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', \"This popular anime series follows the skilled Warrior Goku and his band of Z-Fighters as they search for the Powerful Dragon Balls. The adventures continue with every episode from the series' third season. Director Daisuke Nishio Special Features: Audio: Dolby Digital 5.1 - Japanese, English Stereo - Japanese, English Subtitles - English - Optional Interactive Features: Additional interactive features - Marathon play runtime: 790 Minutes year of release: 1989.\", 'Amazon.com', 'The third season of the popular', 'shonen', \"(boy's) show\", 'Dragon Ball Z', \"continues the adventures of Goku and Gohan on Namek, Piccolo's home planet. Goku, who has been in a regeneration tank since the end of season 2, recovers just in time to challenge the sniggering Frieza, one of the most grating villains in anime history. Having defeated Gohan, Krillin, Vegeta, and Piccolo, Frieza takes on Goku in a protracted duel. When he begins to doubt his ability to overcome Goku, Frieza destroys the core of Namek, ensuring it will explode in a matter of minutes. Enraged by the death of Krillin and so many others, Goku transforms into the one thing Frieza fears: a Super Saiyan, a legendary warrior who appears once every 1,000 years. As the seconds tick away, the two most powerful individuals in the universe duke it out. While they're beating the\", 'soba', 'out of each other, King Kai hatches a plan to use the Dragon Balls of Earth and Namek to ensure a happy ending. As the battle between Goku and Frieza intensifies, the kicks and punches fly, producing titanic explosions. But the duel goes on for more than 20 episodes: With only a limited budget and crude special-effects techniques at their disposal, the filmmakers have to recycle footage endlessly.', 'Dragon Ball Z: Season 3', 'is more entertaining when the viewer allows a few days to elapse between episodes, rather than indulging in a Super Saiyan marathon. (Rated TV PG. suitable for ages 8 and older: violence, brief nudity, tobacco use, ethnic stereotypes)', '--Charles Solomon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Subtitled, Surround Sound', 'Contributor': 'Mayumi Tanaka, Ryô Horikawa, Toshio Furukawa, Daisuke Nishio, Stephanie Nadolny, Sean Schemmel, Masako Nozawa, Christopher Sabat, Ryûsei Nakao, Jôji Yanami, Linda Young, Sonny Strait, Dale KellyMayumi Tanaka, Ryô Horikawa, Toshio Furukawa, Daisuke Nishio, Stephanie Nadolny, Sean Schemmel, Masako Nozawa, Christopher Sabat, Ryûsei Nakao, Jôji Yanami, Linda Young, Sonny Strait, Dale Kelly  See more', 'Language': 'Japanese (Dolby Digital 1.0), English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '3343442', 'Director': 'Daisuke Nishio', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Subtitled, Surround Sound', 'Run time': '13 hours and 50 minutes', 'Release date': 'September 18, 2007', 'Actors': 'Toshio Furukawa, Ryô Horikawa, Dale Kelly, Stephanie Nadolny, Ryûsei Nakao', 'Subtitles': 'English', 'Studio': 'Funimation', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: I am a DBZ Veteran, been watching it since 95 and know everything their is to know about the series. I have the whole series on VHS Uncut, the DVD sets Uncut, and now I am beginning my collection on these. So far I have seasons 1-4 and this one along with the others are all great! 5 star material all the way! My only complaint with these new sets are that they are not using the music I grew up with! Perfect cell theme, Hell's Bells, etc. Other than that though these are great quality! With excellent sound effects and visual unseen in the series before! And c'mon its centered around the Infamous Frieza! I love the guy personally. He is so egotistical and cold! A ruthless fighter like non seen before! And For the first time a Super Saiyan is born on screen! This revolutionized the series into a whole new level of hardcore action!\nReview Title: GREAT SAGA!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus\nReview Date: 2013/08/12\nStore: Goran Visnjic  (Actor),     Robert Dornhelm  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Color, Widescreen, AC-3', 'Contributor': 'Robert Dornhelm, Goran Visnjic', 'Language': 'English', 'Number Of Discs': '1'}\nReview Text: I wont say this  movie is terrible but its not very good. I found it rather boring and lacking in action for a movie about a Gladiator. The action is crap and the movie jumps along too fast and lacks  details crucial to the story of  Spartacus. Honestly I'd say just rent or skip it. Its not worth buying. If you want Spartacus go with the Star TV series (as long as you don't mind nudity). Neither is 100% accurate but at least The TV series has action and suspense and a  lot  of moments where  you get blind  sided with something you may  not  have seen coming. All and  all this  movie left me more  than a little Depressed as I liked the  older  Spartacus movie as  well. This one  just didn't live  up to expectations. Hope  this  helps.\nReview Title: Meh\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Predator (2018)\nReview Date: 2020/04/03\nStore: Boyd Holbrook  (Actor),     Trevante Rhodes  (Actor),     Shane Black  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Predators, The Most Dangerous Hunters In The Universe, Have Been Genetically Upgrading Themselves Using Dna From Other Species To Be Stronger, Smarter And More Lethal Than Ever Before. When A Young Boy Accidentally Activates A Mysterious Alien Device And Becomes The Target Of These Upgraded Predators, Only His Father And The Most Unlikely Band Of Crazy Ex-Soldiers Can Save Him - And The Human Race From Obliteration. From The Director Of Iron Man 3 And The Nice Guys Comes The Action Thriller That Takes The Original 80S Cult Classic To The Next Level. With Trevante Rhodes, Keegan-Michael Key, Sterling K. Brown; co-written and directed by Shane Black (who co-starred in the original \"Predator\"). 107 min. Widescreen.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Horror', 'Format': 'Subtitled', 'Contributor': 'Olivia Munn, Alfie Allen, Niall Matter, Mike Dopud, Javier Lacroix, Trevante Rhodes, Augusto Aguilera, Thomas Jane, Jake Busey, Yvonne Strahovski, Brian A. Prince, Boyd Holbrook, Shane Black, Jacob Tremblay, Sterling K. Brown, Keegan-Michael KeyOlivia Munn, Alfie Allen, Niall Matter, Mike Dopud, Javier Lacroix, Trevante Rhodes, Augusto Aguilera, Thomas Jane, Jake Busey, Yvonne Strahovski, Brian A. Prince, Boyd Holbrook, Shane Black, Jacob Tremblay, Sterling K. Brown, Keegan-Michael Key  See more', 'Language': 'English, French, Spanish', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Shane Black', 'Media Format': 'Subtitled', 'Release date': 'December 18, 2018', 'Actors': 'Boyd Holbrook, Trevante Rhodes, Jacob Tremblay, Keegan-Michael Key, Olivia Munn', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '2'}\nReview Text: The writer and director are a joke. This movie is to Predator what Jason X was to Friday The 13th franchise. This movie completely breaks the established lore at every conceivable turn for no reason whatsoever. It's not even worth the huge write up on why this movie is so absolutely asinine so just gonna have to take my word for it. I'll give you the gist of the issues. Predators are no longer hunters, they never had honor, they dont hunt for trophies, they cloak themselves by swallowing a pill, they collect spinal fluid to \"improve\" themselves, and this movie has a dumb political message for global warming. My God man, you can't make this crap up. Oh and some kid is smart enough to know how predator gear works and can use it. LOL what? Also tons of jokes about the male genitalia for no reason at all. Why? Just why? Who thought this was a good idea? Chase them out of Hollywood, they have no business in film.\nReview Title: Tries to be funny and it's not.\nRating: 1.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe individual's purchase history reveals a strong inclination toward documentaries, action, and animated series, particularly anime. They consistently rate products highly when the narrative is engaging and the production quality is commendable, as seen with the predominantly positive ratings on science fiction and anime titles. The ratings indicate a preference for emotional depth and adventure, showcasing a fascination with historical and fantastical themes.\n\nCommon themes across purchases involve an appreciation for character-driven stories, intense action sequences, and thought-provoking plots, while displaying a specific enjoyment for detailed animation and well-crafted special effects. Price sensitivity is not a significant barrier, as they express willingness to invest in quality editions of beloved series.\n\nQuality differences influence their ratings, especially concerning special effects and storytelling coherence, as evidenced in their critical review of lower-quality productions. Their disappointment in films perceived as lacking notable entertainment value supports a discerning taste in films and TV shows.\n\nOverall, this individual demonstrates a clear preference for high-quality entertainment experiences, with a consistent investigation into genres that offer rich narratives, character development, and stunning visuals, indicating a dedicated following to franchises like classic anime and major cinematic releases.",
  "target_interaction": {
    "rating": 1.0,
    "title": "Here's my issues with the whole thing",
    "text": "So if you read the review from Benjamin K and you are a hardcore star wars fan you are likely annoyed by totally out of touch reasons they give as to why we don't like this movie. He's harping on as if the star wars universe is in the first 6 movies for us or the media that is put out on TV and theaters exclusively.  Disney \"made star wars fun again\". Excuse me? Never heard of Knights  of the Old Republic? Ever read the Dark Times Comics? Know anything about the Jedi Civil Wars (BTW there were multiple), Do you know who came up with the Rule Of Two to begin with? Do you know the names of Revan, Malak, Vitiate,  Malgus, Anjunta Pall, Freedom Nadd, Naga Sadow, Marka Ragnos, Tulak Horde, Meetra Surik, Jacen Solo, Darth Krayyt, Darth Bane, brah I got names for days you ain't never heard of because  you weren't  paying attention. We're mad they destroyed decades of established lore, rich lore. Lore they could have used to make vastly better  movies. Let's be honest the people who made these movies were passionless and not star wars fans. They had so much lore to use and used none of it. They kept drawing on the Skywalkers. Yo I'm tired of the Skywalkers and this universe is so much bigger then them. They are a tiny dot on the old timeline before  they buy out. Do you guys and gals out there know about the Infinite Empire? Way older then Sith or Jedi. Did you know the Republic was tens of thousands of years old? Before the Mandolorian how much did you know about Mando Culture? This is my point. Yall thinking our beef with this trilogy is something so small as Rey or Kylo which BTW were inferior characters to the ones they replaced thanks to Disney. You didn't partake in the games, graphics novels, books, comics, etc, etc. We, the most dedicated fans DID. It was a huge part of our lives and it was deeper than a set of movies to us. If you want just a tiny taste of how much different star wars gets from what you see on screen then just read the Revenge of the Sith Novelisation just to show how flushed out that story gets. Puts the films to absolute shame man. Try SWTOR out, Kotor too, start getting unto audiobooks as well because  I can tell you from where I sit to say you're  a star wars fan and not be able to drop names and events from the top of your head from various timelines or to not know the jedi and Sith codes and be able to easily recite them at the drop of the hat doesn't mark you as a fan but a casual and frankly that's not true Fandom. Real fans are interested in delving deeper.",
    "images": [],
    "asin": "B082PNWPZN",
    "parent_asin": "B082PNWPZN",
    "user_id": "AHSYGE3ZINZM33J76ACQX45QGUYA",
    "timestamp": "2022-08-09 10:04:45.942000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Star Wars: The Rise of Skywalker 2 Disc Blu-ray Edition | Region Free",
    "average_rating": 4.5,
    "rating_number": 57125,
    "features": [],
    "description": [
      "When it's discovered that the evil Emperor Palpatine did not die at the hands of Darth Vader, the rebels must race against the clock to find out his whereabouts. Finn and Poe lead the Resistance to put a stop to the First Order's plans to form a new Empire, while Rey anticipates her inevitable confrontation with Kylo Ren. Running Time: 142 minutes approx. 2 Disc Blu-ray Edition."
    ],
    "price": 16.44,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51hiLpS3TAL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51hiLpS3TAL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81pB15hI+aL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Rated:    NR    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "Blu-ray",
      "Action & Adventure"
    ],
    "details": {
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "0.55 x 5.31 x 6.69 inches; 2.82 Ounces",
      "Item model number": "T34100",
      "Media Format": "Blu-ray, Import",
      "Release date": "November 1, 2020",
      "Studio": "Walt Disney",
      "Country of Origin": "Australia"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}