{
  "user_id": "AE3XHOX3OBSVFXACAPNFMKSUWR5Q",
  "summary": "=== Purchase Information ===\nProduct Title: Midnight in Paris\nReview Date: 2011/12/04\nStore: Kathy Bates  (Actor),     Adrien Brody  (Actor),     Woody Allen  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"This is a romantic comedy set in Paris about a family that goes there because of business, and two young people who are engaged to be married in the fall have experiences there that change their lives. It's about a young man's great love for a city, Paris, and the illusion people have that a life different from theirs would be much better.\", 'Amazon.com', 'Paris is a city that lends itself to daydreaming, to walking the streets and imagining all sorts of magic, a quality that Woody Allen understands perfectly.', 'Midnight in Paris', \"is Allen's charming reverie about just that quality, with a screenwriter hero named Gil (Owen Wilson) who strolls the lanes of Paris with his head in the clouds and walks right into his own best fantasy. Gil is there with his materialistic fiancée (Rachel McAdams) and her unpleasant parents, taking a break from his financially rewarding but spiritually unfulfilling Hollywood career--and he can't stop thinking that all he wants to do is quit the movies, move to Paris, and write that novel he's been meaning to finish. You know, be like his heroes in the bohemian Paris of the 1920s. Sure enough, a midnight encounter draws him into the jazzy world of Scott and Zelda Fitzgerald, Picasso and Dali, and an intense Ernest Hemingway, who promises to bring Gil's manuscript to Gertrude Stein for review. Gil wakes up every morning back in the real world, but returning to his enchanted Paris proves fairly easy. In the execution of this marvelous fantasia, Allen pursues the idea that people of every generation have always romanticized a previous age as golden (this is in fact explained to us by Michael Sheen's pedantic art expert), but he also honors Gil's need to find out certain truths for himself. The movie's on the side of gentle fantasy, and it has some literary/cinematic in-jokes that call back to the kind of goofy humor Allen created in\", 'Love and Death', \".The film is guilty of the slackness that Allen's latter-day directing has sometimes shown, and the underwritten roles for McAdams and Marion Cotillard are better acted than written. But the city glows with Allen's romantic sense of it, and Owen Wilson has just the right nice-guy melancholy to put the idea over. A worthy entry in the Cinema of the Daydream.\", '--Robert Horton']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Michael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla BruniMichael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla Bruni  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'MFR043396385269#N', 'Director': 'Woody Allen', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 34 minutes', 'Release date': 'December 20, 2011', 'Actors': 'Kathy Bates, Adrien Brody, Carla Bruni, Marion Cotillard, Rachel McAdams', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Letty Aronson, Stephen Tenenbaum, Jaume Roures', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Woody Allen's love affair with Paris.<br /><br />A winner of a movie! Thanks for this one, Woody Allen, I hope you win an award and I hope this movie wins many. The first minute or two of this film, scenes of Paris with jazz music, was wonderful! (Frankly, I would have preferred classical cello music, but the visuals alone worked beautifully with their sepia overtones.)<br /><br />My favorite scene involved a surrealistic exchange among Dali, Luis Bunuel, Man Ray and our protagonist Gil where they all spoke about a rhinoceros from their individual viewpoints. (Inspired and hilarious -- loved it!) Other great philosophy came from Hemingway. And on writing, Gertrude Stein said it best.<br /><br />Brilliant cast: Kathy Bates as Gertrude Stein, Adrien Brody as Salvador Dali, Tom Hiddleston as F. Scott Fitzgerald and Carla Bruni as museum guide. The part of Owen Wilson would most likely have been played by Woody Allen himself if he had been slightly younger, but Wilson does his best to affect Allen's mannerisms.<br /><br />Paris IS a most beautiful city. I've walked much of Paris in the rain and I agree with one premise of this movie: rain enhances the beauty of Paris. (One of my most invigorating days, ever, was sitting on the top level of an open-air tour bus, in the rain, umbrella open, soaring around Paris from one arrondissement to another.)<br /><br />This is a movie I will want to watch at least once a year as I do with Enchanted April, Amelie, Up At The Villa, It's A Wonderful Life and a few other classics where immeasurable love and skill went into their creation.\nReview Title: Love Affair In And With Paris\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mozart in the Jungle\nReview Date: 2015/03/01\nCategories: Comedy\nProduct Description: ['A new Amazon Original Series: \\xa0What happens behind the curtains at the symphony is just as captivating as what happens on stage. Created by Paul Weitz (About a Boy), Roman Coppola (The Darjeeling Limited), and Jason Schwartzman (Rushmore). Brash new maestro Rodrigo (Gael Garcia Bernal) is stirring things up, and young oboist Hailey (Lola Kirke) hopes for her big chance.']\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Producers': ['ロマン･コッポラ', 'ジェイソン･シュワルツマン', 'ジョン･ストラウス', 'ポール･ワイツ'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows']}\nReview Text: What took me so long to finally tune in to this outstanding series? And where is the next season? (Can't wait!) And, where have you been keeping Gael Garcia Bernal? More, please!<br /><br />The music (!), casting, acting, scripts, directing . . . all brilliant!\nReview Title: Great Music, Great Drama\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/07\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Alcohol use'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Harold Cronk'], 'Producers': ['Michael Scott', 'Russell Wolfe', 'David A.R. White', 'Anna Zielinski', 'Elizabeth Travis'], 'Starring': ['Kevin Sorbo', 'Shane Harper', 'David A.R. White'], 'Studio': ['Lionsgate']}\nReview Text: Josh Wheaton (played by Shane Harper), a student, stands up to a seasoned, yet conflicted professor of philosophy, Professor Radisson (played by Kevin Sorbo) when Josh refuses to write out and sign a statement at the beginning of class, denying the existence of God.<br /><br />I liked this movie. I especially liked the three lectures given by Josh at the end of each of the three classes, trying to prove &#34;God's Not Dead.&#34;\nReview Title: A Matter Of Personal Belief\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/07/06\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Morgan Spurlock'], 'Producers': ['Morgan Spurlock'], 'Starring': ['Yuji Nagatani', 'Cortney Burns', 'Luke Snyder'], 'Studio': ['Kinonation']}\nReview Text: Morgan Spurlock interviews three modern artisans who value traditional methods as they hand manufacture knives, food and pottery.<br /><br />Two men from Georgia, who forge knives can take up to two years to deliver a set of knives or a custom chef's knife. Their company is &#34;Bloodroot Blades,&#34; and they have a fascinating and unique method for turning fabric (or found objects) into knife handles; objects that mean something to the buyer, such as a wedding dress, an apron, or a piano key.<br /><br />In San Francisco, Chefs Courtney Burns and Nick Balla assemble fusions of culinary ingredients at Bar Tartine. They routinely work sixteen hour days and they have a regular clientele devoted to their unique and often spontaneous food creations.<br /><br />In Japan, Mr. Yugi Nagatani and his team make clay cooking pots for a traditional method of steaming foods right at the table.<br /><br />Edgy film editing. Unlike some of his previous films, Spurlock doesn't appear on camera.\nReview Title: The Joy Of The Craft\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Parade's End\nReview Date: 2015/09/08\nStore: Judi Dench  (Actor),     Various  (Director)    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', \"Parade's End (1964) (DVD)\", \"BBC Home Entertainment presents the original 1964 mini-series starring Judi Dench, newly restored from the original film masters! This 1964 film adaptation of the classic novel by Ford Madox Ford shows a young Judi Dench (Skyfall, J. Edgar) in one of her earliest screen roles. Considered by many as one of the pre-eminent literary works of the 20th-century, Parade's End follows Christopher Tietjens (Ronald Hines, Elizabeth R), a wealthy member of Edwardian England's upper class, as the country is drawn into World War One. Tietjens is at the center of a love triangle between his wife Sylvia (Jeanne Moody), a treacherous socialite who is trying to destroy him, and his suffragette mistress, Valentine (Dench). The warfare Tietjens encounters as an officer in Europe is but a backdrop to a personal battle of conflicting loyalties, hidden passions and the rigid social expectations of his day.\", ']]>', 'Amazon.com', 'This introspective adaptation of Ford Madox Ford\\'s four-book series revolves around Yorkshire statistician Christopher Tietjens (Ronald Hines, pale and prickly), a nonconformist living in stiff-upper-lip Edwardian England (screenwriter John Hopkins concentrates on the first three novels in the tetralogy). When war breaks out, Christopher does his patriotic duty, while dreaming of the day \"there will be no more parades.\" In the first part, his spiteful and snobbish wife, Sylvia (Jeanne Moody, overacting in an entertaining manner), leaves him for another man, but Christopher forgoes divorce to avoid a scandal and moves in with his Rossetti-obsessed associate, MacMaster (Fulton Mackay), the kind of arty gentleman who rolls his', 'r', '\\'s. To her mother, Sylvia explains her actions succinctly: \"I hate my husband and I hate my child.\" While she\\'s away, he meets Valentine (Judi Dench, the essence of compassion), a suffragette and pacifist. If Christopher represents the past, Valentine represents the future.', 'Sylvia eventually returns, but Christopher continues to associate with Valentine, to the consternation of his father, who believes the rumors that have been swirling around his son (most of them untrue). As Christopher\\'s brother, Mark (Ronald Leigh-Hunt), tells Valentine, he\\'s \"a fellow who never told a lie or did a dishonorable thing.\" In the next two chapters, Christopher serves as an officer in France and Belgium, loses several of his men, and suffers from posttraumatic stress disorder, which complicates his long-simmering, but unconsummated romance with Valentine. This 1964 version of', \"Parade's End\", \", which aired under the aegis of the BBC's\", 'Theatre 625', ', combines the stagy (abrupt transitions, minimalist sets) with the cinematic (disorienting close-ups, blurred backgrounds), but it increases in interest as the central duo grows closer and builds to a moving finish. In 2012,', 'Sherlock', \"'s Benedict Cumberbatch took on the Tietjens role for a BBC-HBO coproduction.\", '--Kathleen C. Fennessy']\nAverage Rating: 3.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '26356378', 'Director': 'Various', 'Media Format': 'Multiple Formats, Black & White, NTSC, Subtitled', 'Run time': '4 hours and 30 minutes', 'Release date': 'April 16, 2013', 'Actors': 'Judi Dench', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReview Text: There's a new version of Parade's End, a 5-part series (2012) written by Tom Stoppard that is one of the best films I've ever watched. It is definitely one of my &#34;Top 20 All Time Favorite Movies.&#34; Available on Amazon Prime Video or DVD at amazon.com. IMHO: Best director, Best Screenplay, Best Actors, Best Art Direction, Best Cinematography, Best Every Category. All interior scenes look as though they were staged by Vermeer. The casting and the portrayal of the characters by these actors is absolutely stunning!<br /><br />Set during WW1, Christopher Tietjens, one of Britain's most brilliant statisticians finds himself fighting in the trenches. He leaves two women behind: his wealthy wife, Sylvia, and Miss Wannop, a woman he has gradually come to know and love. Sylvia is a manipulative, selfish socialite, and Miss Wannop, a suffragette, is someone with a strong sense of duty (like Tietjens).<br /><br />This 1964 version is okay. It's in black and white. The script is abbreviated. But it is fun seeing Judi Dench, when she was younger, in the role of Miss Wannop.<br /><br />I bought both this DVD and the kindle book (based on the novel by Ford Madox Ford, &#34;No More Parades&#34;).  I have watched this 1964 version once, and I've watched the 2012 version several times. I love this story!\nReview Title: No More Parades\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/12/03\nAverage Rating: 3.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---']}\nReview Text: As a RELAXATION film = 5-STARS. As a PARIS GUIDE = 3.5 STARS. But I did enjoy it -- especially the French Cafe music!<br /><br />This is an artsy 54-minute medley of footage, stills and music. It might be years old, or just made to look that way, with its sepia tinted footage. Film is often shown with music only, no narration, and sometimes they fast forward: cars zoom around Place de la Concorde; people walk at a rapid clip making them look like Weebles.<br /><br />Narration, by a Brit named John Symes who has a most calming tone of voice, is abbreviated; he speaks only about half of the time. But he does manage to inform visitors about sightseeing highlights, including history and culture, and some practical tips, in spite of the trimmed narration.<br /><br />He begins with your arrival at CDG and suggests you take the RoissyBus. (I took it once. I found it to be inexpensive and convenient, since I was staying at a Best Western a few of blocks away from the Paris Opera Garnier.) He also mentions the train and taxis; but taxis can be expensive. One great tip is to google the bus map and print it out, since they're hard to come by. Another is to wear comfortable shoes and walk everywhere.<br /><br />&#34;Must See&#34; places: Eiffel Tower, Louvre (plan to spend a whole day), Carousel under the Louvre to buy Louvre tickets and shop for French souvenirs, Notre Dame Cathedral, Place de la Concorde, Sacre Coeur (I like his tip on watching the sunset from here and visiting Montmartre in the evening), Pompidou Center, Moulin Rouge, Invalides, Palais de Luxembourg, Pantheon (I agree -- a must see! though a bit out of the way), Tuileries Gardens, Grand Palais (the Nazis used it for their tanks during WW2 -- I didn't know this), Forum des Halles for shopping (but he really prefers Carousel), walk along the Seine, go to the theatre (but beware -- it will be in French!). They show Bourse, but don't identify it. They show the inside of Opera Garnier, but don't tell you what you're looking at.<br /><br />When he bemoans the fact that one can't get a cup of real English tea, he says it &#34;tongue in cheek,&#34; I think, and isn't really crying over the fact that English tea isn't served with milk in France, if at all. He recommends orange juice, instead. He points out that Parisians are beautiful to look at (true!), and he says about Paris: it's one of those places it would be a shame not to visit. I so agree!\nReview Title: Artsy & Relaxing With A Sketch Of The Main Sights\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/12/04\nAverage Rating: 3.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['KM Records'], 'Studio': ['TravelVideoStore.com']}\nReview Text: When you only have 14 minutes to discover Paris, this might be the short for you.<br /><br />They start out with the Seine and the Right and Left Banks (Rive Droite and Rive Gauche), a good way for the visitor to get oriented.<br /><br />They move on to Notre Dame de Paris, where Napoleon crowned himself in 1804. (According to legend, he snatched the crown from the hands of Pope Pius VII and crowned himself during the coronation.) This film doesn't show it, but there's a sensational painting by Jacques Louis David that depicts Napoleon crowning Josephine, with Pope Pius VII sitting behind him.<br /><br />Next, they mention the Pont Neuf, &#34;New Bridge,&#34; the oldest bridge in Paris. Then, Cafe Marly, a beautiful vantage point for a view of The Louvre, and of course The Louvre, itself (where you can view the aforementioned painting up close and personal).<br /><br />They mention who must yield to whom when driving a car. (Priorité à droite - the old French system of giving priority to all traffic coming from the right clues you into the fact that you should familiarize yourself with driving rules, and signage. But if you only learn one rule, this would be it, since the entire country is overflowing with traffic circles.)<br /><br />They cover Place de la Concorde, Picasso Museum in the Hotel Sale, Fashion Week, Paris streets at night, Moulin Rouge, Arc de Triomphe, Eiffel Tower, stairs to Sacre Coeur and Montmartre Hill, and La Defense.<br /><br />Narration is good, but choice of background music and sound editing isn't. (Pachelbel Canon while showing Notre Dame de Paris? Non.)\nReview Title: Let's Be Brief -- Some Practical Information\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/01/25\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susanna White'], 'Producers': ['David Parfitt', 'Selwyn Roberts', 'Michele Buck', 'Damien Timmer', 'Ben Donald'], 'Starring': ['Benedict Cumberbatch', 'Rebecca Hall', 'Roger Allam'], 'Studio': ['HBO']}\nReview Text: One of my top five favorite series. I've watched all five episodes many times. (I watched it elsewhere, before it came to Amazon Instant Video. Now that it's on Amazon Instant Video, I can download it so that I can watch it many more times.)<br /><br />Brilliant script by Tom Stoppard. Brilliant casting and the acting couldn't be better! Brilliant direction! Gorgeous set design! Love the music! Remarkable collaboration all around.<br /><br />Two of the episodes show protagonist, Christopher Tietjens in the trenches during WWI. He is one of England's foremost statisticians who would rather be in the trenches than falsify numbers so that the Prime Minister can get his agenda passed. Tietjens is all about duty; he abides by the Edwardian conduct of &#34;parade.&#34; He has a difficult wife and he stays with her through all of the drama she dishes out. Early on, he falls in love with Miss Wannop, but that love isn't consummated for years -- not until after the horrors of war and the societal changes as a result of the war.\nReview Title: A Remarkable Collaboration\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The New Yorker Presents\nReview Date: 2016/03/06\nCategories: Documentary\nProduct Description: [\"From award-winning filmmaker Alex Gibney's Jigsaw Productions, Amazon Prime Video presents a groundbreaking new series that brings America's most award-winning magazine, The New Yorker, to the screen with documentaries, short narrative films, comedy, poetry, animation, and cartoons from the hands of acclaimed filmmakers and artists. Produced by Jigsaw Productions and Condac Nast Entertainment.\"]\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English'], 'Directors': ['Ryan Miller', 'Jyllian Gunther', 'Jed Rothstein', 'Jonathan Demme', 'Shari Springer Berman', 'Janicza Bravo', 'Blair Foster', 'Alex Gibney', 'Steve James', 'Eugene Jarecki'], 'Starring': ['Rachel Aviv', 'Roz Chast', 'Paul Giamatti']}\nReview Text: Love the format and the content.<br /><br />Interesting stories viewed instead of read.\nReview Title: Great Format & Interesting Content\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/03/29\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Emilio Estevez'], 'Producers': ['Julio Fernandez', 'David Alexanian'], 'Starring': ['Martin Sheen', 'Emilio Estevez', 'Deborah Kara Unger'], 'Studio': ['FilmBuff']}\nReview Text: I love, Love, LOVE this film and have watched it many times. This movie has one of the best musical scores, ever! Brilliantly written, acted and directed by Emilio Estevez. This is very much a Sheen/Estevez family affair with contributions by many family members as actors, producers, etc. The casting is spot-on. Sheen and Yorick van Wageningen (as Joost from Amsterdam) really shine in their roles, with wonderful performances by Deborah Kara Unger (as Sarah, with her painful history) and James Nesbitt (as Jack, a writer with &#34;writer's block&#34;).<br /><br />&#34;Margaret Mead didn't become a great cultural anthropologist by staying in school,&#34; says Tom's son Daniel, who has a strong calling to travel the world. So, instead of finishing his doctorate, Daniel travels and unfortunately gets caught in a storm in the Pyrenees. (Again, the cast of characters highlights anthropology/sociology: Captain Henri (Tcheky Karyo), Angelica (Angela Molina), El Ramon (Eusebio Lazaro), are among my favorites, running the gamut of human emotions and circumstances.)<br /><br />*** SPOILER ALERT -- DON'T READ FURTHER IF YOU DON'T WANT TO KNOW WHAT HAPPENS ***<br /><br />Tom goes to Spain's Basque Country to retrieve the body of his only son. He decides to walk The Camino de Santiago from St. Jean Pied de Port to Santiago de Compostela, and then further to Muxia, scattering Daniel's ashes along the way.<br /><br />The spirit of Daniel is very much with Tom along the way. Tom also makes the acquaintance of three other trekkers, or peregrinos, who form close friendships after some early conflicts, underscoring one of my favorite quotes: &#34;To understand all is to forgive all.&#34;<br /><br />Toward the end, the film pays homage to Santiago de Compostela: exterior scenes from the distance and close up, St. James at the entrance, inside the church, and a mass with clergy getting the huge incense burner (botafumeiro) airborne, swinging from the nave to the chancel (an awesome scene!) on its enormous arc.<br /><br />At the suggestion of Ishmael, a gypsy with integrity, Tom goes the extra mile, taking Daniel's remaining ashes to Muxia, to the sea, where Tom reaches catharsis.<br /><br />Scenes of the Spanish countryside highlight the beauty of this route: a field under the Milky Way. A corridor where miracles can happen.<br /><br />Since all four travelers are seeking something along the way that they hope to find resolved by their destination, I could not stop myself from remembering &#34;The Wizard of Oz.&#34; In spite of heartfelt sentiments in both films, I think &#34;The Way&#34; is the more serious of the two.\nReview Title: Epiphany & Catharsis Along The Way\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kundalini Yoga With Grace & Strength\nReview Date: 2016/09/18\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Special Interests\nProduct Description: ['From the Back Cover', 'With Grace & Strength', \"is a video that delivers. This tape gives you the skills to develop & improve your health, strength, flexibility, awareness, creativity, focus, and grace. Carol Carson has designed a video unlike any other. It's a powerful, clear, and inspiring workout on every level. Use it to rid yourself of unconscious habits and attitudes that diminish your health, happiness, energy, and effectiveness.\", 'Carol Carson (Sat Nam Kaur) is a certified Kundalini Yoga Instructor and has been teaching for over a decade. Living in NYC, she works privately as a yoga therapist, teaches classes daily, and gives lectures and workshops. Carol was a professional dancer and has a degree in public service. Her approach is physically practical. It is mentally sensitive and spiritually inspiring. 70 minutes.']\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.4 x 5.1 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'April 10, 2001', 'Actors': 'Carlson, Carol', 'Language': 'English (Dolby Digital 2.0)', 'Studio': 'Wellspring Media'}\nReview Text: I discovered this years ago in video and wanted to update with a DVD version.<br /><br />It's the same brilliant yoga workout on DVD that was on the video.<br /><br />It leaves me feeling absolutely wonderful and has me approaching the transcendental via the physical.<br /><br />Carlson is a master!\nReview Title: Sensitive, Spiritual & Powerful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/09/26\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Tim Kirkby', 'Harry Bradbeer'], 'Producers': ['Two Brothers Pictures Ltd'], 'Starring': ['Phoebe Waller-Bridge', 'Sian Clifford', 'Olivia Colman'], 'Studio': ['Amazon Studios']}\nReview Text: I liked this series quite a bit and I loved the very &#34;quirky&#34; main character, herself, known as &#34;Fleabag.&#34;<br /><br />Actress Phoebe Waller-Bridge is brilliant in the starring role in this BBC series set in modern day London, England.<br /><br />Fleabag is missing her best friend and business partner who has recently died in an unexpected, unpredictable manner. The last episode has a stunning reveal: we find out who was ultimately responsible for her friend's unhappiness that led directly to her death.<br /><br />I admire Fleabag's &#34;survival instincts&#34; as she copes with the rude, the ruthless, the impolite and the clueless people in her life.\nReview Title: Keeping A Stiff Upper Lip\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: My Mum Talks to Aliens\nReview Date: 2016/10/06\nCategories: Special Interest\nProduct Description: [\"Mary Rodwell is a leading authority on extra-terrestrial phenomena; her son Chris Rodwell is a vet, a man of science and self-confessed sceptic. Their relationship has reached a critical point. Mary's beliefs led to the breakdown of her marriage and left a teenage Chris with some emotional scars, so the topic comes with baggage. Trying to keep an open mind, Chris agrees to enter Mary's world.\"]\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Brown']}\nReview Text: In this thought-provoking documentary, Mary Rodwell, therapist to the alien abduction community, travels around Australia with her scientifically minded, skeptical son, Chris in tow.<br /><br />I found this documentary to brilliantly written and edited and I think it gives a balanced and honest portrayal of the people featured: loving mother and son, &#34;flippant&#34; Australian astrophysicist (Dr. Lion Weaver) and an audience full of skeptical (bordering on rude) students, an astronomer (Dr. Rhagvir Bhathel) who filters signals from deep space, a roomful of folks interested in the topic (members of one of Mary's support groups, I believe), some of whom had actually sighted UFOs, a polygraph tester (Gavin Wilson) for the Federal Police, and two men who claimed to have had close encounters with aliens.<br /><br />The first of these two men, Greg Dinal, claimed he had seen a UFO in 1967, describing it as a reddish ball in the sky that grew until it was as big as a football field. His experiences did not pass the lie detector test, although in telling his story, I found him entirely credible. The second man, Peter Curry, described an incredible experience that happened at 7:15 a.m. in 1992. He awoke to find a blonde female &#34;straddling&#34; him. He obtained evidence (hairs) that were scientifically tested. The DNA results: close to human; rare Chinese Mongoloid type; near African pygmy. The polygraph expert asked him if there were five aliens in his home at Hurlstone Park and he affirmed this. He passed the polygraph test.<br /><br />Mary shows Chris a video of lights in the sky, at night, near Silbury Hill in England, where crop circles have appeared. Neither Mary nor Chris can determine exactly what the lights are.<br /><br />There was nothing in this documentary that caused me to believe that anyone has ever been abducted by aliens, although I do believe it is possible. And the hairs that Peter Curry collected and the subsequent DNA results lend credibility to alien visitations of humans. My own personal belief is that aliens have probably visited Earth, perhaps between 20,000 and 40,000 years ago and possibly more recently. I base this on Puma Punku in Bolivia and some evidence in a documentary titled &#34;Pyramid Code&#34; about ancient sites in Egypt. Erich von Daniken's book, &#34;Chariots of the Gods&#34; (1968) also presented a lot of intriguing evidence. (My belief is that aliens visited Earth and that they might have altered DNA of early people. I have no idea if they have visited us in modern times, but I don't see why not, especially if they want to see the results of their experimentation.) These sites were not covered in &#34;My Mum Talks to Aliens,&#34; which focuses on people who have been abducted.<br /><br />So, like Mary's son Chris, I remain skeptical but open-minded about those individuals who claim to have been abducted by aliens. But Mary believes it, and she is a wonderful supporter of those who claim to have had those experiences.<br /><br />As for crop circles, I suspect that some technical genius(es) in England invented personal drones long before they hit the mainstream. I believe that they then programmed those drones to follow a template, knocking wheat or corn over in fields for whatever reason -- to test the accuracy of their drones, or to baffle the rest of us.\nReview Title: Fighting A Fight She Believes In\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/12/17\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Paul Weitz', 'Roman Coppola', 'Will Graham', 'Patricia Rozema', 'Azazel Jacobs', 'Tricia Brock', 'Gael Garcia Bernal'], 'Producers': ['Paul Weitz', 'Roman Coppola', 'Jason Schwartzman', 'Will Graham'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows'], 'Studio': ['Amazon Studios']}\nReview Text: I love the series, the actors and the casting. In Season 3 Haley is a fledgling conductor -- I love this (!) -- a profession in which one doesn't typically find a lot of women. I loved the Venice setting in Season 3! The only thing wrong? Each episode is too short.\nReview Title: If Music Be The Food Of Love, Play On!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/07/09\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Stephen de Vere'], 'Producers': ['Stephen de Vere'], 'Starring': ['British Countryside', 'Barn owl', 'Red fox'], 'Studio': ['Stephen de Vere Wildlife']}\nReview Text: Such a beautiful film!<br /><br />Amazing footage of animals in the English countryside.<br /><br />The narration is spot on!<br /><br />I love this and will watch it again.\nReview Title: Watch It Over & Over -- Deeply Relaxing & Satisfying\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Figure it Out on the Hayduke Trail\nReview Date: 2019/10/27\nCategories: Special Interest, Documentary, Adventure\nProduct Description: [\"The Hayduke Trail is an 800-mile route across Utah and Arizona. It's one of the most challenging hikes in America and most of the time there is no trail. The southwest is canyon country and it's extremely remote. Figure it Out is about more than just hiking though, it explains how we can use the lessons learned in the wilderness to live happier and more resilient lives.\"]\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alex Maier'], 'Producers': ['Alex Maier'], 'Starring': ['Alex Maier', 'Kurt Bramel']}\nReview Text: My husband loves this terrain and he's spent a lot of time biking Utah and Arizona's deserts. We both thought that Alex Maier did a phenomenal job with this film -- interviews, music, etc. -- but especially the editing! And we both appreciated his articulate, eloquent narration. Alex had to navigate tricky spots several times to set up his camera, make the climb, and retrieve his camera. He really captured the essence of America's arid landscape as he backpacked 800 miles across southern Utah and northern Arizona. Some of this terrain is tough! At times he went hours without water and other times he was chest deep in water at the base of steep canyons. A recurring theme is the self-empowerment of solving problems and figuring one's way out of tricky situations. He makes mistakes along the way and accepts those with humor and humility. I loved the recurring footage of shooting stars in the night sky! Well done!\nReview Title: Eloquence & Survival On The Hayduke Trail\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/05/03\nAverage Rating: 4.0\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['Português'], 'Subtitles': ['English [CC]'], 'Directors': ['Karim Ainouz'], 'Producers': ['Kaoe Catao', 'Camilo Cavalcanti', 'Mariana Coelho', 'Viola Fugen', 'Marilia Garske', 'Hei Yang Lau', 'Vivi Mendonca', 'Michel Merkt', 'Rodrigo Teixeira', 'Cecile Tollu-Polono'], 'Starring': ['Julia Stockler', 'Carol Duarte', 'Flavia Gusmao'], 'Studio': ['Amazon Studios']}\nReview Text: I loved this for its realistic portrait of life in general and especially the lives of two women in 1950s Brazil. Guida runs off with a sailor, only to return to her parents home months later. Euridice, a talented pianist, is coerced into a traditional way of life. Their dreams are not supported by the men in their lives. The sisters are separated in their late teens or early twenties and hope to reunite with each other. Interesting plot and great acting!\nReview Title: Two Sisters Never Give Up Hope\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/05/07\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ronald Chase'], 'Starring': ['Richard Easton', 'Kristin Milward', 'Anthony Daniels'], 'Studio': ['SF Art & Film Archive']}\nReview Text: Dark and surreal film full of beautiful imagery. I loved about half and I found the other half confusing and annoying with those constant bells. Wonderful actors!\nReview Title: Strange & Beautiful\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/05/23\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ludovico de Maistre'], 'Starring': ['Ludovico de Maistre']}\nReview Text: Beautiful short film featuring video of Iceland’s rugged and frigid terrain, accompanied by relaxing music. Amazing images shot entirely on a smartphone!\nReview Title: Iceland’s Frigid, Natural Beauty - Awesome Video & Relaxing Music\nRating: 5.0\n--------------------------------------------------",
  "reference": "Midnight in Paris\nKathy Bates  (Actor),     Adrien Brody  (Actor),     Woody Allen  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"This is a romantic comedy set in Paris about a family that goes there because of business, and two young people who are engaged to be married in the fall have experiences there that change their lives. It's about a young man's great love for a city, Paris, and the illusion people have that a life different from theirs would be much better.\", 'Amazon.com', 'Paris is a city that lends itself to daydreaming, to walking the streets and imagining all sorts of magic, a quality that Woody Allen understands perfectly.', 'Midnight in Paris', \"is Allen's charming reverie about just that quality, with a screenwriter hero named Gil (Owen Wilson) who strolls the lanes of Paris with his head in the clouds and walks right into his own best fantasy. Gil is there with his materialistic fiancée (Rachel McAdams) and her unpleasant parents, taking a break from his financially rewarding but spiritually unfulfilling Hollywood career--and he can't stop thinking that all he wants to do is quit the movies, move to Paris, and write that novel he's been meaning to finish. You know, be like his heroes in the bohemian Paris of the 1920s. Sure enough, a midnight encounter draws him into the jazzy world of Scott and Zelda Fitzgerald, Picasso and Dali, and an intense Ernest Hemingway, who promises to bring Gil's manuscript to Gertrude Stein for review. Gil wakes up every morning back in the real world, but returning to his enchanted Paris proves fairly easy. In the execution of this marvelous fantasia, Allen pursues the idea that people of every generation have always romanticized a previous age as golden (this is in fact explained to us by Michael Sheen's pedantic art expert), but he also honors Gil's need to find out certain truths for himself. The movie's on the side of gentle fantasy, and it has some literary/cinematic in-jokes that call back to the kind of goofy humor Allen created in\", 'Love and Death', \".The film is guilty of the slackness that Allen's latter-day directing has sometimes shown, and the underwritten roles for McAdams and Marion Cotillard are better acted than written. But the city glows with Allen's romantic sense of it, and Owen Wilson has just the right nice-guy melancholy to put the idea over. A worthy entry in the Cinema of the Daydream.\", '--Robert Horton']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Michael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla BruniMichael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla Bruni  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'MFR043396385269#N', 'Director': 'Woody Allen', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 34 minutes', 'Release date': 'December 20, 2011', 'Actors': 'Kathy Bates, Adrien Brody, Carla Bruni, Marion Cotillard, Rachel McAdams', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Letty Aronson, Stephen Tenenbaum, Jaume Roures', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWoody Allen's love affair with Paris.<br /><br />A winner of a movie! Thanks for this one, Woody Allen, I hope you win an award and I hope this movie wins many. The first minute or two of this film, scenes of Paris with jazz music, was wonderful! (Frankly, I would have preferred classical cello music, but the visuals alone worked beautifully with their sepia overtones.)<br /><br />My favorite scene involved a surrealistic exchange among Dali, Luis Bunuel, Man Ray and our protagonist Gil where they all spoke about a rhinoceros from their individual viewpoints. (Inspired and hilarious -- loved it!) Other great philosophy came from Hemingway. And on writing, Gertrude Stein said it best.<br /><br />Brilliant cast: Kathy Bates as Gertrude Stein, Adrien Brody as Salvador Dali, Tom Hiddleston as F. Scott Fitzgerald and Carla Bruni as museum guide. The part of Owen Wilson would most likely have been played by Woody Allen himself if he had been slightly younger, but Wilson does his best to affect Allen's mannerisms.<br /><br />Paris IS a most beautiful city. I've walked much of Paris in the rain and I agree with one premise of this movie: rain enhances the beauty of Paris. (One of my most invigorating days, ever, was sitting on the top level of an open-air tour bus, in the rain, umbrella open, soaring around Paris from one arrondissement to another.)<br /><br />This is a movie I will want to watch at least once a year as I do with Enchanted April, Amelie, Up At The Villa, It's A Wonderful Life and a few other classics where immeasurable love and skill went into their creation.\nLove Affair In And With Paris\nMozart in the Jungle\nComedy\n['A new Amazon Original Series: \\xa0What happens behind the curtains at the symphony is just as captivating as what happens on stage. Created by Paul Weitz (About a Boy), Roman Coppola (The Darjeeling Limited), and Jason Schwartzman (Rushmore). Brash new maestro Rodrigo (Gael Garcia Bernal) is stirring things up, and young oboist Hailey (Lola Kirke) hopes for her big chance.']\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Producers': ['ロマン･コッポラ', 'ジェイソン･シュワルツマン', 'ジョン･ストラウス', 'ポール･ワイツ'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows']}\nWhat took me so long to finally tune in to this outstanding series? And where is the next season? (Can't wait!) And, where have you been keeping Gael Garcia Bernal? More, please!<br /><br />The music (!), casting, acting, scripts, directing . . . all brilliant!\nGreat Music, Great Drama\n{'Content advisory': ['Alcohol use'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Harold Cronk'], 'Producers': ['Michael Scott', 'Russell Wolfe', 'David A.R. White', 'Anna Zielinski', 'Elizabeth Travis'], 'Starring': ['Kevin Sorbo', 'Shane Harper', 'David A.R. White'], 'Studio': ['Lionsgate']}\nJosh Wheaton (played by Shane Harper), a student, stands up to a seasoned, yet conflicted professor of philosophy, Professor Radisson (played by Kevin Sorbo) when Josh refuses to write out and sign a statement at the beginning of class, denying the existence of God.<br /><br />I liked this movie. I especially liked the three lectures given by Josh at the end of each of the three classes, trying to prove &#34;God's Not Dead.&#34;\nA Matter Of Personal Belief\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Morgan Spurlock'], 'Producers': ['Morgan Spurlock'], 'Starring': ['Yuji Nagatani', 'Cortney Burns', 'Luke Snyder'], 'Studio': ['Kinonation']}\nMorgan Spurlock interviews three modern artisans who value traditional methods as they hand manufacture knives, food and pottery.<br /><br />Two men from Georgia, who forge knives can take up to two years to deliver a set of knives or a custom chef's knife. Their company is &#34;Bloodroot Blades,&#34; and they have a fascinating and unique method for turning fabric (or found objects) into knife handles; objects that mean something to the buyer, such as a wedding dress, an apron, or a piano key.<br /><br />In San Francisco, Chefs Courtney Burns and Nick Balla assemble fusions of culinary ingredients at Bar Tartine. They routinely work sixteen hour days and they have a regular clientele devoted to their unique and often spontaneous food creations.<br /><br />In Japan, Mr. Yugi Nagatani and his team make clay cooking pots for a traditional method of steaming foods right at the table.<br /><br />Edgy film editing. Unlike some of his previous films, Spurlock doesn't appear on camera.\nThe Joy Of The Craft\nParade's End\nJudi Dench  (Actor),     Various  (Director)    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', \"Parade's End (1964) (DVD)\", \"BBC Home Entertainment presents the original 1964 mini-series starring Judi Dench, newly restored from the original film masters! This 1964 film adaptation of the classic novel by Ford Madox Ford shows a young Judi Dench (Skyfall, J. Edgar) in one of her earliest screen roles. Considered by many as one of the pre-eminent literary works of the 20th-century, Parade's End follows Christopher Tietjens (Ronald Hines, Elizabeth R), a wealthy member of Edwardian England's upper class, as the country is drawn into World War One. Tietjens is at the center of a love triangle between his wife Sylvia (Jeanne Moody), a treacherous socialite who is trying to destroy him, and his suffragette mistress, Valentine (Dench). The warfare Tietjens encounters as an officer in Europe is but a backdrop to a personal battle of conflicting loyalties, hidden passions and the rigid social expectations of his day.\", ']]>', 'Amazon.com', 'This introspective adaptation of Ford Madox Ford\\'s four-book series revolves around Yorkshire statistician Christopher Tietjens (Ronald Hines, pale and prickly), a nonconformist living in stiff-upper-lip Edwardian England (screenwriter John Hopkins concentrates on the first three novels in the tetralogy). When war breaks out, Christopher does his patriotic duty, while dreaming of the day \"there will be no more parades.\" In the first part, his spiteful and snobbish wife, Sylvia (Jeanne Moody, overacting in an entertaining manner), leaves him for another man, but Christopher forgoes divorce to avoid a scandal and moves in with his Rossetti-obsessed associate, MacMaster (Fulton Mackay), the kind of arty gentleman who rolls his', 'r', '\\'s. To her mother, Sylvia explains her actions succinctly: \"I hate my husband and I hate my child.\" While she\\'s away, he meets Valentine (Judi Dench, the essence of compassion), a suffragette and pacifist. If Christopher represents the past, Valentine represents the future.', 'Sylvia eventually returns, but Christopher continues to associate with Valentine, to the consternation of his father, who believes the rumors that have been swirling around his son (most of them untrue). As Christopher\\'s brother, Mark (Ronald Leigh-Hunt), tells Valentine, he\\'s \"a fellow who never told a lie or did a dishonorable thing.\" In the next two chapters, Christopher serves as an officer in France and Belgium, loses several of his men, and suffers from posttraumatic stress disorder, which complicates his long-simmering, but unconsummated romance with Valentine. This 1964 version of', \"Parade's End\", \", which aired under the aegis of the BBC's\", 'Theatre 625', ', combines the stagy (abrupt transitions, minimalist sets) with the cinematic (disorienting close-ups, blurred backgrounds), but it increases in interest as the central duo grows closer and builds to a moving finish. In 2012,', 'Sherlock', \"'s Benedict Cumberbatch took on the Tietjens role for a BBC-HBO coproduction.\", '--Kathleen C. Fennessy']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '26356378', 'Director': 'Various', 'Media Format': 'Multiple Formats, Black & White, NTSC, Subtitled', 'Run time': '4 hours and 30 minutes', 'Release date': 'April 16, 2013', 'Actors': 'Judi Dench', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nThere's a new version of Parade's End, a 5-part series (2012) written by Tom Stoppard that is one of the best films I've ever watched. It is definitely one of my &#34;Top 20 All Time Favorite Movies.&#34; Available on Amazon Prime Video or DVD at amazon.com. IMHO: Best director, Best Screenplay, Best Actors, Best Art Direction, Best Cinematography, Best Every Category. All interior scenes look as though they were staged by Vermeer. The casting and the portrayal of the characters by these actors is absolutely stunning!<br /><br />Set during WW1, Christopher Tietjens, one of Britain's most brilliant statisticians finds himself fighting in the trenches. He leaves two women behind: his wealthy wife, Sylvia, and Miss Wannop, a woman he has gradually come to know and love. Sylvia is a manipulative, selfish socialite, and Miss Wannop, a suffragette, is someone with a strong sense of duty (like Tietjens).<br /><br />This 1964 version is okay. It's in black and white. The script is abbreviated. But it is fun seeing Judi Dench, when she was younger, in the role of Miss Wannop.<br /><br />I bought both this DVD and the kindle book (based on the novel by Ford Madox Ford, &#34;No More Parades&#34;).  I have watched this 1964 version once, and I've watched the 2012 version several times. I love this story!\nNo More Parades\n{'Subtitles': ['None available'], 'Directors': ['---']}\nAs a RELAXATION film = 5-STARS. As a PARIS GUIDE = 3.5 STARS. But I did enjoy it -- especially the French Cafe music!<br /><br />This is an artsy 54-minute medley of footage, stills and music. It might be years old, or just made to look that way, with its sepia tinted footage. Film is often shown with music only, no narration, and sometimes they fast forward: cars zoom around Place de la Concorde; people walk at a rapid clip making them look like Weebles.<br /><br />Narration, by a Brit named John Symes who has a most calming tone of voice, is abbreviated; he speaks only about half of the time. But he does manage to inform visitors about sightseeing highlights, including history and culture, and some practical tips, in spite of the trimmed narration.<br /><br />He begins with your arrival at CDG and suggests you take the RoissyBus. (I took it once. I found it to be inexpensive and convenient, since I was staying at a Best Western a few of blocks away from the Paris Opera Garnier.) He also mentions the train and taxis; but taxis can be expensive. One great tip is to google the bus map and print it out, since they're hard to come by. Another is to wear comfortable shoes and walk everywhere.<br /><br />&#34;Must See&#34; places: Eiffel Tower, Louvre (plan to spend a whole day), Carousel under the Louvre to buy Louvre tickets and shop for French souvenirs, Notre Dame Cathedral, Place de la Concorde, Sacre Coeur (I like his tip on watching the sunset from here and visiting Montmartre in the evening), Pompidou Center, Moulin Rouge, Invalides, Palais de Luxembourg, Pantheon (I agree -- a must see! though a bit out of the way), Tuileries Gardens, Grand Palais (the Nazis used it for their tanks during WW2 -- I didn't know this), Forum des Halles for shopping (but he really prefers Carousel), walk along the Seine, go to the theatre (but beware -- it will be in French!). They show Bourse, but don't identify it. They show the inside of Opera Garnier, but don't tell you what you're looking at.<br /><br />When he bemoans the fact that one can't get a cup of real English tea, he says it &#34;tongue in cheek,&#34; I think, and isn't really crying over the fact that English tea isn't served with milk in France, if at all. He recommends orange juice, instead. He points out that Parisians are beautiful to look at (true!), and he says about Paris: it's one of those places it would be a shame not to visit. I so agree!\nArtsy & Relaxing With A Sketch Of The Main Sights\n{'Subtitles': ['None available'], 'Directors': ['KM Records'], 'Studio': ['TravelVideoStore.com']}\nWhen you only have 14 minutes to discover Paris, this might be the short for you.<br /><br />They start out with the Seine and the Right and Left Banks (Rive Droite and Rive Gauche), a good way for the visitor to get oriented.<br /><br />They move on to Notre Dame de Paris, where Napoleon crowned himself in 1804. (According to legend, he snatched the crown from the hands of Pope Pius VII and crowned himself during the coronation.) This film doesn't show it, but there's a sensational painting by Jacques Louis David that depicts Napoleon crowning Josephine, with Pope Pius VII sitting behind him.<br /><br />Next, they mention the Pont Neuf, &#34;New Bridge,&#34; the oldest bridge in Paris. Then, Cafe Marly, a beautiful vantage point for a view of The Louvre, and of course The Louvre, itself (where you can view the aforementioned painting up close and personal).<br /><br />They mention who must yield to whom when driving a car. (Priorité à droite - the old French system of giving priority to all traffic coming from the right clues you into the fact that you should familiarize yourself with driving rules, and signage. But if you only learn one rule, this would be it, since the entire country is overflowing with traffic circles.)<br /><br />They cover Place de la Concorde, Picasso Museum in the Hotel Sale, Fashion Week, Paris streets at night, Moulin Rouge, Arc de Triomphe, Eiffel Tower, stairs to Sacre Coeur and Montmartre Hill, and La Defense.<br /><br />Narration is good, but choice of background music and sound editing isn't. (Pachelbel Canon while showing Notre Dame de Paris? Non.)\nLet's Be Brief -- Some Practical Information\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susanna White'], 'Producers': ['David Parfitt', 'Selwyn Roberts', 'Michele Buck', 'Damien Timmer', 'Ben Donald'], 'Starring': ['Benedict Cumberbatch', 'Rebecca Hall', 'Roger Allam'], 'Studio': ['HBO']}\nOne of my top five favorite series. I've watched all five episodes many times. (I watched it elsewhere, before it came to Amazon Instant Video. Now that it's on Amazon Instant Video, I can download it so that I can watch it many more times.)<br /><br />Brilliant script by Tom Stoppard. Brilliant casting and the acting couldn't be better! Brilliant direction! Gorgeous set design! Love the music! Remarkable collaboration all around.<br /><br />Two of the episodes show protagonist, Christopher Tietjens in the trenches during WWI. He is one of England's foremost statisticians who would rather be in the trenches than falsify numbers so that the Prime Minister can get his agenda passed. Tietjens is all about duty; he abides by the Edwardian conduct of &#34;parade.&#34; He has a difficult wife and he stays with her through all of the drama she dishes out. Early on, he falls in love with Miss Wannop, but that love isn't consummated for years -- not until after the horrors of war and the societal changes as a result of the war.\nA Remarkable Collaboration\nThe New Yorker Presents\nDocumentary\n[\"From award-winning filmmaker Alex Gibney's Jigsaw Productions, Amazon Prime Video presents a groundbreaking new series that brings America's most award-winning magazine, The New Yorker, to the screen with documentaries, short narrative films, comedy, poetry, animation, and cartoons from the hands of acclaimed filmmakers and artists. Produced by Jigsaw Productions and Condac Nast Entertainment.\"]\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English'], 'Directors': ['Ryan Miller', 'Jyllian Gunther', 'Jed Rothstein', 'Jonathan Demme', 'Shari Springer Berman', 'Janicza Bravo', 'Blair Foster', 'Alex Gibney', 'Steve James', 'Eugene Jarecki'], 'Starring': ['Rachel Aviv', 'Roz Chast', 'Paul Giamatti']}\nLove the format and the content.<br /><br />Interesting stories viewed instead of read.\nGreat Format & Interesting Content\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Emilio Estevez'], 'Producers': ['Julio Fernandez', 'David Alexanian'], 'Starring': ['Martin Sheen', 'Emilio Estevez', 'Deborah Kara Unger'], 'Studio': ['FilmBuff']}\nI love, Love, LOVE this film and have watched it many times. This movie has one of the best musical scores, ever! Brilliantly written, acted and directed by Emilio Estevez. This is very much a Sheen/Estevez family affair with contributions by many family members as actors, producers, etc. The casting is spot-on. Sheen and Yorick van Wageningen (as Joost from Amsterdam) really shine in their roles, with wonderful performances by Deborah Kara Unger (as Sarah, with her painful history) and James Nesbitt (as Jack, a writer with &#34;writer's block&#34;).<br /><br />&#34;Margaret Mead didn't become a great cultural anthropologist by staying in school,&#34; says Tom's son Daniel, who has a strong calling to travel the world. So, instead of finishing his doctorate, Daniel travels and unfortunately gets caught in a storm in the Pyrenees. (Again, the cast of characters highlights anthropology/sociology: Captain Henri (Tcheky Karyo), Angelica (Angela Molina), El Ramon (Eusebio Lazaro), are among my favorites, running the gamut of human emotions and circumstances.)<br /><br />*** SPOILER ALERT -- DON'T READ FURTHER IF YOU DON'T WANT TO KNOW WHAT HAPPENS ***<br /><br />Tom goes to Spain's Basque Country to retrieve the body of his only son. He decides to walk The Camino de Santiago from St. Jean Pied de Port to Santiago de Compostela, and then further to Muxia, scattering Daniel's ashes along the way.<br /><br />The spirit of Daniel is very much with Tom along the way. Tom also makes the acquaintance of three other trekkers, or peregrinos, who form close friendships after some early conflicts, underscoring one of my favorite quotes: &#34;To understand all is to forgive all.&#34;<br /><br />Toward the end, the film pays homage to Santiago de Compostela: exterior scenes from the distance and close up, St. James at the entrance, inside the church, and a mass with clergy getting the huge incense burner (botafumeiro) airborne, swinging from the nave to the chancel (an awesome scene!) on its enormous arc.<br /><br />At the suggestion of Ishmael, a gypsy with integrity, Tom goes the extra mile, taking Daniel's remaining ashes to Muxia, to the sea, where Tom reaches catharsis.<br /><br />Scenes of the Spanish countryside highlight the beauty of this route: a field under the Milky Way. A corridor where miracles can happen.<br /><br />Since all four travelers are seeking something along the way that they hope to find resolved by their destination, I could not stop myself from remembering &#34;The Wizard of Oz.&#34; In spite of heartfelt sentiments in both films, I think &#34;The Way&#34; is the more serious of the two.\nEpiphany & Catharsis Along The Way\nKundalini Yoga With Grace & Strength\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n['From the Back Cover', 'With Grace & Strength', \"is a video that delivers. This tape gives you the skills to develop & improve your health, strength, flexibility, awareness, creativity, focus, and grace. Carol Carson has designed a video unlike any other. It's a powerful, clear, and inspiring workout on every level. Use it to rid yourself of unconscious habits and attitudes that diminish your health, happiness, energy, and effectiveness.\", 'Carol Carson (Sat Nam Kaur) is a certified Kundalini Yoga Instructor and has been teaching for over a decade. Living in NYC, she works privately as a yoga therapist, teaches classes daily, and gives lectures and workshops. Carol was a professional dancer and has a degree in public service. Her approach is physically practical. It is mentally sensitive and spiritually inspiring. 70 minutes.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.4 x 5.1 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'April 10, 2001', 'Actors': 'Carlson, Carol', 'Language': 'English (Dolby Digital 2.0)', 'Studio': 'Wellspring Media'}\nI discovered this years ago in video and wanted to update with a DVD version.<br /><br />It's the same brilliant yoga workout on DVD that was on the video.<br /><br />It leaves me feeling absolutely wonderful and has me approaching the transcendental via the physical.<br /><br />Carlson is a master!\nSensitive, Spiritual & Powerful\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Tim Kirkby', 'Harry Bradbeer'], 'Producers': ['Two Brothers Pictures Ltd'], 'Starring': ['Phoebe Waller-Bridge', 'Sian Clifford', 'Olivia Colman'], 'Studio': ['Amazon Studios']}\nI liked this series quite a bit and I loved the very &#34;quirky&#34; main character, herself, known as &#34;Fleabag.&#34;<br /><br />Actress Phoebe Waller-Bridge is brilliant in the starring role in this BBC series set in modern day London, England.<br /><br />Fleabag is missing her best friend and business partner who has recently died in an unexpected, unpredictable manner. The last episode has a stunning reveal: we find out who was ultimately responsible for her friend's unhappiness that led directly to her death.<br /><br />I admire Fleabag's &#34;survival instincts&#34; as she copes with the rude, the ruthless, the impolite and the clueless people in her life.\nKeeping A Stiff Upper Lip\nMy Mum Talks to Aliens\nSpecial Interest\n[\"Mary Rodwell is a leading authority on extra-terrestrial phenomena; her son Chris Rodwell is a vet, a man of science and self-confessed sceptic. Their relationship has reached a critical point. Mary's beliefs led to the breakdown of her marriage and left a teenage Chris with some emotional scars, so the topic comes with baggage. Trying to keep an open mind, Chris agrees to enter Mary's world.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Brown']}\nIn this thought-provoking documentary, Mary Rodwell, therapist to the alien abduction community, travels around Australia with her scientifically minded, skeptical son, Chris in tow.<br /><br />I found this documentary to brilliantly written and edited and I think it gives a balanced and honest portrayal of the people featured: loving mother and son, &#34;flippant&#34; Australian astrophysicist (Dr. Lion Weaver) and an audience full of skeptical (bordering on rude) students, an astronomer (Dr. Rhagvir Bhathel) who filters signals from deep space, a roomful of folks interested in the topic (members of one of Mary's support groups, I believe), some of whom had actually sighted UFOs, a polygraph tester (Gavin Wilson) for the Federal Police, and two men who claimed to have had close encounters with aliens.<br /><br />The first of these two men, Greg Dinal, claimed he had seen a UFO in 1967, describing it as a reddish ball in the sky that grew until it was as big as a football field. His experiences did not pass the lie detector test, although in telling his story, I found him entirely credible. The second man, Peter Curry, described an incredible experience that happened at 7:15 a.m. in 1992. He awoke to find a blonde female &#34;straddling&#34; him. He obtained evidence (hairs) that were scientifically tested. The DNA results: close to human; rare Chinese Mongoloid type; near African pygmy. The polygraph expert asked him if there were five aliens in his home at Hurlstone Park and he affirmed this. He passed the polygraph test.<br /><br />Mary shows Chris a video of lights in the sky, at night, near Silbury Hill in England, where crop circles have appeared. Neither Mary nor Chris can determine exactly what the lights are.<br /><br />There was nothing in this documentary that caused me to believe that anyone has ever been abducted by aliens, although I do believe it is possible. And the hairs that Peter Curry collected and the subsequent DNA results lend credibility to alien visitations of humans. My own personal belief is that aliens have probably visited Earth, perhaps between 20,000 and 40,000 years ago and possibly more recently. I base this on Puma Punku in Bolivia and some evidence in a documentary titled &#34;Pyramid Code&#34; about ancient sites in Egypt. Erich von Daniken's book, &#34;Chariots of the Gods&#34; (1968) also presented a lot of intriguing evidence. (My belief is that aliens visited Earth and that they might have altered DNA of early people. I have no idea if they have visited us in modern times, but I don't see why not, especially if they want to see the results of their experimentation.) These sites were not covered in &#34;My Mum Talks to Aliens,&#34; which focuses on people who have been abducted.<br /><br />So, like Mary's son Chris, I remain skeptical but open-minded about those individuals who claim to have been abducted by aliens. But Mary believes it, and she is a wonderful supporter of those who claim to have had those experiences.<br /><br />As for crop circles, I suspect that some technical genius(es) in England invented personal drones long before they hit the mainstream. I believe that they then programmed those drones to follow a template, knocking wheat or corn over in fields for whatever reason -- to test the accuracy of their drones, or to baffle the rest of us.\nFighting A Fight She Believes In\n{'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Paul Weitz', 'Roman Coppola', 'Will Graham', 'Patricia Rozema', 'Azazel Jacobs', 'Tricia Brock', 'Gael Garcia Bernal'], 'Producers': ['Paul Weitz', 'Roman Coppola', 'Jason Schwartzman', 'Will Graham'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows'], 'Studio': ['Amazon Studios']}\nI love the series, the actors and the casting. In Season 3 Haley is a fledgling conductor -- I love this (!) -- a profession in which one doesn't typically find a lot of women. I loved the Venice setting in Season 3! The only thing wrong? Each episode is too short.\nIf Music Be The Food Of Love, Play On!\n{'Subtitles': ['None available'], 'Directors': ['Stephen de Vere'], 'Producers': ['Stephen de Vere'], 'Starring': ['British Countryside', 'Barn owl', 'Red fox'], 'Studio': ['Stephen de Vere Wildlife']}\nSuch a beautiful film!<br /><br />Amazing footage of animals in the English countryside.<br /><br />The narration is spot on!<br /><br />I love this and will watch it again.\nWatch It Over & Over -- Deeply Relaxing & Satisfying\nFigure it Out on the Hayduke Trail\nSpecial Interest, Documentary, Adventure\n[\"The Hayduke Trail is an 800-mile route across Utah and Arizona. It's one of the most challenging hikes in America and most of the time there is no trail. The southwest is canyon country and it's extremely remote. Figure it Out is about more than just hiking though, it explains how we can use the lessons learned in the wilderness to live happier and more resilient lives.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alex Maier'], 'Producers': ['Alex Maier'], 'Starring': ['Alex Maier', 'Kurt Bramel']}\nMy husband loves this terrain and he's spent a lot of time biking Utah and Arizona's deserts. We both thought that Alex Maier did a phenomenal job with this film -- interviews, music, etc. -- but especially the editing! And we both appreciated his articulate, eloquent narration. Alex had to navigate tricky spots several times to set up his camera, make the climb, and retrieve his camera. He really captured the essence of America's arid landscape as he backpacked 800 miles across southern Utah and northern Arizona. Some of this terrain is tough! At times he went hours without water and other times he was chest deep in water at the base of steep canyons. A recurring theme is the self-empowerment of solving problems and figuring one's way out of tricky situations. He makes mistakes along the way and accepts those with humor and humility. I loved the recurring footage of shooting stars in the night sky! Well done!\nEloquence & Survival On The Hayduke Trail\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['Português'], 'Subtitles': ['English [CC]'], 'Directors': ['Karim Ainouz'], 'Producers': ['Kaoe Catao', 'Camilo Cavalcanti', 'Mariana Coelho', 'Viola Fugen', 'Marilia Garske', 'Hei Yang Lau', 'Vivi Mendonca', 'Michel Merkt', 'Rodrigo Teixeira', 'Cecile Tollu-Polono'], 'Starring': ['Julia Stockler', 'Carol Duarte', 'Flavia Gusmao'], 'Studio': ['Amazon Studios']}\nI loved this for its realistic portrait of life in general and especially the lives of two women in 1950s Brazil. Guida runs off with a sailor, only to return to her parents home months later. Euridice, a talented pianist, is coerced into a traditional way of life. Their dreams are not supported by the men in their lives. The sisters are separated in their late teens or early twenties and hope to reunite with each other. Interesting plot and great acting!\nTwo Sisters Never Give Up Hope\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ronald Chase'], 'Starring': ['Richard Easton', 'Kristin Milward', 'Anthony Daniels'], 'Studio': ['SF Art & Film Archive']}\nDark and surreal film full of beautiful imagery. I loved about half and I found the other half confusing and annoying with those constant bells. Wonderful actors!\nStrange & Beautiful\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ludovico de Maistre'], 'Starring': ['Ludovico de Maistre']}\nBeautiful short film featuring video of Iceland’s rugged and frigid terrain, accompanied by relaxing music. Amazing images shot entirely on a smartphone!\nIceland’s Frigid, Natural Beauty - Awesome Video & Relaxing Music",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Midnight in Paris\nReview Date: 2011/12/04\nStore: Kathy Bates  (Actor),     Adrien Brody  (Actor),     Woody Allen  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"This is a romantic comedy set in Paris about a family that goes there because of business, and two young people who are engaged to be married in the fall have experiences there that change their lives. It's about a young man's great love for a city, Paris, and the illusion people have that a life different from theirs would be much better.\", 'Amazon.com', 'Paris is a city that lends itself to daydreaming, to walking the streets and imagining all sorts of magic, a quality that Woody Allen understands perfectly.', 'Midnight in Paris', \"is Allen's charming reverie about just that quality, with a screenwriter hero named Gil (Owen Wilson) who strolls the lanes of Paris with his head in the clouds and walks right into his own best fantasy. Gil is there with his materialistic fiancée (Rachel McAdams) and her unpleasant parents, taking a break from his financially rewarding but spiritually unfulfilling Hollywood career--and he can't stop thinking that all he wants to do is quit the movies, move to Paris, and write that novel he's been meaning to finish. You know, be like his heroes in the bohemian Paris of the 1920s. Sure enough, a midnight encounter draws him into the jazzy world of Scott and Zelda Fitzgerald, Picasso and Dali, and an intense Ernest Hemingway, who promises to bring Gil's manuscript to Gertrude Stein for review. Gil wakes up every morning back in the real world, but returning to his enchanted Paris proves fairly easy. In the execution of this marvelous fantasia, Allen pursues the idea that people of every generation have always romanticized a previous age as golden (this is in fact explained to us by Michael Sheen's pedantic art expert), but he also honors Gil's need to find out certain truths for himself. The movie's on the side of gentle fantasy, and it has some literary/cinematic in-jokes that call back to the kind of goofy humor Allen created in\", 'Love and Death', \".The film is guilty of the slackness that Allen's latter-day directing has sometimes shown, and the underwritten roles for McAdams and Marion Cotillard are better acted than written. But the city glows with Allen's romantic sense of it, and Owen Wilson has just the right nice-guy melancholy to put the idea over. A worthy entry in the Cinema of the Daydream.\", '--Robert Horton']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Michael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla BruniMichael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla Bruni  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'MFR043396385269#N', 'Director': 'Woody Allen', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 34 minutes', 'Release date': 'December 20, 2011', 'Actors': 'Kathy Bates, Adrien Brody, Carla Bruni, Marion Cotillard, Rachel McAdams', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Letty Aronson, Stephen Tenenbaum, Jaume Roures', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Woody Allen's love affair with Paris.<br /><br />A winner of a movie! Thanks for this one, Woody Allen, I hope you win an award and I hope this movie wins many. The first minute or two of this film, scenes of Paris with jazz music, was wonderful! (Frankly, I would have preferred classical cello music, but the visuals alone worked beautifully with their sepia overtones.)<br /><br />My favorite scene involved a surrealistic exchange among Dali, Luis Bunuel, Man Ray and our protagonist Gil where they all spoke about a rhinoceros from their individual viewpoints. (Inspired and hilarious -- loved it!) Other great philosophy came from Hemingway. And on writing, Gertrude Stein said it best.<br /><br />Brilliant cast: Kathy Bates as Gertrude Stein, Adrien Brody as Salvador Dali, Tom Hiddleston as F. Scott Fitzgerald and Carla Bruni as museum guide. The part of Owen Wilson would most likely have been played by Woody Allen himself if he had been slightly younger, but Wilson does his best to affect Allen's mannerisms.<br /><br />Paris IS a most beautiful city. I've walked much of Paris in the rain and I agree with one premise of this movie: rain enhances the beauty of Paris. (One of my most invigorating days, ever, was sitting on the top level of an open-air tour bus, in the rain, umbrella open, soaring around Paris from one arrondissement to another.)<br /><br />This is a movie I will want to watch at least once a year as I do with Enchanted April, Amelie, Up At The Villa, It's A Wonderful Life and a few other classics where immeasurable love and skill went into their creation.\nReview Title: Love Affair In And With Paris\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mozart in the Jungle\nReview Date: 2015/03/01\nCategories: Comedy\nProduct Description: ['A new Amazon Original Series: \\xa0What happens behind the curtains at the symphony is just as captivating as what happens on stage. Created by Paul Weitz (About a Boy), Roman Coppola (The Darjeeling Limited), and Jason Schwartzman (Rushmore). Brash new maestro Rodrigo (Gael Garcia Bernal) is stirring things up, and young oboist Hailey (Lola Kirke) hopes for her big chance.']\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Producers': ['ロマン･コッポラ', 'ジェイソン･シュワルツマン', 'ジョン･ストラウス', 'ポール･ワイツ'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows']}\nReview Text: What took me so long to finally tune in to this outstanding series? And where is the next season? (Can't wait!) And, where have you been keeping Gael Garcia Bernal? More, please!<br /><br />The music (!), casting, acting, scripts, directing . . . all brilliant!\nReview Title: Great Music, Great Drama\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/07\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Alcohol use'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Harold Cronk'], 'Producers': ['Michael Scott', 'Russell Wolfe', 'David A.R. White', 'Anna Zielinski', 'Elizabeth Travis'], 'Starring': ['Kevin Sorbo', 'Shane Harper', 'David A.R. White'], 'Studio': ['Lionsgate']}\nReview Text: Josh Wheaton (played by Shane Harper), a student, stands up to a seasoned, yet conflicted professor of philosophy, Professor Radisson (played by Kevin Sorbo) when Josh refuses to write out and sign a statement at the beginning of class, denying the existence of God.<br /><br />I liked this movie. I especially liked the three lectures given by Josh at the end of each of the three classes, trying to prove &#34;God's Not Dead.&#34;\nReview Title: A Matter Of Personal Belief\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/07/06\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Morgan Spurlock'], 'Producers': ['Morgan Spurlock'], 'Starring': ['Yuji Nagatani', 'Cortney Burns', 'Luke Snyder'], 'Studio': ['Kinonation']}\nReview Text: Morgan Spurlock interviews three modern artisans who value traditional methods as they hand manufacture knives, food and pottery.<br /><br />Two men from Georgia, who forge knives can take up to two years to deliver a set of knives or a custom chef's knife. Their company is &#34;Bloodroot Blades,&#34; and they have a fascinating and unique method for turning fabric (or found objects) into knife handles; objects that mean something to the buyer, such as a wedding dress, an apron, or a piano key.<br /><br />In San Francisco, Chefs Courtney Burns and Nick Balla assemble fusions of culinary ingredients at Bar Tartine. They routinely work sixteen hour days and they have a regular clientele devoted to their unique and often spontaneous food creations.<br /><br />In Japan, Mr. Yugi Nagatani and his team make clay cooking pots for a traditional method of steaming foods right at the table.<br /><br />Edgy film editing. Unlike some of his previous films, Spurlock doesn't appear on camera.\nReview Title: The Joy Of The Craft\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Parade's End\nReview Date: 2015/09/08\nStore: Judi Dench  (Actor),     Various  (Director)    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', \"Parade's End (1964) (DVD)\", \"BBC Home Entertainment presents the original 1964 mini-series starring Judi Dench, newly restored from the original film masters! This 1964 film adaptation of the classic novel by Ford Madox Ford shows a young Judi Dench (Skyfall, J. Edgar) in one of her earliest screen roles. Considered by many as one of the pre-eminent literary works of the 20th-century, Parade's End follows Christopher Tietjens (Ronald Hines, Elizabeth R), a wealthy member of Edwardian England's upper class, as the country is drawn into World War One. Tietjens is at the center of a love triangle between his wife Sylvia (Jeanne Moody), a treacherous socialite who is trying to destroy him, and his suffragette mistress, Valentine (Dench). The warfare Tietjens encounters as an officer in Europe is but a backdrop to a personal battle of conflicting loyalties, hidden passions and the rigid social expectations of his day.\", ']]>', 'Amazon.com', 'This introspective adaptation of Ford Madox Ford\\'s four-book series revolves around Yorkshire statistician Christopher Tietjens (Ronald Hines, pale and prickly), a nonconformist living in stiff-upper-lip Edwardian England (screenwriter John Hopkins concentrates on the first three novels in the tetralogy). When war breaks out, Christopher does his patriotic duty, while dreaming of the day \"there will be no more parades.\" In the first part, his spiteful and snobbish wife, Sylvia (Jeanne Moody, overacting in an entertaining manner), leaves him for another man, but Christopher forgoes divorce to avoid a scandal and moves in with his Rossetti-obsessed associate, MacMaster (Fulton Mackay), the kind of arty gentleman who rolls his', 'r', '\\'s. To her mother, Sylvia explains her actions succinctly: \"I hate my husband and I hate my child.\" While she\\'s away, he meets Valentine (Judi Dench, the essence of compassion), a suffragette and pacifist. If Christopher represents the past, Valentine represents the future.', 'Sylvia eventually returns, but Christopher continues to associate with Valentine, to the consternation of his father, who believes the rumors that have been swirling around his son (most of them untrue). As Christopher\\'s brother, Mark (Ronald Leigh-Hunt), tells Valentine, he\\'s \"a fellow who never told a lie or did a dishonorable thing.\" In the next two chapters, Christopher serves as an officer in France and Belgium, loses several of his men, and suffers from posttraumatic stress disorder, which complicates his long-simmering, but unconsummated romance with Valentine. This 1964 version of', \"Parade's End\", \", which aired under the aegis of the BBC's\", 'Theatre 625', ', combines the stagy (abrupt transitions, minimalist sets) with the cinematic (disorienting close-ups, blurred backgrounds), but it increases in interest as the central duo grows closer and builds to a moving finish. In 2012,', 'Sherlock', \"'s Benedict Cumberbatch took on the Tietjens role for a BBC-HBO coproduction.\", '--Kathleen C. Fennessy']\nAverage Rating: 3.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '26356378', 'Director': 'Various', 'Media Format': 'Multiple Formats, Black & White, NTSC, Subtitled', 'Run time': '4 hours and 30 minutes', 'Release date': 'April 16, 2013', 'Actors': 'Judi Dench', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReview Text: There's a new version of Parade's End, a 5-part series (2012) written by Tom Stoppard that is one of the best films I've ever watched. It is definitely one of my &#34;Top 20 All Time Favorite Movies.&#34; Available on Amazon Prime Video or DVD at amazon.com. IMHO: Best director, Best Screenplay, Best Actors, Best Art Direction, Best Cinematography, Best Every Category. All interior scenes look as though they were staged by Vermeer. The casting and the portrayal of the characters by these actors is absolutely stunning!<br /><br />Set during WW1, Christopher Tietjens, one of Britain's most brilliant statisticians finds himself fighting in the trenches. He leaves two women behind: his wealthy wife, Sylvia, and Miss Wannop, a woman he has gradually come to know and love. Sylvia is a manipulative, selfish socialite, and Miss Wannop, a suffragette, is someone with a strong sense of duty (like Tietjens).<br /><br />This 1964 version is okay. It's in black and white. The script is abbreviated. But it is fun seeing Judi Dench, when she was younger, in the role of Miss Wannop.<br /><br />I bought both this DVD and the kindle book (based on the novel by Ford Madox Ford, &#34;No More Parades&#34;).  I have watched this 1964 version once, and I've watched the 2012 version several times. I love this story!\nReview Title: No More Parades\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/12/03\nAverage Rating: 3.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---']}\nReview Text: As a RELAXATION film = 5-STARS. As a PARIS GUIDE = 3.5 STARS. But I did enjoy it -- especially the French Cafe music!<br /><br />This is an artsy 54-minute medley of footage, stills and music. It might be years old, or just made to look that way, with its sepia tinted footage. Film is often shown with music only, no narration, and sometimes they fast forward: cars zoom around Place de la Concorde; people walk at a rapid clip making them look like Weebles.<br /><br />Narration, by a Brit named John Symes who has a most calming tone of voice, is abbreviated; he speaks only about half of the time. But he does manage to inform visitors about sightseeing highlights, including history and culture, and some practical tips, in spite of the trimmed narration.<br /><br />He begins with your arrival at CDG and suggests you take the RoissyBus. (I took it once. I found it to be inexpensive and convenient, since I was staying at a Best Western a few of blocks away from the Paris Opera Garnier.) He also mentions the train and taxis; but taxis can be expensive. One great tip is to google the bus map and print it out, since they're hard to come by. Another is to wear comfortable shoes and walk everywhere.<br /><br />&#34;Must See&#34; places: Eiffel Tower, Louvre (plan to spend a whole day), Carousel under the Louvre to buy Louvre tickets and shop for French souvenirs, Notre Dame Cathedral, Place de la Concorde, Sacre Coeur (I like his tip on watching the sunset from here and visiting Montmartre in the evening), Pompidou Center, Moulin Rouge, Invalides, Palais de Luxembourg, Pantheon (I agree -- a must see! though a bit out of the way), Tuileries Gardens, Grand Palais (the Nazis used it for their tanks during WW2 -- I didn't know this), Forum des Halles for shopping (but he really prefers Carousel), walk along the Seine, go to the theatre (but beware -- it will be in French!). They show Bourse, but don't identify it. They show the inside of Opera Garnier, but don't tell you what you're looking at.<br /><br />When he bemoans the fact that one can't get a cup of real English tea, he says it &#34;tongue in cheek,&#34; I think, and isn't really crying over the fact that English tea isn't served with milk in France, if at all. He recommends orange juice, instead. He points out that Parisians are beautiful to look at (true!), and he says about Paris: it's one of those places it would be a shame not to visit. I so agree!\nReview Title: Artsy & Relaxing With A Sketch Of The Main Sights\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/12/04\nAverage Rating: 3.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['KM Records'], 'Studio': ['TravelVideoStore.com']}\nReview Text: When you only have 14 minutes to discover Paris, this might be the short for you.<br /><br />They start out with the Seine and the Right and Left Banks (Rive Droite and Rive Gauche), a good way for the visitor to get oriented.<br /><br />They move on to Notre Dame de Paris, where Napoleon crowned himself in 1804. (According to legend, he snatched the crown from the hands of Pope Pius VII and crowned himself during the coronation.) This film doesn't show it, but there's a sensational painting by Jacques Louis David that depicts Napoleon crowning Josephine, with Pope Pius VII sitting behind him.<br /><br />Next, they mention the Pont Neuf, &#34;New Bridge,&#34; the oldest bridge in Paris. Then, Cafe Marly, a beautiful vantage point for a view of The Louvre, and of course The Louvre, itself (where you can view the aforementioned painting up close and personal).<br /><br />They mention who must yield to whom when driving a car. (Priorité à droite - the old French system of giving priority to all traffic coming from the right clues you into the fact that you should familiarize yourself with driving rules, and signage. But if you only learn one rule, this would be it, since the entire country is overflowing with traffic circles.)<br /><br />They cover Place de la Concorde, Picasso Museum in the Hotel Sale, Fashion Week, Paris streets at night, Moulin Rouge, Arc de Triomphe, Eiffel Tower, stairs to Sacre Coeur and Montmartre Hill, and La Defense.<br /><br />Narration is good, but choice of background music and sound editing isn't. (Pachelbel Canon while showing Notre Dame de Paris? Non.)\nReview Title: Let's Be Brief -- Some Practical Information\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/01/25\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susanna White'], 'Producers': ['David Parfitt', 'Selwyn Roberts', 'Michele Buck', 'Damien Timmer', 'Ben Donald'], 'Starring': ['Benedict Cumberbatch', 'Rebecca Hall', 'Roger Allam'], 'Studio': ['HBO']}\nReview Text: One of my top five favorite series. I've watched all five episodes many times. (I watched it elsewhere, before it came to Amazon Instant Video. Now that it's on Amazon Instant Video, I can download it so that I can watch it many more times.)<br /><br />Brilliant script by Tom Stoppard. Brilliant casting and the acting couldn't be better! Brilliant direction! Gorgeous set design! Love the music! Remarkable collaboration all around.<br /><br />Two of the episodes show protagonist, Christopher Tietjens in the trenches during WWI. He is one of England's foremost statisticians who would rather be in the trenches than falsify numbers so that the Prime Minister can get his agenda passed. Tietjens is all about duty; he abides by the Edwardian conduct of &#34;parade.&#34; He has a difficult wife and he stays with her through all of the drama she dishes out. Early on, he falls in love with Miss Wannop, but that love isn't consummated for years -- not until after the horrors of war and the societal changes as a result of the war.\nReview Title: A Remarkable Collaboration\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The New Yorker Presents\nReview Date: 2016/03/06\nCategories: Documentary\nProduct Description: [\"From award-winning filmmaker Alex Gibney's Jigsaw Productions, Amazon Prime Video presents a groundbreaking new series that brings America's most award-winning magazine, The New Yorker, to the screen with documentaries, short narrative films, comedy, poetry, animation, and cartoons from the hands of acclaimed filmmakers and artists. Produced by Jigsaw Productions and Condac Nast Entertainment.\"]\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English'], 'Directors': ['Ryan Miller', 'Jyllian Gunther', 'Jed Rothstein', 'Jonathan Demme', 'Shari Springer Berman', 'Janicza Bravo', 'Blair Foster', 'Alex Gibney', 'Steve James', 'Eugene Jarecki'], 'Starring': ['Rachel Aviv', 'Roz Chast', 'Paul Giamatti']}\nReview Text: Love the format and the content.<br /><br />Interesting stories viewed instead of read.\nReview Title: Great Format & Interesting Content\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/03/29\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Emilio Estevez'], 'Producers': ['Julio Fernandez', 'David Alexanian'], 'Starring': ['Martin Sheen', 'Emilio Estevez', 'Deborah Kara Unger'], 'Studio': ['FilmBuff']}\nReview Text: I love, Love, LOVE this film and have watched it many times. This movie has one of the best musical scores, ever! Brilliantly written, acted and directed by Emilio Estevez. This is very much a Sheen/Estevez family affair with contributions by many family members as actors, producers, etc. The casting is spot-on. Sheen and Yorick van Wageningen (as Joost from Amsterdam) really shine in their roles, with wonderful performances by Deborah Kara Unger (as Sarah, with her painful history) and James Nesbitt (as Jack, a writer with &#34;writer's block&#34;).<br /><br />&#34;Margaret Mead didn't become a great cultural anthropologist by staying in school,&#34; says Tom's son Daniel, who has a strong calling to travel the world. So, instead of finishing his doctorate, Daniel travels and unfortunately gets caught in a storm in the Pyrenees. (Again, the cast of characters highlights anthropology/sociology: Captain Henri (Tcheky Karyo), Angelica (Angela Molina), El Ramon (Eusebio Lazaro), are among my favorites, running the gamut of human emotions and circumstances.)<br /><br />*** SPOILER ALERT -- DON'T READ FURTHER IF YOU DON'T WANT TO KNOW WHAT HAPPENS ***<br /><br />Tom goes to Spain's Basque Country to retrieve the body of his only son. He decides to walk The Camino de Santiago from St. Jean Pied de Port to Santiago de Compostela, and then further to Muxia, scattering Daniel's ashes along the way.<br /><br />The spirit of Daniel is very much with Tom along the way. Tom also makes the acquaintance of three other trekkers, or peregrinos, who form close friendships after some early conflicts, underscoring one of my favorite quotes: &#34;To understand all is to forgive all.&#34;<br /><br />Toward the end, the film pays homage to Santiago de Compostela: exterior scenes from the distance and close up, St. James at the entrance, inside the church, and a mass with clergy getting the huge incense burner (botafumeiro) airborne, swinging from the nave to the chancel (an awesome scene!) on its enormous arc.<br /><br />At the suggestion of Ishmael, a gypsy with integrity, Tom goes the extra mile, taking Daniel's remaining ashes to Muxia, to the sea, where Tom reaches catharsis.<br /><br />Scenes of the Spanish countryside highlight the beauty of this route: a field under the Milky Way. A corridor where miracles can happen.<br /><br />Since all four travelers are seeking something along the way that they hope to find resolved by their destination, I could not stop myself from remembering &#34;The Wizard of Oz.&#34; In spite of heartfelt sentiments in both films, I think &#34;The Way&#34; is the more serious of the two.\nReview Title: Epiphany & Catharsis Along The Way\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kundalini Yoga With Grace & Strength\nReview Date: 2016/09/18\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Special Interests\nProduct Description: ['From the Back Cover', 'With Grace & Strength', \"is a video that delivers. This tape gives you the skills to develop & improve your health, strength, flexibility, awareness, creativity, focus, and grace. Carol Carson has designed a video unlike any other. It's a powerful, clear, and inspiring workout on every level. Use it to rid yourself of unconscious habits and attitudes that diminish your health, happiness, energy, and effectiveness.\", 'Carol Carson (Sat Nam Kaur) is a certified Kundalini Yoga Instructor and has been teaching for over a decade. Living in NYC, she works privately as a yoga therapist, teaches classes daily, and gives lectures and workshops. Carol was a professional dancer and has a degree in public service. Her approach is physically practical. It is mentally sensitive and spiritually inspiring. 70 minutes.']\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.4 x 5.1 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'April 10, 2001', 'Actors': 'Carlson, Carol', 'Language': 'English (Dolby Digital 2.0)', 'Studio': 'Wellspring Media'}\nReview Text: I discovered this years ago in video and wanted to update with a DVD version.<br /><br />It's the same brilliant yoga workout on DVD that was on the video.<br /><br />It leaves me feeling absolutely wonderful and has me approaching the transcendental via the physical.<br /><br />Carlson is a master!\nReview Title: Sensitive, Spiritual & Powerful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/09/26\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Tim Kirkby', 'Harry Bradbeer'], 'Producers': ['Two Brothers Pictures Ltd'], 'Starring': ['Phoebe Waller-Bridge', 'Sian Clifford', 'Olivia Colman'], 'Studio': ['Amazon Studios']}\nReview Text: I liked this series quite a bit and I loved the very &#34;quirky&#34; main character, herself, known as &#34;Fleabag.&#34;<br /><br />Actress Phoebe Waller-Bridge is brilliant in the starring role in this BBC series set in modern day London, England.<br /><br />Fleabag is missing her best friend and business partner who has recently died in an unexpected, unpredictable manner. The last episode has a stunning reveal: we find out who was ultimately responsible for her friend's unhappiness that led directly to her death.<br /><br />I admire Fleabag's &#34;survival instincts&#34; as she copes with the rude, the ruthless, the impolite and the clueless people in her life.\nReview Title: Keeping A Stiff Upper Lip\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: My Mum Talks to Aliens\nReview Date: 2016/10/06\nCategories: Special Interest\nProduct Description: [\"Mary Rodwell is a leading authority on extra-terrestrial phenomena; her son Chris Rodwell is a vet, a man of science and self-confessed sceptic. Their relationship has reached a critical point. Mary's beliefs led to the breakdown of her marriage and left a teenage Chris with some emotional scars, so the topic comes with baggage. Trying to keep an open mind, Chris agrees to enter Mary's world.\"]\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Brown']}\nReview Text: In this thought-provoking documentary, Mary Rodwell, therapist to the alien abduction community, travels around Australia with her scientifically minded, skeptical son, Chris in tow.<br /><br />I found this documentary to brilliantly written and edited and I think it gives a balanced and honest portrayal of the people featured: loving mother and son, &#34;flippant&#34; Australian astrophysicist (Dr. Lion Weaver) and an audience full of skeptical (bordering on rude) students, an astronomer (Dr. Rhagvir Bhathel) who filters signals from deep space, a roomful of folks interested in the topic (members of one of Mary's support groups, I believe), some of whom had actually sighted UFOs, a polygraph tester (Gavin Wilson) for the Federal Police, and two men who claimed to have had close encounters with aliens.<br /><br />The first of these two men, Greg Dinal, claimed he had seen a UFO in 1967, describing it as a reddish ball in the sky that grew until it was as big as a football field. His experiences did not pass the lie detector test, although in telling his story, I found him entirely credible. The second man, Peter Curry, described an incredible experience that happened at 7:15 a.m. in 1992. He awoke to find a blonde female &#34;straddling&#34; him. He obtained evidence (hairs) that were scientifically tested. The DNA results: close to human; rare Chinese Mongoloid type; near African pygmy. The polygraph expert asked him if there were five aliens in his home at Hurlstone Park and he affirmed this. He passed the polygraph test.<br /><br />Mary shows Chris a video of lights in the sky, at night, near Silbury Hill in England, where crop circles have appeared. Neither Mary nor Chris can determine exactly what the lights are.<br /><br />There was nothing in this documentary that caused me to believe that anyone has ever been abducted by aliens, although I do believe it is possible. And the hairs that Peter Curry collected and the subsequent DNA results lend credibility to alien visitations of humans. My own personal belief is that aliens have probably visited Earth, perhaps between 20,000 and 40,000 years ago and possibly more recently. I base this on Puma Punku in Bolivia and some evidence in a documentary titled &#34;Pyramid Code&#34; about ancient sites in Egypt. Erich von Daniken's book, &#34;Chariots of the Gods&#34; (1968) also presented a lot of intriguing evidence. (My belief is that aliens visited Earth and that they might have altered DNA of early people. I have no idea if they have visited us in modern times, but I don't see why not, especially if they want to see the results of their experimentation.) These sites were not covered in &#34;My Mum Talks to Aliens,&#34; which focuses on people who have been abducted.<br /><br />So, like Mary's son Chris, I remain skeptical but open-minded about those individuals who claim to have been abducted by aliens. But Mary believes it, and she is a wonderful supporter of those who claim to have had those experiences.<br /><br />As for crop circles, I suspect that some technical genius(es) in England invented personal drones long before they hit the mainstream. I believe that they then programmed those drones to follow a template, knocking wheat or corn over in fields for whatever reason -- to test the accuracy of their drones, or to baffle the rest of us.\nReview Title: Fighting A Fight She Believes In\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/12/17\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Paul Weitz', 'Roman Coppola', 'Will Graham', 'Patricia Rozema', 'Azazel Jacobs', 'Tricia Brock', 'Gael Garcia Bernal'], 'Producers': ['Paul Weitz', 'Roman Coppola', 'Jason Schwartzman', 'Will Graham'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows'], 'Studio': ['Amazon Studios']}\nReview Text: I love the series, the actors and the casting. In Season 3 Haley is a fledgling conductor -- I love this (!) -- a profession in which one doesn't typically find a lot of women. I loved the Venice setting in Season 3! The only thing wrong? Each episode is too short.\nReview Title: If Music Be The Food Of Love, Play On!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/07/09\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Stephen de Vere'], 'Producers': ['Stephen de Vere'], 'Starring': ['British Countryside', 'Barn owl', 'Red fox'], 'Studio': ['Stephen de Vere Wildlife']}\nReview Text: Such a beautiful film!<br /><br />Amazing footage of animals in the English countryside.<br /><br />The narration is spot on!<br /><br />I love this and will watch it again.\nReview Title: Watch It Over & Over -- Deeply Relaxing & Satisfying\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Figure it Out on the Hayduke Trail\nReview Date: 2019/10/27\nCategories: Special Interest, Documentary, Adventure\nProduct Description: [\"The Hayduke Trail is an 800-mile route across Utah and Arizona. It's one of the most challenging hikes in America and most of the time there is no trail. The southwest is canyon country and it's extremely remote. Figure it Out is about more than just hiking though, it explains how we can use the lessons learned in the wilderness to live happier and more resilient lives.\"]\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alex Maier'], 'Producers': ['Alex Maier'], 'Starring': ['Alex Maier', 'Kurt Bramel']}\nReview Text: My husband loves this terrain and he's spent a lot of time biking Utah and Arizona's deserts. We both thought that Alex Maier did a phenomenal job with this film -- interviews, music, etc. -- but especially the editing! And we both appreciated his articulate, eloquent narration. Alex had to navigate tricky spots several times to set up his camera, make the climb, and retrieve his camera. He really captured the essence of America's arid landscape as he backpacked 800 miles across southern Utah and northern Arizona. Some of this terrain is tough! At times he went hours without water and other times he was chest deep in water at the base of steep canyons. A recurring theme is the self-empowerment of solving problems and figuring one's way out of tricky situations. He makes mistakes along the way and accepts those with humor and humility. I loved the recurring footage of shooting stars in the night sky! Well done!\nReview Title: Eloquence & Survival On The Hayduke Trail\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/05/03\nAverage Rating: 4.0\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['Português'], 'Subtitles': ['English [CC]'], 'Directors': ['Karim Ainouz'], 'Producers': ['Kaoe Catao', 'Camilo Cavalcanti', 'Mariana Coelho', 'Viola Fugen', 'Marilia Garske', 'Hei Yang Lau', 'Vivi Mendonca', 'Michel Merkt', 'Rodrigo Teixeira', 'Cecile Tollu-Polono'], 'Starring': ['Julia Stockler', 'Carol Duarte', 'Flavia Gusmao'], 'Studio': ['Amazon Studios']}\nReview Text: I loved this for its realistic portrait of life in general and especially the lives of two women in 1950s Brazil. Guida runs off with a sailor, only to return to her parents home months later. Euridice, a talented pianist, is coerced into a traditional way of life. Their dreams are not supported by the men in their lives. The sisters are separated in their late teens or early twenties and hope to reunite with each other. Interesting plot and great acting!\nReview Title: Two Sisters Never Give Up Hope\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/05/07\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ronald Chase'], 'Starring': ['Richard Easton', 'Kristin Milward', 'Anthony Daniels'], 'Studio': ['SF Art & Film Archive']}\nReview Text: Dark and surreal film full of beautiful imagery. I loved about half and I found the other half confusing and annoying with those constant bells. Wonderful actors!\nReview Title: Strange & Beautiful\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/05/23\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ludovico de Maistre'], 'Starring': ['Ludovico de Maistre']}\nReview Text: Beautiful short film featuring video of Iceland’s rugged and frigid terrain, accompanied by relaxing music. Amazing images shot entirely on a smartphone!\nReview Title: Iceland’s Frigid, Natural Beauty - Awesome Video & Relaxing Music\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a strong preference for romantic and whimsical narratives predominantly set in culturally rich environments, particularly Paris. Their consistent high ratings (averaging above 4.5) for films and documentaries suggest a deep appreciation for artistic storytelling, while they often favor content that evokes nostalgia and introspection. Common themes include a fascination with music, visual arts, and philosophical explorations, often illustrated through character-driven plots with emotional depth.\n\nQuality is paramount, as indicated by their inclination toward well-reviewed and critically acclaimed works, often preferring sophisticated cinematography and talented casting. They are moderately price-sensitive, likely opting for value in their purchases, as seen through their engagement with both mainstream and niche genres. \n\nThe diversity in films—from documentaries about craftsmanship to poignant tales of familial bonds—reveals a curiosity for human experiences and a desire for both inspiration and relaxation. Moreover, their fondness for annual repeat viewings of favorite titles suggests that they cherish familiarity in storytelling while valuing the artistic merits of film and television.\n\nOverall, this person's preferences highlight a blend of romance, artistic expression, philosophical inquiry, and quality storytelling, marked by a consistent enthusiasm for narratives that resonate on multiple emotional and intellectual levels.",
  "target_interaction": {
    "rating": 4.0,
    "title": "The Measure Of A Man",
    "text": "This is a character driven edge of your seat thriller that takes place in the cockpit of an airliner. We almost stopped this movie after hijackers took over the plane, but we stuck with it. It left me feeling a little rattled. But the next day I found myself thinking about the two main characters. One is Tobias Ellis (virtuoso performance by Joseph Gordon-Levitt) the pilot and the other is Vedat (brilliant performance by Omid Memar), a terrorist who wasn't in on the end game of the terrorist's plan. Tobias Ellis, a role model of a human being, keeps his head under horrific circumstances, always putting his concern for others ahead of himself. Vedat is an emotional basket case who trusted his mentor, a man who wanted to draw attention to injustice through terrorism. Once the hijacking occurs, the tension level rises and keeps on rising right up until the penultimate minute. And, today it had me thinking about what a famous peacemaker once said about the true measure of a man and his actions in times of controversy and challenges.",
    "images": [],
    "asin": "B0896V9ZWC",
    "parent_asin": "B0896V9ZWC",
    "user_id": "AE3XHOX3OBSVFXACAPNFMKSUWR5Q",
    "timestamp": "2020-06-26 16:13:08.988000",
    "helpful_vote": 2,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 3.0,
    "rating_number": 2302,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/49bf8025dde8c85a7add76a35f0ffa95bb39bcb401c5306ecdd8b8798621fce3._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/49bf8025dde8c85a7add76a35f0ffa95bb39bcb401c5306ecdd8b8798621fce3._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/49bf8025dde8c85a7add76a35f0ffa95bb39bcb401c5306ecdd8b8798621fce3._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/49bf8025dde8c85a7add76a35f0ffa95bb39bcb401c5306ecdd8b8798621fce3._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/49bf8025dde8c85a7add76a35f0ffa95bb39bcb401c5306ecdd8b8798621fce3._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/49bf8025dde8c85a7add76a35f0ffa95bb39bcb401c5306ecdd8b8798621fce3._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "foul language"
      ],
      "Audio languages": [
        "English Dialogue Boost: High",
        "English",
        "English [Audio Description]",
        "English Dialogue Boost: Medium",
        "Italiano",
        "日本語",
        "Português",
        "Español (España)",
        "Español (Latinoamérica)",
        "Polski",
        "Čeština",
        "Magyar",
        "Français"
      ],
      "Subtitles": [
        "English [CC]",
        "العربية",
        "Čeština",
        "Dansk",
        "Ελληνικά",
        "Español (Latinoamérica)",
        "Español (España)",
        "Suomi",
        "Français",
        "עברית",
        "हिन्दी",
        "Magyar",
        "Indonesia",
        "Italiano",
        "日本語",
        "한국어",
        "Bahasa Melayu",
        "Norsk Bokmål",
        "Nederlands",
        "Polski",
        "Português (Brasil)",
        "Português (Portugal)",
        "Română",
        "Русский",
        "Svenska",
        "தமிழ்",
        "తెలుగు",
        "ไทย",
        "Türkçe",
        "Українська",
        "Tiếng Việt",
        "中文（简体）",
        "中文（繁體）"
      ],
      "Directors": [
        "Patrick Vollrath"
      ],
      "Producers": [
        "Maximilian Leo",
        "Jonas Katzenstein",
        "Franz Novotny",
        "Alexander Glehr"
      ],
      "Starring": [
        "Joseph Gordon-Levitt",
        "Omid Memar",
        "Carlo Kitzlinger"
      ],
      "Studio": [
        "Amazon Studios"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}