{
  "user_id": "AFREWIMOI7CCTUV3KOMHQGFFOYLA",
  "summary": "=== Purchase Information ===\nProduct Title: For the First Time\nReview Date: 2001/02/01\nStore: Format: VHS Tape\nCategories: Movies & TV, Art House & International, By Country, Italy\nProduct Description: ['Brand New VHS tape; factory sealed (as shown) \"For the First Time [VHS]\" FAST shipping (A-16)']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'April 26, 1995', 'Date First Available': 'January 27, 2007', 'Actors': 'Lanza, Gabor, Von Koczian', 'Studio': 'Warner Studios'}\nReview Text: &quot;For the First Time&quot; is my personal favorite and one of the best Mario Lanza pictures. His voice, magnificent.  The movie is a  tender love story filled with great music from opera to pop. Why the cd of the soundtrack does not contain the delightful &quot;Cosi&quot; trio is a mystery. Mario's supporting player are all first rate.  How Mario must have revelled in playing a difficult opera singer. This film contain some of his best singing. What might we have had if he had only lived, or been better treated by  the studio system. An all around treat not to be missed.\nReview Title: Bittersweet Swansong\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Magoo's Christmas Carol\nReview Date: 2001/11/19\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['Product description', 'This 1962 special marked the last hurrah of Mr. Magoo, who starred in 43 cartoon shorts, including two Oscar winners, from the UPA Studio between 1949 and 1959. Magoo appears as Scrooge in a Broadway production of \"A Christmas Carol\" in this minimally animated hour. The play-within-the-show features forgettable songs by Jules Styne and Bob Merrill: Tiny Tim (\"played\" by the animated character Gerald McBoing-Boing) sings, oddly, of \"razzle berry dressing\" and \"woofle jelly cake.\" This retelling of Dickens\\'s holiday standard is much tamer than Richard Williams\\'s Oscar-winning adaptation: the ghosts aren\\'t scary, nor does Magoo confront the specters of Ignorance and Want. Small children who might be frightened by more dramatic versions of the story will enjoy this mild program. And the self-satisfied chuckles and bromides Jim Backus gives Magoo in his lighter moments remain as delightful as ever. This film is suitable for ages 6 and older.', '--Charles Solomon', 'Amazon.com', 'This 1962 special marked the last hurrah of Mr. Magoo, who starred in 43 cartoon shorts, including two Oscar® winners, from the UPA Studio between 1949 and 1959. Magoo appears as Scrooge in a Broadway production of \"A Christmas Carol\" in this minimally animated hour. The play-within-the-show features forgettable songs by Jules Styne and Bob Merrill: Tiny Tim (\"played\" by the animated character Gerald McBoing-Boing) sings, oddly, of \"razzle berry dressing\" and \"woofle jelly cake.\" This retelling of Dickens\\'s holiday standard is much tamer than Richard Williams\\'s Oscar-winning adaptation: the ghosts aren\\'t scary, nor does Magoo confront the specters of Ignorance and Want. Small children who might be frightened by more dramatic versions of the story will enjoy this mild program. And the self-satisfied chuckles and bromides Jim Backus gives Magoo in his lighter moments remain as delightful as ever. This film is suitable for ages 6 and older.', '--Charles Solomon', 'From the Back Cover', \"A family favorite for almost forty years, this animated special marks a merry marriage between one of the screen's greatest cartoon characters, Mr. Magoo, and the heart-warming holiday tale.\", 'A Christmas Carol', '. Jim Backus (', \"Gilligan's Island\", ') lends his unmistakable voice to the lovably near-sighted Magoo, who stars in a Broadway version of the Charles Dickens tale, impeccably cast as the crotchety old Ebenezer Scrooge. With music by Jules Styne and Bob Merrill, Oscar nominees for the song', 'Funny Girl', ', it features the vocal talents of Jack Cassidy, Morey Amsterdam, and June Foray (the voice of Rocket J. \"Rocky\" Squirrel).', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.09 x 5.43 x 0.59 inches; 2.89 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'October 23, 2001', 'Actors': 'Mr. Magoo', 'Language': 'English', 'Studio': 'Good Times Video'}\nReview Text: Anyone who was a child in the early 60's can remember with great delight the yearly showing of this Christmas Classic. How often do you get a great composer like Jule Styne and great lyric writer like Bob Merrill to write a fantastic score for a children's cartoon. They took a little time off from what was their then current project &quot;Funny Girl&quot; to write the unforgettable songs. The vocal talents of the cast are great. Jim<br />Backus' Mr Magoo is always in character as Scrooge. Jack Cassidy<br />June Foray and the rest of the cast are equally fantastic.<br />The DVD itself is fine - The colors are well represented and the image itself is sharp - not as sharp as a film made today but remember this is from 1962!! and though it has been put through a<br />Dolby noise reduction the sound track has some tape hiss which is to be expected for a mono track from this time. The disc has some<br />nice extras. Over all it a great disc and it's a must for family holiday viewing . Glad to have it on DVD!!!!!!!!!\nReview Title: &quot;It's Great to be back, back, back ....&quot;\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hard Nut\nReview Date: 2007/11/18\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Ballet & Dance\nProduct Description: ['Mark Morris Dance Gro']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Mv-Pop', 'Format': 'Multiple Formats, NTSC, Classical', 'Contributor': 'Mark Morris Dance Group', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '3346066', 'Media Format': 'Multiple Formats, NTSC, Classical', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 16, 2007', 'Actors': 'Mark Morris Dance Group', 'Studio': 'Nonesuch', 'Number of discs': '1'}\nReview Text: Mark Morris' verison of Tchaikovsky's  ballet is a treat that shouldn't be missed. Updated to the 1960's and staged in what can only be discribed as a giant comic book like setting, it brings a new freshness and twist to the  classic story. From the machanical Barbi Doll and Robot gifts that are brought by Drosselmeyer, to the G.I. Joes fighting the mice, to the Yule log on the TV screen its a lot of fun add to that Morris' clever and original choreography it is a great way to spend an evening. I don't think this has been shown since its first airing on PBS many years ago, and I'm glad to finally have it on DVD as my tape was almost worn out. Give it a try.\nReview Title: Great Retelling of the Classic Ballet\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Happy Feet Two\nReview Date: 2012/02/07\nStore: Elijah Wood  (Actor),     Pink  (Actor),     George Miller  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'The sequel to \"Happy Feet\", the Academy Award®-winning animated smash hit, \"Happy Feet Two\" returns audiences to the magnificent landscape of Antarctica. Mumble, The Master of Tap, has a problem because his tiny son, Erik, is choreo-phobic. Reluctant to dance, Erik runs away and encounters The Mighty Sven - a penguin who can fly! Mumble has no hope of competing with this charismatic new role model. But things get worse when the world is shaken by powerful forces. Erik learns of his father\\'s \"guts and grit\" as Mumble brings together the penguin nations and all manner of fabulous creatures - from tiny Krill to giant Elephant Seals - to put things right.', 'Amazon.com', 'The sequel', 'Happy Feet 2', \"begins a few years after the 2006 original ended: Mumble (voiced by Elijah Wood) is now married to Gloria (Pink) and the father of Erik (Ava Acres), a chick who's afraid to dance. When Erik sees the puffin Mighty Sven (Hank Azaria), he decides he can learn to fly: Sven is the leader of a cult that preaches if you believe it, it can happen. An unexplained seismic event causes a glacier to shift, trapping Gloria and all the other emperor penguins: Mumble, Erik, and two other chicks must rescue them before they starve. What begins as a familiar story about a diffident chick quickly becomes needlessly and hopelessly mired in subplots involving elephant seals, skua gulls, human explorers, and a pair of renegade krill (voiced by Brad Pitt and Matt Damon). The motion-capture animation is adequate at best, with snow and water splashing around the dancing penguins to hide the fact that their feet aren't making contact with the ground plane. Endless tracking shots over the cracking glaciers recall the second\", 'Ice Age', 'movie. The vocal performances feature a discordant mélange of accents, with African-American, Latino, and British penguins, surfer-dude krill, Australian seals, and \"fugeddaboutit\"', 'Jersey Shore', 'seagulls. Even more jarring is the presence of human actors who appear out of nowhere, start to help the trapped penguins, then disappear. The standard-issue poop and snot jokes do little to leaven the nonstop nattering.', 'Happy Feet 2', 'confirms 2011 as the year of the unnecessary sequel in American animation. (Rated PG for some rude humor and mild peril)', '--Charles Solomon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, ComedyMusicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, Comedy  See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Elijah Wood, Pink, George Miller', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 39 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000168080DVD', 'Director': 'George Miller', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'March 13, 2012', 'Actors': 'Elijah Wood, Pink', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros. Pictures', 'Number of discs': '1'}\nReview Text: This will go down as the \"Plan 9 From Outer Space\" of animated films but without Plan 9's humor, wit, more coherent script or better production values.\nReview Title: What were they thinking.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: On the Town\nReview Date: 2015/05/14\nStore: Various  (Actor, Director)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['On the Town (BD)', 'New York, New York, it’s a wonderful town – especially when sailors Gene Kelly, Frank Sinatra and Jules Munshin have a 24-hour shore leave to see the sights… and when those sights include Ann Miller, Betty Garrett and Vera-Ellen.  Co-directed by Kelly and Stanley Donen, based on the Broadway hit and set to an Academy Award®-winning* adaptation score, On the Town changed the landscape of movie musicals, opening filmmakers’ eyes to what could be done on location. And when brilliant location and studio production numbers are blended, it could be – as here – ebullient, up-and-at-’em perfection. The Bronx is up and the Battery’s down, but no one can be down after going On the Town.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '1000530196', 'Director': 'Various', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 5, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: Having recently seen the excellent revival on Broadway, I decided to go back and see this version of the musical which I hadn't seen since it came out years ago on DVD . All I can say is after viewing it all I can say is that this was 98 min of my life that I will never get back.  Bernstein's great score is almost entirely discarded in favor of what can't even be called mediocrity; Comden and Green have matched the insipid music with equally insipid lyrics for the new songs.  I can only guess that they must have had guns pointed to their heads and forced to work. The cast does what it can with the poor material but even their valiant efforts can't make this rise above the level of drivel.  I know this was the `40's and Broadway was way ahead of Hollywood  in handling  anything with even the hint of being risqué, but  the whitewashed plot leaves this picture with nothing but another run of the mill story.  Hollywood has almost always had a very hard time translating Broadway hits into movies, for me the most successful outcomes being \"The Music Man\" and \"1776\"  but if you wrote a book on how not to do it , \"On The Town\" would be your example.  The Movie is I feel  also lacking all the energy and joy of the Broadway version.  Add to that the insult that the Blu-ray transfer looks like it was done without any attempt at restoration or care. Images aren't particularly sharp and the fine details you see when care is taken in doing the transfer like in \"Singing in the Rain\" are missing.  The best you can say is that it looks better than the old dvd version.  If you want to see Sinatra and Kelly as sailors then watch the superior, despite its also lack luster transfer to Blu-ray, \"Anchors Aweigh\" with its wonderful score by Jule Styne /Sammy Cahn  and the added pleasure of seeing the great pianist, Jose Iturbi  (who I meet years ago and was one of the nicest and most endearing people I have ever met)and watching (with no offense to the incomparable Ann Miller) the dancing of Kelly with Jerry the Mouse. It will be a better spending of you movie time.\nReview Title: Be thankful for a good cast.\nRating: 2.0\n--------------------------------------------------",
  "reference": "For the First Time\nFormat: VHS Tape\nMovies & TV, Art House & International, By Country, Italy\n['Brand New VHS tape; factory sealed (as shown) \"For the First Time [VHS]\" FAST shipping (A-16)']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'April 26, 1995', 'Date First Available': 'January 27, 2007', 'Actors': 'Lanza, Gabor, Von Koczian', 'Studio': 'Warner Studios'}\n&quot;For the First Time&quot; is my personal favorite and one of the best Mario Lanza pictures. His voice, magnificent.  The movie is a  tender love story filled with great music from opera to pop. Why the cd of the soundtrack does not contain the delightful &quot;Cosi&quot; trio is a mystery. Mario's supporting player are all first rate.  How Mario must have revelled in playing a difficult opera singer. This film contain some of his best singing. What might we have had if he had only lived, or been better treated by  the studio system. An all around treat not to be missed.\nBittersweet Swansong\nMr. Magoo's Christmas Carol\nRated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Product description', 'This 1962 special marked the last hurrah of Mr. Magoo, who starred in 43 cartoon shorts, including two Oscar winners, from the UPA Studio between 1949 and 1959. Magoo appears as Scrooge in a Broadway production of \"A Christmas Carol\" in this minimally animated hour. The play-within-the-show features forgettable songs by Jules Styne and Bob Merrill: Tiny Tim (\"played\" by the animated character Gerald McBoing-Boing) sings, oddly, of \"razzle berry dressing\" and \"woofle jelly cake.\" This retelling of Dickens\\'s holiday standard is much tamer than Richard Williams\\'s Oscar-winning adaptation: the ghosts aren\\'t scary, nor does Magoo confront the specters of Ignorance and Want. Small children who might be frightened by more dramatic versions of the story will enjoy this mild program. And the self-satisfied chuckles and bromides Jim Backus gives Magoo in his lighter moments remain as delightful as ever. This film is suitable for ages 6 and older.', '--Charles Solomon', 'Amazon.com', 'This 1962 special marked the last hurrah of Mr. Magoo, who starred in 43 cartoon shorts, including two Oscar® winners, from the UPA Studio between 1949 and 1959. Magoo appears as Scrooge in a Broadway production of \"A Christmas Carol\" in this minimally animated hour. The play-within-the-show features forgettable songs by Jules Styne and Bob Merrill: Tiny Tim (\"played\" by the animated character Gerald McBoing-Boing) sings, oddly, of \"razzle berry dressing\" and \"woofle jelly cake.\" This retelling of Dickens\\'s holiday standard is much tamer than Richard Williams\\'s Oscar-winning adaptation: the ghosts aren\\'t scary, nor does Magoo confront the specters of Ignorance and Want. Small children who might be frightened by more dramatic versions of the story will enjoy this mild program. And the self-satisfied chuckles and bromides Jim Backus gives Magoo in his lighter moments remain as delightful as ever. This film is suitable for ages 6 and older.', '--Charles Solomon', 'From the Back Cover', \"A family favorite for almost forty years, this animated special marks a merry marriage between one of the screen's greatest cartoon characters, Mr. Magoo, and the heart-warming holiday tale.\", 'A Christmas Carol', '. Jim Backus (', \"Gilligan's Island\", ') lends his unmistakable voice to the lovably near-sighted Magoo, who stars in a Broadway version of the Charles Dickens tale, impeccably cast as the crotchety old Ebenezer Scrooge. With music by Jules Styne and Bob Merrill, Oscar nominees for the song', 'Funny Girl', ', it features the vocal talents of Jack Cassidy, Morey Amsterdam, and June Foray (the voice of Rocket J. \"Rocky\" Squirrel).', 'See more']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.09 x 5.43 x 0.59 inches; 2.89 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'October 23, 2001', 'Actors': 'Mr. Magoo', 'Language': 'English', 'Studio': 'Good Times Video'}\nAnyone who was a child in the early 60's can remember with great delight the yearly showing of this Christmas Classic. How often do you get a great composer like Jule Styne and great lyric writer like Bob Merrill to write a fantastic score for a children's cartoon. They took a little time off from what was their then current project &quot;Funny Girl&quot; to write the unforgettable songs. The vocal talents of the cast are great. Jim<br />Backus' Mr Magoo is always in character as Scrooge. Jack Cassidy<br />June Foray and the rest of the cast are equally fantastic.<br />The DVD itself is fine - The colors are well represented and the image itself is sharp - not as sharp as a film made today but remember this is from 1962!! and though it has been put through a<br />Dolby noise reduction the sound track has some tape hiss which is to be expected for a mono track from this time. The disc has some<br />nice extras. Over all it a great disc and it's a must for family holiday viewing . Glad to have it on DVD!!!!!!!!!\n&quot;It's Great to be back, back, back ....&quot;\nThe Hard Nut\nRated:    Unrated    Format: DVD\nMovies & TV, Musicals & Performing Arts, Ballet & Dance\n['Mark Morris Dance Gro']\n{'Genre': 'Mv-Pop', 'Format': 'Multiple Formats, NTSC, Classical', 'Contributor': 'Mark Morris Dance Group', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '3346066', 'Media Format': 'Multiple Formats, NTSC, Classical', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 16, 2007', 'Actors': 'Mark Morris Dance Group', 'Studio': 'Nonesuch', 'Number of discs': '1'}\nMark Morris' verison of Tchaikovsky's  ballet is a treat that shouldn't be missed. Updated to the 1960's and staged in what can only be discribed as a giant comic book like setting, it brings a new freshness and twist to the  classic story. From the machanical Barbi Doll and Robot gifts that are brought by Drosselmeyer, to the G.I. Joes fighting the mice, to the Yule log on the TV screen its a lot of fun add to that Morris' clever and original choreography it is a great way to spend an evening. I don't think this has been shown since its first airing on PBS many years ago, and I'm glad to finally have it on DVD as my tape was almost worn out. Give it a try.\nGreat Retelling of the Classic Ballet\nHappy Feet Two\nElijah Wood  (Actor),     Pink  (Actor),     George Miller  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The sequel to \"Happy Feet\", the Academy Award®-winning animated smash hit, \"Happy Feet Two\" returns audiences to the magnificent landscape of Antarctica. Mumble, The Master of Tap, has a problem because his tiny son, Erik, is choreo-phobic. Reluctant to dance, Erik runs away and encounters The Mighty Sven - a penguin who can fly! Mumble has no hope of competing with this charismatic new role model. But things get worse when the world is shaken by powerful forces. Erik learns of his father\\'s \"guts and grit\" as Mumble brings together the penguin nations and all manner of fabulous creatures - from tiny Krill to giant Elephant Seals - to put things right.', 'Amazon.com', 'The sequel', 'Happy Feet 2', \"begins a few years after the 2006 original ended: Mumble (voiced by Elijah Wood) is now married to Gloria (Pink) and the father of Erik (Ava Acres), a chick who's afraid to dance. When Erik sees the puffin Mighty Sven (Hank Azaria), he decides he can learn to fly: Sven is the leader of a cult that preaches if you believe it, it can happen. An unexplained seismic event causes a glacier to shift, trapping Gloria and all the other emperor penguins: Mumble, Erik, and two other chicks must rescue them before they starve. What begins as a familiar story about a diffident chick quickly becomes needlessly and hopelessly mired in subplots involving elephant seals, skua gulls, human explorers, and a pair of renegade krill (voiced by Brad Pitt and Matt Damon). The motion-capture animation is adequate at best, with snow and water splashing around the dancing penguins to hide the fact that their feet aren't making contact with the ground plane. Endless tracking shots over the cracking glaciers recall the second\", 'Ice Age', 'movie. The vocal performances feature a discordant mélange of accents, with African-American, Latino, and British penguins, surfer-dude krill, Australian seals, and \"fugeddaboutit\"', 'Jersey Shore', 'seagulls. Even more jarring is the presence of human actors who appear out of nowhere, start to help the trapped penguins, then disappear. The standard-issue poop and snot jokes do little to leaven the nonstop nattering.', 'Happy Feet 2', 'confirms 2011 as the year of the unnecessary sequel in American animation. (Rated PG for some rude humor and mild peril)', '--Charles Solomon']\n{'Genre': 'Musicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, ComedyMusicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, Comedy  See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Elijah Wood, Pink, George Miller', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 39 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000168080DVD', 'Director': 'George Miller', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'March 13, 2012', 'Actors': 'Elijah Wood, Pink', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros. Pictures', 'Number of discs': '1'}\nThis will go down as the \"Plan 9 From Outer Space\" of animated films but without Plan 9's humor, wit, more coherent script or better production values.\nWhat were they thinking.\nOn the Town\nVarious  (Actor, Director)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['On the Town (BD)', 'New York, New York, it’s a wonderful town – especially when sailors Gene Kelly, Frank Sinatra and Jules Munshin have a 24-hour shore leave to see the sights… and when those sights include Ann Miller, Betty Garrett and Vera-Ellen.  Co-directed by Kelly and Stanley Donen, based on the Broadway hit and set to an Academy Award®-winning* adaptation score, On the Town changed the landscape of movie musicals, opening filmmakers’ eyes to what could be done on location. And when brilliant location and studio production numbers are blended, it could be – as here – ebullient, up-and-at-’em perfection. The Bronx is up and the Battery’s down, but no one can be down after going On the Town.', ']]>']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '1000530196', 'Director': 'Various', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 5, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nHaving recently seen the excellent revival on Broadway, I decided to go back and see this version of the musical which I hadn't seen since it came out years ago on DVD . All I can say is after viewing it all I can say is that this was 98 min of my life that I will never get back.  Bernstein's great score is almost entirely discarded in favor of what can't even be called mediocrity; Comden and Green have matched the insipid music with equally insipid lyrics for the new songs.  I can only guess that they must have had guns pointed to their heads and forced to work. The cast does what it can with the poor material but even their valiant efforts can't make this rise above the level of drivel.  I know this was the `40's and Broadway was way ahead of Hollywood  in handling  anything with even the hint of being risqué, but  the whitewashed plot leaves this picture with nothing but another run of the mill story.  Hollywood has almost always had a very hard time translating Broadway hits into movies, for me the most successful outcomes being \"The Music Man\" and \"1776\"  but if you wrote a book on how not to do it , \"On The Town\" would be your example.  The Movie is I feel  also lacking all the energy and joy of the Broadway version.  Add to that the insult that the Blu-ray transfer looks like it was done without any attempt at restoration or care. Images aren't particularly sharp and the fine details you see when care is taken in doing the transfer like in \"Singing in the Rain\" are missing.  The best you can say is that it looks better than the old dvd version.  If you want to see Sinatra and Kelly as sailors then watch the superior, despite its also lack luster transfer to Blu-ray, \"Anchors Aweigh\" with its wonderful score by Jule Styne /Sammy Cahn  and the added pleasure of seeing the great pianist, Jose Iturbi  (who I meet years ago and was one of the nicest and most endearing people I have ever met)and watching (with no offense to the incomparable Ann Miller) the dancing of Kelly with Jerry the Mouse. It will be a better spending of you movie time.\nBe thankful for a good cast.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: For the First Time\nReview Date: 2001/02/01\nStore: Format: VHS Tape\nCategories: Movies & TV, Art House & International, By Country, Italy\nProduct Description: ['Brand New VHS tape; factory sealed (as shown) \"For the First Time [VHS]\" FAST shipping (A-16)']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'April 26, 1995', 'Date First Available': 'January 27, 2007', 'Actors': 'Lanza, Gabor, Von Koczian', 'Studio': 'Warner Studios'}\nReview Text: &quot;For the First Time&quot; is my personal favorite and one of the best Mario Lanza pictures. His voice, magnificent.  The movie is a  tender love story filled with great music from opera to pop. Why the cd of the soundtrack does not contain the delightful &quot;Cosi&quot; trio is a mystery. Mario's supporting player are all first rate.  How Mario must have revelled in playing a difficult opera singer. This film contain some of his best singing. What might we have had if he had only lived, or been better treated by  the studio system. An all around treat not to be missed.\nReview Title: Bittersweet Swansong\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Magoo's Christmas Carol\nReview Date: 2001/11/19\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['Product description', 'This 1962 special marked the last hurrah of Mr. Magoo, who starred in 43 cartoon shorts, including two Oscar winners, from the UPA Studio between 1949 and 1959. Magoo appears as Scrooge in a Broadway production of \"A Christmas Carol\" in this minimally animated hour. The play-within-the-show features forgettable songs by Jules Styne and Bob Merrill: Tiny Tim (\"played\" by the animated character Gerald McBoing-Boing) sings, oddly, of \"razzle berry dressing\" and \"woofle jelly cake.\" This retelling of Dickens\\'s holiday standard is much tamer than Richard Williams\\'s Oscar-winning adaptation: the ghosts aren\\'t scary, nor does Magoo confront the specters of Ignorance and Want. Small children who might be frightened by more dramatic versions of the story will enjoy this mild program. And the self-satisfied chuckles and bromides Jim Backus gives Magoo in his lighter moments remain as delightful as ever. This film is suitable for ages 6 and older.', '--Charles Solomon', 'Amazon.com', 'This 1962 special marked the last hurrah of Mr. Magoo, who starred in 43 cartoon shorts, including two Oscar® winners, from the UPA Studio between 1949 and 1959. Magoo appears as Scrooge in a Broadway production of \"A Christmas Carol\" in this minimally animated hour. The play-within-the-show features forgettable songs by Jules Styne and Bob Merrill: Tiny Tim (\"played\" by the animated character Gerald McBoing-Boing) sings, oddly, of \"razzle berry dressing\" and \"woofle jelly cake.\" This retelling of Dickens\\'s holiday standard is much tamer than Richard Williams\\'s Oscar-winning adaptation: the ghosts aren\\'t scary, nor does Magoo confront the specters of Ignorance and Want. Small children who might be frightened by more dramatic versions of the story will enjoy this mild program. And the self-satisfied chuckles and bromides Jim Backus gives Magoo in his lighter moments remain as delightful as ever. This film is suitable for ages 6 and older.', '--Charles Solomon', 'From the Back Cover', \"A family favorite for almost forty years, this animated special marks a merry marriage between one of the screen's greatest cartoon characters, Mr. Magoo, and the heart-warming holiday tale.\", 'A Christmas Carol', '. Jim Backus (', \"Gilligan's Island\", ') lends his unmistakable voice to the lovably near-sighted Magoo, who stars in a Broadway version of the Charles Dickens tale, impeccably cast as the crotchety old Ebenezer Scrooge. With music by Jules Styne and Bob Merrill, Oscar nominees for the song', 'Funny Girl', ', it features the vocal talents of Jack Cassidy, Morey Amsterdam, and June Foray (the voice of Rocket J. \"Rocky\" Squirrel).', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.09 x 5.43 x 0.59 inches; 2.89 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'October 23, 2001', 'Actors': 'Mr. Magoo', 'Language': 'English', 'Studio': 'Good Times Video'}\nReview Text: Anyone who was a child in the early 60's can remember with great delight the yearly showing of this Christmas Classic. How often do you get a great composer like Jule Styne and great lyric writer like Bob Merrill to write a fantastic score for a children's cartoon. They took a little time off from what was their then current project &quot;Funny Girl&quot; to write the unforgettable songs. The vocal talents of the cast are great. Jim<br />Backus' Mr Magoo is always in character as Scrooge. Jack Cassidy<br />June Foray and the rest of the cast are equally fantastic.<br />The DVD itself is fine - The colors are well represented and the image itself is sharp - not as sharp as a film made today but remember this is from 1962!! and though it has been put through a<br />Dolby noise reduction the sound track has some tape hiss which is to be expected for a mono track from this time. The disc has some<br />nice extras. Over all it a great disc and it's a must for family holiday viewing . Glad to have it on DVD!!!!!!!!!\nReview Title: &quot;It's Great to be back, back, back ....&quot;\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hard Nut\nReview Date: 2007/11/18\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Ballet & Dance\nProduct Description: ['Mark Morris Dance Gro']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Mv-Pop', 'Format': 'Multiple Formats, NTSC, Classical', 'Contributor': 'Mark Morris Dance Group', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '3346066', 'Media Format': 'Multiple Formats, NTSC, Classical', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 16, 2007', 'Actors': 'Mark Morris Dance Group', 'Studio': 'Nonesuch', 'Number of discs': '1'}\nReview Text: Mark Morris' verison of Tchaikovsky's  ballet is a treat that shouldn't be missed. Updated to the 1960's and staged in what can only be discribed as a giant comic book like setting, it brings a new freshness and twist to the  classic story. From the machanical Barbi Doll and Robot gifts that are brought by Drosselmeyer, to the G.I. Joes fighting the mice, to the Yule log on the TV screen its a lot of fun add to that Morris' clever and original choreography it is a great way to spend an evening. I don't think this has been shown since its first airing on PBS many years ago, and I'm glad to finally have it on DVD as my tape was almost worn out. Give it a try.\nReview Title: Great Retelling of the Classic Ballet\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Happy Feet Two\nReview Date: 2012/02/07\nStore: Elijah Wood  (Actor),     Pink  (Actor),     George Miller  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'The sequel to \"Happy Feet\", the Academy Award®-winning animated smash hit, \"Happy Feet Two\" returns audiences to the magnificent landscape of Antarctica. Mumble, The Master of Tap, has a problem because his tiny son, Erik, is choreo-phobic. Reluctant to dance, Erik runs away and encounters The Mighty Sven - a penguin who can fly! Mumble has no hope of competing with this charismatic new role model. But things get worse when the world is shaken by powerful forces. Erik learns of his father\\'s \"guts and grit\" as Mumble brings together the penguin nations and all manner of fabulous creatures - from tiny Krill to giant Elephant Seals - to put things right.', 'Amazon.com', 'The sequel', 'Happy Feet 2', \"begins a few years after the 2006 original ended: Mumble (voiced by Elijah Wood) is now married to Gloria (Pink) and the father of Erik (Ava Acres), a chick who's afraid to dance. When Erik sees the puffin Mighty Sven (Hank Azaria), he decides he can learn to fly: Sven is the leader of a cult that preaches if you believe it, it can happen. An unexplained seismic event causes a glacier to shift, trapping Gloria and all the other emperor penguins: Mumble, Erik, and two other chicks must rescue them before they starve. What begins as a familiar story about a diffident chick quickly becomes needlessly and hopelessly mired in subplots involving elephant seals, skua gulls, human explorers, and a pair of renegade krill (voiced by Brad Pitt and Matt Damon). The motion-capture animation is adequate at best, with snow and water splashing around the dancing penguins to hide the fact that their feet aren't making contact with the ground plane. Endless tracking shots over the cracking glaciers recall the second\", 'Ice Age', 'movie. The vocal performances feature a discordant mélange of accents, with African-American, Latino, and British penguins, surfer-dude krill, Australian seals, and \"fugeddaboutit\"', 'Jersey Shore', 'seagulls. Even more jarring is the presence of human actors who appear out of nowhere, start to help the trapped penguins, then disappear. The standard-issue poop and snot jokes do little to leaven the nonstop nattering.', 'Happy Feet 2', 'confirms 2011 as the year of the unnecessary sequel in American animation. (Rated PG for some rude humor and mild peril)', '--Charles Solomon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, ComedyMusicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, Comedy  See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Elijah Wood, Pink, George Miller', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 39 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000168080DVD', 'Director': 'George Miller', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'March 13, 2012', 'Actors': 'Elijah Wood, Pink', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros. Pictures', 'Number of discs': '1'}\nReview Text: This will go down as the \"Plan 9 From Outer Space\" of animated films but without Plan 9's humor, wit, more coherent script or better production values.\nReview Title: What were they thinking.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: On the Town\nReview Date: 2015/05/14\nStore: Various  (Actor, Director)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['On the Town (BD)', 'New York, New York, it’s a wonderful town – especially when sailors Gene Kelly, Frank Sinatra and Jules Munshin have a 24-hour shore leave to see the sights… and when those sights include Ann Miller, Betty Garrett and Vera-Ellen.  Co-directed by Kelly and Stanley Donen, based on the Broadway hit and set to an Academy Award®-winning* adaptation score, On the Town changed the landscape of movie musicals, opening filmmakers’ eyes to what could be done on location. And when brilliant location and studio production numbers are blended, it could be – as here – ebullient, up-and-at-’em perfection. The Bronx is up and the Battery’s down, but no one can be down after going On the Town.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '1000530196', 'Director': 'Various', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 5, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: Having recently seen the excellent revival on Broadway, I decided to go back and see this version of the musical which I hadn't seen since it came out years ago on DVD . All I can say is after viewing it all I can say is that this was 98 min of my life that I will never get back.  Bernstein's great score is almost entirely discarded in favor of what can't even be called mediocrity; Comden and Green have matched the insipid music with equally insipid lyrics for the new songs.  I can only guess that they must have had guns pointed to their heads and forced to work. The cast does what it can with the poor material but even their valiant efforts can't make this rise above the level of drivel.  I know this was the `40's and Broadway was way ahead of Hollywood  in handling  anything with even the hint of being risqué, but  the whitewashed plot leaves this picture with nothing but another run of the mill story.  Hollywood has almost always had a very hard time translating Broadway hits into movies, for me the most successful outcomes being \"The Music Man\" and \"1776\"  but if you wrote a book on how not to do it , \"On The Town\" would be your example.  The Movie is I feel  also lacking all the energy and joy of the Broadway version.  Add to that the insult that the Blu-ray transfer looks like it was done without any attempt at restoration or care. Images aren't particularly sharp and the fine details you see when care is taken in doing the transfer like in \"Singing in the Rain\" are missing.  The best you can say is that it looks better than the old dvd version.  If you want to see Sinatra and Kelly as sailors then watch the superior, despite its also lack luster transfer to Blu-ray, \"Anchors Aweigh\" with its wonderful score by Jule Styne /Sammy Cahn  and the added pleasure of seeing the great pianist, Jose Iturbi  (who I meet years ago and was one of the nicest and most endearing people I have ever met)and watching (with no offense to the incomparable Ann Miller) the dancing of Kelly with Jerry the Mouse. It will be a better spending of you movie time.\nReview Title: Be thankful for a good cast.\nRating: 2.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a strong preference for musical and artistic films, particularly those with historical or nostalgic significance, such as classic animations and operatic performances. Their consistent high ratings, notably for family-friendly and heartwarming titles, indicate a deep appreciation for quality storytelling and memorable musical scores.\n\nFrequent themes in their purchases include a love for holiday specials, particularly those that evoke childhood memories, showcasing a sentimental connection to festive traditions. The person's reviews reflect nuanced sentiments towards performances that offer innovative interpretations of classic works, such as ballets and musicals, suggesting an openness to modern adaptations while maintaining respect for the original.\n\nQuality is paramount in their selections, with ratings predominantly above 4.5. However, when products fail to meet expectations—especially in technical aspects like restoration or adaptation quality—sharp criticism surfaces, indicating a clear sensitivity to both artistic and production standards. Overall, the person values well-crafted cinematic experiences that blend quality, nostalgia, and musical heritage while being sensitive to preservation and adaptation integrity, exhibiting moderate price tolerance for premium presentations.",
  "target_interaction": {
    "rating": 5.0,
    "title": "It's Like a Nine Episode Greek Tragedy",
    "text": "Great series, Darren Criss deserves an Emmy for his nuanced  portrayal of Cunanan which came off as both frightening and tragic. Having read Orth's book my biggest complaint is that they &#34;Hollywoodized&#34; the last episode instead of sticking to the known facts. The story itself was much more Cunanan than it was Versace and so the title for most seemed a bit misleading but then it would you would be hard pressed to present both of their stories in just 9 episodes. Overall well worth watching.",
    "images": [],
    "asin": "B078QP4RBW",
    "parent_asin": "B078QP4RBW",
    "user_id": "AFREWIMOI7CCTUV3KOMHQGFFOYLA",
    "timestamp": "2018-03-26 20:46:08.916000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.6,
    "rating_number": 652,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/b64af6e87a3896d429205612e6e1fce5c1ab6a7bbaa7f6748e0f0b644d77599e._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/b64af6e87a3896d429205612e6e1fce5c1ab6a7bbaa7f6748e0f0b644d77599e._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/b64af6e87a3896d429205612e6e1fce5c1ab6a7bbaa7f6748e0f0b644d77599e._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/b64af6e87a3896d429205612e6e1fce5c1ab6a7bbaa7f6748e0f0b644d77599e._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/b64af6e87a3896d429205612e6e1fce5c1ab6a7bbaa7f6748e0f0b644d77599e._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/b64af6e87a3896d429205612e6e1fce5c1ab6a7bbaa7f6748e0f0b644d77599e._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Ryan Murphy",
        "Anthony Hemingway",
        "Michael Uppendahl",
        "Gwyneth Horder-Payton",
        "Daniel Minahan",
        "Laure de Clermont-Tonnerre",
        "Rachel Morrison",
        "John Singleton",
        "Matt Bomer",
        "Nelson Cragg"
      ],
      "Starring": [
        "Edgar Ramírez",
        "Darren Criss",
        "Ricky Martin"
      ],
      "Studio": [
        "Fox 21"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}