{
  "user_id": "AH6BQ6CRQ5ST6E76BG4OV75QI3VQ",
  "summary": "=== Purchase Information ===\nProduct Title: BET ComicView All Stars, Vol. 3\nReview Date: 2012/09/25\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['DVD']\nAverage Rating: 4.7\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Media Format': 'NTSC', 'Release date': 'June 11, 2002', 'Studio': 'Time Life Records'}\nReview Text: Wish they had more of Don DC Curry! The other artists are funny as well, some are younger shots of current/recent successful comedians, but other than that I would rate it a 8.5. Definitely worth a look!\nReview Title: Hilarious!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Warriors [Blu-ray](Ultimate Directors cut)\nReview Date: 2013/09/11\nStore: Michael Beck  (Actor),     James Remar  (Actor),     Walter Hill  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Warriors, The (BD)', \"A battle of gigantic proportions is looming in the neon underground of N ew York City. The armies of the night number 100,000; they o utnumber th e police 5 to 1; and tonight they're after the Warriors - a street gang blamed unfairly for a rival gang leader's death. This contemporary actio n-adventure story takes place at night, underground, in the sub-culture of gang warfare that rages from Coney Island to Manhattan to the Bronx. Members of the Warriors fight for their lives, seek to survive in the u rban jungle and learn the meaning of loyalty. This intense and stylized film is a dazzling achievement for cinematographer Andrew Laszlo.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'NTSC, Widescreen, Multiple Formats, Blu-ray', 'Contributor': 'Michael Beck, Brian Tyler, Walter Hill, David Harris, Dorsey Wright, James Remar', 'Language': 'English (Dolby Digital 5.1), Spanish (Mono), French (Mono)', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370216BR', 'Director': 'Walter Hill', 'Media Format': 'Multiple Formats, Blu-ray, Widescreen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Michael Beck, James Remar, Dorsey Wright, Brian Tyler, David Harris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Just a present for my wife! She's is a nut case fro this movie so I got it for her as a gag gift!\nReview Title: I got it for my wife, she loves it!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Collar TV - Season 1, Vol. 1\nReview Date: 2013/09/11\nStore: Jeff Foxworthy  (Actor, Writer),     Larry the Cable Guy  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'The guys who had you laughing on the Blue Collar Comedy Tour - Jeff Foxworthy, Bill Engvall and Larry the Cable Guy - bring their particular brand of hilarity to Blue Collar TV: Season 1 Volume 1. Expect a hometown buffet of TV parodies, sketches, and stand-up, celebrating everything from spouses to spoilers, Winnebagos to Waffle Houses, cheap beer to even cheaper lingerie. You are about to get a 64-oz. Big Gulp of blue collar comedy. Are you ready?', 'DVD Features:', 'Documentary', 'Other', 'Amazon.com', 'Blue Collar TV', 'finds three of the boys from', 'Blue Collar Comedy Tour: The Movie', 'and', 'Blue Collar Comedy Tour Rides Again', 'in a sketch comedy format, supported by a talented ensemble of comic players and writers who know how to build on the stars\\' individual strengths. Jeff Foxworthy is the series\\' anchor, opening each episode in the 1994 debut season with a strong monologue riffing on one or another theme: marriage, bad jobs, sports, vacations, family, partying. Happy redneck Larry the Cable Guy and NASCAR-loving Everyman Bill Engvall join Foxworthy in energetic skits that definitely become funnier and bolder with each new show. Among the best sketches is \"CSI: Greater Greensboro Tri-Area,\" in which Foxworthy\\'s crime-scene sleuth is on the trail of a deerslayer. \"Lingerie for Couples Together 20 Years\" spotlights such hot domestic garb as sweatshirts accented with a ratty, cat-hair-covered blanket from the back of a closet. \"Hug or Hit\" is a mock game show in which a terrified contestant has to predict whether a drunk sleeping in a glass booth will, upon awakening, embrace or take a swing at him.', 'The recurring \"I believe\" format finds Foxworthy, Larry, and Engvall piously revealing articles of their faith in this hard, hard world: \"I believe,\" Engvall says, \"that Angelina Jolie thinks about me as much as I think about her.\" Right. Guest star Ron White (the missing fourth partner from the', 'Blue Collar', \"tours), cigarette and Scotch-on-the-rocks in hand, lends his decadent (and welcome) persona here and there to the proceedings. Drew Carey shows up as well, but it's the series' obvious growth over 13 episodes that makes\", 'Blue Collar TV', 'a comedy success.', '--Tom Keogh']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Documentary, Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff FoxworthyLarry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff Foxworthy   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 0.5 inches; 5.6 Ounces', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '5 hours and 2 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Jeff Foxworthy, Larry the Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Producers': 'Kathy Katz, Ted Kenney, Tom Park', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy', 'Number of discs': '2'}\nReview Text: I like good redneck humor and this is it! You might be a redneck if.....FUNNY! Jeff Foxworthy, Bill Engvall and Larry the Cable Guy have done it again with a lot of laughs smash hit and of course, some redneck humor! Freakin funnier than ever yee hahah!\nReview Title: Great Redneck Humor!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Collar TV: Season 1, Vol. 2\nReview Date: 2013/09/11\nStore: Jeff Foxworthy  (Actor, Writer),     Larry The Cable Guy  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['If you thought the Vol. 1 Blue Collar TV DVD was as welcome and satisfying as ham and red-eye gravy, you\\'re only half right. \\'Cause this Vol. 2 set (3 discs, 18 episodes) completes the Season 1 fun and, like the previous volume, builds each episode around a theme ? like \"The Human Body,\" \"Christmas\" or \"Gadgets.\" Pass that gravy and stay awhile, friends. Y\\'all gonna have some right-good laughs.']\nAverage Rating: 4.5\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff FoxworthyLarry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff Foxworthy   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '3', 'Runtime': '6 hours and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Jeff Foxworthy, Larry The Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy, Mathew Harawitz', 'Number of discs': '3'}\nReview Text: FUNNY! FUNNY! Jeff Foxworthy has done it again with a lot of laughs smash hit and of course, some redneck humor!\nReview Title: Good Hillbilly Redneck Humor/Skits!!!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ron White: A Little Unprofessional\nReview Date: 2013/09/11\nStore: Ron White  (Actor),     Tom Forest  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Ron 'Tater Salad' White has been Drunk in Public. He Tried to Fix Stupid. No one argues that he has Behavioral Problems, and now he is 'A Little Unprofessional'. with cigar in one hand and a glass of scotch in the other, the Grammy-Nominated Blue Collar Comedy Tour alum delivers more than an hour of all new material with is signature, irreverent storytelling style and the best comedic timing in the business. Filmed live at the Paramount Theater in Austin, TX.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Tom Forest, Ron White', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Tom Forest', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Uhe/Csdc', 'Number of discs': '1'}\nReview Text: FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! Ron White has done it again with a Las Vegas smash hit and of course, some great scotch!\nReview Title: Funny as expected!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/12/08\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nReview Text: My wife and daughter love the Hunger Games! Hungry for more! Great Entertainment for All the family to watch! Can't wait for the sequel!\nReview Title: Hungry for more! Great Entertainment for All!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ron White: Behavioral Problems\nReview Date: 2013/12/08\nStore: Ron White  (Actor),     Michael Drumm  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, The Comedy Central Store, Stand Up\nProduct Description: ['BLUE COLLAR COMEDY star Ron White ups the ante with this raucous comedy special that covers all the hot topics. First aired on Comedy Central, BEHAVIORAL PROBLEMS features the irrepressible comic in the spotlight, cigar in hand, telling it like it is. Special Features: Letterbox - 1.85 Audio: Dolby Digital 5.1, Stereo Subtitles English.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Ron White, Michael Drumm', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '5070817', 'Director': 'Michael Drumm', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 11 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Comedy Central', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! Mr.White is keen and witty for a guy that drinks the way he does recalling various accounts of being kick of out bar for wearing a cowboy hat, to using such educated vocabulary terms such as &#34;fraught&#34; and &#34;shat whole&#34; and making references to gingko bilova, and all the while claiming his childhood was educationally limited. You're smarter than you let on Mr. White! Just keep drinking\nReview Title: Ron White is the best drunk to perform in Public since the late great Foster Brooks!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Larry The Cable Guy - Git-R-Done\nReview Date: 2013/12/08\nStore: Larry the Cable Guy  (Actor, Writer),     Michael Drumm  (Director, Producer)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Special Interests\nProduct Description: ['Product Description', 'With his trademark cries of \"Git-er-done!\" and \"What the hell is this, Russia?,\" Larry the Cable Guy is one of country\\'s funniest comedians! Now enjoy an entire DVD of this irresistible funnyman at the top of his form and guaranteed to make you laugh again and again! A star of Comedy Central\\'s hit film Blue Collar Comedy Tour: The Movie, Larry has cracked up TV viewers of Showtime, MTV, Evening at the Improv and Comic Strip Live. He\\'s also well-known for his wacky, outrageous radio commentaries and for his bestselling CD, Lord, I Apologize.', 'Amazon.com', 'Redneck comedian Larry the Cable Guy (co-star of', 'Blue Collar Comedy Tour: The Movie', ') kicks off his live performance on', 'Git-R-Done', 'with one of the great questions of the modern age: \"Ever have an orgasm so strong you hit your head on the back of the tub?\" (He expresses gratitude that the VCR didn\\'t fall into the water.) A string of gay-bashing and other intemperate quips quickly follows, but Larry\\'s gross jokes are a part of an intentionally foolish persona. When he cracks wise about lesbian rocker Melissa Etheridge\\'s genitals, the crowd gasps, and Larry\\'s oversized rube becomes the punch line. Larry\\'s no less hard on his family, commenting on an obese sister who claims to have a thyroid problem: \"It\\'s not a thyroid problem, it\\'s a 7-11 problem.\" On his brief career as an evangelist: \"I was $150 short of bringing a stripper to the Lord.\" This is hick humor that sometimes gets under one\\'s skin.', '--Tom Keogh']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Larry the Cable Guy, Nicole Vinnola, J.P. Williams, Michael Drumm', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'MFR014381244427#VG', 'Director': 'Michael Drumm', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 6 minutes', 'Release date': 'May 25, 2004', 'Actors': 'Larry the Cable Guy', 'Producers': 'J.P. Williams, Michael Drumm, Nicole Vinnola', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Larry the Cable Guy', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! Larry is always telling stupid toilet-bowl jokes and stinky humor!\nReview Title: Larry Strikes Again!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Collar Comedy Tour: The Movie\nReview Date: 2013/12/08\nStore: Jeff Foxworthy  (Actor),     Bill Engvall  (Actor),     CB Harding  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Blue Collar Comedy (DVD)', 'This comedy concert movie features the stage performances of four stand-up comics -- Jeff Foxworthy (stand-up comedy CDs include the \"You May Be A Redneck If...\" series), Bill Engvall (comic CDs \"Dorkfish\" and \"Here\\'s Your Sign\"), Larry the Cable Guy (a redneck Texan and know-it-all comedian famous for his wacky, outrageous and topical commentaries and his CD \"Lord, I Apologize\") and Ron White (\"No one makes me laugh harder than Ron.\" - Jeff Foxworthy) -- as well as behind-the-scenes sequences.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Stand-Up, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Larry The Cable Guy, JP Williams, Alan Blomquist, Alan C. Blomquist, CB Harding, Ron White, E.K. Gaylord II, Casey La Scala, Jeff Foxworthy, Bill Engvall, Hunt LowryLarry The Cable Guy, JP Williams, Alan Blomquist, Alan C. Blomquist, CB Harding, Ron White, E.K. Gaylord II, Casey La Scala, Jeff Foxworthy, Bill Engvall, Hunt Lowry  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '116302', 'Director': 'CB Harding', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled', 'Run time': '1 hour and 46 minutes', 'Release date': 'May 15, 2007', 'Actors': 'Jeff Foxworthy, Bill Engvall, Ron White, Larry The Cable Guy', 'Subtitles': 'Spanish, English, French', 'Producers': 'E.K. Gaylord II, Alan C. Blomquist, JP Williams, Hunt Lowry, Casey La Scala', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! One of the best comedy teams ever! Bar none!\nReview Title: One of the best comedy teams ever!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Redneck Comedy Roundup 1 & 2 - Doublewide 2 Feature Set\nReview Date: 2013/12/08\nStore: Jeff Foxworthy  (Actor),     Bill Engvall  (Actor),     Various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: [\"America's Favorite Funnymen!\", 'Double the Jokes - Double the Every-Man Observations!', 'YOU MIGHT BE A REDNECK FAN IF&YOU BUY THIS DVD!', \"Get ready to be entertained southern style as America's favorite comedians team up to bring you unapologetic humor about all things white-trash, redneck, and blue-collar. See Jeff Foxworthy, Bill Engvall and Ron White from the Blue Collar Comedy Tour along with other familiar comedians like Jerry Springer, Ron Shock and Bobcat Goldthwait perform their original material up close and personal from the best seats in the house.\", 'REDNECK COMEDY ROUNDUP:', 'This hilarious DVD features the brightest stars from the Blue Collar Comedy Tour. Join Jeff Foxworthy, Bill Engvall, Ron White, John fox, Black Clark, Ron Shock and more in this zany stand-up comedy showcase as they perform their original material on stage!', 'REDNECK COMEDY ROUNDUP 2', 'Redneck Comedy Roundup 2 is a zany stand-up comedy showcase from some of the brightest and funniest comedic stars in America. Featured comedians on this hilarious DVD include Jeff Foxworthy, Bill Engvall, Jerry Springer, Bobcat Goldthwait and more! Enjoy the best material culled from the early careers of these stand-up comedy legends!']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC, Multiple Formats, Color', 'Contributor': 'Blake Clark, Jerry Springer, John Fox, Ron Shock, Ron White, ...and Many More!, Bobcat Goldthwait, Various, Jeff Foxworthy, Bill EngvallBlake Clark, Jerry Springer, John Fox, Ron Shock, Ron White, ...and Many More!, Bobcat Goldthwait, Various, Jeff Foxworthy, Bill Engvall   See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6498161', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '2 hours and 26 minutes', 'Release date': 'January 18, 2011', 'Actors': 'Jeff Foxworthy, Bill Engvall, Ron White, Bobcat Goldthwait, John Fox', 'Studio': 'Mill Creek Ent', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! This has some of their earliest performances! Whoa!\nReview Title: Early Stuff Seldom Seen!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jeff Dunham: Minding the Monsters\nReview Date: 2013/12/08\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['Jeff Dunham’s', 'Minding the Monsters', 'brings together your favorites-- Walter, Peanut, Bubba J, Jose Jalapeno… On a Steek!, and Achmed the Dead Terrorist as you’ve never seen them before!\\xa0 Enter the ultimate haunted house where Walter transforms into something grumpier than he already is! Watch Bubba J rise from the dead!\\xa0 Meet Peanut’s alter ego, The Purple Avenger of the Night, and his spicy sidekick! And witness Achmed literally dressed to kill in an outfit that would terrify the most terrifying terrorist!']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Contributor': 'Dunham, Jeff', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '25631210', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Dunham, Jeff', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: Love Jeff Dunham, best ventriloquist since McCarthy! Love his little &#34;monsters&#34; theme and the staging of this show. Jeff's comedy twist don't usually involve a lot of repeat jokes or stories, he is really fresh with his humor, testing all areas of society and the world!\nReview Title: Dunham Strikes Back!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jeff Dunham's Very Special Christmas Special\nReview Date: 2013/12/08\nStore: Jeff Dunham  (Actor),     N/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['FUN FOR THE ENTIRE FAMILY AND DESTINED TO BECOME A HOLIDAY FAVORITE!INCLUDES ONE HOUR OF EXCLUSIVE FOOTAGE NOT SEEN ON COMEDY CENTRAL BROADCAST!Jeff Dunham and his cast of characters join to make Christmas very special -- and hilarious -- like only they know how. All new show also includes bonus material with numerous DVD extras. Share this must-have event with the entire family for Christmas and all year long!DVD is loaded with additional footage and extras not seen on television including Holiday Tips, Outtakes, Ask Santa-Walter, and Behind The Scenes.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Color, Dolby, NTSC, Multiple Formats, Widescreen', 'Contributor': 'N/a, Jeff Dunham', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR014381514926#VG', 'Director': 'N/a', 'Media Format': 'Color, Dolby, NTSC, Multiple Formats, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Jeff Dunham', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: Good work from Jeff and his &#34;kids&#34;! Still nuts and highly inventive after all these years! Raunchy Humor and a song from one of my favs- Bubba J!!\nReview Title: Christmas Spirit with Zing and a Laugh!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Superstar\nReview Date: 2013/12/08\nStore: Molly Shannon  (Actor, Writer),     Will Ferrell  (Actor),     Bruce McCulloch  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['Based on the popular Saturday Night Live sketch, Superstar follows the hilarious adventures of klutzy schoolgirl Mary Katherine Gallagher (Shannon) as she pursues her dream of the perfect kissand superstardom!']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Director': 'Bruce McCulloch', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'April 11, 2000', 'Actors': 'Molly Shannon, Will Ferrell, Elaine Hendrix, Harland Williams, Mark McKinney', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Studio': 'Paramount', 'Writers': 'Molly Shannon, Steve Koren', 'Number of discs': '1'}\nReview Text: My wife loves this movie, well we both do it's stupid-funny! Dumb humor and quirk moments had the family laughing constantly!\nReview Title: Stoopidlious!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Carol [DVD]\nReview Date: 2013/12/08\nStore: George C. Scott  (Actor),     Frank Finlay  (Actor),     Clive Donner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: ['Christmas elicits nothing more than \"Bah, humbug!\" from Ebenezer Scrooge (Scott), a miser whose sole pursuit of financial success has left him a bitter and lonely old man. But a Christmas Eve visit from the Ghosts of Christmas Past, Present and Future ultimately teaches him to open his heart to the spirit of Christmas and to the joys of friends and family.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Closed-captioned, Color, Dolby, DVD, NTSC', 'Contributor': 'Angela Pleasence, Caroline Langrishe, Anthony Walters, Roger O. Hirson, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Roger Rees, Charles Dickens, Frank Finlay, David Warner, Edward Woodward, Susannah York, Lucy GutteridgeAngela Pleasence, Caroline Langrishe, Anthony Walters, Roger O. Hirson, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Roger Rees, Charles Dickens, Frank Finlay, David Warner, Edward Woodward, Susannah York, Lucy Gutteridge  See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.16 Ounces', 'Item model number': 'MFR086162127519#VG', 'Director': 'Clive Donner', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 5, 1999', 'Actors': 'George C. Scott, Frank Finlay, Angela Pleasence, Edward Woodward, Michael Carter', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Charles Dickens, Roger O. Hirson', 'Number of discs': '1'}\nReview Text: My wife loves this movie, well I'm kind of attach to it too. It's great during the holiday season and we watch all the Christmas favorites!\nReview Title: Great for the Holidays! George C. Scott is superb!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Viva! Hysteria [Blu-ray]\nReview Date: 2013/12/08\nStore: Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"For the first time ever, Def Leppard played their album HYSTERIA in its entirety during an eleven-show residency which started on March 22, 2013 at The Joint in the Hard Rock Hotel And Casino in Las Vegas. The band also opened for themselves under the fictitious name of DED FLATBIRD for two different sets on each of the nights. During those DED FLATBIRD sets, the band showcased some fan favorites and rare songs from the early years of the band in addition to playing a selection of their greatest hits, highlighting classic material from throughout their career. The VIVA! HYSTERIA show featured an elaborate set design created specifically for Def Leppard 's Las Vegas residency.Known for legendary big-scale arena shows, Def Leppard will bring their over-the-top production to your house as VIVA! HYSTERIA is their first full live show shot in HD to be released commercially. VIVA! HYSTERIA showcases for the first time the band's career-defining album performed live in its entirety - from start to finish - for a commercial audio/video release.Blu-Ray also includes bonus content of the acoustic medley: Where does love go when it dies/Now/When Love & Hate Collide/Have You Ever Needed Someone So Bad/Two Steps Behind.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Def Leppard Viva! Hysteria, Rock', 'Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Contributor': 'Def Leppard', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 5.1 ES Matrix)', 'Number Of Discs': '1', 'Aspect Ratio': '16:9', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.89 x 5.99 x 0.42 inches; 2.4 Ounces', 'Item model number': '8024391062081', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'February 1, 2017', 'Actors': 'Def Leppard', 'Dubbed': 'English', 'Studio': 'FRONTIERS MUSIC SRL', 'Number of discs': '1'}\nReview Text: My wife loves this super group of true 80's rock! Def Leppard is dynamite in this return to the stage! 80's Rock Rules!\nReview Title: 80's Rock Rules!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Green Mile (Single Disc Edition)\nReview Date: 2013/12/28\nStore: Tom Hanks  (Actor),     Michael Clarke Duncan  (Actor),     Frank Darabont  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Green Mile, The (DVD)', \"From award-winning writer-director Frank Darabont (The Shawshank Redemption) and best-selling author Stephen King's novel comes the story of a man who didn't believe in miracles. Multiple Academy Award winner Tom Hanks leads a dynamic cast in a tale about life, death and the wonders of the human spirit, The Green Mile. Death row head guard Paul Edgecomb (Hanks--Forrest Gump, Philadelphia) has walked many inmates down the stretch of green linoleum that leads to Louisiana's electric chair. But never has he encountered anyone like John Coffey (Michael Clarke Duncan--Armageddon), a massive black man convicted of brutally killing two little white girls. When pain cripples Edgecomb, Coffey reaches from behind bars to lay healing hands on the stricken guard and rid him of the infection that racks his body.\", ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Doug Hutchison, Frank Darabont, Jeffrey DeMunn, Harry Dean Stanton, Dabbs Greer, David Morse, Thomas Newman, Sam Rockwell, Graham Greene, Eve Brent, Richard Francis-Bruce, Bonnie Hunt, Gary Sinise, Brent Briscoe, Tom Hanks, James Cromwell, Barry Pepper, Patricia Clarkson, David Tattersall, Michael Clarke Duncan, Michael Jeter, Bill SadlerDoug Hutchison, Frank Darabont, Jeffrey DeMunn, Harry Dean Stanton, Dabbs Greer, David Morse, Thomas Newman, Sam Rockwell, Graham Greene, Eve Brent, Richard Francis-Bruce, Bonnie Hunt, Gary Sinise, Brent Briscoe, Tom Hanks, James Cromwell, Barry Pepper, Patrici…   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '3 hours and 9 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': 'C2733', 'Director': 'Frank Darabont', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 9 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Tom Hanks, Michael Clarke Duncan, Jeffrey DeMunn, Dabbs Greer, Bonnie Hunt', 'Subtitles': 'French, English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Delivery fast and the movie is an all time favorite! Tom Hanks, the late and sorely missed Michael Duncan Clarke, and great supporting cast make this movie a constant &#34;watch over&#34; in my home.\nReview Title: Great Family Fun!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Five People You Meet in Heaven\nReview Date: 2013/12/28\nStore: Jon Voight  (Actor),     Ellen Burstyn  (Actor),     Lloyd Kramer  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Product description', 'Five People You', 'Amazon.com', 'Based on the bestseller by Mitch Albom (', 'Tuesdays With Morrie', '),', 'The Five People You Meet in Heaven', 'takes up where', 'It\\x92s A Wonderful Life', 'left off. In the Capra classic, George Bailey gets a vision of life without him. In this Hallmark Hall of Fame production, Eddie (Jon Voight), an amusement park maintenance man and war veteran, ends up in Heaven after an accident takes his life. There he meets five people from his past: the Blue Man (Jeff Richards), the Captain (Michael Imperioli), Marguerite (Dagmara Dominczyk), Ruby (Ellen Burstyn), and Tala (Nicaela and Shelbie Weigel). Each shows him how he impacted their life or they his--and not always for the better. (In these flashbacks, Callahan Brebner and Steven Grayhm play the young Eddie.) The point may seem simplistic--everyone is connected--but', 'The Five People You Meet in Heaven', 'finds a unique and engaging way to make it.', '--Kathleen C. Fennessy']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Ellen Burstyn, Jeff Daniels, Nicaela Weigel, Callahan Brebner, Shelbie Weigel, Jon Voight, Dagmara Dominczyk, Lloyd Kramer, Callum Keith Rennie, Michael Imperioli, Rebecca Jenkins, Darcy Cadman, Mitch Albom, Steven GrayhmEllen Burstyn, Jeff Daniels, Nicaela Weigel, Callahan Brebner, Shelbie Weigel, Jon Voight, Dagmara Dominczyk, Lloyd Kramer, Callum Keith Rennie, Michael Imperioli, Rebecca Jenkins, Darcy Cadman, Mitch Albom, Steven Grayhm  See more', 'Language': 'English', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.01 x 0.01 x 0.01 inches; 3.04 Ounces', 'Director': 'Lloyd Kramer', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'February 8, 2005', 'Actors': 'Jon Voight, Ellen Burstyn, Jeff Daniels, Dagmara Dominczyk, Steven Grayhm', 'Studio': 'Lions Gate', 'Writers': 'Mitch Albom', 'Number of discs': '1'}\nReview Text: Jon Voight is spectacular in his performance! This haunting glimpse of what may be in the afterlife is and yet comforting in its final stage.\nReview Title: Haunting, beautifully written story!\nRating: 5.0\n--------------------------------------------------",
  "reference": "BET ComicView All Stars, Vol. 3\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['DVD']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Media Format': 'NTSC', 'Release date': 'June 11, 2002', 'Studio': 'Time Life Records'}\nWish they had more of Don DC Curry! The other artists are funny as well, some are younger shots of current/recent successful comedians, but other than that I would rate it a 8.5. Definitely worth a look!\nHilarious!\nThe Warriors [Blu-ray](Ultimate Directors cut)\nMichael Beck  (Actor),     James Remar  (Actor),     Walter Hill  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Warriors, The (BD)', \"A battle of gigantic proportions is looming in the neon underground of N ew York City. The armies of the night number 100,000; they o utnumber th e police 5 to 1; and tonight they're after the Warriors - a street gang blamed unfairly for a rival gang leader's death. This contemporary actio n-adventure story takes place at night, underground, in the sub-culture of gang warfare that rages from Coney Island to Manhattan to the Bronx. Members of the Warriors fight for their lives, seek to survive in the u rban jungle and learn the meaning of loyalty. This intense and stylized film is a dazzling achievement for cinematographer Andrew Laszlo.\", ']]>']\n{'Genre': 'Drama, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'NTSC, Widescreen, Multiple Formats, Blu-ray', 'Contributor': 'Michael Beck, Brian Tyler, Walter Hill, David Harris, Dorsey Wright, James Remar', 'Language': 'English (Dolby Digital 5.1), Spanish (Mono), French (Mono)', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370216BR', 'Director': 'Walter Hill', 'Media Format': 'Multiple Formats, Blu-ray, Widescreen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Michael Beck, James Remar, Dorsey Wright, Brian Tyler, David Harris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nJust a present for my wife! She's is a nut case fro this movie so I got it for her as a gag gift!\nI got it for my wife, she loves it!\nBlue Collar TV - Season 1, Vol. 1\nJeff Foxworthy  (Actor, Writer),     Larry the Cable Guy  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The guys who had you laughing on the Blue Collar Comedy Tour - Jeff Foxworthy, Bill Engvall and Larry the Cable Guy - bring their particular brand of hilarity to Blue Collar TV: Season 1 Volume 1. Expect a hometown buffet of TV parodies, sketches, and stand-up, celebrating everything from spouses to spoilers, Winnebagos to Waffle Houses, cheap beer to even cheaper lingerie. You are about to get a 64-oz. Big Gulp of blue collar comedy. Are you ready?', 'DVD Features:', 'Documentary', 'Other', 'Amazon.com', 'Blue Collar TV', 'finds three of the boys from', 'Blue Collar Comedy Tour: The Movie', 'and', 'Blue Collar Comedy Tour Rides Again', 'in a sketch comedy format, supported by a talented ensemble of comic players and writers who know how to build on the stars\\' individual strengths. Jeff Foxworthy is the series\\' anchor, opening each episode in the 1994 debut season with a strong monologue riffing on one or another theme: marriage, bad jobs, sports, vacations, family, partying. Happy redneck Larry the Cable Guy and NASCAR-loving Everyman Bill Engvall join Foxworthy in energetic skits that definitely become funnier and bolder with each new show. Among the best sketches is \"CSI: Greater Greensboro Tri-Area,\" in which Foxworthy\\'s crime-scene sleuth is on the trail of a deerslayer. \"Lingerie for Couples Together 20 Years\" spotlights such hot domestic garb as sweatshirts accented with a ratty, cat-hair-covered blanket from the back of a closet. \"Hug or Hit\" is a mock game show in which a terrified contestant has to predict whether a drunk sleeping in a glass booth will, upon awakening, embrace or take a swing at him.', 'The recurring \"I believe\" format finds Foxworthy, Larry, and Engvall piously revealing articles of their faith in this hard, hard world: \"I believe,\" Engvall says, \"that Angelina Jolie thinks about me as much as I think about her.\" Right. Guest star Ron White (the missing fourth partner from the', 'Blue Collar', \"tours), cigarette and Scotch-on-the-rocks in hand, lends his decadent (and welcome) persona here and there to the proceedings. Drew Carey shows up as well, but it's the series' obvious growth over 13 episodes that makes\", 'Blue Collar TV', 'a comedy success.', '--Tom Keogh']\n{'Genre': 'Documentary, Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff FoxworthyLarry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff Foxworthy   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 0.5 inches; 5.6 Ounces', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '5 hours and 2 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Jeff Foxworthy, Larry the Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Producers': 'Kathy Katz, Ted Kenney, Tom Park', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy', 'Number of discs': '2'}\nI like good redneck humor and this is it! You might be a redneck if.....FUNNY! Jeff Foxworthy, Bill Engvall and Larry the Cable Guy have done it again with a lot of laughs smash hit and of course, some redneck humor! Freakin funnier than ever yee hahah!\nGreat Redneck Humor!\nBlue Collar TV: Season 1, Vol. 2\nJeff Foxworthy  (Actor, Writer),     Larry The Cable Guy  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['If you thought the Vol. 1 Blue Collar TV DVD was as welcome and satisfying as ham and red-eye gravy, you\\'re only half right. \\'Cause this Vol. 2 set (3 discs, 18 episodes) completes the Season 1 fun and, like the previous volume, builds each episode around a theme ? like \"The Human Body,\" \"Christmas\" or \"Gadgets.\" Pass that gravy and stay awhile, friends. Y\\'all gonna have some right-good laughs.']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff FoxworthyLarry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff Foxworthy   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '3', 'Runtime': '6 hours and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Jeff Foxworthy, Larry The Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy, Mathew Harawitz', 'Number of discs': '3'}\nFUNNY! FUNNY! Jeff Foxworthy has done it again with a lot of laughs smash hit and of course, some redneck humor!\nGood Hillbilly Redneck Humor/Skits!!!!!!\nRon White: A Little Unprofessional\nRon White  (Actor),     Tom Forest  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Ron 'Tater Salad' White has been Drunk in Public. He Tried to Fix Stupid. No one argues that he has Behavioral Problems, and now he is 'A Little Unprofessional'. with cigar in one hand and a glass of scotch in the other, the Grammy-Nominated Blue Collar Comedy Tour alum delivers more than an hour of all new material with is signature, irreverent storytelling style and the best comedic timing in the business. Filmed live at the Paramount Theater in Austin, TX.\"]\n{'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Tom Forest, Ron White', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Tom Forest', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Uhe/Csdc', 'Number of discs': '1'}\nFUNNY! FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! Ron White has done it again with a Las Vegas smash hit and of course, some great scotch!\nFunny as expected!\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nMy wife and daughter love the Hunger Games! Hungry for more! Great Entertainment for All the family to watch! Can't wait for the sequel!\nHungry for more! Great Entertainment for All!\nRon White: Behavioral Problems\nRon White  (Actor),     Michael Drumm  (Director)    Rated:    NR    Format: DVD\nMovies & TV, The Comedy Central Store, Stand Up\n['BLUE COLLAR COMEDY star Ron White ups the ante with this raucous comedy special that covers all the hot topics. First aired on Comedy Central, BEHAVIORAL PROBLEMS features the irrepressible comic in the spotlight, cigar in hand, telling it like it is. Special Features: Letterbox - 1.85 Audio: Dolby Digital 5.1, Stereo Subtitles English.']\n{'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Ron White, Michael Drumm', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '5070817', 'Director': 'Michael Drumm', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 11 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Comedy Central', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy wife and I love the Blue Collar Crew, all of them! Mr.White is keen and witty for a guy that drinks the way he does recalling various accounts of being kick of out bar for wearing a cowboy hat, to using such educated vocabulary terms such as &#34;fraught&#34; and &#34;shat whole&#34; and making references to gingko bilova, and all the while claiming his childhood was educationally limited. You're smarter than you let on Mr. White! Just keep drinking\nRon White is the best drunk to perform in Public since the late great Foster Brooks!\nLarry The Cable Guy - Git-R-Done\nLarry the Cable Guy  (Actor, Writer),     Michael Drumm  (Director, Producer)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', 'With his trademark cries of \"Git-er-done!\" and \"What the hell is this, Russia?,\" Larry the Cable Guy is one of country\\'s funniest comedians! Now enjoy an entire DVD of this irresistible funnyman at the top of his form and guaranteed to make you laugh again and again! A star of Comedy Central\\'s hit film Blue Collar Comedy Tour: The Movie, Larry has cracked up TV viewers of Showtime, MTV, Evening at the Improv and Comic Strip Live. He\\'s also well-known for his wacky, outrageous radio commentaries and for his bestselling CD, Lord, I Apologize.', 'Amazon.com', 'Redneck comedian Larry the Cable Guy (co-star of', 'Blue Collar Comedy Tour: The Movie', ') kicks off his live performance on', 'Git-R-Done', 'with one of the great questions of the modern age: \"Ever have an orgasm so strong you hit your head on the back of the tub?\" (He expresses gratitude that the VCR didn\\'t fall into the water.) A string of gay-bashing and other intemperate quips quickly follows, but Larry\\'s gross jokes are a part of an intentionally foolish persona. When he cracks wise about lesbian rocker Melissa Etheridge\\'s genitals, the crowd gasps, and Larry\\'s oversized rube becomes the punch line. Larry\\'s no less hard on his family, commenting on an obese sister who claims to have a thyroid problem: \"It\\'s not a thyroid problem, it\\'s a 7-11 problem.\" On his brief career as an evangelist: \"I was $150 short of bringing a stripper to the Lord.\" This is hick humor that sometimes gets under one\\'s skin.', '--Tom Keogh']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Larry the Cable Guy, Nicole Vinnola, J.P. Williams, Michael Drumm', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'MFR014381244427#VG', 'Director': 'Michael Drumm', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 6 minutes', 'Release date': 'May 25, 2004', 'Actors': 'Larry the Cable Guy', 'Producers': 'J.P. Williams, Michael Drumm, Nicole Vinnola', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Larry the Cable Guy', 'Number of discs': '1'}\nMy wife and I love the Blue Collar Crew, all of them! Larry is always telling stupid toilet-bowl jokes and stinky humor!\nLarry Strikes Again!\nBlue Collar Comedy Tour: The Movie\nJeff Foxworthy  (Actor),     Bill Engvall  (Actor),     CB Harding  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Blue Collar Comedy (DVD)', 'This comedy concert movie features the stage performances of four stand-up comics -- Jeff Foxworthy (stand-up comedy CDs include the \"You May Be A Redneck If...\" series), Bill Engvall (comic CDs \"Dorkfish\" and \"Here\\'s Your Sign\"), Larry the Cable Guy (a redneck Texan and know-it-all comedian famous for his wacky, outrageous and topical commentaries and his CD \"Lord, I Apologize\") and Ron White (\"No one makes me laugh harder than Ron.\" - Jeff Foxworthy) -- as well as behind-the-scenes sequences.', ']]>']\n{'Genre': 'Comedy/Stand-Up, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Larry The Cable Guy, JP Williams, Alan Blomquist, Alan C. Blomquist, CB Harding, Ron White, E.K. Gaylord II, Casey La Scala, Jeff Foxworthy, Bill Engvall, Hunt LowryLarry The Cable Guy, JP Williams, Alan Blomquist, Alan C. Blomquist, CB Harding, Ron White, E.K. Gaylord II, Casey La Scala, Jeff Foxworthy, Bill Engvall, Hunt Lowry  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '116302', 'Director': 'CB Harding', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled', 'Run time': '1 hour and 46 minutes', 'Release date': 'May 15, 2007', 'Actors': 'Jeff Foxworthy, Bill Engvall, Ron White, Larry The Cable Guy', 'Subtitles': 'Spanish, English, French', 'Producers': 'E.K. Gaylord II, Alan C. Blomquist, JP Williams, Hunt Lowry, Casey La Scala', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nMy wife and I love the Blue Collar Crew, all of them! One of the best comedy teams ever! Bar none!\nOne of the best comedy teams ever!\nRedneck Comedy Roundup 1 & 2 - Doublewide 2 Feature Set\nJeff Foxworthy  (Actor),     Bill Engvall  (Actor),     Various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"America's Favorite Funnymen!\", 'Double the Jokes - Double the Every-Man Observations!', 'YOU MIGHT BE A REDNECK FAN IF&YOU BUY THIS DVD!', \"Get ready to be entertained southern style as America's favorite comedians team up to bring you unapologetic humor about all things white-trash, redneck, and blue-collar. See Jeff Foxworthy, Bill Engvall and Ron White from the Blue Collar Comedy Tour along with other familiar comedians like Jerry Springer, Ron Shock and Bobcat Goldthwait perform their original material up close and personal from the best seats in the house.\", 'REDNECK COMEDY ROUNDUP:', 'This hilarious DVD features the brightest stars from the Blue Collar Comedy Tour. Join Jeff Foxworthy, Bill Engvall, Ron White, John fox, Black Clark, Ron Shock and more in this zany stand-up comedy showcase as they perform their original material on stage!', 'REDNECK COMEDY ROUNDUP 2', 'Redneck Comedy Roundup 2 is a zany stand-up comedy showcase from some of the brightest and funniest comedic stars in America. Featured comedians on this hilarious DVD include Jeff Foxworthy, Bill Engvall, Jerry Springer, Bobcat Goldthwait and more! Enjoy the best material culled from the early careers of these stand-up comedy legends!']\n{'Genre': 'Comedy', 'Format': 'NTSC, Multiple Formats, Color', 'Contributor': 'Blake Clark, Jerry Springer, John Fox, Ron Shock, Ron White, ...and Many More!, Bobcat Goldthwait, Various, Jeff Foxworthy, Bill EngvallBlake Clark, Jerry Springer, John Fox, Ron Shock, Ron White, ...and Many More!, Bobcat Goldthwait, Various, Jeff Foxworthy, Bill Engvall   See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6498161', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '2 hours and 26 minutes', 'Release date': 'January 18, 2011', 'Actors': 'Jeff Foxworthy, Bill Engvall, Ron White, Bobcat Goldthwait, John Fox', 'Studio': 'Mill Creek Ent', 'Number of discs': '1'}\nMy wife and I love the Blue Collar Crew, all of them! This has some of their earliest performances! Whoa!\nEarly Stuff Seldom Seen!\nJeff Dunham: Minding the Monsters\nRated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Jeff Dunham’s', 'Minding the Monsters', 'brings together your favorites-- Walter, Peanut, Bubba J, Jose Jalapeno… On a Steek!, and Achmed the Dead Terrorist as you’ve never seen them before!\\xa0 Enter the ultimate haunted house where Walter transforms into something grumpier than he already is! Watch Bubba J rise from the dead!\\xa0 Meet Peanut’s alter ego, The Purple Avenger of the Night, and his spicy sidekick! And witness Achmed literally dressed to kill in an outfit that would terrify the most terrifying terrorist!']\n{'Format': 'Multiple Formats, Color, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Contributor': 'Dunham, Jeff', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '25631210', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Dunham, Jeff', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nLove Jeff Dunham, best ventriloquist since McCarthy! Love his little &#34;monsters&#34; theme and the staging of this show. Jeff's comedy twist don't usually involve a lot of repeat jokes or stories, he is really fresh with his humor, testing all areas of society and the world!\nDunham Strikes Back!\nJeff Dunham's Very Special Christmas Special\nJeff Dunham  (Actor),     N/a  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['FUN FOR THE ENTIRE FAMILY AND DESTINED TO BECOME A HOLIDAY FAVORITE!INCLUDES ONE HOUR OF EXCLUSIVE FOOTAGE NOT SEEN ON COMEDY CENTRAL BROADCAST!Jeff Dunham and his cast of characters join to make Christmas very special -- and hilarious -- like only they know how. All new show also includes bonus material with numerous DVD extras. Share this must-have event with the entire family for Christmas and all year long!DVD is loaded with additional footage and extras not seen on television including Holiday Tips, Outtakes, Ask Santa-Walter, and Behind The Scenes.']\n{'Genre': 'Kids & Family', 'Format': 'Color, Dolby, NTSC, Multiple Formats, Widescreen', 'Contributor': 'N/a, Jeff Dunham', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR014381514926#VG', 'Director': 'N/a', 'Media Format': 'Color, Dolby, NTSC, Multiple Formats, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Jeff Dunham', 'Studio': 'Paramount', 'Number of discs': '1'}\nGood work from Jeff and his &#34;kids&#34;! Still nuts and highly inventive after all these years! Raunchy Humor and a song from one of my favs- Bubba J!!\nChristmas Spirit with Zing and a Laugh!\nSuperstar\nMolly Shannon  (Actor, Writer),     Will Ferrell  (Actor),     Bruce McCulloch  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Based on the popular Saturday Night Live sketch, Superstar follows the hilarious adventures of klutzy schoolgirl Mary Katherine Gallagher (Shannon) as she pursues her dream of the perfect kissand superstardom!']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Director': 'Bruce McCulloch', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'April 11, 2000', 'Actors': 'Molly Shannon, Will Ferrell, Elaine Hendrix, Harland Williams, Mark McKinney', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Studio': 'Paramount', 'Writers': 'Molly Shannon, Steve Koren', 'Number of discs': '1'}\nMy wife loves this movie, well we both do it's stupid-funny! Dumb humor and quirk moments had the family laughing constantly!\nStoopidlious!\nA Christmas Carol [DVD]\nGeorge C. Scott  (Actor),     Frank Finlay  (Actor),     Clive Donner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n['Christmas elicits nothing more than \"Bah, humbug!\" from Ebenezer Scrooge (Scott), a miser whose sole pursuit of financial success has left him a bitter and lonely old man. But a Christmas Eve visit from the Ghosts of Christmas Past, Present and Future ultimately teaches him to open his heart to the spirit of Christmas and to the joys of friends and family.']\n{'Genre': 'Kids & Family', 'Format': 'Closed-captioned, Color, Dolby, DVD, NTSC', 'Contributor': 'Angela Pleasence, Caroline Langrishe, Anthony Walters, Roger O. Hirson, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Roger Rees, Charles Dickens, Frank Finlay, David Warner, Edward Woodward, Susannah York, Lucy GutteridgeAngela Pleasence, Caroline Langrishe, Anthony Walters, Roger O. Hirson, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Roger Rees, Charles Dickens, Frank Finlay, David Warner, Edward Woodward, Susannah York, Lucy Gutteridge  See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.16 Ounces', 'Item model number': 'MFR086162127519#VG', 'Director': 'Clive Donner', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 5, 1999', 'Actors': 'George C. Scott, Frank Finlay, Angela Pleasence, Edward Woodward, Michael Carter', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Charles Dickens, Roger O. Hirson', 'Number of discs': '1'}\nMy wife loves this movie, well I'm kind of attach to it too. It's great during the holiday season and we watch all the Christmas favorites!\nGreat for the Holidays! George C. Scott is superb!\nViva! Hysteria [Blu-ray]\nRated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"For the first time ever, Def Leppard played their album HYSTERIA in its entirety during an eleven-show residency which started on March 22, 2013 at The Joint in the Hard Rock Hotel And Casino in Las Vegas. The band also opened for themselves under the fictitious name of DED FLATBIRD for two different sets on each of the nights. During those DED FLATBIRD sets, the band showcased some fan favorites and rare songs from the early years of the band in addition to playing a selection of their greatest hits, highlighting classic material from throughout their career. The VIVA! HYSTERIA show featured an elaborate set design created specifically for Def Leppard 's Las Vegas residency.Known for legendary big-scale arena shows, Def Leppard will bring their over-the-top production to your house as VIVA! HYSTERIA is their first full live show shot in HD to be released commercially. VIVA! HYSTERIA showcases for the first time the band's career-defining album performed live in its entirety - from start to finish - for a commercial audio/video release.Blu-Ray also includes bonus content of the acoustic medley: Where does love go when it dies/Now/When Love & Hate Collide/Have You Ever Needed Someone So Bad/Two Steps Behind.\"]\n{'Genre': 'Def Leppard Viva! Hysteria, Rock', 'Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Contributor': 'Def Leppard', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 5.1 ES Matrix)', 'Number Of Discs': '1', 'Aspect Ratio': '16:9', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.89 x 5.99 x 0.42 inches; 2.4 Ounces', 'Item model number': '8024391062081', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'February 1, 2017', 'Actors': 'Def Leppard', 'Dubbed': 'English', 'Studio': 'FRONTIERS MUSIC SRL', 'Number of discs': '1'}\nMy wife loves this super group of true 80's rock! Def Leppard is dynamite in this return to the stage! 80's Rock Rules!\n80's Rock Rules!\nThe Green Mile (Single Disc Edition)\nTom Hanks  (Actor),     Michael Clarke Duncan  (Actor),     Frank Darabont  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Green Mile, The (DVD)', \"From award-winning writer-director Frank Darabont (The Shawshank Redemption) and best-selling author Stephen King's novel comes the story of a man who didn't believe in miracles. Multiple Academy Award winner Tom Hanks leads a dynamic cast in a tale about life, death and the wonders of the human spirit, The Green Mile. Death row head guard Paul Edgecomb (Hanks--Forrest Gump, Philadelphia) has walked many inmates down the stretch of green linoleum that leads to Louisiana's electric chair. But never has he encountered anyone like John Coffey (Michael Clarke Duncan--Armageddon), a massive black man convicted of brutally killing two little white girls. When pain cripples Edgecomb, Coffey reaches from behind bars to lay healing hands on the stricken guard and rid him of the infection that racks his body.\", ']]>']\n{'Genre': 'Science Fiction & Fantasy, Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Doug Hutchison, Frank Darabont, Jeffrey DeMunn, Harry Dean Stanton, Dabbs Greer, David Morse, Thomas Newman, Sam Rockwell, Graham Greene, Eve Brent, Richard Francis-Bruce, Bonnie Hunt, Gary Sinise, Brent Briscoe, Tom Hanks, James Cromwell, Barry Pepper, Patricia Clarkson, David Tattersall, Michael Clarke Duncan, Michael Jeter, Bill SadlerDoug Hutchison, Frank Darabont, Jeffrey DeMunn, Harry Dean Stanton, Dabbs Greer, David Morse, Thomas Newman, Sam Rockwell, Graham Greene, Eve Brent, Richard Francis-Bruce, Bonnie Hunt, Gary Sinise, Brent Briscoe, Tom Hanks, James Cromwell, Barry Pepper, Patrici…   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '3 hours and 9 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': 'C2733', 'Director': 'Frank Darabont', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 9 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Tom Hanks, Michael Clarke Duncan, Jeffrey DeMunn, Dabbs Greer, Bonnie Hunt', 'Subtitles': 'French, English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nDelivery fast and the movie is an all time favorite! Tom Hanks, the late and sorely missed Michael Duncan Clarke, and great supporting cast make this movie a constant &#34;watch over&#34; in my home.\nGreat Family Fun!\nThe Five People You Meet in Heaven\nJon Voight  (Actor),     Ellen Burstyn  (Actor),     Lloyd Kramer  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product description', 'Five People You', 'Amazon.com', 'Based on the bestseller by Mitch Albom (', 'Tuesdays With Morrie', '),', 'The Five People You Meet in Heaven', 'takes up where', 'It\\x92s A Wonderful Life', 'left off. In the Capra classic, George Bailey gets a vision of life without him. In this Hallmark Hall of Fame production, Eddie (Jon Voight), an amusement park maintenance man and war veteran, ends up in Heaven after an accident takes his life. There he meets five people from his past: the Blue Man (Jeff Richards), the Captain (Michael Imperioli), Marguerite (Dagmara Dominczyk), Ruby (Ellen Burstyn), and Tala (Nicaela and Shelbie Weigel). Each shows him how he impacted their life or they his--and not always for the better. (In these flashbacks, Callahan Brebner and Steven Grayhm play the young Eddie.) The point may seem simplistic--everyone is connected--but', 'The Five People You Meet in Heaven', 'finds a unique and engaging way to make it.', '--Kathleen C. Fennessy']\n{'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Ellen Burstyn, Jeff Daniels, Nicaela Weigel, Callahan Brebner, Shelbie Weigel, Jon Voight, Dagmara Dominczyk, Lloyd Kramer, Callum Keith Rennie, Michael Imperioli, Rebecca Jenkins, Darcy Cadman, Mitch Albom, Steven GrayhmEllen Burstyn, Jeff Daniels, Nicaela Weigel, Callahan Brebner, Shelbie Weigel, Jon Voight, Dagmara Dominczyk, Lloyd Kramer, Callum Keith Rennie, Michael Imperioli, Rebecca Jenkins, Darcy Cadman, Mitch Albom, Steven Grayhm  See more', 'Language': 'English', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.01 x 0.01 x 0.01 inches; 3.04 Ounces', 'Director': 'Lloyd Kramer', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'February 8, 2005', 'Actors': 'Jon Voight, Ellen Burstyn, Jeff Daniels, Dagmara Dominczyk, Steven Grayhm', 'Studio': 'Lions Gate', 'Writers': 'Mitch Albom', 'Number of discs': '1'}\nJon Voight is spectacular in his performance! This haunting glimpse of what may be in the afterlife is and yet comforting in its final stage.\nHaunting, beautifully written story!",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: BET ComicView All Stars, Vol. 3\nReview Date: 2012/09/25\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['DVD']\nAverage Rating: 4.7\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Media Format': 'NTSC', 'Release date': 'June 11, 2002', 'Studio': 'Time Life Records'}\nReview Text: Wish they had more of Don DC Curry! The other artists are funny as well, some are younger shots of current/recent successful comedians, but other than that I would rate it a 8.5. Definitely worth a look!\nReview Title: Hilarious!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Warriors [Blu-ray](Ultimate Directors cut)\nReview Date: 2013/09/11\nStore: Michael Beck  (Actor),     James Remar  (Actor),     Walter Hill  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Warriors, The (BD)', \"A battle of gigantic proportions is looming in the neon underground of N ew York City. The armies of the night number 100,000; they o utnumber th e police 5 to 1; and tonight they're after the Warriors - a street gang blamed unfairly for a rival gang leader's death. This contemporary actio n-adventure story takes place at night, underground, in the sub-culture of gang warfare that rages from Coney Island to Manhattan to the Bronx. Members of the Warriors fight for their lives, seek to survive in the u rban jungle and learn the meaning of loyalty. This intense and stylized film is a dazzling achievement for cinematographer Andrew Laszlo.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'NTSC, Widescreen, Multiple Formats, Blu-ray', 'Contributor': 'Michael Beck, Brian Tyler, Walter Hill, David Harris, Dorsey Wright, James Remar', 'Language': 'English (Dolby Digital 5.1), Spanish (Mono), French (Mono)', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370216BR', 'Director': 'Walter Hill', 'Media Format': 'Multiple Formats, Blu-ray, Widescreen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Michael Beck, James Remar, Dorsey Wright, Brian Tyler, David Harris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Just a present for my wife! She's is a nut case fro this movie so I got it for her as a gag gift!\nReview Title: I got it for my wife, she loves it!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Collar TV - Season 1, Vol. 1\nReview Date: 2013/09/11\nStore: Jeff Foxworthy  (Actor, Writer),     Larry the Cable Guy  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'The guys who had you laughing on the Blue Collar Comedy Tour - Jeff Foxworthy, Bill Engvall and Larry the Cable Guy - bring their particular brand of hilarity to Blue Collar TV: Season 1 Volume 1. Expect a hometown buffet of TV parodies, sketches, and stand-up, celebrating everything from spouses to spoilers, Winnebagos to Waffle Houses, cheap beer to even cheaper lingerie. You are about to get a 64-oz. Big Gulp of blue collar comedy. Are you ready?', 'DVD Features:', 'Documentary', 'Other', 'Amazon.com', 'Blue Collar TV', 'finds three of the boys from', 'Blue Collar Comedy Tour: The Movie', 'and', 'Blue Collar Comedy Tour Rides Again', 'in a sketch comedy format, supported by a talented ensemble of comic players and writers who know how to build on the stars\\' individual strengths. Jeff Foxworthy is the series\\' anchor, opening each episode in the 1994 debut season with a strong monologue riffing on one or another theme: marriage, bad jobs, sports, vacations, family, partying. Happy redneck Larry the Cable Guy and NASCAR-loving Everyman Bill Engvall join Foxworthy in energetic skits that definitely become funnier and bolder with each new show. Among the best sketches is \"CSI: Greater Greensboro Tri-Area,\" in which Foxworthy\\'s crime-scene sleuth is on the trail of a deerslayer. \"Lingerie for Couples Together 20 Years\" spotlights such hot domestic garb as sweatshirts accented with a ratty, cat-hair-covered blanket from the back of a closet. \"Hug or Hit\" is a mock game show in which a terrified contestant has to predict whether a drunk sleeping in a glass booth will, upon awakening, embrace or take a swing at him.', 'The recurring \"I believe\" format finds Foxworthy, Larry, and Engvall piously revealing articles of their faith in this hard, hard world: \"I believe,\" Engvall says, \"that Angelina Jolie thinks about me as much as I think about her.\" Right. Guest star Ron White (the missing fourth partner from the', 'Blue Collar', \"tours), cigarette and Scotch-on-the-rocks in hand, lends his decadent (and welcome) persona here and there to the proceedings. Drew Carey shows up as well, but it's the series' obvious growth over 13 episodes that makes\", 'Blue Collar TV', 'a comedy success.', '--Tom Keogh']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Documentary, Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff FoxworthyLarry the Cable Guy, Adam Weiss, Nathan Wright, Tom Park, Ron White, Kurt Heydle, Ashley Eckstein, Adam Small, AmyKathryn Jones, Kathy Katz, Bill Engvall, Ted Kenney, Heath Hyche, Peter Oldring, Brooke Dillman, Ayda Field, Fax Bahr, Gary Anthony Williams, Jeff Foxworthy   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 0.5 inches; 5.6 Ounces', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '5 hours and 2 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Jeff Foxworthy, Larry the Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Producers': 'Kathy Katz, Ted Kenney, Tom Park', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy', 'Number of discs': '2'}\nReview Text: I like good redneck humor and this is it! You might be a redneck if.....FUNNY! Jeff Foxworthy, Bill Engvall and Larry the Cable Guy have done it again with a lot of laughs smash hit and of course, some redneck humor! Freakin funnier than ever yee hahah!\nReview Title: Great Redneck Humor!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Collar TV: Season 1, Vol. 2\nReview Date: 2013/09/11\nStore: Jeff Foxworthy  (Actor, Writer),     Larry The Cable Guy  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['If you thought the Vol. 1 Blue Collar TV DVD was as welcome and satisfying as ham and red-eye gravy, you\\'re only half right. \\'Cause this Vol. 2 set (3 discs, 18 episodes) completes the Season 1 fun and, like the previous volume, builds each episode around a theme ? like \"The Human Body,\" \"Christmas\" or \"Gadgets.\" Pass that gravy and stay awhile, friends. Y\\'all gonna have some right-good laughs.']\nAverage Rating: 4.5\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Larry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff FoxworthyLarry The Cable Guy, Mathew Harawitz, Nathan Wright, Ron White, Adam Small, AmyKathryn Jones, Bill Engvall, Redneck Massiah, Brooke Dillman, John Fitzgerald Page, Jeff Jarrett, Deana Carter, Fax Bahr, Leigh Kunis, Jeff Foxworthy   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '3', 'Runtime': '6 hours and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'February 7, 2006', 'Actors': 'Jeff Foxworthy, Larry The Cable Guy, Bill Engvall, Brooke Dillman, Nathan Wright', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Adam Small, Fax Bahr, Jeff Foxworthy, Mathew Harawitz', 'Number of discs': '3'}\nReview Text: FUNNY! FUNNY! Jeff Foxworthy has done it again with a lot of laughs smash hit and of course, some redneck humor!\nReview Title: Good Hillbilly Redneck Humor/Skits!!!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ron White: A Little Unprofessional\nReview Date: 2013/09/11\nStore: Ron White  (Actor),     Tom Forest  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Ron 'Tater Salad' White has been Drunk in Public. He Tried to Fix Stupid. No one argues that he has Behavioral Problems, and now he is 'A Little Unprofessional'. with cigar in one hand and a glass of scotch in the other, the Grammy-Nominated Blue Collar Comedy Tour alum delivers more than an hour of all new material with is signature, irreverent storytelling style and the best comedic timing in the business. Filmed live at the Paramount Theater in Austin, TX.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Tom Forest, Ron White', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Tom Forest', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Uhe/Csdc', 'Number of discs': '1'}\nReview Text: FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! FUNNY! Ron White has done it again with a Las Vegas smash hit and of course, some great scotch!\nReview Title: Funny as expected!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/12/08\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nReview Text: My wife and daughter love the Hunger Games! Hungry for more! Great Entertainment for All the family to watch! Can't wait for the sequel!\nReview Title: Hungry for more! Great Entertainment for All!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ron White: Behavioral Problems\nReview Date: 2013/12/08\nStore: Ron White  (Actor),     Michael Drumm  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, The Comedy Central Store, Stand Up\nProduct Description: ['BLUE COLLAR COMEDY star Ron White ups the ante with this raucous comedy special that covers all the hot topics. First aired on Comedy Central, BEHAVIORAL PROBLEMS features the irrepressible comic in the spotlight, cigar in hand, telling it like it is. Special Features: Letterbox - 1.85 Audio: Dolby Digital 5.1, Stereo Subtitles English.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Ron White, Michael Drumm', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '5070817', 'Director': 'Michael Drumm', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 11 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Ron White', 'Subtitles': 'English', 'Studio': 'Comedy Central', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! Mr.White is keen and witty for a guy that drinks the way he does recalling various accounts of being kick of out bar for wearing a cowboy hat, to using such educated vocabulary terms such as &#34;fraught&#34; and &#34;shat whole&#34; and making references to gingko bilova, and all the while claiming his childhood was educationally limited. You're smarter than you let on Mr. White! Just keep drinking\nReview Title: Ron White is the best drunk to perform in Public since the late great Foster Brooks!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Larry The Cable Guy - Git-R-Done\nReview Date: 2013/12/08\nStore: Larry the Cable Guy  (Actor, Writer),     Michael Drumm  (Director, Producer)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Special Interests\nProduct Description: ['Product Description', 'With his trademark cries of \"Git-er-done!\" and \"What the hell is this, Russia?,\" Larry the Cable Guy is one of country\\'s funniest comedians! Now enjoy an entire DVD of this irresistible funnyman at the top of his form and guaranteed to make you laugh again and again! A star of Comedy Central\\'s hit film Blue Collar Comedy Tour: The Movie, Larry has cracked up TV viewers of Showtime, MTV, Evening at the Improv and Comic Strip Live. He\\'s also well-known for his wacky, outrageous radio commentaries and for his bestselling CD, Lord, I Apologize.', 'Amazon.com', 'Redneck comedian Larry the Cable Guy (co-star of', 'Blue Collar Comedy Tour: The Movie', ') kicks off his live performance on', 'Git-R-Done', 'with one of the great questions of the modern age: \"Ever have an orgasm so strong you hit your head on the back of the tub?\" (He expresses gratitude that the VCR didn\\'t fall into the water.) A string of gay-bashing and other intemperate quips quickly follows, but Larry\\'s gross jokes are a part of an intentionally foolish persona. When he cracks wise about lesbian rocker Melissa Etheridge\\'s genitals, the crowd gasps, and Larry\\'s oversized rube becomes the punch line. Larry\\'s no less hard on his family, commenting on an obese sister who claims to have a thyroid problem: \"It\\'s not a thyroid problem, it\\'s a 7-11 problem.\" On his brief career as an evangelist: \"I was $150 short of bringing a stripper to the Lord.\" This is hick humor that sometimes gets under one\\'s skin.', '--Tom Keogh']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Larry the Cable Guy, Nicole Vinnola, J.P. Williams, Michael Drumm', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'MFR014381244427#VG', 'Director': 'Michael Drumm', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 6 minutes', 'Release date': 'May 25, 2004', 'Actors': 'Larry the Cable Guy', 'Producers': 'J.P. Williams, Michael Drumm, Nicole Vinnola', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Larry the Cable Guy', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! Larry is always telling stupid toilet-bowl jokes and stinky humor!\nReview Title: Larry Strikes Again!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Collar Comedy Tour: The Movie\nReview Date: 2013/12/08\nStore: Jeff Foxworthy  (Actor),     Bill Engvall  (Actor),     CB Harding  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Blue Collar Comedy (DVD)', 'This comedy concert movie features the stage performances of four stand-up comics -- Jeff Foxworthy (stand-up comedy CDs include the \"You May Be A Redneck If...\" series), Bill Engvall (comic CDs \"Dorkfish\" and \"Here\\'s Your Sign\"), Larry the Cable Guy (a redneck Texan and know-it-all comedian famous for his wacky, outrageous and topical commentaries and his CD \"Lord, I Apologize\") and Ron White (\"No one makes me laugh harder than Ron.\" - Jeff Foxworthy) -- as well as behind-the-scenes sequences.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Stand-Up, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Larry The Cable Guy, JP Williams, Alan Blomquist, Alan C. Blomquist, CB Harding, Ron White, E.K. Gaylord II, Casey La Scala, Jeff Foxworthy, Bill Engvall, Hunt LowryLarry The Cable Guy, JP Williams, Alan Blomquist, Alan C. Blomquist, CB Harding, Ron White, E.K. Gaylord II, Casey La Scala, Jeff Foxworthy, Bill Engvall, Hunt Lowry  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '116302', 'Director': 'CB Harding', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled', 'Run time': '1 hour and 46 minutes', 'Release date': 'May 15, 2007', 'Actors': 'Jeff Foxworthy, Bill Engvall, Ron White, Larry The Cable Guy', 'Subtitles': 'Spanish, English, French', 'Producers': 'E.K. Gaylord II, Alan C. Blomquist, JP Williams, Hunt Lowry, Casey La Scala', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! One of the best comedy teams ever! Bar none!\nReview Title: One of the best comedy teams ever!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Redneck Comedy Roundup 1 & 2 - Doublewide 2 Feature Set\nReview Date: 2013/12/08\nStore: Jeff Foxworthy  (Actor),     Bill Engvall  (Actor),     Various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: [\"America's Favorite Funnymen!\", 'Double the Jokes - Double the Every-Man Observations!', 'YOU MIGHT BE A REDNECK FAN IF&YOU BUY THIS DVD!', \"Get ready to be entertained southern style as America's favorite comedians team up to bring you unapologetic humor about all things white-trash, redneck, and blue-collar. See Jeff Foxworthy, Bill Engvall and Ron White from the Blue Collar Comedy Tour along with other familiar comedians like Jerry Springer, Ron Shock and Bobcat Goldthwait perform their original material up close and personal from the best seats in the house.\", 'REDNECK COMEDY ROUNDUP:', 'This hilarious DVD features the brightest stars from the Blue Collar Comedy Tour. Join Jeff Foxworthy, Bill Engvall, Ron White, John fox, Black Clark, Ron Shock and more in this zany stand-up comedy showcase as they perform their original material on stage!', 'REDNECK COMEDY ROUNDUP 2', 'Redneck Comedy Roundup 2 is a zany stand-up comedy showcase from some of the brightest and funniest comedic stars in America. Featured comedians on this hilarious DVD include Jeff Foxworthy, Bill Engvall, Jerry Springer, Bobcat Goldthwait and more! Enjoy the best material culled from the early careers of these stand-up comedy legends!']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC, Multiple Formats, Color', 'Contributor': 'Blake Clark, Jerry Springer, John Fox, Ron Shock, Ron White, ...and Many More!, Bobcat Goldthwait, Various, Jeff Foxworthy, Bill EngvallBlake Clark, Jerry Springer, John Fox, Ron Shock, Ron White, ...and Many More!, Bobcat Goldthwait, Various, Jeff Foxworthy, Bill Engvall   See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6498161', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '2 hours and 26 minutes', 'Release date': 'January 18, 2011', 'Actors': 'Jeff Foxworthy, Bill Engvall, Ron White, Bobcat Goldthwait, John Fox', 'Studio': 'Mill Creek Ent', 'Number of discs': '1'}\nReview Text: My wife and I love the Blue Collar Crew, all of them! This has some of their earliest performances! Whoa!\nReview Title: Early Stuff Seldom Seen!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jeff Dunham: Minding the Monsters\nReview Date: 2013/12/08\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['Jeff Dunham’s', 'Minding the Monsters', 'brings together your favorites-- Walter, Peanut, Bubba J, Jose Jalapeno… On a Steek!, and Achmed the Dead Terrorist as you’ve never seen them before!\\xa0 Enter the ultimate haunted house where Walter transforms into something grumpier than he already is! Watch Bubba J rise from the dead!\\xa0 Meet Peanut’s alter ego, The Purple Avenger of the Night, and his spicy sidekick! And witness Achmed literally dressed to kill in an outfit that would terrify the most terrifying terrorist!']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Contributor': 'Dunham, Jeff', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 20 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '25631210', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Dunham, Jeff', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: Love Jeff Dunham, best ventriloquist since McCarthy! Love his little &#34;monsters&#34; theme and the staging of this show. Jeff's comedy twist don't usually involve a lot of repeat jokes or stories, he is really fresh with his humor, testing all areas of society and the world!\nReview Title: Dunham Strikes Back!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jeff Dunham's Very Special Christmas Special\nReview Date: 2013/12/08\nStore: Jeff Dunham  (Actor),     N/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['FUN FOR THE ENTIRE FAMILY AND DESTINED TO BECOME A HOLIDAY FAVORITE!INCLUDES ONE HOUR OF EXCLUSIVE FOOTAGE NOT SEEN ON COMEDY CENTRAL BROADCAST!Jeff Dunham and his cast of characters join to make Christmas very special -- and hilarious -- like only they know how. All new show also includes bonus material with numerous DVD extras. Share this must-have event with the entire family for Christmas and all year long!DVD is loaded with additional footage and extras not seen on television including Holiday Tips, Outtakes, Ask Santa-Walter, and Behind The Scenes.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Color, Dolby, NTSC, Multiple Formats, Widescreen', 'Contributor': 'N/a, Jeff Dunham', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR014381514926#VG', 'Director': 'N/a', 'Media Format': 'Color, Dolby, NTSC, Multiple Formats, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Jeff Dunham', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: Good work from Jeff and his &#34;kids&#34;! Still nuts and highly inventive after all these years! Raunchy Humor and a song from one of my favs- Bubba J!!\nReview Title: Christmas Spirit with Zing and a Laugh!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Superstar\nReview Date: 2013/12/08\nStore: Molly Shannon  (Actor, Writer),     Will Ferrell  (Actor),     Bruce McCulloch  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['Based on the popular Saturday Night Live sketch, Superstar follows the hilarious adventures of klutzy schoolgirl Mary Katherine Gallagher (Shannon) as she pursues her dream of the perfect kissand superstardom!']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Director': 'Bruce McCulloch', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'April 11, 2000', 'Actors': 'Molly Shannon, Will Ferrell, Elaine Hendrix, Harland Williams, Mark McKinney', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Studio': 'Paramount', 'Writers': 'Molly Shannon, Steve Koren', 'Number of discs': '1'}\nReview Text: My wife loves this movie, well we both do it's stupid-funny! Dumb humor and quirk moments had the family laughing constantly!\nReview Title: Stoopidlious!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Carol [DVD]\nReview Date: 2013/12/08\nStore: George C. Scott  (Actor),     Frank Finlay  (Actor),     Clive Donner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: ['Christmas elicits nothing more than \"Bah, humbug!\" from Ebenezer Scrooge (Scott), a miser whose sole pursuit of financial success has left him a bitter and lonely old man. But a Christmas Eve visit from the Ghosts of Christmas Past, Present and Future ultimately teaches him to open his heart to the spirit of Christmas and to the joys of friends and family.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Closed-captioned, Color, Dolby, DVD, NTSC', 'Contributor': 'Angela Pleasence, Caroline Langrishe, Anthony Walters, Roger O. Hirson, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Roger Rees, Charles Dickens, Frank Finlay, David Warner, Edward Woodward, Susannah York, Lucy GutteridgeAngela Pleasence, Caroline Langrishe, Anthony Walters, Roger O. Hirson, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Roger Rees, Charles Dickens, Frank Finlay, David Warner, Edward Woodward, Susannah York, Lucy Gutteridge  See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.16 Ounces', 'Item model number': 'MFR086162127519#VG', 'Director': 'Clive Donner', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 5, 1999', 'Actors': 'George C. Scott, Frank Finlay, Angela Pleasence, Edward Woodward, Michael Carter', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Charles Dickens, Roger O. Hirson', 'Number of discs': '1'}\nReview Text: My wife loves this movie, well I'm kind of attach to it too. It's great during the holiday season and we watch all the Christmas favorites!\nReview Title: Great for the Holidays! George C. Scott is superb!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Viva! Hysteria [Blu-ray]\nReview Date: 2013/12/08\nStore: Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"For the first time ever, Def Leppard played their album HYSTERIA in its entirety during an eleven-show residency which started on March 22, 2013 at The Joint in the Hard Rock Hotel And Casino in Las Vegas. The band also opened for themselves under the fictitious name of DED FLATBIRD for two different sets on each of the nights. During those DED FLATBIRD sets, the band showcased some fan favorites and rare songs from the early years of the band in addition to playing a selection of their greatest hits, highlighting classic material from throughout their career. The VIVA! HYSTERIA show featured an elaborate set design created specifically for Def Leppard 's Las Vegas residency.Known for legendary big-scale arena shows, Def Leppard will bring their over-the-top production to your house as VIVA! HYSTERIA is their first full live show shot in HD to be released commercially. VIVA! HYSTERIA showcases for the first time the band's career-defining album performed live in its entirety - from start to finish - for a commercial audio/video release.Blu-Ray also includes bonus content of the acoustic medley: Where does love go when it dies/Now/When Love & Hate Collide/Have You Ever Needed Someone So Bad/Two Steps Behind.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Def Leppard Viva! Hysteria, Rock', 'Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Contributor': 'Def Leppard', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 5.1 ES Matrix)', 'Number Of Discs': '1', 'Aspect Ratio': '16:9', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.89 x 5.99 x 0.42 inches; 2.4 Ounces', 'Item model number': '8024391062081', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'February 1, 2017', 'Actors': 'Def Leppard', 'Dubbed': 'English', 'Studio': 'FRONTIERS MUSIC SRL', 'Number of discs': '1'}\nReview Text: My wife loves this super group of true 80's rock! Def Leppard is dynamite in this return to the stage! 80's Rock Rules!\nReview Title: 80's Rock Rules!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Green Mile (Single Disc Edition)\nReview Date: 2013/12/28\nStore: Tom Hanks  (Actor),     Michael Clarke Duncan  (Actor),     Frank Darabont  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Green Mile, The (DVD)', \"From award-winning writer-director Frank Darabont (The Shawshank Redemption) and best-selling author Stephen King's novel comes the story of a man who didn't believe in miracles. Multiple Academy Award winner Tom Hanks leads a dynamic cast in a tale about life, death and the wonders of the human spirit, The Green Mile. Death row head guard Paul Edgecomb (Hanks--Forrest Gump, Philadelphia) has walked many inmates down the stretch of green linoleum that leads to Louisiana's electric chair. But never has he encountered anyone like John Coffey (Michael Clarke Duncan--Armageddon), a massive black man convicted of brutally killing two little white girls. When pain cripples Edgecomb, Coffey reaches from behind bars to lay healing hands on the stricken guard and rid him of the infection that racks his body.\", ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Doug Hutchison, Frank Darabont, Jeffrey DeMunn, Harry Dean Stanton, Dabbs Greer, David Morse, Thomas Newman, Sam Rockwell, Graham Greene, Eve Brent, Richard Francis-Bruce, Bonnie Hunt, Gary Sinise, Brent Briscoe, Tom Hanks, James Cromwell, Barry Pepper, Patricia Clarkson, David Tattersall, Michael Clarke Duncan, Michael Jeter, Bill SadlerDoug Hutchison, Frank Darabont, Jeffrey DeMunn, Harry Dean Stanton, Dabbs Greer, David Morse, Thomas Newman, Sam Rockwell, Graham Greene, Eve Brent, Richard Francis-Bruce, Bonnie Hunt, Gary Sinise, Brent Briscoe, Tom Hanks, James Cromwell, Barry Pepper, Patrici…   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '3 hours and 9 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': 'C2733', 'Director': 'Frank Darabont', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 9 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Tom Hanks, Michael Clarke Duncan, Jeffrey DeMunn, Dabbs Greer, Bonnie Hunt', 'Subtitles': 'French, English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Delivery fast and the movie is an all time favorite! Tom Hanks, the late and sorely missed Michael Duncan Clarke, and great supporting cast make this movie a constant &#34;watch over&#34; in my home.\nReview Title: Great Family Fun!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Five People You Meet in Heaven\nReview Date: 2013/12/28\nStore: Jon Voight  (Actor),     Ellen Burstyn  (Actor),     Lloyd Kramer  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Product description', 'Five People You', 'Amazon.com', 'Based on the bestseller by Mitch Albom (', 'Tuesdays With Morrie', '),', 'The Five People You Meet in Heaven', 'takes up where', 'It\\x92s A Wonderful Life', 'left off. In the Capra classic, George Bailey gets a vision of life without him. In this Hallmark Hall of Fame production, Eddie (Jon Voight), an amusement park maintenance man and war veteran, ends up in Heaven after an accident takes his life. There he meets five people from his past: the Blue Man (Jeff Richards), the Captain (Michael Imperioli), Marguerite (Dagmara Dominczyk), Ruby (Ellen Burstyn), and Tala (Nicaela and Shelbie Weigel). Each shows him how he impacted their life or they his--and not always for the better. (In these flashbacks, Callahan Brebner and Steven Grayhm play the young Eddie.) The point may seem simplistic--everyone is connected--but', 'The Five People You Meet in Heaven', 'finds a unique and engaging way to make it.', '--Kathleen C. Fennessy']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Ellen Burstyn, Jeff Daniels, Nicaela Weigel, Callahan Brebner, Shelbie Weigel, Jon Voight, Dagmara Dominczyk, Lloyd Kramer, Callum Keith Rennie, Michael Imperioli, Rebecca Jenkins, Darcy Cadman, Mitch Albom, Steven GrayhmEllen Burstyn, Jeff Daniels, Nicaela Weigel, Callahan Brebner, Shelbie Weigel, Jon Voight, Dagmara Dominczyk, Lloyd Kramer, Callum Keith Rennie, Michael Imperioli, Rebecca Jenkins, Darcy Cadman, Mitch Albom, Steven Grayhm  See more', 'Language': 'English', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.01 x 0.01 x 0.01 inches; 3.04 Ounces', 'Director': 'Lloyd Kramer', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'February 8, 2005', 'Actors': 'Jon Voight, Ellen Burstyn, Jeff Daniels, Dagmara Dominczyk, Steven Grayhm', 'Studio': 'Lions Gate', 'Writers': 'Mitch Albom', 'Number of discs': '1'}\nReview Text: Jon Voight is spectacular in his performance! This haunting glimpse of what may be in the afterlife is and yet comforting in its final stage.\nReview Title: Haunting, beautifully written story!\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe shopping history reveals a strong preference for comedy, particularly centered around \"blue collar\" humor and stand-up performances. The individual consistently rates products highly, often favoring comedic works by well-known personalities, especially those associated with southern humor. There is a notable affinity for DVDs, suggesting a preference for physical media over digital formats, especially for comedy specials.\n\nCommon themes include enjoyment of family-friendly and lighthearted entertainment, often featuring relatable humor about everyday life. Purchases reflect a mix of both individual appreciation and shared family experiences, indicating social consumption patterns. The buyer is not highly sensitive to price, as evidenced by consistently high ratings despite varied pricing.\n\nOverall, the core preferences consist of comedic content that elicits laughter, particularly through the lens of southern, redneck, or blue-collar themes while maintaining a family-oriented approach to entertainment. The individual's reviews often express excitement and satisfaction, reinforcing a tendency to seek out feel-good, humorous content for personal enjoyment and shared family experiences.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Five Stars",
    "text": "Awesome....sad and breathtaking as well.",
    "images": [],
    "asin": "B07CKNQGLN",
    "parent_asin": "B07CKNQGLN",
    "user_id": "AH6BQ6CRQ5ST6E76BG4OV75QI3VQ",
    "timestamp": "2018-08-07 03:55:27.949000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 57975,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/98cd606eaaeb67e6c6a4969f923db199c13f4177df053951a07bdb652d9b2425._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/98cd606eaaeb67e6c6a4969f923db199c13f4177df053951a07bdb652d9b2425._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/98cd606eaaeb67e6c6a4969f923db199c13f4177df053951a07bdb652d9b2425._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/98cd606eaaeb67e6c6a4969f923db199c13f4177df053951a07bdb652d9b2425._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/98cd606eaaeb67e6c6a4969f923db199c13f4177df053951a07bdb652d9b2425._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/98cd606eaaeb67e6c6a4969f923db199c13f4177df053951a07bdb652d9b2425._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English",
        "English [Audio Description]"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Anthony Russo",
        "Joe Russo"
      ],
      "Producers": [
        "Kevin Feige"
      ],
      "Starring": [
        "Robert Downey Jr.",
        "Chris Hemsworth",
        "Mark Ruffalo"
      ],
      "Studio": [
        "Marvel"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}