{
  "user_id": "AFWWM7643WN2D7JVSZ6XRMLL5VJA",
  "summary": "=== Purchase Information ===\nProduct Title: Resident Evil: Afterlife [Blu-ray]\nReview Date: 2010/12/31\nStore: Milla Jovovich  (Actor),     Wentworth Miller  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'The fourth installment of the hugely successful', 'Resident Evil', 'franchise,', 'Resident Evil: Afterlife', 'is again based on the wildly popular video game series, and will this time be presented in 3-D. In a world ravaged by a virus infection, turning its victims into the Undead, Alice (Milla Jovovich), continues on her journey to find survivors and lead them to safety. Her deadly battle with the Umbrella Corporation reaches new heights, but Alice gets some unexpected help from an old friend. A new lead that promises a safe haven from the Undead takes them to Los Angeles, but when they arrive the city is overrun by thousands of Undead - and Alice and her comrades are about to step into a deadly trap.', 'Amazon.com', \"A barrage of 3-D effects enlivens Paul W.S. Anderson's\", 'Resident Evil: Afterlife', \", the fourth entry in the seemingly endless action-science fiction horror franchise based on the popular Capcom video game series. Plot, dialogue, and character development all remain secondary considerations; what's key here are the set pieces that allow Milla Jovovich to unleash maximum damage to virally infected zombies, villainous henchmen, and just about anyone else who stands in the way of her stopping the shadowy Umbrella Corporation. Jovovich retains the blend of grit and pulchritude that have made her a fanboy favorite (though said viewers may decry the film's bit of shower-scene interruptus), and she's well supported by returning cast members Ali Larter and Boris Kodjoe (\", 'Undercovers', ') and', 'Prison Break', \"'s Wentworth Miller, who, as Claire's brother, is back behind bars in a postapocalyptic jail overrun by plague zombies. And the 3-D effects are impressive and give a shot of adrenaline to the already hyper-driven action and CGI elements. Those looking for more than what the\", 'Resident Evil', \"franchise is designed to provide--souped-up, B-movie thrills--are advised to lower their expectations; franchise devotees should be pleased, especially by the film's final scene, which (naturally) sets up another sequel.\", '--Paul Gaita']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action, Sci-Fi, Horror, Thriller', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Blu-ray', 'Contributor': 'Ali Larter, Wentworth Miller, Milla Jovovich', 'Language': 'English, French', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.43 x 4.98 x 7 inches; 2.56 Ounces', 'Audio Description': 'English', 'Item model number': '15323783', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Blu-ray', 'Run time': '1 hour and 37 minutes', 'Release date': 'December 28, 2010', 'Actors': 'Milla Jovovich, Wentworth Miller, Ali Larter', 'Dubbed': 'French, Spanish, Portuguese', 'Subtitles': 'Spanish, French, English', 'Studio': 'Screen Gems', 'Number of discs': '1'}\nReview Text: i really like afterlife its one of the better ones i did not care for #2 rest i like lot but this is on my top list of the resident evil movies i hope they keep going like this because this just keeps on getting better\nReview Title: resident evil afterlife\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Planes\nReview Date: 2014/12/27\nStore: Dane Cook  (Actor),     Stacy Keach  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nAverage Rating: 4.7\nProduct Details: {}\nReview Text: Grandson loves it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: X2: X-Men United [Blu-ray]\nReview Date: 2015/06/13\nStore: Halle Berry  (Actor),     Alan Cumming  (Actor),     Bryan Singer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Professor Xavier's Mutant Academy faces continued persecution including a military attack. At the same time his troupe of young adults with special powers must stop an evil mutant who attempts to assassinate the U.S. President.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Military & War', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'James N. Kirk, Halle Berry, Bryan Singer, Charles Siegel, Anna Paquin, Kelly Hu, Ian McKellen, Brian Cox, Dylan Kussman, Cotter Smith, Peter Wingfield, James Marsden, Stephen Spender, Patrick Stewart, Michael Reid Mackay, Bruce Davison, Alan Cumming, Famke JanssenJames N. Kirk, Halle Berry, Bryan Singer, Charles Siegel, Anna Paquin, Kelly Hu, Ian McKellen, Brian Cox, Dylan Kussman, Cotter Smith, Peter Wingfield, James Marsden, Stephen Spender, Patrick Stewart, Michael Reid Mackay, Bruce Davison, Alan Cumming, Famke Janssen  See more', 'Language': 'English, Spanish, French, Portuguese', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'FOXS2287901BR', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 13 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Halle Berry, Alan Cumming, Bruce Davison, Kelly Hu, Famke Janssen', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Star Wars Trilogy Episodes I-III (Blu-ray + DVD)\nReview Date: 2015/06/13\nStore: Hayden Christiansen  (Actor),     Ewan McGregor  (Actor),     George Lucas  (Director)    &                   0                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Star Wars: The Prequel Trilogy on Blu-ray+DVD Combo feature Star Wars Episodes I-III. The greatest space saga ever told begins with Star Wars: Episode I - The Phantom Menace, Star Wars: Episode II - Attack of the Clones, and Star Wars: Episode III - Revenge of the Sith and follows young Anakin Skywalker's descent to the dark side as he transforms from child slave to Jedi apprentice to the evil Darth Vader! Star Wars Episode I: The Phantom Menace(32 Years Before Episode IV) Stranded on the desert planet Tatooine after rescuing young Queen Amidala from the impending invasion of Naboo, Jedi apprentice Obi-Wan Kenobi and his Jedi Master discover nine-year-old Anakin Skywalker, a young slave unusually strong in the Force. Anakin wins a thrilling Podrace and with it his freedom as he leaves his home to be trained as a Jedi. The heroes return to Naboo where Anakin and the Queen face massive invasion forces while the two Jedi contend with a deadly foe named Darth Maul. Only then do they realize the invasion is merely the first step in a sinister scheme by the re-emergent forces of darkness known as the Sith. Star Wars Episode II: Attack of the Clones(22 Years Before Episode IV) Ten years after the events of the Battle of Naboo, not only has the galaxy undergone significant change, but so have Obi-Wan Kenobi, Padmé Amidala, and Anakin Skywalker as they are thrown together again for the first time since the Trade Federation invasion of Naboo. Anakin has grown into the accomplished Jedi apprentice of Obi-Wan, who himself has transitioned from student to teacher. The two Jedi are assigned to protect Padmé whose life is threatened by a faction of political separatists. As relationships form and powerful forces collide, these heroes face choices that will impact not only their own fates, but the destiny of the Republic. Star Wars Episode III: Revenge of the Sith(19 Years before Episode IV) Three years after the onset of the Clone Wars, the noble Jedi Knights have been leading a massive clone army into a galaxy-wide battle against the Separatists. When the sinister Sith unveil a thousand-year-old plot to rule the galaxy, the Republic crumbles and from its ashes rises the evil Galactic Empire. Jedi hero Anakin Skywalker is seduced by the dark side of the Force to become the Emperor's new apprentice - Darth Vader. The Jedi are decimated, as Obi-Wan Kenobi and Jedi Master Yoda are forced into hiding. The only hope for the galaxy are Anakin's own offspring - the twin children born in secrecy who will grow up to become Luke Skywalker and Princess Leia Organa.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Hayden Christiansen, Natalie Portman, George Lucas, Ewan McGregor', 'Language': 'English', 'Runtime': '6 hours and 59 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 5.6 Ounces', 'Item model number': '99214', 'Director': 'George Lucas', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '6 hours and 59 minutes', 'Release date': 'October 8, 2013', 'Actors': 'Hayden Christiansen, Ewan McGregor, Natalie Portman', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, Spanish, Portuguese, French', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '6'}\nReview Text: Goo moviw\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: X-Men [Blu-ray]\nReview Date: 2015/06/13\nStore: Halle Berry  (Actor),     Bruce Davison  (Actor),     Bryan Singer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"X-MEN is the live-action, big-screen adaptation of the most popular comic book series of the world. Outcasts since birth, the X-Men are the next step of human evolution, each born with a unique genetic mutation that gives them extraordinary powers that they've learned to harness for the greater good. But mankind fears what it doesn't understand, and the X-Men soon realize that the race they fight to protect against incalculable evil rejects them.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, SubtitledMultiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled  See more', 'Contributor': 'Ray Park, Stan Lee, Tyler Mane, Halle Berry, Bryan Singer, Anna Paquin, Newton Thomas Sigel, Ian McKellen, Brett Morris, Alex Burton, James Marsden, Patrick Stewart, Matthew Sharp, Rebecca Romijn, Bruce Davison, Michael Kamen, Hugh Jackman, Famke JanssenRay Park, Stan Lee, Tyler Mane, Halle Berry, Bryan Singer, Anna Paquin, Newton Thomas Sigel, Ian McKellen, Brett Morris, Alex Burton, James Marsden, Patrick Stewart, Matthew Sharp, Rebecca Romijn, Bruce Davison, Michael Kamen, Hugh Jackman, Famke Janssen  See more', 'Language': 'English, Spanish, French, Portuguese', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '2287899', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 44 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Halle Berry, Bruce Davison, Famke Janssen, Ian McKellen, Patrick Stewart', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: X-Men: First Class (+ Digital Copy) [Blu-ray]\nReview Date: 2015/06/13\nStore: James McAvoy  (Actor),     Michael Fassbender  (Actor),     Matthew Vaughn  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'X-Men: First Class is the thrilling, eye-opening chapter you’ve been waiting for...Witness the beginning of the X-Men Universe. Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their superhuman powers for the first time, working together in a desperate attempt to stop the Hellfire Club and a global nuclear war.', 'Amazon.com', \"When Bryan Singer brought Marvel's X-Men to the big screen, Magneto and Professor X were elder statesmen, but Matthew Vaughn (Kick-Ass) travels back in time to present an origin story--and an alternate version of history. While Charles Xavier (Laurence Belcher) grows up privileged in New York, Erik Lehnsherr (Bill Milner) grows up underprivileged in Poland. As children, the mind-reading Charles finds a friend in the shape-shifting Raven (Jennifer Lawrence) and Erik finds an enemy in Sebastian Shaw (Kevin Bacon), an energy-absorbing Nazi scientist who treats the metal-bending lad like a lab rat. By 1962, Charles (James McAvoy) has become a swaggering genetics professor and Erik (Michael Fassbender, McAvoy's Band of Brothers costar) has become a brooding agent of revenge. CIA agent Moira (Rose Byrne) brings the two together to work for Division X. With the help of MIB (Oliver Platt) and Hank (A Single Man's Nicholas Hoult), they seek out other mutants, while fending off Shaw and Emma Frost (Mad Men's January Jones), who try to recruit them for more nefarious ends, leading to a showdown in Cuba between the United States and the Soviet Union, the good and bad mutants, and Charles and Erik, whose goals have begun to diverge. Throughout, Vaughn crisscrosses the globe, piles on the visual effects, and juices the action with a rousing score, but it's the actors who make the biggest impression as McAvoy and Fassbender prove themselves worthy successors to Patrick Stewart and Ian McKellen. The movie comes alive whenever they take center stage, and dies a little when they don't. For the most part, though, Vaughn does right by playing up the James Bond parallels and acknowledging the debt to producer Bryan Singer through a couple of clever cameos. --\", 'Kathleen C. Fennessy', 'Related Products', 'More X-Men', 'Books', 'Toys', 'More From the Stars of', 'X-Men: First Class', 'James McAvoy', 'Michael Fassbender', 'Matthew Vaughn']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copyMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'Lucas Till, Rose Byrne, Oliver Platt, Michael Fassbender, January Jones, Kevin Bacon, James McAvoy, Nicholas Hoult, Jennifer Lawrence, Matthew VaughnLucas Till, Rose Byrne, Oliver Platt, Michael Fassbender, January Jones, Kevin Bacon, James McAvoy, Nicholas Hoult, Jennifer Lawrence, Matthew Vaughn  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.4 x 0.4 x 6.7 inches; 3.2 Ounces', 'Item model number': '5049845098', 'Director': 'Matthew Vaughn', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 11 minutes', 'Release date': 'September 9, 2011', 'Actors': 'James McAvoy, Michael Fassbender, Rose Byrne, January Jones, Jennifer Lawrence', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference": "Resident Evil: Afterlife [Blu-ray]\nMilla Jovovich  (Actor),     Wentworth Miller  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'The fourth installment of the hugely successful', 'Resident Evil', 'franchise,', 'Resident Evil: Afterlife', 'is again based on the wildly popular video game series, and will this time be presented in 3-D. In a world ravaged by a virus infection, turning its victims into the Undead, Alice (Milla Jovovich), continues on her journey to find survivors and lead them to safety. Her deadly battle with the Umbrella Corporation reaches new heights, but Alice gets some unexpected help from an old friend. A new lead that promises a safe haven from the Undead takes them to Los Angeles, but when they arrive the city is overrun by thousands of Undead - and Alice and her comrades are about to step into a deadly trap.', 'Amazon.com', \"A barrage of 3-D effects enlivens Paul W.S. Anderson's\", 'Resident Evil: Afterlife', \", the fourth entry in the seemingly endless action-science fiction horror franchise based on the popular Capcom video game series. Plot, dialogue, and character development all remain secondary considerations; what's key here are the set pieces that allow Milla Jovovich to unleash maximum damage to virally infected zombies, villainous henchmen, and just about anyone else who stands in the way of her stopping the shadowy Umbrella Corporation. Jovovich retains the blend of grit and pulchritude that have made her a fanboy favorite (though said viewers may decry the film's bit of shower-scene interruptus), and she's well supported by returning cast members Ali Larter and Boris Kodjoe (\", 'Undercovers', ') and', 'Prison Break', \"'s Wentworth Miller, who, as Claire's brother, is back behind bars in a postapocalyptic jail overrun by plague zombies. And the 3-D effects are impressive and give a shot of adrenaline to the already hyper-driven action and CGI elements. Those looking for more than what the\", 'Resident Evil', \"franchise is designed to provide--souped-up, B-movie thrills--are advised to lower their expectations; franchise devotees should be pleased, especially by the film's final scene, which (naturally) sets up another sequel.\", '--Paul Gaita']\n{'Genre': 'Action, Sci-Fi, Horror, Thriller', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Blu-ray', 'Contributor': 'Ali Larter, Wentworth Miller, Milla Jovovich', 'Language': 'English, French', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.43 x 4.98 x 7 inches; 2.56 Ounces', 'Audio Description': 'English', 'Item model number': '15323783', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Blu-ray', 'Run time': '1 hour and 37 minutes', 'Release date': 'December 28, 2010', 'Actors': 'Milla Jovovich, Wentworth Miller, Ali Larter', 'Dubbed': 'French, Spanish, Portuguese', 'Subtitles': 'Spanish, French, English', 'Studio': 'Screen Gems', 'Number of discs': '1'}\ni really like afterlife its one of the better ones i did not care for #2 rest i like lot but this is on my top list of the resident evil movies i hope they keep going like this because this just keeps on getting better\nresident evil afterlife\nPlanes\nDane Cook  (Actor),     Stacy Keach  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{}\nGrandson loves it\nFive Stars\nX2: X-Men United [Blu-ray]\nHalle Berry  (Actor),     Alan Cumming  (Actor),     Bryan Singer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Professor Xavier's Mutant Academy faces continued persecution including a military attack. At the same time his troupe of young adults with special powers must stop an evil mutant who attempts to assassinate the U.S. President.\"]\n{'Genre': 'Military & War', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'James N. Kirk, Halle Berry, Bryan Singer, Charles Siegel, Anna Paquin, Kelly Hu, Ian McKellen, Brian Cox, Dylan Kussman, Cotter Smith, Peter Wingfield, James Marsden, Stephen Spender, Patrick Stewart, Michael Reid Mackay, Bruce Davison, Alan Cumming, Famke JanssenJames N. Kirk, Halle Berry, Bryan Singer, Charles Siegel, Anna Paquin, Kelly Hu, Ian McKellen, Brian Cox, Dylan Kussman, Cotter Smith, Peter Wingfield, James Marsden, Stephen Spender, Patrick Stewart, Michael Reid Mackay, Bruce Davison, Alan Cumming, Famke Janssen  See more', 'Language': 'English, Spanish, French, Portuguese', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'FOXS2287901BR', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 13 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Halle Berry, Alan Cumming, Bruce Davison, Kelly Hu, Famke Janssen', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nGood movie\nFive Stars\nStar Wars Trilogy Episodes I-III (Blu-ray + DVD)\nHayden Christiansen  (Actor),     Ewan McGregor  (Actor),     George Lucas  (Director)    &                   0                  more   Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Star Wars: The Prequel Trilogy on Blu-ray+DVD Combo feature Star Wars Episodes I-III. The greatest space saga ever told begins with Star Wars: Episode I - The Phantom Menace, Star Wars: Episode II - Attack of the Clones, and Star Wars: Episode III - Revenge of the Sith and follows young Anakin Skywalker's descent to the dark side as he transforms from child slave to Jedi apprentice to the evil Darth Vader! Star Wars Episode I: The Phantom Menace(32 Years Before Episode IV) Stranded on the desert planet Tatooine after rescuing young Queen Amidala from the impending invasion of Naboo, Jedi apprentice Obi-Wan Kenobi and his Jedi Master discover nine-year-old Anakin Skywalker, a young slave unusually strong in the Force. Anakin wins a thrilling Podrace and with it his freedom as he leaves his home to be trained as a Jedi. The heroes return to Naboo where Anakin and the Queen face massive invasion forces while the two Jedi contend with a deadly foe named Darth Maul. Only then do they realize the invasion is merely the first step in a sinister scheme by the re-emergent forces of darkness known as the Sith. Star Wars Episode II: Attack of the Clones(22 Years Before Episode IV) Ten years after the events of the Battle of Naboo, not only has the galaxy undergone significant change, but so have Obi-Wan Kenobi, Padmé Amidala, and Anakin Skywalker as they are thrown together again for the first time since the Trade Federation invasion of Naboo. Anakin has grown into the accomplished Jedi apprentice of Obi-Wan, who himself has transitioned from student to teacher. The two Jedi are assigned to protect Padmé whose life is threatened by a faction of political separatists. As relationships form and powerful forces collide, these heroes face choices that will impact not only their own fates, but the destiny of the Republic. Star Wars Episode III: Revenge of the Sith(19 Years before Episode IV) Three years after the onset of the Clone Wars, the noble Jedi Knights have been leading a massive clone army into a galaxy-wide battle against the Separatists. When the sinister Sith unveil a thousand-year-old plot to rule the galaxy, the Republic crumbles and from its ashes rises the evil Galactic Empire. Jedi hero Anakin Skywalker is seduced by the dark side of the Force to become the Emperor's new apprentice - Darth Vader. The Jedi are decimated, as Obi-Wan Kenobi and Jedi Master Yoda are forced into hiding. The only hope for the galaxy are Anakin's own offspring - the twin children born in secrecy who will grow up to become Luke Skywalker and Princess Leia Organa.\"]\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Hayden Christiansen, Natalie Portman, George Lucas, Ewan McGregor', 'Language': 'English', 'Runtime': '6 hours and 59 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 5.6 Ounces', 'Item model number': '99214', 'Director': 'George Lucas', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '6 hours and 59 minutes', 'Release date': 'October 8, 2013', 'Actors': 'Hayden Christiansen, Ewan McGregor, Natalie Portman', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, Spanish, Portuguese, French', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '6'}\nGoo moviw\nFive Stars\nX-Men [Blu-ray]\nHalle Berry  (Actor),     Bruce Davison  (Actor),     Bryan Singer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"X-MEN is the live-action, big-screen adaptation of the most popular comic book series of the world. Outcasts since birth, the X-Men are the next step of human evolution, each born with a unique genetic mutation that gives them extraordinary powers that they've learned to harness for the greater good. But mankind fears what it doesn't understand, and the X-Men soon realize that the race they fight to protect against incalculable evil rejects them.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, SubtitledMultiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled  See more', 'Contributor': 'Ray Park, Stan Lee, Tyler Mane, Halle Berry, Bryan Singer, Anna Paquin, Newton Thomas Sigel, Ian McKellen, Brett Morris, Alex Burton, James Marsden, Patrick Stewart, Matthew Sharp, Rebecca Romijn, Bruce Davison, Michael Kamen, Hugh Jackman, Famke JanssenRay Park, Stan Lee, Tyler Mane, Halle Berry, Bryan Singer, Anna Paquin, Newton Thomas Sigel, Ian McKellen, Brett Morris, Alex Burton, James Marsden, Patrick Stewart, Matthew Sharp, Rebecca Romijn, Bruce Davison, Michael Kamen, Hugh Jackman, Famke Janssen  See more', 'Language': 'English, Spanish, French, Portuguese', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '2287899', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 44 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Halle Berry, Bruce Davison, Famke Janssen, Ian McKellen, Patrick Stewart', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nGood movie\nFive Stars\nX-Men: First Class (+ Digital Copy) [Blu-ray]\nJames McAvoy  (Actor),     Michael Fassbender  (Actor),     Matthew Vaughn  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'X-Men: First Class is the thrilling, eye-opening chapter you’ve been waiting for...Witness the beginning of the X-Men Universe. Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their superhuman powers for the first time, working together in a desperate attempt to stop the Hellfire Club and a global nuclear war.', 'Amazon.com', \"When Bryan Singer brought Marvel's X-Men to the big screen, Magneto and Professor X were elder statesmen, but Matthew Vaughn (Kick-Ass) travels back in time to present an origin story--and an alternate version of history. While Charles Xavier (Laurence Belcher) grows up privileged in New York, Erik Lehnsherr (Bill Milner) grows up underprivileged in Poland. As children, the mind-reading Charles finds a friend in the shape-shifting Raven (Jennifer Lawrence) and Erik finds an enemy in Sebastian Shaw (Kevin Bacon), an energy-absorbing Nazi scientist who treats the metal-bending lad like a lab rat. By 1962, Charles (James McAvoy) has become a swaggering genetics professor and Erik (Michael Fassbender, McAvoy's Band of Brothers costar) has become a brooding agent of revenge. CIA agent Moira (Rose Byrne) brings the two together to work for Division X. With the help of MIB (Oliver Platt) and Hank (A Single Man's Nicholas Hoult), they seek out other mutants, while fending off Shaw and Emma Frost (Mad Men's January Jones), who try to recruit them for more nefarious ends, leading to a showdown in Cuba between the United States and the Soviet Union, the good and bad mutants, and Charles and Erik, whose goals have begun to diverge. Throughout, Vaughn crisscrosses the globe, piles on the visual effects, and juices the action with a rousing score, but it's the actors who make the biggest impression as McAvoy and Fassbender prove themselves worthy successors to Patrick Stewart and Ian McKellen. The movie comes alive whenever they take center stage, and dies a little when they don't. For the most part, though, Vaughn does right by playing up the James Bond parallels and acknowledging the debt to producer Bryan Singer through a couple of clever cameos. --\", 'Kathleen C. Fennessy', 'Related Products', 'More X-Men', 'Books', 'Toys', 'More From the Stars of', 'X-Men: First Class', 'James McAvoy', 'Michael Fassbender', 'Matthew Vaughn']\n{'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copyMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'Lucas Till, Rose Byrne, Oliver Platt, Michael Fassbender, January Jones, Kevin Bacon, James McAvoy, Nicholas Hoult, Jennifer Lawrence, Matthew VaughnLucas Till, Rose Byrne, Oliver Platt, Michael Fassbender, January Jones, Kevin Bacon, James McAvoy, Nicholas Hoult, Jennifer Lawrence, Matthew Vaughn  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.4 x 0.4 x 6.7 inches; 3.2 Ounces', 'Item model number': '5049845098', 'Director': 'Matthew Vaughn', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 11 minutes', 'Release date': 'September 9, 2011', 'Actors': 'James McAvoy, Michael Fassbender, Rose Byrne, January Jones, Jennifer Lawrence', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '2'}\nGood movie\nFive Stars",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Resident Evil: Afterlife [Blu-ray]\nReview Date: 2010/12/31\nStore: Milla Jovovich  (Actor),     Wentworth Miller  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'The fourth installment of the hugely successful', 'Resident Evil', 'franchise,', 'Resident Evil: Afterlife', 'is again based on the wildly popular video game series, and will this time be presented in 3-D. In a world ravaged by a virus infection, turning its victims into the Undead, Alice (Milla Jovovich), continues on her journey to find survivors and lead them to safety. Her deadly battle with the Umbrella Corporation reaches new heights, but Alice gets some unexpected help from an old friend. A new lead that promises a safe haven from the Undead takes them to Los Angeles, but when they arrive the city is overrun by thousands of Undead - and Alice and her comrades are about to step into a deadly trap.', 'Amazon.com', \"A barrage of 3-D effects enlivens Paul W.S. Anderson's\", 'Resident Evil: Afterlife', \", the fourth entry in the seemingly endless action-science fiction horror franchise based on the popular Capcom video game series. Plot, dialogue, and character development all remain secondary considerations; what's key here are the set pieces that allow Milla Jovovich to unleash maximum damage to virally infected zombies, villainous henchmen, and just about anyone else who stands in the way of her stopping the shadowy Umbrella Corporation. Jovovich retains the blend of grit and pulchritude that have made her a fanboy favorite (though said viewers may decry the film's bit of shower-scene interruptus), and she's well supported by returning cast members Ali Larter and Boris Kodjoe (\", 'Undercovers', ') and', 'Prison Break', \"'s Wentworth Miller, who, as Claire's brother, is back behind bars in a postapocalyptic jail overrun by plague zombies. And the 3-D effects are impressive and give a shot of adrenaline to the already hyper-driven action and CGI elements. Those looking for more than what the\", 'Resident Evil', \"franchise is designed to provide--souped-up, B-movie thrills--are advised to lower their expectations; franchise devotees should be pleased, especially by the film's final scene, which (naturally) sets up another sequel.\", '--Paul Gaita']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action, Sci-Fi, Horror, Thriller', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Blu-ray', 'Contributor': 'Ali Larter, Wentworth Miller, Milla Jovovich', 'Language': 'English, French', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.43 x 4.98 x 7 inches; 2.56 Ounces', 'Audio Description': 'English', 'Item model number': '15323783', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Blu-ray', 'Run time': '1 hour and 37 minutes', 'Release date': 'December 28, 2010', 'Actors': 'Milla Jovovich, Wentworth Miller, Ali Larter', 'Dubbed': 'French, Spanish, Portuguese', 'Subtitles': 'Spanish, French, English', 'Studio': 'Screen Gems', 'Number of discs': '1'}\nReview Text: i really like afterlife its one of the better ones i did not care for #2 rest i like lot but this is on my top list of the resident evil movies i hope they keep going like this because this just keeps on getting better\nReview Title: resident evil afterlife\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Planes\nReview Date: 2014/12/27\nStore: Dane Cook  (Actor),     Stacy Keach  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nAverage Rating: 4.7\nProduct Details: {}\nReview Text: Grandson loves it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: X2: X-Men United [Blu-ray]\nReview Date: 2015/06/13\nStore: Halle Berry  (Actor),     Alan Cumming  (Actor),     Bryan Singer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Professor Xavier's Mutant Academy faces continued persecution including a military attack. At the same time his troupe of young adults with special powers must stop an evil mutant who attempts to assassinate the U.S. President.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Military & War', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'James N. Kirk, Halle Berry, Bryan Singer, Charles Siegel, Anna Paquin, Kelly Hu, Ian McKellen, Brian Cox, Dylan Kussman, Cotter Smith, Peter Wingfield, James Marsden, Stephen Spender, Patrick Stewart, Michael Reid Mackay, Bruce Davison, Alan Cumming, Famke JanssenJames N. Kirk, Halle Berry, Bryan Singer, Charles Siegel, Anna Paquin, Kelly Hu, Ian McKellen, Brian Cox, Dylan Kussman, Cotter Smith, Peter Wingfield, James Marsden, Stephen Spender, Patrick Stewart, Michael Reid Mackay, Bruce Davison, Alan Cumming, Famke Janssen  See more', 'Language': 'English, Spanish, French, Portuguese', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'FOXS2287901BR', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 13 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Halle Berry, Alan Cumming, Bruce Davison, Kelly Hu, Famke Janssen', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Star Wars Trilogy Episodes I-III (Blu-ray + DVD)\nReview Date: 2015/06/13\nStore: Hayden Christiansen  (Actor),     Ewan McGregor  (Actor),     George Lucas  (Director)    &                   0                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Star Wars: The Prequel Trilogy on Blu-ray+DVD Combo feature Star Wars Episodes I-III. The greatest space saga ever told begins with Star Wars: Episode I - The Phantom Menace, Star Wars: Episode II - Attack of the Clones, and Star Wars: Episode III - Revenge of the Sith and follows young Anakin Skywalker's descent to the dark side as he transforms from child slave to Jedi apprentice to the evil Darth Vader! Star Wars Episode I: The Phantom Menace(32 Years Before Episode IV) Stranded on the desert planet Tatooine after rescuing young Queen Amidala from the impending invasion of Naboo, Jedi apprentice Obi-Wan Kenobi and his Jedi Master discover nine-year-old Anakin Skywalker, a young slave unusually strong in the Force. Anakin wins a thrilling Podrace and with it his freedom as he leaves his home to be trained as a Jedi. The heroes return to Naboo where Anakin and the Queen face massive invasion forces while the two Jedi contend with a deadly foe named Darth Maul. Only then do they realize the invasion is merely the first step in a sinister scheme by the re-emergent forces of darkness known as the Sith. Star Wars Episode II: Attack of the Clones(22 Years Before Episode IV) Ten years after the events of the Battle of Naboo, not only has the galaxy undergone significant change, but so have Obi-Wan Kenobi, Padmé Amidala, and Anakin Skywalker as they are thrown together again for the first time since the Trade Federation invasion of Naboo. Anakin has grown into the accomplished Jedi apprentice of Obi-Wan, who himself has transitioned from student to teacher. The two Jedi are assigned to protect Padmé whose life is threatened by a faction of political separatists. As relationships form and powerful forces collide, these heroes face choices that will impact not only their own fates, but the destiny of the Republic. Star Wars Episode III: Revenge of the Sith(19 Years before Episode IV) Three years after the onset of the Clone Wars, the noble Jedi Knights have been leading a massive clone army into a galaxy-wide battle against the Separatists. When the sinister Sith unveil a thousand-year-old plot to rule the galaxy, the Republic crumbles and from its ashes rises the evil Galactic Empire. Jedi hero Anakin Skywalker is seduced by the dark side of the Force to become the Emperor's new apprentice - Darth Vader. The Jedi are decimated, as Obi-Wan Kenobi and Jedi Master Yoda are forced into hiding. The only hope for the galaxy are Anakin's own offspring - the twin children born in secrecy who will grow up to become Luke Skywalker and Princess Leia Organa.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Hayden Christiansen, Natalie Portman, George Lucas, Ewan McGregor', 'Language': 'English', 'Runtime': '6 hours and 59 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 5.6 Ounces', 'Item model number': '99214', 'Director': 'George Lucas', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '6 hours and 59 minutes', 'Release date': 'October 8, 2013', 'Actors': 'Hayden Christiansen, Ewan McGregor, Natalie Portman', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, Spanish, Portuguese, French', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '6'}\nReview Text: Goo moviw\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: X-Men [Blu-ray]\nReview Date: 2015/06/13\nStore: Halle Berry  (Actor),     Bruce Davison  (Actor),     Bryan Singer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"X-MEN is the live-action, big-screen adaptation of the most popular comic book series of the world. Outcasts since birth, the X-Men are the next step of human evolution, each born with a unique genetic mutation that gives them extraordinary powers that they've learned to harness for the greater good. But mankind fears what it doesn't understand, and the X-Men soon realize that the race they fight to protect against incalculable evil rejects them.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, SubtitledMultiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled  See more', 'Contributor': 'Ray Park, Stan Lee, Tyler Mane, Halle Berry, Bryan Singer, Anna Paquin, Newton Thomas Sigel, Ian McKellen, Brett Morris, Alex Burton, James Marsden, Patrick Stewart, Matthew Sharp, Rebecca Romijn, Bruce Davison, Michael Kamen, Hugh Jackman, Famke JanssenRay Park, Stan Lee, Tyler Mane, Halle Berry, Bryan Singer, Anna Paquin, Newton Thomas Sigel, Ian McKellen, Brett Morris, Alex Burton, James Marsden, Patrick Stewart, Matthew Sharp, Rebecca Romijn, Bruce Davison, Michael Kamen, Hugh Jackman, Famke Janssen  See more', 'Language': 'English, Spanish, French, Portuguese', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '2287899', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 44 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Halle Berry, Bruce Davison, Famke Janssen, Ian McKellen, Patrick Stewart', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: X-Men: First Class (+ Digital Copy) [Blu-ray]\nReview Date: 2015/06/13\nStore: James McAvoy  (Actor),     Michael Fassbender  (Actor),     Matthew Vaughn  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'X-Men: First Class is the thrilling, eye-opening chapter you’ve been waiting for...Witness the beginning of the X-Men Universe. Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their superhuman powers for the first time, working together in a desperate attempt to stop the Hellfire Club and a global nuclear war.', 'Amazon.com', \"When Bryan Singer brought Marvel's X-Men to the big screen, Magneto and Professor X were elder statesmen, but Matthew Vaughn (Kick-Ass) travels back in time to present an origin story--and an alternate version of history. While Charles Xavier (Laurence Belcher) grows up privileged in New York, Erik Lehnsherr (Bill Milner) grows up underprivileged in Poland. As children, the mind-reading Charles finds a friend in the shape-shifting Raven (Jennifer Lawrence) and Erik finds an enemy in Sebastian Shaw (Kevin Bacon), an energy-absorbing Nazi scientist who treats the metal-bending lad like a lab rat. By 1962, Charles (James McAvoy) has become a swaggering genetics professor and Erik (Michael Fassbender, McAvoy's Band of Brothers costar) has become a brooding agent of revenge. CIA agent Moira (Rose Byrne) brings the two together to work for Division X. With the help of MIB (Oliver Platt) and Hank (A Single Man's Nicholas Hoult), they seek out other mutants, while fending off Shaw and Emma Frost (Mad Men's January Jones), who try to recruit them for more nefarious ends, leading to a showdown in Cuba between the United States and the Soviet Union, the good and bad mutants, and Charles and Erik, whose goals have begun to diverge. Throughout, Vaughn crisscrosses the globe, piles on the visual effects, and juices the action with a rousing score, but it's the actors who make the biggest impression as McAvoy and Fassbender prove themselves worthy successors to Patrick Stewart and Ian McKellen. The movie comes alive whenever they take center stage, and dies a little when they don't. For the most part, though, Vaughn does right by playing up the James Bond parallels and acknowledging the debt to producer Bryan Singer through a couple of clever cameos. --\", 'Kathleen C. Fennessy', 'Related Products', 'More X-Men', 'Books', 'Toys', 'More From the Stars of', 'X-Men: First Class', 'James McAvoy', 'Michael Fassbender', 'Matthew Vaughn']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copyMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'Lucas Till, Rose Byrne, Oliver Platt, Michael Fassbender, January Jones, Kevin Bacon, James McAvoy, Nicholas Hoult, Jennifer Lawrence, Matthew VaughnLucas Till, Rose Byrne, Oliver Platt, Michael Fassbender, January Jones, Kevin Bacon, James McAvoy, Nicholas Hoult, Jennifer Lawrence, Matthew Vaughn  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.4 x 0.4 x 6.7 inches; 3.2 Ounces', 'Item model number': '5049845098', 'Director': 'Matthew Vaughn', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 11 minutes', 'Release date': 'September 9, 2011', 'Actors': 'James McAvoy, Michael Fassbender, Rose Byrne, January Jones, Jennifer Lawrence', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe individual demonstrates a strong affinity for action-packed, science fiction, and horror-themed films, consistently favoring franchises that include well-known elements like superhuman powers and apocalyptic scenarios. They exhibit a marked preference for Blu-ray over DVD format, suggesting a valuation of higher quality media. The rating patterns indicate a high level of satisfaction, with recurrent five-star ratings across multiple purchases, portraying them as a dedicated fan of these genres.  \n\nCommon themes across their purchases include a focus on movie experiences that combine thrilling narratives with visual effects, as evidenced by titles featuring strong female leads and ensemble casts. This person also appreciates films suitable for family viewing, as shown by their purchase of a children’s movie, indicating versatility in their preferences.  \n\nQuality is of considerable importance, as reflected in their consistent selection of highly rated titles, but there’s no clear evidence of price sensitivity; the purchasing of high-quality formats suggests a willingness to invest in premium entertainment options. Overall, this individual's core preferences align with a desire for immersive cinematic experiences, emphasizing genre excitement, engaging plots, and high production values.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Five Stars",
    "text": "Good movie",
    "images": [],
    "asin": "B0090SI582",
    "parent_asin": "B0090SI582",
    "user_id": "AFWWM7643WN2D7JVSZ6XRMLL5VJA",
    "timestamp": "2015-06-13 16:47:00",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The Wolverine (Blu-ray + DVD + Digital HD with UltraViolet)",
    "average_rating": 4.6,
    "rating_number": 13422,
    "features": [],
    "description": [
      "Product Description",
      "Based on the celebrated comic book arc, this epic action-adventure takes Wolverine (Hugh Jackman), the most iconic character of the X-Men universe, to modern day Japan. Out of his depth in an unknown world he faces his ultimate nemesis in a life-or-death battle that will leave him forever changed. Vulnerable for the first time and pushed to his physical and emotional limits, he confronts not only lethal samurai steel but also his inner struggle against his own immortality, emerging more powerful than we have ever seen him before.",
      "Amazon.com",
      "In 2013's summer of superheroes, The Wolverine breaks a lot of rules of the genre and comes out a winner for the most unexpected of reasons. Both the movie and the man (make that super-man) are driven by vengeance, anger, and the existential angst of the whole \"with great power comes great blah, blah, blah\" thing. But The Wolverine has a sense of higher responsibility and a quietude that distinguishes it from the likes of Iron Man 3, Man of Steel, and even the numerous X-Men movies that forged its legacy. With Hugh Jackman reprising the role (for the sixth time) that made him a movie star, The Wolverine is the least like any of its predecessors for the way it prefers subdued tension and real dramatic buildup of character rather than all-out frenzied action. There are plenty of elegantly realized set pieces that make visual sense and have direct bearing on the story (not necessarily things that are a priority in other mega-budget actioners), but the moments of talk and gentler sense of introspection that director James Mangold carefully oversees are more important and equally as satisfying. The events of The Wolverine take place in the aftermath of 2006's X-Men: The Last Stand, with Wolverine/Logan's grief over the death of Jean Grey (Famke Janssen) still raw. He's become a hermit somewhere in the frozen north, still seething with inward rage. The appearance of a lethal Japanese pixie named Yukio (Rila Fukushima) distracts him with a message from an old friend who wants to say goodbye. He's whisked to an idealized, manga-inspired Japan where billionaire industrialist Yashida (Hal Yamanouchi) is about to pass on. Logan saved him near the end of World War II (a truly haunting sequence), a debt Yashida wishes to repay by relieving Logan of the curse of his immortality and the healing power of his adamantine bones (and claws). Mangold has cited numerous samurai films as inspiration, and The Wolverine stands out as a classic eastern western for the thematic elements it incorporates from Japanese cinema and the iconic American genre. The other important characters in this cunningly entertaining morality play are Yashida's beloved daughter Mariko (Tao Okamoto), who battles ethereal dream encounters with Jean Grey for Logan's heart, and his evil son Shingen (Hiroyuki Sanada). There's also Yashida's creepy, statuesque doctor, who we later get to know as Viper (Svetlana Khodchenkova), another mutant who may actually have the power to kill Wolverine. The story is loosely based on a popular Wolverine comic series from 1982 that sets the stage for all the mythical Japanese elements, including a final battle with a scary adamantine samurai warrior-bot. Another super-cool CGI action scene is set on top of a bullet train going top speed (believe it or not, Jackman's enormous, ripped, straining, hyper-vascularized pecs and neck were not computer-enhanced). The Wolverine is an unexpected success in the year's blockbuster field for action that is in service of the story and for a temperament that pays homage to samurai ronin legends as well as James Bond-style summer-movie joyousness. That it is 2013's least superhero-clichéd comic book fantasy is also high praise. And with The Wolverine still cursed with immortality, there will no doubt be more praises as the X-Men universe continues to expand (be sure not to look away before the credits are through). --",
      "Ted Fry"
    ],
    "price": 18.49,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51ZYX5XNxsL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ZYX5XNxsL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "The Wolverine (Blu-ray + DVD + Digital HD with UltraViolet)",
        "url": "https://www.amazon.com/vdp/ccaf8743f9b6445482915529b0f45e4e?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Hugh Jackman  (Actor),     Will Yun Lee  (Actor),     James Mangold  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Genre": "Action & Adventure",
      "Format": "Blu-ray, Digital_copy, Dolby, Color, Ultraviolet",
      "Contributor": "Will Yun Lee, Hugh Jackman, James Mangold",
      "Language": "Spanish, French, English",
      "Runtime": "2 hours and 7 minutes",
      "Aspect Ratio": "2.40:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 3.2 Ounces",
      "Item model number": "FOXS2295743BR",
      "Director": "James Mangold",
      "Media Format": "Blu-ray, Digital_copy, Dolby, Color, Ultraviolet",
      "Run time": "2 hours and 7 minutes",
      "Release date": "December 3, 2013",
      "Actors": "Hugh Jackman, Will Yun Lee",
      "Dubbed": "French, Spanish",
      "Subtitles": "Spanish",
      "Studio": "20th Century Fox",
      "Number of discs": "2"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}