{
  "user_id": "AGSV4K43Q6TIIHGN6BB2Q5A2I5PA",
  "summary": "=== Purchase Information ===\nProduct Title: Frankenweenie\nReview Date: 2013/03/01\nStore: Martin Short  (Actor),     Catherine O'Hara  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From Disney and creative genius Tim Burton (ALICE IN WONDERLAND; THE NIGHTMARE BEFORE CHRISTMAS) comes the hilarious and offbeat FRANKENWEENIE, a heartwarming tale about a boy and his dog. After unexpectedly losing his beloved dog Sparky, young Victor harnesses the power of science to bring his best friend back to life -- with just a few minor adjustments. He tries to hide his home-sewn creation, but when Sparky gets out, Victor\\'s fellow students, teachers and the entire town learn that getting a new \"leash on life\" can be monstrous. Complete with electrifying bonus features, FRANKENWEENIE is alive with enchanting fun for the whole family.', 'Brand Story', 'By']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation', 'Format': 'AC-3, Animated, Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed, Enhanced', 'Contributor': \"Charlie Tahan, Robert Capron, Martin Short, Tim Burton, Martin Landau, Atticus Shaffer, Catherine O'Hara, Winona RyderCharlie Tahan, Robert Capron, Martin Short, Tim Burton, Martin Landau, Atticus Shaffer, Catherine O'Hara, Winona Ryder  See more\", 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR786936814149#VG', 'Director': 'Tim Burton', 'Media Format': 'AC-3, Animated, Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed, Enhanced', 'Run time': '1 hour and 27 minutes', 'Release date': 'January 8, 2013', 'Actors': \"Martin Short, Catherine O'Hara, Martin Landau, Winona Ryder, Robert Capron\", 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'WALT DISNEY PICTURES', 'Number of discs': '1'}\nReview Text: If you do not &#34;get&#34; Tim Burton, this movie may not thrill you, but the art is incredible. You have to consider the pain-stacking stop-motion work despite the odd story-line. This is art at its best. I was only sad that he didn't work with Johny Depp on this one.\nReview Title: You have to love Tim Burton!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Arthur Christmas\nReview Date: 2013/03/01\nStore: Sarah Smith  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'How CAN Santa deliver billions of presents to the whole world in just one night? With an army of one million combat-style Field Elves and a vast, state-of-the-art control center under the ice of the North Pole! So how could this incredible operation have MISSED one child?! To Santa’s young son, Arthur, it threatens to end the magic of Christmas. With retired Grandsanta, a rebellious young elf, an old sleigh and some untrained reindeer, Arthur sets out in a crazy mission to deliver the last present! Deck the halls with excitement, fun and wonder in this new Christmas classic!', 'Amazon.com']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Family, Animation, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Sarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla ShelleySarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla Shelley   See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 37 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '40952', 'Director': 'Sarah Smith', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 6, 2012', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Producers': 'Peter Lord, David Sproxton, Carla Shelley, Steve Pegram', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Seller was great, but this tale of Christmas was awful in many ways. If you don't want a spoiler, don't read, but Christmas now comes from an &#34;alien&#34; sort of ship delivered by thousands of odd looking elves and Santa is just &#34;in charge&#34; - an old sort of &#34;out of it&#34; guy. It is not a classic I will want to watch again. There were terrible moments that made me want to cry. How is that a happy Christmas?\nReview Title: A really bizarre way to represent Christmas\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Age: Continental Drift\nReview Date: 2013/03/01\nStore: Ray Romano  (Actor),     Denis Leary  (Actor),     Steve Martino  (Director),     Mike Thurmeier  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'Historys greatest heroes return for the most outrageously funny and entertaining Ice Age adventure in two million years. When Scrats acorn antics cause a cataclysmic crack-up, Manny (Ray Romano), Sid (John Leguizamo) and Diego (Denis Leary) go where no herd has gone before on a high-seas quest aboard a floating iceberg. But a menagerie of misfit pirates are determined to shiver their timbers and capsize their journey home. Join a boat-load of lovable new characters (voiced by Jennifer Lopez, Aziz Ansari and Peter Dinklage) for original songs, spectacular animation and heartwarming family fun.', 'Amazon.com', 'The revisionist version of natural history offered up in the', 'Ice Age', 'movies gets yet another twist in the fourth installment, 10 years after Manny the woolly mammoth, Diego the saber-toothed tiger, Sid the sloth, and Scrat the squirrel made their chilly debut to hot box-office receipts. The lessons of family and loyalty in', 'Continental Drift', \"may seem a little warmed over, but the creatively constructed laughs, amusing voice characterizations, and inventive CGI animation are reason enough to keep the series viable for kids to giggle about and grownups to belly laugh over--sometimes for exactly the same reasons. Once again, acorn-addicted Scrat is the cause of some pretty important behind-the-scenes machinations. His dialogue-free antics also serve as a stand-alone subplot that could easily be a very clever short film of its own. This time the weasely rodent's addled obsession with the fruit of the oak is revealed as the cause of the formation of the world's continents as we now know them. He sets the story--and planet Earth--in motion while pursuing a little nut in a hyperactive prologue that causes underground rifts that in turn form the famous shapes of Australia, Africa, North America, and the outline of Italy (which it turns out is shaped like a boot for a very good reason). Above ground this means more global chaos for the herd of animals we've come to know so well. All the familiar voices reprise their wonderful roles as fissures in earth and ice separate Manny (Ray Romano) from his woolly wife Ellie (Queen Latifah) and boy-crazy teenager Peaches (Keke Palmer). With a killer continental shelf bearing down on them, mother and daughter lead the madcap pack of animal characters toward a safe meeting place while Manny, Diego (Denis Leary), Sid (John Leguizamo), and Sid's crazy granny (Wanda Sykes) drift away on an iceberg schooner into a newly vast open ocean. While floating into oblivion, the mismatched pack encounters a band of animal pirates piloting another slab of ship-shaped ice, captained by a crazed baboon named Gutt (Peter Dinklage), who's bent on resentment-based revenge. The motley crew provides a plethora of comic encounters and a new raft of excellent voice actors. Running a close second to Dinklage in ingenious casting is Jennifer Lopez as Shira, a sultry tiger who, don't cha know, ends up on the good ship and falling for Diego in the end. The adventures of both the land- and sea-based creatures are full of clever gags and densely constructed set pieces that may not be quite up to Pixar story standards, but are certainly always on the ball and executed with computer-animation acumen that is astonishingly lifelike for such an unreal-looking world. Scrat's misadventures act as interstitial connectors to the parallel heroes' journey stories until they ultimately intersect in a massively scaled finale. Even after all the melting and refreezing, the\", 'Ice Age', 'world is still a hot commodity in the animated-franchise business and remains a good investment despite the constancy of global rifts in entertaining family fare.', '--Ted Fry']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2280028DVD', 'Director': 'Steve Martino, Mike Thurmeier', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'December 11, 2012', 'Actors': 'Ray Romano, Denis Leary', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: Why did this do another version of this movie? It's all the same. This version was just more violent and when you thought it could have a really nice ending, they robbed us of that too. Hint, tiger have a mate. Ug.\nReview Title: Same movie, again\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jingle All the Way (Family Fun Edition)\nReview Date: 2014/12/31\nStore: Arnold Schwarzenegger  (Actor),     Sinbad  (Actor),     Brian Levant  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Arnold Schwartzenegger stars as Howard Langston, an overworked mattress salesman who has been neglecting his family of late; in an attempt to redeem himself, he promises his son whatever he wants for Christmas. Turns out that his heart\\'s desire is a TurboMan doll, coveted by every other kid this year as well, and Howard quickly forgets about his promise until Christmas Eve. Director Brian Levant Star Arnold Schwarzenegger, Sinbad, Phil Hartman, Rita Wilson, Robert Conrad, James Belushi, Jake Lloyd, Special Features: Widescreen - 1.85 Audio: Dolby Digital Surround - English, French, Spanish Subtitles - English, Spanish - Optional Additional Release Material: Audio Commentaries - Extended, Director\\'s Cut Behind the Scenes - 1. \"The Making of a Hero\" 2. \"Turbo Man: Behind the Mask\" Featurettes - \"Super Kids\" Interactive Features: Games (4) Runtime: 109 minutes Year of Release: 1996.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, AC-3, Color, Special Edition, Subtitled, Widescreen', 'Contributor': 'Robert Conrad, Caroline Kaiser, James Belushi, Harvey Korman, Martin Mull, Richard Moll, E.J. De La Pena, Phil Hartman, Justin Chapman, Randy Kornfield, Arnold Schwarzenegger, Sinbad, Nada Despotovich, Jeff Deist, Jake Lloyd, Brian Levant, Rita Wilson, Laraine Newman, Daniel Riordan, Ruth Afton HjelmgrenRobert Conrad, Caroline Kaiser, James Belushi, Harvey Korman, Martin Mull, Richard Moll, E.J. De La Pena, Phil Hartman, Justin Chapman, Randy Kornfield, Arnold Schwarzenegger, Sinbad, Nada Despotovich, Jeff Deist, Jake Lloyd, Brian Levant, Rita Wilson, Laraine Newman, Danie…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': 'Relay Time: 109 min', 'Director': 'Brian Levant', 'Media Format': 'Multiple Formats, Dolby, Dubbed, NTSC, AC-3, Color, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'October 16, 2007', 'Actors': 'Arnold Schwarzenegger, Sinbad, Phil Hartman, Rita Wilson, Robert Conrad', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20TH CENTURY STUDIOS', 'Writers': 'Randy Kornfield', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Is stupid enough to say? And the CD was defective so I missed part of the movie. Don't really care at this point.\nReview Title: DUH!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo! Moon Monster Madness MFV (DVD)\nReview Date: 2018/01/07\nStore: Frank Welker  (Actor),     Mindy Cohn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Characters & Series, Scooby Doo\nProduct Description: ['Scooby-Doo! Moon Monster Madness MFV (DVD)', \"It's a giant leap for dog-kind as Scooby-Doo and the gang blast off for an epic, otherworldly adventure in this all-new original movie! After winning the last five seats in a lottery, Scooby-Doo, Shaggy, Fred, Daphne and Velma are off to space in billionaire Sly Baron's brand-new ship, the Sly Star One. It's all gravity-free fun until a mysterious alien begins destroying the ship! The crew is forced to land on Sly Baron's base ... on the dark side of the moon! Will the gang unravel this alien mystery? Will Scooby-Doo and Shaggy find snacks on the moon? Will Fred ever take his space helmet off?! Journey to the outer limits with Scooby-Doo to find out!\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Contributor': 'Matthew Lillard, Grey DeLisle Griffin, Mark Banker, Paul McEvoy, Frank Welker, Sam Register, Alan Burnett, Mindy Cohn, Malcolm McDowellMatthew Lillard, Grey DeLisle Griffin, Mark Banker, Paul McEvoy, Frank Welker, Sam Register, Alan Burnett, Mindy Cohn, Malcolm McDowell  See more', 'Initial release date': '2015-02-17', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': 'WHV1000510189DVD', 'Director': 'Paul McEvoy', 'Media Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Run time': '1 hour and 12 minutes', 'Release date': 'February 17, 2015', 'Actors': 'Frank Welker, Mindy Cohn, Grey DeLisle Griffin, Matthew Lillard, Malcolm McDowell', 'Producers': 'Sam Register, Alan Burnett, Paul McEvoy', 'Studio': 'Studio Distribution Services', 'Writers': 'Mark Banker', 'Number of discs': '1'}\nReview Text: Great movie! I love that the voice stars are the same Frank Welker, Grey DeLisle-Griffin, Mindy Cohn, Mathew Lillard. Fun story, always feel like a kid watching! Really fun story.\nReview Title: Scooby Classic!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo Shaggy’s Showdown (DVD)\nReview Date: 2018/01/07\nStore: Frank Welker  (Actor),     Matthew Lillard  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Characters & Series, Scooby Doo\nProduct Description: ['Scooby-Doo Shaggy’s Showdown (DVD)', 'When the Scooby gang visits a dude ranch, they discover that it and the nearby town have been haunted by a ghostly cowboy, Dapper Dan, who fires real fire from his fire irons. The mystery only deepens when it’s discovered that the ghost is also the long lost relative of Shaggy Rogers!', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation', 'Format': 'DVD, NTSC', 'Contributor': 'Matthew Lillard, Frank Welker', 'Initial release date': '2017-02-14', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '43461944', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 12 minutes', 'Release date': 'February 14, 2017', 'Actors': 'Frank Welker, Matthew Lillard', 'Dubbed': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I bought a few Scooby movies for the holiday. I'm sad to say this is not the original cast. this has someone else as Thelma. Sorry, nothing personal, but she is awful. They try to make up for her voice by having Thelma be a bit stupid in this movie....and allergic to everything in the movie so she is constantly sneezing. It is awful. I'm sorry I wasn't aware of the casting. Not a classic Scooby movie.\nReview Title: This is not a classic Scooby movie.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Neverending Story (30th Anniversary Edition) [Blu-ray]\nReview Date: 2018/03/06\nStore: Alan Oppenheimer  (Actor),     Jeff Burr  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['The Neverending Story 30th Anniversary (BD)', \"When young Bastian borrows a mysterious, ornately-bound book, he never dreamed turning a page would draw him into a shimmering fantasy world of racing snails, hang-glider bats, soaring luckdragons, puckish elves, a Childlike Empress, the brave warrior Atreyu and a slab-faced walking quarry called a Rock Biter. Follow The NeverEnding Story to the limits of the imagination, thanks to director/co-writer Wolfgang Petersen (The Perfect Storm) and a superstar team of technical tinkerers and magicians (with credits including 2001: A Space Odyssey, Alien and The Empire Strikes Back) who bring to life the most delightful characters ever. You'll cherish this wide-eyed adventure and discover The NeverEnding Story is your story.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Fantasy, Science Fiction', 'Format': 'Blu-ray, Widescreen, NTSC', 'Contributor': 'Dieter Geissler, Bernd Eichinger, Howard Albrecht, John Hyde, Tami Stronach, Moses Gunn, Mark Damon, Wolfgang Petersen, Jeff Burr, Patricia Hayes, Gerald McRaney, Herman Weigel, Alan Oppenheimer, Sydney BromleyDieter Geissler, Bernd Eichinger, Howard Albrecht, John Hyde, Tami Stronach, Moses Gunn, Mark Damon, Wolfgang Petersen, Jeff Burr, Patricia Hayes, Gerald McRaney, Herman Weigel, Alan Oppenheimer, Sydney Bromley  See more', 'Initial release date': '2014-10-07', 'Language': 'English', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000489470BR', 'Director': 'Wolfgang Petersen', 'Media Format': 'Blu-ray, Widescreen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 7, 2014', 'Actors': 'Alan Oppenheimer, Jeff Burr, Howard Albrecht, Tami Stronach, Moses Gunn', 'Producers': 'Bernd Eichinger, Mark Damon, Dieter Geissler, John Hyde', 'Studio': 'Studio Distribution Services', 'Writers': 'Wolfgang Petersen, Herman Weigel', 'Number of discs': '1'}\nReview Text: Only buy this movie if you REALLY loved it in 1984. A friend told me it was a great story. I barely managed to watch the horrible, fake, scenes and special affects of the 1980s. The kid screaming like a quacker, he needs some therapy. Both kids do. I am not sure the point of the story made any sense. Good grief, there's 2 hours of my life I can't get back!\nReview Title: YUCK!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo! and KISS Rock and Roll Mystery (DVD)\nReview Date: 2018/04/28\nStore: Spike Brandt  (Director),     Frank Welker  (Actor),     Mindy Cohn  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Characters & Series, Scooby Doo\nProduct Description: ['Scooby-Doo! and KISS Rock and Roll Mystery (DVD)', 'Get ready to Rock! Scooby-Doo and the Mystery Inc. Gang team up with the one and only KISS in this all-new, out-of-this-world adventure! We join the Gang at Kiss World – the all-things-Kiss theme park, as they investigate a series of strange hauntings. With help from Kiss, they discover that the Crimson Witch has returned to summon The Destroyer from the alternate dimension of Kissteria! The evil duos ghastly plan, to destroy the earth! Can the Gang’s cunning and Kiss’s power of rock save the day?! Tune in to this Rock and Roll Mystery for some thunderous, heavy FUN!', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '1000511015', 'Director': 'Spike Brandt, Tony Cervone', 'Media Format': 'Multiple Formats, Color, Full Screen, Animated, NTSC', 'Run time': '1 hour and 18 minutes', 'Release date': 'July 21, 2015', 'Actors': 'Frank Welker, Mindy Cohn, Grey DeLisle Griffin, Matthew Lillard, Gene Simmons', 'Producers': 'Tony Cervone', 'Studio': 'Studio Distribution Services', 'Writers': 'Jim Krieg, Kevin Shinick', 'Number of discs': '1'}\nReview Text: I should have realized that not being a fan of Kiss would mean this wasn't likely going to be a good Scooby adventure. I was right. Yuck. It is the original gang, but couldn't deal with the Kiss group. Will give it to Goodwill.\nReview Title: Only buy this if you LOVE Kiss\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Victor Frankenstein\nReview Date: 2018/06/08\nStore: James McAvoy  (Actor),     Daniel Radcliffe  (Actor),     Paul McGuigan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Superstars James McAvoy and Daniel Radcliffe are electrifying in this action-packed thriller that breathes new life into the most famous horror tale of all time. Radical scientist Victor Frankenstein (McAvoy) and his trusted assistant Igor (Radcliffe) share a noble vision of aiding humanity through their groundbreaking research into immortality. But when Victor s experiments go too far, his obsession has terrifying consequences, and now only Igor can bring his friend back from the brink of madness... and save him from his monstrous creation!']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Horror', 'Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Daniel Radcliffe, Paul McGuigan, James McAvoy', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35234891', 'Director': 'Paul McGuigan', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'March 8, 2016', 'Actors': 'James McAvoy, Daniel Radcliffe', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '1'}\nReview Text: I know this is an &#34;old&#34; movie, but I wondered about Daniel Radcliffe's delivery. James McAvoy was brilliant! Danielle was fine, he will mature. The movie I loved. While I am squeamish and generally do not watch horror or scare, this was just tolerable enough to not be too much for me. I generally stick with Disney or rated G. One can only take so much emotional manipulation by others, right! I am very happy I watched. If you are not good with gore, watch during the day. It is worth the bit of gross you see now and again.\nReview Title: Great film! Oh and great deal from Amazon!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo! Mystery Incorporated: Season 2\nReview Date: 2018/11/11\nStore: Frank Welker  (Actor),     Matthew Lillard  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Scooby-Doo! Mystery Incorporated The Complete Season Two (DVD)', 'Fred, Daphne, Velma, Shaggy and Scooby-Doo continue to solve mysteries in the spooky town of Crystal Cove, a tourist hotspot that boasts a long history of ghostly sightings, werewolves and glowing deep sea divers. While Crystal Cove tries to capitalize on its haunted reputation, the gang will stop at nothing to unveil the truth behind the paranormal activity. In addition to episodic mysteries, SCOOBY-DOO! MYSTERY INCORPORATED keeps viewers enthralled from episode to episode as the teenagers unravel the overarching mystery of Mister E. and their Mystery Incorporated predecessors. This group of friends gets into their share of disagreements, scary situations, silly antics and even have time for a little romance. In its first season in the U.S., the series averaged nearly two million viewers.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Animation, Comedy, Mystery & Suspense/Crime/Cops, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': 'Matthew Lillard, Spike Brandt, Grey DeLisle, Frank Welker, Mindy Cohn, Sam Register, Tony Cervone', 'Language': 'English', 'Number Of Discs': '4', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'THT1000501007DVD', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '9 hours and 32 minutes', 'Release date': 'October 7, 2014', 'Actors': 'Frank Welker, Matthew Lillard, Grey DeLisle, Mindy Cohn', 'Producers': 'Spike Brandt, Sam Register, Tony Cervone', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: This is an odd take on Scooby and has a weird ending, but as a long time Scooby fan, this is one I enjoyed watching over.\nReview Title: Weird, but if you are a Scooby fan, have to have\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Murdoch Mysteries: Christmas Cases Collection\nReview Date: 2019/03/11\nStore: Yannick Bisson  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: [\"Detective William Murdoch (Yannick Bisson, Sue Thomas: F.B.Eye) and his team solve yuletide crimes in these three feature-length mysteries set in Edwardian Toronto.A Merry Murdoch Christmas—At a charity gala, Murdoch and his wife, Dr. Julia Ogden (Hélène Joy, Durham County), find the host dead from a broken neck; Inspector Brackenreid (Thomas Craig, Coronation Street) suspects the culprit is the legendary Christmas creature Krampus.Once Upon a Murdoch Christmas—When Murdoch investigates a daring robbery where the culprit seemed to possess superhuman abilities, Constable Crabtree (Jonny Harris, Still Standing) realizes the robber resembles a character from his novel.Home for the Holidays—Murdoch and Julia travel to British Columbia to visit Murdoch's brother (Dylan Neal, Dawson’s Creek), but instead of a family holiday, they end up investigating a murder at an archaeological site.Guest stars include Brendan Coyle (Downton Abbey), Kelly Rowan (The O.C.), Megan Follows (Reign, Anne of Green Gables), Kate Hewlett (The Girlfriend Experience), Jake Epstein (Degrassi: The Next Generation), and Ed Asner (The Mary Tyler Moore Show, Up).\"]\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Yannick Bisson', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.52 Ounces', 'Item model number': 'AMP2684', 'Media Format': 'NTSC', 'Release date': 'October 30, 2018', 'Actors': 'Yannick Bisson', 'Subtitles': 'English', 'Studio': 'Acorn', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Murdoch was my favorite series of late until this Season 11. They finally pushed it too far for me with violence. Sadly, I don't care to watch it anymore. It had been a series of romance and mystery that until now I enjoyed. Everyone has different limits.\nReview Title: Was my favorite\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Addams Family 2019\nReview Date: 2020/03/25\nStore: Oscar Isaac  (Actor),     Charlize Theron  (Actor),     Conrad Vernon  (Director, Producer),     Greg Tiernan  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Get ready to snap your fingers! The Addams Family is back in their first animated comedy about the kookiest family on the block. Funny, outlandish, and completely iconic, The Addams Family redefines what it means to be a good neighbor.', 'Bonus Content:', 'Deleted and Extended Scenes', 'Deleted and Extended Scenes', 'Charades with Thing', 'Charades with Thing', 'Life of a Scene', 'Life of a Scene', 'Welcome to the Family', 'Welcome to the Family', 'Addams Family Throwback', 'Addams Family Throwback', '\"\"Haunted Heart\"\" Lyric Video', '\"\"Haunted Heart\"\" Lyric Video', '\"\"My Family\"\" Lyric Video', '\"\"My Family\"\" Lyric Video', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'B07YMLDKJ3', 'Director': 'Conrad Vernon, Greg Tiernan', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 27 minutes', 'Release date': 'January 21, 2020', 'Actors': 'Oscar Isaac, Charlize Theron, Chloe Grace Moretz, Finn Wolfhard, Nick Kroll', 'Subtitles': 'Spanish, French', 'Producers': \"Gail Berman, Conrad Vernon, Alex Schwartz, Alison O'Brien\", 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This arrived as described in new condition, sealed. Super price, fun watch. Great!\nReview Title: Great movie!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Santa's Apprentice/Magic Snowflake Double Feature\nReview Date: 2020/12/21\nStore: Gabe Eggerling  (Actor),     Jean-Pierre Marielle  (Actor),     Luc Vinciguerra  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['SANTA\\'S APPRENTICE / MAGIC SNOWFLAKE - DVD - \"Santa\\'s Apprentice: Santa doesn\\'t want to retire, but rules are rules and he must train someone to replace him. The lucky winner, to be chosen from among millions of children, must be named Nicholas, be an orphan and have a pure heart. On the other side of the planet, there is a little boy who is a perfect match, but his lack of self-confidence and fear of heights make him a poor contestant. Will Santa agree to step down, and help his apprentice take his place? - \"The Magic Snowflake\": A young boy named Nicholas is about to become the next Santa Claus, but must first avoid a crisis that\\'s threatening the magic of Christmas before he can succeed in his new role.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family', 'Format': 'NTSC, Widescreen', 'Contributor': 'Vincent Grass, Gabe Eggerling, Julie Gayet, Max Cullen, Luc Vinciguerra, Jean-Pierre Marielle, Nathan SimonyVincent Grass, Gabe Eggerling, Julie Gayet, Max Cullen, Luc Vinciguerra, Jean-Pierre Marielle, Nathan Simony  See more', 'Language': 'English', 'Runtime': '2 hours and 24 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Audio Description': 'English', 'Director': 'Luc Vinciguerra', 'Media Format': 'NTSC, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Gabe Eggerling, Jean-Pierre Marielle, Julie Gayet, Max Cullen, Nathan Simony', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: These movies were on Netflix last year and we loved them. I'm so happy to see them for sale here. It looked like they wouldn't be in stock until January but we put in our order anyway, and yippie! this arrived already. This is such a fun story about Santa Clause and an orphan boy. It's very worth owning.\nReview Title: Wonderful Christmas stories\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/03/02\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'smoking'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Maxwell Atoms'], 'Producers': ['Maxwell Atoms'], 'Starring': ['Frank Welker', 'Grey DeLisle Griffin', 'Matthew Lillard'], 'Studio': ['WARNER BROS.']}\nReview Text: How can I say really bad in many ways? Don't bother. I am an old Scooby fan, own many movies plus the original series. This one takes a new direction with Daphne as \"hip\" that's bad and the voice of Velma is just annoying. The storyline is bad. How can you mess up Scooby? Well, they did.\nReview Title: TERRIBLE\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yogi's First Christmas (1980 TV Special)\nReview Date: 2021/12/13\nStore: Ray Patterson  (Director),     Daws Butler  (Actor),     Don Messick  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: [\"Yogi and Boo Boo usually snooze right through Christmas. (Hibernation, you know.) But this year, happy holiday music rouses them from their sleep and right into the fun: skating, skiing, singing and trimming the tree. But life isn't all mistletoe and eggnog. Two holiday grouches -- a mysterious hermit and the obnoxious nephew of Jellystone Lodge's owner -- are determined to ruin Christmas. And our two heroes, joined by Snagglepuss, Augie Doggie, Doggie Daddy, Huckleberry Hound and more Hanna-Barbera favorites, are just as determined to make December 25 the jolliest day of the year!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation/Holidays', 'Format': 'Full Screen, NTSC', 'Contributor': 'Janet Waldo, Ray Patterson, Marilyn Schreffler, Don Messick, Hal Smith, Daws Butler, John Stephenson', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'WARA22252DVD', 'Director': 'Ray Patterson', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'December 2, 2009', 'Actors': 'Daws Butler, Don Messick, Janet Waldo, John Stephenson, Marilyn Schreffler', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a very fun old Christmas Yogi movie, longer than I remembered. It's great fun for any age kids!\nReview Title: Great childhood memory\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Life And Adventures Of Santa Claus/Nestor The Christmas Donkey (Double Feature)\nReview Date: 2021/12/13\nStore: Earl Hammond  (Actor),     Earle Hyman  (Actor),     Jules Bass  (Director),     Arthur Rankin Jr.  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Timeless Holiday Favorites\nProduct Description: ['Product Description', \"The Wizard of Oz creator L. Frank Baum penned the story that inspired The Life and Adventures of Santa Claus. A babe born in the woods near the forest of Burzee is named Claus. As Claus grows up, the gods send him to the land of mortals to spread joy and happiness where there is none. Claus carves a small wooden cat for an orphan and decides that all children rich or poor should receive toys for Christmas. A long time ago the little donkey Nestor lives in a country stable. Mocked for his ears, Nestor and his mother are cast out of the stable. In the snowy cold, Nestor's mother sacrifices herself to protect her child. In the spring a cherub arrives to guide Nestor so he may save another as his mother saved him. Two travelers choose him for a trip to Bethlehem and Nestor the Long-Eared Christmas Donkey fulfills his destiny.\", 'Amazon.com', 'A bizarre, pagan take on the Santa Claus legend,', 'The Life and Adventures of Santa Claus', ', which is based on a story by L. Frank Baum (', 'The Wizard of Oz', '), was produced and directed by Rankin and Bass, the reigning kings of the Christmas special (', 'Rudolph the Red-Nosed Reindeer', '), using their brand of puppet animation. In the forest of Burzee, the immortals gather to discuss the fate of Santa Claus. Found when he was an abandoned baby by the Great Ak (a wizard with big wooden horns on his head), the boy was named Claus because that means \"little one\" in the language of the forest. Raised by immortals and knowing nothing but peace and harmony, the adolescent Claus is taken on a tour of the mortal world by the Great Ak, and he discovers the world is rife with misery and injustice. This is when he decides he will dedicate his life to making kids happy, and he learns the best way to do this is to give them toys. After years of service, the immortals must decide whether or not to give him eternal life. Indeed, this is a very strange Christmas tale.', '--Andy Spletzer', 'Nestor, The Long-Eared Christmas Donkey', \"is a wondrous story of Christ's birth told by an unlikely source: Nestor, a gentle donkey with incredibly long ears and a first-hand knowledge of life in a stable. This simple tale, which takes place in the days of the Roman Empire, is about a humble couple about to take a long journey to Bethlehem and a small, insignificant donkey who is destined to help them along. By all outward appearances, Nestor is undeserving of such a privilege. Stable animals tease him incessantly for his long appendages until, finally, he is cast out of the barn into the winter cold. Snow and ice bring about even greater calamity for Nestor until he receives a dose of divine goodness. Nestor meets Tilly, a heavenly cherub (voiced by Brenda Vaccaro) who imparts guidance to the despairing burro and tells him that soon he would be chosen to participate in a miracle involving a star and a baby, a lowly stable and some travelers named Mary and Joseph. Short and sweet, this stop-motion Christmas gem from Arthur Rankin Jr. and Jules Bass is narrated by Roger Miller. Get out the hanky for an understated holiday classic that will appeal to families of all ages.\", '--Lynn Gibson']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation/Holidays', 'Format': 'Full Screen, NTSC', 'Contributor': 'Jules Bass, Earle Hyman, Brenda Vacarro, Paul Frees, Roger Miller, Larry Kenney, Earl Hammond, Arthur Rankin Jr.Jules Bass, Earle Hyman, Brenda Vacarro, Paul Frees, Roger Miller, Larry Kenney, Earl Hammond, Arthur Rankin Jr.  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 14 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '883316222676', 'Director': 'Jules Bass, Arthur Rankin Jr.', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 14 minutes', 'Release date': 'December 2, 2009', 'Actors': 'Earl Hammond, Earle Hyman, Larry Kenney, Roger Miller, Brenda Vacarro', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a pretty awful old Christmas movie. The quality of the DVD is odd but it may just be my copy, in addition, this story is quite bad for a Santa story. Essentially, Santa is going to die unless he is granted immortality and that is clear in the movie. You might want to think that through with little kids.\nReview Title: Terrible movie\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Have Yourself A Goofy Little Christmas\nReview Date: 2021/12/13\nStore: Bill Farmer  (Actor),     Jim Cummings  (Actor)    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['\\'Tis the season to celebrate, so get set to deck the halls and HAVE YOURSELF A GOOFY LITTLE CHRISTMAS! Goofy always pulls out all the stops to make Christmas extra merry for his son Max. However, his over-the-top decorations usually end up shorting out the electricity on the entire block and wrecking his next-door neighbor Pete\\'s house! This year, hoping for some heavenly peace and quiet, Pete \"escapes\" to Asperin, Colorado, with his family. But Goofy and Max are close behind -- and that means Pete\\'s plans for a \"Silent Night\" are about to go up in smoke! Start your own family tradition and bring home this hilarious holiday classic on DVD. It\\'s festive fun overflowing with love and laughter for all ages!']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Rob Paulsen, Bill Farmer, Jim Cummings, Nancy Cartwright, Dana Hill, Frank Welker, April Winchell', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '24 minutes', 'Aspect Ratio': '1.33:1', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '12364200', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '24 minutes', 'Release date': 'January 13, 2015', 'Actors': 'Bill Farmer, Jim Cummings, Dana Hill, April Winchell, Rob Paulsen', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'WALT DISNEY ANIMATION', 'Number of discs': '1'}\nReview Text: This really fun Christmas movie with Goofy has a great story and pokes some fun at Montana! my home state. Love it! Great story with fun adventure, worth buying for all ages!\nReview Title: Excellent Christmas movie!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Magoo's Christmas Carol\nReview Date: 2022/01/17\nStore: Jim Backus  (Actor),     Abe Levitow  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: [\"Bah, Humbug, Mr. Magoo! This musical adaptation of the classic tale by Charles Dickens, stars Magoo as the cold-hearted old miser, Ebenezer Scrooge. Mr. Magoo's Christmas Carol™ was the first-ever animated holiday special created for television.\", 'Bonus Content:', 'From Pencil to Paint: Production Montage Slide Show', 'From Pencil to Paint: Production Montage Slide Show', 'Styne & Merril Song Demo', 'Styne & Merril Song Demo', \"Lord's Bright Blessing Storyboard Sequence\", \"Lord's Bright Blessing Storyboard Sequence\", 'Fezziwig Storyboard Sequence', 'Fezziwig Storyboard Sequence', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.55:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Abe Levitow', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '53 minutes', 'Release date': 'October 16, 2018', 'Actors': 'Jim Backus', 'Producers': 'Lee Orgel', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0)', 'Studio': 'Studio Distribution Services', 'Writers': 'Barbara Chain', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Ok I had remembered this as a bit funny, but I rewatched it and it was totally ridiculous and I didn't see any real humor. There is a few fumbles by Mr. Magoo, as per usual, but the rest is just the typical short version of a Christmas Carol. Bah humbug I say.\nReview Title: Dumb\nRating: 2.0\n--------------------------------------------------",
  "reference": "Frankenweenie\nMartin Short  (Actor),     Catherine O'Hara  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'From Disney and creative genius Tim Burton (ALICE IN WONDERLAND; THE NIGHTMARE BEFORE CHRISTMAS) comes the hilarious and offbeat FRANKENWEENIE, a heartwarming tale about a boy and his dog. After unexpectedly losing his beloved dog Sparky, young Victor harnesses the power of science to bring his best friend back to life -- with just a few minor adjustments. He tries to hide his home-sewn creation, but when Sparky gets out, Victor\\'s fellow students, teachers and the entire town learn that getting a new \"leash on life\" can be monstrous. Complete with electrifying bonus features, FRANKENWEENIE is alive with enchanting fun for the whole family.', 'Brand Story', 'By']\n{'Genre': 'Animation', 'Format': 'AC-3, Animated, Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed, Enhanced', 'Contributor': \"Charlie Tahan, Robert Capron, Martin Short, Tim Burton, Martin Landau, Atticus Shaffer, Catherine O'Hara, Winona RyderCharlie Tahan, Robert Capron, Martin Short, Tim Burton, Martin Landau, Atticus Shaffer, Catherine O'Hara, Winona Ryder  See more\", 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR786936814149#VG', 'Director': 'Tim Burton', 'Media Format': 'AC-3, Animated, Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed, Enhanced', 'Run time': '1 hour and 27 minutes', 'Release date': 'January 8, 2013', 'Actors': \"Martin Short, Catherine O'Hara, Martin Landau, Winona Ryder, Robert Capron\", 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'WALT DISNEY PICTURES', 'Number of discs': '1'}\nIf you do not &#34;get&#34; Tim Burton, this movie may not thrill you, but the art is incredible. You have to consider the pain-stacking stop-motion work despite the odd story-line. This is art at its best. I was only sad that he didn't work with Johny Depp on this one.\nYou have to love Tim Burton!\nArthur Christmas\nSarah Smith  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'How CAN Santa deliver billions of presents to the whole world in just one night? With an army of one million combat-style Field Elves and a vast, state-of-the-art control center under the ice of the North Pole! So how could this incredible operation have MISSED one child?! To Santa’s young son, Arthur, it threatens to end the magic of Christmas. With retired Grandsanta, a rebellious young elf, an old sleigh and some untrained reindeer, Arthur sets out in a crazy mission to deliver the last present! Deck the halls with excitement, fun and wonder in this new Christmas classic!', 'Amazon.com']\n{'Genre': 'Family, Animation, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Sarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla ShelleySarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla Shelley   See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 37 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '40952', 'Director': 'Sarah Smith', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 6, 2012', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Producers': 'Peter Lord, David Sproxton, Carla Shelley, Steve Pegram', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nSeller was great, but this tale of Christmas was awful in many ways. If you don't want a spoiler, don't read, but Christmas now comes from an &#34;alien&#34; sort of ship delivered by thousands of odd looking elves and Santa is just &#34;in charge&#34; - an old sort of &#34;out of it&#34; guy. It is not a classic I will want to watch again. There were terrible moments that made me want to cry. How is that a happy Christmas?\nA really bizarre way to represent Christmas\nIce Age: Continental Drift\nRay Romano  (Actor),     Denis Leary  (Actor),     Steve Martino  (Director),     Mike Thurmeier  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'Historys greatest heroes return for the most outrageously funny and entertaining Ice Age adventure in two million years. When Scrats acorn antics cause a cataclysmic crack-up, Manny (Ray Romano), Sid (John Leguizamo) and Diego (Denis Leary) go where no herd has gone before on a high-seas quest aboard a floating iceberg. But a menagerie of misfit pirates are determined to shiver their timbers and capsize their journey home. Join a boat-load of lovable new characters (voiced by Jennifer Lopez, Aziz Ansari and Peter Dinklage) for original songs, spectacular animation and heartwarming family fun.', 'Amazon.com', 'The revisionist version of natural history offered up in the', 'Ice Age', 'movies gets yet another twist in the fourth installment, 10 years after Manny the woolly mammoth, Diego the saber-toothed tiger, Sid the sloth, and Scrat the squirrel made their chilly debut to hot box-office receipts. The lessons of family and loyalty in', 'Continental Drift', \"may seem a little warmed over, but the creatively constructed laughs, amusing voice characterizations, and inventive CGI animation are reason enough to keep the series viable for kids to giggle about and grownups to belly laugh over--sometimes for exactly the same reasons. Once again, acorn-addicted Scrat is the cause of some pretty important behind-the-scenes machinations. His dialogue-free antics also serve as a stand-alone subplot that could easily be a very clever short film of its own. This time the weasely rodent's addled obsession with the fruit of the oak is revealed as the cause of the formation of the world's continents as we now know them. He sets the story--and planet Earth--in motion while pursuing a little nut in a hyperactive prologue that causes underground rifts that in turn form the famous shapes of Australia, Africa, North America, and the outline of Italy (which it turns out is shaped like a boot for a very good reason). Above ground this means more global chaos for the herd of animals we've come to know so well. All the familiar voices reprise their wonderful roles as fissures in earth and ice separate Manny (Ray Romano) from his woolly wife Ellie (Queen Latifah) and boy-crazy teenager Peaches (Keke Palmer). With a killer continental shelf bearing down on them, mother and daughter lead the madcap pack of animal characters toward a safe meeting place while Manny, Diego (Denis Leary), Sid (John Leguizamo), and Sid's crazy granny (Wanda Sykes) drift away on an iceberg schooner into a newly vast open ocean. While floating into oblivion, the mismatched pack encounters a band of animal pirates piloting another slab of ship-shaped ice, captained by a crazed baboon named Gutt (Peter Dinklage), who's bent on resentment-based revenge. The motley crew provides a plethora of comic encounters and a new raft of excellent voice actors. Running a close second to Dinklage in ingenious casting is Jennifer Lopez as Shira, a sultry tiger who, don't cha know, ends up on the good ship and falling for Diego in the end. The adventures of both the land- and sea-based creatures are full of clever gags and densely constructed set pieces that may not be quite up to Pixar story standards, but are certainly always on the ball and executed with computer-animation acumen that is astonishingly lifelike for such an unreal-looking world. Scrat's misadventures act as interstitial connectors to the parallel heroes' journey stories until they ultimately intersect in a massively scaled finale. Even after all the melting and refreezing, the\", 'Ice Age', 'world is still a hot commodity in the animated-franchise business and remains a good investment despite the constancy of global rifts in entertaining family fare.', '--Ted Fry']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2280028DVD', 'Director': 'Steve Martino, Mike Thurmeier', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'December 11, 2012', 'Actors': 'Ray Romano, Denis Leary', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nWhy did this do another version of this movie? It's all the same. This version was just more violent and when you thought it could have a really nice ending, they robbed us of that too. Hint, tiger have a mate. Ug.\nSame movie, again\nJingle All the Way (Family Fun Edition)\nArnold Schwarzenegger  (Actor),     Sinbad  (Actor),     Brian Levant  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Arnold Schwartzenegger stars as Howard Langston, an overworked mattress salesman who has been neglecting his family of late; in an attempt to redeem himself, he promises his son whatever he wants for Christmas. Turns out that his heart\\'s desire is a TurboMan doll, coveted by every other kid this year as well, and Howard quickly forgets about his promise until Christmas Eve. Director Brian Levant Star Arnold Schwarzenegger, Sinbad, Phil Hartman, Rita Wilson, Robert Conrad, James Belushi, Jake Lloyd, Special Features: Widescreen - 1.85 Audio: Dolby Digital Surround - English, French, Spanish Subtitles - English, Spanish - Optional Additional Release Material: Audio Commentaries - Extended, Director\\'s Cut Behind the Scenes - 1. \"The Making of a Hero\" 2. \"Turbo Man: Behind the Mask\" Featurettes - \"Super Kids\" Interactive Features: Games (4) Runtime: 109 minutes Year of Release: 1996.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, AC-3, Color, Special Edition, Subtitled, Widescreen', 'Contributor': 'Robert Conrad, Caroline Kaiser, James Belushi, Harvey Korman, Martin Mull, Richard Moll, E.J. De La Pena, Phil Hartman, Justin Chapman, Randy Kornfield, Arnold Schwarzenegger, Sinbad, Nada Despotovich, Jeff Deist, Jake Lloyd, Brian Levant, Rita Wilson, Laraine Newman, Daniel Riordan, Ruth Afton HjelmgrenRobert Conrad, Caroline Kaiser, James Belushi, Harvey Korman, Martin Mull, Richard Moll, E.J. De La Pena, Phil Hartman, Justin Chapman, Randy Kornfield, Arnold Schwarzenegger, Sinbad, Nada Despotovich, Jeff Deist, Jake Lloyd, Brian Levant, Rita Wilson, Laraine Newman, Danie…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': 'Relay Time: 109 min', 'Director': 'Brian Levant', 'Media Format': 'Multiple Formats, Dolby, Dubbed, NTSC, AC-3, Color, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'October 16, 2007', 'Actors': 'Arnold Schwarzenegger, Sinbad, Phil Hartman, Rita Wilson, Robert Conrad', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20TH CENTURY STUDIOS', 'Writers': 'Randy Kornfield', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIs stupid enough to say? And the CD was defective so I missed part of the movie. Don't really care at this point.\nDUH!\nScooby-Doo! Moon Monster Madness MFV (DVD)\nFrank Welker  (Actor),     Mindy Cohn  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Characters & Series, Scooby Doo\n['Scooby-Doo! Moon Monster Madness MFV (DVD)', \"It's a giant leap for dog-kind as Scooby-Doo and the gang blast off for an epic, otherworldly adventure in this all-new original movie! After winning the last five seats in a lottery, Scooby-Doo, Shaggy, Fred, Daphne and Velma are off to space in billionaire Sly Baron's brand-new ship, the Sly Star One. It's all gravity-free fun until a mysterious alien begins destroying the ship! The crew is forced to land on Sly Baron's base ... on the dark side of the moon! Will the gang unravel this alien mystery? Will Scooby-Doo and Shaggy find snacks on the moon? Will Fred ever take his space helmet off?! Journey to the outer limits with Scooby-Doo to find out!\", ']]>']\n{'Genre': 'Animation, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Contributor': 'Matthew Lillard, Grey DeLisle Griffin, Mark Banker, Paul McEvoy, Frank Welker, Sam Register, Alan Burnett, Mindy Cohn, Malcolm McDowellMatthew Lillard, Grey DeLisle Griffin, Mark Banker, Paul McEvoy, Frank Welker, Sam Register, Alan Burnett, Mindy Cohn, Malcolm McDowell  See more', 'Initial release date': '2015-02-17', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': 'WHV1000510189DVD', 'Director': 'Paul McEvoy', 'Media Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Run time': '1 hour and 12 minutes', 'Release date': 'February 17, 2015', 'Actors': 'Frank Welker, Mindy Cohn, Grey DeLisle Griffin, Matthew Lillard, Malcolm McDowell', 'Producers': 'Sam Register, Alan Burnett, Paul McEvoy', 'Studio': 'Studio Distribution Services', 'Writers': 'Mark Banker', 'Number of discs': '1'}\nGreat movie! I love that the voice stars are the same Frank Welker, Grey DeLisle-Griffin, Mindy Cohn, Mathew Lillard. Fun story, always feel like a kid watching! Really fun story.\nScooby Classic!\nScooby-Doo Shaggy’s Showdown (DVD)\nFrank Welker  (Actor),     Matthew Lillard  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Characters & Series, Scooby Doo\n['Scooby-Doo Shaggy’s Showdown (DVD)', 'When the Scooby gang visits a dude ranch, they discover that it and the nearby town have been haunted by a ghostly cowboy, Dapper Dan, who fires real fire from his fire irons. The mystery only deepens when it’s discovered that the ghost is also the long lost relative of Shaggy Rogers!', ']]>']\n{'Genre': 'Kids & Family, Animation', 'Format': 'DVD, NTSC', 'Contributor': 'Matthew Lillard, Frank Welker', 'Initial release date': '2017-02-14', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '43461944', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 12 minutes', 'Release date': 'February 14, 2017', 'Actors': 'Frank Welker, Matthew Lillard', 'Dubbed': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI bought a few Scooby movies for the holiday. I'm sad to say this is not the original cast. this has someone else as Thelma. Sorry, nothing personal, but she is awful. They try to make up for her voice by having Thelma be a bit stupid in this movie....and allergic to everything in the movie so she is constantly sneezing. It is awful. I'm sorry I wasn't aware of the casting. Not a classic Scooby movie.\nThis is not a classic Scooby movie.\nThe Neverending Story (30th Anniversary Edition) [Blu-ray]\nAlan Oppenheimer  (Actor),     Jeff Burr  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The Neverending Story 30th Anniversary (BD)', \"When young Bastian borrows a mysterious, ornately-bound book, he never dreamed turning a page would draw him into a shimmering fantasy world of racing snails, hang-glider bats, soaring luckdragons, puckish elves, a Childlike Empress, the brave warrior Atreyu and a slab-faced walking quarry called a Rock Biter. Follow The NeverEnding Story to the limits of the imagination, thanks to director/co-writer Wolfgang Petersen (The Perfect Storm) and a superstar team of technical tinkerers and magicians (with credits including 2001: A Space Odyssey, Alien and The Empire Strikes Back) who bring to life the most delightful characters ever. You'll cherish this wide-eyed adventure and discover The NeverEnding Story is your story.\", ']]>']\n{'Genre': 'Kids & Family, Fantasy, Science Fiction', 'Format': 'Blu-ray, Widescreen, NTSC', 'Contributor': 'Dieter Geissler, Bernd Eichinger, Howard Albrecht, John Hyde, Tami Stronach, Moses Gunn, Mark Damon, Wolfgang Petersen, Jeff Burr, Patricia Hayes, Gerald McRaney, Herman Weigel, Alan Oppenheimer, Sydney BromleyDieter Geissler, Bernd Eichinger, Howard Albrecht, John Hyde, Tami Stronach, Moses Gunn, Mark Damon, Wolfgang Petersen, Jeff Burr, Patricia Hayes, Gerald McRaney, Herman Weigel, Alan Oppenheimer, Sydney Bromley  See more', 'Initial release date': '2014-10-07', 'Language': 'English', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000489470BR', 'Director': 'Wolfgang Petersen', 'Media Format': 'Blu-ray, Widescreen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 7, 2014', 'Actors': 'Alan Oppenheimer, Jeff Burr, Howard Albrecht, Tami Stronach, Moses Gunn', 'Producers': 'Bernd Eichinger, Mark Damon, Dieter Geissler, John Hyde', 'Studio': 'Studio Distribution Services', 'Writers': 'Wolfgang Petersen, Herman Weigel', 'Number of discs': '1'}\nOnly buy this movie if you REALLY loved it in 1984. A friend told me it was a great story. I barely managed to watch the horrible, fake, scenes and special affects of the 1980s. The kid screaming like a quacker, he needs some therapy. Both kids do. I am not sure the point of the story made any sense. Good grief, there's 2 hours of my life I can't get back!\nYUCK!\nScooby-Doo! and KISS Rock and Roll Mystery (DVD)\nSpike Brandt  (Director),     Frank Welker  (Actor),     Mindy Cohn  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Characters & Series, Scooby Doo\n['Scooby-Doo! and KISS Rock and Roll Mystery (DVD)', 'Get ready to Rock! Scooby-Doo and the Mystery Inc. Gang team up with the one and only KISS in this all-new, out-of-this-world adventure! We join the Gang at Kiss World – the all-things-Kiss theme park, as they investigate a series of strange hauntings. With help from Kiss, they discover that the Crimson Witch has returned to summon The Destroyer from the alternate dimension of Kissteria! The evil duos ghastly plan, to destroy the earth! Can the Gang’s cunning and Kiss’s power of rock save the day?! Tune in to this Rock and Roll Mystery for some thunderous, heavy FUN!', ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '1000511015', 'Director': 'Spike Brandt, Tony Cervone', 'Media Format': 'Multiple Formats, Color, Full Screen, Animated, NTSC', 'Run time': '1 hour and 18 minutes', 'Release date': 'July 21, 2015', 'Actors': 'Frank Welker, Mindy Cohn, Grey DeLisle Griffin, Matthew Lillard, Gene Simmons', 'Producers': 'Tony Cervone', 'Studio': 'Studio Distribution Services', 'Writers': 'Jim Krieg, Kevin Shinick', 'Number of discs': '1'}\nI should have realized that not being a fan of Kiss would mean this wasn't likely going to be a good Scooby adventure. I was right. Yuck. It is the original gang, but couldn't deal with the Kiss group. Will give it to Goodwill.\nOnly buy this if you LOVE Kiss\nVictor Frankenstein\nJames McAvoy  (Actor),     Daniel Radcliffe  (Actor),     Paul McGuigan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Superstars James McAvoy and Daniel Radcliffe are electrifying in this action-packed thriller that breathes new life into the most famous horror tale of all time. Radical scientist Victor Frankenstein (McAvoy) and his trusted assistant Igor (Radcliffe) share a noble vision of aiding humanity through their groundbreaking research into immortality. But when Victor s experiments go too far, his obsession has terrifying consequences, and now only Igor can bring his friend back from the brink of madness... and save him from his monstrous creation!']\n{'Genre': 'Horror', 'Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Daniel Radcliffe, Paul McGuigan, James McAvoy', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35234891', 'Director': 'Paul McGuigan', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'March 8, 2016', 'Actors': 'James McAvoy, Daniel Radcliffe', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '1'}\nI know this is an &#34;old&#34; movie, but I wondered about Daniel Radcliffe's delivery. James McAvoy was brilliant! Danielle was fine, he will mature. The movie I loved. While I am squeamish and generally do not watch horror or scare, this was just tolerable enough to not be too much for me. I generally stick with Disney or rated G. One can only take so much emotional manipulation by others, right! I am very happy I watched. If you are not good with gore, watch during the day. It is worth the bit of gross you see now and again.\nGreat film! Oh and great deal from Amazon!\nScooby-Doo! Mystery Incorporated: Season 2\nFrank Welker  (Actor),     Matthew Lillard  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Scooby-Doo! Mystery Incorporated The Complete Season Two (DVD)', 'Fred, Daphne, Velma, Shaggy and Scooby-Doo continue to solve mysteries in the spooky town of Crystal Cove, a tourist hotspot that boasts a long history of ghostly sightings, werewolves and glowing deep sea divers. While Crystal Cove tries to capitalize on its haunted reputation, the gang will stop at nothing to unveil the truth behind the paranormal activity. In addition to episodic mysteries, SCOOBY-DOO! MYSTERY INCORPORATED keeps viewers enthralled from episode to episode as the teenagers unravel the overarching mystery of Mister E. and their Mystery Incorporated predecessors. This group of friends gets into their share of disagreements, scary situations, silly antics and even have time for a little romance. In its first season in the U.S., the series averaged nearly two million viewers.', ']]>']\n{'Genre': 'Kids & Family, Animation, Comedy, Mystery & Suspense/Crime/Cops, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': 'Matthew Lillard, Spike Brandt, Grey DeLisle, Frank Welker, Mindy Cohn, Sam Register, Tony Cervone', 'Language': 'English', 'Number Of Discs': '4', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'THT1000501007DVD', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '9 hours and 32 minutes', 'Release date': 'October 7, 2014', 'Actors': 'Frank Welker, Matthew Lillard, Grey DeLisle, Mindy Cohn', 'Producers': 'Spike Brandt, Sam Register, Tony Cervone', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nThis is an odd take on Scooby and has a weird ending, but as a long time Scooby fan, this is one I enjoyed watching over.\nWeird, but if you are a Scooby fan, have to have\nMurdoch Mysteries: Christmas Cases Collection\nYannick Bisson  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n[\"Detective William Murdoch (Yannick Bisson, Sue Thomas: F.B.Eye) and his team solve yuletide crimes in these three feature-length mysteries set in Edwardian Toronto.A Merry Murdoch Christmas—At a charity gala, Murdoch and his wife, Dr. Julia Ogden (Hélène Joy, Durham County), find the host dead from a broken neck; Inspector Brackenreid (Thomas Craig, Coronation Street) suspects the culprit is the legendary Christmas creature Krampus.Once Upon a Murdoch Christmas—When Murdoch investigates a daring robbery where the culprit seemed to possess superhuman abilities, Constable Crabtree (Jonny Harris, Still Standing) realizes the robber resembles a character from his novel.Home for the Holidays—Murdoch and Julia travel to British Columbia to visit Murdoch's brother (Dylan Neal, Dawson’s Creek), but instead of a family holiday, they end up investigating a murder at an archaeological site.Guest stars include Brendan Coyle (Downton Abbey), Kelly Rowan (The O.C.), Megan Follows (Reign, Anne of Green Gables), Kate Hewlett (The Girlfriend Experience), Jake Epstein (Degrassi: The Next Generation), and Ed Asner (The Mary Tyler Moore Show, Up).\"]\n{'Genre': 'Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Yannick Bisson', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.52 Ounces', 'Item model number': 'AMP2684', 'Media Format': 'NTSC', 'Release date': 'October 30, 2018', 'Actors': 'Yannick Bisson', 'Subtitles': 'English', 'Studio': 'Acorn', 'Country of Origin': 'USA', 'Number of discs': '3'}\nMurdoch was my favorite series of late until this Season 11. They finally pushed it too far for me with violence. Sadly, I don't care to watch it anymore. It had been a series of romance and mystery that until now I enjoyed. Everyone has different limits.\nWas my favorite\nThe Addams Family 2019\nOscar Isaac  (Actor),     Charlize Theron  (Actor),     Conrad Vernon  (Director, Producer),     Greg Tiernan  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Movies\n['Get ready to snap your fingers! The Addams Family is back in their first animated comedy about the kookiest family on the block. Funny, outlandish, and completely iconic, The Addams Family redefines what it means to be a good neighbor.', 'Bonus Content:', 'Deleted and Extended Scenes', 'Deleted and Extended Scenes', 'Charades with Thing', 'Charades with Thing', 'Life of a Scene', 'Life of a Scene', 'Welcome to the Family', 'Welcome to the Family', 'Addams Family Throwback', 'Addams Family Throwback', '\"\"Haunted Heart\"\" Lyric Video', '\"\"Haunted Heart\"\" Lyric Video', '\"\"My Family\"\" Lyric Video', '\"\"My Family\"\" Lyric Video', ']]>']\n{'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'B07YMLDKJ3', 'Director': 'Conrad Vernon, Greg Tiernan', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 27 minutes', 'Release date': 'January 21, 2020', 'Actors': 'Oscar Isaac, Charlize Theron, Chloe Grace Moretz, Finn Wolfhard, Nick Kroll', 'Subtitles': 'Spanish, French', 'Producers': \"Gail Berman, Conrad Vernon, Alex Schwartz, Alison O'Brien\", 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nThis arrived as described in new condition, sealed. Super price, fun watch. Great!\nGreat movie!\nSanta's Apprentice/Magic Snowflake Double Feature\nGabe Eggerling  (Actor),     Jean-Pierre Marielle  (Actor),     Luc Vinciguerra  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['SANTA\\'S APPRENTICE / MAGIC SNOWFLAKE - DVD - \"Santa\\'s Apprentice: Santa doesn\\'t want to retire, but rules are rules and he must train someone to replace him. The lucky winner, to be chosen from among millions of children, must be named Nicholas, be an orphan and have a pure heart. On the other side of the planet, there is a little boy who is a perfect match, but his lack of self-confidence and fear of heights make him a poor contestant. Will Santa agree to step down, and help his apprentice take his place? - \"The Magic Snowflake\": A young boy named Nicholas is about to become the next Santa Claus, but must first avoid a crisis that\\'s threatening the magic of Christmas before he can succeed in his new role.']\n{'Genre': 'Family', 'Format': 'NTSC, Widescreen', 'Contributor': 'Vincent Grass, Gabe Eggerling, Julie Gayet, Max Cullen, Luc Vinciguerra, Jean-Pierre Marielle, Nathan SimonyVincent Grass, Gabe Eggerling, Julie Gayet, Max Cullen, Luc Vinciguerra, Jean-Pierre Marielle, Nathan Simony  See more', 'Language': 'English', 'Runtime': '2 hours and 24 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Audio Description': 'English', 'Director': 'Luc Vinciguerra', 'Media Format': 'NTSC, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Gabe Eggerling, Jean-Pierre Marielle, Julie Gayet, Max Cullen, Nathan Simony', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThese movies were on Netflix last year and we loved them. I'm so happy to see them for sale here. It looked like they wouldn't be in stock until January but we put in our order anyway, and yippie! this arrived already. This is such a fun story about Santa Clause and an orphan boy. It's very worth owning.\nWonderful Christmas stories\n{'Content advisory': ['Violence', 'smoking'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Maxwell Atoms'], 'Producers': ['Maxwell Atoms'], 'Starring': ['Frank Welker', 'Grey DeLisle Griffin', 'Matthew Lillard'], 'Studio': ['WARNER BROS.']}\nHow can I say really bad in many ways? Don't bother. I am an old Scooby fan, own many movies plus the original series. This one takes a new direction with Daphne as \"hip\" that's bad and the voice of Velma is just annoying. The storyline is bad. How can you mess up Scooby? Well, they did.\nTERRIBLE\nYogi's First Christmas (1980 TV Special)\nRay Patterson  (Director),     Daws Butler  (Actor),     Don Messick  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n[\"Yogi and Boo Boo usually snooze right through Christmas. (Hibernation, you know.) But this year, happy holiday music rouses them from their sleep and right into the fun: skating, skiing, singing and trimming the tree. But life isn't all mistletoe and eggnog. Two holiday grouches -- a mysterious hermit and the obnoxious nephew of Jellystone Lodge's owner -- are determined to ruin Christmas. And our two heroes, joined by Snagglepuss, Augie Doggie, Doggie Daddy, Huckleberry Hound and more Hanna-Barbera favorites, are just as determined to make December 25 the jolliest day of the year!\"]\n{'Genre': 'Kids & Family, Animation/Holidays', 'Format': 'Full Screen, NTSC', 'Contributor': 'Janet Waldo, Ray Patterson, Marilyn Schreffler, Don Messick, Hal Smith, Daws Butler, John Stephenson', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'WARA22252DVD', 'Director': 'Ray Patterson', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'December 2, 2009', 'Actors': 'Daws Butler, Don Messick, Janet Waldo, John Stephenson, Marilyn Schreffler', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a very fun old Christmas Yogi movie, longer than I remembered. It's great fun for any age kids!\nGreat childhood memory\nLife And Adventures Of Santa Claus/Nestor The Christmas Donkey (Double Feature)\nEarl Hammond  (Actor),     Earle Hyman  (Actor),     Jules Bass  (Director),     Arthur Rankin Jr.  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Timeless Holiday Favorites\n['Product Description', \"The Wizard of Oz creator L. Frank Baum penned the story that inspired The Life and Adventures of Santa Claus. A babe born in the woods near the forest of Burzee is named Claus. As Claus grows up, the gods send him to the land of mortals to spread joy and happiness where there is none. Claus carves a small wooden cat for an orphan and decides that all children rich or poor should receive toys for Christmas. A long time ago the little donkey Nestor lives in a country stable. Mocked for his ears, Nestor and his mother are cast out of the stable. In the snowy cold, Nestor's mother sacrifices herself to protect her child. In the spring a cherub arrives to guide Nestor so he may save another as his mother saved him. Two travelers choose him for a trip to Bethlehem and Nestor the Long-Eared Christmas Donkey fulfills his destiny.\", 'Amazon.com', 'A bizarre, pagan take on the Santa Claus legend,', 'The Life and Adventures of Santa Claus', ', which is based on a story by L. Frank Baum (', 'The Wizard of Oz', '), was produced and directed by Rankin and Bass, the reigning kings of the Christmas special (', 'Rudolph the Red-Nosed Reindeer', '), using their brand of puppet animation. In the forest of Burzee, the immortals gather to discuss the fate of Santa Claus. Found when he was an abandoned baby by the Great Ak (a wizard with big wooden horns on his head), the boy was named Claus because that means \"little one\" in the language of the forest. Raised by immortals and knowing nothing but peace and harmony, the adolescent Claus is taken on a tour of the mortal world by the Great Ak, and he discovers the world is rife with misery and injustice. This is when he decides he will dedicate his life to making kids happy, and he learns the best way to do this is to give them toys. After years of service, the immortals must decide whether or not to give him eternal life. Indeed, this is a very strange Christmas tale.', '--Andy Spletzer', 'Nestor, The Long-Eared Christmas Donkey', \"is a wondrous story of Christ's birth told by an unlikely source: Nestor, a gentle donkey with incredibly long ears and a first-hand knowledge of life in a stable. This simple tale, which takes place in the days of the Roman Empire, is about a humble couple about to take a long journey to Bethlehem and a small, insignificant donkey who is destined to help them along. By all outward appearances, Nestor is undeserving of such a privilege. Stable animals tease him incessantly for his long appendages until, finally, he is cast out of the barn into the winter cold. Snow and ice bring about even greater calamity for Nestor until he receives a dose of divine goodness. Nestor meets Tilly, a heavenly cherub (voiced by Brenda Vaccaro) who imparts guidance to the despairing burro and tells him that soon he would be chosen to participate in a miracle involving a star and a baby, a lowly stable and some travelers named Mary and Joseph. Short and sweet, this stop-motion Christmas gem from Arthur Rankin Jr. and Jules Bass is narrated by Roger Miller. Get out the hanky for an understated holiday classic that will appeal to families of all ages.\", '--Lynn Gibson']\n{'Genre': 'Kids & Family, Animation/Holidays', 'Format': 'Full Screen, NTSC', 'Contributor': 'Jules Bass, Earle Hyman, Brenda Vacarro, Paul Frees, Roger Miller, Larry Kenney, Earl Hammond, Arthur Rankin Jr.Jules Bass, Earle Hyman, Brenda Vacarro, Paul Frees, Roger Miller, Larry Kenney, Earl Hammond, Arthur Rankin Jr.  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 14 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '883316222676', 'Director': 'Jules Bass, Arthur Rankin Jr.', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 14 minutes', 'Release date': 'December 2, 2009', 'Actors': 'Earl Hammond, Earle Hyman, Larry Kenney, Roger Miller, Brenda Vacarro', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a pretty awful old Christmas movie. The quality of the DVD is odd but it may just be my copy, in addition, this story is quite bad for a Santa story. Essentially, Santa is going to die unless he is granted immortality and that is clear in the movie. You might want to think that through with little kids.\nTerrible movie\nHave Yourself A Goofy Little Christmas\nBill Farmer  (Actor),     Jim Cummings  (Actor)    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['\\'Tis the season to celebrate, so get set to deck the halls and HAVE YOURSELF A GOOFY LITTLE CHRISTMAS! Goofy always pulls out all the stops to make Christmas extra merry for his son Max. However, his over-the-top decorations usually end up shorting out the electricity on the entire block and wrecking his next-door neighbor Pete\\'s house! This year, hoping for some heavenly peace and quiet, Pete \"escapes\" to Asperin, Colorado, with his family. But Goofy and Max are close behind -- and that means Pete\\'s plans for a \"Silent Night\" are about to go up in smoke! Start your own family tradition and bring home this hilarious holiday classic on DVD. It\\'s festive fun overflowing with love and laughter for all ages!']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Rob Paulsen, Bill Farmer, Jim Cummings, Nancy Cartwright, Dana Hill, Frank Welker, April Winchell', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '24 minutes', 'Aspect Ratio': '1.33:1', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '12364200', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '24 minutes', 'Release date': 'January 13, 2015', 'Actors': 'Bill Farmer, Jim Cummings, Dana Hill, April Winchell, Rob Paulsen', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'WALT DISNEY ANIMATION', 'Number of discs': '1'}\nThis really fun Christmas movie with Goofy has a great story and pokes some fun at Montana! my home state. Love it! Great story with fun adventure, worth buying for all ages!\nExcellent Christmas movie!\nMr. Magoo's Christmas Carol\nJim Backus  (Actor),     Abe Levitow  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n[\"Bah, Humbug, Mr. Magoo! This musical adaptation of the classic tale by Charles Dickens, stars Magoo as the cold-hearted old miser, Ebenezer Scrooge. Mr. Magoo's Christmas Carol™ was the first-ever animated holiday special created for television.\", 'Bonus Content:', 'From Pencil to Paint: Production Montage Slide Show', 'From Pencil to Paint: Production Montage Slide Show', 'Styne & Merril Song Demo', 'Styne & Merril Song Demo', \"Lord's Bright Blessing Storyboard Sequence\", \"Lord's Bright Blessing Storyboard Sequence\", 'Fezziwig Storyboard Sequence', 'Fezziwig Storyboard Sequence', ']]>']\n{'Aspect Ratio': '1.55:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Abe Levitow', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '53 minutes', 'Release date': 'October 16, 2018', 'Actors': 'Jim Backus', 'Producers': 'Lee Orgel', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0)', 'Studio': 'Studio Distribution Services', 'Writers': 'Barbara Chain', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOk I had remembered this as a bit funny, but I rewatched it and it was totally ridiculous and I didn't see any real humor. There is a few fumbles by Mr. Magoo, as per usual, but the rest is just the typical short version of a Christmas Carol. Bah humbug I say.\nDumb",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Frankenweenie\nReview Date: 2013/03/01\nStore: Martin Short  (Actor),     Catherine O'Hara  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From Disney and creative genius Tim Burton (ALICE IN WONDERLAND; THE NIGHTMARE BEFORE CHRISTMAS) comes the hilarious and offbeat FRANKENWEENIE, a heartwarming tale about a boy and his dog. After unexpectedly losing his beloved dog Sparky, young Victor harnesses the power of science to bring his best friend back to life -- with just a few minor adjustments. He tries to hide his home-sewn creation, but when Sparky gets out, Victor\\'s fellow students, teachers and the entire town learn that getting a new \"leash on life\" can be monstrous. Complete with electrifying bonus features, FRANKENWEENIE is alive with enchanting fun for the whole family.', 'Brand Story', 'By']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation', 'Format': 'AC-3, Animated, Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed, Enhanced', 'Contributor': \"Charlie Tahan, Robert Capron, Martin Short, Tim Burton, Martin Landau, Atticus Shaffer, Catherine O'Hara, Winona RyderCharlie Tahan, Robert Capron, Martin Short, Tim Burton, Martin Landau, Atticus Shaffer, Catherine O'Hara, Winona Ryder  See more\", 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR786936814149#VG', 'Director': 'Tim Burton', 'Media Format': 'AC-3, Animated, Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed, Enhanced', 'Run time': '1 hour and 27 minutes', 'Release date': 'January 8, 2013', 'Actors': \"Martin Short, Catherine O'Hara, Martin Landau, Winona Ryder, Robert Capron\", 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'WALT DISNEY PICTURES', 'Number of discs': '1'}\nReview Text: If you do not &#34;get&#34; Tim Burton, this movie may not thrill you, but the art is incredible. You have to consider the pain-stacking stop-motion work despite the odd story-line. This is art at its best. I was only sad that he didn't work with Johny Depp on this one.\nReview Title: You have to love Tim Burton!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Arthur Christmas\nReview Date: 2013/03/01\nStore: Sarah Smith  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'How CAN Santa deliver billions of presents to the whole world in just one night? With an army of one million combat-style Field Elves and a vast, state-of-the-art control center under the ice of the North Pole! So how could this incredible operation have MISSED one child?! To Santa’s young son, Arthur, it threatens to end the magic of Christmas. With retired Grandsanta, a rebellious young elf, an old sleigh and some untrained reindeer, Arthur sets out in a crazy mission to deliver the last present! Deck the halls with excitement, fun and wonder in this new Christmas classic!', 'Amazon.com']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Family, Animation, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Sarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla ShelleySarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla Shelley   See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 37 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '40952', 'Director': 'Sarah Smith', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 6, 2012', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Producers': 'Peter Lord, David Sproxton, Carla Shelley, Steve Pegram', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Seller was great, but this tale of Christmas was awful in many ways. If you don't want a spoiler, don't read, but Christmas now comes from an &#34;alien&#34; sort of ship delivered by thousands of odd looking elves and Santa is just &#34;in charge&#34; - an old sort of &#34;out of it&#34; guy. It is not a classic I will want to watch again. There were terrible moments that made me want to cry. How is that a happy Christmas?\nReview Title: A really bizarre way to represent Christmas\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Age: Continental Drift\nReview Date: 2013/03/01\nStore: Ray Romano  (Actor),     Denis Leary  (Actor),     Steve Martino  (Director),     Mike Thurmeier  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'Historys greatest heroes return for the most outrageously funny and entertaining Ice Age adventure in two million years. When Scrats acorn antics cause a cataclysmic crack-up, Manny (Ray Romano), Sid (John Leguizamo) and Diego (Denis Leary) go where no herd has gone before on a high-seas quest aboard a floating iceberg. But a menagerie of misfit pirates are determined to shiver their timbers and capsize their journey home. Join a boat-load of lovable new characters (voiced by Jennifer Lopez, Aziz Ansari and Peter Dinklage) for original songs, spectacular animation and heartwarming family fun.', 'Amazon.com', 'The revisionist version of natural history offered up in the', 'Ice Age', 'movies gets yet another twist in the fourth installment, 10 years after Manny the woolly mammoth, Diego the saber-toothed tiger, Sid the sloth, and Scrat the squirrel made their chilly debut to hot box-office receipts. The lessons of family and loyalty in', 'Continental Drift', \"may seem a little warmed over, but the creatively constructed laughs, amusing voice characterizations, and inventive CGI animation are reason enough to keep the series viable for kids to giggle about and grownups to belly laugh over--sometimes for exactly the same reasons. Once again, acorn-addicted Scrat is the cause of some pretty important behind-the-scenes machinations. His dialogue-free antics also serve as a stand-alone subplot that could easily be a very clever short film of its own. This time the weasely rodent's addled obsession with the fruit of the oak is revealed as the cause of the formation of the world's continents as we now know them. He sets the story--and planet Earth--in motion while pursuing a little nut in a hyperactive prologue that causes underground rifts that in turn form the famous shapes of Australia, Africa, North America, and the outline of Italy (which it turns out is shaped like a boot for a very good reason). Above ground this means more global chaos for the herd of animals we've come to know so well. All the familiar voices reprise their wonderful roles as fissures in earth and ice separate Manny (Ray Romano) from his woolly wife Ellie (Queen Latifah) and boy-crazy teenager Peaches (Keke Palmer). With a killer continental shelf bearing down on them, mother and daughter lead the madcap pack of animal characters toward a safe meeting place while Manny, Diego (Denis Leary), Sid (John Leguizamo), and Sid's crazy granny (Wanda Sykes) drift away on an iceberg schooner into a newly vast open ocean. While floating into oblivion, the mismatched pack encounters a band of animal pirates piloting another slab of ship-shaped ice, captained by a crazed baboon named Gutt (Peter Dinklage), who's bent on resentment-based revenge. The motley crew provides a plethora of comic encounters and a new raft of excellent voice actors. Running a close second to Dinklage in ingenious casting is Jennifer Lopez as Shira, a sultry tiger who, don't cha know, ends up on the good ship and falling for Diego in the end. The adventures of both the land- and sea-based creatures are full of clever gags and densely constructed set pieces that may not be quite up to Pixar story standards, but are certainly always on the ball and executed with computer-animation acumen that is astonishingly lifelike for such an unreal-looking world. Scrat's misadventures act as interstitial connectors to the parallel heroes' journey stories until they ultimately intersect in a massively scaled finale. Even after all the melting and refreezing, the\", 'Ice Age', 'world is still a hot commodity in the animated-franchise business and remains a good investment despite the constancy of global rifts in entertaining family fare.', '--Ted Fry']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2280028DVD', 'Director': 'Steve Martino, Mike Thurmeier', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'December 11, 2012', 'Actors': 'Ray Romano, Denis Leary', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: Why did this do another version of this movie? It's all the same. This version was just more violent and when you thought it could have a really nice ending, they robbed us of that too. Hint, tiger have a mate. Ug.\nReview Title: Same movie, again\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jingle All the Way (Family Fun Edition)\nReview Date: 2014/12/31\nStore: Arnold Schwarzenegger  (Actor),     Sinbad  (Actor),     Brian Levant  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Arnold Schwartzenegger stars as Howard Langston, an overworked mattress salesman who has been neglecting his family of late; in an attempt to redeem himself, he promises his son whatever he wants for Christmas. Turns out that his heart\\'s desire is a TurboMan doll, coveted by every other kid this year as well, and Howard quickly forgets about his promise until Christmas Eve. Director Brian Levant Star Arnold Schwarzenegger, Sinbad, Phil Hartman, Rita Wilson, Robert Conrad, James Belushi, Jake Lloyd, Special Features: Widescreen - 1.85 Audio: Dolby Digital Surround - English, French, Spanish Subtitles - English, Spanish - Optional Additional Release Material: Audio Commentaries - Extended, Director\\'s Cut Behind the Scenes - 1. \"The Making of a Hero\" 2. \"Turbo Man: Behind the Mask\" Featurettes - \"Super Kids\" Interactive Features: Games (4) Runtime: 109 minutes Year of Release: 1996.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, AC-3, Color, Special Edition, Subtitled, Widescreen', 'Contributor': 'Robert Conrad, Caroline Kaiser, James Belushi, Harvey Korman, Martin Mull, Richard Moll, E.J. De La Pena, Phil Hartman, Justin Chapman, Randy Kornfield, Arnold Schwarzenegger, Sinbad, Nada Despotovich, Jeff Deist, Jake Lloyd, Brian Levant, Rita Wilson, Laraine Newman, Daniel Riordan, Ruth Afton HjelmgrenRobert Conrad, Caroline Kaiser, James Belushi, Harvey Korman, Martin Mull, Richard Moll, E.J. De La Pena, Phil Hartman, Justin Chapman, Randy Kornfield, Arnold Schwarzenegger, Sinbad, Nada Despotovich, Jeff Deist, Jake Lloyd, Brian Levant, Rita Wilson, Laraine Newman, Danie…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': 'Relay Time: 109 min', 'Director': 'Brian Levant', 'Media Format': 'Multiple Formats, Dolby, Dubbed, NTSC, AC-3, Color, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'October 16, 2007', 'Actors': 'Arnold Schwarzenegger, Sinbad, Phil Hartman, Rita Wilson, Robert Conrad', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20TH CENTURY STUDIOS', 'Writers': 'Randy Kornfield', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Is stupid enough to say? And the CD was defective so I missed part of the movie. Don't really care at this point.\nReview Title: DUH!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo! Moon Monster Madness MFV (DVD)\nReview Date: 2018/01/07\nStore: Frank Welker  (Actor),     Mindy Cohn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Characters & Series, Scooby Doo\nProduct Description: ['Scooby-Doo! Moon Monster Madness MFV (DVD)', \"It's a giant leap for dog-kind as Scooby-Doo and the gang blast off for an epic, otherworldly adventure in this all-new original movie! After winning the last five seats in a lottery, Scooby-Doo, Shaggy, Fred, Daphne and Velma are off to space in billionaire Sly Baron's brand-new ship, the Sly Star One. It's all gravity-free fun until a mysterious alien begins destroying the ship! The crew is forced to land on Sly Baron's base ... on the dark side of the moon! Will the gang unravel this alien mystery? Will Scooby-Doo and Shaggy find snacks on the moon? Will Fred ever take his space helmet off?! Journey to the outer limits with Scooby-Doo to find out!\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Contributor': 'Matthew Lillard, Grey DeLisle Griffin, Mark Banker, Paul McEvoy, Frank Welker, Sam Register, Alan Burnett, Mindy Cohn, Malcolm McDowellMatthew Lillard, Grey DeLisle Griffin, Mark Banker, Paul McEvoy, Frank Welker, Sam Register, Alan Burnett, Mindy Cohn, Malcolm McDowell  See more', 'Initial release date': '2015-02-17', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': 'WHV1000510189DVD', 'Director': 'Paul McEvoy', 'Media Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC', 'Run time': '1 hour and 12 minutes', 'Release date': 'February 17, 2015', 'Actors': 'Frank Welker, Mindy Cohn, Grey DeLisle Griffin, Matthew Lillard, Malcolm McDowell', 'Producers': 'Sam Register, Alan Burnett, Paul McEvoy', 'Studio': 'Studio Distribution Services', 'Writers': 'Mark Banker', 'Number of discs': '1'}\nReview Text: Great movie! I love that the voice stars are the same Frank Welker, Grey DeLisle-Griffin, Mindy Cohn, Mathew Lillard. Fun story, always feel like a kid watching! Really fun story.\nReview Title: Scooby Classic!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo Shaggy’s Showdown (DVD)\nReview Date: 2018/01/07\nStore: Frank Welker  (Actor),     Matthew Lillard  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Characters & Series, Scooby Doo\nProduct Description: ['Scooby-Doo Shaggy’s Showdown (DVD)', 'When the Scooby gang visits a dude ranch, they discover that it and the nearby town have been haunted by a ghostly cowboy, Dapper Dan, who fires real fire from his fire irons. The mystery only deepens when it’s discovered that the ghost is also the long lost relative of Shaggy Rogers!', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation', 'Format': 'DVD, NTSC', 'Contributor': 'Matthew Lillard, Frank Welker', 'Initial release date': '2017-02-14', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '43461944', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 12 minutes', 'Release date': 'February 14, 2017', 'Actors': 'Frank Welker, Matthew Lillard', 'Dubbed': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I bought a few Scooby movies for the holiday. I'm sad to say this is not the original cast. this has someone else as Thelma. Sorry, nothing personal, but she is awful. They try to make up for her voice by having Thelma be a bit stupid in this movie....and allergic to everything in the movie so she is constantly sneezing. It is awful. I'm sorry I wasn't aware of the casting. Not a classic Scooby movie.\nReview Title: This is not a classic Scooby movie.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Neverending Story (30th Anniversary Edition) [Blu-ray]\nReview Date: 2018/03/06\nStore: Alan Oppenheimer  (Actor),     Jeff Burr  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['The Neverending Story 30th Anniversary (BD)', \"When young Bastian borrows a mysterious, ornately-bound book, he never dreamed turning a page would draw him into a shimmering fantasy world of racing snails, hang-glider bats, soaring luckdragons, puckish elves, a Childlike Empress, the brave warrior Atreyu and a slab-faced walking quarry called a Rock Biter. Follow The NeverEnding Story to the limits of the imagination, thanks to director/co-writer Wolfgang Petersen (The Perfect Storm) and a superstar team of technical tinkerers and magicians (with credits including 2001: A Space Odyssey, Alien and The Empire Strikes Back) who bring to life the most delightful characters ever. You'll cherish this wide-eyed adventure and discover The NeverEnding Story is your story.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Fantasy, Science Fiction', 'Format': 'Blu-ray, Widescreen, NTSC', 'Contributor': 'Dieter Geissler, Bernd Eichinger, Howard Albrecht, John Hyde, Tami Stronach, Moses Gunn, Mark Damon, Wolfgang Petersen, Jeff Burr, Patricia Hayes, Gerald McRaney, Herman Weigel, Alan Oppenheimer, Sydney BromleyDieter Geissler, Bernd Eichinger, Howard Albrecht, John Hyde, Tami Stronach, Moses Gunn, Mark Damon, Wolfgang Petersen, Jeff Burr, Patricia Hayes, Gerald McRaney, Herman Weigel, Alan Oppenheimer, Sydney Bromley  See more', 'Initial release date': '2014-10-07', 'Language': 'English', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000489470BR', 'Director': 'Wolfgang Petersen', 'Media Format': 'Blu-ray, Widescreen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 7, 2014', 'Actors': 'Alan Oppenheimer, Jeff Burr, Howard Albrecht, Tami Stronach, Moses Gunn', 'Producers': 'Bernd Eichinger, Mark Damon, Dieter Geissler, John Hyde', 'Studio': 'Studio Distribution Services', 'Writers': 'Wolfgang Petersen, Herman Weigel', 'Number of discs': '1'}\nReview Text: Only buy this movie if you REALLY loved it in 1984. A friend told me it was a great story. I barely managed to watch the horrible, fake, scenes and special affects of the 1980s. The kid screaming like a quacker, he needs some therapy. Both kids do. I am not sure the point of the story made any sense. Good grief, there's 2 hours of my life I can't get back!\nReview Title: YUCK!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo! and KISS Rock and Roll Mystery (DVD)\nReview Date: 2018/04/28\nStore: Spike Brandt  (Director),     Frank Welker  (Actor),     Mindy Cohn  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Characters & Series, Scooby Doo\nProduct Description: ['Scooby-Doo! and KISS Rock and Roll Mystery (DVD)', 'Get ready to Rock! Scooby-Doo and the Mystery Inc. Gang team up with the one and only KISS in this all-new, out-of-this-world adventure! We join the Gang at Kiss World – the all-things-Kiss theme park, as they investigate a series of strange hauntings. With help from Kiss, they discover that the Crimson Witch has returned to summon The Destroyer from the alternate dimension of Kissteria! The evil duos ghastly plan, to destroy the earth! Can the Gang’s cunning and Kiss’s power of rock save the day?! Tune in to this Rock and Roll Mystery for some thunderous, heavy FUN!', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '1000511015', 'Director': 'Spike Brandt, Tony Cervone', 'Media Format': 'Multiple Formats, Color, Full Screen, Animated, NTSC', 'Run time': '1 hour and 18 minutes', 'Release date': 'July 21, 2015', 'Actors': 'Frank Welker, Mindy Cohn, Grey DeLisle Griffin, Matthew Lillard, Gene Simmons', 'Producers': 'Tony Cervone', 'Studio': 'Studio Distribution Services', 'Writers': 'Jim Krieg, Kevin Shinick', 'Number of discs': '1'}\nReview Text: I should have realized that not being a fan of Kiss would mean this wasn't likely going to be a good Scooby adventure. I was right. Yuck. It is the original gang, but couldn't deal with the Kiss group. Will give it to Goodwill.\nReview Title: Only buy this if you LOVE Kiss\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Victor Frankenstein\nReview Date: 2018/06/08\nStore: James McAvoy  (Actor),     Daniel Radcliffe  (Actor),     Paul McGuigan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Superstars James McAvoy and Daniel Radcliffe are electrifying in this action-packed thriller that breathes new life into the most famous horror tale of all time. Radical scientist Victor Frankenstein (McAvoy) and his trusted assistant Igor (Radcliffe) share a noble vision of aiding humanity through their groundbreaking research into immortality. But when Victor s experiments go too far, his obsession has terrifying consequences, and now only Igor can bring his friend back from the brink of madness... and save him from his monstrous creation!']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Horror', 'Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Daniel Radcliffe, Paul McGuigan, James McAvoy', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35234891', 'Director': 'Paul McGuigan', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'March 8, 2016', 'Actors': 'James McAvoy, Daniel Radcliffe', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '1'}\nReview Text: I know this is an &#34;old&#34; movie, but I wondered about Daniel Radcliffe's delivery. James McAvoy was brilliant! Danielle was fine, he will mature. The movie I loved. While I am squeamish and generally do not watch horror or scare, this was just tolerable enough to not be too much for me. I generally stick with Disney or rated G. One can only take so much emotional manipulation by others, right! I am very happy I watched. If you are not good with gore, watch during the day. It is worth the bit of gross you see now and again.\nReview Title: Great film! Oh and great deal from Amazon!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scooby-Doo! Mystery Incorporated: Season 2\nReview Date: 2018/11/11\nStore: Frank Welker  (Actor),     Matthew Lillard  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Scooby-Doo! Mystery Incorporated The Complete Season Two (DVD)', 'Fred, Daphne, Velma, Shaggy and Scooby-Doo continue to solve mysteries in the spooky town of Crystal Cove, a tourist hotspot that boasts a long history of ghostly sightings, werewolves and glowing deep sea divers. While Crystal Cove tries to capitalize on its haunted reputation, the gang will stop at nothing to unveil the truth behind the paranormal activity. In addition to episodic mysteries, SCOOBY-DOO! MYSTERY INCORPORATED keeps viewers enthralled from episode to episode as the teenagers unravel the overarching mystery of Mister E. and their Mystery Incorporated predecessors. This group of friends gets into their share of disagreements, scary situations, silly antics and even have time for a little romance. In its first season in the U.S., the series averaged nearly two million viewers.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Animation, Comedy, Mystery & Suspense/Crime/Cops, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': 'Matthew Lillard, Spike Brandt, Grey DeLisle, Frank Welker, Mindy Cohn, Sam Register, Tony Cervone', 'Language': 'English', 'Number Of Discs': '4', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'THT1000501007DVD', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '9 hours and 32 minutes', 'Release date': 'October 7, 2014', 'Actors': 'Frank Welker, Matthew Lillard, Grey DeLisle, Mindy Cohn', 'Producers': 'Spike Brandt, Sam Register, Tony Cervone', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: This is an odd take on Scooby and has a weird ending, but as a long time Scooby fan, this is one I enjoyed watching over.\nReview Title: Weird, but if you are a Scooby fan, have to have\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Murdoch Mysteries: Christmas Cases Collection\nReview Date: 2019/03/11\nStore: Yannick Bisson  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: [\"Detective William Murdoch (Yannick Bisson, Sue Thomas: F.B.Eye) and his team solve yuletide crimes in these three feature-length mysteries set in Edwardian Toronto.A Merry Murdoch Christmas—At a charity gala, Murdoch and his wife, Dr. Julia Ogden (Hélène Joy, Durham County), find the host dead from a broken neck; Inspector Brackenreid (Thomas Craig, Coronation Street) suspects the culprit is the legendary Christmas creature Krampus.Once Upon a Murdoch Christmas—When Murdoch investigates a daring robbery where the culprit seemed to possess superhuman abilities, Constable Crabtree (Jonny Harris, Still Standing) realizes the robber resembles a character from his novel.Home for the Holidays—Murdoch and Julia travel to British Columbia to visit Murdoch's brother (Dylan Neal, Dawson’s Creek), but instead of a family holiday, they end up investigating a murder at an archaeological site.Guest stars include Brendan Coyle (Downton Abbey), Kelly Rowan (The O.C.), Megan Follows (Reign, Anne of Green Gables), Kate Hewlett (The Girlfriend Experience), Jake Epstein (Degrassi: The Next Generation), and Ed Asner (The Mary Tyler Moore Show, Up).\"]\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Yannick Bisson', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.52 Ounces', 'Item model number': 'AMP2684', 'Media Format': 'NTSC', 'Release date': 'October 30, 2018', 'Actors': 'Yannick Bisson', 'Subtitles': 'English', 'Studio': 'Acorn', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Murdoch was my favorite series of late until this Season 11. They finally pushed it too far for me with violence. Sadly, I don't care to watch it anymore. It had been a series of romance and mystery that until now I enjoyed. Everyone has different limits.\nReview Title: Was my favorite\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Addams Family 2019\nReview Date: 2020/03/25\nStore: Oscar Isaac  (Actor),     Charlize Theron  (Actor),     Conrad Vernon  (Director, Producer),     Greg Tiernan  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Get ready to snap your fingers! The Addams Family is back in their first animated comedy about the kookiest family on the block. Funny, outlandish, and completely iconic, The Addams Family redefines what it means to be a good neighbor.', 'Bonus Content:', 'Deleted and Extended Scenes', 'Deleted and Extended Scenes', 'Charades with Thing', 'Charades with Thing', 'Life of a Scene', 'Life of a Scene', 'Welcome to the Family', 'Welcome to the Family', 'Addams Family Throwback', 'Addams Family Throwback', '\"\"Haunted Heart\"\" Lyric Video', '\"\"Haunted Heart\"\" Lyric Video', '\"\"My Family\"\" Lyric Video', '\"\"My Family\"\" Lyric Video', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'B07YMLDKJ3', 'Director': 'Conrad Vernon, Greg Tiernan', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 27 minutes', 'Release date': 'January 21, 2020', 'Actors': 'Oscar Isaac, Charlize Theron, Chloe Grace Moretz, Finn Wolfhard, Nick Kroll', 'Subtitles': 'Spanish, French', 'Producers': \"Gail Berman, Conrad Vernon, Alex Schwartz, Alison O'Brien\", 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This arrived as described in new condition, sealed. Super price, fun watch. Great!\nReview Title: Great movie!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Santa's Apprentice/Magic Snowflake Double Feature\nReview Date: 2020/12/21\nStore: Gabe Eggerling  (Actor),     Jean-Pierre Marielle  (Actor),     Luc Vinciguerra  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['SANTA\\'S APPRENTICE / MAGIC SNOWFLAKE - DVD - \"Santa\\'s Apprentice: Santa doesn\\'t want to retire, but rules are rules and he must train someone to replace him. The lucky winner, to be chosen from among millions of children, must be named Nicholas, be an orphan and have a pure heart. On the other side of the planet, there is a little boy who is a perfect match, but his lack of self-confidence and fear of heights make him a poor contestant. Will Santa agree to step down, and help his apprentice take his place? - \"The Magic Snowflake\": A young boy named Nicholas is about to become the next Santa Claus, but must first avoid a crisis that\\'s threatening the magic of Christmas before he can succeed in his new role.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family', 'Format': 'NTSC, Widescreen', 'Contributor': 'Vincent Grass, Gabe Eggerling, Julie Gayet, Max Cullen, Luc Vinciguerra, Jean-Pierre Marielle, Nathan SimonyVincent Grass, Gabe Eggerling, Julie Gayet, Max Cullen, Luc Vinciguerra, Jean-Pierre Marielle, Nathan Simony  See more', 'Language': 'English', 'Runtime': '2 hours and 24 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Audio Description': 'English', 'Director': 'Luc Vinciguerra', 'Media Format': 'NTSC, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Gabe Eggerling, Jean-Pierre Marielle, Julie Gayet, Max Cullen, Nathan Simony', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: These movies were on Netflix last year and we loved them. I'm so happy to see them for sale here. It looked like they wouldn't be in stock until January but we put in our order anyway, and yippie! this arrived already. This is such a fun story about Santa Clause and an orphan boy. It's very worth owning.\nReview Title: Wonderful Christmas stories\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/03/02\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'smoking'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Maxwell Atoms'], 'Producers': ['Maxwell Atoms'], 'Starring': ['Frank Welker', 'Grey DeLisle Griffin', 'Matthew Lillard'], 'Studio': ['WARNER BROS.']}\nReview Text: How can I say really bad in many ways? Don't bother. I am an old Scooby fan, own many movies plus the original series. This one takes a new direction with Daphne as \"hip\" that's bad and the voice of Velma is just annoying. The storyline is bad. How can you mess up Scooby? Well, they did.\nReview Title: TERRIBLE\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yogi's First Christmas (1980 TV Special)\nReview Date: 2021/12/13\nStore: Ray Patterson  (Director),     Daws Butler  (Actor),     Don Messick  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: [\"Yogi and Boo Boo usually snooze right through Christmas. (Hibernation, you know.) But this year, happy holiday music rouses them from their sleep and right into the fun: skating, skiing, singing and trimming the tree. But life isn't all mistletoe and eggnog. Two holiday grouches -- a mysterious hermit and the obnoxious nephew of Jellystone Lodge's owner -- are determined to ruin Christmas. And our two heroes, joined by Snagglepuss, Augie Doggie, Doggie Daddy, Huckleberry Hound and more Hanna-Barbera favorites, are just as determined to make December 25 the jolliest day of the year!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation/Holidays', 'Format': 'Full Screen, NTSC', 'Contributor': 'Janet Waldo, Ray Patterson, Marilyn Schreffler, Don Messick, Hal Smith, Daws Butler, John Stephenson', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'WARA22252DVD', 'Director': 'Ray Patterson', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'December 2, 2009', 'Actors': 'Daws Butler, Don Messick, Janet Waldo, John Stephenson, Marilyn Schreffler', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a very fun old Christmas Yogi movie, longer than I remembered. It's great fun for any age kids!\nReview Title: Great childhood memory\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Life And Adventures Of Santa Claus/Nestor The Christmas Donkey (Double Feature)\nReview Date: 2021/12/13\nStore: Earl Hammond  (Actor),     Earle Hyman  (Actor),     Jules Bass  (Director),     Arthur Rankin Jr.  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Timeless Holiday Favorites\nProduct Description: ['Product Description', \"The Wizard of Oz creator L. Frank Baum penned the story that inspired The Life and Adventures of Santa Claus. A babe born in the woods near the forest of Burzee is named Claus. As Claus grows up, the gods send him to the land of mortals to spread joy and happiness where there is none. Claus carves a small wooden cat for an orphan and decides that all children rich or poor should receive toys for Christmas. A long time ago the little donkey Nestor lives in a country stable. Mocked for his ears, Nestor and his mother are cast out of the stable. In the snowy cold, Nestor's mother sacrifices herself to protect her child. In the spring a cherub arrives to guide Nestor so he may save another as his mother saved him. Two travelers choose him for a trip to Bethlehem and Nestor the Long-Eared Christmas Donkey fulfills his destiny.\", 'Amazon.com', 'A bizarre, pagan take on the Santa Claus legend,', 'The Life and Adventures of Santa Claus', ', which is based on a story by L. Frank Baum (', 'The Wizard of Oz', '), was produced and directed by Rankin and Bass, the reigning kings of the Christmas special (', 'Rudolph the Red-Nosed Reindeer', '), using their brand of puppet animation. In the forest of Burzee, the immortals gather to discuss the fate of Santa Claus. Found when he was an abandoned baby by the Great Ak (a wizard with big wooden horns on his head), the boy was named Claus because that means \"little one\" in the language of the forest. Raised by immortals and knowing nothing but peace and harmony, the adolescent Claus is taken on a tour of the mortal world by the Great Ak, and he discovers the world is rife with misery and injustice. This is when he decides he will dedicate his life to making kids happy, and he learns the best way to do this is to give them toys. After years of service, the immortals must decide whether or not to give him eternal life. Indeed, this is a very strange Christmas tale.', '--Andy Spletzer', 'Nestor, The Long-Eared Christmas Donkey', \"is a wondrous story of Christ's birth told by an unlikely source: Nestor, a gentle donkey with incredibly long ears and a first-hand knowledge of life in a stable. This simple tale, which takes place in the days of the Roman Empire, is about a humble couple about to take a long journey to Bethlehem and a small, insignificant donkey who is destined to help them along. By all outward appearances, Nestor is undeserving of such a privilege. Stable animals tease him incessantly for his long appendages until, finally, he is cast out of the barn into the winter cold. Snow and ice bring about even greater calamity for Nestor until he receives a dose of divine goodness. Nestor meets Tilly, a heavenly cherub (voiced by Brenda Vaccaro) who imparts guidance to the despairing burro and tells him that soon he would be chosen to participate in a miracle involving a star and a baby, a lowly stable and some travelers named Mary and Joseph. Short and sweet, this stop-motion Christmas gem from Arthur Rankin Jr. and Jules Bass is narrated by Roger Miller. Get out the hanky for an understated holiday classic that will appeal to families of all ages.\", '--Lynn Gibson']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation/Holidays', 'Format': 'Full Screen, NTSC', 'Contributor': 'Jules Bass, Earle Hyman, Brenda Vacarro, Paul Frees, Roger Miller, Larry Kenney, Earl Hammond, Arthur Rankin Jr.Jules Bass, Earle Hyman, Brenda Vacarro, Paul Frees, Roger Miller, Larry Kenney, Earl Hammond, Arthur Rankin Jr.  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 14 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '883316222676', 'Director': 'Jules Bass, Arthur Rankin Jr.', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 14 minutes', 'Release date': 'December 2, 2009', 'Actors': 'Earl Hammond, Earle Hyman, Larry Kenney, Roger Miller, Brenda Vacarro', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a pretty awful old Christmas movie. The quality of the DVD is odd but it may just be my copy, in addition, this story is quite bad for a Santa story. Essentially, Santa is going to die unless he is granted immortality and that is clear in the movie. You might want to think that through with little kids.\nReview Title: Terrible movie\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Have Yourself A Goofy Little Christmas\nReview Date: 2021/12/13\nStore: Bill Farmer  (Actor),     Jim Cummings  (Actor)    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['\\'Tis the season to celebrate, so get set to deck the halls and HAVE YOURSELF A GOOFY LITTLE CHRISTMAS! Goofy always pulls out all the stops to make Christmas extra merry for his son Max. However, his over-the-top decorations usually end up shorting out the electricity on the entire block and wrecking his next-door neighbor Pete\\'s house! This year, hoping for some heavenly peace and quiet, Pete \"escapes\" to Asperin, Colorado, with his family. But Goofy and Max are close behind -- and that means Pete\\'s plans for a \"Silent Night\" are about to go up in smoke! Start your own family tradition and bring home this hilarious holiday classic on DVD. It\\'s festive fun overflowing with love and laughter for all ages!']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Rob Paulsen, Bill Farmer, Jim Cummings, Nancy Cartwright, Dana Hill, Frank Welker, April Winchell', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '24 minutes', 'Aspect Ratio': '1.33:1', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '12364200', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '24 minutes', 'Release date': 'January 13, 2015', 'Actors': 'Bill Farmer, Jim Cummings, Dana Hill, April Winchell, Rob Paulsen', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'WALT DISNEY ANIMATION', 'Number of discs': '1'}\nReview Text: This really fun Christmas movie with Goofy has a great story and pokes some fun at Montana! my home state. Love it! Great story with fun adventure, worth buying for all ages!\nReview Title: Excellent Christmas movie!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Magoo's Christmas Carol\nReview Date: 2022/01/17\nStore: Jim Backus  (Actor),     Abe Levitow  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: [\"Bah, Humbug, Mr. Magoo! This musical adaptation of the classic tale by Charles Dickens, stars Magoo as the cold-hearted old miser, Ebenezer Scrooge. Mr. Magoo's Christmas Carol™ was the first-ever animated holiday special created for television.\", 'Bonus Content:', 'From Pencil to Paint: Production Montage Slide Show', 'From Pencil to Paint: Production Montage Slide Show', 'Styne & Merril Song Demo', 'Styne & Merril Song Demo', \"Lord's Bright Blessing Storyboard Sequence\", \"Lord's Bright Blessing Storyboard Sequence\", 'Fezziwig Storyboard Sequence', 'Fezziwig Storyboard Sequence', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.55:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Abe Levitow', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '53 minutes', 'Release date': 'October 16, 2018', 'Actors': 'Jim Backus', 'Producers': 'Lee Orgel', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0)', 'Studio': 'Studio Distribution Services', 'Writers': 'Barbara Chain', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Ok I had remembered this as a bit funny, but I rewatched it and it was totally ridiculous and I didn't see any real humor. There is a few fumbles by Mr. Magoo, as per usual, but the rest is just the typical short version of a Christmas Carol. Bah humbug I say.\nReview Title: Dumb\nRating: 2.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe analyzed purchase history indicates a strong preference for animated family-friendly films, particularly those with a holiday theme and a sense of nostalgia. The individual consistently rates films highly when associated with well-known directors, like Tim Burton, or beloved franchises, especially Scooby-Doo, suggesting a strong attachment to childhood classics and animated comedies.\n\nPatterns reveal mixed sentiments toward holiday-themed products; while they appreciate nostalgic narratives, they express disappointment when the execution diverges from traditional portrayals, as seen with Christmas movies that take unconventional or alien perspectives. Price sensitivity reflects a willingness to invest in quality, as evidenced by the high ratings for items that deliver on expectations despite price variations.\n\nOverall, this person favors animation, particularly in holiday contexts, enjoys familiar character-driven stories, and values quality production. However, they show less tolerance for adaptations that fail to capture the essence of their beloved originals, indicating a critical engagement with nostalgia-driven media.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Love the Flintstones",
    "text": "This is a good set of shows, but not as a good as the old Flinstones collection that I cannot find anymore. This one has a second feature with a \"caveless\" kid that is a bit of a brat. Not much of a Christmas theme in my view. I prefer the older collection that had 6 shows in one by the Cartoon Network. Sadly, can't find it anywhere.",
    "images": [],
    "asin": "B0745N3RRK",
    "parent_asin": "B0745N3RRK",
    "user_id": "AGSV4K43Q6TIIHGN6BB2Q5A2I5PA",
    "timestamp": "2022-01-17 02:36:07.745000",
    "helpful_vote": 3,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Hanna-Barbera Holiday Triple Feature [DVD]",
    "average_rating": 4.8,
    "rating_number": 409,
    "features": [],
    "description": [
      "Hanna-Barbera Holiday Triple Feature",
      "]]>"
    ],
    "price": 8.33,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/61KMyb0fe2L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61KMyb0fe2L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81ZV6UhS5zL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51WnJAhi+cL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51WnJAhi+cL.jpg",
        "variant": "FRNT",
        "hi_res": "https://m.media-amazon.com/images/I/81+N2ChbDvL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51sQoOVVLzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51sQoOVVLzL.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/81uXHDhi9AL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Various  (Actor, Director)    Format: DVD",
    "categories": [
      "Movies & TV",
      "Movies"
    ],
    "details": {
      "Genre": "Kids & Family, Animation/Holidays",
      "Format": "NTSC, DVD",
      "Contributor": "Various",
      "Initial release date": "2017-10-03",
      "Language": "English",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 1.76 Ounces",
      "Item model number": "DH652603D",
      "Director": "Various",
      "Media Format": "NTSC, DVD",
      "Run time": "2 hours and 20 minutes",
      "Release date": "October 3, 2017",
      "Actors": "Various",
      "Dubbed": "English",
      "Studio": "Studio Distribution Services",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}