{
  "user_id": "AGJOKZFVJ665TS2NJFP46AJQJL3Q",
  "summary": "=== Purchase Information ===\nReview Date: 2011/07/30\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Toby Haynes'], 'Producers': ['Sanne Wohlenberg', 'Steven Moffat', 'Piers Wenger', 'Beth Willis'], 'Starring': ['Matt Smith', 'Karen Gillan', 'Arthur Darvill'], 'Studio': ['BBC America']}\nReview Text: Always enjoy the Doctor Who Christmas specials unfortunately don't have BBC America.<br />Thanks to Amazon I can still keep up.\nReview Title: Love the Doctor\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bourne Trilogy (The Bourne Identity / The Bourne Supremacy / The Bourne Ultimatum)\nReview Date: 2013/01/13\nStore: Matt Damon  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: [\"Get ready for non-stop action, edge-of-your-seat suspense and spectacular chase sequences with everyone's favorite assassin in The Bourne Trilogy! Matt Damon is Jason Bourne, an elite government agent determined to outwit and outmaneuver anyone who stands in the way of his finding out the secrets of his mysterious past. Follow his explosive, action-packed adventures in three blockbuster films from one of the most popular series of all time: The Bourne Identity, The Bourne Supremacy and The Bourne Ultimatum. Loaded with hours of bonus features, The Bourne Trilogy is the complete Bourne experience for movie fans everywhere!\", 'Bonus Content:', 'Disc 1 - The Bourne Identity:', 'Alternate Opening and Alternate Ending', 'Alternate Opening and Alternate Ending', 'The Bourne Mastermind: Robert Ludlum', 'The Bourne Mastermind: Robert Ludlum', 'Access Granted: An Interview with Screenwriter Tony Gilroy', 'Access Granted: An Interview with Screenwriter Tony Gilroy', 'From Identity to Supremacy: Jason & Marie', 'From Identity to Supremacy: Jason & Marie', 'The Bourne Diagnosis', 'The Bourne Diagnosis', 'Cloak and Dagger: Covert Ops', 'Cloak and Dagger: Covert Ops', 'The Speed of Sound', 'The Speed of Sound', 'Declassified Information', 'Declassified Information', 'Inside a Fight Sequence', 'Inside a Fight Sequence', 'Moby \"Extreme Ways\" Music Video', 'Moby \"Extreme Ways\" Music Video', 'Feature Commentary with Director Doug Liman', 'Feature Commentary with Director Doug Liman', 'Disc 2 - The Bourne Supremacy:', 'Explosive Deleted Scenes', 'Explosive Deleted Scenes', 'Matching Identities: Casting', 'Matching Identities: Casting', 'Keeping It Real', 'Keeping It Real', 'Blowing Things Up', 'Blowing Things Up', 'On the Move with Jason Bourne', 'On the Move with Jason Bourne', 'Bourne to be Wild: Fight Training', 'Bourne to be Wild: Fight Training', 'Crash Cam: Racing Through the Streets of Moscow', 'Crash Cam: Racing Through the Streets of Moscow', 'The Go-Mobile Revs up the Action', 'The Go-Mobile Revs up the Action', 'Anatomy of a Scene: The Explosive Bridge Chase Scene', 'Anatomy of a Scene: The Explosive Bridge Chase Scene', 'Scoring with John Powell', 'Scoring with John Powell', 'Feature Commentary with Director Paul Greengrass', 'Feature Commentary with Director Paul Greengrass', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Disc 3 - The Bourne Ultimatum:', 'Deleted Scenes', 'Deleted Scenes', 'Man on the Move: Jason Bourne', 'Man on the Move: Jason Bourne', 'Rooftop Pursuit', 'Rooftop Pursuit', 'Planning the Punches', 'Planning the Punches', 'Driving School', 'Driving School', 'New York Chase', 'New York Chase', 'Feature Commentary with Director Paul Greengrass', 'Feature Commentary with Director Paul Greengrass', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & AdventureDrama, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & Adventure  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Matt Damon', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 44 minutes', 'Aspect Ratio': '2.35:1, 2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 44 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Matt Damon', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: Bought this as a Christmas present. Three in One  Bourne what's not to like.<br />My Brother in law loved it\nReview Title: Three in One\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Adventure Time: Season 1\nReview Date: 2013/01/13\nStore: Jeremy Shada  (Actor),     John DiMaggio  (Actor),     Larry Leichliter  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Cartoon Network: Adventure Time The Complete First Season', \"What time is it? It’s time for Adventure Time: The Complete First SeasonDVD. The Cartoon Network's Number 1 hit comedy show and Emmy® nominated seriesthat centers on the post apocalyptic adventures of Finn, a human boywith a funny hat, and his friend Jake, a magic and mischievous dog. TheDVD includes all 26 episodes from season 1 and tons of special featuresdone by the creator. The Adventure Time: The Complete First Season DVDis packaged with a collectible slipcover and a must have for anyAdventure Time Fan!\", ']]>', 'Amazon.com', 'A genuinely inspired amalgamation of fantasy tropes liberally frosted with absurd humor, the animated series', 'Adventure Time', 'is a charmingly cracked confection that deserves its devoted cult following. Set in a faraway kingdom called Ooo, the series follows the caffeinated adventures of Finn the Human (Jeremy Shada) and his bespectacled talking dog Jake (John DiMaggio,', 'Futurama', ') as they thwart the misunderstood but mostly evil Ice King (Tom Kenny,', 'SpongeBob SquarePants', ') from his regular attempts to kidnap Princess Bubblegum (Hynden Walch,', 'Teen Titans', '). Aiding them in their escapades are the bass-playing Vampire Queen (Olivia Olson,', 'Phineas and Ferb', '), petulant extraterrestrial Lumpy Space Princess (voiced by series creator Pendleton Ward), and Beemo (Niki Yang), a sentient but playable video game console. The 26 mini-episodes that comprise the show\\'s first season pit the heroes against a dizzying array of oddities, including candy zombies in \"Slumber Party Panic,\" a pie-throwing robot (Andy Milonakis), and \"Ricardio the Heart Guy,\" a living heart suavely voiced by George Takei. But more often than not, the characters\\' own personal issues make for the most inspired moments, most notably in \"When Wedding Bells Thaw,\" where Finn and Jake try to encourage the Ice King to give up his princess-kidnapping pursuits by throwing him a bachelor party.', 'That blend of grownup, self-aware humor and childlike silliness can be difficult to balance, but', 'Adventure Time', 'frequently succeeds, thanks in part to the epic sprawl of its universe, which provides a sizable canvas that preserves the tone of the series while maintaining a never-ending supply of weird and wonderful encounters. It is unquestionably an acquired taste, but it\\'s also a sweetly offbeat series and an awful lot of fun. The two-disc set includes a healthy selection of extras, most notably commentary tracks on four episodes, including \"Tree Trunks,\" which features some amusing anecdotes from Ward\\'s mother and family friend Polly Lou Livingston, who also provide voices in the episode. The three featurettes are a mixed bag:', 'A Behind-the-Scenes Featurette', 'is a surreal barrage of sight gags filmed in the', 'Adventure Time', 'production offices by Ward with his phone, while the', 'Behind the Scenes of the Behind the Scenes', 'gets even sillier. A 10-minute talk with the show\\'s music editors takes an equally left-of-center approach, though the nearly hour-long collection of animatics and a two-minute episode called \"The Wand\" are fairly straightforward. The only true letdown is the lack of a Blu-ray presentation, which would accurately preserve the show\\'s HD broadcast quality.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Animation/General', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'John DiMaggio, Larry Leichliter, Hyden Walch, Tom Kenny, Jeremy Shada', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '26155659', 'Director': 'Larry Leichliter', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '4 hours and 46 minutes', 'Release date': 'July 10, 2012', 'Actors': 'Jeremy Shada, John DiMaggio, Hyden Walch, Tom Kenny', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nReview Text: Not sure how to rate it. My Niece loves it. I bought it for her for Christmas. She is 7 adn this was on her list..\nReview Title: For my Niece\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Father Dowling Mysteries: Season 1\nReview Date: 2013/01/13\nStore: James Stephens  (Actor),     Tom Bosley  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['An amiable, inquisitive Chicago priest moonlights as a detective and is assisted by a rather worldly, lock-picking nun.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Mary Wickes, Tom Bosley, Tracy Nelson, James Stephens', 'Language': 'English', 'Runtime': '7 hours and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Item model number': '24178673', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled', 'Run time': '7 hours and 54 minutes', 'Release date': 'December 19, 2017', 'Actors': 'James Stephens, Tom Bosley, Tracy Nelson, Mary Wickes', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: I have been waiting for years for this to come out on DVD. So glad it did. This was my Aunts favorite show back in the day. I bought this for her for her Birthday.\nReview Title: Finally\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/02/27\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton']}\nReview Text: Falling Skies is good science fiction. One of the best new series out there.<br />I can catch up on Amazon when I miss it.\nReview Title: I like this series\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/04/22\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nelson McCormick', 'Milan Cheylov', 'Michael Waxman', 'Adam Kane', 'Stephen Williams', 'Greg Beeman', 'Jon Cassar', 'Tucker Gates', 'Gwyneth Horder-Payton', 'Francis Lawrence'], 'Studio': ['FOX']}\nReview Text: One of the best shows on TV. Certainly the best Fox ever had.<br />Miss the series. The first season was probably the best. It set the tone for all the rest of the seasons.<br />Action packed beginning to end. Unexpected twists and turns kept you on the edge of your seat\nReview Title: Miss this show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: iCarly: Season 1, Vol. 2\nReview Date: 2015/01/06\nStore: Miranda Cosgrove  (Actor),     Jennette McCurdy  (Actor),     Adam Weissman  (Director),     David Kendall  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Annamarie Kenoyer, Noah Munck, Vince Deadrick Jr., Russ Reinsel, Adam Weissman, Arthur Gradstein, Steve Hoefer, Mitchell Abbott, Gary Pease, Roger Christiansen, Andrew Hill Newman, Jessica Jann, Carla Jeffery, Charlie Patton, Jennette McCurdy, Jerry Trainor, David Kendall, Miranda Cosgrove, Dan Schneider, Nathan KressAnnamarie Kenoyer, Noah Munck, Vince Deadrick Jr., Russ Reinsel, Adam Weissman, Arthur Gradstein, Steve Hoefer, Mitchell Abbott, Gary Pease, Roger Christiansen, Andrew Hill Newman, Jessica Jann, Carla Jeffery, Charlie Patton, Jennette McCurdy, Jerry Trainor, Davi…   See more', 'Language': 'English', 'Number Of Discs': '2'}\nReview Text: I bought it for my Niece. She was very pleased.<br />I was glad to find this for her and it arrived on time and was a good price so I bought both volumes\nReview Title: She was very pleased. I was glad to find this for her ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: iCarly: Season 1, Vol. 1\nReview Date: 2015/01/06\nStore: Miranda Cosgrove  (Actor),     Jennette McCurdy  (Actor),     Adam Weissman  (Director),     David Kendall  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: ['Product Description', 'In the spirit of Wayne\\'s World; Carly and her best friend Samantha \"Sam\" Puckett turn a boring school assignment into a fun; creative and hilarious web-show. When their friend Freddie accidentally leaks a video of their antics on the web; Carly; and average 13-year-old girl; becomes an unlikely online celebrity. Embracing her popularity; Carly convinces Sam; her co-host and comedic sidekick; and Freddie; their technical producer; to turn \"iCarly\" into a weekly show: where they can finally do and say whatever they want! iCarly is a convergent entertainment experience that unites the TV screen and the web for kids. Throughout the show; Carly will encourage viewers to post their own originally created content relating to the context of each show. Solicited content may become part of a future iCarly episode; or included in Carly\\'s online webcast; making iCarly the first scripted show on all of TV to incorporate original kid-created content.', 'Amazon.com', 'iCarly', \"is an appealing tween sitcom that marries television with web programming and offers viewers a chance to submit their own content for possible inclusion in future episodes. When Carly gets in trouble at school for posting an unflattering flyer of her teacher, her punishment is to record the school talent show auditions and post them online. As it turns out, Carly is innocent and was just covering for her best friend Sam, who really posted the flyer, so it's only fair that Sam join her in her punishment. Freddie, who has a huge crush on Carly and just happens to be a tech wizard, also decides to join them and help tape the auditions. The somewhat painful experience inspires the three teens to wish for an opportunity to produce their own show and determine their own programming--an idea that soon blossoms into a plan for a weekly web show. Since Carly's dad is stationed overseas in Europe, her 26-year-old brother Spencer, who's a rather unconventional artist and an even flakier authority figure, is in charge and he gives them the go-ahead. Soon the three teens are regularly hanging out in Carly and Spencer's apartment, eating everything in sight, producing their weekly web show, and gawking at whatever unusual sculpture Spencer happens to be working on at the moment. Things are never dull as Carly and her friends work to increase viewership. They pursue a write-up on an influential Internet site run by a very unusual tyrant, broadcast from a haunted apartment on Halloween, pay back a mean teacher by making a fool of her online, and set a world record for the longest continuous webcast. And then there's all the usual high school drama, like figuring out who to date, what to do for a science project, and how to get good grades--by any means. Real teens are invited to share their special talents on icarly.com, and some of the submissions will be included in future\", 'iCarly', \"episodes. Like most teens' lives,\", 'iCarly', 'is full of energy, humor, and lots of craziness. (Ages 7-13)', '--Tami Horiuchi']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': \"Russ Reinsel, Dan D'Amicol, Arthur Gradstein, Adam Weissman, Steve Hoefer, Roger Christiansen, Andrew Hill Newman, Dakota Floeter, Chris Flanders, Rachel G. Fox, Jennette McCurdy, Jerry Trainor, Jake Farrow, David Kendall, Miranda Cosgrove, Christine Fazzino, Dan Schneider, Bruce Dworkin, Nathan KressRuss Reinsel, Dan D'Amicol, Arthur Gradstein, Adam Weissman, Steve Hoefer, Roger Christiansen, Andrew Hill Newman, Dakota Floeter, Chris Flanders, Rachel G. Fox, Jennette McCurdy, Jerry Trainor, Jake Farrow, David Kendall, Miranda Cosgrove, Christine Fazzino, Da…  See more\", 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '2', 'Runtime': '5 hours and 11 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 6.17 x 6.85 inches; 3.2 Ounces', 'Item model number': '170606', 'Director': 'Adam Weissman, David Kendall, Roger Christiansen, Russ Reinsel, Steve Hoefer', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '5 hours and 11 minutes', 'Release date': 'September 23, 2008', 'Actors': \"Miranda Cosgrove, Jennette McCurdy, Nathan Kress, Jerry Trainor, Dan D'Amicol\", 'Studio': 'Nickelodeon', 'Writers': 'Andrew Hill Newman, Arthur Gradstein, Dan Schneider', 'Number of discs': '2'}\nReview Text: My Niece was so happy to get this fro Christmas I bought both volumes of season 1\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scrooge\nReview Date: 2015/05/18\nStore: Sir Alec Guiness  (Actor),     Albert Finney  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Musicals\nProduct Description: ['Scrooge was designed as a follow-up to 1968\\'s Oliver, the Oscar-winning musicalization of Charles Dickens\\' Oliver Twist. The umpteenth musical version of Dickens\\' 1843 novelette A Christmas Carol, Scrooge is blessed with several sprightly Leslie Bricusse songs, including the bonafide hit Thank You Very Much. Once more buried under mounds of latex, Albert Finney is perfection itself as Ebeneezer Scrooge, proving as effective as a young (un-made up) man as the old skinflint we\\'ve grown to love. The Three Ghosts who turn the miserly Scrooge\\'s life around on Christmas Eve are portrayed by Edith Evans (Past), Kenneth More (Present) and Paddy Stone (Yet to Come). Our favorite among the huge, predominantly British supporting cast is Sir Alec Guinness as a fussy, slightly effeminate Marley\\'s Ghost. Best of all, Finney performs his many songs \"live\" and not lip-synched to a pre-recording. Though it is overproduced to the hilt, and its Technicolor photography tends to induce eyestrain, Scrooge is more than satisfactory Yuletide entertainment.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Albert Finney, Sir Alec Guiness', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.05 Ounces', 'Item model number': '2517', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Sir Alec Guiness, Albert Finney', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My favorite Scrooge as a musical\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Carol\nReview Date: 2015/05/18\nStore: Alastair Sim  (Actor),     Hermione Baddely  (Actor),     Brian Desmond Hurst  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Alastair Sim\\'s tour-de-force performance as the ultimate miser, Ebenezer Scrooge, has almost single-handedly made this beloved version of Charles Dickens\\' story into one of the best-loved Christmas films of all time. Some of Britain\\'s best filmmakers united behind Sim, who was joined by a delightful cast of accomplished and acclaimed English actors; creating what many today believe to be the best and most faithful production of Dickens\\' immortal tale. Cranky and curmudgeonly Scrooge learns the error of his unkind ways and is taught the true meaning of the holidays when he is visited by the ghost of his late business partner and the spirits of Christmas past, present and future. Special Features: Commentaries by Marcus Hearn and George Cole; Introduction by Leonard Maltin; \"Dead to Begin With: The Darker Side of A Classic\"- Explores the movies bleaker themes and how they rivaled London of the 1950\\'s - features film historian and culturalist Sir Christopher Frayling; \"Scrooge by Another Name: Distributing \\'A Christmas Carol\\'\" - Details the American release of this British holiday classic as told by distributor Richard Gordon; \"The Human Blarney Stone: Life and Times of Brian Desmond Hurst\"; \"The Alastair Sim Version: Too Good To Be Shown Only At Christmastime - video narrative by Fred Guida, author of \\'A Christmas Carol and It\\'s Adaptations\\'; and A collection of early silent versions of Dickens on film.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '25752733', 'Director': 'Brian Desmond Hurst', 'Media Format': 'Multiple Formats, AC-3, Dolby, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Alastair Sim, Hermione Baddely, Kathleen Harrison, Mervyn Johns, George Cole', 'Subtitles': 'English, Spanish', 'Studio': 'Vci Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Old classic that is not on TV anymore\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Enchanted April\nReview Date: 2017/08/12\nStore: Josie Lawrence  (Actor),     Miranda Richardson  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Two proper Englishwomen, determined to get away from their drab lives and innatentive husbands, find paradise in the serene countryside of the Italian Riviera in this enchanting adventure starring Josie Lawrence and Miranda Richardson. When the pair rent a magnificent villa for a month, they share expenses with two unlikely companions- an austere widow and a bored socialite. At first, personalities clash, but the hideaway holds a special magic that soon sparks friendships and reminds the women of ways to live and love that have long eluded them. Stellar performances and breathtaking scenery make the Academy Award nominated', 'Enchanted April', \"a captivating delight for everyone who's ever dreamed of taking the perfect holiday!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Polly Walker, Joan Plowright, Alfred Molina, Jim Broadbent, Josie Lawrence, Miranda Richardson', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '30446', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'April 26, 2011', 'Actors': 'Josie Lawrence, Miranda Richardson, Polly Walker, Joan Plowright, Alfred Molina', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: On of my favorite movies\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hans Brinker, Or The Silver Skates\nReview Date: 2018/05/04\nStore: Rony Zeaner  (Actor),     Carin Rossby  (Actor),     Norman Foster  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: [\"There's magic in the memories as great Disney moments are captured right here for you and your family to enjoy. Disney brings to life this classic story based on Mary Mapes Dodge's beloved children's novel. Set in 1860's Holland along the famed Zeider Zee -- young Hans Brinker finds himself responsible for supporting his family after his father becomes injured in an accident. He and his sister Gretel travel to Amsterdam in search of funds to help pay for their father's operation. Their only hope lies in the city's annual ice skating race, where Hans must face off against his arch rival Ludwig Schimmel in the hopes of winning the prize money. Don't miss the heart-pounding race to the finish in this tale of courage and a family's determination to survive that will have everyone cheering!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Contributor': 'Mary Mapes Dodge, Norman Foster, Inga Landgre, Rony Zeaner, Gunilla Jelf, Erik Strandmark, Carin RossbyMary Mapes Dodge, Norman Foster, Inga Landgre, Rony Zeaner, Gunilla Jelf, Erik Strandmark, Carin Rossby   See more', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': 'WD03536900DVD', 'Director': 'Norman Foster', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 7, 2004', 'Actors': 'Rony Zeaner, Carin Rossby, Gunilla Jelf, Erik Strandmark, Inga Landgre', 'Subtitles': 'French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Norman Foster, Mary Mapes Dodge', 'Number of discs': '1'}\nReview Text: Great story remember it from my childhood\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The House Without a Christmas Tree\nReview Date: 2018/05/04\nStore: Jason Robards  (Actor),     Mildred Natwick  (Actor),     Paul Bogart  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Paramount', 'Color': 'Color', 'Item Weight': '1.69 Ounces', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Recording Capacity': '75 minutes'}\nReview Text: Loved this play. I remember watching it on TV at Christmas but then it went off.<br />So glad to find it\nReview Title: Loved this play\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SWEATIN TO THE OLDIES 5\nReview Date: 2018/05/04\nStore: RICHARD SIMMONS  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: [\"With over 2.3 million units of SWEATIN' TO THE OLDIES sold since 2008, Richard Simmons has reclaimed his crown as the King of Fitness. Time Life is proud to present Richard's all new aerobic workout: SWEATIN' TO THE OLDIES 5! Recently filmed in California, Richard uses get-up-and-move music from the 1960s as the backdrop to his signature formula: energizing songs, easy dance moves, real people and lots of fun! Based on the winning formula in his multi-platinum SWEATIN' series, SWEATIN' 5 features the same quality workouts fans expect, complete with Richard's unique encouragement and sassy style.\"]\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6428883', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '55 minutes', 'Release date': 'December 14, 2010', 'Actors': 'RICHARD SIMMONS', 'Studio': 'Timelife', 'Number of discs': '1'}\nReview Text: I have the whole collection Really love this work out\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anita Renfroe: Purse-onality\nReview Date: 2019/11/10\nStore: Anita Renfroe  (Actor),     Renfroe  (Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['This newest comedy video from Anita Renfroe is filled with hilarious and touching insights into the lives of modern women. She riffs on family life, church life, fake tans, caffeine, eBay addiction, even mammograms and underwire , in an outstanding comedy event that is cheeky, high-energy and ultimately life-affirming.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Christian, Music Video & Concerts', 'Format': 'NTSC', 'Contributor': 'Renfroe, Anita Renfroe', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.57 x 5.96 x 7.5 inches; 3.2 Ounces', 'Item model number': '052190', 'Director': 'Renfroe', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 13, 2013', 'Actors': 'Anita Renfroe', 'Studio': 'Crown', 'Number of discs': '1'}\nReview Text: Really enjoyed it . Watched it with friends we laughed so hard.\nReview Title: Hilarious\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anita Renfroe: And I Mean That In The Best Possible Way\nReview Date: 2019/12/06\nStore: Anita Renfroe  (Actor),     Crown Entertainment  (Director)    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['This here DVD is like a personal permission slip to take a mental health break and laugh for awhile. So grab some friends, and some popcorn, and some chocolate, and take an hour for some comedy therapy. We all know you need it...and I mean that in the best possible way.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Topic - Religion', 'Format': 'NTSC', 'Contributor': 'Anita Renfroe, Crown Entertainment', 'Runtime': '1 hour and 20 minutes', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 3.2 Ounces', 'Item model number': '076338', 'Director': 'Crown Entertainment', 'Media Format': 'NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'November 3, 2015', 'Actors': 'Anita Renfroe', 'Studio': 'Crown Entertainment', 'Number of discs': '1'}\nReview Text: You will laugh. Enjoy this with friends the more the merrier\nReview Title: Laughter is medicine for the soul\nRating: 4.0\n--------------------------------------------------",
  "reference": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Toby Haynes'], 'Producers': ['Sanne Wohlenberg', 'Steven Moffat', 'Piers Wenger', 'Beth Willis'], 'Starring': ['Matt Smith', 'Karen Gillan', 'Arthur Darvill'], 'Studio': ['BBC America']}\nAlways enjoy the Doctor Who Christmas specials unfortunately don't have BBC America.<br />Thanks to Amazon I can still keep up.\nLove the Doctor\nThe Bourne Trilogy (The Bourne Identity / The Bourne Supremacy / The Bourne Ultimatum)\nMatt Damon  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n[\"Get ready for non-stop action, edge-of-your-seat suspense and spectacular chase sequences with everyone's favorite assassin in The Bourne Trilogy! Matt Damon is Jason Bourne, an elite government agent determined to outwit and outmaneuver anyone who stands in the way of his finding out the secrets of his mysterious past. Follow his explosive, action-packed adventures in three blockbuster films from one of the most popular series of all time: The Bourne Identity, The Bourne Supremacy and The Bourne Ultimatum. Loaded with hours of bonus features, The Bourne Trilogy is the complete Bourne experience for movie fans everywhere!\", 'Bonus Content:', 'Disc 1 - The Bourne Identity:', 'Alternate Opening and Alternate Ending', 'Alternate Opening and Alternate Ending', 'The Bourne Mastermind: Robert Ludlum', 'The Bourne Mastermind: Robert Ludlum', 'Access Granted: An Interview with Screenwriter Tony Gilroy', 'Access Granted: An Interview with Screenwriter Tony Gilroy', 'From Identity to Supremacy: Jason & Marie', 'From Identity to Supremacy: Jason & Marie', 'The Bourne Diagnosis', 'The Bourne Diagnosis', 'Cloak and Dagger: Covert Ops', 'Cloak and Dagger: Covert Ops', 'The Speed of Sound', 'The Speed of Sound', 'Declassified Information', 'Declassified Information', 'Inside a Fight Sequence', 'Inside a Fight Sequence', 'Moby \"Extreme Ways\" Music Video', 'Moby \"Extreme Ways\" Music Video', 'Feature Commentary with Director Doug Liman', 'Feature Commentary with Director Doug Liman', 'Disc 2 - The Bourne Supremacy:', 'Explosive Deleted Scenes', 'Explosive Deleted Scenes', 'Matching Identities: Casting', 'Matching Identities: Casting', 'Keeping It Real', 'Keeping It Real', 'Blowing Things Up', 'Blowing Things Up', 'On the Move with Jason Bourne', 'On the Move with Jason Bourne', 'Bourne to be Wild: Fight Training', 'Bourne to be Wild: Fight Training', 'Crash Cam: Racing Through the Streets of Moscow', 'Crash Cam: Racing Through the Streets of Moscow', 'The Go-Mobile Revs up the Action', 'The Go-Mobile Revs up the Action', 'Anatomy of a Scene: The Explosive Bridge Chase Scene', 'Anatomy of a Scene: The Explosive Bridge Chase Scene', 'Scoring with John Powell', 'Scoring with John Powell', 'Feature Commentary with Director Paul Greengrass', 'Feature Commentary with Director Paul Greengrass', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Disc 3 - The Bourne Ultimatum:', 'Deleted Scenes', 'Deleted Scenes', 'Man on the Move: Jason Bourne', 'Man on the Move: Jason Bourne', 'Rooftop Pursuit', 'Rooftop Pursuit', 'Planning the Punches', 'Planning the Punches', 'Driving School', 'Driving School', 'New York Chase', 'New York Chase', 'Feature Commentary with Director Paul Greengrass', 'Feature Commentary with Director Paul Greengrass', ']]>']\n{'Genre': 'Drama, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & AdventureDrama, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & Adventure  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Matt Damon', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 44 minutes', 'Aspect Ratio': '2.35:1, 2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 44 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Matt Damon', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nBought this as a Christmas present. Three in One  Bourne what's not to like.<br />My Brother in law loved it\nThree in One\nAdventure Time: Season 1\nJeremy Shada  (Actor),     John DiMaggio  (Actor),     Larry Leichliter  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Cartoon Network: Adventure Time The Complete First Season', \"What time is it? It’s time for Adventure Time: The Complete First SeasonDVD. The Cartoon Network's Number 1 hit comedy show and Emmy® nominated seriesthat centers on the post apocalyptic adventures of Finn, a human boywith a funny hat, and his friend Jake, a magic and mischievous dog. TheDVD includes all 26 episodes from season 1 and tons of special featuresdone by the creator. The Adventure Time: The Complete First Season DVDis packaged with a collectible slipcover and a must have for anyAdventure Time Fan!\", ']]>', 'Amazon.com', 'A genuinely inspired amalgamation of fantasy tropes liberally frosted with absurd humor, the animated series', 'Adventure Time', 'is a charmingly cracked confection that deserves its devoted cult following. Set in a faraway kingdom called Ooo, the series follows the caffeinated adventures of Finn the Human (Jeremy Shada) and his bespectacled talking dog Jake (John DiMaggio,', 'Futurama', ') as they thwart the misunderstood but mostly evil Ice King (Tom Kenny,', 'SpongeBob SquarePants', ') from his regular attempts to kidnap Princess Bubblegum (Hynden Walch,', 'Teen Titans', '). Aiding them in their escapades are the bass-playing Vampire Queen (Olivia Olson,', 'Phineas and Ferb', '), petulant extraterrestrial Lumpy Space Princess (voiced by series creator Pendleton Ward), and Beemo (Niki Yang), a sentient but playable video game console. The 26 mini-episodes that comprise the show\\'s first season pit the heroes against a dizzying array of oddities, including candy zombies in \"Slumber Party Panic,\" a pie-throwing robot (Andy Milonakis), and \"Ricardio the Heart Guy,\" a living heart suavely voiced by George Takei. But more often than not, the characters\\' own personal issues make for the most inspired moments, most notably in \"When Wedding Bells Thaw,\" where Finn and Jake try to encourage the Ice King to give up his princess-kidnapping pursuits by throwing him a bachelor party.', 'That blend of grownup, self-aware humor and childlike silliness can be difficult to balance, but', 'Adventure Time', 'frequently succeeds, thanks in part to the epic sprawl of its universe, which provides a sizable canvas that preserves the tone of the series while maintaining a never-ending supply of weird and wonderful encounters. It is unquestionably an acquired taste, but it\\'s also a sweetly offbeat series and an awful lot of fun. The two-disc set includes a healthy selection of extras, most notably commentary tracks on four episodes, including \"Tree Trunks,\" which features some amusing anecdotes from Ward\\'s mother and family friend Polly Lou Livingston, who also provide voices in the episode. The three featurettes are a mixed bag:', 'A Behind-the-Scenes Featurette', 'is a surreal barrage of sight gags filmed in the', 'Adventure Time', 'production offices by Ward with his phone, while the', 'Behind the Scenes of the Behind the Scenes', 'gets even sillier. A 10-minute talk with the show\\'s music editors takes an equally left-of-center approach, though the nearly hour-long collection of animatics and a two-minute episode called \"The Wand\" are fairly straightforward. The only true letdown is the lack of a Blu-ray presentation, which would accurately preserve the show\\'s HD broadcast quality.', '--Paul Gaita']\n{'Genre': 'Kids & Family, Animation/General', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'John DiMaggio, Larry Leichliter, Hyden Walch, Tom Kenny, Jeremy Shada', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '26155659', 'Director': 'Larry Leichliter', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '4 hours and 46 minutes', 'Release date': 'July 10, 2012', 'Actors': 'Jeremy Shada, John DiMaggio, Hyden Walch, Tom Kenny', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nNot sure how to rate it. My Niece loves it. I bought it for her for Christmas. She is 7 adn this was on her list..\nFor my Niece\nFather Dowling Mysteries: Season 1\nJames Stephens  (Actor),     Tom Bosley  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['An amiable, inquisitive Chicago priest moonlights as a detective and is assisted by a rather worldly, lock-picking nun.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Mary Wickes, Tom Bosley, Tracy Nelson, James Stephens', 'Language': 'English', 'Runtime': '7 hours and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Item model number': '24178673', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled', 'Run time': '7 hours and 54 minutes', 'Release date': 'December 19, 2017', 'Actors': 'James Stephens, Tom Bosley, Tracy Nelson, Mary Wickes', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '2'}\nI have been waiting for years for this to come out on DVD. So glad it did. This was my Aunts favorite show back in the day. I bought this for her for her Birthday.\nFinally\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton']}\nFalling Skies is good science fiction. One of the best new series out there.<br />I can catch up on Amazon when I miss it.\nI like this series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nelson McCormick', 'Milan Cheylov', 'Michael Waxman', 'Adam Kane', 'Stephen Williams', 'Greg Beeman', 'Jon Cassar', 'Tucker Gates', 'Gwyneth Horder-Payton', 'Francis Lawrence'], 'Studio': ['FOX']}\nOne of the best shows on TV. Certainly the best Fox ever had.<br />Miss the series. The first season was probably the best. It set the tone for all the rest of the seasons.<br />Action packed beginning to end. Unexpected twists and turns kept you on the edge of your seat\nMiss this show\niCarly: Season 1, Vol. 2\nMiranda Cosgrove  (Actor),     Jennette McCurdy  (Actor),     Adam Weissman  (Director),     David Kendall  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Annamarie Kenoyer, Noah Munck, Vince Deadrick Jr., Russ Reinsel, Adam Weissman, Arthur Gradstein, Steve Hoefer, Mitchell Abbott, Gary Pease, Roger Christiansen, Andrew Hill Newman, Jessica Jann, Carla Jeffery, Charlie Patton, Jennette McCurdy, Jerry Trainor, David Kendall, Miranda Cosgrove, Dan Schneider, Nathan KressAnnamarie Kenoyer, Noah Munck, Vince Deadrick Jr., Russ Reinsel, Adam Weissman, Arthur Gradstein, Steve Hoefer, Mitchell Abbott, Gary Pease, Roger Christiansen, Andrew Hill Newman, Jessica Jann, Carla Jeffery, Charlie Patton, Jennette McCurdy, Jerry Trainor, Davi…   See more', 'Language': 'English', 'Number Of Discs': '2'}\nI bought it for my Niece. She was very pleased.<br />I was glad to find this for her and it arrived on time and was a good price so I bought both volumes\nShe was very pleased. I was glad to find this for her ...\niCarly: Season 1, Vol. 1\nMiranda Cosgrove  (Actor),     Jennette McCurdy  (Actor),     Adam Weissman  (Director),     David Kendall  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, TV\n['Product Description', 'In the spirit of Wayne\\'s World; Carly and her best friend Samantha \"Sam\" Puckett turn a boring school assignment into a fun; creative and hilarious web-show. When their friend Freddie accidentally leaks a video of their antics on the web; Carly; and average 13-year-old girl; becomes an unlikely online celebrity. Embracing her popularity; Carly convinces Sam; her co-host and comedic sidekick; and Freddie; their technical producer; to turn \"iCarly\" into a weekly show: where they can finally do and say whatever they want! iCarly is a convergent entertainment experience that unites the TV screen and the web for kids. Throughout the show; Carly will encourage viewers to post their own originally created content relating to the context of each show. Solicited content may become part of a future iCarly episode; or included in Carly\\'s online webcast; making iCarly the first scripted show on all of TV to incorporate original kid-created content.', 'Amazon.com', 'iCarly', \"is an appealing tween sitcom that marries television with web programming and offers viewers a chance to submit their own content for possible inclusion in future episodes. When Carly gets in trouble at school for posting an unflattering flyer of her teacher, her punishment is to record the school talent show auditions and post them online. As it turns out, Carly is innocent and was just covering for her best friend Sam, who really posted the flyer, so it's only fair that Sam join her in her punishment. Freddie, who has a huge crush on Carly and just happens to be a tech wizard, also decides to join them and help tape the auditions. The somewhat painful experience inspires the three teens to wish for an opportunity to produce their own show and determine their own programming--an idea that soon blossoms into a plan for a weekly web show. Since Carly's dad is stationed overseas in Europe, her 26-year-old brother Spencer, who's a rather unconventional artist and an even flakier authority figure, is in charge and he gives them the go-ahead. Soon the three teens are regularly hanging out in Carly and Spencer's apartment, eating everything in sight, producing their weekly web show, and gawking at whatever unusual sculpture Spencer happens to be working on at the moment. Things are never dull as Carly and her friends work to increase viewership. They pursue a write-up on an influential Internet site run by a very unusual tyrant, broadcast from a haunted apartment on Halloween, pay back a mean teacher by making a fool of her online, and set a world record for the longest continuous webcast. And then there's all the usual high school drama, like figuring out who to date, what to do for a science project, and how to get good grades--by any means. Real teens are invited to share their special talents on icarly.com, and some of the submissions will be included in future\", 'iCarly', \"episodes. Like most teens' lives,\", 'iCarly', 'is full of energy, humor, and lots of craziness. (Ages 7-13)', '--Tami Horiuchi']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': \"Russ Reinsel, Dan D'Amicol, Arthur Gradstein, Adam Weissman, Steve Hoefer, Roger Christiansen, Andrew Hill Newman, Dakota Floeter, Chris Flanders, Rachel G. Fox, Jennette McCurdy, Jerry Trainor, Jake Farrow, David Kendall, Miranda Cosgrove, Christine Fazzino, Dan Schneider, Bruce Dworkin, Nathan KressRuss Reinsel, Dan D'Amicol, Arthur Gradstein, Adam Weissman, Steve Hoefer, Roger Christiansen, Andrew Hill Newman, Dakota Floeter, Chris Flanders, Rachel G. Fox, Jennette McCurdy, Jerry Trainor, Jake Farrow, David Kendall, Miranda Cosgrove, Christine Fazzino, Da…  See more\", 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '2', 'Runtime': '5 hours and 11 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 6.17 x 6.85 inches; 3.2 Ounces', 'Item model number': '170606', 'Director': 'Adam Weissman, David Kendall, Roger Christiansen, Russ Reinsel, Steve Hoefer', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '5 hours and 11 minutes', 'Release date': 'September 23, 2008', 'Actors': \"Miranda Cosgrove, Jennette McCurdy, Nathan Kress, Jerry Trainor, Dan D'Amicol\", 'Studio': 'Nickelodeon', 'Writers': 'Andrew Hill Newman, Arthur Gradstein, Dan Schneider', 'Number of discs': '2'}\nMy Niece was so happy to get this fro Christmas I bought both volumes of season 1\nFive Stars\nScrooge\nSir Alec Guiness  (Actor),     Albert Finney  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Musicals\n['Scrooge was designed as a follow-up to 1968\\'s Oliver, the Oscar-winning musicalization of Charles Dickens\\' Oliver Twist. The umpteenth musical version of Dickens\\' 1843 novelette A Christmas Carol, Scrooge is blessed with several sprightly Leslie Bricusse songs, including the bonafide hit Thank You Very Much. Once more buried under mounds of latex, Albert Finney is perfection itself as Ebeneezer Scrooge, proving as effective as a young (un-made up) man as the old skinflint we\\'ve grown to love. The Three Ghosts who turn the miserly Scrooge\\'s life around on Christmas Eve are portrayed by Edith Evans (Past), Kenneth More (Present) and Paddy Stone (Yet to Come). Our favorite among the huge, predominantly British supporting cast is Sir Alec Guinness as a fussy, slightly effeminate Marley\\'s Ghost. Best of all, Finney performs his many songs \"live\" and not lip-synched to a pre-recording. Though it is overproduced to the hilt, and its Technicolor photography tends to induce eyestrain, Scrooge is more than satisfactory Yuletide entertainment.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Albert Finney, Sir Alec Guiness', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.05 Ounces', 'Item model number': '2517', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Sir Alec Guiness, Albert Finney', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy favorite Scrooge as a musical\nFive Stars\nA Christmas Carol\nAlastair Sim  (Actor),     Hermione Baddely  (Actor),     Brian Desmond Hurst  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Alastair Sim\\'s tour-de-force performance as the ultimate miser, Ebenezer Scrooge, has almost single-handedly made this beloved version of Charles Dickens\\' story into one of the best-loved Christmas films of all time. Some of Britain\\'s best filmmakers united behind Sim, who was joined by a delightful cast of accomplished and acclaimed English actors; creating what many today believe to be the best and most faithful production of Dickens\\' immortal tale. Cranky and curmudgeonly Scrooge learns the error of his unkind ways and is taught the true meaning of the holidays when he is visited by the ghost of his late business partner and the spirits of Christmas past, present and future. Special Features: Commentaries by Marcus Hearn and George Cole; Introduction by Leonard Maltin; \"Dead to Begin With: The Darker Side of A Classic\"- Explores the movies bleaker themes and how they rivaled London of the 1950\\'s - features film historian and culturalist Sir Christopher Frayling; \"Scrooge by Another Name: Distributing \\'A Christmas Carol\\'\" - Details the American release of this British holiday classic as told by distributor Richard Gordon; \"The Human Blarney Stone: Life and Times of Brian Desmond Hurst\"; \"The Alastair Sim Version: Too Good To Be Shown Only At Christmastime - video narrative by Fred Guida, author of \\'A Christmas Carol and It\\'s Adaptations\\'; and A collection of early silent versions of Dickens on film.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '25752733', 'Director': 'Brian Desmond Hurst', 'Media Format': 'Multiple Formats, AC-3, Dolby, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Alastair Sim, Hermione Baddely, Kathleen Harrison, Mervyn Johns, George Cole', 'Subtitles': 'English, Spanish', 'Studio': 'Vci Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOld classic that is not on TV anymore\nFive Stars\nEnchanted April\nJosie Lawrence  (Actor),     Miranda Richardson  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Two proper Englishwomen, determined to get away from their drab lives and innatentive husbands, find paradise in the serene countryside of the Italian Riviera in this enchanting adventure starring Josie Lawrence and Miranda Richardson. When the pair rent a magnificent villa for a month, they share expenses with two unlikely companions- an austere widow and a bored socialite. At first, personalities clash, but the hideaway holds a special magic that soon sparks friendships and reminds the women of ways to live and love that have long eluded them. Stellar performances and breathtaking scenery make the Academy Award nominated', 'Enchanted April', \"a captivating delight for everyone who's ever dreamed of taking the perfect holiday!\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Polly Walker, Joan Plowright, Alfred Molina, Jim Broadbent, Josie Lawrence, Miranda Richardson', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '30446', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'April 26, 2011', 'Actors': 'Josie Lawrence, Miranda Richardson, Polly Walker, Joan Plowright, Alfred Molina', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nOn of my favorite movies\nFive Stars\nHans Brinker, Or The Silver Skates\nRony Zeaner  (Actor),     Carin Rossby  (Actor),     Norman Foster  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"There's magic in the memories as great Disney moments are captured right here for you and your family to enjoy. Disney brings to life this classic story based on Mary Mapes Dodge's beloved children's novel. Set in 1860's Holland along the famed Zeider Zee -- young Hans Brinker finds himself responsible for supporting his family after his father becomes injured in an accident. He and his sister Gretel travel to Amsterdam in search of funds to help pay for their father's operation. Their only hope lies in the city's annual ice skating race, where Hans must face off against his arch rival Ludwig Schimmel in the hopes of winning the prize money. Don't miss the heart-pounding race to the finish in this tale of courage and a family's determination to survive that will have everyone cheering!\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Contributor': 'Mary Mapes Dodge, Norman Foster, Inga Landgre, Rony Zeaner, Gunilla Jelf, Erik Strandmark, Carin RossbyMary Mapes Dodge, Norman Foster, Inga Landgre, Rony Zeaner, Gunilla Jelf, Erik Strandmark, Carin Rossby   See more', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': 'WD03536900DVD', 'Director': 'Norman Foster', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 7, 2004', 'Actors': 'Rony Zeaner, Carin Rossby, Gunilla Jelf, Erik Strandmark, Inga Landgre', 'Subtitles': 'French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Norman Foster, Mary Mapes Dodge', 'Number of discs': '1'}\nGreat story remember it from my childhood\nFour Stars\nThe House Without a Christmas Tree\nJason Robards  (Actor),     Mildred Natwick  (Actor),     Paul Bogart  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n{'Brand': 'Paramount', 'Color': 'Color', 'Item Weight': '1.69 Ounces', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Recording Capacity': '75 minutes'}\nLoved this play. I remember watching it on TV at Christmas but then it went off.<br />So glad to find it\nLoved this play\nSWEATIN TO THE OLDIES 5\nRICHARD SIMMONS  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n[\"With over 2.3 million units of SWEATIN' TO THE OLDIES sold since 2008, Richard Simmons has reclaimed his crown as the King of Fitness. Time Life is proud to present Richard's all new aerobic workout: SWEATIN' TO THE OLDIES 5! Recently filmed in California, Richard uses get-up-and-move music from the 1960s as the backdrop to his signature formula: energizing songs, easy dance moves, real people and lots of fun! Based on the winning formula in his multi-platinum SWEATIN' series, SWEATIN' 5 features the same quality workouts fans expect, complete with Richard's unique encouragement and sassy style.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6428883', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '55 minutes', 'Release date': 'December 14, 2010', 'Actors': 'RICHARD SIMMONS', 'Studio': 'Timelife', 'Number of discs': '1'}\nI have the whole collection Really love this work out\nFive Stars\nAnita Renfroe: Purse-onality\nAnita Renfroe  (Actor),     Renfroe  (Director)    Rated:    G    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['This newest comedy video from Anita Renfroe is filled with hilarious and touching insights into the lives of modern women. She riffs on family life, church life, fake tans, caffeine, eBay addiction, even mammograms and underwire , in an outstanding comedy event that is cheeky, high-energy and ultimately life-affirming.']\n{'Genre': 'Christian, Music Video & Concerts', 'Format': 'NTSC', 'Contributor': 'Renfroe, Anita Renfroe', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.57 x 5.96 x 7.5 inches; 3.2 Ounces', 'Item model number': '052190', 'Director': 'Renfroe', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 13, 2013', 'Actors': 'Anita Renfroe', 'Studio': 'Crown', 'Number of discs': '1'}\nReally enjoyed it . Watched it with friends we laughed so hard.\nHilarious\nAnita Renfroe: And I Mean That In The Best Possible Way\nAnita Renfroe  (Actor),     Crown Entertainment  (Director)    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['This here DVD is like a personal permission slip to take a mental health break and laugh for awhile. So grab some friends, and some popcorn, and some chocolate, and take an hour for some comedy therapy. We all know you need it...and I mean that in the best possible way.']\n{'Genre': 'Topic - Religion', 'Format': 'NTSC', 'Contributor': 'Anita Renfroe, Crown Entertainment', 'Runtime': '1 hour and 20 minutes', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 3.2 Ounces', 'Item model number': '076338', 'Director': 'Crown Entertainment', 'Media Format': 'NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'November 3, 2015', 'Actors': 'Anita Renfroe', 'Studio': 'Crown Entertainment', 'Number of discs': '1'}\nYou will laugh. Enjoy this with friends the more the merrier\nLaughter is medicine for the soul",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nReview Date: 2011/07/30\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Toby Haynes'], 'Producers': ['Sanne Wohlenberg', 'Steven Moffat', 'Piers Wenger', 'Beth Willis'], 'Starring': ['Matt Smith', 'Karen Gillan', 'Arthur Darvill'], 'Studio': ['BBC America']}\nReview Text: Always enjoy the Doctor Who Christmas specials unfortunately don't have BBC America.<br />Thanks to Amazon I can still keep up.\nReview Title: Love the Doctor\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bourne Trilogy (The Bourne Identity / The Bourne Supremacy / The Bourne Ultimatum)\nReview Date: 2013/01/13\nStore: Matt Damon  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: [\"Get ready for non-stop action, edge-of-your-seat suspense and spectacular chase sequences with everyone's favorite assassin in The Bourne Trilogy! Matt Damon is Jason Bourne, an elite government agent determined to outwit and outmaneuver anyone who stands in the way of his finding out the secrets of his mysterious past. Follow his explosive, action-packed adventures in three blockbuster films from one of the most popular series of all time: The Bourne Identity, The Bourne Supremacy and The Bourne Ultimatum. Loaded with hours of bonus features, The Bourne Trilogy is the complete Bourne experience for movie fans everywhere!\", 'Bonus Content:', 'Disc 1 - The Bourne Identity:', 'Alternate Opening and Alternate Ending', 'Alternate Opening and Alternate Ending', 'The Bourne Mastermind: Robert Ludlum', 'The Bourne Mastermind: Robert Ludlum', 'Access Granted: An Interview with Screenwriter Tony Gilroy', 'Access Granted: An Interview with Screenwriter Tony Gilroy', 'From Identity to Supremacy: Jason & Marie', 'From Identity to Supremacy: Jason & Marie', 'The Bourne Diagnosis', 'The Bourne Diagnosis', 'Cloak and Dagger: Covert Ops', 'Cloak and Dagger: Covert Ops', 'The Speed of Sound', 'The Speed of Sound', 'Declassified Information', 'Declassified Information', 'Inside a Fight Sequence', 'Inside a Fight Sequence', 'Moby \"Extreme Ways\" Music Video', 'Moby \"Extreme Ways\" Music Video', 'Feature Commentary with Director Doug Liman', 'Feature Commentary with Director Doug Liman', 'Disc 2 - The Bourne Supremacy:', 'Explosive Deleted Scenes', 'Explosive Deleted Scenes', 'Matching Identities: Casting', 'Matching Identities: Casting', 'Keeping It Real', 'Keeping It Real', 'Blowing Things Up', 'Blowing Things Up', 'On the Move with Jason Bourne', 'On the Move with Jason Bourne', 'Bourne to be Wild: Fight Training', 'Bourne to be Wild: Fight Training', 'Crash Cam: Racing Through the Streets of Moscow', 'Crash Cam: Racing Through the Streets of Moscow', 'The Go-Mobile Revs up the Action', 'The Go-Mobile Revs up the Action', 'Anatomy of a Scene: The Explosive Bridge Chase Scene', 'Anatomy of a Scene: The Explosive Bridge Chase Scene', 'Scoring with John Powell', 'Scoring with John Powell', 'Feature Commentary with Director Paul Greengrass', 'Feature Commentary with Director Paul Greengrass', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Disc 3 - The Bourne Ultimatum:', 'Deleted Scenes', 'Deleted Scenes', 'Man on the Move: Jason Bourne', 'Man on the Move: Jason Bourne', 'Rooftop Pursuit', 'Rooftop Pursuit', 'Planning the Punches', 'Planning the Punches', 'Driving School', 'Driving School', 'New York Chase', 'New York Chase', 'Feature Commentary with Director Paul Greengrass', 'Feature Commentary with Director Paul Greengrass', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & AdventureDrama, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & Adventure  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Matt Damon', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 44 minutes', 'Aspect Ratio': '2.35:1, 2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 44 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Matt Damon', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: Bought this as a Christmas present. Three in One  Bourne what's not to like.<br />My Brother in law loved it\nReview Title: Three in One\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Adventure Time: Season 1\nReview Date: 2013/01/13\nStore: Jeremy Shada  (Actor),     John DiMaggio  (Actor),     Larry Leichliter  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Cartoon Network: Adventure Time The Complete First Season', \"What time is it? It’s time for Adventure Time: The Complete First SeasonDVD. The Cartoon Network's Number 1 hit comedy show and Emmy® nominated seriesthat centers on the post apocalyptic adventures of Finn, a human boywith a funny hat, and his friend Jake, a magic and mischievous dog. TheDVD includes all 26 episodes from season 1 and tons of special featuresdone by the creator. The Adventure Time: The Complete First Season DVDis packaged with a collectible slipcover and a must have for anyAdventure Time Fan!\", ']]>', 'Amazon.com', 'A genuinely inspired amalgamation of fantasy tropes liberally frosted with absurd humor, the animated series', 'Adventure Time', 'is a charmingly cracked confection that deserves its devoted cult following. Set in a faraway kingdom called Ooo, the series follows the caffeinated adventures of Finn the Human (Jeremy Shada) and his bespectacled talking dog Jake (John DiMaggio,', 'Futurama', ') as they thwart the misunderstood but mostly evil Ice King (Tom Kenny,', 'SpongeBob SquarePants', ') from his regular attempts to kidnap Princess Bubblegum (Hynden Walch,', 'Teen Titans', '). Aiding them in their escapades are the bass-playing Vampire Queen (Olivia Olson,', 'Phineas and Ferb', '), petulant extraterrestrial Lumpy Space Princess (voiced by series creator Pendleton Ward), and Beemo (Niki Yang), a sentient but playable video game console. The 26 mini-episodes that comprise the show\\'s first season pit the heroes against a dizzying array of oddities, including candy zombies in \"Slumber Party Panic,\" a pie-throwing robot (Andy Milonakis), and \"Ricardio the Heart Guy,\" a living heart suavely voiced by George Takei. But more often than not, the characters\\' own personal issues make for the most inspired moments, most notably in \"When Wedding Bells Thaw,\" where Finn and Jake try to encourage the Ice King to give up his princess-kidnapping pursuits by throwing him a bachelor party.', 'That blend of grownup, self-aware humor and childlike silliness can be difficult to balance, but', 'Adventure Time', 'frequently succeeds, thanks in part to the epic sprawl of its universe, which provides a sizable canvas that preserves the tone of the series while maintaining a never-ending supply of weird and wonderful encounters. It is unquestionably an acquired taste, but it\\'s also a sweetly offbeat series and an awful lot of fun. The two-disc set includes a healthy selection of extras, most notably commentary tracks on four episodes, including \"Tree Trunks,\" which features some amusing anecdotes from Ward\\'s mother and family friend Polly Lou Livingston, who also provide voices in the episode. The three featurettes are a mixed bag:', 'A Behind-the-Scenes Featurette', 'is a surreal barrage of sight gags filmed in the', 'Adventure Time', 'production offices by Ward with his phone, while the', 'Behind the Scenes of the Behind the Scenes', 'gets even sillier. A 10-minute talk with the show\\'s music editors takes an equally left-of-center approach, though the nearly hour-long collection of animatics and a two-minute episode called \"The Wand\" are fairly straightforward. The only true letdown is the lack of a Blu-ray presentation, which would accurately preserve the show\\'s HD broadcast quality.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Animation/General', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'John DiMaggio, Larry Leichliter, Hyden Walch, Tom Kenny, Jeremy Shada', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '26155659', 'Director': 'Larry Leichliter', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '4 hours and 46 minutes', 'Release date': 'July 10, 2012', 'Actors': 'Jeremy Shada, John DiMaggio, Hyden Walch, Tom Kenny', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nReview Text: Not sure how to rate it. My Niece loves it. I bought it for her for Christmas. She is 7 adn this was on her list..\nReview Title: For my Niece\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Father Dowling Mysteries: Season 1\nReview Date: 2013/01/13\nStore: James Stephens  (Actor),     Tom Bosley  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['An amiable, inquisitive Chicago priest moonlights as a detective and is assisted by a rather worldly, lock-picking nun.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Mary Wickes, Tom Bosley, Tracy Nelson, James Stephens', 'Language': 'English', 'Runtime': '7 hours and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Item model number': '24178673', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled', 'Run time': '7 hours and 54 minutes', 'Release date': 'December 19, 2017', 'Actors': 'James Stephens, Tom Bosley, Tracy Nelson, Mary Wickes', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: I have been waiting for years for this to come out on DVD. So glad it did. This was my Aunts favorite show back in the day. I bought this for her for her Birthday.\nReview Title: Finally\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/02/27\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton']}\nReview Text: Falling Skies is good science fiction. One of the best new series out there.<br />I can catch up on Amazon when I miss it.\nReview Title: I like this series\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/04/22\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nelson McCormick', 'Milan Cheylov', 'Michael Waxman', 'Adam Kane', 'Stephen Williams', 'Greg Beeman', 'Jon Cassar', 'Tucker Gates', 'Gwyneth Horder-Payton', 'Francis Lawrence'], 'Studio': ['FOX']}\nReview Text: One of the best shows on TV. Certainly the best Fox ever had.<br />Miss the series. The first season was probably the best. It set the tone for all the rest of the seasons.<br />Action packed beginning to end. Unexpected twists and turns kept you on the edge of your seat\nReview Title: Miss this show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: iCarly: Season 1, Vol. 2\nReview Date: 2015/01/06\nStore: Miranda Cosgrove  (Actor),     Jennette McCurdy  (Actor),     Adam Weissman  (Director),     David Kendall  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Annamarie Kenoyer, Noah Munck, Vince Deadrick Jr., Russ Reinsel, Adam Weissman, Arthur Gradstein, Steve Hoefer, Mitchell Abbott, Gary Pease, Roger Christiansen, Andrew Hill Newman, Jessica Jann, Carla Jeffery, Charlie Patton, Jennette McCurdy, Jerry Trainor, David Kendall, Miranda Cosgrove, Dan Schneider, Nathan KressAnnamarie Kenoyer, Noah Munck, Vince Deadrick Jr., Russ Reinsel, Adam Weissman, Arthur Gradstein, Steve Hoefer, Mitchell Abbott, Gary Pease, Roger Christiansen, Andrew Hill Newman, Jessica Jann, Carla Jeffery, Charlie Patton, Jennette McCurdy, Jerry Trainor, Davi…   See more', 'Language': 'English', 'Number Of Discs': '2'}\nReview Text: I bought it for my Niece. She was very pleased.<br />I was glad to find this for her and it arrived on time and was a good price so I bought both volumes\nReview Title: She was very pleased. I was glad to find this for her ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: iCarly: Season 1, Vol. 1\nReview Date: 2015/01/06\nStore: Miranda Cosgrove  (Actor),     Jennette McCurdy  (Actor),     Adam Weissman  (Director),     David Kendall  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: ['Product Description', 'In the spirit of Wayne\\'s World; Carly and her best friend Samantha \"Sam\" Puckett turn a boring school assignment into a fun; creative and hilarious web-show. When their friend Freddie accidentally leaks a video of their antics on the web; Carly; and average 13-year-old girl; becomes an unlikely online celebrity. Embracing her popularity; Carly convinces Sam; her co-host and comedic sidekick; and Freddie; their technical producer; to turn \"iCarly\" into a weekly show: where they can finally do and say whatever they want! iCarly is a convergent entertainment experience that unites the TV screen and the web for kids. Throughout the show; Carly will encourage viewers to post their own originally created content relating to the context of each show. Solicited content may become part of a future iCarly episode; or included in Carly\\'s online webcast; making iCarly the first scripted show on all of TV to incorporate original kid-created content.', 'Amazon.com', 'iCarly', \"is an appealing tween sitcom that marries television with web programming and offers viewers a chance to submit their own content for possible inclusion in future episodes. When Carly gets in trouble at school for posting an unflattering flyer of her teacher, her punishment is to record the school talent show auditions and post them online. As it turns out, Carly is innocent and was just covering for her best friend Sam, who really posted the flyer, so it's only fair that Sam join her in her punishment. Freddie, who has a huge crush on Carly and just happens to be a tech wizard, also decides to join them and help tape the auditions. The somewhat painful experience inspires the three teens to wish for an opportunity to produce their own show and determine their own programming--an idea that soon blossoms into a plan for a weekly web show. Since Carly's dad is stationed overseas in Europe, her 26-year-old brother Spencer, who's a rather unconventional artist and an even flakier authority figure, is in charge and he gives them the go-ahead. Soon the three teens are regularly hanging out in Carly and Spencer's apartment, eating everything in sight, producing their weekly web show, and gawking at whatever unusual sculpture Spencer happens to be working on at the moment. Things are never dull as Carly and her friends work to increase viewership. They pursue a write-up on an influential Internet site run by a very unusual tyrant, broadcast from a haunted apartment on Halloween, pay back a mean teacher by making a fool of her online, and set a world record for the longest continuous webcast. And then there's all the usual high school drama, like figuring out who to date, what to do for a science project, and how to get good grades--by any means. Real teens are invited to share their special talents on icarly.com, and some of the submissions will be included in future\", 'iCarly', \"episodes. Like most teens' lives,\", 'iCarly', 'is full of energy, humor, and lots of craziness. (Ages 7-13)', '--Tami Horiuchi']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': \"Russ Reinsel, Dan D'Amicol, Arthur Gradstein, Adam Weissman, Steve Hoefer, Roger Christiansen, Andrew Hill Newman, Dakota Floeter, Chris Flanders, Rachel G. Fox, Jennette McCurdy, Jerry Trainor, Jake Farrow, David Kendall, Miranda Cosgrove, Christine Fazzino, Dan Schneider, Bruce Dworkin, Nathan KressRuss Reinsel, Dan D'Amicol, Arthur Gradstein, Adam Weissman, Steve Hoefer, Roger Christiansen, Andrew Hill Newman, Dakota Floeter, Chris Flanders, Rachel G. Fox, Jennette McCurdy, Jerry Trainor, Jake Farrow, David Kendall, Miranda Cosgrove, Christine Fazzino, Da…  See more\", 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '2', 'Runtime': '5 hours and 11 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 6.17 x 6.85 inches; 3.2 Ounces', 'Item model number': '170606', 'Director': 'Adam Weissman, David Kendall, Roger Christiansen, Russ Reinsel, Steve Hoefer', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '5 hours and 11 minutes', 'Release date': 'September 23, 2008', 'Actors': \"Miranda Cosgrove, Jennette McCurdy, Nathan Kress, Jerry Trainor, Dan D'Amicol\", 'Studio': 'Nickelodeon', 'Writers': 'Andrew Hill Newman, Arthur Gradstein, Dan Schneider', 'Number of discs': '2'}\nReview Text: My Niece was so happy to get this fro Christmas I bought both volumes of season 1\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scrooge\nReview Date: 2015/05/18\nStore: Sir Alec Guiness  (Actor),     Albert Finney  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Musicals\nProduct Description: ['Scrooge was designed as a follow-up to 1968\\'s Oliver, the Oscar-winning musicalization of Charles Dickens\\' Oliver Twist. The umpteenth musical version of Dickens\\' 1843 novelette A Christmas Carol, Scrooge is blessed with several sprightly Leslie Bricusse songs, including the bonafide hit Thank You Very Much. Once more buried under mounds of latex, Albert Finney is perfection itself as Ebeneezer Scrooge, proving as effective as a young (un-made up) man as the old skinflint we\\'ve grown to love. The Three Ghosts who turn the miserly Scrooge\\'s life around on Christmas Eve are portrayed by Edith Evans (Past), Kenneth More (Present) and Paddy Stone (Yet to Come). Our favorite among the huge, predominantly British supporting cast is Sir Alec Guinness as a fussy, slightly effeminate Marley\\'s Ghost. Best of all, Finney performs his many songs \"live\" and not lip-synched to a pre-recording. Though it is overproduced to the hilt, and its Technicolor photography tends to induce eyestrain, Scrooge is more than satisfactory Yuletide entertainment.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Albert Finney, Sir Alec Guiness', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.05 Ounces', 'Item model number': '2517', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Sir Alec Guiness, Albert Finney', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My favorite Scrooge as a musical\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Carol\nReview Date: 2015/05/18\nStore: Alastair Sim  (Actor),     Hermione Baddely  (Actor),     Brian Desmond Hurst  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Alastair Sim\\'s tour-de-force performance as the ultimate miser, Ebenezer Scrooge, has almost single-handedly made this beloved version of Charles Dickens\\' story into one of the best-loved Christmas films of all time. Some of Britain\\'s best filmmakers united behind Sim, who was joined by a delightful cast of accomplished and acclaimed English actors; creating what many today believe to be the best and most faithful production of Dickens\\' immortal tale. Cranky and curmudgeonly Scrooge learns the error of his unkind ways and is taught the true meaning of the holidays when he is visited by the ghost of his late business partner and the spirits of Christmas past, present and future. Special Features: Commentaries by Marcus Hearn and George Cole; Introduction by Leonard Maltin; \"Dead to Begin With: The Darker Side of A Classic\"- Explores the movies bleaker themes and how they rivaled London of the 1950\\'s - features film historian and culturalist Sir Christopher Frayling; \"Scrooge by Another Name: Distributing \\'A Christmas Carol\\'\" - Details the American release of this British holiday classic as told by distributor Richard Gordon; \"The Human Blarney Stone: Life and Times of Brian Desmond Hurst\"; \"The Alastair Sim Version: Too Good To Be Shown Only At Christmastime - video narrative by Fred Guida, author of \\'A Christmas Carol and It\\'s Adaptations\\'; and A collection of early silent versions of Dickens on film.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '25752733', 'Director': 'Brian Desmond Hurst', 'Media Format': 'Multiple Formats, AC-3, Dolby, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Alastair Sim, Hermione Baddely, Kathleen Harrison, Mervyn Johns, George Cole', 'Subtitles': 'English, Spanish', 'Studio': 'Vci Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Old classic that is not on TV anymore\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Enchanted April\nReview Date: 2017/08/12\nStore: Josie Lawrence  (Actor),     Miranda Richardson  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Two proper Englishwomen, determined to get away from their drab lives and innatentive husbands, find paradise in the serene countryside of the Italian Riviera in this enchanting adventure starring Josie Lawrence and Miranda Richardson. When the pair rent a magnificent villa for a month, they share expenses with two unlikely companions- an austere widow and a bored socialite. At first, personalities clash, but the hideaway holds a special magic that soon sparks friendships and reminds the women of ways to live and love that have long eluded them. Stellar performances and breathtaking scenery make the Academy Award nominated', 'Enchanted April', \"a captivating delight for everyone who's ever dreamed of taking the perfect holiday!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Polly Walker, Joan Plowright, Alfred Molina, Jim Broadbent, Josie Lawrence, Miranda Richardson', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '30446', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'April 26, 2011', 'Actors': 'Josie Lawrence, Miranda Richardson, Polly Walker, Joan Plowright, Alfred Molina', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: On of my favorite movies\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hans Brinker, Or The Silver Skates\nReview Date: 2018/05/04\nStore: Rony Zeaner  (Actor),     Carin Rossby  (Actor),     Norman Foster  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: [\"There's magic in the memories as great Disney moments are captured right here for you and your family to enjoy. Disney brings to life this classic story based on Mary Mapes Dodge's beloved children's novel. Set in 1860's Holland along the famed Zeider Zee -- young Hans Brinker finds himself responsible for supporting his family after his father becomes injured in an accident. He and his sister Gretel travel to Amsterdam in search of funds to help pay for their father's operation. Their only hope lies in the city's annual ice skating race, where Hans must face off against his arch rival Ludwig Schimmel in the hopes of winning the prize money. Don't miss the heart-pounding race to the finish in this tale of courage and a family's determination to survive that will have everyone cheering!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Contributor': 'Mary Mapes Dodge, Norman Foster, Inga Landgre, Rony Zeaner, Gunilla Jelf, Erik Strandmark, Carin RossbyMary Mapes Dodge, Norman Foster, Inga Landgre, Rony Zeaner, Gunilla Jelf, Erik Strandmark, Carin Rossby   See more', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': 'WD03536900DVD', 'Director': 'Norman Foster', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 7, 2004', 'Actors': 'Rony Zeaner, Carin Rossby, Gunilla Jelf, Erik Strandmark, Inga Landgre', 'Subtitles': 'French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Norman Foster, Mary Mapes Dodge', 'Number of discs': '1'}\nReview Text: Great story remember it from my childhood\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The House Without a Christmas Tree\nReview Date: 2018/05/04\nStore: Jason Robards  (Actor),     Mildred Natwick  (Actor),     Paul Bogart  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Paramount', 'Color': 'Color', 'Item Weight': '1.69 Ounces', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Recording Capacity': '75 minutes'}\nReview Text: Loved this play. I remember watching it on TV at Christmas but then it went off.<br />So glad to find it\nReview Title: Loved this play\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SWEATIN TO THE OLDIES 5\nReview Date: 2018/05/04\nStore: RICHARD SIMMONS  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: [\"With over 2.3 million units of SWEATIN' TO THE OLDIES sold since 2008, Richard Simmons has reclaimed his crown as the King of Fitness. Time Life is proud to present Richard's all new aerobic workout: SWEATIN' TO THE OLDIES 5! Recently filmed in California, Richard uses get-up-and-move music from the 1960s as the backdrop to his signature formula: energizing songs, easy dance moves, real people and lots of fun! Based on the winning formula in his multi-platinum SWEATIN' series, SWEATIN' 5 features the same quality workouts fans expect, complete with Richard's unique encouragement and sassy style.\"]\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6428883', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '55 minutes', 'Release date': 'December 14, 2010', 'Actors': 'RICHARD SIMMONS', 'Studio': 'Timelife', 'Number of discs': '1'}\nReview Text: I have the whole collection Really love this work out\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anita Renfroe: Purse-onality\nReview Date: 2019/11/10\nStore: Anita Renfroe  (Actor),     Renfroe  (Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['This newest comedy video from Anita Renfroe is filled with hilarious and touching insights into the lives of modern women. She riffs on family life, church life, fake tans, caffeine, eBay addiction, even mammograms and underwire , in an outstanding comedy event that is cheeky, high-energy and ultimately life-affirming.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Christian, Music Video & Concerts', 'Format': 'NTSC', 'Contributor': 'Renfroe, Anita Renfroe', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.57 x 5.96 x 7.5 inches; 3.2 Ounces', 'Item model number': '052190', 'Director': 'Renfroe', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 13, 2013', 'Actors': 'Anita Renfroe', 'Studio': 'Crown', 'Number of discs': '1'}\nReview Text: Really enjoyed it . Watched it with friends we laughed so hard.\nReview Title: Hilarious\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anita Renfroe: And I Mean That In The Best Possible Way\nReview Date: 2019/12/06\nStore: Anita Renfroe  (Actor),     Crown Entertainment  (Director)    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['This here DVD is like a personal permission slip to take a mental health break and laugh for awhile. So grab some friends, and some popcorn, and some chocolate, and take an hour for some comedy therapy. We all know you need it...and I mean that in the best possible way.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Topic - Religion', 'Format': 'NTSC', 'Contributor': 'Anita Renfroe, Crown Entertainment', 'Runtime': '1 hour and 20 minutes', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 3.2 Ounces', 'Item model number': '076338', 'Director': 'Crown Entertainment', 'Media Format': 'NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'November 3, 2015', 'Actors': 'Anita Renfroe', 'Studio': 'Crown Entertainment', 'Number of discs': '1'}\nReview Text: You will laugh. Enjoy this with friends the more the merrier\nReview Title: Laughter is medicine for the soul\nRating: 4.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe analyzed purchase history reveals a strong preference for television and films, particularly family-friendly content, dramas, and action-adventures, suggesting a buyer who values both entertainment and nostalgia. Consistently high ratings and positive sentiments indicate satisfaction with choices, especially regarding iconic series and beloved holiday-themed films. \n\nCommon themes across purchases include the desire for quality content that can be enjoyed together with family or friends, as demonstrated by gifts for nieces and relatives. This person often purchases DVDs for gifting, suggesting they prioritize thoughtful gifting, particularly around holidays. There’s a recurring affinity for certain genres like science fiction and musicals, paired with a nostalgic appreciation for classic films. \n\nQuality is a foremost concern, as indicated by high ratings across products, while price sensitivity appears moderate; recipients’ enjoyment seems to dictate purchases rather than seeking the least expensive options. The buyer demonstrates a willingness to invest in quality over quantity, ensuring loved ones receive enjoyable content.\n\nIn summary, this individual exhibits a distinct inclination towards quality family programming and classics, with a strong focus on gifting experiences that foster shared enjoyment, thus reflecting a deep appreciation for both entertainment value and relational connections.",
  "target_interaction": {
    "rating": 5.0,
    "title": "A must see for people in pain",
    "text": "Documentary wasn't the greatest but the eye opening information about pain can be life changing",
    "images": [],
    "asin": "B07NYCXH7V",
    "parent_asin": "B07NYCXH7V",
    "user_id": "AGJOKZFVJ665TS2NJFP46AJQJL3Q",
    "timestamp": "2022-09-08 14:16:44.839000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.5,
    "rating_number": 262,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/42499d37a3639ac4b5a9cc68f30c8373c15777b8ea7d33622a010f6fba8cb422._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/42499d37a3639ac4b5a9cc68f30c8373c15777b8ea7d33622a010f6fba8cb422._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/42499d37a3639ac4b5a9cc68f30c8373c15777b8ea7d33622a010f6fba8cb422._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/42499d37a3639ac4b5a9cc68f30c8373c15777b8ea7d33622a010f6fba8cb422._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/42499d37a3639ac4b5a9cc68f30c8373c15777b8ea7d33622a010f6fba8cb422._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/42499d37a3639ac4b5a9cc68f30c8373c15777b8ea7d33622a010f6fba8cb422._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Michael Galinsky",
        "Suki Hawley",
        "David Beilinson"
      ],
      "Producers": [
        "David Beilinson",
        "Michael Galinsky",
        "Suki Hawley",
        "Adam Galinsky",
        "Jon Messner",
        "Roy Seidenberg",
        "John Sklar"
      ],
      "Starring": [
        "John Sarno",
        "Larry David",
        "Howard Stern"
      ],
      "Studio": [
        "Rumur Inc"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}