{
  "user_id": "AGE46QM42JCCX5JTZZZ7VA2R7LUA",
  "summary": "=== Purchase Information ===\nProduct Title: The Talented Mr. Ripley\nReview Date: 2008/04/05\nStore: Matt Damon  (Actor),     Gwyneth Paltrow  (Actor),     Anthony Minghella  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"To be young and carefree amid the blue waters and idyllic landscape of sun-drenched Italy in the late 1950's; that's the life Tom Ripley, the con artist, craves, and Dickie Greenleaf, the rich playboy, leads. When Dickie's father, a wealthy industrialist, commissions Ripley to bring his son home to America, Dickie and his beautiful expatriate girlfriend never suspect the dangerous extremes to which Ripley will go to make their lifestyle his own.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Feature', 'Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Contributor': 'Philip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth PaltrowPhilip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth Paltrow   See more', 'Language': 'English (Dolby Digital 5.1), Unknown (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.25 x 0.25 inches; 2.72 Ounces', 'Item model number': 'PARD331424D', 'Director': 'Anthony Minghella', 'Media Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'June 27, 2000', 'Actors': 'Matt Damon, Gwyneth Paltrow, Jude Law, Cate Blanchett, Philip Seymour Hoffman', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Anthony Minghella, Patricia Highsmith', 'Number of discs': '1'}\nReview Text: One of my favorite movies.  Matt Damon's performance is perfect, Jude Law is wonderful and Gwyneth Paltrow is luminescent.  It is mysterious, haunting, and thought provoking.  The acting is intense and masterful and you cannot help but be drawn into the story.  The complex layers of the characters are slowly revealed and wonderfully portrayed.\nReview Title: Amazing performances\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Penelope\nReview Date: 2008/05/21\nStore: Richard Grant  (Actor),     Catherine O'Hara  (Actor),     Mark Palansky  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Born with the snout of a pig, young Penelope Wilhern (Christina Ricci) spends life a virtual prisoner in her home. Believing that the only way to break the curse is to marry one of her own kind, she meets a number of suitors, but all reject her. Two devious men, one with a grudge against the family, hire a man (James McAvoy) to pose as a suitor, but complications arise when he begins to fall in love with Penelope, and she makes a bid for freedom.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6104618', 'Director': 'Mark Palansky', 'Media Format': 'Multiple Formats, Color, AC-3, Full Screen, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 15, 2008', 'Actors': \"Richard Grant, Catherine O'Hara, Christina Ricci, Peter Dinklage, James McAvoy\", 'Subtitles': 'English', 'Producers': 'Jennifer Simpson, Reese Witherspoon, Scott Steindorff', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This was such a fun movie.  The tale is great and the acting is wonderful.  James McAvoy is so cute and sweet.  I really enjoyed the sets, especially Penelope's bedroom, it is full of magic and imagination.  Her wardrobe leaves me drooling as well.  This is an entertaining and fun movie and I've been waiting for it to be released on DVD ever since I saw it in the theater.\nReview Title: A wonderful fun movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Becoming Jane\nReview Date: 2008/05/22\nStore: Anne Hathaway  (Actor),     James McAvoy  (Actor),     Julian Jarrold  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Miramax Home Entertainment, All Titles\nProduct Description: ['Anne Hathaway (The Devil Wears Prada, The Princess Diaries) gives a radiant performance as a young, love-struck Jane Austen in the witty and engaging romantic comedy Becoming Jane from Miramax Films. It s the untold romance that inspired the novels of one of the world s most celebrated authors. When the dashing Tom Lefroy (James McAvoy, The Last King Of Scotland), a reckless and penniless lawyer-to-be, enters Jane s life, he offends the emerging writer s sense and sensibility. Soon their clashing egos set off sparks that ignite a passionate romance and fuel Jane s dream of doing the unthinkable marrying for love. Becoming Jane, also starring the acclaimed Maggie Smith, James Cromwell and Julie Walters, is an enchanting and imaginative film you ll fall head over heels for']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Romance, Performing Arts', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Anne Hathaway, Julian Jarrold, James McAvoy', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0)', 'Runtime': '2 hours', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Julian Jarrold', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'February 12, 2008', 'Actors': 'Anne Hathaway, James McAvoy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Miramax', 'Number of discs': '1'}\nReview Text: Becoming Jane is a wonderful movie.  Anne Hathaway shines as Jane and embodies her spirit perfectly.  The script is fun and flirty with plenty of wit and charm.  They work in many references to Jane Austen's novels.  James McAvoy makes me drool, he is sweet and sexy.  Altogether it is a charming movie, although the ending, if you know anything about her life, isn't exactly what you hope for.\nReview Title: Fun and romantic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Clarissa Explains It All - Season One\nReview Date: 2008/05/25\nStore: Joe O'Connor  (Actor),     Sean O'Neal  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: [\"Clarissa brought clarity to murky teenage waters for five seasons on Nick. Now enjoy all 13 episodes from the first season, featuring Clarissa, her annoying little brother Ferguson, health-nut mom Janet, architect dad Marshall, and welcome next door neighbor, Sam. Episodes Clarissa's Revenge School Picture No T.V. Urge to Drive Clarissa News Network Haunted House the Bully New Addition Brain Drain Clarissa Makes a Cake Parents Who Say No Cool Dad Sick Days.\"]\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 6.4 Ounces', 'Item model number': '2238147', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '5 hours and 28 minutes', 'Release date': 'December 19, 2017', 'Actors': \"Joe O'Connor, Sean O'Neal, Melissa Joan Hart, Elizabeth Hess, Jason Zimbler\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I'm watching it as I type this and thoroughly enjoying myself.  I watched this show growing up and I am tickled to see it again.  I really wish they'd release all the seasons!  I guess I should just be grateful that season 1 made it onto DVD.  If you watched this show and loved it then, definitely get it because it's such a treat to watch it again.\nReview Title: Great memories!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Crazy, Stupid, Love\nReview Date: 2011/11/13\nStore: Steve Carell  (Actor),     Julianne Moore  (Actor),     Glenn Ficarra  (Director),     John Requa  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'Steve Carell and Ryan Gosling lead an all-star cast in', 'Crazy, Stupid, Love', \". Fortysomething straight-laced Cal Weaver (Carell) is living the dream—good job, nice house, great kids and marriage to his high school sweetheart, Emily (Julianne Moore). So when Cal learns that his wife has cheated on him and wants a divorce, his “perfect” life quickly unravels. Cal, who hasn't dated in decades, stands out as the epitome of un-smooth so handsome player Jacob Palmer (Gosling) takes him on as wingman and protégé, opening Cal’s eyes to the many options before him: flirty women, manly drinks and a sense of style. Despite Cal's makeover and his many new conquests, the one thing that can’t be made over is his heart, which seems to keep leading Cal back to where he began. Brimming with inspired performances, critics are calling this gem of a romantic comedy “a movie that understands love” (Owen Gleiberman,\", 'Entertainment Weekly', ').', 'Amazon.com', 'Crazy, Stupid, Love', 'is a romantic comedy with a big heart--a refreshing change from its', 'Hangover', '-laden compatriots, and almost a throwback to a golden era of romance. For', 'Crazy, Stupid, Love', 'relies on the sharp writing by Dan Fogelman (animated hits like', 'Bolt', ',', 'Tangled', \") and the sparkly chemistry of its cast, led by Steve Carell, Ryan Gosling, Julianne Moore, and the emerging superstar Emma Stone. It's not that the plot is ground-breaking--maybe, in fact, the appeal of\", 'Crazy, Stupid, Love', \"is that it's all too relatable. Cal (Carell) is long married to Emily (Moore), until one day she drops divorce on him, out of the blue. Stunned, Cal tries to reassemble his life as a woefully unprepared single guy. Enter Jacob (Gosling, who's never been better) as a happy bachelor whose tips for Cal will be ones that even the most happily wed female viewers will secretly want their mates to hear. Marisa Tomei has a hilarious turn as a temptress who's way out of Cal's league. And Stone is the fresh-faced, fearless young woman who shakes the confident Jacob's supposedly solid world view.\", 'But it\\'s the interplay between the characters, the true humanness of their emotions--long missing from many contemporary \"romantic comedies\"--that set', 'Crazy, Stupid, Love', \"in a class of its own. Moore is more than just the weary, accusatory neglected wife--someone who's never stopped believing in the spark of love. Gosling could easily be his generation's Cary Grant--assured, quick-witted, sly, yet vulnerable. Carell once again shows his dramatic capabilities on top of his impeccable comic timing. And Stone is a revelation, lovely, delicate, vulnerable but strong.\", 'Crazy, Stupid, Love', \"will reaffirm the viewer's belief in all that's possible. Call us crazy. --\", 'A.T. Hurley']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Glenn Ficarra, Marisa Tomei, Steve Carell, Julianne Moore, Ryan Gosling, John Requa, Emma Stone', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Warner Brothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '1000206288', 'Director': 'Glenn Ficarra, John Requa', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Release date': 'November 1, 2011', 'Actors': 'Steve Carell, Julianne Moore, Marisa Tomei, Ryan Gosling, Emma Stone', 'Subtitles': 'English, French, Spanish', 'Number of discs': '1'}\nReview Text: My spouse and I loved it!  It was surprisingly sweet and funny.  We laughed out loud throughout the movie!  Steve Carrell is wonderful.\nReview Title: One of the best of the year!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: This Means War (Blu-ray + DVD + Digital Copy)\nReview Date: 2013/04/08\nStore: Tom Hardy  (Actor),     Reese Witherspoon  (Actor),     McG  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"The world's deadliest CIA operatives are inseparable partners and best friends until they fall for the same woman. Having once helped bring down entire enemy nations, they are now employing their incomparable skills and an endless array of high-tech gadgetry against their greatest nemesis ever -- each other.\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copyMultiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'McG, Reese Witherspoon, Tom Hardy', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 2.4 Ounces', 'Item model number': '24543755272', 'Director': 'McG', 'Media Format': 'Multiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 22, 2012', 'Actors': 'Tom Hardy, Reese Witherspoon', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: A fun and funny romantic comedy.  Definitely predictable and light but still a fun stoy and made me laugh more than once!\nReview Title: Funny and fun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: First Position\nReview Date: 2013/04/08\nStore: Aran Bell  (Actor),     Gaya Bommer Yemini  (Actor),     Bess Kargman  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Every year, thousands of aspiring dancers enter one of the world's most prestigious ballet competitions, the Youth America Grand Prix, where lifelong dreams are at stake. In the final round, with hundreds competing for only a handful of elite scholarships and contracts, practice and discipline are paramount, and nothing short of perfection is expected. The box office hit documentary, Bess Kargman's award-winning FIRST POSITION follows six young dancers as they prepare for a chance to enter the world of professional ballet, struggling through bloodied feet, near exhaustion and debilitating injuries, all while navigating the drama of adolescence. A showcase of awe-inspiring talent, tenacity and passion, FIRST POSITION paints a thrilling and moving portrait of the most gifted young ballet stars of tomorrow.\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Miko Fogarty, Jules Jarvis Fogarty, Rebecca Houseknecht, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Bess Kargman, Aran BellMiko Fogarty, Jules Jarvis Fogarty, Rebecca Houseknecht, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Bess Kargman, Aran Bell   See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '10158440', 'Director': 'Bess Kargman', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2012', 'Actors': 'Aran Bell, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Miko Fogarty', 'Studio': 'IFC Independent Film', 'Number of discs': '1'}\nReview Text: You don't have to be a dancer to enjoy this documentary.  The children in this movie are so incredibly talented and disciplined that you have to see it to believe it.  I wish I could see a follow up to how their careers turned out years later because they have nothing but bright futures ahead of them.  The stories are compelling and the dancing is beautiful and again, the dedication of these kids to their craft is remarkable.\nReview Title: Such a fun documentary\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Incredible Burt Wonderstone (Blu-ray)\nReview Date: 2013/06/27\nStore: Steve Buscemi  (Actor),     Olivia Wilde  (Actor),     Don Scardino  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Burt Wonderstone, The Incredible (Blu-ray)', ']]>']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Comedy', 'Format': 'Blu-ray', 'Contributor': 'Diana Pokorny, Dave Neustadter, Steve Carell, John Francis Daley, Walter Hamada, Charlie Hartsock, Steve Buscemi, Richard Brener, J.C. Spink, Jonathan Goldstein, Jim Carrey, Jake Weiner, Chris Bender, Vance DeGeneres, Tyler Mitchell, Chad Kultgen, Olivia Wilde, James Gandolfini, Alan Arkin, Don ScardinoDiana Pokorny, Dave Neustadter, Steve Carell, John Francis Daley, Walter Hamada, Charlie Hartsock, Steve Buscemi, Richard Brener, J.C. Spink, Jonathan Goldstein, Jim Carrey, Jake Weiner, Chris Bender, Vance DeGeneres, Tyler Mitchell, Chad Kultgen, Olivia Wilde, James…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '26922854', 'Director': 'Don Scardino', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 25, 2013', 'Actors': 'Steve Carell, Steve Buscemi, Olivia Wilde, Alan Arkin, James Gandolfini', 'Subtitles': 'Portuguese, Spanish, French', 'Producers': 'Diana Pokorny, Chris Bender, Vance DeGeneres, Steve Carell, Charlie Hartsock', 'Studio': 'WarnerBrothers', 'Writers': 'Jonathan Goldstein, John Francis Daley, Chad Kultgen, Tyler Mitchell', 'Number of discs': '1'}\nReview Text: I thought it was a fun movie, enjoyable for what it is:  a slightly predictable movie that doesn't make you think too much.  Made me laugh which is pretty much all I was looking for in it.  I enjoyed everyones performances, esp Steve Buschemi.  I think this one could go either way for most people:  you'll either laugh and love it or just plain hate it.\nReview Title: Enjoyable\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Christmas with the Kranks\nReview Date: 2014/01/14\nStore: Tim Allen  (Actor),     Jamie Lee Curtis  (Actor),     Joe Roth  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['When their only daughter Blair leaves the family nest, Luther and Nora Krank (Tim Allen and Jamie Lee Curtis) decide to book an island cruise to beat the yuletide blues and just skip the holidays. But their decision to boycott tradition has the whole neighborhood in an uproar, and when Blair callson Christmas Eve to announce a surprise visit with her new fiancée, the Kranks have just twelve hours to perform a miracle and pull themselves and their neighbors together to throw the best celebration ever! With fast-paced energy and support from Dan Aykroyd, Cheech Marin, Jake Busey and M. EmmetWalsh, this hilarious adaptation of John Grisham\\'s best-selling novel, \"Skipping Christmas\" has become \"an instant family classic!\" (Gorman Woodfin, CBN)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Family', 'Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Dan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe RothDan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe Roth  See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1, 2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.25 x 7.55 inches; 2.4 Ounces', 'Item model number': '2226145', 'Director': 'Joe Roth', 'Media Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Tim Allen, Jamie Lee Curtis, Dan Aykroyd, Cheech Marin', 'Dubbed': 'French', 'Subtitles': 'English, French, Mandarin Chinese, Thai', 'Producers': 'Chris Columbus, Michael Barnathan, Mark Radcliffe', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: As far as christmas movies go this is a fun one.  Its definitely nothing serious or dramatic or has hard to uncover themes.  It is just what you want a christmas movie to be.  Lighthearted slapstick and silly.  We enjoy it every year.\nReview Title: christmas fun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Madam Secretary: Season 1\nReview Date: 2016/01/13\nStore: Bebe Neuwirth  (Actor),     Tim Daly  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment\nProduct Description: ['Madam Secretary: Season One 6 DVD set. What would you do if the President of the United States offered you the opportunity to \"affect real change in the world?\" Elizabeth McCord is presented the opportunity to answer just that question. The former CIA analyst, wife, parent and college professor is told by the President that she can think it over, but that he \"won\\'t take no for an answer.\" Moving to Georgetown and taking the Secretary of State position, Elizabeth finds herself contending with problems that could have come from the evening news. She demonstrates great personal integrity and a willingness to circumvent the conventional to solve the world\\'s problems. Elizabeth must balance the pressures of maintaining her family with the demands of the job. Madam Secretary is a reminder of how government should work.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Tea Leoni, Tim Daly, Bebe Neuwirth', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '34272234', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '16 hours and 2 minutes', 'Release date': 'July 19, 2016', 'Actors': 'Bebe Neuwirth, Tim Daly, Tea Leoni', 'Subtitles': 'English, Portuguese', 'Studio': 'Paramount', 'Number of discs': '6'}\nReview Text: A fantastic show!  Season 2 is even better than Season 1 - hard to believe!  Tea Leoni is fantastic as the Secretary of State and gives a strong performance.\nReview Title: A fantastic show! Season 2 is even better than Season ...\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Talented Mr. Ripley\nMatt Damon  (Actor),     Gwyneth Paltrow  (Actor),     Anthony Minghella  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"To be young and carefree amid the blue waters and idyllic landscape of sun-drenched Italy in the late 1950's; that's the life Tom Ripley, the con artist, craves, and Dickie Greenleaf, the rich playboy, leads. When Dickie's father, a wealthy industrialist, commissions Ripley to bring his son home to America, Dickie and his beautiful expatriate girlfriend never suspect the dangerous extremes to which Ripley will go to make their lifestyle his own.\"]\n{'Genre': 'Feature', 'Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Contributor': 'Philip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth PaltrowPhilip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth Paltrow   See more', 'Language': 'English (Dolby Digital 5.1), Unknown (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.25 x 0.25 inches; 2.72 Ounces', 'Item model number': 'PARD331424D', 'Director': 'Anthony Minghella', 'Media Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'June 27, 2000', 'Actors': 'Matt Damon, Gwyneth Paltrow, Jude Law, Cate Blanchett, Philip Seymour Hoffman', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Anthony Minghella, Patricia Highsmith', 'Number of discs': '1'}\nOne of my favorite movies.  Matt Damon's performance is perfect, Jude Law is wonderful and Gwyneth Paltrow is luminescent.  It is mysterious, haunting, and thought provoking.  The acting is intense and masterful and you cannot help but be drawn into the story.  The complex layers of the characters are slowly revealed and wonderfully portrayed.\nAmazing performances\nPenelope\nRichard Grant  (Actor),     Catherine O'Hara  (Actor),     Mark Palansky  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Born with the snout of a pig, young Penelope Wilhern (Christina Ricci) spends life a virtual prisoner in her home. Believing that the only way to break the curse is to marry one of her own kind, she meets a number of suitors, but all reject her. Two devious men, one with a grudge against the family, hire a man (James McAvoy) to pose as a suitor, but complications arise when he begins to fall in love with Penelope, and she makes a bid for freedom.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6104618', 'Director': 'Mark Palansky', 'Media Format': 'Multiple Formats, Color, AC-3, Full Screen, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 15, 2008', 'Actors': \"Richard Grant, Catherine O'Hara, Christina Ricci, Peter Dinklage, James McAvoy\", 'Subtitles': 'English', 'Producers': 'Jennifer Simpson, Reese Witherspoon, Scott Steindorff', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was such a fun movie.  The tale is great and the acting is wonderful.  James McAvoy is so cute and sweet.  I really enjoyed the sets, especially Penelope's bedroom, it is full of magic and imagination.  Her wardrobe leaves me drooling as well.  This is an entertaining and fun movie and I've been waiting for it to be released on DVD ever since I saw it in the theater.\nA wonderful fun movie\nBecoming Jane\nAnne Hathaway  (Actor),     James McAvoy  (Actor),     Julian Jarrold  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Anne Hathaway (The Devil Wears Prada, The Princess Diaries) gives a radiant performance as a young, love-struck Jane Austen in the witty and engaging romantic comedy Becoming Jane from Miramax Films. It s the untold romance that inspired the novels of one of the world s most celebrated authors. When the dashing Tom Lefroy (James McAvoy, The Last King Of Scotland), a reckless and penniless lawyer-to-be, enters Jane s life, he offends the emerging writer s sense and sensibility. Soon their clashing egos set off sparks that ignite a passionate romance and fuel Jane s dream of doing the unthinkable marrying for love. Becoming Jane, also starring the acclaimed Maggie Smith, James Cromwell and Julie Walters, is an enchanting and imaginative film you ll fall head over heels for']\n{'Genre': 'Romance, Performing Arts', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Anne Hathaway, Julian Jarrold, James McAvoy', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0)', 'Runtime': '2 hours', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Julian Jarrold', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'February 12, 2008', 'Actors': 'Anne Hathaway, James McAvoy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Miramax', 'Number of discs': '1'}\nBecoming Jane is a wonderful movie.  Anne Hathaway shines as Jane and embodies her spirit perfectly.  The script is fun and flirty with plenty of wit and charm.  They work in many references to Jane Austen's novels.  James McAvoy makes me drool, he is sweet and sexy.  Altogether it is a charming movie, although the ending, if you know anything about her life, isn't exactly what you hope for.\nFun and romantic\nClarissa Explains It All - Season One\nJoe O'Connor  (Actor),     Sean O'Neal  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Clarissa brought clarity to murky teenage waters for five seasons on Nick. Now enjoy all 13 episodes from the first season, featuring Clarissa, her annoying little brother Ferguson, health-nut mom Janet, architect dad Marshall, and welcome next door neighbor, Sam. Episodes Clarissa's Revenge School Picture No T.V. Urge to Drive Clarissa News Network Haunted House the Bully New Addition Brain Drain Clarissa Makes a Cake Parents Who Say No Cool Dad Sick Days.\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 6.4 Ounces', 'Item model number': '2238147', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '5 hours and 28 minutes', 'Release date': 'December 19, 2017', 'Actors': \"Joe O'Connor, Sean O'Neal, Melissa Joan Hart, Elizabeth Hess, Jason Zimbler\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI'm watching it as I type this and thoroughly enjoying myself.  I watched this show growing up and I am tickled to see it again.  I really wish they'd release all the seasons!  I guess I should just be grateful that season 1 made it onto DVD.  If you watched this show and loved it then, definitely get it because it's such a treat to watch it again.\nGreat memories!\nCrazy, Stupid, Love\nSteve Carell  (Actor),     Julianne Moore  (Actor),     Glenn Ficarra  (Director),     John Requa  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Steve Carell and Ryan Gosling lead an all-star cast in', 'Crazy, Stupid, Love', \". Fortysomething straight-laced Cal Weaver (Carell) is living the dream—good job, nice house, great kids and marriage to his high school sweetheart, Emily (Julianne Moore). So when Cal learns that his wife has cheated on him and wants a divorce, his “perfect” life quickly unravels. Cal, who hasn't dated in decades, stands out as the epitome of un-smooth so handsome player Jacob Palmer (Gosling) takes him on as wingman and protégé, opening Cal’s eyes to the many options before him: flirty women, manly drinks and a sense of style. Despite Cal's makeover and his many new conquests, the one thing that can’t be made over is his heart, which seems to keep leading Cal back to where he began. Brimming with inspired performances, critics are calling this gem of a romantic comedy “a movie that understands love” (Owen Gleiberman,\", 'Entertainment Weekly', ').', 'Amazon.com', 'Crazy, Stupid, Love', 'is a romantic comedy with a big heart--a refreshing change from its', 'Hangover', '-laden compatriots, and almost a throwback to a golden era of romance. For', 'Crazy, Stupid, Love', 'relies on the sharp writing by Dan Fogelman (animated hits like', 'Bolt', ',', 'Tangled', \") and the sparkly chemistry of its cast, led by Steve Carell, Ryan Gosling, Julianne Moore, and the emerging superstar Emma Stone. It's not that the plot is ground-breaking--maybe, in fact, the appeal of\", 'Crazy, Stupid, Love', \"is that it's all too relatable. Cal (Carell) is long married to Emily (Moore), until one day she drops divorce on him, out of the blue. Stunned, Cal tries to reassemble his life as a woefully unprepared single guy. Enter Jacob (Gosling, who's never been better) as a happy bachelor whose tips for Cal will be ones that even the most happily wed female viewers will secretly want their mates to hear. Marisa Tomei has a hilarious turn as a temptress who's way out of Cal's league. And Stone is the fresh-faced, fearless young woman who shakes the confident Jacob's supposedly solid world view.\", 'But it\\'s the interplay between the characters, the true humanness of their emotions--long missing from many contemporary \"romantic comedies\"--that set', 'Crazy, Stupid, Love', \"in a class of its own. Moore is more than just the weary, accusatory neglected wife--someone who's never stopped believing in the spark of love. Gosling could easily be his generation's Cary Grant--assured, quick-witted, sly, yet vulnerable. Carell once again shows his dramatic capabilities on top of his impeccable comic timing. And Stone is a revelation, lovely, delicate, vulnerable but strong.\", 'Crazy, Stupid, Love', \"will reaffirm the viewer's belief in all that's possible. Call us crazy. --\", 'A.T. Hurley']\n{'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Glenn Ficarra, Marisa Tomei, Steve Carell, Julianne Moore, Ryan Gosling, John Requa, Emma Stone', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Warner Brothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '1000206288', 'Director': 'Glenn Ficarra, John Requa', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Release date': 'November 1, 2011', 'Actors': 'Steve Carell, Julianne Moore, Marisa Tomei, Ryan Gosling, Emma Stone', 'Subtitles': 'English, French, Spanish', 'Number of discs': '1'}\nMy spouse and I loved it!  It was surprisingly sweet and funny.  We laughed out loud throughout the movie!  Steve Carrell is wonderful.\nOne of the best of the year!\nThis Means War (Blu-ray + DVD + Digital Copy)\nTom Hardy  (Actor),     Reese Witherspoon  (Actor),     McG  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"The world's deadliest CIA operatives are inseparable partners and best friends until they fall for the same woman. Having once helped bring down entire enemy nations, they are now employing their incomparable skills and an endless array of high-tech gadgetry against their greatest nemesis ever -- each other.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copyMultiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'McG, Reese Witherspoon, Tom Hardy', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 2.4 Ounces', 'Item model number': '24543755272', 'Director': 'McG', 'Media Format': 'Multiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 22, 2012', 'Actors': 'Tom Hardy, Reese Witherspoon', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nA fun and funny romantic comedy.  Definitely predictable and light but still a fun stoy and made me laugh more than once!\nFunny and fun\nFirst Position\nAran Bell  (Actor),     Gaya Bommer Yemini  (Actor),     Bess Kargman  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Every year, thousands of aspiring dancers enter one of the world's most prestigious ballet competitions, the Youth America Grand Prix, where lifelong dreams are at stake. In the final round, with hundreds competing for only a handful of elite scholarships and contracts, practice and discipline are paramount, and nothing short of perfection is expected. The box office hit documentary, Bess Kargman's award-winning FIRST POSITION follows six young dancers as they prepare for a chance to enter the world of professional ballet, struggling through bloodied feet, near exhaustion and debilitating injuries, all while navigating the drama of adolescence. A showcase of awe-inspiring talent, tenacity and passion, FIRST POSITION paints a thrilling and moving portrait of the most gifted young ballet stars of tomorrow.\"]\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Miko Fogarty, Jules Jarvis Fogarty, Rebecca Houseknecht, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Bess Kargman, Aran BellMiko Fogarty, Jules Jarvis Fogarty, Rebecca Houseknecht, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Bess Kargman, Aran Bell   See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '10158440', 'Director': 'Bess Kargman', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2012', 'Actors': 'Aran Bell, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Miko Fogarty', 'Studio': 'IFC Independent Film', 'Number of discs': '1'}\nYou don't have to be a dancer to enjoy this documentary.  The children in this movie are so incredibly talented and disciplined that you have to see it to believe it.  I wish I could see a follow up to how their careers turned out years later because they have nothing but bright futures ahead of them.  The stories are compelling and the dancing is beautiful and again, the dedication of these kids to their craft is remarkable.\nSuch a fun documentary\nThe Incredible Burt Wonderstone (Blu-ray)\nSteve Buscemi  (Actor),     Olivia Wilde  (Actor),     Don Scardino  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Burt Wonderstone, The Incredible (Blu-ray)', ']]>']\n{'Genre': 'Comedy', 'Format': 'Blu-ray', 'Contributor': 'Diana Pokorny, Dave Neustadter, Steve Carell, John Francis Daley, Walter Hamada, Charlie Hartsock, Steve Buscemi, Richard Brener, J.C. Spink, Jonathan Goldstein, Jim Carrey, Jake Weiner, Chris Bender, Vance DeGeneres, Tyler Mitchell, Chad Kultgen, Olivia Wilde, James Gandolfini, Alan Arkin, Don ScardinoDiana Pokorny, Dave Neustadter, Steve Carell, John Francis Daley, Walter Hamada, Charlie Hartsock, Steve Buscemi, Richard Brener, J.C. Spink, Jonathan Goldstein, Jim Carrey, Jake Weiner, Chris Bender, Vance DeGeneres, Tyler Mitchell, Chad Kultgen, Olivia Wilde, James…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '26922854', 'Director': 'Don Scardino', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 25, 2013', 'Actors': 'Steve Carell, Steve Buscemi, Olivia Wilde, Alan Arkin, James Gandolfini', 'Subtitles': 'Portuguese, Spanish, French', 'Producers': 'Diana Pokorny, Chris Bender, Vance DeGeneres, Steve Carell, Charlie Hartsock', 'Studio': 'WarnerBrothers', 'Writers': 'Jonathan Goldstein, John Francis Daley, Chad Kultgen, Tyler Mitchell', 'Number of discs': '1'}\nI thought it was a fun movie, enjoyable for what it is:  a slightly predictable movie that doesn't make you think too much.  Made me laugh which is pretty much all I was looking for in it.  I enjoyed everyones performances, esp Steve Buschemi.  I think this one could go either way for most people:  you'll either laugh and love it or just plain hate it.\nEnjoyable\nChristmas with the Kranks\nTim Allen  (Actor),     Jamie Lee Curtis  (Actor),     Joe Roth  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['When their only daughter Blair leaves the family nest, Luther and Nora Krank (Tim Allen and Jamie Lee Curtis) decide to book an island cruise to beat the yuletide blues and just skip the holidays. But their decision to boycott tradition has the whole neighborhood in an uproar, and when Blair callson Christmas Eve to announce a surprise visit with her new fiancée, the Kranks have just twelve hours to perform a miracle and pull themselves and their neighbors together to throw the best celebration ever! With fast-paced energy and support from Dan Aykroyd, Cheech Marin, Jake Busey and M. EmmetWalsh, this hilarious adaptation of John Grisham\\'s best-selling novel, \"Skipping Christmas\" has become \"an instant family classic!\" (Gorman Woodfin, CBN)']\n{'Genre': 'Drama, Family', 'Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Dan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe RothDan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe Roth  See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1, 2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.25 x 7.55 inches; 2.4 Ounces', 'Item model number': '2226145', 'Director': 'Joe Roth', 'Media Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Tim Allen, Jamie Lee Curtis, Dan Aykroyd, Cheech Marin', 'Dubbed': 'French', 'Subtitles': 'English, French, Mandarin Chinese, Thai', 'Producers': 'Chris Columbus, Michael Barnathan, Mark Radcliffe', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAs far as christmas movies go this is a fun one.  Its definitely nothing serious or dramatic or has hard to uncover themes.  It is just what you want a christmas movie to be.  Lighthearted slapstick and silly.  We enjoy it every year.\nchristmas fun\nMadam Secretary: Season 1\nBebe Neuwirth  (Actor),     Tim Daly  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment\n['Madam Secretary: Season One 6 DVD set. What would you do if the President of the United States offered you the opportunity to \"affect real change in the world?\" Elizabeth McCord is presented the opportunity to answer just that question. The former CIA analyst, wife, parent and college professor is told by the President that she can think it over, but that he \"won\\'t take no for an answer.\" Moving to Georgetown and taking the Secretary of State position, Elizabeth finds herself contending with problems that could have come from the evening news. She demonstrates great personal integrity and a willingness to circumvent the conventional to solve the world\\'s problems. Elizabeth must balance the pressures of maintaining her family with the demands of the job. Madam Secretary is a reminder of how government should work.']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Tea Leoni, Tim Daly, Bebe Neuwirth', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '34272234', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '16 hours and 2 minutes', 'Release date': 'July 19, 2016', 'Actors': 'Bebe Neuwirth, Tim Daly, Tea Leoni', 'Subtitles': 'English, Portuguese', 'Studio': 'Paramount', 'Number of discs': '6'}\nA fantastic show!  Season 2 is even better than Season 1 - hard to believe!  Tea Leoni is fantastic as the Secretary of State and gives a strong performance.\nA fantastic show! Season 2 is even better than Season ...",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: The Talented Mr. Ripley\nReview Date: 2008/04/05\nStore: Matt Damon  (Actor),     Gwyneth Paltrow  (Actor),     Anthony Minghella  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"To be young and carefree amid the blue waters and idyllic landscape of sun-drenched Italy in the late 1950's; that's the life Tom Ripley, the con artist, craves, and Dickie Greenleaf, the rich playboy, leads. When Dickie's father, a wealthy industrialist, commissions Ripley to bring his son home to America, Dickie and his beautiful expatriate girlfriend never suspect the dangerous extremes to which Ripley will go to make their lifestyle his own.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Feature', 'Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Contributor': 'Philip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth PaltrowPhilip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth Paltrow   See more', 'Language': 'English (Dolby Digital 5.1), Unknown (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.25 x 0.25 inches; 2.72 Ounces', 'Item model number': 'PARD331424D', 'Director': 'Anthony Minghella', 'Media Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'June 27, 2000', 'Actors': 'Matt Damon, Gwyneth Paltrow, Jude Law, Cate Blanchett, Philip Seymour Hoffman', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Anthony Minghella, Patricia Highsmith', 'Number of discs': '1'}\nReview Text: One of my favorite movies.  Matt Damon's performance is perfect, Jude Law is wonderful and Gwyneth Paltrow is luminescent.  It is mysterious, haunting, and thought provoking.  The acting is intense and masterful and you cannot help but be drawn into the story.  The complex layers of the characters are slowly revealed and wonderfully portrayed.\nReview Title: Amazing performances\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Penelope\nReview Date: 2008/05/21\nStore: Richard Grant  (Actor),     Catherine O'Hara  (Actor),     Mark Palansky  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Born with the snout of a pig, young Penelope Wilhern (Christina Ricci) spends life a virtual prisoner in her home. Believing that the only way to break the curse is to marry one of her own kind, she meets a number of suitors, but all reject her. Two devious men, one with a grudge against the family, hire a man (James McAvoy) to pose as a suitor, but complications arise when he begins to fall in love with Penelope, and she makes a bid for freedom.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6104618', 'Director': 'Mark Palansky', 'Media Format': 'Multiple Formats, Color, AC-3, Full Screen, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 15, 2008', 'Actors': \"Richard Grant, Catherine O'Hara, Christina Ricci, Peter Dinklage, James McAvoy\", 'Subtitles': 'English', 'Producers': 'Jennifer Simpson, Reese Witherspoon, Scott Steindorff', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This was such a fun movie.  The tale is great and the acting is wonderful.  James McAvoy is so cute and sweet.  I really enjoyed the sets, especially Penelope's bedroom, it is full of magic and imagination.  Her wardrobe leaves me drooling as well.  This is an entertaining and fun movie and I've been waiting for it to be released on DVD ever since I saw it in the theater.\nReview Title: A wonderful fun movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Becoming Jane\nReview Date: 2008/05/22\nStore: Anne Hathaway  (Actor),     James McAvoy  (Actor),     Julian Jarrold  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Miramax Home Entertainment, All Titles\nProduct Description: ['Anne Hathaway (The Devil Wears Prada, The Princess Diaries) gives a radiant performance as a young, love-struck Jane Austen in the witty and engaging romantic comedy Becoming Jane from Miramax Films. It s the untold romance that inspired the novels of one of the world s most celebrated authors. When the dashing Tom Lefroy (James McAvoy, The Last King Of Scotland), a reckless and penniless lawyer-to-be, enters Jane s life, he offends the emerging writer s sense and sensibility. Soon their clashing egos set off sparks that ignite a passionate romance and fuel Jane s dream of doing the unthinkable marrying for love. Becoming Jane, also starring the acclaimed Maggie Smith, James Cromwell and Julie Walters, is an enchanting and imaginative film you ll fall head over heels for']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Romance, Performing Arts', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Anne Hathaway, Julian Jarrold, James McAvoy', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0)', 'Runtime': '2 hours', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Julian Jarrold', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'February 12, 2008', 'Actors': 'Anne Hathaway, James McAvoy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Miramax', 'Number of discs': '1'}\nReview Text: Becoming Jane is a wonderful movie.  Anne Hathaway shines as Jane and embodies her spirit perfectly.  The script is fun and flirty with plenty of wit and charm.  They work in many references to Jane Austen's novels.  James McAvoy makes me drool, he is sweet and sexy.  Altogether it is a charming movie, although the ending, if you know anything about her life, isn't exactly what you hope for.\nReview Title: Fun and romantic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Clarissa Explains It All - Season One\nReview Date: 2008/05/25\nStore: Joe O'Connor  (Actor),     Sean O'Neal  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: [\"Clarissa brought clarity to murky teenage waters for five seasons on Nick. Now enjoy all 13 episodes from the first season, featuring Clarissa, her annoying little brother Ferguson, health-nut mom Janet, architect dad Marshall, and welcome next door neighbor, Sam. Episodes Clarissa's Revenge School Picture No T.V. Urge to Drive Clarissa News Network Haunted House the Bully New Addition Brain Drain Clarissa Makes a Cake Parents Who Say No Cool Dad Sick Days.\"]\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 6.4 Ounces', 'Item model number': '2238147', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '5 hours and 28 minutes', 'Release date': 'December 19, 2017', 'Actors': \"Joe O'Connor, Sean O'Neal, Melissa Joan Hart, Elizabeth Hess, Jason Zimbler\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I'm watching it as I type this and thoroughly enjoying myself.  I watched this show growing up and I am tickled to see it again.  I really wish they'd release all the seasons!  I guess I should just be grateful that season 1 made it onto DVD.  If you watched this show and loved it then, definitely get it because it's such a treat to watch it again.\nReview Title: Great memories!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Crazy, Stupid, Love\nReview Date: 2011/11/13\nStore: Steve Carell  (Actor),     Julianne Moore  (Actor),     Glenn Ficarra  (Director),     John Requa  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'Steve Carell and Ryan Gosling lead an all-star cast in', 'Crazy, Stupid, Love', \". Fortysomething straight-laced Cal Weaver (Carell) is living the dream—good job, nice house, great kids and marriage to his high school sweetheart, Emily (Julianne Moore). So when Cal learns that his wife has cheated on him and wants a divorce, his “perfect” life quickly unravels. Cal, who hasn't dated in decades, stands out as the epitome of un-smooth so handsome player Jacob Palmer (Gosling) takes him on as wingman and protégé, opening Cal’s eyes to the many options before him: flirty women, manly drinks and a sense of style. Despite Cal's makeover and his many new conquests, the one thing that can’t be made over is his heart, which seems to keep leading Cal back to where he began. Brimming with inspired performances, critics are calling this gem of a romantic comedy “a movie that understands love” (Owen Gleiberman,\", 'Entertainment Weekly', ').', 'Amazon.com', 'Crazy, Stupid, Love', 'is a romantic comedy with a big heart--a refreshing change from its', 'Hangover', '-laden compatriots, and almost a throwback to a golden era of romance. For', 'Crazy, Stupid, Love', 'relies on the sharp writing by Dan Fogelman (animated hits like', 'Bolt', ',', 'Tangled', \") and the sparkly chemistry of its cast, led by Steve Carell, Ryan Gosling, Julianne Moore, and the emerging superstar Emma Stone. It's not that the plot is ground-breaking--maybe, in fact, the appeal of\", 'Crazy, Stupid, Love', \"is that it's all too relatable. Cal (Carell) is long married to Emily (Moore), until one day she drops divorce on him, out of the blue. Stunned, Cal tries to reassemble his life as a woefully unprepared single guy. Enter Jacob (Gosling, who's never been better) as a happy bachelor whose tips for Cal will be ones that even the most happily wed female viewers will secretly want their mates to hear. Marisa Tomei has a hilarious turn as a temptress who's way out of Cal's league. And Stone is the fresh-faced, fearless young woman who shakes the confident Jacob's supposedly solid world view.\", 'But it\\'s the interplay between the characters, the true humanness of their emotions--long missing from many contemporary \"romantic comedies\"--that set', 'Crazy, Stupid, Love', \"in a class of its own. Moore is more than just the weary, accusatory neglected wife--someone who's never stopped believing in the spark of love. Gosling could easily be his generation's Cary Grant--assured, quick-witted, sly, yet vulnerable. Carell once again shows his dramatic capabilities on top of his impeccable comic timing. And Stone is a revelation, lovely, delicate, vulnerable but strong.\", 'Crazy, Stupid, Love', \"will reaffirm the viewer's belief in all that's possible. Call us crazy. --\", 'A.T. Hurley']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Glenn Ficarra, Marisa Tomei, Steve Carell, Julianne Moore, Ryan Gosling, John Requa, Emma Stone', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Warner Brothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '1000206288', 'Director': 'Glenn Ficarra, John Requa', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Release date': 'November 1, 2011', 'Actors': 'Steve Carell, Julianne Moore, Marisa Tomei, Ryan Gosling, Emma Stone', 'Subtitles': 'English, French, Spanish', 'Number of discs': '1'}\nReview Text: My spouse and I loved it!  It was surprisingly sweet and funny.  We laughed out loud throughout the movie!  Steve Carrell is wonderful.\nReview Title: One of the best of the year!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: This Means War (Blu-ray + DVD + Digital Copy)\nReview Date: 2013/04/08\nStore: Tom Hardy  (Actor),     Reese Witherspoon  (Actor),     McG  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"The world's deadliest CIA operatives are inseparable partners and best friends until they fall for the same woman. Having once helped bring down entire enemy nations, they are now employing their incomparable skills and an endless array of high-tech gadgetry against their greatest nemesis ever -- each other.\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copyMultiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'McG, Reese Witherspoon, Tom Hardy', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 2.4 Ounces', 'Item model number': '24543755272', 'Director': 'McG', 'Media Format': 'Multiple Formats, Blu-ray, Color, Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 22, 2012', 'Actors': 'Tom Hardy, Reese Witherspoon', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: A fun and funny romantic comedy.  Definitely predictable and light but still a fun stoy and made me laugh more than once!\nReview Title: Funny and fun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: First Position\nReview Date: 2013/04/08\nStore: Aran Bell  (Actor),     Gaya Bommer Yemini  (Actor),     Bess Kargman  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Every year, thousands of aspiring dancers enter one of the world's most prestigious ballet competitions, the Youth America Grand Prix, where lifelong dreams are at stake. In the final round, with hundreds competing for only a handful of elite scholarships and contracts, practice and discipline are paramount, and nothing short of perfection is expected. The box office hit documentary, Bess Kargman's award-winning FIRST POSITION follows six young dancers as they prepare for a chance to enter the world of professional ballet, struggling through bloodied feet, near exhaustion and debilitating injuries, all while navigating the drama of adolescence. A showcase of awe-inspiring talent, tenacity and passion, FIRST POSITION paints a thrilling and moving portrait of the most gifted young ballet stars of tomorrow.\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Miko Fogarty, Jules Jarvis Fogarty, Rebecca Houseknecht, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Bess Kargman, Aran BellMiko Fogarty, Jules Jarvis Fogarty, Rebecca Houseknecht, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Bess Kargman, Aran Bell   See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '10158440', 'Director': 'Bess Kargman', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2012', 'Actors': 'Aran Bell, Gaya Bommer Yemini, Michaela DePrince, Joan Sebastian Zamora, Miko Fogarty', 'Studio': 'IFC Independent Film', 'Number of discs': '1'}\nReview Text: You don't have to be a dancer to enjoy this documentary.  The children in this movie are so incredibly talented and disciplined that you have to see it to believe it.  I wish I could see a follow up to how their careers turned out years later because they have nothing but bright futures ahead of them.  The stories are compelling and the dancing is beautiful and again, the dedication of these kids to their craft is remarkable.\nReview Title: Such a fun documentary\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Incredible Burt Wonderstone (Blu-ray)\nReview Date: 2013/06/27\nStore: Steve Buscemi  (Actor),     Olivia Wilde  (Actor),     Don Scardino  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Burt Wonderstone, The Incredible (Blu-ray)', ']]>']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Comedy', 'Format': 'Blu-ray', 'Contributor': 'Diana Pokorny, Dave Neustadter, Steve Carell, John Francis Daley, Walter Hamada, Charlie Hartsock, Steve Buscemi, Richard Brener, J.C. Spink, Jonathan Goldstein, Jim Carrey, Jake Weiner, Chris Bender, Vance DeGeneres, Tyler Mitchell, Chad Kultgen, Olivia Wilde, James Gandolfini, Alan Arkin, Don ScardinoDiana Pokorny, Dave Neustadter, Steve Carell, John Francis Daley, Walter Hamada, Charlie Hartsock, Steve Buscemi, Richard Brener, J.C. Spink, Jonathan Goldstein, Jim Carrey, Jake Weiner, Chris Bender, Vance DeGeneres, Tyler Mitchell, Chad Kultgen, Olivia Wilde, James…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '26922854', 'Director': 'Don Scardino', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 25, 2013', 'Actors': 'Steve Carell, Steve Buscemi, Olivia Wilde, Alan Arkin, James Gandolfini', 'Subtitles': 'Portuguese, Spanish, French', 'Producers': 'Diana Pokorny, Chris Bender, Vance DeGeneres, Steve Carell, Charlie Hartsock', 'Studio': 'WarnerBrothers', 'Writers': 'Jonathan Goldstein, John Francis Daley, Chad Kultgen, Tyler Mitchell', 'Number of discs': '1'}\nReview Text: I thought it was a fun movie, enjoyable for what it is:  a slightly predictable movie that doesn't make you think too much.  Made me laugh which is pretty much all I was looking for in it.  I enjoyed everyones performances, esp Steve Buschemi.  I think this one could go either way for most people:  you'll either laugh and love it or just plain hate it.\nReview Title: Enjoyable\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Christmas with the Kranks\nReview Date: 2014/01/14\nStore: Tim Allen  (Actor),     Jamie Lee Curtis  (Actor),     Joe Roth  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['When their only daughter Blair leaves the family nest, Luther and Nora Krank (Tim Allen and Jamie Lee Curtis) decide to book an island cruise to beat the yuletide blues and just skip the holidays. But their decision to boycott tradition has the whole neighborhood in an uproar, and when Blair callson Christmas Eve to announce a surprise visit with her new fiancée, the Kranks have just twelve hours to perform a miracle and pull themselves and their neighbors together to throw the best celebration ever! With fast-paced energy and support from Dan Aykroyd, Cheech Marin, Jake Busey and M. EmmetWalsh, this hilarious adaptation of John Grisham\\'s best-selling novel, \"Skipping Christmas\" has become \"an instant family classic!\" (Gorman Woodfin, CBN)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Family', 'Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Dan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe RothDan Aykroyd, 1492 Pictures, Tim Allen, Michael Barnathan, Mark Radcliffe, Jamie Lee Curtis, Chris Columbus, Cheech Marin, Joe Roth  See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1, 2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.25 x 7.55 inches; 2.4 Ounces', 'Item model number': '2226145', 'Director': 'Joe Roth', 'Media Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'November 8, 2005', 'Actors': 'Tim Allen, Jamie Lee Curtis, Dan Aykroyd, Cheech Marin', 'Dubbed': 'French', 'Subtitles': 'English, French, Mandarin Chinese, Thai', 'Producers': 'Chris Columbus, Michael Barnathan, Mark Radcliffe', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: As far as christmas movies go this is a fun one.  Its definitely nothing serious or dramatic or has hard to uncover themes.  It is just what you want a christmas movie to be.  Lighthearted slapstick and silly.  We enjoy it every year.\nReview Title: christmas fun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Madam Secretary: Season 1\nReview Date: 2016/01/13\nStore: Bebe Neuwirth  (Actor),     Tim Daly  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment\nProduct Description: ['Madam Secretary: Season One 6 DVD set. What would you do if the President of the United States offered you the opportunity to \"affect real change in the world?\" Elizabeth McCord is presented the opportunity to answer just that question. The former CIA analyst, wife, parent and college professor is told by the President that she can think it over, but that he \"won\\'t take no for an answer.\" Moving to Georgetown and taking the Secretary of State position, Elizabeth finds herself contending with problems that could have come from the evening news. She demonstrates great personal integrity and a willingness to circumvent the conventional to solve the world\\'s problems. Elizabeth must balance the pressures of maintaining her family with the demands of the job. Madam Secretary is a reminder of how government should work.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Tea Leoni, Tim Daly, Bebe Neuwirth', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '34272234', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '16 hours and 2 minutes', 'Release date': 'July 19, 2016', 'Actors': 'Bebe Neuwirth, Tim Daly, Tea Leoni', 'Subtitles': 'English, Portuguese', 'Studio': 'Paramount', 'Number of discs': '6'}\nReview Text: A fantastic show!  Season 2 is even better than Season 1 - hard to believe!  Tea Leoni is fantastic as the Secretary of State and gives a strong performance.\nReview Title: A fantastic show! Season 2 is even better than Season ...\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a clear preference for high-quality films, as evidenced by consistently high ratings (mostly 4.5 and above), demonstrating a strong sentiment towards captivating performances and engaging narratives. Their tastes frequently align with dramas and romantic comedies, often featuring intricate emotional themes and character development, but they also appreciate lighter fare that provides entertainment without deep contemplation. \n\nA notable trend is a strong appreciation for stories featuring complex characters and strong acting, commonly highlighted in their reviews, especially regarding performances of lead actors. The individual displays an inclination towards both classic and contemporary cinematic experiences, with purchases spanning different genres.\n\nPrice sensitivity appears moderate; the person opts for DVD and Blu-ray formats, indicating a willingness to invest in quality entertainment rather than seeking solely budget options. The preference for physical media suggests a value for the cinematic experience beyond mere digital access.\n\nOverall, their core preferences revolve around well-constructed narratives, strong character portrayals, and a blend of emotional depth with entertainment quality, often favoring romantic and comedic elements within drama-heavy contexts.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Great show!",
    "text": "My 3 year old son is in love with this show!  Its his favorite to watch in the afternoons before his nap.  He sings the songs and dances around.  We got him a few of the stuffed animal characters from the show and he carries them everywhere.  I highly recommend to toddler/preschool boys and girls!",
    "images": [],
    "asin": "B017TQW3NE",
    "parent_asin": "B017TQW3NE",
    "user_id": "AGE46QM42JCCX5JTZZZ7VA2R7LUA",
    "timestamp": "2016-03-03 04:21:15",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "The Lion Guard: Return of the Roar",
    "average_rating": 4.6,
    "rating_number": 530,
    "features": [],
    "description": [
      "Product Description",
      "Meet Kion, second-born cub of Simba and Nala, as he assumes the role of leader of \"The Lion Guard,\" an elite team of animals tasked with preserving the Pride Lands. Follow him as he assembles a group of unlikely heroes: Bunga the honey badger, Fuli the cheetah, Beshte the hippo and Ono the egret. Join them on a thrilling adventure as they use their unique abilities to defend the Pride Lands from predators and maintain balance within the Circle of Life. Bursting with humor, music, beloved characters and heart, THE LION GUARD: RETURN OF THE ROAR is a must-own for the entire family!",
      "Additional Features",
      "Digital HD is not included with this product."
    ],
    "price": 8.41,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51XeITD+IqL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51XeITD+IqL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71Iw4RmMaYL._SL1352_.jpg"
      }
    ],
    "videos": [],
    "store": "Max Charles  (Actor),     Rob Lowe  (Actor)    Format: DVD",
    "categories": [
      "Movies & TV",
      "Walt Disney Studios Home Entertainment",
      "All Disney Titles"
    ],
    "details": {
      "Aspect Ratio": "1.78:1",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.72 Ounces",
      "Item model number": "13407100",
      "Media Format": "Dolby, Dubbed, NTSC, Subtitled, Widescreen",
      "Run time": "44 minutes",
      "Release date": "February 23, 2016",
      "Actors": "Max Charles, Rob Lowe, Dusan Brown, Sarah Hyland, Khary Payton",
      "Dubbed": "French",
      "Subtitles": "French, Spanish, English",
      "Language": "English (Dolby Digital 5.1), French",
      "Studio": "Walt Disney Studios",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}