{
  "user_id": "AE6AUO3Z6Q5N5VK2JDWGZEGFW4GA",
  "summary": "=== Purchase Information ===\nProduct Title: Back to the Future: The Complete Trilogy\nReview Date: 2003/01/15\nStore: Michael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', 'Experience one of the most popular movie series of all time with Back to the Future: The Complete Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, this unforgettable collection features hours of bonus features and is an unrivaled trilogy that stands the test of time.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Enhanced Conversation with Michael J. Fox', 'Enhanced Conversation with Michael J. Fox', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scenes', 'Deleted Scenes', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Original Makeup Tests', 'Original Makeup Tests', 'Production Archives', 'Production Archives', 'Excerpts from the Original Screenplay', 'Excerpts from the Original Screenplay', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', 'Special Announcements', 'Special Announcements', 'Disc 2 - Back to the Future Part II:', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scene', 'Deleted Scene', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLorean', 'Designing the DeLorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects Shots', 'Evolution of Visual Effects Shots', 'Production Archives', 'Production Archives', 'Huey Lewis & The News \"Power of Love\" Music Video', 'Huey Lewis & The News \"Power of Love\" Music Video', 'Theatrical Trailer', 'Theatrical Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', 'Disc 3 - Back to the Future Part III:', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scene', 'Deleted Scene', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Designing the Town of Hill Valley', 'Designing the Town of Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Production Archives', 'Production Archives', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Theatrical Trailer', 'Theatrical Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', ']]>', 'Amazon.com', 'Filmmaker Robert Zemeckis topped his breakaway hit', 'Romancing the Stone', 'with', 'Back to the Future', \", a joyous comedy with a dazzling hook: what would it be like to meet your parents in their youth? Billed as a special-effects comedy, the imaginative film (the top box-office smash of 1985) has staying power because of the heart behind Zemeckis and Bob Gale's script. High schooler Marty McFly (Michael J. Fox, during the height of his TV success) is catapulted back to the '50s where he sees his parents in their teens, and accidentally changes the history of how Mom and Dad met. Filled with the humorous ideology of the '50s, filtered through the knowledge of the '80s (actor Ronald Reagan is president, ha!), the film comes off as a\", 'Twilight Zone', \"episode written by Preston Sturges. Filled with memorable effects and two wonderfully off-key, perfectly cast performances: Christopher Lloyd as the crazy scientist who builds the time machine (a DeLorean luxury car) and Crispin Glover as Marty's geeky dad.\", '--Doug Thomas', \"Critics and audiences didn't seem too happy with\", 'Back to the Future, Part II', \", the inventive, perhaps too clever sequel. Director Zemeckis and cast bent over backwards to add layers of time-travel complication, and while it surely exercises the brain it isn't necessarily funny in the same way that its predecessor was. It's well worth a visit, though, just to appreciate the imagination that went into it, particularly in a finale that has Marty watching his own actions from the first film.\", '--Tom Keogh', 'Shot back-to-back with the second chapter in the trilogy,', 'Back to the Future, Part III', 'is less hectic than that film and has the same sweet spirit of the first, albeit in a whole new setting. This time, Marty ends up in the Old West of 1885, trying to prevent the death of mad scientist Christopher Lloyd at the hands of gunman Buford \"Mad Dog\" Tannen (Thomas F. Wilson, who had a recurring role as the bully Biff). Director Zemeckis successfully blends exciting special effects with the traditions of a Western and comes up with something original and fun.', '--Tom Keogh', 'Additional Features', 'The DVD set of the', 'Back to the Future', \"trilogy is as classy and professional as the series. Both new and original materials are included in the plethora of extras, starting with two sets of making-of documentaries. Each disc has material on that particular film, and some features look at the trilogy as a whole. Producer-writer Bob Gale is the star of the extra features, candidly presenting the original ideas and many deleted scenes (a few with doses of crude humor). Much of the inside stuff is repeated in the various pieces, but that's to be expected with such exhaustive materials. Michael J. Fox chimes in with a video commentary presented in a picture-in-picture format (which would have worked better as a straight interview) and the producers tackle the main commentary track, but the highlight audio commentary is a free-flowing Q&A with Gale and director Robert Zemeckis in front of a USC film-school audience. Long or short, the materials are uniformly enjoyable and deft, including segments on advertising, special effects tests, on-screen anecdotes, outtakes, production designs, and more.\", '--Doug Thomas', 'See more']\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 7.68 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Anamorphic, Box set, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 42 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Subtitles': 'Spanish', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nReview Text: I don't remember any time that these movies ever looked or sounded so good. Even when they were in theatrical release.  Crisp clear digital sound and picture lead to a great viewing experience. The movies of course are classics, and surprisingly, they have a hefty assortment of extras for them. In a time when movie makers didn't think to make to many extras, there is enough to warrent the purchase of these DVDs.<br />From behind the scenes making-of documentaries to makeup tests and deleted scenes they will keep you clicking around the beautifually rendered menus (designed differently for each movie) for hours.\nReview Title: Movies look great. Many extras!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Star Wars: Episode II - Attack of the Clones (Widescreen Edition)\nReview Date: 2003/04/11\nStore: Ewan McGregor  (Actor),     Natalie Portman  (Actor),     George Lucas  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'The STAR WARS saga continues on DVD with Episode II Attack of the Clones. Anakin Skywalker has grown into an accomplished Jedi apprentice, and he faces his most difficult challenge yet as he must choose between his Jedi duty and forbidden love. Relive the adventure the way it was meant to be seen in spectacular digital clarity, including the climactic Clone War battle and Jedi Master Yoda in the ultimate lightsaber duel. Experience this 2-disc set that features over six hours of bonus materials, and see how Episode II unlocks the secrets of the entire STAR WARS saga.', 'Set Contains:', 'Star Wars: Episode II, Attack of the Clones', 'is a superior DVD, repeating many of the elements that made its predecessor,', 'Episode I, The Phantom Menace', \", so good. The picture and sound are spectacular, helped immensely by the fact that the film was shot entirely in digital, making this the first live-action direct digital-to-digital DVD transfer. This version of the film was the one shown in digital-projection theaters; there are subtle differences from the standard theatrical version, such as showing Anakin's right hand in the final scene. Again, there's a commentary track compiled from various people, including George Lucas (why can't he pronounce the names he created?), producer Rick McCallum, editor Ben Burtt, ILM animation director Rob Coleman, and three visual effects supervisors discussing how the film was made and offering teasers to\", 'Episode III', '.', \"On the second disc are eight deleted scenes with optional introductions. Most interesting are a scene of Padme addressing the Senate to oppose the creation of a Republic army, and some bits with her family and home on Naboo, but it's probably telling that, unlike with\", 'Phantom Menace', ', none of the deleted scenes was incorporated into the film on the DVD. Three substantial documentaries on digital characters, animatics, and creating sound elements are complemented by three insubstantial featurettes, a recycled but interesting 12-part Web documentary, and various other items that should keep fans busy while they wait for', 'Episode III', '.', '--David Horiuchi']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Christopher Lee, Frank Oz, Hayden Christensen, Ian McDiarmid, Jimmy Smits, Natalie Portman, Samuel L. Jackson, George Lucas, Ewan McGregorChristopher Lee, Frank Oz, Hayden Christensen, Ian McDiarmid, Jimmy Smits, Natalie Portman, Samuel L. Jackson, George Lucas, Ewan McGregor   See more', 'Language': 'Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 22 minutes', 'Studio': '20th Century Fox', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 5.12 Ounces', 'Director': 'George Lucas', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Run time': '2 hours and 22 minutes', 'Release date': 'March 22, 2005', 'Actors': 'Ewan McGregor, Natalie Portman, Hayden Christensen, Christopher Lee, Samuel L. Jackson', 'Dubbed': 'French', 'Subtitles': 'English', 'Number of discs': '2'}\nReview Text: First, let me say some positives about this DVD:<br />The image and sound quality are amazing.  This DVD is probably the best quality DVD to date.  Great for showing off a high quality home theater.  Since the movie was shot on digital film, there was almost no ghosting or image quality lost.<br />Now the negatives:<br />What made the original Star Wars movies so spectatular was their campy dialog, fake but realistic special effects (even though you knew it was a fake spaceship you still knew it was a picture of a real model).  The older Star Wars films were mostly a tribute to the cheesey sci-fi movies of the 50's and 60's.  A true space opera, they were classics.<br />Episode II relies mostly on the impressive special effects to mesmerize and entertain.  Acting and story are second to this.  The totally cardboard acting of Haeden Christianson is so bad, that it makes you wonder if he should play an emotionally repressed andriod instead of the future Darth Vader. It made me miss Jar Jar.<br />Oustanding special effects that circumvent the rest of the movie.  This movie seems to be made mostly just to fill a quota and to set up the clearly superior episodes 3-6.  Makes you sad to see a performer past his prime, and Star Wars is way past its prime.\nReview Title: George Lucas has lost his mind.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter and the Chamber of Secrets (Widescreen Edition)\nReview Date: 2003/04/24\nStore: Daniel Radcliffe  (Actor),     Rupert Grint  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Characters & Series, Harry Potter, Harry Potter and the Chamber of Secrets\nProduct Description: ['Product Description', 'The next installment in the Harry Potter series finds young wizard Harry Potter (DANIEL RADCLIFFE) and his friends Ron Weasley (RUPERT GRINT) and Hermione Granger (EMMA WATSON) facing new challenges during their second year at Hogwarts School of Witchcraft and Wizardry as they try to uncover a dark force that is terrorizing the school.', 'HARRY POTTER characters, names, and related indicia are trademarks of and (c) Warner Bros. Entertainment Inc. Harry Potter Publishing Rights (c) J.K.R. (c) 2007 Warner Bros. Entertainment Inc. All rights reserved.', 'Set Contains:', 'The', 'Chamber of Secrets', 'extras are a vast improvement from the first', 'Harry Potter', \"DVD in both substance and navigation. There are no tricks to uncovering all the materials, which include 19 extended or deleted scenes (none of which is a whopper). J.K. Rowling participates in a short interview along with screenwriter Steve Kloves. Other interviews are the standard fare, but highly edited; nearly all the extras focus on kids' interests and attention spans. There are a few areas of Harry's world one can navigate through, with Diagon Alley the highlight. A few simple games are fun, highlighted by the creepy Forbidden Forest game and a reappearance of those scary spiders. Games similar to those on the initial DVD can be found in the vast DVD-ROM section, although the touted navigation by voice commands wears thin fast. The disc feels like a trip to an amusement park more than an examination of the film--just what the kids probably want.\", '--Doug Thomas']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Dolby, Closed-captioned, Color, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Rupert Grint, Emma Watson, Toby Jones, J.K. Rowling, Kenneth Branagh, Richard Griffiths, Fiona Shaw, Jim Norton, Maggie Smith, Daniel Radcliffe, Richard Harris, Harry Melling, Chris Columbus, Steve Kloves, Veronica CliffordRupert Grint, Emma Watson, Toby Jones, J.K. Rowling, Kenneth Branagh, Richard Griffiths, Fiona Shaw, Jim Norton, Maggie Smith, Daniel Radcliffe, Richard Harris, Harry Melling, Chris Columbus, Steve Kloves, Veronica Clifford  See more', 'Language': 'Spanish (Dolby Digital 5.1 EX), English (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '085392359226', 'Director': 'Chris Columbus', 'Media Format': 'Dolby, Closed-captioned, Color, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 41 minutes', 'Release date': 'April 11, 2003', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Richard Harris, Maggie Smith', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'J.K. Rowling, Steve Kloves', 'Number of discs': '2'}\nReview Text: The movie is great.  Very true to the 2nd book.  Since this book was slightly longer than the first, some parts had to be cut from the movie.  These cuts were actually filmed as \"additional scenes\", and are included on the second bonus disk.<br />The image and sound quality is very good especially since a lot of the movie is shot in darker lit areas.  The special effects which looked lower budget in the first movie actually shine in this film.  The scenes of Quidditch will be right up there from action scenes from great sports movies.  You will feel right there among the players.<br />The bonus disk in this DVD set is better than in the first movie.  Its much easier to navigate and the menus are more alive and animated.<br />Overall a great movie adaptation of a fun book. This DVD will be sure to please fans of the movie and of the book.\nReview Title: Great movie, good quality DVD with great bonuses!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spider-Man (Widescreen Special Edition)\nReview Date: 2003/04/24\nStore: Tobey Maguire  (Actor),     Kirsten Dunst  (Actor),     Sam Raimi  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Average teenager Peter Parker is transformed into an extraordinary super hero after he is accidentally bitten by a radioactive spider. When his beloved uncle is savagely murdered during a robbery, young Peter vows to use his powers to avenge his death. Deeming himself \"Spider-Man ,\" he sets about ridding the streets of crime, bringing him into conflict with malevolent super-villain \"Green Goblin.\"', 'Set Contains:', \"When so many DVDs offer making-of featurettes and commentaries, it's a real treat to get something different on the\", 'Spider-Man', 'DVD: a 25-minute documentary, \"Spider-Man: The Mythology of the 21st Century,\" that examines the history of the Marvel comic book through original art and interviews with co-creator Stan Lee and artists such as John Romita, John Romita Jr., Todd McFarlane, and John Byrne. There is also a comics archive and artists gallery. And if you want info about the movie, you can get that, too: a commentary track by director Sam Raimi, actor Kirsten Dunst, producer Laura Ziskin, and co-producer Grant Curtis, plus a technically oriented commentary by the effects crew; pop-up factoids offering trivia about the movie and comic book; occasional Easter eggs leading to featurettes (e.g., 90 seconds on wrestler Randy Savage as Bonesaw McGraw); and promotional documentaries, screen tests, outtakes, and the like.', '--David Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action, Sci-Fi, Adventure, Fantasy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Contributor': 'Sam Raimi, Tobey Maguire, Cliff Robertson, Rosemary Harris, J.K. Simmons, Jack Betts, Elizabeth Banks, Bruce Campbell, Ted Raimi, Willem Dafoe, Myk Watford, Bill Nunn, Michael Papajohn, Kirsten Dunst, Ron Perkins, James Franco, Randy Savage, Stanley Anderson, Gerry Becker, Joe ManganielloSam Raimi, Tobey Maguire, Cliff Robertson, Rosemary Harris, J.K. Simmons, Jack Betts, Elizabeth Banks, Bruce Campbell, Ted Raimi, Willem Dafoe, Myk Watford, Bill Nunn, Michael Papajohn, Kirsten Dunst, Ron Perkins, James Franco, Randy Savage, Stanley Anderson, Gerr…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': 'DV09661', 'Director': 'Sam Raimi', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Run time': '2 hours and 1 minute', 'Release date': 'November 1, 2002', 'Actors': 'Tobey Maguire, Kirsten Dunst, Willem Dafoe, James Franco, Cliff Robertson', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I have never been a fan of comic books so I guess I was at a disadvantage when I watched this.  From what I have seen of Spiderman comis this does do a good job staying true to the spirit of the comics.<br />So many movies today rely too heavily on special effects. This is definately one of those.  Plot exposition and character development come second to displaying great, though overused CGI graphics.<br />The CGI spiderman jumps from building to building with reckless disregard for any sence of physics of laws of gravity.  It looks too fake.  You know he's a superhero, but still it looks too cartoonish.<br />Kirsten Dunst looks great as Mary Jane and Tobey Maguire does a great job as Peter Parker.<br />If you are a fan of comics and comics turned movies this is a must see, otherwise it probably won't be worth seeing.\nReview Title: Overrated film. Though good adaptation of the comic\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gods and Generals (DVD) (WS)\nReview Date: 2003/08/05\nStore: Jeff Daniels  (Actor),     Stephen Lang  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Gods and Generals (DVD) (WS)', 'This sweeping epic charts the early years of the American Civil War --from the Battle of Bull Run to the Battle of Fredricksburg -- exploring the motivations of the combatants and examining the lives of those who waited at home. As director, producer and screenwriter, Ronald F. Maxwell (\"Gettysburg\") proves a triple threat as he brings this epic Civil War saga to the screen. Based on Jeff Shaara\\'s bestseller Gods and Generals--a prequel to the Pulitzer Prize-winning book The Killer Angels by his father, Michael Shaara--the film examines the lives and personalities of Confederate generals Lee and Jackson versus Union generals Hancock and Chamberlain as the pivotal Battle of Gettysburg approaches.', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama, Military & War, Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'William Sanderson, Kali Rocha, Jeff Daniels, Bruce Boxleitner, C. Thomas Howell, Stephen Spacek, Ted Turner, Robert Duvall, Mira Sorvino, Stephen Lang, Alex Hyde White, Ronald F. Maxwell, Mace Neufeld, Jeffrey M. Shaara, Billy Campbell, Kevin Conway, Frankie R. Faison, Moctesuma Esparza, Malachy McCourt, Robert Rehme, Robert Katz, Jeremy LondonWilliam Sanderson, Kali Rocha, Jeff Daniels, Bruce Boxleitner, C. Thomas Howell, Stephen Spacek, Ted Turner, Robert Duvall, Mira Sorvino, Stephen Lang, Alex Hyde White, Ronald F. Maxwell, Mace Neufeld, Jeffrey M. Shaara, Billy Campbell, Kevin Conway, Frankie R. Faison,…  See more', 'Initial release date': '2005-02-08', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 7.2 Ounces', 'Item model number': 'WHV23413DVD', 'Director': 'Ronald F. Maxwell', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 49 minutes', 'Release date': 'February 8, 2005', 'Actors': 'Jeff Daniels, Stephen Lang, Robert Duvall, Mira Sorvino, Kevin Conway', 'Subtitles': 'English, Spanish, French', 'Producers': 'Ronald F. Maxwell, Ted Turner, Robert Katz, Robert Rehme, Moctesuma Esparza', 'Studio': 'Studio Distribution Services', 'Writers': 'Ronald F. Maxwell', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: This movie has been villified by revisionists who believe that the south was wrong, bigoted, hateful, and fought for opression.  Though this may be true in some regards, the majority of the people who fought in this war fought for other reasons, whether it was for state's rights, protecting their homeland, or because they were asked to.  To understand this, you can better appreciate the sacrafice soldiers on both sides had to endure, and this movie captures that idea.<br />There are plenty of extras on this 1 disk DVD, from documentaries on the making of the film, to an interesting biography of Thomas Jackson.  Very interesting is the slave perspective, with viewpoints from the actors who played Martha and Jim, two prominant slave characters in the movie.  The DVD also includes 2 music videos of songs featured in the movie.<br />If you are a history buff, you will most definately love this movie and cherish its themes.  Fans of DVD extras will love the many extra featurettes.  Either way, you can't lose.\nReview Title: Great movie, DVD would be better on 2 disk set\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bowling for Columbine\nReview Date: 2003/09/22\nStore: Caldwell, Michael  (Actor),     Cheney, Dick  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Product Description', \"Documentary concerning the Columbine school shooting incident and dissecting America's fascination with handguns. The project includes interviews with National Rifle Association president Charlton Heston and rocker Marilyn Manson. This film was the first documentary accepted into the Cannes Film Festival in 46 years and won awards.\", 'Set Contains:', 'The', 'Bowling for Columbine', \"DVD has an enthusiastic commentary track by Moore's former receptionists and interns. The now out-of-print two-disc special edition contained an updated voice-over introduction from Michael Moore on the first disc, as well as a direct-to-camera talk on the second disc in which he discussed reactions to the film, and his reaction to winning an Oscar (he had to recite his celebrated acceptance speech because the Academy refused permission for him to show a clip, and he offered his take on who was booing whom). Other extras were good, thoughtful, funny, and provocative interviews with ex-Clinton Press Secretary Joe Lockhart and with film critic Charlie Rose, plus a moving return to Littleton, Colorado--home of Columbine High School--to find out what local people thought of the documentary.\", '--Mark Walker']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Documentary', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSCMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSC   See more', 'Contributor': 'Farmer (II), Joe, McCollum, Evan, Stone, Matt, Clinton, Bill, Harris (XXII), John, Rock, Chris, Ngo, Dinh Diem, Savitch, Jessica, Cheney, Dick, Morgan, Dennis, Clark, Dick, Huebel, Rob, Caldwell, Michael, Dorgan, Byron, McWilliams, Carey, Mauser, Tom, North, Oliver, Hurlin, Dick, Errol, LeonFarmer (II), Joe, McCollum, Evan, Stone, Matt, Clinton, Bill, Harris (XXII), John, Rock, Chris, Ngo, Dinh Diem, Savitch, Jessica, Cheney, Dick, Morgan, Dennis, Clark, Dick, Huebel, Rob, Caldwell, Michael, Dorgan, Byron, McWilliams, Carey, Mauser, Tom, North, Oliver, Hurlin, Dick, Errol, Leon   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSC', 'Run time': '2 hours', 'Release date': 'August 19, 2003', 'Actors': 'Caldwell, Michael, Cheney, Dick, Clark, Dick, Clinton, Bill, Dorgan, Byron', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nReview Text: This film is very well written, filmed, and produced, but is filled with glaring factual problems.  Continually contradictory, the common thesis that the lack of social programs in this country contribute to gun violence.<br />Michael Moore uses sappy music, and saavy editing to pull at the heartstrings while totally disregarding facts.<br />One such misleading fact is the number of gun murders he states.  While our gun deaths are much higher than countries like Germany, France, or Canada, it is actually smaller per capita according to FBI statistics.<br />Also, he takes only homicides for countries like Germany and Canada, but lumps justifiable shootings (cops shooting bad guys), and accidental deaths for the United States.<br />He blames the United State's welfare to work program for the shooting death of 8 year old Kayla Rolland by a classmate. He says the welfare to work program made the shooter's mother work, instead of stay home with her child.<br />He fails to point out that the boy lived in a known crackhouse, where numerous weapons were readily available along with drugs and passed-out drug addicts.<br />These are two of dozens of facts that mislead.  This movie is an entertaing work of FICTION.  Well written, but factually flawed.\nReview Title: Well written and filmed, factually void and flawed.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Benjamin Franklin\nReview Date: 2008/01/18\nStore: Richard Easton  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: [\"Now in his 70s, Franklin is the oldest revolutionary leader. Congress sends Franklin to France in an effort to secure an alliance with England's rival; Franklin's political skills help him coax the French to support the American cause, leading to final American victory at Yorktown. With peace secured, Franklin returns home. Two years later, an ailing Franklin enters the constitutional convention to guide rancorous delegates.\"]\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 210 min', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours and 30 minutes', 'Release date': 'January 24, 2006', 'Actors': 'Richard Easton', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: This clever and entertaining look at the life and times of Benjamin Franklin would be a great addition to the library of any Franklin buff or history buff for that matter.<br /><br />It is well written, and entertainingly presented with a mix of narration and live action.  Richard Easton does a fantastic job portraying Franklin and the cast does well acting out actual correspondences and written first hand accounts from the time.<br /><br />The film is broken down into three segments showing the life of Franklin. Let the Experiment Be Made, The Making of a Revolutionary, and The Chessmaster.<br /><br />Let the experiment be made shows the early life of Franklin, how a genius was made and his contributions to science.<br /><br />The Making of a Revolutionary shows how a man who once considered himself a loyalist became a fierce proponent of independence.<br /><br />The Chessmaster detailed his years in France gaining support for the war, the treaty of France, and the building of the American Experiment in democracy.<br /><br />Ultimately this film does a great job portraying Franklin as a man.  Sometimes flawed, as we all are, but a man who contributed so many things to making America what we know today.<br />It does it with wit, humor, and narration that moves quick and keeps you interested.\nReview Title: Near perfect account of an American Icon\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Team Baby: Baby Nittany Lion [DVD]\nReview Date: 2008/04/26\nStore: Baby Nittany Lion-Penn State University-Raising to  (Actor),     Wyatt Cagle  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: [\"You love your kids, you love your family and you love your Nittany Lions! Now you can combine them all with this exciting Team Baby Entertainment DVD. Featuring Officially Licensed footage of Penn State sports, mascot, marching band and campus attractions along with a Lion-sized view of the sights, sounds, traditions and colors of Pennsylvania State University, BABY NITTANY LION combines all the great things you love about Penn State with all the things you want your little Lion to learn — numbers, letters, colors and more. Narrated by famed NCAA football analyst Lee Corso — and featuring original Team Baby Entertainment music, BABY NITTANY LION is the ideal way to introduce your love of The Pennsylvania State University Nittany Lions to the team's youngest fans. Watch together . . . cheer together . . . learn together. Raising Tomorrow's Penn State Fan Today!\"]\nAverage Rating: 3.0\nProduct Details: {'Genre': 'Romance', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Wyatt Cagle, Baby Nittany Lion-Penn State University-Raising to', 'Language': 'Unqualified', 'Runtime': '30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Director': 'Wyatt Cagle', 'Media Format': 'Color, DVD, NTSC', 'Run time': '30 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Baby Nittany Lion-Penn State University-Raising to', 'Studio': 'Team Marketing', 'Number of discs': '1'}\nReview Text: My six month old son loves this video. Occasionally we'll let him watch it when he sits and plays with his toys.<br /><br />There are sections on Penn State traditions, music, colors, and numbers. It is very basic and kids are drawn to the movement and colors.<br /><br />One thing I like about this as opposed to the Baby Enisten DVDs is that it is basically put in and play. You don't have to sit through trailers or advertisements to get to the stuff baby loves.<br /><br />The video is quick moving, well made. Sound is great!!<br /><br />Wonderful for any Nittany Lion.\nReview Title: This is a great product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Extreme Trains: Season 1\nReview Date: 2011/12/31\nStore: Matt Bown  (Actor),     History Channel  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Special Interests\nProduct Description: ['Your ticket to some of the most thrilling, high-octane train rides in history is here! Extreme Trains host Matt Brown, a real-life railroad conductor from New England, brings his infectious passion for these monster machines to rail journeys across the United States. Feel the force of railroads in history, and see how railroading is about more than machines, cargo and challenging terrain. From the demolition of Penn Station, to the first train robbers and how the Nazis tried to blow up the rails in World War II, to the human blood, sweat and tears of the stokers, engineers, and bathroom cleaners that keep the industry moving, tag along with Matt on one of history s most exciting rides. Episodes include Amtrak s Empire Builder, The Burlington Northern Santa Fe Freight Train, The Norfolk Southern Coal Train, The Ringling Bros. Circus Train,and The Union Pacific Refrigeration Train.']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 4.8 Ounces', 'Director': 'History Channel', 'Media Format': 'Box set, Color, DVD, NTSC, Closed-captioned', 'Run time': '6 hours and 16 minutes', 'Release date': 'June 30, 2009', 'Actors': 'Matt Bown', 'Language': 'Unqualified', 'Studio': 'A&E Home Video', 'Number of discs': '2'}\nReview Text: An avid fan of trans, and model railroading, I love this show. It's the favorite show of my 4 year old who watches an episode at least daily, and knows more about the operations of railroads than most adults because of this show.<br /><br />The camera work is well done, and captures the hard steel and movement of a train. Matt Bown is a great host who adds excitement and his love of trains with the audience, giving great descriptions of the technical aspects of railroading.  You'll walk away from the show with a greater understanding of trains and a deeper love for them as well.<br /><br />The extras are nice, as there are some scenes from nearly every episode that never aired. I would liked to have seen some audio commentary though.\nReview Title: A must for the Railfans, kids, and transpotters\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/04/03\nAverage Rating: 3.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rodney Ascher'], 'Producers': ['Tim Kirk'], 'Starring': ['Bill Blakemore', 'Geoffrey Cocks', 'Juli Kearns'], 'Studio': ['IFC Films', 'AMC Plus Documentaries']}\nReview Text: I was hoping this movie would be a serious look at the symbolism and making of The Shining. Instead it is a poorly made and laughable look at the ideas of numerous crackpots who think cans of baking soda are references to genocide.<br /><br />Basically the film makers spliced together B-roll from other movies, dubbed over tinny recorded interviews of crackpots and made a movie. The opinions and ideas from those interviewed are similar to what you would find in a south philly bar at 3pm.<br /><br />Unwatchable...\nReview Title: Poorly done, boring, interviewees are crazy\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/04/03\nAverage Rating: 4.9\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Paul McGuigan'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss', 'Rebecca Eaton', 'Bethan Jones'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nReview Text: I finally watched Sherlock, and I am hooked. From the first episode, I am a big fan. The first story is so well done, characters are written perfectly, acting is superb, and the way they illustrate the way Sherlock's mind works with superimposed text is a stroke of genious. The first episode is written by Stephen Moffet, so fans of Doctor Who can relate to the quality and depth of the story telling. Masterfully done on all levels. Not a bad episode in either season (Series)\nReview Title: Fantastic story, writing, it will suck you in!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/07/13\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Martha Coolidge'], 'Producers': ['Brian Grazer'], 'Starring': ['Val Kilmer', 'Gabe Jarret', 'William Atherton'], 'Studio': ['COLUMBIA']}\nReview Text: Moles and Trolls Moles and Trolls.  A freaking funny 80s geek movie.  perhaps the best one ever.\nReview Title: This, this is what happens to ice when it gets to cold.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/12/06\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alexander Payne'], 'Producers': ['Michael London', 'George Parra'], 'Starring': ['Paul Giamatti', 'Thomas Haden Church', 'Virginia Madsen'], 'Studio': ['Critically Acclaimed']}\nReview Text: Really a funny, quirky, and great movie. Gave merlot a bad name, but still funny as hell.\nReview Title: Gave Merlot a bad name, but still an awesome movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: World War II with Walter Cronkite [DVD]\nReview Date: 2021/06/10\nStore: Walter Cronkite  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Documentary\nProduct Description: ['WWII was the largest and most destructive war ever waged, engulfing the far reaches of the globe. The defining event of the 20th Century, this was lasted more than five years, spanning three continents and the seven seas, and threatening the future of civilization itself. The legacy of that conflict remains strong today, having shaped and changed our world in a thousand ways. This collection of 8 DVDs, including over 24 hours of archival footage, takes you through the war years, from the Battle of Britain in Europe to the atmoic blasts at Hiroshima and Nagasaki which ended the war in the Pacific. Each theater of operation and major turning point is examined in detail, the great battles and the political struggles, the sacrifies and triumphs of millions of men and women, caught up in the greatest war mankind has ever known.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Military & War', 'Format': 'Color, Box set, NTSC, DVD', 'Contributor': 'N/a, Walter Cronkite', 'Language': 'Unqualified', 'Runtime': '24 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.6 x 5.3 x 2.2 inches; 1.35 Pounds', 'Media Format': 'Color, Box set, NTSC, DVD', 'Run time': '24 hours and 30 minutes', 'Release date': 'August 24, 2005', 'Actors': 'Walter Cronkite', 'Studio': 'Timeless Media', 'Number of discs': '8'}\nReview Text: No other World War 2 Documentary has been as enthralling and well done as these,  in my opinion. Excellently narrated, and well put together this is the gold standard of documentaries on the subject.<br /><br />Unlike more modern documentaries that have new graphics and re creations, this is almost entirely made of archival footage and film reels.  This makes it somuch better in my opinion\nReview Title: One of the best documentaries on WW2\nRating: 5.0\n--------------------------------------------------",
  "reference": "Back to the Future: The Complete Trilogy\nMichael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', 'Experience one of the most popular movie series of all time with Back to the Future: The Complete Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, this unforgettable collection features hours of bonus features and is an unrivaled trilogy that stands the test of time.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Enhanced Conversation with Michael J. Fox', 'Enhanced Conversation with Michael J. Fox', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scenes', 'Deleted Scenes', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Original Makeup Tests', 'Original Makeup Tests', 'Production Archives', 'Production Archives', 'Excerpts from the Original Screenplay', 'Excerpts from the Original Screenplay', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', 'Special Announcements', 'Special Announcements', 'Disc 2 - Back to the Future Part II:', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scene', 'Deleted Scene', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLorean', 'Designing the DeLorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects Shots', 'Evolution of Visual Effects Shots', 'Production Archives', 'Production Archives', 'Huey Lewis & The News \"Power of Love\" Music Video', 'Huey Lewis & The News \"Power of Love\" Music Video', 'Theatrical Trailer', 'Theatrical Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', 'Disc 3 - Back to the Future Part III:', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scene', 'Deleted Scene', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Designing the Town of Hill Valley', 'Designing the Town of Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Production Archives', 'Production Archives', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Theatrical Trailer', 'Theatrical Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', ']]>', 'Amazon.com', 'Filmmaker Robert Zemeckis topped his breakaway hit', 'Romancing the Stone', 'with', 'Back to the Future', \", a joyous comedy with a dazzling hook: what would it be like to meet your parents in their youth? Billed as a special-effects comedy, the imaginative film (the top box-office smash of 1985) has staying power because of the heart behind Zemeckis and Bob Gale's script. High schooler Marty McFly (Michael J. Fox, during the height of his TV success) is catapulted back to the '50s where he sees his parents in their teens, and accidentally changes the history of how Mom and Dad met. Filled with the humorous ideology of the '50s, filtered through the knowledge of the '80s (actor Ronald Reagan is president, ha!), the film comes off as a\", 'Twilight Zone', \"episode written by Preston Sturges. Filled with memorable effects and two wonderfully off-key, perfectly cast performances: Christopher Lloyd as the crazy scientist who builds the time machine (a DeLorean luxury car) and Crispin Glover as Marty's geeky dad.\", '--Doug Thomas', \"Critics and audiences didn't seem too happy with\", 'Back to the Future, Part II', \", the inventive, perhaps too clever sequel. Director Zemeckis and cast bent over backwards to add layers of time-travel complication, and while it surely exercises the brain it isn't necessarily funny in the same way that its predecessor was. It's well worth a visit, though, just to appreciate the imagination that went into it, particularly in a finale that has Marty watching his own actions from the first film.\", '--Tom Keogh', 'Shot back-to-back with the second chapter in the trilogy,', 'Back to the Future, Part III', 'is less hectic than that film and has the same sweet spirit of the first, albeit in a whole new setting. This time, Marty ends up in the Old West of 1885, trying to prevent the death of mad scientist Christopher Lloyd at the hands of gunman Buford \"Mad Dog\" Tannen (Thomas F. Wilson, who had a recurring role as the bully Biff). Director Zemeckis successfully blends exciting special effects with the traditions of a Western and comes up with something original and fun.', '--Tom Keogh', 'Additional Features', 'The DVD set of the', 'Back to the Future', \"trilogy is as classy and professional as the series. Both new and original materials are included in the plethora of extras, starting with two sets of making-of documentaries. Each disc has material on that particular film, and some features look at the trilogy as a whole. Producer-writer Bob Gale is the star of the extra features, candidly presenting the original ideas and many deleted scenes (a few with doses of crude humor). Much of the inside stuff is repeated in the various pieces, but that's to be expected with such exhaustive materials. Michael J. Fox chimes in with a video commentary presented in a picture-in-picture format (which would have worked better as a straight interview) and the producers tackle the main commentary track, but the highlight audio commentary is a free-flowing Q&A with Gale and director Robert Zemeckis in front of a USC film-school audience. Long or short, the materials are uniformly enjoyable and deft, including segments on advertising, special effects tests, on-screen anecdotes, outtakes, production designs, and more.\", '--Doug Thomas', 'See more']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 7.68 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Anamorphic, Box set, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 42 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Subtitles': 'Spanish', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nI don't remember any time that these movies ever looked or sounded so good. Even when they were in theatrical release.  Crisp clear digital sound and picture lead to a great viewing experience. The movies of course are classics, and surprisingly, they have a hefty assortment of extras for them. In a time when movie makers didn't think to make to many extras, there is enough to warrent the purchase of these DVDs.<br />From behind the scenes making-of documentaries to makeup tests and deleted scenes they will keep you clicking around the beautifually rendered menus (designed differently for each movie) for hours.\nMovies look great. Many extras!\nStar Wars: Episode II - Attack of the Clones (Widescreen Edition)\nEwan McGregor  (Actor),     Natalie Portman  (Actor),     George Lucas  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'The STAR WARS saga continues on DVD with Episode II Attack of the Clones. Anakin Skywalker has grown into an accomplished Jedi apprentice, and he faces his most difficult challenge yet as he must choose between his Jedi duty and forbidden love. Relive the adventure the way it was meant to be seen in spectacular digital clarity, including the climactic Clone War battle and Jedi Master Yoda in the ultimate lightsaber duel. Experience this 2-disc set that features over six hours of bonus materials, and see how Episode II unlocks the secrets of the entire STAR WARS saga.', 'Set Contains:', 'Star Wars: Episode II, Attack of the Clones', 'is a superior DVD, repeating many of the elements that made its predecessor,', 'Episode I, The Phantom Menace', \", so good. The picture and sound are spectacular, helped immensely by the fact that the film was shot entirely in digital, making this the first live-action direct digital-to-digital DVD transfer. This version of the film was the one shown in digital-projection theaters; there are subtle differences from the standard theatrical version, such as showing Anakin's right hand in the final scene. Again, there's a commentary track compiled from various people, including George Lucas (why can't he pronounce the names he created?), producer Rick McCallum, editor Ben Burtt, ILM animation director Rob Coleman, and three visual effects supervisors discussing how the film was made and offering teasers to\", 'Episode III', '.', \"On the second disc are eight deleted scenes with optional introductions. Most interesting are a scene of Padme addressing the Senate to oppose the creation of a Republic army, and some bits with her family and home on Naboo, but it's probably telling that, unlike with\", 'Phantom Menace', ', none of the deleted scenes was incorporated into the film on the DVD. Three substantial documentaries on digital characters, animatics, and creating sound elements are complemented by three insubstantial featurettes, a recycled but interesting 12-part Web documentary, and various other items that should keep fans busy while they wait for', 'Episode III', '.', '--David Horiuchi']\n{'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Christopher Lee, Frank Oz, Hayden Christensen, Ian McDiarmid, Jimmy Smits, Natalie Portman, Samuel L. Jackson, George Lucas, Ewan McGregorChristopher Lee, Frank Oz, Hayden Christensen, Ian McDiarmid, Jimmy Smits, Natalie Portman, Samuel L. Jackson, George Lucas, Ewan McGregor   See more', 'Language': 'Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 22 minutes', 'Studio': '20th Century Fox', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 5.12 Ounces', 'Director': 'George Lucas', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Run time': '2 hours and 22 minutes', 'Release date': 'March 22, 2005', 'Actors': 'Ewan McGregor, Natalie Portman, Hayden Christensen, Christopher Lee, Samuel L. Jackson', 'Dubbed': 'French', 'Subtitles': 'English', 'Number of discs': '2'}\nFirst, let me say some positives about this DVD:<br />The image and sound quality are amazing.  This DVD is probably the best quality DVD to date.  Great for showing off a high quality home theater.  Since the movie was shot on digital film, there was almost no ghosting or image quality lost.<br />Now the negatives:<br />What made the original Star Wars movies so spectatular was their campy dialog, fake but realistic special effects (even though you knew it was a fake spaceship you still knew it was a picture of a real model).  The older Star Wars films were mostly a tribute to the cheesey sci-fi movies of the 50's and 60's.  A true space opera, they were classics.<br />Episode II relies mostly on the impressive special effects to mesmerize and entertain.  Acting and story are second to this.  The totally cardboard acting of Haeden Christianson is so bad, that it makes you wonder if he should play an emotionally repressed andriod instead of the future Darth Vader. It made me miss Jar Jar.<br />Oustanding special effects that circumvent the rest of the movie.  This movie seems to be made mostly just to fill a quota and to set up the clearly superior episodes 3-6.  Makes you sad to see a performer past his prime, and Star Wars is way past its prime.\nGeorge Lucas has lost his mind.\nHarry Potter and the Chamber of Secrets (Widescreen Edition)\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Characters & Series, Harry Potter, Harry Potter and the Chamber of Secrets\n['Product Description', 'The next installment in the Harry Potter series finds young wizard Harry Potter (DANIEL RADCLIFFE) and his friends Ron Weasley (RUPERT GRINT) and Hermione Granger (EMMA WATSON) facing new challenges during their second year at Hogwarts School of Witchcraft and Wizardry as they try to uncover a dark force that is terrorizing the school.', 'HARRY POTTER characters, names, and related indicia are trademarks of and (c) Warner Bros. Entertainment Inc. Harry Potter Publishing Rights (c) J.K.R. (c) 2007 Warner Bros. Entertainment Inc. All rights reserved.', 'Set Contains:', 'The', 'Chamber of Secrets', 'extras are a vast improvement from the first', 'Harry Potter', \"DVD in both substance and navigation. There are no tricks to uncovering all the materials, which include 19 extended or deleted scenes (none of which is a whopper). J.K. Rowling participates in a short interview along with screenwriter Steve Kloves. Other interviews are the standard fare, but highly edited; nearly all the extras focus on kids' interests and attention spans. There are a few areas of Harry's world one can navigate through, with Diagon Alley the highlight. A few simple games are fun, highlighted by the creepy Forbidden Forest game and a reappearance of those scary spiders. Games similar to those on the initial DVD can be found in the vast DVD-ROM section, although the touted navigation by voice commands wears thin fast. The disc feels like a trip to an amusement park more than an examination of the film--just what the kids probably want.\", '--Doug Thomas']\n{'Format': 'Dolby, Closed-captioned, Color, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Rupert Grint, Emma Watson, Toby Jones, J.K. Rowling, Kenneth Branagh, Richard Griffiths, Fiona Shaw, Jim Norton, Maggie Smith, Daniel Radcliffe, Richard Harris, Harry Melling, Chris Columbus, Steve Kloves, Veronica CliffordRupert Grint, Emma Watson, Toby Jones, J.K. Rowling, Kenneth Branagh, Richard Griffiths, Fiona Shaw, Jim Norton, Maggie Smith, Daniel Radcliffe, Richard Harris, Harry Melling, Chris Columbus, Steve Kloves, Veronica Clifford  See more', 'Language': 'Spanish (Dolby Digital 5.1 EX), English (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '085392359226', 'Director': 'Chris Columbus', 'Media Format': 'Dolby, Closed-captioned, Color, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 41 minutes', 'Release date': 'April 11, 2003', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Richard Harris, Maggie Smith', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'J.K. Rowling, Steve Kloves', 'Number of discs': '2'}\nThe movie is great.  Very true to the 2nd book.  Since this book was slightly longer than the first, some parts had to be cut from the movie.  These cuts were actually filmed as \"additional scenes\", and are included on the second bonus disk.<br />The image and sound quality is very good especially since a lot of the movie is shot in darker lit areas.  The special effects which looked lower budget in the first movie actually shine in this film.  The scenes of Quidditch will be right up there from action scenes from great sports movies.  You will feel right there among the players.<br />The bonus disk in this DVD set is better than in the first movie.  Its much easier to navigate and the menus are more alive and animated.<br />Overall a great movie adaptation of a fun book. This DVD will be sure to please fans of the movie and of the book.\nGreat movie, good quality DVD with great bonuses!\nSpider-Man (Widescreen Special Edition)\nTobey Maguire  (Actor),     Kirsten Dunst  (Actor),     Sam Raimi  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Average teenager Peter Parker is transformed into an extraordinary super hero after he is accidentally bitten by a radioactive spider. When his beloved uncle is savagely murdered during a robbery, young Peter vows to use his powers to avenge his death. Deeming himself \"Spider-Man ,\" he sets about ridding the streets of crime, bringing him into conflict with malevolent super-villain \"Green Goblin.\"', 'Set Contains:', \"When so many DVDs offer making-of featurettes and commentaries, it's a real treat to get something different on the\", 'Spider-Man', 'DVD: a 25-minute documentary, \"Spider-Man: The Mythology of the 21st Century,\" that examines the history of the Marvel comic book through original art and interviews with co-creator Stan Lee and artists such as John Romita, John Romita Jr., Todd McFarlane, and John Byrne. There is also a comics archive and artists gallery. And if you want info about the movie, you can get that, too: a commentary track by director Sam Raimi, actor Kirsten Dunst, producer Laura Ziskin, and co-producer Grant Curtis, plus a technically oriented commentary by the effects crew; pop-up factoids offering trivia about the movie and comic book; occasional Easter eggs leading to featurettes (e.g., 90 seconds on wrestler Randy Savage as Bonesaw McGraw); and promotional documentaries, screen tests, outtakes, and the like.', '--David Horiuchi']\n{'Genre': 'Action, Sci-Fi, Adventure, Fantasy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Contributor': 'Sam Raimi, Tobey Maguire, Cliff Robertson, Rosemary Harris, J.K. Simmons, Jack Betts, Elizabeth Banks, Bruce Campbell, Ted Raimi, Willem Dafoe, Myk Watford, Bill Nunn, Michael Papajohn, Kirsten Dunst, Ron Perkins, James Franco, Randy Savage, Stanley Anderson, Gerry Becker, Joe ManganielloSam Raimi, Tobey Maguire, Cliff Robertson, Rosemary Harris, J.K. Simmons, Jack Betts, Elizabeth Banks, Bruce Campbell, Ted Raimi, Willem Dafoe, Myk Watford, Bill Nunn, Michael Papajohn, Kirsten Dunst, Ron Perkins, James Franco, Randy Savage, Stanley Anderson, Gerr…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': 'DV09661', 'Director': 'Sam Raimi', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Run time': '2 hours and 1 minute', 'Release date': 'November 1, 2002', 'Actors': 'Tobey Maguire, Kirsten Dunst, Willem Dafoe, James Franco, Cliff Robertson', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI have never been a fan of comic books so I guess I was at a disadvantage when I watched this.  From what I have seen of Spiderman comis this does do a good job staying true to the spirit of the comics.<br />So many movies today rely too heavily on special effects. This is definately one of those.  Plot exposition and character development come second to displaying great, though overused CGI graphics.<br />The CGI spiderman jumps from building to building with reckless disregard for any sence of physics of laws of gravity.  It looks too fake.  You know he's a superhero, but still it looks too cartoonish.<br />Kirsten Dunst looks great as Mary Jane and Tobey Maguire does a great job as Peter Parker.<br />If you are a fan of comics and comics turned movies this is a must see, otherwise it probably won't be worth seeing.\nOverrated film. Though good adaptation of the comic\nGods and Generals (DVD) (WS)\nJeff Daniels  (Actor),     Stephen Lang  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Gods and Generals (DVD) (WS)', 'This sweeping epic charts the early years of the American Civil War --from the Battle of Bull Run to the Battle of Fredricksburg -- exploring the motivations of the combatants and examining the lives of those who waited at home. As director, producer and screenwriter, Ronald F. Maxwell (\"Gettysburg\") proves a triple threat as he brings this epic Civil War saga to the screen. Based on Jeff Shaara\\'s bestseller Gods and Generals--a prequel to the Pulitzer Prize-winning book The Killer Angels by his father, Michael Shaara--the film examines the lives and personalities of Confederate generals Lee and Jackson versus Union generals Hancock and Chamberlain as the pivotal Battle of Gettysburg approaches.', ']]>']\n{'Genre': 'Drama, Military & War, Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'William Sanderson, Kali Rocha, Jeff Daniels, Bruce Boxleitner, C. Thomas Howell, Stephen Spacek, Ted Turner, Robert Duvall, Mira Sorvino, Stephen Lang, Alex Hyde White, Ronald F. Maxwell, Mace Neufeld, Jeffrey M. Shaara, Billy Campbell, Kevin Conway, Frankie R. Faison, Moctesuma Esparza, Malachy McCourt, Robert Rehme, Robert Katz, Jeremy LondonWilliam Sanderson, Kali Rocha, Jeff Daniels, Bruce Boxleitner, C. Thomas Howell, Stephen Spacek, Ted Turner, Robert Duvall, Mira Sorvino, Stephen Lang, Alex Hyde White, Ronald F. Maxwell, Mace Neufeld, Jeffrey M. Shaara, Billy Campbell, Kevin Conway, Frankie R. Faison,…  See more', 'Initial release date': '2005-02-08', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 7.2 Ounces', 'Item model number': 'WHV23413DVD', 'Director': 'Ronald F. Maxwell', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 49 minutes', 'Release date': 'February 8, 2005', 'Actors': 'Jeff Daniels, Stephen Lang, Robert Duvall, Mira Sorvino, Kevin Conway', 'Subtitles': 'English, Spanish, French', 'Producers': 'Ronald F. Maxwell, Ted Turner, Robert Katz, Robert Rehme, Moctesuma Esparza', 'Studio': 'Studio Distribution Services', 'Writers': 'Ronald F. Maxwell', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis movie has been villified by revisionists who believe that the south was wrong, bigoted, hateful, and fought for opression.  Though this may be true in some regards, the majority of the people who fought in this war fought for other reasons, whether it was for state's rights, protecting their homeland, or because they were asked to.  To understand this, you can better appreciate the sacrafice soldiers on both sides had to endure, and this movie captures that idea.<br />There are plenty of extras on this 1 disk DVD, from documentaries on the making of the film, to an interesting biography of Thomas Jackson.  Very interesting is the slave perspective, with viewpoints from the actors who played Martha and Jim, two prominant slave characters in the movie.  The DVD also includes 2 music videos of songs featured in the movie.<br />If you are a history buff, you will most definately love this movie and cherish its themes.  Fans of DVD extras will love the many extra featurettes.  Either way, you can't lose.\nGreat movie, DVD would be better on 2 disk set\nBowling for Columbine\nCaldwell, Michael  (Actor),     Cheney, Dick  (Actor)    Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Product Description', \"Documentary concerning the Columbine school shooting incident and dissecting America's fascination with handguns. The project includes interviews with National Rifle Association president Charlton Heston and rocker Marilyn Manson. This film was the first documentary accepted into the Cannes Film Festival in 46 years and won awards.\", 'Set Contains:', 'The', 'Bowling for Columbine', \"DVD has an enthusiastic commentary track by Moore's former receptionists and interns. The now out-of-print two-disc special edition contained an updated voice-over introduction from Michael Moore on the first disc, as well as a direct-to-camera talk on the second disc in which he discussed reactions to the film, and his reaction to winning an Oscar (he had to recite his celebrated acceptance speech because the Academy refused permission for him to show a clip, and he offered his take on who was booing whom). Other extras were good, thoughtful, funny, and provocative interviews with ex-Clinton Press Secretary Joe Lockhart and with film critic Charlie Rose, plus a moving return to Littleton, Colorado--home of Columbine High School--to find out what local people thought of the documentary.\", '--Mark Walker']\n{'Genre': 'Documentary', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSCMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSC   See more', 'Contributor': 'Farmer (II), Joe, McCollum, Evan, Stone, Matt, Clinton, Bill, Harris (XXII), John, Rock, Chris, Ngo, Dinh Diem, Savitch, Jessica, Cheney, Dick, Morgan, Dennis, Clark, Dick, Huebel, Rob, Caldwell, Michael, Dorgan, Byron, McWilliams, Carey, Mauser, Tom, North, Oliver, Hurlin, Dick, Errol, LeonFarmer (II), Joe, McCollum, Evan, Stone, Matt, Clinton, Bill, Harris (XXII), John, Rock, Chris, Ngo, Dinh Diem, Savitch, Jessica, Cheney, Dick, Morgan, Dennis, Clark, Dick, Huebel, Rob, Caldwell, Michael, Dorgan, Byron, McWilliams, Carey, Mauser, Tom, North, Oliver, Hurlin, Dick, Errol, Leon   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSC', 'Run time': '2 hours', 'Release date': 'August 19, 2003', 'Actors': 'Caldwell, Michael, Cheney, Dick, Clark, Dick, Clinton, Bill, Dorgan, Byron', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nThis film is very well written, filmed, and produced, but is filled with glaring factual problems.  Continually contradictory, the common thesis that the lack of social programs in this country contribute to gun violence.<br />Michael Moore uses sappy music, and saavy editing to pull at the heartstrings while totally disregarding facts.<br />One such misleading fact is the number of gun murders he states.  While our gun deaths are much higher than countries like Germany, France, or Canada, it is actually smaller per capita according to FBI statistics.<br />Also, he takes only homicides for countries like Germany and Canada, but lumps justifiable shootings (cops shooting bad guys), and accidental deaths for the United States.<br />He blames the United State's welfare to work program for the shooting death of 8 year old Kayla Rolland by a classmate. He says the welfare to work program made the shooter's mother work, instead of stay home with her child.<br />He fails to point out that the boy lived in a known crackhouse, where numerous weapons were readily available along with drugs and passed-out drug addicts.<br />These are two of dozens of facts that mislead.  This movie is an entertaing work of FICTION.  Well written, but factually flawed.\nWell written and filmed, factually void and flawed.\nBenjamin Franklin\nRichard Easton  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n[\"Now in his 70s, Franklin is the oldest revolutionary leader. Congress sends Franklin to France in an effort to secure an alliance with England's rival; Franklin's political skills help him coax the French to support the American cause, leading to final American victory at Yorktown. With peace secured, Franklin returns home. Two years later, an ailing Franklin enters the constitutional convention to guide rancorous delegates.\"]\n{'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 210 min', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours and 30 minutes', 'Release date': 'January 24, 2006', 'Actors': 'Richard Easton', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nThis clever and entertaining look at the life and times of Benjamin Franklin would be a great addition to the library of any Franklin buff or history buff for that matter.<br /><br />It is well written, and entertainingly presented with a mix of narration and live action.  Richard Easton does a fantastic job portraying Franklin and the cast does well acting out actual correspondences and written first hand accounts from the time.<br /><br />The film is broken down into three segments showing the life of Franklin. Let the Experiment Be Made, The Making of a Revolutionary, and The Chessmaster.<br /><br />Let the experiment be made shows the early life of Franklin, how a genius was made and his contributions to science.<br /><br />The Making of a Revolutionary shows how a man who once considered himself a loyalist became a fierce proponent of independence.<br /><br />The Chessmaster detailed his years in France gaining support for the war, the treaty of France, and the building of the American Experiment in democracy.<br /><br />Ultimately this film does a great job portraying Franklin as a man.  Sometimes flawed, as we all are, but a man who contributed so many things to making America what we know today.<br />It does it with wit, humor, and narration that moves quick and keeps you interested.\nNear perfect account of an American Icon\nTeam Baby: Baby Nittany Lion [DVD]\nBaby Nittany Lion-Penn State University-Raising to  (Actor),     Wyatt Cagle  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"You love your kids, you love your family and you love your Nittany Lions! Now you can combine them all with this exciting Team Baby Entertainment DVD. Featuring Officially Licensed footage of Penn State sports, mascot, marching band and campus attractions along with a Lion-sized view of the sights, sounds, traditions and colors of Pennsylvania State University, BABY NITTANY LION combines all the great things you love about Penn State with all the things you want your little Lion to learn — numbers, letters, colors and more. Narrated by famed NCAA football analyst Lee Corso — and featuring original Team Baby Entertainment music, BABY NITTANY LION is the ideal way to introduce your love of The Pennsylvania State University Nittany Lions to the team's youngest fans. Watch together . . . cheer together . . . learn together. Raising Tomorrow's Penn State Fan Today!\"]\n{'Genre': 'Romance', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Wyatt Cagle, Baby Nittany Lion-Penn State University-Raising to', 'Language': 'Unqualified', 'Runtime': '30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Director': 'Wyatt Cagle', 'Media Format': 'Color, DVD, NTSC', 'Run time': '30 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Baby Nittany Lion-Penn State University-Raising to', 'Studio': 'Team Marketing', 'Number of discs': '1'}\nMy six month old son loves this video. Occasionally we'll let him watch it when he sits and plays with his toys.<br /><br />There are sections on Penn State traditions, music, colors, and numbers. It is very basic and kids are drawn to the movement and colors.<br /><br />One thing I like about this as opposed to the Baby Enisten DVDs is that it is basically put in and play. You don't have to sit through trailers or advertisements to get to the stuff baby loves.<br /><br />The video is quick moving, well made. Sound is great!!<br /><br />Wonderful for any Nittany Lion.\nThis is a great product\nExtreme Trains: Season 1\nMatt Bown  (Actor),     History Channel  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n['Your ticket to some of the most thrilling, high-octane train rides in history is here! Extreme Trains host Matt Brown, a real-life railroad conductor from New England, brings his infectious passion for these monster machines to rail journeys across the United States. Feel the force of railroads in history, and see how railroading is about more than machines, cargo and challenging terrain. From the demolition of Penn Station, to the first train robbers and how the Nazis tried to blow up the rails in World War II, to the human blood, sweat and tears of the stokers, engineers, and bathroom cleaners that keep the industry moving, tag along with Matt on one of history s most exciting rides. Episodes include Amtrak s Empire Builder, The Burlington Northern Santa Fe Freight Train, The Norfolk Southern Coal Train, The Ringling Bros. Circus Train,and The Union Pacific Refrigeration Train.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 4.8 Ounces', 'Director': 'History Channel', 'Media Format': 'Box set, Color, DVD, NTSC, Closed-captioned', 'Run time': '6 hours and 16 minutes', 'Release date': 'June 30, 2009', 'Actors': 'Matt Bown', 'Language': 'Unqualified', 'Studio': 'A&E Home Video', 'Number of discs': '2'}\nAn avid fan of trans, and model railroading, I love this show. It's the favorite show of my 4 year old who watches an episode at least daily, and knows more about the operations of railroads than most adults because of this show.<br /><br />The camera work is well done, and captures the hard steel and movement of a train. Matt Bown is a great host who adds excitement and his love of trains with the audience, giving great descriptions of the technical aspects of railroading.  You'll walk away from the show with a greater understanding of trains and a deeper love for them as well.<br /><br />The extras are nice, as there are some scenes from nearly every episode that never aired. I would liked to have seen some audio commentary though.\nA must for the Railfans, kids, and transpotters\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rodney Ascher'], 'Producers': ['Tim Kirk'], 'Starring': ['Bill Blakemore', 'Geoffrey Cocks', 'Juli Kearns'], 'Studio': ['IFC Films', 'AMC Plus Documentaries']}\nI was hoping this movie would be a serious look at the symbolism and making of The Shining. Instead it is a poorly made and laughable look at the ideas of numerous crackpots who think cans of baking soda are references to genocide.<br /><br />Basically the film makers spliced together B-roll from other movies, dubbed over tinny recorded interviews of crackpots and made a movie. The opinions and ideas from those interviewed are similar to what you would find in a south philly bar at 3pm.<br /><br />Unwatchable...\nPoorly done, boring, interviewees are crazy\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Paul McGuigan'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss', 'Rebecca Eaton', 'Bethan Jones'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nI finally watched Sherlock, and I am hooked. From the first episode, I am a big fan. The first story is so well done, characters are written perfectly, acting is superb, and the way they illustrate the way Sherlock's mind works with superimposed text is a stroke of genious. The first episode is written by Stephen Moffet, so fans of Doctor Who can relate to the quality and depth of the story telling. Masterfully done on all levels. Not a bad episode in either season (Series)\nFantastic story, writing, it will suck you in!\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Martha Coolidge'], 'Producers': ['Brian Grazer'], 'Starring': ['Val Kilmer', 'Gabe Jarret', 'William Atherton'], 'Studio': ['COLUMBIA']}\nMoles and Trolls Moles and Trolls.  A freaking funny 80s geek movie.  perhaps the best one ever.\nThis, this is what happens to ice when it gets to cold.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alexander Payne'], 'Producers': ['Michael London', 'George Parra'], 'Starring': ['Paul Giamatti', 'Thomas Haden Church', 'Virginia Madsen'], 'Studio': ['Critically Acclaimed']}\nReally a funny, quirky, and great movie. Gave merlot a bad name, but still funny as hell.\nGave Merlot a bad name, but still an awesome movie\nWorld War II with Walter Cronkite [DVD]\nWalter Cronkite  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Documentary\n['WWII was the largest and most destructive war ever waged, engulfing the far reaches of the globe. The defining event of the 20th Century, this was lasted more than five years, spanning three continents and the seven seas, and threatening the future of civilization itself. The legacy of that conflict remains strong today, having shaped and changed our world in a thousand ways. This collection of 8 DVDs, including over 24 hours of archival footage, takes you through the war years, from the Battle of Britain in Europe to the atmoic blasts at Hiroshima and Nagasaki which ended the war in the Pacific. Each theater of operation and major turning point is examined in detail, the great battles and the political struggles, the sacrifies and triumphs of millions of men and women, caught up in the greatest war mankind has ever known.']\n{'Genre': 'Military & War', 'Format': 'Color, Box set, NTSC, DVD', 'Contributor': 'N/a, Walter Cronkite', 'Language': 'Unqualified', 'Runtime': '24 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.6 x 5.3 x 2.2 inches; 1.35 Pounds', 'Media Format': 'Color, Box set, NTSC, DVD', 'Run time': '24 hours and 30 minutes', 'Release date': 'August 24, 2005', 'Actors': 'Walter Cronkite', 'Studio': 'Timeless Media', 'Number of discs': '8'}\nNo other World War 2 Documentary has been as enthralling and well done as these,  in my opinion. Excellently narrated, and well put together this is the gold standard of documentaries on the subject.<br /><br />Unlike more modern documentaries that have new graphics and re creations, this is almost entirely made of archival footage and film reels.  This makes it somuch better in my opinion\nOne of the best documentaries on WW2",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Back to the Future: The Complete Trilogy\nReview Date: 2003/01/15\nStore: Michael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', 'Experience one of the most popular movie series of all time with Back to the Future: The Complete Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, this unforgettable collection features hours of bonus features and is an unrivaled trilogy that stands the test of time.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Enhanced Conversation with Michael J. Fox', 'Enhanced Conversation with Michael J. Fox', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scenes', 'Deleted Scenes', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Original Makeup Tests', 'Original Makeup Tests', 'Production Archives', 'Production Archives', 'Excerpts from the Original Screenplay', 'Excerpts from the Original Screenplay', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', 'Special Announcements', 'Special Announcements', 'Disc 2 - Back to the Future Part II:', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scene', 'Deleted Scene', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLorean', 'Designing the DeLorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects Shots', 'Evolution of Visual Effects Shots', 'Production Archives', 'Production Archives', 'Huey Lewis & The News \"Power of Love\" Music Video', 'Huey Lewis & The News \"Power of Love\" Music Video', 'Theatrical Trailer', 'Theatrical Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', 'Disc 3 - Back to the Future Part III:', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Deleted Scene', 'Deleted Scene', 'Outtakes', 'Outtakes', 'Did You Know That? Universal Animated Anecdotes', 'Did You Know That? Universal Animated Anecdotes', 'Designing the Town of Hill Valley', 'Designing the Town of Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Production Archives', 'Production Archives', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Theatrical Trailer', 'Theatrical Trailer', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Production Notes', 'Production Notes', 'DVD-ROM Features Including Total Axess', 'DVD-ROM Features Including Total Axess', 'Recommendations', 'Recommendations', ']]>', 'Amazon.com', 'Filmmaker Robert Zemeckis topped his breakaway hit', 'Romancing the Stone', 'with', 'Back to the Future', \", a joyous comedy with a dazzling hook: what would it be like to meet your parents in their youth? Billed as a special-effects comedy, the imaginative film (the top box-office smash of 1985) has staying power because of the heart behind Zemeckis and Bob Gale's script. High schooler Marty McFly (Michael J. Fox, during the height of his TV success) is catapulted back to the '50s where he sees his parents in their teens, and accidentally changes the history of how Mom and Dad met. Filled with the humorous ideology of the '50s, filtered through the knowledge of the '80s (actor Ronald Reagan is president, ha!), the film comes off as a\", 'Twilight Zone', \"episode written by Preston Sturges. Filled with memorable effects and two wonderfully off-key, perfectly cast performances: Christopher Lloyd as the crazy scientist who builds the time machine (a DeLorean luxury car) and Crispin Glover as Marty's geeky dad.\", '--Doug Thomas', \"Critics and audiences didn't seem too happy with\", 'Back to the Future, Part II', \", the inventive, perhaps too clever sequel. Director Zemeckis and cast bent over backwards to add layers of time-travel complication, and while it surely exercises the brain it isn't necessarily funny in the same way that its predecessor was. It's well worth a visit, though, just to appreciate the imagination that went into it, particularly in a finale that has Marty watching his own actions from the first film.\", '--Tom Keogh', 'Shot back-to-back with the second chapter in the trilogy,', 'Back to the Future, Part III', 'is less hectic than that film and has the same sweet spirit of the first, albeit in a whole new setting. This time, Marty ends up in the Old West of 1885, trying to prevent the death of mad scientist Christopher Lloyd at the hands of gunman Buford \"Mad Dog\" Tannen (Thomas F. Wilson, who had a recurring role as the bully Biff). Director Zemeckis successfully blends exciting special effects with the traditions of a Western and comes up with something original and fun.', '--Tom Keogh', 'Additional Features', 'The DVD set of the', 'Back to the Future', \"trilogy is as classy and professional as the series. Both new and original materials are included in the plethora of extras, starting with two sets of making-of documentaries. Each disc has material on that particular film, and some features look at the trilogy as a whole. Producer-writer Bob Gale is the star of the extra features, candidly presenting the original ideas and many deleted scenes (a few with doses of crude humor). Much of the inside stuff is repeated in the various pieces, but that's to be expected with such exhaustive materials. Michael J. Fox chimes in with a video commentary presented in a picture-in-picture format (which would have worked better as a straight interview) and the producers tackle the main commentary track, but the highlight audio commentary is a free-flowing Q&A with Gale and director Robert Zemeckis in front of a USC film-school audience. Long or short, the materials are uniformly enjoyable and deft, including segments on advertising, special effects tests, on-screen anecdotes, outtakes, production designs, and more.\", '--Doug Thomas', 'See more']\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 7.68 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Anamorphic, Box set, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 42 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Subtitles': 'Spanish', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nReview Text: I don't remember any time that these movies ever looked or sounded so good. Even when they were in theatrical release.  Crisp clear digital sound and picture lead to a great viewing experience. The movies of course are classics, and surprisingly, they have a hefty assortment of extras for them. In a time when movie makers didn't think to make to many extras, there is enough to warrent the purchase of these DVDs.<br />From behind the scenes making-of documentaries to makeup tests and deleted scenes they will keep you clicking around the beautifually rendered menus (designed differently for each movie) for hours.\nReview Title: Movies look great. Many extras!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Star Wars: Episode II - Attack of the Clones (Widescreen Edition)\nReview Date: 2003/04/11\nStore: Ewan McGregor  (Actor),     Natalie Portman  (Actor),     George Lucas  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'The STAR WARS saga continues on DVD with Episode II Attack of the Clones. Anakin Skywalker has grown into an accomplished Jedi apprentice, and he faces his most difficult challenge yet as he must choose between his Jedi duty and forbidden love. Relive the adventure the way it was meant to be seen in spectacular digital clarity, including the climactic Clone War battle and Jedi Master Yoda in the ultimate lightsaber duel. Experience this 2-disc set that features over six hours of bonus materials, and see how Episode II unlocks the secrets of the entire STAR WARS saga.', 'Set Contains:', 'Star Wars: Episode II, Attack of the Clones', 'is a superior DVD, repeating many of the elements that made its predecessor,', 'Episode I, The Phantom Menace', \", so good. The picture and sound are spectacular, helped immensely by the fact that the film was shot entirely in digital, making this the first live-action direct digital-to-digital DVD transfer. This version of the film was the one shown in digital-projection theaters; there are subtle differences from the standard theatrical version, such as showing Anakin's right hand in the final scene. Again, there's a commentary track compiled from various people, including George Lucas (why can't he pronounce the names he created?), producer Rick McCallum, editor Ben Burtt, ILM animation director Rob Coleman, and three visual effects supervisors discussing how the film was made and offering teasers to\", 'Episode III', '.', \"On the second disc are eight deleted scenes with optional introductions. Most interesting are a scene of Padme addressing the Senate to oppose the creation of a Republic army, and some bits with her family and home on Naboo, but it's probably telling that, unlike with\", 'Phantom Menace', ', none of the deleted scenes was incorporated into the film on the DVD. Three substantial documentaries on digital characters, animatics, and creating sound elements are complemented by three insubstantial featurettes, a recycled but interesting 12-part Web documentary, and various other items that should keep fans busy while they wait for', 'Episode III', '.', '--David Horiuchi']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Christopher Lee, Frank Oz, Hayden Christensen, Ian McDiarmid, Jimmy Smits, Natalie Portman, Samuel L. Jackson, George Lucas, Ewan McGregorChristopher Lee, Frank Oz, Hayden Christensen, Ian McDiarmid, Jimmy Smits, Natalie Portman, Samuel L. Jackson, George Lucas, Ewan McGregor   See more', 'Language': 'Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 22 minutes', 'Studio': '20th Century Fox', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 5.12 Ounces', 'Director': 'George Lucas', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Run time': '2 hours and 22 minutes', 'Release date': 'March 22, 2005', 'Actors': 'Ewan McGregor, Natalie Portman, Hayden Christensen, Christopher Lee, Samuel L. Jackson', 'Dubbed': 'French', 'Subtitles': 'English', 'Number of discs': '2'}\nReview Text: First, let me say some positives about this DVD:<br />The image and sound quality are amazing.  This DVD is probably the best quality DVD to date.  Great for showing off a high quality home theater.  Since the movie was shot on digital film, there was almost no ghosting or image quality lost.<br />Now the negatives:<br />What made the original Star Wars movies so spectatular was their campy dialog, fake but realistic special effects (even though you knew it was a fake spaceship you still knew it was a picture of a real model).  The older Star Wars films were mostly a tribute to the cheesey sci-fi movies of the 50's and 60's.  A true space opera, they were classics.<br />Episode II relies mostly on the impressive special effects to mesmerize and entertain.  Acting and story are second to this.  The totally cardboard acting of Haeden Christianson is so bad, that it makes you wonder if he should play an emotionally repressed andriod instead of the future Darth Vader. It made me miss Jar Jar.<br />Oustanding special effects that circumvent the rest of the movie.  This movie seems to be made mostly just to fill a quota and to set up the clearly superior episodes 3-6.  Makes you sad to see a performer past his prime, and Star Wars is way past its prime.\nReview Title: George Lucas has lost his mind.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter and the Chamber of Secrets (Widescreen Edition)\nReview Date: 2003/04/24\nStore: Daniel Radcliffe  (Actor),     Rupert Grint  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Characters & Series, Harry Potter, Harry Potter and the Chamber of Secrets\nProduct Description: ['Product Description', 'The next installment in the Harry Potter series finds young wizard Harry Potter (DANIEL RADCLIFFE) and his friends Ron Weasley (RUPERT GRINT) and Hermione Granger (EMMA WATSON) facing new challenges during their second year at Hogwarts School of Witchcraft and Wizardry as they try to uncover a dark force that is terrorizing the school.', 'HARRY POTTER characters, names, and related indicia are trademarks of and (c) Warner Bros. Entertainment Inc. Harry Potter Publishing Rights (c) J.K.R. (c) 2007 Warner Bros. Entertainment Inc. All rights reserved.', 'Set Contains:', 'The', 'Chamber of Secrets', 'extras are a vast improvement from the first', 'Harry Potter', \"DVD in both substance and navigation. There are no tricks to uncovering all the materials, which include 19 extended or deleted scenes (none of which is a whopper). J.K. Rowling participates in a short interview along with screenwriter Steve Kloves. Other interviews are the standard fare, but highly edited; nearly all the extras focus on kids' interests and attention spans. There are a few areas of Harry's world one can navigate through, with Diagon Alley the highlight. A few simple games are fun, highlighted by the creepy Forbidden Forest game and a reappearance of those scary spiders. Games similar to those on the initial DVD can be found in the vast DVD-ROM section, although the touted navigation by voice commands wears thin fast. The disc feels like a trip to an amusement park more than an examination of the film--just what the kids probably want.\", '--Doug Thomas']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Dolby, Closed-captioned, Color, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Rupert Grint, Emma Watson, Toby Jones, J.K. Rowling, Kenneth Branagh, Richard Griffiths, Fiona Shaw, Jim Norton, Maggie Smith, Daniel Radcliffe, Richard Harris, Harry Melling, Chris Columbus, Steve Kloves, Veronica CliffordRupert Grint, Emma Watson, Toby Jones, J.K. Rowling, Kenneth Branagh, Richard Griffiths, Fiona Shaw, Jim Norton, Maggie Smith, Daniel Radcliffe, Richard Harris, Harry Melling, Chris Columbus, Steve Kloves, Veronica Clifford  See more', 'Language': 'Spanish (Dolby Digital 5.1 EX), English (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '085392359226', 'Director': 'Chris Columbus', 'Media Format': 'Dolby, Closed-captioned, Color, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 41 minutes', 'Release date': 'April 11, 2003', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Richard Harris, Maggie Smith', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'J.K. Rowling, Steve Kloves', 'Number of discs': '2'}\nReview Text: The movie is great.  Very true to the 2nd book.  Since this book was slightly longer than the first, some parts had to be cut from the movie.  These cuts were actually filmed as \"additional scenes\", and are included on the second bonus disk.<br />The image and sound quality is very good especially since a lot of the movie is shot in darker lit areas.  The special effects which looked lower budget in the first movie actually shine in this film.  The scenes of Quidditch will be right up there from action scenes from great sports movies.  You will feel right there among the players.<br />The bonus disk in this DVD set is better than in the first movie.  Its much easier to navigate and the menus are more alive and animated.<br />Overall a great movie adaptation of a fun book. This DVD will be sure to please fans of the movie and of the book.\nReview Title: Great movie, good quality DVD with great bonuses!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spider-Man (Widescreen Special Edition)\nReview Date: 2003/04/24\nStore: Tobey Maguire  (Actor),     Kirsten Dunst  (Actor),     Sam Raimi  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Average teenager Peter Parker is transformed into an extraordinary super hero after he is accidentally bitten by a radioactive spider. When his beloved uncle is savagely murdered during a robbery, young Peter vows to use his powers to avenge his death. Deeming himself \"Spider-Man ,\" he sets about ridding the streets of crime, bringing him into conflict with malevolent super-villain \"Green Goblin.\"', 'Set Contains:', \"When so many DVDs offer making-of featurettes and commentaries, it's a real treat to get something different on the\", 'Spider-Man', 'DVD: a 25-minute documentary, \"Spider-Man: The Mythology of the 21st Century,\" that examines the history of the Marvel comic book through original art and interviews with co-creator Stan Lee and artists such as John Romita, John Romita Jr., Todd McFarlane, and John Byrne. There is also a comics archive and artists gallery. And if you want info about the movie, you can get that, too: a commentary track by director Sam Raimi, actor Kirsten Dunst, producer Laura Ziskin, and co-producer Grant Curtis, plus a technically oriented commentary by the effects crew; pop-up factoids offering trivia about the movie and comic book; occasional Easter eggs leading to featurettes (e.g., 90 seconds on wrestler Randy Savage as Bonesaw McGraw); and promotional documentaries, screen tests, outtakes, and the like.', '--David Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action, Sci-Fi, Adventure, Fantasy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Contributor': 'Sam Raimi, Tobey Maguire, Cliff Robertson, Rosemary Harris, J.K. Simmons, Jack Betts, Elizabeth Banks, Bruce Campbell, Ted Raimi, Willem Dafoe, Myk Watford, Bill Nunn, Michael Papajohn, Kirsten Dunst, Ron Perkins, James Franco, Randy Savage, Stanley Anderson, Gerry Becker, Joe ManganielloSam Raimi, Tobey Maguire, Cliff Robertson, Rosemary Harris, J.K. Simmons, Jack Betts, Elizabeth Banks, Bruce Campbell, Ted Raimi, Willem Dafoe, Myk Watford, Bill Nunn, Michael Papajohn, Kirsten Dunst, Ron Perkins, James Franco, Randy Savage, Stanley Anderson, Gerr…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': 'DV09661', 'Director': 'Sam Raimi', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Run time': '2 hours and 1 minute', 'Release date': 'November 1, 2002', 'Actors': 'Tobey Maguire, Kirsten Dunst, Willem Dafoe, James Franco, Cliff Robertson', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I have never been a fan of comic books so I guess I was at a disadvantage when I watched this.  From what I have seen of Spiderman comis this does do a good job staying true to the spirit of the comics.<br />So many movies today rely too heavily on special effects. This is definately one of those.  Plot exposition and character development come second to displaying great, though overused CGI graphics.<br />The CGI spiderman jumps from building to building with reckless disregard for any sence of physics of laws of gravity.  It looks too fake.  You know he's a superhero, but still it looks too cartoonish.<br />Kirsten Dunst looks great as Mary Jane and Tobey Maguire does a great job as Peter Parker.<br />If you are a fan of comics and comics turned movies this is a must see, otherwise it probably won't be worth seeing.\nReview Title: Overrated film. Though good adaptation of the comic\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gods and Generals (DVD) (WS)\nReview Date: 2003/08/05\nStore: Jeff Daniels  (Actor),     Stephen Lang  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Gods and Generals (DVD) (WS)', 'This sweeping epic charts the early years of the American Civil War --from the Battle of Bull Run to the Battle of Fredricksburg -- exploring the motivations of the combatants and examining the lives of those who waited at home. As director, producer and screenwriter, Ronald F. Maxwell (\"Gettysburg\") proves a triple threat as he brings this epic Civil War saga to the screen. Based on Jeff Shaara\\'s bestseller Gods and Generals--a prequel to the Pulitzer Prize-winning book The Killer Angels by his father, Michael Shaara--the film examines the lives and personalities of Confederate generals Lee and Jackson versus Union generals Hancock and Chamberlain as the pivotal Battle of Gettysburg approaches.', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama, Military & War, Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'William Sanderson, Kali Rocha, Jeff Daniels, Bruce Boxleitner, C. Thomas Howell, Stephen Spacek, Ted Turner, Robert Duvall, Mira Sorvino, Stephen Lang, Alex Hyde White, Ronald F. Maxwell, Mace Neufeld, Jeffrey M. Shaara, Billy Campbell, Kevin Conway, Frankie R. Faison, Moctesuma Esparza, Malachy McCourt, Robert Rehme, Robert Katz, Jeremy LondonWilliam Sanderson, Kali Rocha, Jeff Daniels, Bruce Boxleitner, C. Thomas Howell, Stephen Spacek, Ted Turner, Robert Duvall, Mira Sorvino, Stephen Lang, Alex Hyde White, Ronald F. Maxwell, Mace Neufeld, Jeffrey M. Shaara, Billy Campbell, Kevin Conway, Frankie R. Faison,…  See more', 'Initial release date': '2005-02-08', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 7.2 Ounces', 'Item model number': 'WHV23413DVD', 'Director': 'Ronald F. Maxwell', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 49 minutes', 'Release date': 'February 8, 2005', 'Actors': 'Jeff Daniels, Stephen Lang, Robert Duvall, Mira Sorvino, Kevin Conway', 'Subtitles': 'English, Spanish, French', 'Producers': 'Ronald F. Maxwell, Ted Turner, Robert Katz, Robert Rehme, Moctesuma Esparza', 'Studio': 'Studio Distribution Services', 'Writers': 'Ronald F. Maxwell', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: This movie has been villified by revisionists who believe that the south was wrong, bigoted, hateful, and fought for opression.  Though this may be true in some regards, the majority of the people who fought in this war fought for other reasons, whether it was for state's rights, protecting their homeland, or because they were asked to.  To understand this, you can better appreciate the sacrafice soldiers on both sides had to endure, and this movie captures that idea.<br />There are plenty of extras on this 1 disk DVD, from documentaries on the making of the film, to an interesting biography of Thomas Jackson.  Very interesting is the slave perspective, with viewpoints from the actors who played Martha and Jim, two prominant slave characters in the movie.  The DVD also includes 2 music videos of songs featured in the movie.<br />If you are a history buff, you will most definately love this movie and cherish its themes.  Fans of DVD extras will love the many extra featurettes.  Either way, you can't lose.\nReview Title: Great movie, DVD would be better on 2 disk set\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bowling for Columbine\nReview Date: 2003/09/22\nStore: Caldwell, Michael  (Actor),     Cheney, Dick  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Product Description', \"Documentary concerning the Columbine school shooting incident and dissecting America's fascination with handguns. The project includes interviews with National Rifle Association president Charlton Heston and rocker Marilyn Manson. This film was the first documentary accepted into the Cannes Film Festival in 46 years and won awards.\", 'Set Contains:', 'The', 'Bowling for Columbine', \"DVD has an enthusiastic commentary track by Moore's former receptionists and interns. The now out-of-print two-disc special edition contained an updated voice-over introduction from Michael Moore on the first disc, as well as a direct-to-camera talk on the second disc in which he discussed reactions to the film, and his reaction to winning an Oscar (he had to recite his celebrated acceptance speech because the Academy refused permission for him to show a clip, and he offered his take on who was booing whom). Other extras were good, thoughtful, funny, and provocative interviews with ex-Clinton Press Secretary Joe Lockhart and with film critic Charlie Rose, plus a moving return to Littleton, Colorado--home of Columbine High School--to find out what local people thought of the documentary.\", '--Mark Walker']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Documentary', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSCMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSC   See more', 'Contributor': 'Farmer (II), Joe, McCollum, Evan, Stone, Matt, Clinton, Bill, Harris (XXII), John, Rock, Chris, Ngo, Dinh Diem, Savitch, Jessica, Cheney, Dick, Morgan, Dennis, Clark, Dick, Huebel, Rob, Caldwell, Michael, Dorgan, Byron, McWilliams, Carey, Mauser, Tom, North, Oliver, Hurlin, Dick, Errol, LeonFarmer (II), Joe, McCollum, Evan, Stone, Matt, Clinton, Bill, Harris (XXII), John, Rock, Chris, Ngo, Dinh Diem, Savitch, Jessica, Cheney, Dick, Morgan, Dennis, Clark, Dick, Huebel, Rob, Caldwell, Michael, Dorgan, Byron, McWilliams, Carey, Mauser, Tom, North, Oliver, Hurlin, Dick, Errol, Leon   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, NTSC', 'Run time': '2 hours', 'Release date': 'August 19, 2003', 'Actors': 'Caldwell, Michael, Cheney, Dick, Clark, Dick, Clinton, Bill, Dorgan, Byron', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nReview Text: This film is very well written, filmed, and produced, but is filled with glaring factual problems.  Continually contradictory, the common thesis that the lack of social programs in this country contribute to gun violence.<br />Michael Moore uses sappy music, and saavy editing to pull at the heartstrings while totally disregarding facts.<br />One such misleading fact is the number of gun murders he states.  While our gun deaths are much higher than countries like Germany, France, or Canada, it is actually smaller per capita according to FBI statistics.<br />Also, he takes only homicides for countries like Germany and Canada, but lumps justifiable shootings (cops shooting bad guys), and accidental deaths for the United States.<br />He blames the United State's welfare to work program for the shooting death of 8 year old Kayla Rolland by a classmate. He says the welfare to work program made the shooter's mother work, instead of stay home with her child.<br />He fails to point out that the boy lived in a known crackhouse, where numerous weapons were readily available along with drugs and passed-out drug addicts.<br />These are two of dozens of facts that mislead.  This movie is an entertaing work of FICTION.  Well written, but factually flawed.\nReview Title: Well written and filmed, factually void and flawed.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Benjamin Franklin\nReview Date: 2008/01/18\nStore: Richard Easton  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: [\"Now in his 70s, Franklin is the oldest revolutionary leader. Congress sends Franklin to France in an effort to secure an alliance with England's rival; Franklin's political skills help him coax the French to support the American cause, leading to final American victory at Yorktown. With peace secured, Franklin returns home. Two years later, an ailing Franklin enters the constitutional convention to guide rancorous delegates.\"]\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 210 min', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours and 30 minutes', 'Release date': 'January 24, 2006', 'Actors': 'Richard Easton', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: This clever and entertaining look at the life and times of Benjamin Franklin would be a great addition to the library of any Franklin buff or history buff for that matter.<br /><br />It is well written, and entertainingly presented with a mix of narration and live action.  Richard Easton does a fantastic job portraying Franklin and the cast does well acting out actual correspondences and written first hand accounts from the time.<br /><br />The film is broken down into three segments showing the life of Franklin. Let the Experiment Be Made, The Making of a Revolutionary, and The Chessmaster.<br /><br />Let the experiment be made shows the early life of Franklin, how a genius was made and his contributions to science.<br /><br />The Making of a Revolutionary shows how a man who once considered himself a loyalist became a fierce proponent of independence.<br /><br />The Chessmaster detailed his years in France gaining support for the war, the treaty of France, and the building of the American Experiment in democracy.<br /><br />Ultimately this film does a great job portraying Franklin as a man.  Sometimes flawed, as we all are, but a man who contributed so many things to making America what we know today.<br />It does it with wit, humor, and narration that moves quick and keeps you interested.\nReview Title: Near perfect account of an American Icon\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Team Baby: Baby Nittany Lion [DVD]\nReview Date: 2008/04/26\nStore: Baby Nittany Lion-Penn State University-Raising to  (Actor),     Wyatt Cagle  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: [\"You love your kids, you love your family and you love your Nittany Lions! Now you can combine them all with this exciting Team Baby Entertainment DVD. Featuring Officially Licensed footage of Penn State sports, mascot, marching band and campus attractions along with a Lion-sized view of the sights, sounds, traditions and colors of Pennsylvania State University, BABY NITTANY LION combines all the great things you love about Penn State with all the things you want your little Lion to learn — numbers, letters, colors and more. Narrated by famed NCAA football analyst Lee Corso — and featuring original Team Baby Entertainment music, BABY NITTANY LION is the ideal way to introduce your love of The Pennsylvania State University Nittany Lions to the team's youngest fans. Watch together . . . cheer together . . . learn together. Raising Tomorrow's Penn State Fan Today!\"]\nAverage Rating: 3.0\nProduct Details: {'Genre': 'Romance', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Wyatt Cagle, Baby Nittany Lion-Penn State University-Raising to', 'Language': 'Unqualified', 'Runtime': '30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Director': 'Wyatt Cagle', 'Media Format': 'Color, DVD, NTSC', 'Run time': '30 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Baby Nittany Lion-Penn State University-Raising to', 'Studio': 'Team Marketing', 'Number of discs': '1'}\nReview Text: My six month old son loves this video. Occasionally we'll let him watch it when he sits and plays with his toys.<br /><br />There are sections on Penn State traditions, music, colors, and numbers. It is very basic and kids are drawn to the movement and colors.<br /><br />One thing I like about this as opposed to the Baby Enisten DVDs is that it is basically put in and play. You don't have to sit through trailers or advertisements to get to the stuff baby loves.<br /><br />The video is quick moving, well made. Sound is great!!<br /><br />Wonderful for any Nittany Lion.\nReview Title: This is a great product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Extreme Trains: Season 1\nReview Date: 2011/12/31\nStore: Matt Bown  (Actor),     History Channel  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Special Interests\nProduct Description: ['Your ticket to some of the most thrilling, high-octane train rides in history is here! Extreme Trains host Matt Brown, a real-life railroad conductor from New England, brings his infectious passion for these monster machines to rail journeys across the United States. Feel the force of railroads in history, and see how railroading is about more than machines, cargo and challenging terrain. From the demolition of Penn Station, to the first train robbers and how the Nazis tried to blow up the rails in World War II, to the human blood, sweat and tears of the stokers, engineers, and bathroom cleaners that keep the industry moving, tag along with Matt on one of history s most exciting rides. Episodes include Amtrak s Empire Builder, The Burlington Northern Santa Fe Freight Train, The Norfolk Southern Coal Train, The Ringling Bros. Circus Train,and The Union Pacific Refrigeration Train.']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 4.8 Ounces', 'Director': 'History Channel', 'Media Format': 'Box set, Color, DVD, NTSC, Closed-captioned', 'Run time': '6 hours and 16 minutes', 'Release date': 'June 30, 2009', 'Actors': 'Matt Bown', 'Language': 'Unqualified', 'Studio': 'A&E Home Video', 'Number of discs': '2'}\nReview Text: An avid fan of trans, and model railroading, I love this show. It's the favorite show of my 4 year old who watches an episode at least daily, and knows more about the operations of railroads than most adults because of this show.<br /><br />The camera work is well done, and captures the hard steel and movement of a train. Matt Bown is a great host who adds excitement and his love of trains with the audience, giving great descriptions of the technical aspects of railroading.  You'll walk away from the show with a greater understanding of trains and a deeper love for them as well.<br /><br />The extras are nice, as there are some scenes from nearly every episode that never aired. I would liked to have seen some audio commentary though.\nReview Title: A must for the Railfans, kids, and transpotters\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/04/03\nAverage Rating: 3.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rodney Ascher'], 'Producers': ['Tim Kirk'], 'Starring': ['Bill Blakemore', 'Geoffrey Cocks', 'Juli Kearns'], 'Studio': ['IFC Films', 'AMC Plus Documentaries']}\nReview Text: I was hoping this movie would be a serious look at the symbolism and making of The Shining. Instead it is a poorly made and laughable look at the ideas of numerous crackpots who think cans of baking soda are references to genocide.<br /><br />Basically the film makers spliced together B-roll from other movies, dubbed over tinny recorded interviews of crackpots and made a movie. The opinions and ideas from those interviewed are similar to what you would find in a south philly bar at 3pm.<br /><br />Unwatchable...\nReview Title: Poorly done, boring, interviewees are crazy\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/04/03\nAverage Rating: 4.9\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Paul McGuigan'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss', 'Rebecca Eaton', 'Bethan Jones'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nReview Text: I finally watched Sherlock, and I am hooked. From the first episode, I am a big fan. The first story is so well done, characters are written perfectly, acting is superb, and the way they illustrate the way Sherlock's mind works with superimposed text is a stroke of genious. The first episode is written by Stephen Moffet, so fans of Doctor Who can relate to the quality and depth of the story telling. Masterfully done on all levels. Not a bad episode in either season (Series)\nReview Title: Fantastic story, writing, it will suck you in!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/07/13\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Martha Coolidge'], 'Producers': ['Brian Grazer'], 'Starring': ['Val Kilmer', 'Gabe Jarret', 'William Atherton'], 'Studio': ['COLUMBIA']}\nReview Text: Moles and Trolls Moles and Trolls.  A freaking funny 80s geek movie.  perhaps the best one ever.\nReview Title: This, this is what happens to ice when it gets to cold.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/12/06\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alexander Payne'], 'Producers': ['Michael London', 'George Parra'], 'Starring': ['Paul Giamatti', 'Thomas Haden Church', 'Virginia Madsen'], 'Studio': ['Critically Acclaimed']}\nReview Text: Really a funny, quirky, and great movie. Gave merlot a bad name, but still funny as hell.\nReview Title: Gave Merlot a bad name, but still an awesome movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: World War II with Walter Cronkite [DVD]\nReview Date: 2021/06/10\nStore: Walter Cronkite  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Documentary\nProduct Description: ['WWII was the largest and most destructive war ever waged, engulfing the far reaches of the globe. The defining event of the 20th Century, this was lasted more than five years, spanning three continents and the seven seas, and threatening the future of civilization itself. The legacy of that conflict remains strong today, having shaped and changed our world in a thousand ways. This collection of 8 DVDs, including over 24 hours of archival footage, takes you through the war years, from the Battle of Britain in Europe to the atmoic blasts at Hiroshima and Nagasaki which ended the war in the Pacific. Each theater of operation and major turning point is examined in detail, the great battles and the political struggles, the sacrifies and triumphs of millions of men and women, caught up in the greatest war mankind has ever known.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Military & War', 'Format': 'Color, Box set, NTSC, DVD', 'Contributor': 'N/a, Walter Cronkite', 'Language': 'Unqualified', 'Runtime': '24 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.6 x 5.3 x 2.2 inches; 1.35 Pounds', 'Media Format': 'Color, Box set, NTSC, DVD', 'Run time': '24 hours and 30 minutes', 'Release date': 'August 24, 2005', 'Actors': 'Walter Cronkite', 'Studio': 'Timeless Media', 'Number of discs': '8'}\nReview Text: No other World War 2 Documentary has been as enthralling and well done as these,  in my opinion. Excellently narrated, and well put together this is the gold standard of documentaries on the subject.<br /><br />Unlike more modern documentaries that have new graphics and re creations, this is almost entirely made of archival footage and film reels.  This makes it somuch better in my opinion\nReview Title: One of the best documentaries on WW2\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual's purchase history reveals a distinct preference for classic and action genre films, with a notable inclination towards popular franchises, as evidenced by consistent engagement with series such as \"Back to the Future,\" \"Star Wars,\" \"Harry Potter,\" and superhero films. Their ratings exhibit a strong appreciation for high-quality production values and extra content like documentaries and commentary, suggesting a keen interest in film-making insights and behind-the-scenes features.\n\nThe individual shows a bias towards DVDs with excellent audio-visual quality, indicating a preference for products that enhance the viewing experience. Their reviews frequently highlight sentiment towards nostalgia and character-driven narratives. While generally positive in ratings, they express dissatisfaction towards films perceived as over-reliant on special effects or lacking depth, revealing a discerning taste.\n\nQuality is paramount, with most ratings hovering around 4-5 stars, indicating limited price sensitivity; they seem willing to pay for premium features. Lastly, their engagement with documentaries and historical content, such as WWII-related material, highlights a broader interest in historical narratives and educational content, suggesting that this consumer values informative storytelling alongside entertainment.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Totally Fantastic Movie",
    "text": "One of the best action movies I\"ve seen, ever.  Really pays homage to the original, with the best blend of sentimentality and forward-thinking.  Great acting, SUPER GREAT action sequences.  The 3rd act is perhaps the best action scenes I\"ve ever seen.",
    "images": [],
    "asin": "B0B212TDRQ",
    "parent_asin": "B0B212TDRQ",
    "user_id": "AE6AUO3Z6Q5N5VK2JDWGZEGFW4GA",
    "timestamp": "2022-09-20 13:21:25.491000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.8,
    "rating_number": 20777,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a99fdd0071f7598f0e438129970c8647dfb1528bd03e8b783211268214a7e1ae._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a99fdd0071f7598f0e438129970c8647dfb1528bd03e8b783211268214a7e1ae._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a99fdd0071f7598f0e438129970c8647dfb1528bd03e8b783211268214a7e1ae._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a99fdd0071f7598f0e438129970c8647dfb1528bd03e8b783211268214a7e1ae._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a99fdd0071f7598f0e438129970c8647dfb1528bd03e8b783211268214a7e1ae._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a99fdd0071f7598f0e438129970c8647dfb1528bd03e8b783211268214a7e1ae._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "alcohol use",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English Dialogue Boost: High",
        "English",
        "English [Audio Description]",
        "English Dialogue Boost: Medium"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Joseph Kosinski"
      ],
      "Producers": [
        "Jerry Bruckheimer",
        "Tom Cruise",
        "Christopher McQuarrie",
        "David Ellison",
        "Tommy Harper",
        "Dana Goldberg",
        "Don Granger",
        "Chad Oman",
        "Mike Stenson"
      ],
      "Starring": [
        "Miles Teller",
        "Val Kilmer",
        "Tom Cruise"
      ],
      "Studio": [
        "Paramount"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}