{
  "user_id": "AE7CAVS7MARECXXVSEYLP36VYIBQ",
  "summary": "=== Purchase Information ===\nProduct Title: A Ghost Story [DVD]\nReview Date: 2019/05/02\nStore: Casey Affleck  (Actor),     Rooney Mara  (Actor),     David Lowery  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['This is the story of a ghost and the house he haunts.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Kenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney MaraKenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney Mara  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 32 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'ghost-story', 'Director': 'David Lowery', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 3, 2017', 'Actors': 'Casey Affleck, Rooney Mara, McColm Cephas Jr., Kenneisha Thompson', 'Subtitles': 'Spanish', 'Producers': 'Adam Donaghey, Toby Halbrooks, James Johnston', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: I saw this movie in theaters and fell in love. It gives you this nostalgic feeling you just don’t get from many movies. Between the ambiance and music, it is truly haunting to watch. Be careful because you can find yourself in a sad mood at the end.\nReview Title: Nostalgic ambiance\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Angel: The Complete Series\nReview Date: 2019/05/02\nStore: David Boreanaz  (Actor),     Alexis Denisof  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Monsters & Mutants\nProduct Description: ['Product Description', '* ANGEL SEASON 1 (6 DISCS)', '* ANGEL SEASON 2 (6 DISCS)', '* ANGEL SEASON 3 (6 DISCS)', '* ANGEL SEASON 4 (6 DISCS)', '* ANGEL SEASON 5 (6 DISCS)', 'Amazon.com', 'Angel - Season One', \"He's hunky, he's brooding, he's a do-gooder, and he was Buffy's first boyfriend. Angel, the tortured vampire destined to walk the earth with a soul, got his own series after three seasons on Buffy the Vampire Slayerand did what any new star might do: he moved to L.A. (the City of Angels--get it?) and set up shop. Angel (co-created by Buffy mastermind Joss Whedon) finds the titular vampire (David Boreanaz) as a kind of supernatural private investigator, fighting evil one case at a time and, like his ex-girlfriend, keeping the world from getting destroyed by vengeful demons and such. This first season features guest appearances by various Buffy characters, including werewolf boy Oz (Seth Green), rogue slayer Faith (Eliza Dushku), deliciously evil vamp Darla (Julie Benz), and Buffy herself (Sarah Michelle Gellar), all of whom helped get the show off and running in style.\", 'Angel - Season Two', \"The second season of Angel, saw the cult vampire show finally stand on its own from Buffy the Vampire Slayer, assembling all the members of the show's core cast, transferring the action to a fashionably run-down L.A. hotel, and bringing in a few Buffy characters from Angel's history to further establish the moody vampire's own mythology. Moving their Angel Investigations to posher digs, Angel (David Boreanaz), Cordelia (Charisma Carpenter), and Wesley (Alexis Denisof) were soon joined by street fighter (J. August Richards)–-and by street fighter, of course we mean demon street fighter. But just as this group was solidifying, up popped Angel's old love, Darla (the fantastic Julie Benz), freshly arrived in L.A. from a hell dimension… just in time to be turned into a vampire again by her old cohort, Drusilla (Juliet Landau), and lure Angel into abandoning his newly formed team.\", 'Angel - Season Three', \"In the third season of Angel, the titular vampire with a soul was forced to stand alone thanks to the (temporary) death of his beloved Buffy and her show's move to a new network, with no crossover between the two allowed. He returns from seeking peace in a demon-haunted monastery to find the L.A. Angel Investigations team fighting supernatural crime in his absence. Fred is still haunted by the nightmare dimension from which they rescued her; Cordelia's visions get ever more painful and debilitating. The schemes of the evil law firm Wolfram and Hart become every more imaginative and dragon lady Lilah Morgan becomes even more of an enemy when lusting after Angel. Unbelievably, Darla, Angel's vampire sire and lover, turns up, pregnant with his child and is tortured by inexplicable motherly feelings as well as a raging thirst for human blood.\", 'Angel - Season Four', \"As the fourth season of Angel, starts, everything is still as we left it: Angel has been sunk to the bottom of the sea in an iron box by his inexplicable and vindictive son Connor and Cordelia has been summoned to higher realms to await orders. Gunn and Fred are left in the Hyperion Hotel, unsure about what has happened to their friends, and Lilah is working hard to seduce Wesley to the dark side. In the first few episodes, some of this is resolved but it's almost immediately replaced by far worse crises: prophesies of doom accumulate more rapidly even than usual in this wonderfully gloomy show and a horned rock-like beast rains fire on Los Angeles. This last year is Angel’s most tightly dramatic season yet--with a story arc of surprising intensity punctuated by the show's usual wit and sexiness.\", 'Angel - Season Five', \"Lives were upended--and some co-opted--in the fifth and final season of Angel, as the denizens of Angel Investigations found themselves taking on one of their scariest endeavors ever: corporate life. After making a literal deal with the devil (or something distinctly devil-like), Angel (David Boreanaz) moved his team from their crumbling hotel to the high-rise digs of law-firm-from-hell Wolfram & Hart, his reasoning being they could better fight the forces of evil from the inside, and with more resources to boot. Clever maneuvering or easy rationalization? Not a few members of Angel's team accused him of selling out (as did a number of viewers), but as with most of the show's previous four seasons, Angel somehow took a dubious premise and mined it for gold. And with one core cast member gone (Charisma Carpenter, whose Cordelia was immersed in a deep coma), it seemed as if the show, from within and without, would suddenly fall apart--that is, until Angel's longtime nemesis Spike (James Marsters) showed up, fresh from his sacrificial roasting at the series finale of Buffy the Vampire Slayer. Let the vampire games begin!\"]\nAverage Rating: 4.8\nProduct Details: {'Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Contributor': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '16 hours and 30 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '80', 'Media Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Run time': '16 hours and 30 minutes', 'Release date': 'October 12, 2010', 'Actors': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: The case is beautiful. This was, and always will be, my favorite television series. It ended too soon, most likely due to a lack of good digital editing and cgi at the time.  The character developments and storylines were beautiful. It is not a surprise Joss Whedon went on to direct one of the most success franchises today.\nReview Title: Great package design for a great television series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SPIRITED AWAY DVD\nReview Date: 2019/08/07\nStore: Rumi Hiiragi  (Actor),     Miyu Irino  (Actor),     Hayao Miyazaki  (Director, Writer),     Kirk Wise  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: [\"Winner of the Academy Award® for Best Animated Feature, Hayao Miyazaki's wondrous fantasy adventure is a dazzling masterpiece from one of the most celebrated filmmakers in the history of animation. Chihiro's family is moving to a new house, but when they stop on the way to explore an abandoned village, her parents undergo a mysterious transformation and Chihiro is whisked into a world of fantastic spirits ruled over by the sorceress, Yubaba. Put to work in a magical bathhouse for spirits and demons, Chihiro must use all her wits to survive in this strange new place, find a way to free her parents and return to the normal world. Overflowing with imaginative creatures and thrilling storytelling, Spirited Away became a worldwide smash hit, and is one of the most critically-acclaimed films of all time.\", 'Bonus Content:', 'Behind the Microphone', 'Behind the Microphone', 'Nippon Television Special', 'Nippon Television Special', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'spirited-away', 'Director': 'Hayao Miyazaki, Kirk Wise', 'Media Format': 'Widescreen, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 17, 2017', 'Actors': 'Rumi Hiiragi, Miyu Irino, Mari Natsuki, Takashi Naito, Yasuko Sawaguchi', 'Dubbed': 'French, Japanese', 'Subtitles': 'French', 'Producers': 'Toshio Suzuki', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I love this movie, have seen it about five times. I have been wanting to watch some Ghibli films so I bought this with four other DVDs. Package itself was fine but the shrink wrap on the dvd split open, and the disc popped out of the tab and had been moving around inside the case. I have yet to watch the DVD but the disc looks fine and does not have any scratches.\nReview Title: Lovely movie for the whole family\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Grave of the Fireflies\nReview Date: 2019/08/07\nStore: Isao Takahata  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: [\"As the Empire of the Sun crumbles upon itself and a rain of firebombs falls upon Japan, the final death march of a nation is echoed in millions of smaller tragedies. This is the story of Seita and his younger sister Setsuko, two children born at the wrong time, in the wrong place, and now cast adrift in a world that lacks not the care to shelter them, but simply the resources. Forced to fend for themselves in the aftermath of fires that swept entire cities from the face of the earth, their doomed struggle is both a tribute to the human spirit and the stuff of nightmares. Beautiful, yet at times brutal and horrifying. Based on the retellings of survivor Nosaka Akiyuki and directed by Iaso Takahata (co-founder, with Hayao Miyazaki, of Japan's legendary Studio Ghibli,) Grave of the Fireflies has been universally hailed as an artistic and emotional tour de force. Now digitally remastered and restored, it is one of the rare films that truly deserves to be called a masterpiece.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'kids & family', 'Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Contributor': 'Isao Takahata', 'Language': 'English, Japanese', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 1.6 Ounces', 'Item model number': '26387168', 'Director': 'Isao Takahata', 'Media Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Release date': 'March 6, 2012', 'Subtitles': 'English', 'Studio': 'Section 23', 'Number of discs': '1'}\nReview Text: This is one of the saddest films I have ever seen. Very eye opening and different from any Miyazaki film I have watched. Be prepared with a box of tissues the first time you watch this film. The whole movie follows the effects of a war-torn city on two small children.\nReview Title: Devastatingly Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kiki's Delivery Service\nReview Date: 2019/08/07\nStore: Kirsten Dunst  (Actor),     Phil Hartman  (Actor),     Hayao Miyazaki  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', \"Discover KIKI'S DELIVERY SERVICE, a fantastic coming-of-age tale full of magic, adventure and self-discovery from the sensational imagination of Academy Award(R)-winning director Hayao Miyazaki (2002, Best Animated Feature, SPIRITED AWAY). And now you can explore even more of Kiki's amazing world through never-before-seen bonus features -- exclusively in this 2-Disc Special Edition DVD! Kiki is an enterprising young girl who must follow tradition to become a full-fledged witch. Venturing out with only her black cat, Jiji, Kiki flies off for the adventure of a lifetime. Landing in a far-off city, she sets up a high-flying delivery service and begins a wonderful experience of independence and responsibility as she finds her place in the world. Bring home KIKI'S DELIVERY SERVICE from Studio Ghibli and Disney for your family's DVD library and share Kiki's high-flying adventure again and again.\", 'Amazon.com', \"In Hayao Miyazaki's magical\", \"Kiki's Delivery Service\", \", a 13-year-old girl meets the world head on as she spends her first year soloing as an apprentice witch. Kiki (Kirsten Dunst) is still a little green and plenty headstrong, but also resourceful, imaginative, and determined. With her trusty wisp of a cat Jiji (a gently subdued Phil Hartman) by her side she's ready to take on the world, or at least the quaintly European seaside village she's chosen as her new home. Miyazaki's gentle rhythm and meandering narrative capture the easy pulse of real life (even if his subject is a girl flying high upon a broomstick) and charts the everyday struggles and growing pains of his plucky heroine with sensitivity and understanding. Beautifully detailed animation and the rich designs of the picture-postcard seaside town of red-tiled roofs and cobblestone streets only add to the sense of wonder. This charming animated fantasy is a wholesome, life-affirming picture that doesn't speak down to kids or up to adults. --\", 'Sean Axmaker']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Janeane Garofalo, Matthew Lawrence, Original Story By Eiko Kadono, Hayao Miyazaki, Edie McClurg, Phil Hartman, Jeff Bennett, Corey Burton, Screenplay By Hayao Miyazaki, Debbie Reynolds, Kath Soucie, Kirsten Dunst, Debi Derryberry, Pamela Segall, Tress MacNeilleJaneane Garofalo, Matthew Lawrence, Original Story By Eiko Kadono, Hayao Miyazaki, Edie McClurg, Phil Hartman, Jeff Bennett, Corey Burton, Screenplay By Hayao Miyazaki, Debbie Reynolds, Kath Soucie, Kirsten Dunst, Debi Derryberry, Pamela Segall, Tress MacNeille   See more', 'Language': 'Japanese (Dolby Digital 2.0 Surround), English (Dolby Surround), French, Unqualified, Spanish', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '786936791655', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'March 2, 2010', 'Actors': 'Kirsten Dunst, Phil Hartman, Janeane Garofalo, Matthew Lawrence, Debbie Reynolds', 'Dubbed': 'Spanish, English, French', 'Subtitles': 'French', 'Studio': 'Disney Presents Studio Ghibli', 'Writers': 'Original Story By Eiko Kadono, Screenplay By Hayao Miyazaki', 'Number of discs': '1'}\nReview Text: I first saw this movie when I was a young child (29 now.) It has always been a movie I can watch when I am feeling down and it never fails to lift me up. I decided to purchase this along side four other Japanese animated films. Package was delivered in good shape and on time.\nReview Title: Look forward to sharing this with my child\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Howl's Moving Castle [DVD]\nReview Date: 2019/08/07\nStore: Emily Mortimer  (Actor),     Jean Simmons  (Actor),     Hayao Miyazaki  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: ['\"An animated tour-de-force\" – A.O. Scott, The New York Times From the legendary Studio Ghibli, creators of Spirited Away, and acclaimed director Hayao Miyazaki, comes the Academy Award®- nominated fantasy adventure for the whole family. Sophie, a quiet girl working in a hat shop, finds her life thrown into turmoil when she is literally swept off her feet by a handsome but mysterious wizard named Howl. The vain and vengeful Witch of the Waste, jealous of their friendship, puts a curse on Sophie and turns her into a 90-year-old woman. On a quest to break the spell, Sophie climbs aboard Howl\\'s magnificent moving castle and into a new life of wonder and adventure. But as the true power of Howl\\'s wizardry is revealed, Sophie finds herself fighting to protect them both from a dangerous war of sorcery that threatens their world.', 'Bonus Content:', 'Behind the Microphone', 'Behind the Microphone', 'Interview with Diana Wynne Jones', 'Interview with Diana Wynne Jones', \"Miyazaki's Visit to Pixar\", \"Miyazaki's Visit to Pixar\", 'Explanation of CG', 'Explanation of CG', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Dubbed, NTSC, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren BacallChristian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren Bacall  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DSF18161D', 'Director': 'Hayao Miyazaki', 'Media Format': 'Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '2 hours', 'Release date': 'October 17, 2017', 'Actors': 'Emily Mortimer, Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner', 'Dubbed': 'French, Japanese', 'Subtitles': 'French, English', 'Producers': 'Toshio Suzuki', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have watched this film so many times I don’t even remember how many. Something you can watch with the whole family. It has great voice acting, animation and an intriguing story. The romantic element teaches a great lesson about loving someone for their morals and the things they do - as opposed to what they look like. I ordered this with four other DVDs and they shipped together in one envelope. The package was in good shape and was delivered on time.\nReview Title: Could watch over and over again\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 From Hell (UNRATED VERSION)\nReview Date: 2020/01/24\nCategories: Horror, Action, Gritty, Malicious\nProduct Description: [\"First there was House of 1,000 Corpses. Then there was The Devil's Rejects. Now, from writer-director Rob Zombie, comes the next blood-soaked chapter in the most violent crime saga in movie history—3 from Hell.\"]\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Zombie'], 'Producers': ['Mike Elliott', 'Rob Zombie', 'Tony Ciulla'], 'Starring': ['Sheri Moon Zombie', 'Bill Moseley', 'Richard Brake']}\nReview Text: I’m a huge Rob Zombie fan. I have seen all the movies in the House of a Thousand Corpses series but this movie was not very good. I liked the actors, but it was a shame Sid Haig was too ill to really appear in much of the film. The man they had to replace him (Deadhead from 31) is a nice replacement but was obviously inserted to fill Haig’s absence. Baby’s personality was too unconvincing for her character- the direction they took with her was just odd and nonsensical. It didn’t really make sense for her journey through the series as a whole. Otis was almost boring and forced (not by the acting but by the character development/playout.) The movie was almost uneventful, just seemed like a bunch of filler. My assumption is that Rob had good intentions but had to make last minute changes due to Haig’s illness, so a lot of the movie is just weird in a bad way.\nReview Title: Disappointing For Long Time Fans Of Series\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Legend of Korra: The Complete Series\nReview Date: 2020/02/09\nStore: David Faustino  (Actor),     Jeff Bennett  (Actor),     Joaquim Dos Santos  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: [\"The spirit of the Avatar lives on in the complete series of The Legend of Korra! Relive every moment from all four books. From meeting Avatar Korra, a teenage girl from the Southern Water Tribe, in book one, to opening the spirit portal and entering a new age where spirits and mankind coexist in books two and three, to embarking on a journey of self-discovery and restoring balance to the Earth Kingdom in book four, you won't want to miss a second of air, earth, water and fire bending in this complete collection!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Anime & Manga, Kids & Family/Animation', 'Format': 'NTSC', 'Contributor': 'Joaquim Dos Santos, David Faustino, Janet Varney, Dee Bradley Baker, Jeff Bennett, P.J. Byrne', 'Language': 'English', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Item model number': '43381888', 'Director': 'Joaquim Dos Santos', 'Media Format': 'NTSC', 'Release date': 'December 13, 2016', 'Actors': 'David Faustino, Jeff Bennett, Janet Varney, P.J. Byrne, Dee Bradley Baker', 'Dubbed': 'French, Spanish', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '8'}\nReview Text: The DVD arrived in great condition. My fiancé is almost done with the series and, so far, no issues with the disc.\nReview Title: Package arrived on time, in good condition\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Penny Dreadful: The Complete Series\nReview Date: 2020/02/09\nStore: Rory Kinnear  (Actor),     Josh Hartnett  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Boxed Sets\nProduct Description: [\"Some of literature's most terrifying characters, including Dr. Frankenstein and his monster, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. They are joined by a core of original characters in a complex, frightening new narrative, where personal demons from the past can be stronger than vampires, evil spirits and immortal beasts. Relive every chilling episode of Showtime's Penny Dreadful if you dare.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Horror/Television', 'Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Eva Green, Harry Treadaway, Rory Kinnear, Reeve Carney, Timothy Dalton, Josh Hartnett, Billie Piper', 'Language': 'English', 'Number Of Discs': '9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.74 Ounces', 'Media Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '24 hours and 22 minutes', 'Release date': 'July 18, 2017', 'Actors': 'Rory Kinnear, Josh Hartnett, Eva Green, Billie Piper, Harry Treadaway', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '9'}\nReview Text: The plastic on the cover is wrinkled, there is a small cut in the cover as well. The discs work fine.\nReview Title: Cover was wrinkled, discs worked\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/07/08\nAverage Rating: 3.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Lorcan Finnegan'], 'Producers': ['Brendan McCarthyJohn McDonnell'], 'Starring': ['Imogen Poots', 'Jesse Eisenberg', 'Danielle Ryan'], 'Studio': ['Lionsgate']}\nReview Text: I loved the actors and their acting. The movie left something to be desired. I loved the concept at the beginning, it got a little boring towards the middle. The fate of the main characters was a little underwhelming.\nReview Title: It was Okay, great actors though\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/07/08\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg McLean'], 'Producers': ['Todd Fellman', 'Mike Gabrawy', 'Gary Hamilton', 'Mark Lazarus', 'Dana Lustig', 'Greg Mclean'], 'Starring': ['Daniel Radcliffe', 'Thomas Kretschmann', 'Joel Jackson']}\nReview Text: It was alright. Not as intense as I thought it was going to be. Amazing story though.\nReview Title: Good cast\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/12/11\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tom Putnam'], 'Producers': ['Aaron Boyd', 'Ryan Frost', 'Tom Putnam', 'David Cross', 'Jory Weitz'], 'Starring': ['David Cross', 'Debra Messing', 'David Koechner']}\nReview Text: My fiancé and I really enjoyed this film. I was listening to a podcast interview where David Cross mentions his role in the film. I am happy that I did because I unfortunately missed the trailers for the release of the film. The acting, writing and character development are great. I found myself continuously saying, “Go back home!” to Cross’s character. All the elements of the film had me enjoying every minute of his journey.\nReview Title: David Cross Shines\nRating: 5.0\n--------------------------------------------------",
  "reference": "A Ghost Story [DVD]\nCasey Affleck  (Actor),     Rooney Mara  (Actor),     David Lowery  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['This is the story of a ghost and the house he haunts.']\n{'Genre': 'Drama', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Kenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney MaraKenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney Mara  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 32 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'ghost-story', 'Director': 'David Lowery', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 3, 2017', 'Actors': 'Casey Affleck, Rooney Mara, McColm Cephas Jr., Kenneisha Thompson', 'Subtitles': 'Spanish', 'Producers': 'Adam Donaghey, Toby Halbrooks, James Johnston', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nI saw this movie in theaters and fell in love. It gives you this nostalgic feeling you just don’t get from many movies. Between the ambiance and music, it is truly haunting to watch. Be careful because you can find yourself in a sad mood at the end.\nNostalgic ambiance\nAngel: The Complete Series\nDavid Boreanaz  (Actor),     Alexis Denisof  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Monsters & Mutants\n['Product Description', '* ANGEL SEASON 1 (6 DISCS)', '* ANGEL SEASON 2 (6 DISCS)', '* ANGEL SEASON 3 (6 DISCS)', '* ANGEL SEASON 4 (6 DISCS)', '* ANGEL SEASON 5 (6 DISCS)', 'Amazon.com', 'Angel - Season One', \"He's hunky, he's brooding, he's a do-gooder, and he was Buffy's first boyfriend. Angel, the tortured vampire destined to walk the earth with a soul, got his own series after three seasons on Buffy the Vampire Slayerand did what any new star might do: he moved to L.A. (the City of Angels--get it?) and set up shop. Angel (co-created by Buffy mastermind Joss Whedon) finds the titular vampire (David Boreanaz) as a kind of supernatural private investigator, fighting evil one case at a time and, like his ex-girlfriend, keeping the world from getting destroyed by vengeful demons and such. This first season features guest appearances by various Buffy characters, including werewolf boy Oz (Seth Green), rogue slayer Faith (Eliza Dushku), deliciously evil vamp Darla (Julie Benz), and Buffy herself (Sarah Michelle Gellar), all of whom helped get the show off and running in style.\", 'Angel - Season Two', \"The second season of Angel, saw the cult vampire show finally stand on its own from Buffy the Vampire Slayer, assembling all the members of the show's core cast, transferring the action to a fashionably run-down L.A. hotel, and bringing in a few Buffy characters from Angel's history to further establish the moody vampire's own mythology. Moving their Angel Investigations to posher digs, Angel (David Boreanaz), Cordelia (Charisma Carpenter), and Wesley (Alexis Denisof) were soon joined by street fighter (J. August Richards)–-and by street fighter, of course we mean demon street fighter. But just as this group was solidifying, up popped Angel's old love, Darla (the fantastic Julie Benz), freshly arrived in L.A. from a hell dimension… just in time to be turned into a vampire again by her old cohort, Drusilla (Juliet Landau), and lure Angel into abandoning his newly formed team.\", 'Angel - Season Three', \"In the third season of Angel, the titular vampire with a soul was forced to stand alone thanks to the (temporary) death of his beloved Buffy and her show's move to a new network, with no crossover between the two allowed. He returns from seeking peace in a demon-haunted monastery to find the L.A. Angel Investigations team fighting supernatural crime in his absence. Fred is still haunted by the nightmare dimension from which they rescued her; Cordelia's visions get ever more painful and debilitating. The schemes of the evil law firm Wolfram and Hart become every more imaginative and dragon lady Lilah Morgan becomes even more of an enemy when lusting after Angel. Unbelievably, Darla, Angel's vampire sire and lover, turns up, pregnant with his child and is tortured by inexplicable motherly feelings as well as a raging thirst for human blood.\", 'Angel - Season Four', \"As the fourth season of Angel, starts, everything is still as we left it: Angel has been sunk to the bottom of the sea in an iron box by his inexplicable and vindictive son Connor and Cordelia has been summoned to higher realms to await orders. Gunn and Fred are left in the Hyperion Hotel, unsure about what has happened to their friends, and Lilah is working hard to seduce Wesley to the dark side. In the first few episodes, some of this is resolved but it's almost immediately replaced by far worse crises: prophesies of doom accumulate more rapidly even than usual in this wonderfully gloomy show and a horned rock-like beast rains fire on Los Angeles. This last year is Angel’s most tightly dramatic season yet--with a story arc of surprising intensity punctuated by the show's usual wit and sexiness.\", 'Angel - Season Five', \"Lives were upended--and some co-opted--in the fifth and final season of Angel, as the denizens of Angel Investigations found themselves taking on one of their scariest endeavors ever: corporate life. After making a literal deal with the devil (or something distinctly devil-like), Angel (David Boreanaz) moved his team from their crumbling hotel to the high-rise digs of law-firm-from-hell Wolfram & Hart, his reasoning being they could better fight the forces of evil from the inside, and with more resources to boot. Clever maneuvering or easy rationalization? Not a few members of Angel's team accused him of selling out (as did a number of viewers), but as with most of the show's previous four seasons, Angel somehow took a dubious premise and mined it for gold. And with one core cast member gone (Charisma Carpenter, whose Cordelia was immersed in a deep coma), it seemed as if the show, from within and without, would suddenly fall apart--that is, until Angel's longtime nemesis Spike (James Marsters) showed up, fresh from his sacrificial roasting at the series finale of Buffy the Vampire Slayer. Let the vampire games begin!\"]\n{'Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Contributor': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '16 hours and 30 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '80', 'Media Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Run time': '16 hours and 30 minutes', 'Release date': 'October 12, 2010', 'Actors': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nThe case is beautiful. This was, and always will be, my favorite television series. It ended too soon, most likely due to a lack of good digital editing and cgi at the time.  The character developments and storylines were beautiful. It is not a surprise Joss Whedon went on to direct one of the most success franchises today.\nGreat package design for a great television series\nSPIRITED AWAY DVD\nRumi Hiiragi  (Actor),     Miyu Irino  (Actor),     Hayao Miyazaki  (Director, Writer),     Kirk Wise  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n[\"Winner of the Academy Award® for Best Animated Feature, Hayao Miyazaki's wondrous fantasy adventure is a dazzling masterpiece from one of the most celebrated filmmakers in the history of animation. Chihiro's family is moving to a new house, but when they stop on the way to explore an abandoned village, her parents undergo a mysterious transformation and Chihiro is whisked into a world of fantastic spirits ruled over by the sorceress, Yubaba. Put to work in a magical bathhouse for spirits and demons, Chihiro must use all her wits to survive in this strange new place, find a way to free her parents and return to the normal world. Overflowing with imaginative creatures and thrilling storytelling, Spirited Away became a worldwide smash hit, and is one of the most critically-acclaimed films of all time.\", 'Bonus Content:', 'Behind the Microphone', 'Behind the Microphone', 'Nippon Television Special', 'Nippon Television Special', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'spirited-away', 'Director': 'Hayao Miyazaki, Kirk Wise', 'Media Format': 'Widescreen, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 17, 2017', 'Actors': 'Rumi Hiiragi, Miyu Irino, Mari Natsuki, Takashi Naito, Yasuko Sawaguchi', 'Dubbed': 'French, Japanese', 'Subtitles': 'French', 'Producers': 'Toshio Suzuki', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love this movie, have seen it about five times. I have been wanting to watch some Ghibli films so I bought this with four other DVDs. Package itself was fine but the shrink wrap on the dvd split open, and the disc popped out of the tab and had been moving around inside the case. I have yet to watch the DVD but the disc looks fine and does not have any scratches.\nLovely movie for the whole family\nGrave of the Fireflies\nIsao Takahata  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n[\"As the Empire of the Sun crumbles upon itself and a rain of firebombs falls upon Japan, the final death march of a nation is echoed in millions of smaller tragedies. This is the story of Seita and his younger sister Setsuko, two children born at the wrong time, in the wrong place, and now cast adrift in a world that lacks not the care to shelter them, but simply the resources. Forced to fend for themselves in the aftermath of fires that swept entire cities from the face of the earth, their doomed struggle is both a tribute to the human spirit and the stuff of nightmares. Beautiful, yet at times brutal and horrifying. Based on the retellings of survivor Nosaka Akiyuki and directed by Iaso Takahata (co-founder, with Hayao Miyazaki, of Japan's legendary Studio Ghibli,) Grave of the Fireflies has been universally hailed as an artistic and emotional tour de force. Now digitally remastered and restored, it is one of the rare films that truly deserves to be called a masterpiece.\"]\n{'Genre': 'kids & family', 'Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Contributor': 'Isao Takahata', 'Language': 'English, Japanese', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 1.6 Ounces', 'Item model number': '26387168', 'Director': 'Isao Takahata', 'Media Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Release date': 'March 6, 2012', 'Subtitles': 'English', 'Studio': 'Section 23', 'Number of discs': '1'}\nThis is one of the saddest films I have ever seen. Very eye opening and different from any Miyazaki film I have watched. Be prepared with a box of tissues the first time you watch this film. The whole movie follows the effects of a war-torn city on two small children.\nDevastatingly Great\nKiki's Delivery Service\nKirsten Dunst  (Actor),     Phil Hartman  (Actor),     Hayao Miyazaki  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Product Description', \"Discover KIKI'S DELIVERY SERVICE, a fantastic coming-of-age tale full of magic, adventure and self-discovery from the sensational imagination of Academy Award(R)-winning director Hayao Miyazaki (2002, Best Animated Feature, SPIRITED AWAY). And now you can explore even more of Kiki's amazing world through never-before-seen bonus features -- exclusively in this 2-Disc Special Edition DVD! Kiki is an enterprising young girl who must follow tradition to become a full-fledged witch. Venturing out with only her black cat, Jiji, Kiki flies off for the adventure of a lifetime. Landing in a far-off city, she sets up a high-flying delivery service and begins a wonderful experience of independence and responsibility as she finds her place in the world. Bring home KIKI'S DELIVERY SERVICE from Studio Ghibli and Disney for your family's DVD library and share Kiki's high-flying adventure again and again.\", 'Amazon.com', \"In Hayao Miyazaki's magical\", \"Kiki's Delivery Service\", \", a 13-year-old girl meets the world head on as she spends her first year soloing as an apprentice witch. Kiki (Kirsten Dunst) is still a little green and plenty headstrong, but also resourceful, imaginative, and determined. With her trusty wisp of a cat Jiji (a gently subdued Phil Hartman) by her side she's ready to take on the world, or at least the quaintly European seaside village she's chosen as her new home. Miyazaki's gentle rhythm and meandering narrative capture the easy pulse of real life (even if his subject is a girl flying high upon a broomstick) and charts the everyday struggles and growing pains of his plucky heroine with sensitivity and understanding. Beautifully detailed animation and the rich designs of the picture-postcard seaside town of red-tiled roofs and cobblestone streets only add to the sense of wonder. This charming animated fantasy is a wholesome, life-affirming picture that doesn't speak down to kids or up to adults. --\", 'Sean Axmaker']\n{'Genre': 'Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Janeane Garofalo, Matthew Lawrence, Original Story By Eiko Kadono, Hayao Miyazaki, Edie McClurg, Phil Hartman, Jeff Bennett, Corey Burton, Screenplay By Hayao Miyazaki, Debbie Reynolds, Kath Soucie, Kirsten Dunst, Debi Derryberry, Pamela Segall, Tress MacNeilleJaneane Garofalo, Matthew Lawrence, Original Story By Eiko Kadono, Hayao Miyazaki, Edie McClurg, Phil Hartman, Jeff Bennett, Corey Burton, Screenplay By Hayao Miyazaki, Debbie Reynolds, Kath Soucie, Kirsten Dunst, Debi Derryberry, Pamela Segall, Tress MacNeille   See more', 'Language': 'Japanese (Dolby Digital 2.0 Surround), English (Dolby Surround), French, Unqualified, Spanish', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '786936791655', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'March 2, 2010', 'Actors': 'Kirsten Dunst, Phil Hartman, Janeane Garofalo, Matthew Lawrence, Debbie Reynolds', 'Dubbed': 'Spanish, English, French', 'Subtitles': 'French', 'Studio': 'Disney Presents Studio Ghibli', 'Writers': 'Original Story By Eiko Kadono, Screenplay By Hayao Miyazaki', 'Number of discs': '1'}\nI first saw this movie when I was a young child (29 now.) It has always been a movie I can watch when I am feeling down and it never fails to lift me up. I decided to purchase this along side four other Japanese animated films. Package was delivered in good shape and on time.\nLook forward to sharing this with my child\nHowl's Moving Castle [DVD]\nEmily Mortimer  (Actor),     Jean Simmons  (Actor),     Hayao Miyazaki  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n['\"An animated tour-de-force\" – A.O. Scott, The New York Times From the legendary Studio Ghibli, creators of Spirited Away, and acclaimed director Hayao Miyazaki, comes the Academy Award®- nominated fantasy adventure for the whole family. Sophie, a quiet girl working in a hat shop, finds her life thrown into turmoil when she is literally swept off her feet by a handsome but mysterious wizard named Howl. The vain and vengeful Witch of the Waste, jealous of their friendship, puts a curse on Sophie and turns her into a 90-year-old woman. On a quest to break the spell, Sophie climbs aboard Howl\\'s magnificent moving castle and into a new life of wonder and adventure. But as the true power of Howl\\'s wizardry is revealed, Sophie finds herself fighting to protect them both from a dangerous war of sorcery that threatens their world.', 'Bonus Content:', 'Behind the Microphone', 'Behind the Microphone', 'Interview with Diana Wynne Jones', 'Interview with Diana Wynne Jones', \"Miyazaki's Visit to Pixar\", \"Miyazaki's Visit to Pixar\", 'Explanation of CG', 'Explanation of CG', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\n{'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Dubbed, NTSC, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren BacallChristian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren Bacall  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DSF18161D', 'Director': 'Hayao Miyazaki', 'Media Format': 'Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '2 hours', 'Release date': 'October 17, 2017', 'Actors': 'Emily Mortimer, Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner', 'Dubbed': 'French, Japanese', 'Subtitles': 'French, English', 'Producers': 'Toshio Suzuki', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have watched this film so many times I don’t even remember how many. Something you can watch with the whole family. It has great voice acting, animation and an intriguing story. The romantic element teaches a great lesson about loving someone for their morals and the things they do - as opposed to what they look like. I ordered this with four other DVDs and they shipped together in one envelope. The package was in good shape and was delivered on time.\nCould watch over and over again\n3 From Hell (UNRATED VERSION)\nHorror, Action, Gritty, Malicious\n[\"First there was House of 1,000 Corpses. Then there was The Devil's Rejects. Now, from writer-director Rob Zombie, comes the next blood-soaked chapter in the most violent crime saga in movie history—3 from Hell.\"]\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Zombie'], 'Producers': ['Mike Elliott', 'Rob Zombie', 'Tony Ciulla'], 'Starring': ['Sheri Moon Zombie', 'Bill Moseley', 'Richard Brake']}\nI’m a huge Rob Zombie fan. I have seen all the movies in the House of a Thousand Corpses series but this movie was not very good. I liked the actors, but it was a shame Sid Haig was too ill to really appear in much of the film. The man they had to replace him (Deadhead from 31) is a nice replacement but was obviously inserted to fill Haig’s absence. Baby’s personality was too unconvincing for her character- the direction they took with her was just odd and nonsensical. It didn’t really make sense for her journey through the series as a whole. Otis was almost boring and forced (not by the acting but by the character development/playout.) The movie was almost uneventful, just seemed like a bunch of filler. My assumption is that Rob had good intentions but had to make last minute changes due to Haig’s illness, so a lot of the movie is just weird in a bad way.\nDisappointing For Long Time Fans Of Series\nLegend of Korra: The Complete Series\nDavid Faustino  (Actor),     Jeff Bennett  (Actor),     Joaquim Dos Santos  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n[\"The spirit of the Avatar lives on in the complete series of The Legend of Korra! Relive every moment from all four books. From meeting Avatar Korra, a teenage girl from the Southern Water Tribe, in book one, to opening the spirit portal and entering a new age where spirits and mankind coexist in books two and three, to embarking on a journey of self-discovery and restoring balance to the Earth Kingdom in book four, you won't want to miss a second of air, earth, water and fire bending in this complete collection!\"]\n{'Genre': 'Anime & Manga, Kids & Family/Animation', 'Format': 'NTSC', 'Contributor': 'Joaquim Dos Santos, David Faustino, Janet Varney, Dee Bradley Baker, Jeff Bennett, P.J. Byrne', 'Language': 'English', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Item model number': '43381888', 'Director': 'Joaquim Dos Santos', 'Media Format': 'NTSC', 'Release date': 'December 13, 2016', 'Actors': 'David Faustino, Jeff Bennett, Janet Varney, P.J. Byrne, Dee Bradley Baker', 'Dubbed': 'French, Spanish', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '8'}\nThe DVD arrived in great condition. My fiancé is almost done with the series and, so far, no issues with the disc.\nPackage arrived on time, in good condition\nPenny Dreadful: The Complete Series\nRory Kinnear  (Actor),     Josh Hartnett  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n[\"Some of literature's most terrifying characters, including Dr. Frankenstein and his monster, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. They are joined by a core of original characters in a complex, frightening new narrative, where personal demons from the past can be stronger than vampires, evil spirits and immortal beasts. Relive every chilling episode of Showtime's Penny Dreadful if you dare.\"]\n{'Genre': 'Television, Horror/Television', 'Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Eva Green, Harry Treadaway, Rory Kinnear, Reeve Carney, Timothy Dalton, Josh Hartnett, Billie Piper', 'Language': 'English', 'Number Of Discs': '9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.74 Ounces', 'Media Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '24 hours and 22 minutes', 'Release date': 'July 18, 2017', 'Actors': 'Rory Kinnear, Josh Hartnett, Eva Green, Billie Piper, Harry Treadaway', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '9'}\nThe plastic on the cover is wrinkled, there is a small cut in the cover as well. The discs work fine.\nCover was wrinkled, discs worked\n{'Content advisory': ['Nudity', 'violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Lorcan Finnegan'], 'Producers': ['Brendan McCarthyJohn McDonnell'], 'Starring': ['Imogen Poots', 'Jesse Eisenberg', 'Danielle Ryan'], 'Studio': ['Lionsgate']}\nI loved the actors and their acting. The movie left something to be desired. I loved the concept at the beginning, it got a little boring towards the middle. The fate of the main characters was a little underwhelming.\nIt was Okay, great actors though\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg McLean'], 'Producers': ['Todd Fellman', 'Mike Gabrawy', 'Gary Hamilton', 'Mark Lazarus', 'Dana Lustig', 'Greg Mclean'], 'Starring': ['Daniel Radcliffe', 'Thomas Kretschmann', 'Joel Jackson']}\nIt was alright. Not as intense as I thought it was going to be. Amazing story though.\nGood cast\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tom Putnam'], 'Producers': ['Aaron Boyd', 'Ryan Frost', 'Tom Putnam', 'David Cross', 'Jory Weitz'], 'Starring': ['David Cross', 'Debra Messing', 'David Koechner']}\nMy fiancé and I really enjoyed this film. I was listening to a podcast interview where David Cross mentions his role in the film. I am happy that I did because I unfortunately missed the trailers for the release of the film. The acting, writing and character development are great. I found myself continuously saying, “Go back home!” to Cross’s character. All the elements of the film had me enjoying every minute of his journey.\nDavid Cross Shines",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: A Ghost Story [DVD]\nReview Date: 2019/05/02\nStore: Casey Affleck  (Actor),     Rooney Mara  (Actor),     David Lowery  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['This is the story of a ghost and the house he haunts.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Kenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney MaraKenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney Mara  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 32 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'ghost-story', 'Director': 'David Lowery', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 3, 2017', 'Actors': 'Casey Affleck, Rooney Mara, McColm Cephas Jr., Kenneisha Thompson', 'Subtitles': 'Spanish', 'Producers': 'Adam Donaghey, Toby Halbrooks, James Johnston', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: I saw this movie in theaters and fell in love. It gives you this nostalgic feeling you just don’t get from many movies. Between the ambiance and music, it is truly haunting to watch. Be careful because you can find yourself in a sad mood at the end.\nReview Title: Nostalgic ambiance\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Angel: The Complete Series\nReview Date: 2019/05/02\nStore: David Boreanaz  (Actor),     Alexis Denisof  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Monsters & Mutants\nProduct Description: ['Product Description', '* ANGEL SEASON 1 (6 DISCS)', '* ANGEL SEASON 2 (6 DISCS)', '* ANGEL SEASON 3 (6 DISCS)', '* ANGEL SEASON 4 (6 DISCS)', '* ANGEL SEASON 5 (6 DISCS)', 'Amazon.com', 'Angel - Season One', \"He's hunky, he's brooding, he's a do-gooder, and he was Buffy's first boyfriend. Angel, the tortured vampire destined to walk the earth with a soul, got his own series after three seasons on Buffy the Vampire Slayerand did what any new star might do: he moved to L.A. (the City of Angels--get it?) and set up shop. Angel (co-created by Buffy mastermind Joss Whedon) finds the titular vampire (David Boreanaz) as a kind of supernatural private investigator, fighting evil one case at a time and, like his ex-girlfriend, keeping the world from getting destroyed by vengeful demons and such. This first season features guest appearances by various Buffy characters, including werewolf boy Oz (Seth Green), rogue slayer Faith (Eliza Dushku), deliciously evil vamp Darla (Julie Benz), and Buffy herself (Sarah Michelle Gellar), all of whom helped get the show off and running in style.\", 'Angel - Season Two', \"The second season of Angel, saw the cult vampire show finally stand on its own from Buffy the Vampire Slayer, assembling all the members of the show's core cast, transferring the action to a fashionably run-down L.A. hotel, and bringing in a few Buffy characters from Angel's history to further establish the moody vampire's own mythology. Moving their Angel Investigations to posher digs, Angel (David Boreanaz), Cordelia (Charisma Carpenter), and Wesley (Alexis Denisof) were soon joined by street fighter (J. August Richards)–-and by street fighter, of course we mean demon street fighter. But just as this group was solidifying, up popped Angel's old love, Darla (the fantastic Julie Benz), freshly arrived in L.A. from a hell dimension… just in time to be turned into a vampire again by her old cohort, Drusilla (Juliet Landau), and lure Angel into abandoning his newly formed team.\", 'Angel - Season Three', \"In the third season of Angel, the titular vampire with a soul was forced to stand alone thanks to the (temporary) death of his beloved Buffy and her show's move to a new network, with no crossover between the two allowed. He returns from seeking peace in a demon-haunted monastery to find the L.A. Angel Investigations team fighting supernatural crime in his absence. Fred is still haunted by the nightmare dimension from which they rescued her; Cordelia's visions get ever more painful and debilitating. The schemes of the evil law firm Wolfram and Hart become every more imaginative and dragon lady Lilah Morgan becomes even more of an enemy when lusting after Angel. Unbelievably, Darla, Angel's vampire sire and lover, turns up, pregnant with his child and is tortured by inexplicable motherly feelings as well as a raging thirst for human blood.\", 'Angel - Season Four', \"As the fourth season of Angel, starts, everything is still as we left it: Angel has been sunk to the bottom of the sea in an iron box by his inexplicable and vindictive son Connor and Cordelia has been summoned to higher realms to await orders. Gunn and Fred are left in the Hyperion Hotel, unsure about what has happened to their friends, and Lilah is working hard to seduce Wesley to the dark side. In the first few episodes, some of this is resolved but it's almost immediately replaced by far worse crises: prophesies of doom accumulate more rapidly even than usual in this wonderfully gloomy show and a horned rock-like beast rains fire on Los Angeles. This last year is Angel’s most tightly dramatic season yet--with a story arc of surprising intensity punctuated by the show's usual wit and sexiness.\", 'Angel - Season Five', \"Lives were upended--and some co-opted--in the fifth and final season of Angel, as the denizens of Angel Investigations found themselves taking on one of their scariest endeavors ever: corporate life. After making a literal deal with the devil (or something distinctly devil-like), Angel (David Boreanaz) moved his team from their crumbling hotel to the high-rise digs of law-firm-from-hell Wolfram & Hart, his reasoning being they could better fight the forces of evil from the inside, and with more resources to boot. Clever maneuvering or easy rationalization? Not a few members of Angel's team accused him of selling out (as did a number of viewers), but as with most of the show's previous four seasons, Angel somehow took a dubious premise and mined it for gold. And with one core cast member gone (Charisma Carpenter, whose Cordelia was immersed in a deep coma), it seemed as if the show, from within and without, would suddenly fall apart--that is, until Angel's longtime nemesis Spike (James Marsters) showed up, fresh from his sacrificial roasting at the series finale of Buffy the Vampire Slayer. Let the vampire games begin!\"]\nAverage Rating: 4.8\nProduct Details: {'Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Contributor': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '16 hours and 30 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '80', 'Media Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Run time': '16 hours and 30 minutes', 'Release date': 'October 12, 2010', 'Actors': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: The case is beautiful. This was, and always will be, my favorite television series. It ended too soon, most likely due to a lack of good digital editing and cgi at the time.  The character developments and storylines were beautiful. It is not a surprise Joss Whedon went on to direct one of the most success franchises today.\nReview Title: Great package design for a great television series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SPIRITED AWAY DVD\nReview Date: 2019/08/07\nStore: Rumi Hiiragi  (Actor),     Miyu Irino  (Actor),     Hayao Miyazaki  (Director, Writer),     Kirk Wise  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: [\"Winner of the Academy Award® for Best Animated Feature, Hayao Miyazaki's wondrous fantasy adventure is a dazzling masterpiece from one of the most celebrated filmmakers in the history of animation. Chihiro's family is moving to a new house, but when they stop on the way to explore an abandoned village, her parents undergo a mysterious transformation and Chihiro is whisked into a world of fantastic spirits ruled over by the sorceress, Yubaba. Put to work in a magical bathhouse for spirits and demons, Chihiro must use all her wits to survive in this strange new place, find a way to free her parents and return to the normal world. Overflowing with imaginative creatures and thrilling storytelling, Spirited Away became a worldwide smash hit, and is one of the most critically-acclaimed films of all time.\", 'Bonus Content:', 'Behind the Microphone', 'Behind the Microphone', 'Nippon Television Special', 'Nippon Television Special', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'spirited-away', 'Director': 'Hayao Miyazaki, Kirk Wise', 'Media Format': 'Widescreen, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 17, 2017', 'Actors': 'Rumi Hiiragi, Miyu Irino, Mari Natsuki, Takashi Naito, Yasuko Sawaguchi', 'Dubbed': 'French, Japanese', 'Subtitles': 'French', 'Producers': 'Toshio Suzuki', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I love this movie, have seen it about five times. I have been wanting to watch some Ghibli films so I bought this with four other DVDs. Package itself was fine but the shrink wrap on the dvd split open, and the disc popped out of the tab and had been moving around inside the case. I have yet to watch the DVD but the disc looks fine and does not have any scratches.\nReview Title: Lovely movie for the whole family\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Grave of the Fireflies\nReview Date: 2019/08/07\nStore: Isao Takahata  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: [\"As the Empire of the Sun crumbles upon itself and a rain of firebombs falls upon Japan, the final death march of a nation is echoed in millions of smaller tragedies. This is the story of Seita and his younger sister Setsuko, two children born at the wrong time, in the wrong place, and now cast adrift in a world that lacks not the care to shelter them, but simply the resources. Forced to fend for themselves in the aftermath of fires that swept entire cities from the face of the earth, their doomed struggle is both a tribute to the human spirit and the stuff of nightmares. Beautiful, yet at times brutal and horrifying. Based on the retellings of survivor Nosaka Akiyuki and directed by Iaso Takahata (co-founder, with Hayao Miyazaki, of Japan's legendary Studio Ghibli,) Grave of the Fireflies has been universally hailed as an artistic and emotional tour de force. Now digitally remastered and restored, it is one of the rare films that truly deserves to be called a masterpiece.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'kids & family', 'Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Contributor': 'Isao Takahata', 'Language': 'English, Japanese', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 1.6 Ounces', 'Item model number': '26387168', 'Director': 'Isao Takahata', 'Media Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Release date': 'March 6, 2012', 'Subtitles': 'English', 'Studio': 'Section 23', 'Number of discs': '1'}\nReview Text: This is one of the saddest films I have ever seen. Very eye opening and different from any Miyazaki film I have watched. Be prepared with a box of tissues the first time you watch this film. The whole movie follows the effects of a war-torn city on two small children.\nReview Title: Devastatingly Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kiki's Delivery Service\nReview Date: 2019/08/07\nStore: Kirsten Dunst  (Actor),     Phil Hartman  (Actor),     Hayao Miyazaki  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', \"Discover KIKI'S DELIVERY SERVICE, a fantastic coming-of-age tale full of magic, adventure and self-discovery from the sensational imagination of Academy Award(R)-winning director Hayao Miyazaki (2002, Best Animated Feature, SPIRITED AWAY). And now you can explore even more of Kiki's amazing world through never-before-seen bonus features -- exclusively in this 2-Disc Special Edition DVD! Kiki is an enterprising young girl who must follow tradition to become a full-fledged witch. Venturing out with only her black cat, Jiji, Kiki flies off for the adventure of a lifetime. Landing in a far-off city, she sets up a high-flying delivery service and begins a wonderful experience of independence and responsibility as she finds her place in the world. Bring home KIKI'S DELIVERY SERVICE from Studio Ghibli and Disney for your family's DVD library and share Kiki's high-flying adventure again and again.\", 'Amazon.com', \"In Hayao Miyazaki's magical\", \"Kiki's Delivery Service\", \", a 13-year-old girl meets the world head on as she spends her first year soloing as an apprentice witch. Kiki (Kirsten Dunst) is still a little green and plenty headstrong, but also resourceful, imaginative, and determined. With her trusty wisp of a cat Jiji (a gently subdued Phil Hartman) by her side she's ready to take on the world, or at least the quaintly European seaside village she's chosen as her new home. Miyazaki's gentle rhythm and meandering narrative capture the easy pulse of real life (even if his subject is a girl flying high upon a broomstick) and charts the everyday struggles and growing pains of his plucky heroine with sensitivity and understanding. Beautifully detailed animation and the rich designs of the picture-postcard seaside town of red-tiled roofs and cobblestone streets only add to the sense of wonder. This charming animated fantasy is a wholesome, life-affirming picture that doesn't speak down to kids or up to adults. --\", 'Sean Axmaker']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Janeane Garofalo, Matthew Lawrence, Original Story By Eiko Kadono, Hayao Miyazaki, Edie McClurg, Phil Hartman, Jeff Bennett, Corey Burton, Screenplay By Hayao Miyazaki, Debbie Reynolds, Kath Soucie, Kirsten Dunst, Debi Derryberry, Pamela Segall, Tress MacNeilleJaneane Garofalo, Matthew Lawrence, Original Story By Eiko Kadono, Hayao Miyazaki, Edie McClurg, Phil Hartman, Jeff Bennett, Corey Burton, Screenplay By Hayao Miyazaki, Debbie Reynolds, Kath Soucie, Kirsten Dunst, Debi Derryberry, Pamela Segall, Tress MacNeille   See more', 'Language': 'Japanese (Dolby Digital 2.0 Surround), English (Dolby Surround), French, Unqualified, Spanish', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '786936791655', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'March 2, 2010', 'Actors': 'Kirsten Dunst, Phil Hartman, Janeane Garofalo, Matthew Lawrence, Debbie Reynolds', 'Dubbed': 'Spanish, English, French', 'Subtitles': 'French', 'Studio': 'Disney Presents Studio Ghibli', 'Writers': 'Original Story By Eiko Kadono, Screenplay By Hayao Miyazaki', 'Number of discs': '1'}\nReview Text: I first saw this movie when I was a young child (29 now.) It has always been a movie I can watch when I am feeling down and it never fails to lift me up. I decided to purchase this along side four other Japanese animated films. Package was delivered in good shape and on time.\nReview Title: Look forward to sharing this with my child\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Howl's Moving Castle [DVD]\nReview Date: 2019/08/07\nStore: Emily Mortimer  (Actor),     Jean Simmons  (Actor),     Hayao Miyazaki  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: ['\"An animated tour-de-force\" – A.O. Scott, The New York Times From the legendary Studio Ghibli, creators of Spirited Away, and acclaimed director Hayao Miyazaki, comes the Academy Award®- nominated fantasy adventure for the whole family. Sophie, a quiet girl working in a hat shop, finds her life thrown into turmoil when she is literally swept off her feet by a handsome but mysterious wizard named Howl. The vain and vengeful Witch of the Waste, jealous of their friendship, puts a curse on Sophie and turns her into a 90-year-old woman. On a quest to break the spell, Sophie climbs aboard Howl\\'s magnificent moving castle and into a new life of wonder and adventure. But as the true power of Howl\\'s wizardry is revealed, Sophie finds herself fighting to protect them both from a dangerous war of sorcery that threatens their world.', 'Bonus Content:', 'Behind the Microphone', 'Behind the Microphone', 'Interview with Diana Wynne Jones', 'Interview with Diana Wynne Jones', \"Miyazaki's Visit to Pixar\", \"Miyazaki's Visit to Pixar\", 'Explanation of CG', 'Explanation of CG', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Dubbed, NTSC, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren BacallChristian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren Bacall  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DSF18161D', 'Director': 'Hayao Miyazaki', 'Media Format': 'Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '2 hours', 'Release date': 'October 17, 2017', 'Actors': 'Emily Mortimer, Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner', 'Dubbed': 'French, Japanese', 'Subtitles': 'French, English', 'Producers': 'Toshio Suzuki', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have watched this film so many times I don’t even remember how many. Something you can watch with the whole family. It has great voice acting, animation and an intriguing story. The romantic element teaches a great lesson about loving someone for their morals and the things they do - as opposed to what they look like. I ordered this with four other DVDs and they shipped together in one envelope. The package was in good shape and was delivered on time.\nReview Title: Could watch over and over again\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 From Hell (UNRATED VERSION)\nReview Date: 2020/01/24\nCategories: Horror, Action, Gritty, Malicious\nProduct Description: [\"First there was House of 1,000 Corpses. Then there was The Devil's Rejects. Now, from writer-director Rob Zombie, comes the next blood-soaked chapter in the most violent crime saga in movie history—3 from Hell.\"]\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Zombie'], 'Producers': ['Mike Elliott', 'Rob Zombie', 'Tony Ciulla'], 'Starring': ['Sheri Moon Zombie', 'Bill Moseley', 'Richard Brake']}\nReview Text: I’m a huge Rob Zombie fan. I have seen all the movies in the House of a Thousand Corpses series but this movie was not very good. I liked the actors, but it was a shame Sid Haig was too ill to really appear in much of the film. The man they had to replace him (Deadhead from 31) is a nice replacement but was obviously inserted to fill Haig’s absence. Baby’s personality was too unconvincing for her character- the direction they took with her was just odd and nonsensical. It didn’t really make sense for her journey through the series as a whole. Otis was almost boring and forced (not by the acting but by the character development/playout.) The movie was almost uneventful, just seemed like a bunch of filler. My assumption is that Rob had good intentions but had to make last minute changes due to Haig’s illness, so a lot of the movie is just weird in a bad way.\nReview Title: Disappointing For Long Time Fans Of Series\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Legend of Korra: The Complete Series\nReview Date: 2020/02/09\nStore: David Faustino  (Actor),     Jeff Bennett  (Actor),     Joaquim Dos Santos  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: [\"The spirit of the Avatar lives on in the complete series of The Legend of Korra! Relive every moment from all four books. From meeting Avatar Korra, a teenage girl from the Southern Water Tribe, in book one, to opening the spirit portal and entering a new age where spirits and mankind coexist in books two and three, to embarking on a journey of self-discovery and restoring balance to the Earth Kingdom in book four, you won't want to miss a second of air, earth, water and fire bending in this complete collection!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Anime & Manga, Kids & Family/Animation', 'Format': 'NTSC', 'Contributor': 'Joaquim Dos Santos, David Faustino, Janet Varney, Dee Bradley Baker, Jeff Bennett, P.J. Byrne', 'Language': 'English', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Item model number': '43381888', 'Director': 'Joaquim Dos Santos', 'Media Format': 'NTSC', 'Release date': 'December 13, 2016', 'Actors': 'David Faustino, Jeff Bennett, Janet Varney, P.J. Byrne, Dee Bradley Baker', 'Dubbed': 'French, Spanish', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '8'}\nReview Text: The DVD arrived in great condition. My fiancé is almost done with the series and, so far, no issues with the disc.\nReview Title: Package arrived on time, in good condition\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Penny Dreadful: The Complete Series\nReview Date: 2020/02/09\nStore: Rory Kinnear  (Actor),     Josh Hartnett  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Boxed Sets\nProduct Description: [\"Some of literature's most terrifying characters, including Dr. Frankenstein and his monster, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. They are joined by a core of original characters in a complex, frightening new narrative, where personal demons from the past can be stronger than vampires, evil spirits and immortal beasts. Relive every chilling episode of Showtime's Penny Dreadful if you dare.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Horror/Television', 'Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Eva Green, Harry Treadaway, Rory Kinnear, Reeve Carney, Timothy Dalton, Josh Hartnett, Billie Piper', 'Language': 'English', 'Number Of Discs': '9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.74 Ounces', 'Media Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '24 hours and 22 minutes', 'Release date': 'July 18, 2017', 'Actors': 'Rory Kinnear, Josh Hartnett, Eva Green, Billie Piper, Harry Treadaway', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '9'}\nReview Text: The plastic on the cover is wrinkled, there is a small cut in the cover as well. The discs work fine.\nReview Title: Cover was wrinkled, discs worked\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/07/08\nAverage Rating: 3.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Lorcan Finnegan'], 'Producers': ['Brendan McCarthyJohn McDonnell'], 'Starring': ['Imogen Poots', 'Jesse Eisenberg', 'Danielle Ryan'], 'Studio': ['Lionsgate']}\nReview Text: I loved the actors and their acting. The movie left something to be desired. I loved the concept at the beginning, it got a little boring towards the middle. The fate of the main characters was a little underwhelming.\nReview Title: It was Okay, great actors though\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/07/08\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg McLean'], 'Producers': ['Todd Fellman', 'Mike Gabrawy', 'Gary Hamilton', 'Mark Lazarus', 'Dana Lustig', 'Greg Mclean'], 'Starring': ['Daniel Radcliffe', 'Thomas Kretschmann', 'Joel Jackson']}\nReview Text: It was alright. Not as intense as I thought it was going to be. Amazing story though.\nReview Title: Good cast\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/12/11\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tom Putnam'], 'Producers': ['Aaron Boyd', 'Ryan Frost', 'Tom Putnam', 'David Cross', 'Jory Weitz'], 'Starring': ['David Cross', 'Debra Messing', 'David Koechner']}\nReview Text: My fiancé and I really enjoyed this film. I was listening to a podcast interview where David Cross mentions his role in the film. I am happy that I did because I unfortunately missed the trailers for the release of the film. The acting, writing and character development are great. I found myself continuously saying, “Go back home!” to Cross’s character. All the elements of the film had me enjoying every minute of his journey.\nReview Title: David Cross Shines\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual demonstrates a strong preference for emotionally resonant and artistically crafted films, particularly within the fantasy and drama genres, showcased by high ratings for works by renowned directors, especially those from Studio Ghibli. The repeated admiration for nostalgic themes, complex narratives, and deep character development highlights an appreciation for creative storytelling over superficial entertainment. \n\nThis person shows consistency in selecting family-oriented content, as reflected in their choices of animated films and series, indicating a focus on wholesome entertainment. Meanwhile, their choices in horror genres reveal an openness to darker, more mature themes, though they express a critical lens on disappointing sequels within familiar series.\n\nQuality appears paramount, with multiple interactions showcasing a willingness to pay for well-crafted discs and box sets, hinting at moderate price sensitivity but an overall priority on perceived value. They demonstrate a trend towards immersive storytelling and character-driven plots, often rating films highly for emotional depth and coherence.\n\nIn essence, this individual values intricate world-building and character arcs across multiple genres, favoring films that resonate emotionally and allow for family viewing, while maintaining a critical eye for quality and authenticity in cinematic expressions.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Beautiful acting, Wonderfully Tragic Story",
    "text": "One of my favorite movies based on someone’s life. The acting is superb. I recently had my fiancé watch this with me and he loved it. The film never gets boring but prepare to feel pity for this amazingly talented singer.",
    "images": [],
    "asin": "B01DCUUOGO",
    "parent_asin": "B01DCUUOGO",
    "user_id": "AE7CAVS7MARECXXVSEYLP36VYIBQ",
    "timestamp": "2021-06-11 14:50:30.108000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 2939,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a60df472a0069aea2a23178495b334f0ab74897e391e5578d0406de8f42f12a9._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a60df472a0069aea2a23178495b334f0ab74897e391e5578d0406de8f42f12a9._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a60df472a0069aea2a23178495b334f0ab74897e391e5578d0406de8f42f12a9._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a60df472a0069aea2a23178495b334f0ab74897e391e5578d0406de8f42f12a9._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a60df472a0069aea2a23178495b334f0ab74897e391e5578d0406de8f42f12a9._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/a60df472a0069aea2a23178495b334f0ab74897e391e5578d0406de8f42f12a9._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "Français"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Olivier Dahan"
      ],
      "Producers": [
        "Timothy Burrill",
        "Axel Decis",
        "Alain Goldman",
        "Marc Jenny",
        "Oldrich Mach",
        "Catherine Morisse",
        "Marc Vadé"
      ],
      "Starring": [
        "Marion Cotillard",
        "Emmanuelle Seigner",
        "Jean-Paul Rouve"
      ],
      "Studio": [
        "HBO"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}