{
  "user_id": "AFC4S6B4MGXYSZDLRAGWVB3VZLCQ",
  "summary": "=== Purchase Information ===\nProduct Title: 5 Broken Cameras\nReview Date: 2013/10/16\nStore: Emad Burnat  (Actor, Director),     Guy Davidi  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['Product Description', 'An extraordinary work of both cinematic and political activism, 5 Broken Cameras is a deeply personal, first-hand account of non-violent resistance in Bil\\'in, a West Bank village threatened by encroaching Israeli settlements. Shot almost entirely by Palestinian farmer Emad Burnat, who bought his first camera in 2005 to record the birth of his youngest son, the footage was later turned into a galvanizing cinematic experience by co-directors Guy Davidi and Burnat. Structured around the violent destruction of a succession of Burnat\\'s video cameras, the filmmakers\\' collaboration follows one family\\'s evolution over five years of village turmoil. Burnat watches from behind the lens as olive trees are bulldozed, protests intensify, and lives are lost. \"I feel like the camera protects me,\" he says, \"but it\\'s an illusion\".', 'Review', 'A rigorous and moving work of art. --A.O. Scott, The New York TimesUniquely powerful, putting faces and human consequences to a political dispute that will seemingly never end. --The Hollywood Reporter']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Subtitled, Anamorphic, Multiple Formats, Dolby, Color, Surround Sound, Dubbed, NTSC, Widescreen', 'Contributor': 'Guy Davidi, Emad Burnat', 'Language': 'Hebrew', 'Runtime': '1 hour and 30 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26172163', 'Director': 'Emad Burnat, Guy Davidi', 'Media Format': 'Subtitled, Anamorphic, Multiple Formats, Dolby, Color, Surround Sound, Dubbed, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Emad Burnat', 'Dubbed': 'Arabic', 'Subtitles': 'English', 'Studio': 'Kino Lorber films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I think the issue of the Israeli occupation was a bit one sided from the biased point of view of the Palastinians. I suppose it could have gone both ways.\nReview Title: My opinion\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Yiddish World Remembered\nReview Date: 2013/10/16\nStore: Elliott Gould  (Actor),     Andrew Goldberg  (Director, Producer)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Elliott Gould narrates this Emmy Award winning documentary which revisits the beautiful Eastern European Jewish world before the horrifying aftermath of World War II. Using rare archival films, vintage photos, personal recollections, traditional cantorial and more, it becomes an emotional portrayal of Jewish traditions, religious treasures, the fascinating language of Yiddish and life as it was. 2002/color-b&w/100 min/NR/fullscreen.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'NTSC', 'Contributor': 'Andrew Goldberg, Elliott Gould', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Andrew Goldberg', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 20, 2010', 'Actors': 'Elliott Gould', 'Producers': 'Andrew Goldberg', 'Studio': 'Shanchie Records', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I enjoyed the film. It covers a lot of what I heard of the old country by my parents and grandparents\nReview Title: lots of good footage\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The World of Sholom Aleichem\nReview Date: 2013/10/16\nStore: Zero Mostel  (Actor),     Nancy Walker  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: [\"A compilation of three stories from Sholom Aleichem (known as the Yiddish Mark Twain) – “A Tale of Chelm,” about a bookseller who tries to buy a goat in a town of fools; “Bontche Schweig,” a tale of a poor man whose heavenly arrival coaxes tears from the angels; and “The High School,” about a couple's attempts to send their son to a non-religious school. Starring Zero Mostel, Nancy Walker and Sam Levene.\"]\nAverage Rating: 4.3\nProduct Details: {'Genre': 'TV', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Jack Gilford, Nancy Walker, Zero Mostel, Sam Levene, Lee Grant', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Zero Mostel, Nancy Walker, Sam Levene, Jack Gilford, Lee Grant', 'Studio': 'Entertainment One', 'Number of discs': '1'}\nReview Text: I learned so much from this film about the origins of yiddish theater of which I'm a big fan. It described his work to a great extent.\nReview Title: I really was facinated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sholem Aleichem: Laughing in the Darkness\nReview Date: 2013/10/16\nStore: Rachel Dratch  (Actor),     Hillel Halkin  (Actor),     Joseph Dorman  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'A riveting portrait of the great writer whose stories became the basis of the Broadway musical Fiddler on the Roof, SHOLEM ALEICHEM: LAUGHING IN THE DARKNESS tells the tale of the rebellious genius who created an entirely new literature. Plumbing the depths of a Jewish world locked in crisis and on the cusp of profound change, he captured that world with brilliant humor. Sholem Aleichem was not just a witness to the creation of a new modern Jewish identity, but one of the very men who forged it.', 'Special Features', 'Making the Film; On Sholem Aleichem', 'Making the Film; On Sholem Aleichem', 'Review', '100% Fresh --Rotten Tomatoes…a rich, beautifully organized and illustrated modern history. --New York Times Critics PickCompelling…A beautifully made documentary that sets the record straight in a thoughtful, incisive way. --Los Angeles Times', 'About the Actor', \"Rachel Dratch grew up in Lexington, Massachusetts. After graduating from Dartmouth College with a degree in Drama and Psychology, she moved out to Chicago, where she studied with Del Close at Improvolympic. She was on the house team, Victim's Family, with Adam McKay. Rachel went on to tour with the Second City Touring Company and eventually advanced to the Second City Mainstage, where she appeared in four revues: Pinata Full Of Bees, Citizen Gates, Paradigm Lost and Promisekeepers Losers Weepers. For the latter two, she received the Joseph Jefferson Award for Best Actress in a Revue. After leaving the mainstage, she wrote and performed in the 2-person sketch show, Dratch and Fey, with Tina Fey. The show was seen at Second City, Upright Citizens Brigade Theater in NYC, and the Aspen Comedy Festival. In the fall of 1999, Rachel joined the cast of Saturday Night Live (1975), where she performed for 7 years. Her memorable characters include Boston teen Denise, the Lovers professors with Will Ferrell, junior high school student Sheldon and Debbie Downer.\", 'Hillel Halkin (born 1939) is an American-born Israeli translator, biographer, literary critic, and novelist. He was born in New York two months before the outbreak of World War II. He is the son of Abraham S. Halkin, a professor of Jewish literature, history and culture at the Jewish Theological Seminary of America. In 1970 he made aliyah to Israel, settling in Zichron Yaakov. He studied English Literature at Columbia University. Halkin is married to Marcia and the father of two daughters.', \"Jason Kravits (born May 28, 1967) is an American actor. His film credits include The Stepford Wives and Sweet November. Kravits has served more often as a television guest star. He can be seen in episodes of shows such as Friends; Law & Order: Special Victims Unit; Everybody Loves Raymond;Yes, Dear; Gilmore Girls; Law & Order and Harry's Law. He also performed in the Broadway show The Drowsy Chaperone with his brother Garth Kravits and in Relatively Speaking. He got his start playing Lolo Knopke on the short-lived 1982 PBS series PowerhouseHe played the District Attorney Richard Bay in the Emmy Award-Winning drama Series The Practice from 1999 to 2001. After almost three years of being a nemesis to the firm who would stop at nothing to get a conviction, his character was gunned down by associates of a man he successfully prosecuted. In 2000, he was a regular panelist on the Oxygen Network revival of I've Got a Secret. In the early 1990s, he was a company member at Round House Theatre in Silver Spring, Maryland. He was also a counselor at Green Acres Camp in Rockville, Maryland, where he played guitar and performed skits for campers. In 1986, he founded the University of Maryland's first improv theater group Erasable Inc. He attended Colonel Zadok A. Magruder High School.\", 'About the Director', 'Joseph Dorman, born April 23rd, 1958, grew up in the Detroit suburb of Bloomfield Hills. Graduated from high school in 1976 from Cranbrook School, Bloomfield Hills, Michigan. Studied at Brown University, Providence, RI, from where he graduated in 1980. Taught briefly at a prep school in Westchester County, NY before focusing on film as a career. Lives in New York City.', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Joseph Dorman', 'Media Format': 'Multiple Formats, Color, NTSC, Black & White', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 12, 2013', 'Actors': 'Rachel Dratch, Hillel Halkin, Jason Kravits', 'Studio': 'Docurama', 'Number of discs': '1'}\nReview Text: I have gotten a new found admiration for the life and times of this man.He has gone through a hell on earth and maintained his connection to his life as a jew. He triuphed in his works.\nReview Title: superb\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Frontline: Shtetl\nReview Date: 2013/10/16\nStore: .  (Actor),     Marian Marzynski  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Independently Distributed, Documentary\nProduct Description: [\"The true story of Bransk, a small Polish shtetl that died overnight when all it's Jewish residents were transported to Treblinka's gas chambers. A haunting story with tragic consequences emerges through interviews, photographs and personal stories.\"]\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.33:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5458905', 'Director': 'Marian Marzynski', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours', 'Release date': 'March 17, 2009', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: This film describes to a T the shtetl that my parents used to describe to us kids. I became more and more nostalgic as the film went on.\nReview Title: great portrayal\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Golden Age of 2nd Avenue\nReview Date: 2013/10/28\nStore: Herschel Bernardi  (Actor),     Paul Muni  (Actor),     Morton Silverstein  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: [\"The Yiddish Theater... What an age. What memories. This was the Broadway of the turn of the century, bringing joy, tears and laughter to struggling Jewish immigrants in New York's Lower East Side. It was the birth of Jewish American culture, and this vibrant and colorful world all started on Second Avenue.\"]\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.25 Ounces', 'Director': 'Morton Silverstein', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour', 'Release date': '08M 18, 2009', 'Actors': 'Herschel Bernardi, Paul Muni, Molly Picon, Maurice Schwartz, Menasha Skulnik', 'Studio': 'Sisu Home Ent.', 'Number of discs': '1'}\nReview Text: I really enjoyed this film. Very well done and Naarated by some of my favorite yiddish actors. It really brings to life the era where yiddish film was in it's hayday.\nReview Title: A+++++++++\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Golem (Restored Authorized Edition)\nReview Date: 2013/10/28\nStore: Paul Wegener  (Actor, Director, Writer),     Albert Steinrck  (Actor),     Carl Boese  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Classics, Silent Films\nProduct Description: ['Product description', 'Golem', 'Amazon.com', 'A relic certainly, but a fascinating one,', 'Der Golem', \"is perhaps the screen's first great monster movie. Though it was actually the third time director-star Paul Wegener had played the eponymous creation, the earlier efforts (sadly lost) were rough drafts for this elaborate dramatization of the Jewish legend. When the Emperor decrees that the Jews of mediaeval Prague should be evicted from the ghetto, a mystical rabbi creates a clay giant and summons the demon Astaroth who breathes out in smoky letters the magic word that will animate the golem. Intended as a protector and avenger, the golem is twisted by the machinations of a lovelorn assistant and, like many a monster to come, runs riot, terrorizing guilty and innocent alike until a little girl innocently ends his rampage. Wegener's golem is an impressively solid figure, the Frankenstein monster with a slightly comical clay wig. The wonderfully grotesque Prague sets and the alchemical atmosphere remain potent.\", '--Kim Newman']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror, Classics/Silent Films', 'Format': 'Multiple Formats, NTSC, Black & White, Silent', 'Contributor': 'Carl Ebert, Paul Wegener, Ernst Deutsch, Lyda Salmonova, Max Kronert, Henrik Galeen, Dore Paetzold, Loni Nest, Lothar Mthel, Otto Gebhr, Greta Schrder, Hans Strm, Albert Steinrck, Carl BoeseCarl Ebert, Paul Wegener, Ernst Deutsch, Lyda Salmonova, Max Kronert, Henrik Galeen, Dore Paetzold, Loni Nest, Lothar Mthel, Otto Gebhr, Greta Schrder, Hans Strm, Albert Steinrck, Carl Boese  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '2254731', 'Director': 'Carl Boese, Paul Wegener', 'Media Format': 'NTSC, Multiple Formats, Silent, Black & White', 'Run time': '1 hour and 31 minutes', 'Release date': 'September 24, 2002', 'Actors': 'Paul Wegener, Albert Steinrck, Ernst Deutsch, Lyda Salmonova, Hans Strm', 'Studio': 'Kino Lorber films', 'Writers': 'Henrik Galeen, Paul Wegener', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I can't say anything bad about this film, But I really cant say I enjoyed it. As far as silent films go, I guess it was OK\nReview Title: Ehhh.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Jewish Americans\nReview Date: 2014/06/23\nStore: .  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Independently Distributed, Documentary\nProduct Description: ['Product Description', 'This six-hour documentary follows 350 years of Jewish-American history, from the first settlement in the 17th century to the present, and explores the experience of immigration and assimilation. Liev Schreiber narrates.', 'Amazon.com', 'Originally broadcast on PBS,', 'The Jewish-Americans', 'covers 350 years in the lives of Jews who have struggled to maintain their religious identity and still be fully accepted as Americans. It is a story at once specific and universal, one that can be appreciated by any ethnic or religious minority who tests whether \"democracy, like America, can find room for everyone.\" Beginning with 23 Jewish exiles seeking safe haven in New Amsterdam in 1654, writer-director David Grubin does an admirable job of charting the often rocky and treacherous course for Jews in this country, and their personal \"tug of war between being American and being a Jew.\" Do they consider themselves Jewish-Americans, or American Jews? Carl Reiner, Mandy Patinkin, Sid Caesar, Jules Feiffer, playwright Tony Kushner, and Supreme Court Justice Ruth Bader Ginsburg are among the more recognizable personalities who offer illuminating commentary and bittersweet reminiscences. But Grubin presents what he calls \"an ensemble of voices\" rather than \"a star-studded parade.\" Authors, historians, sociologists, academics, and rabbis share a rich personal and cultural history.', 'Narrated by Liev Schreiber,', 'The Jewish-Americans', 'is comprised of three two-hour episodes, \"They Came to Stay,\" \"The Best of Times, the Worst of Times,\" and \"Home.\" Each is a richly textured tapestry of talking heads, still photos, archival footage, and audio and film clips (the inevitable', \"Gentleman's Agreement\", '), and reveal how Jews have become woven into the fabric of Jewish life. Songwriter Irving Berlin wrote \"God Bless America,\" and the holiday classics \"White Christmas\" and \"Easter Parade.\" Jerry Siegel and Joe Schuster created Superman. Another crossover pop culture success was Gertrude Berg as Molly Goldberg of the Bronx, offering sage advice and homespun wisdom on radio, television and the movies. One illuminating segment reveals how assimilated movie mogul Louis B. Mayer\\'s', 'Andy Hardy', 'films, with their \"fairy tale visions of small town life,\" were the \"American fantasies of a Jewish immigrant.\" Anti-Semitism rears its ugly head throughout the series. Grubin captures the hysteria surrounding the murder trial of Georgia factory worker Leo Franks, who, in 1915, was falsely convicted in the murder of 13-year-old Mary Phagan, and subsequently lynched by a homicidal mob. The segment that addresses the Holocaust documents America\\'s indifference in dealing with Hitler\\'s \"Final Solution.\" Grubin notes how political activism has long been a part of Jewish-American life, and how Jews took an active role in the Civil Rights struggle. As the old saying goes, you don\\'t have to be Jewish to be compelled and profoundly moved by this ambitious documentary miniseries. But it couldn\\'t hurt.', '--Donald Liebenson']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '1', 'Runtime': '6 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.55 x 5.36 x 7.47 inches; 4 Ounces', 'Item model number': '705225', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '6 hours', 'Release date': 'February 5, 2008', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I enjoyed this film\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Yiddish World Remembered\nReview Date: 2014/06/23\nStore: Andrew Goldberg  (Director, Producer)    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['In A Yiddish World Remembered, the story of Jewish life in Eastern Europe is brought to life again by some of the remaining eyewitnesses. Narrated by Academy Award nominated actor Elliott Gould and accompanied by never-before-seen archival films, vintage photographs, and, of course, traditional Klezmer and cantorial music, the documentary takes a realistic and enlightening look at this unique and all-but-vanished way of life. For those in rural communities, there was often no running water or electricity. For many, anti-Semitism was a part of daily life. But for everyone, crowded conditions and poverty seemed to prevail. Despite these trials, through the eyes of the individuals interviewed, we learn that Jewish communities were close-knit and often even joyous places to live. This television special explores everything from the fascinating language of Yiddish to the Rabbis and Rebbes that often ran the communities to the powerful Jewish movements of Khasidism, Bundism and Zionism. Aired nationally on PBS. This DVD contains over 20 minutes of bonus footage and interviews not seen in the broadcast.']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Item model number': 'TCP101DVD', 'Director': 'Andrew Goldberg', 'Media Format': 'NTSC, Full Screen', 'Run time': '1 hour and 20 minutes', 'Producers': 'Andrew Goldberg', 'Studio': 'Two Cats Productions'}\nReview Text: A quality work by the producers that captures the essence of jewish life in prewar europe.\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Green Prince\nReview Date: 2015/02/08\nStore: Mosab Hassan Yousef  (Actor),     Gonen Ben Yitzhak  (Actor),     Nadav Schirman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"PRINCE retraces the details of a highly sworn enemies. In the style of a tense psychological thriller, this extraordinary a Hamas leader who emerged as one of Israel's risked his career to protect him.\"]\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MBOX89DVD', 'Director': 'Nadav Schirman', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'January 20, 2015', 'Actors': 'Mosab Hassan Yousef, Gonen Ben Yitzhak', 'Subtitles': 'English', 'Studio': 'Music Box Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great film\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/03\nAverage Rating: 2.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Netalie Braun Avigail Sperber'], 'Producers': ['Avigail Sperber', 'Netalie Braun'], 'Studio': ['Syndicado']}\nReview Text: i liked it\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/03\nAverage Rating: 3.1\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['TravelVideoStore.com'], 'Producers': ['TravelVideoStore.com'], 'Studio': ['TravelVideoStore.com']}\nReview Text: I liked it\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/19\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', 'Nederlands', 'Português'], 'Directors': ['Quentin Tarantino'], 'Producers': ['Lawrence Bender'], 'Starring': ['Harvey Keitel', 'Tim Roth', 'Michael Madsen'], 'Studio': ['MIRAMAX']}\nReview Text: unbelievable good film\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/09/04\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Leonid Prudovsky'], 'Producers': ['Yochanan Weller', 'Freddy Zyskrot'], 'Starring': ['Esteban Gottfried', 'Tal Lifshitz', 'Fira Kantor'], 'Studio': ['Syndicado']}\nReview Text: kept me interested\nReview Title: A+\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/19\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Joel Fendelman', 'Patrick Daly'], 'Producers': ['Joel Fendelman', 'Patrick Daly', 'Julian Schwartz', 'Stephanie Levy', 'Maz Jobrani'], 'Starring': ['Maz Jobran', 'Muatasem Mishal']}\nReview Text: I loved it. Sad but true in so many ways\nReview Title: Awesome\nRating: 5.0\n--------------------------------------------------",
  "reference": "5 Broken Cameras\nEmad Burnat  (Actor, Director),     Guy Davidi  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Product Description', 'An extraordinary work of both cinematic and political activism, 5 Broken Cameras is a deeply personal, first-hand account of non-violent resistance in Bil\\'in, a West Bank village threatened by encroaching Israeli settlements. Shot almost entirely by Palestinian farmer Emad Burnat, who bought his first camera in 2005 to record the birth of his youngest son, the footage was later turned into a galvanizing cinematic experience by co-directors Guy Davidi and Burnat. Structured around the violent destruction of a succession of Burnat\\'s video cameras, the filmmakers\\' collaboration follows one family\\'s evolution over five years of village turmoil. Burnat watches from behind the lens as olive trees are bulldozed, protests intensify, and lives are lost. \"I feel like the camera protects me,\" he says, \"but it\\'s an illusion\".', 'Review', 'A rigorous and moving work of art. --A.O. Scott, The New York TimesUniquely powerful, putting faces and human consequences to a political dispute that will seemingly never end. --The Hollywood Reporter']\n{'Genre': 'Special Interests', 'Format': 'Subtitled, Anamorphic, Multiple Formats, Dolby, Color, Surround Sound, Dubbed, NTSC, Widescreen', 'Contributor': 'Guy Davidi, Emad Burnat', 'Language': 'Hebrew', 'Runtime': '1 hour and 30 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26172163', 'Director': 'Emad Burnat, Guy Davidi', 'Media Format': 'Subtitled, Anamorphic, Multiple Formats, Dolby, Color, Surround Sound, Dubbed, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Emad Burnat', 'Dubbed': 'Arabic', 'Subtitles': 'English', 'Studio': 'Kino Lorber films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI think the issue of the Israeli occupation was a bit one sided from the biased point of view of the Palastinians. I suppose it could have gone both ways.\nMy opinion\nA Yiddish World Remembered\nElliott Gould  (Actor),     Andrew Goldberg  (Director, Producer)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Elliott Gould narrates this Emmy Award winning documentary which revisits the beautiful Eastern European Jewish world before the horrifying aftermath of World War II. Using rare archival films, vintage photos, personal recollections, traditional cantorial and more, it becomes an emotional portrayal of Jewish traditions, religious treasures, the fascinating language of Yiddish and life as it was. 2002/color-b&w/100 min/NR/fullscreen.']\n{'Genre': 'Special Interests', 'Format': 'NTSC', 'Contributor': 'Andrew Goldberg, Elliott Gould', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Andrew Goldberg', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 20, 2010', 'Actors': 'Elliott Gould', 'Producers': 'Andrew Goldberg', 'Studio': 'Shanchie Records', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI enjoyed the film. It covers a lot of what I heard of the old country by my parents and grandparents\nlots of good footage\nThe World of Sholom Aleichem\nZero Mostel  (Actor),     Nancy Walker  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, TV\n[\"A compilation of three stories from Sholom Aleichem (known as the Yiddish Mark Twain) – “A Tale of Chelm,” about a bookseller who tries to buy a goat in a town of fools; “Bontche Schweig,” a tale of a poor man whose heavenly arrival coaxes tears from the angels; and “The High School,” about a couple's attempts to send their son to a non-religious school. Starring Zero Mostel, Nancy Walker and Sam Levene.\"]\n{'Genre': 'TV', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Jack Gilford, Nancy Walker, Zero Mostel, Sam Levene, Lee Grant', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Zero Mostel, Nancy Walker, Sam Levene, Jack Gilford, Lee Grant', 'Studio': 'Entertainment One', 'Number of discs': '1'}\nI learned so much from this film about the origins of yiddish theater of which I'm a big fan. It described his work to a great extent.\nI really was facinated\nSholem Aleichem: Laughing in the Darkness\nRachel Dratch  (Actor),     Hillel Halkin  (Actor),     Joseph Dorman  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Product Description', 'A riveting portrait of the great writer whose stories became the basis of the Broadway musical Fiddler on the Roof, SHOLEM ALEICHEM: LAUGHING IN THE DARKNESS tells the tale of the rebellious genius who created an entirely new literature. Plumbing the depths of a Jewish world locked in crisis and on the cusp of profound change, he captured that world with brilliant humor. Sholem Aleichem was not just a witness to the creation of a new modern Jewish identity, but one of the very men who forged it.', 'Special Features', 'Making the Film; On Sholem Aleichem', 'Making the Film; On Sholem Aleichem', 'Review', '100% Fresh --Rotten Tomatoes…a rich, beautifully organized and illustrated modern history. --New York Times Critics PickCompelling…A beautifully made documentary that sets the record straight in a thoughtful, incisive way. --Los Angeles Times', 'About the Actor', \"Rachel Dratch grew up in Lexington, Massachusetts. After graduating from Dartmouth College with a degree in Drama and Psychology, she moved out to Chicago, where she studied with Del Close at Improvolympic. She was on the house team, Victim's Family, with Adam McKay. Rachel went on to tour with the Second City Touring Company and eventually advanced to the Second City Mainstage, where she appeared in four revues: Pinata Full Of Bees, Citizen Gates, Paradigm Lost and Promisekeepers Losers Weepers. For the latter two, she received the Joseph Jefferson Award for Best Actress in a Revue. After leaving the mainstage, she wrote and performed in the 2-person sketch show, Dratch and Fey, with Tina Fey. The show was seen at Second City, Upright Citizens Brigade Theater in NYC, and the Aspen Comedy Festival. In the fall of 1999, Rachel joined the cast of Saturday Night Live (1975), where she performed for 7 years. Her memorable characters include Boston teen Denise, the Lovers professors with Will Ferrell, junior high school student Sheldon and Debbie Downer.\", 'Hillel Halkin (born 1939) is an American-born Israeli translator, biographer, literary critic, and novelist. He was born in New York two months before the outbreak of World War II. He is the son of Abraham S. Halkin, a professor of Jewish literature, history and culture at the Jewish Theological Seminary of America. In 1970 he made aliyah to Israel, settling in Zichron Yaakov. He studied English Literature at Columbia University. Halkin is married to Marcia and the father of two daughters.', \"Jason Kravits (born May 28, 1967) is an American actor. His film credits include The Stepford Wives and Sweet November. Kravits has served more often as a television guest star. He can be seen in episodes of shows such as Friends; Law & Order: Special Victims Unit; Everybody Loves Raymond;Yes, Dear; Gilmore Girls; Law & Order and Harry's Law. He also performed in the Broadway show The Drowsy Chaperone with his brother Garth Kravits and in Relatively Speaking. He got his start playing Lolo Knopke on the short-lived 1982 PBS series PowerhouseHe played the District Attorney Richard Bay in the Emmy Award-Winning drama Series The Practice from 1999 to 2001. After almost three years of being a nemesis to the firm who would stop at nothing to get a conviction, his character was gunned down by associates of a man he successfully prosecuted. In 2000, he was a regular panelist on the Oxygen Network revival of I've Got a Secret. In the early 1990s, he was a company member at Round House Theatre in Silver Spring, Maryland. He was also a counselor at Green Acres Camp in Rockville, Maryland, where he played guitar and performed skits for campers. In 1986, he founded the University of Maryland's first improv theater group Erasable Inc. He attended Colonel Zadok A. Magruder High School.\", 'About the Director', 'Joseph Dorman, born April 23rd, 1958, grew up in the Detroit suburb of Bloomfield Hills. Graduated from high school in 1976 from Cranbrook School, Bloomfield Hills, Michigan. Studied at Brown University, Providence, RI, from where he graduated in 1980. Taught briefly at a prep school in Westchester County, NY before focusing on film as a career. Lives in New York City.', 'See more']\n{'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Joseph Dorman', 'Media Format': 'Multiple Formats, Color, NTSC, Black & White', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 12, 2013', 'Actors': 'Rachel Dratch, Hillel Halkin, Jason Kravits', 'Studio': 'Docurama', 'Number of discs': '1'}\nI have gotten a new found admiration for the life and times of this man.He has gone through a hell on earth and maintained his connection to his life as a jew. He triuphed in his works.\nsuperb\nFrontline: Shtetl\n.  (Actor),     Marian Marzynski  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Independently Distributed, Documentary\n[\"The true story of Bransk, a small Polish shtetl that died overnight when all it's Jewish residents were transported to Treblinka's gas chambers. A haunting story with tragic consequences emerges through interviews, photographs and personal stories.\"]\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5458905', 'Director': 'Marian Marzynski', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours', 'Release date': 'March 17, 2009', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nThis film describes to a T the shtetl that my parents used to describe to us kids. I became more and more nostalgic as the film went on.\ngreat portrayal\nThe Golden Age of 2nd Avenue\nHerschel Bernardi  (Actor),     Paul Muni  (Actor),     Morton Silverstein  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n[\"The Yiddish Theater... What an age. What memories. This was the Broadway of the turn of the century, bringing joy, tears and laughter to struggling Jewish immigrants in New York's Lower East Side. It was the birth of Jewish American culture, and this vibrant and colorful world all started on Second Avenue.\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.25 Ounces', 'Director': 'Morton Silverstein', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour', 'Release date': '08M 18, 2009', 'Actors': 'Herschel Bernardi, Paul Muni, Molly Picon, Maurice Schwartz, Menasha Skulnik', 'Studio': 'Sisu Home Ent.', 'Number of discs': '1'}\nI really enjoyed this film. Very well done and Naarated by some of my favorite yiddish actors. It really brings to life the era where yiddish film was in it's hayday.\nA+++++++++\nThe Golem (Restored Authorized Edition)\nPaul Wegener  (Actor, Director, Writer),     Albert Steinrck  (Actor),     Carl Boese  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Classics, Silent Films\n['Product description', 'Golem', 'Amazon.com', 'A relic certainly, but a fascinating one,', 'Der Golem', \"is perhaps the screen's first great monster movie. Though it was actually the third time director-star Paul Wegener had played the eponymous creation, the earlier efforts (sadly lost) were rough drafts for this elaborate dramatization of the Jewish legend. When the Emperor decrees that the Jews of mediaeval Prague should be evicted from the ghetto, a mystical rabbi creates a clay giant and summons the demon Astaroth who breathes out in smoky letters the magic word that will animate the golem. Intended as a protector and avenger, the golem is twisted by the machinations of a lovelorn assistant and, like many a monster to come, runs riot, terrorizing guilty and innocent alike until a little girl innocently ends his rampage. Wegener's golem is an impressively solid figure, the Frankenstein monster with a slightly comical clay wig. The wonderfully grotesque Prague sets and the alchemical atmosphere remain potent.\", '--Kim Newman']\n{'Genre': 'Horror, Classics/Silent Films', 'Format': 'Multiple Formats, NTSC, Black & White, Silent', 'Contributor': 'Carl Ebert, Paul Wegener, Ernst Deutsch, Lyda Salmonova, Max Kronert, Henrik Galeen, Dore Paetzold, Loni Nest, Lothar Mthel, Otto Gebhr, Greta Schrder, Hans Strm, Albert Steinrck, Carl BoeseCarl Ebert, Paul Wegener, Ernst Deutsch, Lyda Salmonova, Max Kronert, Henrik Galeen, Dore Paetzold, Loni Nest, Lothar Mthel, Otto Gebhr, Greta Schrder, Hans Strm, Albert Steinrck, Carl Boese  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '2254731', 'Director': 'Carl Boese, Paul Wegener', 'Media Format': 'NTSC, Multiple Formats, Silent, Black & White', 'Run time': '1 hour and 31 minutes', 'Release date': 'September 24, 2002', 'Actors': 'Paul Wegener, Albert Steinrck, Ernst Deutsch, Lyda Salmonova, Hans Strm', 'Studio': 'Kino Lorber films', 'Writers': 'Henrik Galeen, Paul Wegener', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI can't say anything bad about this film, But I really cant say I enjoyed it. As far as silent films go, I guess it was OK\nEhhh.\nThe Jewish Americans\n.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Documentary\n['Product Description', 'This six-hour documentary follows 350 years of Jewish-American history, from the first settlement in the 17th century to the present, and explores the experience of immigration and assimilation. Liev Schreiber narrates.', 'Amazon.com', 'Originally broadcast on PBS,', 'The Jewish-Americans', 'covers 350 years in the lives of Jews who have struggled to maintain their religious identity and still be fully accepted as Americans. It is a story at once specific and universal, one that can be appreciated by any ethnic or religious minority who tests whether \"democracy, like America, can find room for everyone.\" Beginning with 23 Jewish exiles seeking safe haven in New Amsterdam in 1654, writer-director David Grubin does an admirable job of charting the often rocky and treacherous course for Jews in this country, and their personal \"tug of war between being American and being a Jew.\" Do they consider themselves Jewish-Americans, or American Jews? Carl Reiner, Mandy Patinkin, Sid Caesar, Jules Feiffer, playwright Tony Kushner, and Supreme Court Justice Ruth Bader Ginsburg are among the more recognizable personalities who offer illuminating commentary and bittersweet reminiscences. But Grubin presents what he calls \"an ensemble of voices\" rather than \"a star-studded parade.\" Authors, historians, sociologists, academics, and rabbis share a rich personal and cultural history.', 'Narrated by Liev Schreiber,', 'The Jewish-Americans', 'is comprised of three two-hour episodes, \"They Came to Stay,\" \"The Best of Times, the Worst of Times,\" and \"Home.\" Each is a richly textured tapestry of talking heads, still photos, archival footage, and audio and film clips (the inevitable', \"Gentleman's Agreement\", '), and reveal how Jews have become woven into the fabric of Jewish life. Songwriter Irving Berlin wrote \"God Bless America,\" and the holiday classics \"White Christmas\" and \"Easter Parade.\" Jerry Siegel and Joe Schuster created Superman. Another crossover pop culture success was Gertrude Berg as Molly Goldberg of the Bronx, offering sage advice and homespun wisdom on radio, television and the movies. One illuminating segment reveals how assimilated movie mogul Louis B. Mayer\\'s', 'Andy Hardy', 'films, with their \"fairy tale visions of small town life,\" were the \"American fantasies of a Jewish immigrant.\" Anti-Semitism rears its ugly head throughout the series. Grubin captures the hysteria surrounding the murder trial of Georgia factory worker Leo Franks, who, in 1915, was falsely convicted in the murder of 13-year-old Mary Phagan, and subsequently lynched by a homicidal mob. The segment that addresses the Holocaust documents America\\'s indifference in dealing with Hitler\\'s \"Final Solution.\" Grubin notes how political activism has long been a part of Jewish-American life, and how Jews took an active role in the Civil Rights struggle. As the old saying goes, you don\\'t have to be Jewish to be compelled and profoundly moved by this ambitious documentary miniseries. But it couldn\\'t hurt.', '--Donald Liebenson']\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '1', 'Runtime': '6 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.55 x 5.36 x 7.47 inches; 4 Ounces', 'Item model number': '705225', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '6 hours', 'Release date': 'February 5, 2008', 'Studio': 'PBS', 'Number of discs': '1'}\nI enjoyed this film\nFour Stars\nA Yiddish World Remembered\nAndrew Goldberg  (Director, Producer)    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['In A Yiddish World Remembered, the story of Jewish life in Eastern Europe is brought to life again by some of the remaining eyewitnesses. Narrated by Academy Award nominated actor Elliott Gould and accompanied by never-before-seen archival films, vintage photographs, and, of course, traditional Klezmer and cantorial music, the documentary takes a realistic and enlightening look at this unique and all-but-vanished way of life. For those in rural communities, there was often no running water or electricity. For many, anti-Semitism was a part of daily life. But for everyone, crowded conditions and poverty seemed to prevail. Despite these trials, through the eyes of the individuals interviewed, we learn that Jewish communities were close-knit and often even joyous places to live. This television special explores everything from the fascinating language of Yiddish to the Rabbis and Rebbes that often ran the communities to the powerful Jewish movements of Khasidism, Bundism and Zionism. Aired nationally on PBS. This DVD contains over 20 minutes of bonus footage and interviews not seen in the broadcast.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Item model number': 'TCP101DVD', 'Director': 'Andrew Goldberg', 'Media Format': 'NTSC, Full Screen', 'Run time': '1 hour and 20 minutes', 'Producers': 'Andrew Goldberg', 'Studio': 'Two Cats Productions'}\nA quality work by the producers that captures the essence of jewish life in prewar europe.\nFour Stars\nThe Green Prince\nMosab Hassan Yousef  (Actor),     Gonen Ben Yitzhak  (Actor),     Nadav Schirman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"PRINCE retraces the details of a highly sworn enemies. In the style of a tense psychological thriller, this extraordinary a Hamas leader who emerged as one of Israel's risked his career to protect him.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MBOX89DVD', 'Director': 'Nadav Schirman', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'January 20, 2015', 'Actors': 'Mosab Hassan Yousef, Gonen Ben Yitzhak', 'Subtitles': 'English', 'Studio': 'Music Box Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat film\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Netalie Braun Avigail Sperber'], 'Producers': ['Avigail Sperber', 'Netalie Braun'], 'Studio': ['Syndicado']}\ni liked it\nThree Stars\n{'Subtitles': ['None available'], 'Directors': ['TravelVideoStore.com'], 'Producers': ['TravelVideoStore.com'], 'Studio': ['TravelVideoStore.com']}\nI liked it\nThree Stars\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', 'Nederlands', 'Português'], 'Directors': ['Quentin Tarantino'], 'Producers': ['Lawrence Bender'], 'Starring': ['Harvey Keitel', 'Tim Roth', 'Michael Madsen'], 'Studio': ['MIRAMAX']}\nunbelievable good film\nFive Stars\n{'Content advisory': ['Alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Leonid Prudovsky'], 'Producers': ['Yochanan Weller', 'Freddy Zyskrot'], 'Starring': ['Esteban Gottfried', 'Tal Lifshitz', 'Fira Kantor'], 'Studio': ['Syndicado']}\nkept me interested\nA+\n{'Subtitles': ['None available'], 'Directors': ['Joel Fendelman', 'Patrick Daly'], 'Producers': ['Joel Fendelman', 'Patrick Daly', 'Julian Schwartz', 'Stephanie Levy', 'Maz Jobrani'], 'Starring': ['Maz Jobran', 'Muatasem Mishal']}\nI loved it. Sad but true in so many ways\nAwesome",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: 5 Broken Cameras\nReview Date: 2013/10/16\nStore: Emad Burnat  (Actor, Director),     Guy Davidi  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['Product Description', 'An extraordinary work of both cinematic and political activism, 5 Broken Cameras is a deeply personal, first-hand account of non-violent resistance in Bil\\'in, a West Bank village threatened by encroaching Israeli settlements. Shot almost entirely by Palestinian farmer Emad Burnat, who bought his first camera in 2005 to record the birth of his youngest son, the footage was later turned into a galvanizing cinematic experience by co-directors Guy Davidi and Burnat. Structured around the violent destruction of a succession of Burnat\\'s video cameras, the filmmakers\\' collaboration follows one family\\'s evolution over five years of village turmoil. Burnat watches from behind the lens as olive trees are bulldozed, protests intensify, and lives are lost. \"I feel like the camera protects me,\" he says, \"but it\\'s an illusion\".', 'Review', 'A rigorous and moving work of art. --A.O. Scott, The New York TimesUniquely powerful, putting faces and human consequences to a political dispute that will seemingly never end. --The Hollywood Reporter']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Subtitled, Anamorphic, Multiple Formats, Dolby, Color, Surround Sound, Dubbed, NTSC, Widescreen', 'Contributor': 'Guy Davidi, Emad Burnat', 'Language': 'Hebrew', 'Runtime': '1 hour and 30 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26172163', 'Director': 'Emad Burnat, Guy Davidi', 'Media Format': 'Subtitled, Anamorphic, Multiple Formats, Dolby, Color, Surround Sound, Dubbed, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Emad Burnat', 'Dubbed': 'Arabic', 'Subtitles': 'English', 'Studio': 'Kino Lorber films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I think the issue of the Israeli occupation was a bit one sided from the biased point of view of the Palastinians. I suppose it could have gone both ways.\nReview Title: My opinion\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Yiddish World Remembered\nReview Date: 2013/10/16\nStore: Elliott Gould  (Actor),     Andrew Goldberg  (Director, Producer)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Elliott Gould narrates this Emmy Award winning documentary which revisits the beautiful Eastern European Jewish world before the horrifying aftermath of World War II. Using rare archival films, vintage photos, personal recollections, traditional cantorial and more, it becomes an emotional portrayal of Jewish traditions, religious treasures, the fascinating language of Yiddish and life as it was. 2002/color-b&w/100 min/NR/fullscreen.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'NTSC', 'Contributor': 'Andrew Goldberg, Elliott Gould', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Andrew Goldberg', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 20, 2010', 'Actors': 'Elliott Gould', 'Producers': 'Andrew Goldberg', 'Studio': 'Shanchie Records', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I enjoyed the film. It covers a lot of what I heard of the old country by my parents and grandparents\nReview Title: lots of good footage\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The World of Sholom Aleichem\nReview Date: 2013/10/16\nStore: Zero Mostel  (Actor),     Nancy Walker  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: [\"A compilation of three stories from Sholom Aleichem (known as the Yiddish Mark Twain) – “A Tale of Chelm,” about a bookseller who tries to buy a goat in a town of fools; “Bontche Schweig,” a tale of a poor man whose heavenly arrival coaxes tears from the angels; and “The High School,” about a couple's attempts to send their son to a non-religious school. Starring Zero Mostel, Nancy Walker and Sam Levene.\"]\nAverage Rating: 4.3\nProduct Details: {'Genre': 'TV', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Jack Gilford, Nancy Walker, Zero Mostel, Sam Levene, Lee Grant', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Zero Mostel, Nancy Walker, Sam Levene, Jack Gilford, Lee Grant', 'Studio': 'Entertainment One', 'Number of discs': '1'}\nReview Text: I learned so much from this film about the origins of yiddish theater of which I'm a big fan. It described his work to a great extent.\nReview Title: I really was facinated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sholem Aleichem: Laughing in the Darkness\nReview Date: 2013/10/16\nStore: Rachel Dratch  (Actor),     Hillel Halkin  (Actor),     Joseph Dorman  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'A riveting portrait of the great writer whose stories became the basis of the Broadway musical Fiddler on the Roof, SHOLEM ALEICHEM: LAUGHING IN THE DARKNESS tells the tale of the rebellious genius who created an entirely new literature. Plumbing the depths of a Jewish world locked in crisis and on the cusp of profound change, he captured that world with brilliant humor. Sholem Aleichem was not just a witness to the creation of a new modern Jewish identity, but one of the very men who forged it.', 'Special Features', 'Making the Film; On Sholem Aleichem', 'Making the Film; On Sholem Aleichem', 'Review', '100% Fresh --Rotten Tomatoes…a rich, beautifully organized and illustrated modern history. --New York Times Critics PickCompelling…A beautifully made documentary that sets the record straight in a thoughtful, incisive way. --Los Angeles Times', 'About the Actor', \"Rachel Dratch grew up in Lexington, Massachusetts. After graduating from Dartmouth College with a degree in Drama and Psychology, she moved out to Chicago, where she studied with Del Close at Improvolympic. She was on the house team, Victim's Family, with Adam McKay. Rachel went on to tour with the Second City Touring Company and eventually advanced to the Second City Mainstage, where she appeared in four revues: Pinata Full Of Bees, Citizen Gates, Paradigm Lost and Promisekeepers Losers Weepers. For the latter two, she received the Joseph Jefferson Award for Best Actress in a Revue. After leaving the mainstage, she wrote and performed in the 2-person sketch show, Dratch and Fey, with Tina Fey. The show was seen at Second City, Upright Citizens Brigade Theater in NYC, and the Aspen Comedy Festival. In the fall of 1999, Rachel joined the cast of Saturday Night Live (1975), where she performed for 7 years. Her memorable characters include Boston teen Denise, the Lovers professors with Will Ferrell, junior high school student Sheldon and Debbie Downer.\", 'Hillel Halkin (born 1939) is an American-born Israeli translator, biographer, literary critic, and novelist. He was born in New York two months before the outbreak of World War II. He is the son of Abraham S. Halkin, a professor of Jewish literature, history and culture at the Jewish Theological Seminary of America. In 1970 he made aliyah to Israel, settling in Zichron Yaakov. He studied English Literature at Columbia University. Halkin is married to Marcia and the father of two daughters.', \"Jason Kravits (born May 28, 1967) is an American actor. His film credits include The Stepford Wives and Sweet November. Kravits has served more often as a television guest star. He can be seen in episodes of shows such as Friends; Law & Order: Special Victims Unit; Everybody Loves Raymond;Yes, Dear; Gilmore Girls; Law & Order and Harry's Law. He also performed in the Broadway show The Drowsy Chaperone with his brother Garth Kravits and in Relatively Speaking. He got his start playing Lolo Knopke on the short-lived 1982 PBS series PowerhouseHe played the District Attorney Richard Bay in the Emmy Award-Winning drama Series The Practice from 1999 to 2001. After almost three years of being a nemesis to the firm who would stop at nothing to get a conviction, his character was gunned down by associates of a man he successfully prosecuted. In 2000, he was a regular panelist on the Oxygen Network revival of I've Got a Secret. In the early 1990s, he was a company member at Round House Theatre in Silver Spring, Maryland. He was also a counselor at Green Acres Camp in Rockville, Maryland, where he played guitar and performed skits for campers. In 1986, he founded the University of Maryland's first improv theater group Erasable Inc. He attended Colonel Zadok A. Magruder High School.\", 'About the Director', 'Joseph Dorman, born April 23rd, 1958, grew up in the Detroit suburb of Bloomfield Hills. Graduated from high school in 1976 from Cranbrook School, Bloomfield Hills, Michigan. Studied at Brown University, Providence, RI, from where he graduated in 1980. Taught briefly at a prep school in Westchester County, NY before focusing on film as a career. Lives in New York City.', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Joseph Dorman', 'Media Format': 'Multiple Formats, Color, NTSC, Black & White', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 12, 2013', 'Actors': 'Rachel Dratch, Hillel Halkin, Jason Kravits', 'Studio': 'Docurama', 'Number of discs': '1'}\nReview Text: I have gotten a new found admiration for the life and times of this man.He has gone through a hell on earth and maintained his connection to his life as a jew. He triuphed in his works.\nReview Title: superb\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Frontline: Shtetl\nReview Date: 2013/10/16\nStore: .  (Actor),     Marian Marzynski  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Independently Distributed, Documentary\nProduct Description: [\"The true story of Bransk, a small Polish shtetl that died overnight when all it's Jewish residents were transported to Treblinka's gas chambers. A haunting story with tragic consequences emerges through interviews, photographs and personal stories.\"]\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.33:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5458905', 'Director': 'Marian Marzynski', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours', 'Release date': 'March 17, 2009', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: This film describes to a T the shtetl that my parents used to describe to us kids. I became more and more nostalgic as the film went on.\nReview Title: great portrayal\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Golden Age of 2nd Avenue\nReview Date: 2013/10/28\nStore: Herschel Bernardi  (Actor),     Paul Muni  (Actor),     Morton Silverstein  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: [\"The Yiddish Theater... What an age. What memories. This was the Broadway of the turn of the century, bringing joy, tears and laughter to struggling Jewish immigrants in New York's Lower East Side. It was the birth of Jewish American culture, and this vibrant and colorful world all started on Second Avenue.\"]\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.25 Ounces', 'Director': 'Morton Silverstein', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour', 'Release date': '08M 18, 2009', 'Actors': 'Herschel Bernardi, Paul Muni, Molly Picon, Maurice Schwartz, Menasha Skulnik', 'Studio': 'Sisu Home Ent.', 'Number of discs': '1'}\nReview Text: I really enjoyed this film. Very well done and Naarated by some of my favorite yiddish actors. It really brings to life the era where yiddish film was in it's hayday.\nReview Title: A+++++++++\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Golem (Restored Authorized Edition)\nReview Date: 2013/10/28\nStore: Paul Wegener  (Actor, Director, Writer),     Albert Steinrck  (Actor),     Carl Boese  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Classics, Silent Films\nProduct Description: ['Product description', 'Golem', 'Amazon.com', 'A relic certainly, but a fascinating one,', 'Der Golem', \"is perhaps the screen's first great monster movie. Though it was actually the third time director-star Paul Wegener had played the eponymous creation, the earlier efforts (sadly lost) were rough drafts for this elaborate dramatization of the Jewish legend. When the Emperor decrees that the Jews of mediaeval Prague should be evicted from the ghetto, a mystical rabbi creates a clay giant and summons the demon Astaroth who breathes out in smoky letters the magic word that will animate the golem. Intended as a protector and avenger, the golem is twisted by the machinations of a lovelorn assistant and, like many a monster to come, runs riot, terrorizing guilty and innocent alike until a little girl innocently ends his rampage. Wegener's golem is an impressively solid figure, the Frankenstein monster with a slightly comical clay wig. The wonderfully grotesque Prague sets and the alchemical atmosphere remain potent.\", '--Kim Newman']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror, Classics/Silent Films', 'Format': 'Multiple Formats, NTSC, Black & White, Silent', 'Contributor': 'Carl Ebert, Paul Wegener, Ernst Deutsch, Lyda Salmonova, Max Kronert, Henrik Galeen, Dore Paetzold, Loni Nest, Lothar Mthel, Otto Gebhr, Greta Schrder, Hans Strm, Albert Steinrck, Carl BoeseCarl Ebert, Paul Wegener, Ernst Deutsch, Lyda Salmonova, Max Kronert, Henrik Galeen, Dore Paetzold, Loni Nest, Lothar Mthel, Otto Gebhr, Greta Schrder, Hans Strm, Albert Steinrck, Carl Boese  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '2254731', 'Director': 'Carl Boese, Paul Wegener', 'Media Format': 'NTSC, Multiple Formats, Silent, Black & White', 'Run time': '1 hour and 31 minutes', 'Release date': 'September 24, 2002', 'Actors': 'Paul Wegener, Albert Steinrck, Ernst Deutsch, Lyda Salmonova, Hans Strm', 'Studio': 'Kino Lorber films', 'Writers': 'Henrik Galeen, Paul Wegener', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I can't say anything bad about this film, But I really cant say I enjoyed it. As far as silent films go, I guess it was OK\nReview Title: Ehhh.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Jewish Americans\nReview Date: 2014/06/23\nStore: .  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Independently Distributed, Documentary\nProduct Description: ['Product Description', 'This six-hour documentary follows 350 years of Jewish-American history, from the first settlement in the 17th century to the present, and explores the experience of immigration and assimilation. Liev Schreiber narrates.', 'Amazon.com', 'Originally broadcast on PBS,', 'The Jewish-Americans', 'covers 350 years in the lives of Jews who have struggled to maintain their religious identity and still be fully accepted as Americans. It is a story at once specific and universal, one that can be appreciated by any ethnic or religious minority who tests whether \"democracy, like America, can find room for everyone.\" Beginning with 23 Jewish exiles seeking safe haven in New Amsterdam in 1654, writer-director David Grubin does an admirable job of charting the often rocky and treacherous course for Jews in this country, and their personal \"tug of war between being American and being a Jew.\" Do they consider themselves Jewish-Americans, or American Jews? Carl Reiner, Mandy Patinkin, Sid Caesar, Jules Feiffer, playwright Tony Kushner, and Supreme Court Justice Ruth Bader Ginsburg are among the more recognizable personalities who offer illuminating commentary and bittersweet reminiscences. But Grubin presents what he calls \"an ensemble of voices\" rather than \"a star-studded parade.\" Authors, historians, sociologists, academics, and rabbis share a rich personal and cultural history.', 'Narrated by Liev Schreiber,', 'The Jewish-Americans', 'is comprised of three two-hour episodes, \"They Came to Stay,\" \"The Best of Times, the Worst of Times,\" and \"Home.\" Each is a richly textured tapestry of talking heads, still photos, archival footage, and audio and film clips (the inevitable', \"Gentleman's Agreement\", '), and reveal how Jews have become woven into the fabric of Jewish life. Songwriter Irving Berlin wrote \"God Bless America,\" and the holiday classics \"White Christmas\" and \"Easter Parade.\" Jerry Siegel and Joe Schuster created Superman. Another crossover pop culture success was Gertrude Berg as Molly Goldberg of the Bronx, offering sage advice and homespun wisdom on radio, television and the movies. One illuminating segment reveals how assimilated movie mogul Louis B. Mayer\\'s', 'Andy Hardy', 'films, with their \"fairy tale visions of small town life,\" were the \"American fantasies of a Jewish immigrant.\" Anti-Semitism rears its ugly head throughout the series. Grubin captures the hysteria surrounding the murder trial of Georgia factory worker Leo Franks, who, in 1915, was falsely convicted in the murder of 13-year-old Mary Phagan, and subsequently lynched by a homicidal mob. The segment that addresses the Holocaust documents America\\'s indifference in dealing with Hitler\\'s \"Final Solution.\" Grubin notes how political activism has long been a part of Jewish-American life, and how Jews took an active role in the Civil Rights struggle. As the old saying goes, you don\\'t have to be Jewish to be compelled and profoundly moved by this ambitious documentary miniseries. But it couldn\\'t hurt.', '--Donald Liebenson']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '1', 'Runtime': '6 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.55 x 5.36 x 7.47 inches; 4 Ounces', 'Item model number': '705225', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '6 hours', 'Release date': 'February 5, 2008', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I enjoyed this film\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Yiddish World Remembered\nReview Date: 2014/06/23\nStore: Andrew Goldberg  (Director, Producer)    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['In A Yiddish World Remembered, the story of Jewish life in Eastern Europe is brought to life again by some of the remaining eyewitnesses. Narrated by Academy Award nominated actor Elliott Gould and accompanied by never-before-seen archival films, vintage photographs, and, of course, traditional Klezmer and cantorial music, the documentary takes a realistic and enlightening look at this unique and all-but-vanished way of life. For those in rural communities, there was often no running water or electricity. For many, anti-Semitism was a part of daily life. But for everyone, crowded conditions and poverty seemed to prevail. Despite these trials, through the eyes of the individuals interviewed, we learn that Jewish communities were close-knit and often even joyous places to live. This television special explores everything from the fascinating language of Yiddish to the Rabbis and Rebbes that often ran the communities to the powerful Jewish movements of Khasidism, Bundism and Zionism. Aired nationally on PBS. This DVD contains over 20 minutes of bonus footage and interviews not seen in the broadcast.']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Item model number': 'TCP101DVD', 'Director': 'Andrew Goldberg', 'Media Format': 'NTSC, Full Screen', 'Run time': '1 hour and 20 minutes', 'Producers': 'Andrew Goldberg', 'Studio': 'Two Cats Productions'}\nReview Text: A quality work by the producers that captures the essence of jewish life in prewar europe.\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Green Prince\nReview Date: 2015/02/08\nStore: Mosab Hassan Yousef  (Actor),     Gonen Ben Yitzhak  (Actor),     Nadav Schirman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"PRINCE retraces the details of a highly sworn enemies. In the style of a tense psychological thriller, this extraordinary a Hamas leader who emerged as one of Israel's risked his career to protect him.\"]\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MBOX89DVD', 'Director': 'Nadav Schirman', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'January 20, 2015', 'Actors': 'Mosab Hassan Yousef, Gonen Ben Yitzhak', 'Subtitles': 'English', 'Studio': 'Music Box Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great film\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/03\nAverage Rating: 2.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Netalie Braun Avigail Sperber'], 'Producers': ['Avigail Sperber', 'Netalie Braun'], 'Studio': ['Syndicado']}\nReview Text: i liked it\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/03\nAverage Rating: 3.1\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['TravelVideoStore.com'], 'Producers': ['TravelVideoStore.com'], 'Studio': ['TravelVideoStore.com']}\nReview Text: I liked it\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/19\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', 'Nederlands', 'Português'], 'Directors': ['Quentin Tarantino'], 'Producers': ['Lawrence Bender'], 'Starring': ['Harvey Keitel', 'Tim Roth', 'Michael Madsen'], 'Studio': ['MIRAMAX']}\nReview Text: unbelievable good film\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/09/04\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Leonid Prudovsky'], 'Producers': ['Yochanan Weller', 'Freddy Zyskrot'], 'Starring': ['Esteban Gottfried', 'Tal Lifshitz', 'Fira Kantor'], 'Studio': ['Syndicado']}\nReview Text: kept me interested\nReview Title: A+\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/19\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Joel Fendelman', 'Patrick Daly'], 'Producers': ['Joel Fendelman', 'Patrick Daly', 'Julian Schwartz', 'Stephanie Levy', 'Maz Jobrani'], 'Starring': ['Maz Jobran', 'Muatasem Mishal']}\nReview Text: I loved it. Sad but true in so many ways\nReview Title: Awesome\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual displays a strong preference for documentary films that explore Jewish history, culture, and identity, often reflecting personal narratives and communal memories. Their ratings consistently range from 4.0 to 5.0, suggesting a favorable sentiment towards films that resonate emotionally and culturally. The recurring themes in their purchases reveal an interest in works that tackle complex social issues, Jewish customs, and the impact of historical events on individual lives.\n\nThe person's reviews reflect a quality preference for well-crafted narratives, emphasizing historical accuracy and emotional depth. They are particularly drawn to films that utilize archival footage, personal testimonies, and artistic storytelling to enhance the viewing experience. Price sensitivity appears moderate; they engage with a variety of DVDs without a clear bias towards cheaper products, indicating value is placed more on content quality than cost alone.\n\nOverall, this customer's core preferences center around insightful documentaries, rich cultural explorations, and stories that foster nostalgia, all while appreciating craftsmanship in filmmaking. They value the intersection of personal stories with broader societal issues, leading to thoughtful engagement with the films they choose to watch.",
  "target_interaction": {
    "rating": 3.0,
    "title": "OK",
    "text": "was ok",
    "images": [],
    "asin": "B004UOGRDQ",
    "parent_asin": "B004UOGRDQ",
    "user_id": "AFC4S6B4MGXYSZDLRAGWVB3VZLCQ",
    "timestamp": "2016-12-03 15:53:18",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 3.6,
    "rating_number": 86,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f15884230b395256461fab4430f857b1153c1bcdd9de6c5aba4ef7f6d106718f._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f15884230b395256461fab4430f857b1153c1bcdd9de6c5aba4ef7f6d106718f._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f15884230b395256461fab4430f857b1153c1bcdd9de6c5aba4ef7f6d106718f._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f15884230b395256461fab4430f857b1153c1bcdd9de6c5aba4ef7f6d106718f._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f15884230b395256461fab4430f857b1153c1bcdd9de6c5aba4ef7f6d106718f._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f15884230b395256461fab4430f857b1153c1bcdd9de6c5aba4ef7f6d106718f._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Subtitles": [
        "None available"
      ],
      "Directors": [
        "Michael Thornhill"
      ],
      "Producers": [
        "Michael Thornhill",
        "Sue Carleton",
        "Antony I. Ginnane"
      ],
      "Starring": [
        "Arthur Dignam",
        "Mark Lee",
        "Paul Goddard"
      ],
      "Studio": [
        "Ariztical Entertainment"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}