{
  "user_id": "AGEWBBUZEXZJVYISJRSDQZIA7PIQ",
  "summary": "=== Purchase Information ===\nProduct Title: Resident Evil: Vendetta\nReview Date: 2017/10/07\nStore: Takanori Tsujimoto  (Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['When a fearless enemy out for revenge unleashes a brutal and deadly new virus, BSAA captain Chris Redfield enlists the help of Agent Leon S. Kennedy and Professor Rebecca Chambers to bring down the death merchant and save New York City.']\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Sony', 'Format': 'AC-3, Dolby, Subtitled', 'Genre': 'Action, Sci-Fi, Anime, Horror, Thriller', 'Publication Date': 'July 18, 2017', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'D50162D', 'Director': 'Takanori Tsujimoto', 'Media Format': 'AC-3, Dolby, Subtitled', 'Run time': '1 hour and 37 minutes', 'Release date': 'July 18, 2017', 'Dubbed': 'Thai, Portuguese, French, Spanish', 'Subtitles': 'Thai, English, Korean, Mandarin Chinese, Portuguese, French, Spanish', 'Producers': 'Hiroyasu Shinohara', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: good resident evil story\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Underworld: Blood Wars\nReview Date: 2017/10/07\nStore: Kate Beckinsale  (Actor),     Theo James  (Actor),     Anna Foerster  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['In the next installment of the blockbuster franchise, Vampire death dealer Selene (Kate Beckinsale) fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David (Theo James) and his father Thomas (Charles Dance), she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action, Sci-Fi, Horror', 'Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Contributor': 'Oliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter AnderssonOliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter Andersson  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Anna Foerster', 'Media Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'April 25, 2017', 'Actors': 'Kate Beckinsale, Theo James, Lara Pulver, Tobias Menzies, Bradley James', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'David Kern, Richard Wright, Gary Lucchesi, Tom Rosenberg, Len Wiseman', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: kate is awesome\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Thousand Faces of Dunjia [Blu-ray]\nReview Date: 2021/11/21\nStore: Ni Ni  (Actor),     Dongyu Zhou  (Actor),     Yuen Woo-ping  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', 'Centuries ago, the ragtag warrior-sorcerors of the Wuyin clan were entrusted to safeguard China from threats beyond our plane of existence. But can even their skills keep a world-destroying device from the clutches of the alien invaders determined to claim it? Splashy big-budget Wuxia fantasy-actioner, directed by Woo-ping Yuen and scripted by Tsui Hark, stars Da Peng, Ni Ni, Wu Bai, Dongyu Zhou, and Arif Rahman Lee. 113 min. Widescreen; Soundtrack: Mandarin; Subtitles: English; featurette; theatrical trailer. In Mandarin with English subtitles.', 'Review', 'Dunjia is exuberant and visually inventive\" --Washington PostDelightful twists and turns and high energy performances --Film Combat SyndicateDunjia is a blast --Film Journal International']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'Chengpeng Dong, Yuen Woo-ping, Dongyu Zhou, Ni Ni', 'Language': 'Mandarin Chinese (DTS 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Yuen Woo-ping', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 27, 2018', 'Actors': 'Ni Ni, Dongyu Zhou, Chengpeng Dong', 'Subtitles': 'English', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: interesting story and characters. looking forward to part 2\nReview Title: interesting story and characters. looking forward to part 2\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Witch: Subversion\nReview Date: 2021/11/21\nStore: Choi Woo-shik  (Actor),     Kim Da-mi  (Actor),     Park Hoon-jung  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', '10 years ago, Ja-yoon escaped from a secret government facility in the midst of an inexplicable incident. An old couple finds her alone near death in the woods and takes her in even though she has no memory of who she is or how she got there. She grows up to be a bright high school student and enters a nationally televised audition program to win the top prize and help her struggling family. But as soon as she appears on TV, strange people start appearing in her life and Ja-yoon falls into turmoil as her seemingly ordinary life turns upside down in a blink of an eye Featuring an award-winning performance by Kim Da-mi and co-starring Choi Woo-shik (PARASITE, TRAIN TO BUSAN).', 'Review', 'the action sensation of the year that could rival any superhero movie --Starburst Magazinea kick-ass sci-fi action flick, with a satisfying gore factor to boot. --NerdlyAn ever-so-delicate twist on the Korean revenge thriller. --The Hollywood Reporter', 'About the Actor', 'Choi Woo-shik is known for Parasite (2019), Okja (2017), Set Me Free (2014), and Train to Busan (2016).', 'About the Director', 'Park Hoon-jung is known for New World (2013), The Tiger (2015), V.I.P. (2017), and I Saw the Devil (2010).', 'See more']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Director': 'Park Hoon-jung', 'Media Format': 'Dolby, Subtitled, Widescreen, Surround Sound', 'Run time': '2 hours and 7 minutes', 'Release date': 'March 10, 2020', 'Actors': 'Choi Woo-shik, Kim Da-mi, Cho Min-soo, Park Hee-soon', 'Subtitles': 'English', 'Language': 'Korean (DTS 5.1)', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: the title can throw you off. would like to see the story continue with a sequel with same cast.\nReview Title: likeable story and great characters on display.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heavy Metal [Blu-ray]\nReview Date: 2021/11/21\nStore: Gerald Potterton  (Director)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Based on the fantastical illustrated magazine', 'Heavy Metal', \", producer Ivan Reitman enlists the help of some of Hollywood's animation masters to create the otherworldly tale of a glowing green orb from outer space that spreads destruction throughout the galaxy. Only when encountered by its one true enemy, to whom it is inexplicably drawn, will goodness prevail throughout the universe. Richly and lavishly drawn, the vignettes of the orb's dark victories include the character voices of John Candy, Harold Ramis and a pounding soundtrack by Black Sabbath, Blue Oyster Cult, Cheap Trick, Devo, Donald Fagen, Don Felder, Grand Funk Railroad, Sammy Hagar, Journey, Nazareth, Stevie Nicks, Riggs, and Trust. Highly imaginative and full of surprising special effects,\", 'Heavy Metal', 'set the standard for the alternative contemporary animation. An intoxicating experience not to be missed!', 'Amazon.com', 'As long as there is a need for adolescent male sexual fantasy, there will be an audience for', 'Heavy Metal', \". Released in 1981 and based on stories from the graphic magazine of the same name (possibly the greatest publication to simultaneously provoke imagination and masturbation), the film has since become the most popular single title in Columbia/TriStar's entire film library. That's an amazing fact considering just how silly and senseless the movie really is--an aimless, juvenile amalgam of disjointed stories and clashing visual styles, employing hundreds of animators from around the world with a near-total absence of creative cohesion. It remains, for better and worse, a midnight-movie favorite for the stoner crowd--a movie best enjoyed by randy adolescents or near-adults in an altered state of consciousness. With a framing story about a glowing green orb claiming to be the embodiment of all evil, the film shuttles through eight episodic tales of sci-fi adventure, each fueled by some of the most wretched rock music to emerge from the 1980s. The most consistent trademark is an abundance of blood-splattering violence and wet-dream sex, the latter involving a succession of huge-breasted babes who shed their clothes at the drop of a G-string. It's all quite fun in its rampantly brainless desire to fuel the young male libido, and for all its incoherence\", 'Heavy Metal', \"remains impressive for the ambitious artistry of its individual segments. Courtesy of producer Ivan Reitman (who'd just scored a hit with Stripes), voice talents include several Canadian veterans of Second City comedy, including John Candy, Harold Ramis, Eugene Levy, and Joe Flaherty.\", '--Jeff Shannon']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Sci-Fi, Fantasy, Musical', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Columbia Pictures; Heavy Metal Animation Co., Ivan Reitman, Gerald Potterton', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '17211076', 'Director': 'Gerald Potterton', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 14, 2011', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great music. solid story. graphics look dated\nReview Title: great music. solid story. graphics look dated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Black Widow\nReview Date: 2021/11/21\nStore: Scarlett Johansson  (Actor),     Florence Pugh  (Actor),     Cate Shortland  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['In Marvel Studios\\' action-packed spy thriller \"Black Widow,\" Natasha Romanoff aka Black Widow confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Subtitled, NTSC', 'Contributor': 'Olga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh, Eric Pearson, CC SmiffOlga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh…  See more', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.39:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.73 x 5.31 x 0.47 inches; 0.01 Ounces', 'Director': 'Cate Shortland', 'Media Format': 'Subtitled, NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'September 14, 2021', 'Actors': 'Scarlett Johansson, Florence Pugh, David Harbour, O-T Fagbenle, Olga Kurylenko', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MARVEL', 'Writers': 'Eric Pearson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great marvel movie. should have be made way earlier. black widow can carry a movie on her own.\nReview Title: great marvel movie. should have be made way earlier. black widow can carry a movie on her own.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Snake Eyes: G.I. Joe Origins\nReview Date: 2021/12/19\nStore: Samara Weaving  (Actor),     Henry Golding  (Actor)    Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['The origins of the Joes\\' unseen, unspeaking, and undeniably most popular member have been shrouded in mystery-until now. Proved worthy of recruitment into the Arashikage ninja clan, the man called Snake Eyes (Henry Golding) swiftly forges a bond with heir apparent Tommy \"Storm Shadow\" Arashikage (Andrew Koji)... but will the truth of his past convert it to lifelong enmity? Samara Weaving, Úrsula Corberó, Iko Uwais, Peter Mensah co-star. AKA: \"Snake Eyes: G.I. Joe Origins.\" 121 min. Widescreen; Soundtrack: English.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Iko Uwais, Samara Weaving, Henry Golding, rsula Corber, Andrew Koji', 'Language': 'English', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.93 x 5.43 x 0.51 inches; 2.88 ounces', 'Media Format': 'Blu-ray', 'Release date': 'February 1, 2022', 'Actors': 'Samara Weaving, Henry Golding, Iko Uwais, Andrew Koji, rsula Corber', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nReview Text: interesting origin story. not sure if it follows character canon.\nReview Title: interesting origin story. not sure if it follows character canon.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blade / Blade 2 / Blade: Trinity (BD)(3FE) [Blu-ray]\nReview Date: 2022/05/29\nStore: Various  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Blade / Blade 2 / Blade: Trinity (BD)(3FE)', 'BLADE - Wesley Snipes stars as the tortured soul Blade, who is half man, half immortal. Blade sharpens his lethal skills under the FBI, he is forced into the daylight, where he joins forces with a clan of human vampire hunters, the Nightstalkers. Together with two deftly trained Nightstalkers, Blade follows a trail of blood to the original vampire: Dracula. guidance of Whistler – his mentor, guardian and fellow hunter of the night. When the bloodthirsty Immortals’ lord, Deacon Frost, declares war on the human race, Blade is humanity’s last hope for survival. BLADE II - Guillermo del Toro directs this high-voltage adventure from screenwriter David S. Goyer. When the world is threatened by a new and deadlier breed of super vampire, Blade and Whistler join forces with an elite team of vampire warriors made up of Blade’s sworn enemies to stop the carnage and destroy the ravenous fiends. BLADE: TRINITY - For years, Blade has fought the vampires under the cover of night. But after falling into the crosshairs of the', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'NTSC, Widescreen, Blu-ray', 'Contributor': 'Various', 'Initial release date': '2015-03-10', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.53 Ounces', 'Item model number': '1000479690', 'Director': 'Various', 'Media Format': 'NTSC, Widescreen, Blu-ray', 'Release date': 'March 10, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: great action from movie 1 through 3. enjoy.\nReview Title: one of the best early adoptions of a marvel comic character. great work by Wesley Snipes\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Shannara Chronicles: Season Two\nReview Date: 2022/05/30\nStore: Manu Bennett  (Actor),     Poppy Drayton  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['Based on author Terry Brooks\\' fantasy novel \"The Elfstones of Shannara,\" this exciting series is set a distant future where magic has replaced science. In the region known as the Four Lands, brave half-human/half-elf Wil Ohmsford (Austin Butler), Elven princess Amberle Elessedil (Poppy Drayton), and human thief Eretria (Ivan Baquero) are tasked with preventing an ancient tree from dying and releasing a horde of demons that could destroy the world. Debuting on MTV in 2016, the show also stars Manu Bennett, Aaron Jakubenko.10 episodes on 3 discs. 7 hrs. Widescreen; Soundtrack: English.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure/Television, Television', 'Format': 'Widescreen, AC-3', 'Contributor': 'Poppy Drayton, Austin Butler, Manu Bennett, Ivana Baquero', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Media Format': 'Widescreen, AC-3', 'Run time': '7 hours and 3 minutes', 'Release date': 'August 28, 2018', 'Actors': 'Manu Bennett, Poppy Drayton, Ivana Baquero, Austin Butler', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: Series should have had more $ backing to develop more content from books. Sad it ended.\nReview Title: Series should have had more $ backing to develop more content from books. Sad it ended.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Soldier (BD) [Blu-ray]\nReview Date: 2022/05/30\nStore: Kurt Russell  (Actor),     Jason Scott Lee  (Actor),     Paul Anderson  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Galactic wars of the near-future are fought by soldiers trained as merciless, obedient warriors. But times change. New bioengineered combatants make veterans like Sgt. Todd (Kurt Russell) obsolete. But don’t expect to toss Todd on the scrap heap without a fight. Fans of explosive sci-fi sagas get their viewing orders with this hotwired-to-tomorrow adventure written by David Webb Peoples (Blade Runner, Unforgiven) and directed by Paul Anderson (Death Race, Resident Evil: Afterlife). Spectacular in scale, Soldier backs its searing action with a startling vision in which mammoth “crawler” vehicles roam, planetary outcasts survive amid the jetsam of Earth’s past and technology is almost beyond human control. It’s a vision that’s more than an eerie future. It’s a total combat zone.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Blu-ray, DTS Surround Sound, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Anderson, Kurt Russell, Jared Thorne, Gary Busey, Connie Nielsen, Jason Scott Lee', 'Initial release date': '2011-07-26', 'Language': 'English (Dolby Digital Plus 5.1 EX)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '187158', 'Director': 'Paul Anderson', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, DTS Surround Sound, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'July 26, 2011', 'Actors': 'Kurt Russell, Jason Scott Lee, Gary Busey, Jared Thorne, Connie Nielsen', 'Subtitles': 'Spanish, English, French', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Very good work by Kurt Russell. Unexptected life lessons learned by the characters.\nReview Title: Good anti-hero underdog story.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alita: Battle Angel 4K UHD\nReview Date: 2022/11/09\nStore: Rosa Salazar  (Actor),     Christoph Waltz  (Actor),     Roberto Rodriguez  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['A deactivated cyborg is revived, but cannot remember anything of her past life and goes on a quest to find out who she is.']\nAverage Rating: 4.6\nProduct Details: {'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Director': 'Roberto Rodriguez', 'Media Format': '4K, Dolby, Full Screen, NTSC, PAL, Subtitled, Widescreen', 'Run time': '2 hours and 2 minutes', 'Release date': 'July 23, 2019', 'Actors': 'Rosa Salazar, Christoph Waltz, Mahershala Ali, Ed Skrein, Keean Johnson', 'Dubbed': 'French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'James Cameron, Laeta Kalogridis', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: enjoyable. lead character back story was  very interesting.  if quality remains the same I like to see a prequel\nReview Title: interesting story taking place in sci-fi furturistic action genre.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Beverly Hills Cop 3-Movie Collection [Blu-ray]\nReview Date: 2022/11/09\nStore: Judge Reinhold  (Actor),     Ronny Cox  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['All three films together on Blu-ray for the first time, newly remastered from new 4K transfers. Celebrating it\\'s 35th anniversary, the comedy classic BEVERLY HILLS COP stars Eddie Murphy as Axel Foley, a street-smart cop from Detroit. Tracking down his best friend\\'s killer in Beverly Hills, Axel smashes through the local barriers in a hilarious, high-speed pursuit of justice. In BEVERLY HILLS COP II, Eddie Murphy returns as Axel goes deep undercover to investigate a gang of international munitions smugglers and in BEVERLY HILLS COP III Axel investigates a counterfeit money ring, run out of a theme park in Los Angeles. The BEVERLY HILLS COP Blu-ray boasts brand new special features, including: · Two never-before-seen deleted scenes · Four new behind-the-scenes featurettes incorporating vintage 1984 interviews · An isolated audio track of the original score by Harold Faltermeyer · A \"BHC Mixtape \\'84\", which allows viewers to go directly to the scenes featuring the hit songs \"The Heat Is On,\" \"Neutron Dance,\" \"New Attitude,\" \"Stir It Up,\" \"Do You Really,\" and \"Nasty Girl.\"']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Subtitled', 'Contributor': 'Ronny Cox, Eddie Murphy, John Ashton, Judge Reinhold', 'Language': 'English', 'Runtime': '5 hours and 11 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'BR59202988', 'Media Format': 'Subtitled', 'Run time': '5 hours and 11 minutes', 'Release date': 'January 14, 2020', 'Actors': 'Judge Reinhold, Ronny Cox, Eddie Murphy, John Ashton', 'Dubbed': 'French, Spanish', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: murphy during his prime. last one was average, missing sgt was a disappointment.\nReview Title: murphy during his prime. last one was average.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bill & Ted Face the Music/Bill&Ted Bogus Journey/Bill&Ted Excellent Adventure (3 Film Bundle) [Blu-ray]\nReview Date: 2022/11/09\nStore: Various  (Actor, Director)    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Blu-ray, NTSC', 'Contributor': 'Various', 'Initial release date': '2020-11-10', 'Studio': 'Warner Bros.', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.23 Ounces', 'Item model number': 'BR782148', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Release date': 'November 10, 2020', 'Actors': 'Various', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: purchaed as a refresher for 4th movie. average.\nReview Title: purchaed as a refresher for 4th movie. average.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: The Matrix Collection\nReview Date: 2022/11/09\nStore: Various  (Actor, Director)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['4 Film Favorites: The Matrix Collection (BD)', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.12 Ounces', 'Item model number': '1000427444', 'Director': 'Various', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 16 minutes', 'Release date': 'January 6, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: bought as refresher for 4th. VG for all three. binge watch advantage.\nReview Title: bought as refresher for 4th. VG for all three. binge watch advantage.\nRating: 5.0\n--------------------------------------------------",
  "reference": "Resident Evil: Vendetta\nTakanori Tsujimoto  (Director)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['When a fearless enemy out for revenge unleashes a brutal and deadly new virus, BSAA captain Chris Redfield enlists the help of Agent Leon S. Kennedy and Professor Rebecca Chambers to bring down the death merchant and save New York City.']\n{'Brand': 'Sony', 'Format': 'AC-3, Dolby, Subtitled', 'Genre': 'Action, Sci-Fi, Anime, Horror, Thriller', 'Publication Date': 'July 18, 2017', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'D50162D', 'Director': 'Takanori Tsujimoto', 'Media Format': 'AC-3, Dolby, Subtitled', 'Run time': '1 hour and 37 minutes', 'Release date': 'July 18, 2017', 'Dubbed': 'Thai, Portuguese, French, Spanish', 'Subtitles': 'Thai, English, Korean, Mandarin Chinese, Portuguese, French, Spanish', 'Producers': 'Hiroyasu Shinohara', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\ngood resident evil story\nFive Stars\nUnderworld: Blood Wars\nKate Beckinsale  (Actor),     Theo James  (Actor),     Anna Foerster  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['In the next installment of the blockbuster franchise, Vampire death dealer Selene (Kate Beckinsale) fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David (Theo James) and his father Thomas (Charles Dance), she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.']\n{'Genre': 'Action, Sci-Fi, Horror', 'Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Contributor': 'Oliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter AnderssonOliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter Andersson  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Anna Foerster', 'Media Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'April 25, 2017', 'Actors': 'Kate Beckinsale, Theo James, Lara Pulver, Tobias Menzies, Bradley James', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'David Kern, Richard Wright, Gary Lucchesi, Tom Rosenberg, Len Wiseman', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nkate is awesome\nFive Stars\nThe Thousand Faces of Dunjia [Blu-ray]\nNi Ni  (Actor),     Dongyu Zhou  (Actor),     Yuen Woo-ping  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', 'Centuries ago, the ragtag warrior-sorcerors of the Wuyin clan were entrusted to safeguard China from threats beyond our plane of existence. But can even their skills keep a world-destroying device from the clutches of the alien invaders determined to claim it? Splashy big-budget Wuxia fantasy-actioner, directed by Woo-ping Yuen and scripted by Tsui Hark, stars Da Peng, Ni Ni, Wu Bai, Dongyu Zhou, and Arif Rahman Lee. 113 min. Widescreen; Soundtrack: Mandarin; Subtitles: English; featurette; theatrical trailer. In Mandarin with English subtitles.', 'Review', 'Dunjia is exuberant and visually inventive\" --Washington PostDelightful twists and turns and high energy performances --Film Combat SyndicateDunjia is a blast --Film Journal International']\n{'Genre': 'Action & Adventure', 'Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'Chengpeng Dong, Yuen Woo-ping, Dongyu Zhou, Ni Ni', 'Language': 'Mandarin Chinese (DTS 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Yuen Woo-ping', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 27, 2018', 'Actors': 'Ni Ni, Dongyu Zhou, Chengpeng Dong', 'Subtitles': 'English', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\ninteresting story and characters. looking forward to part 2\ninteresting story and characters. looking forward to part 2\nThe Witch: Subversion\nChoi Woo-shik  (Actor),     Kim Da-mi  (Actor),     Park Hoon-jung  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', '10 years ago, Ja-yoon escaped from a secret government facility in the midst of an inexplicable incident. An old couple finds her alone near death in the woods and takes her in even though she has no memory of who she is or how she got there. She grows up to be a bright high school student and enters a nationally televised audition program to win the top prize and help her struggling family. But as soon as she appears on TV, strange people start appearing in her life and Ja-yoon falls into turmoil as her seemingly ordinary life turns upside down in a blink of an eye Featuring an award-winning performance by Kim Da-mi and co-starring Choi Woo-shik (PARASITE, TRAIN TO BUSAN).', 'Review', 'the action sensation of the year that could rival any superhero movie --Starburst Magazinea kick-ass sci-fi action flick, with a satisfying gore factor to boot. --NerdlyAn ever-so-delicate twist on the Korean revenge thriller. --The Hollywood Reporter', 'About the Actor', 'Choi Woo-shik is known for Parasite (2019), Okja (2017), Set Me Free (2014), and Train to Busan (2016).', 'About the Director', 'Park Hoon-jung is known for New World (2013), The Tiger (2015), V.I.P. (2017), and I Saw the Devil (2010).', 'See more']\n{'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Director': 'Park Hoon-jung', 'Media Format': 'Dolby, Subtitled, Widescreen, Surround Sound', 'Run time': '2 hours and 7 minutes', 'Release date': 'March 10, 2020', 'Actors': 'Choi Woo-shik, Kim Da-mi, Cho Min-soo, Park Hee-soon', 'Subtitles': 'English', 'Language': 'Korean (DTS 5.1)', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthe title can throw you off. would like to see the story continue with a sequel with same cast.\nlikeable story and great characters on display.\nHeavy Metal [Blu-ray]\nGerald Potterton  (Director)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Based on the fantastical illustrated magazine', 'Heavy Metal', \", producer Ivan Reitman enlists the help of some of Hollywood's animation masters to create the otherworldly tale of a glowing green orb from outer space that spreads destruction throughout the galaxy. Only when encountered by its one true enemy, to whom it is inexplicably drawn, will goodness prevail throughout the universe. Richly and lavishly drawn, the vignettes of the orb's dark victories include the character voices of John Candy, Harold Ramis and a pounding soundtrack by Black Sabbath, Blue Oyster Cult, Cheap Trick, Devo, Donald Fagen, Don Felder, Grand Funk Railroad, Sammy Hagar, Journey, Nazareth, Stevie Nicks, Riggs, and Trust. Highly imaginative and full of surprising special effects,\", 'Heavy Metal', 'set the standard for the alternative contemporary animation. An intoxicating experience not to be missed!', 'Amazon.com', 'As long as there is a need for adolescent male sexual fantasy, there will be an audience for', 'Heavy Metal', \". Released in 1981 and based on stories from the graphic magazine of the same name (possibly the greatest publication to simultaneously provoke imagination and masturbation), the film has since become the most popular single title in Columbia/TriStar's entire film library. That's an amazing fact considering just how silly and senseless the movie really is--an aimless, juvenile amalgam of disjointed stories and clashing visual styles, employing hundreds of animators from around the world with a near-total absence of creative cohesion. It remains, for better and worse, a midnight-movie favorite for the stoner crowd--a movie best enjoyed by randy adolescents or near-adults in an altered state of consciousness. With a framing story about a glowing green orb claiming to be the embodiment of all evil, the film shuttles through eight episodic tales of sci-fi adventure, each fueled by some of the most wretched rock music to emerge from the 1980s. The most consistent trademark is an abundance of blood-splattering violence and wet-dream sex, the latter involving a succession of huge-breasted babes who shed their clothes at the drop of a G-string. It's all quite fun in its rampantly brainless desire to fuel the young male libido, and for all its incoherence\", 'Heavy Metal', \"remains impressive for the ambitious artistry of its individual segments. Courtesy of producer Ivan Reitman (who'd just scored a hit with Stripes), voice talents include several Canadian veterans of Second City comedy, including John Candy, Harold Ramis, Eugene Levy, and Joe Flaherty.\", '--Jeff Shannon']\n{'Genre': 'Sci-Fi, Fantasy, Musical', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Columbia Pictures; Heavy Metal Animation Co., Ivan Reitman, Gerald Potterton', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '17211076', 'Director': 'Gerald Potterton', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 14, 2011', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat music. solid story. graphics look dated\ngreat music. solid story. graphics look dated\nBlack Widow\nScarlett Johansson  (Actor),     Florence Pugh  (Actor),     Cate Shortland  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['In Marvel Studios\\' action-packed spy thriller \"Black Widow,\" Natasha Romanoff aka Black Widow confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.']\n{'Genre': 'Action/Adventure', 'Format': 'Subtitled, NTSC', 'Contributor': 'Olga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh, Eric Pearson, CC SmiffOlga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh…  See more', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.39:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.73 x 5.31 x 0.47 inches; 0.01 Ounces', 'Director': 'Cate Shortland', 'Media Format': 'Subtitled, NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'September 14, 2021', 'Actors': 'Scarlett Johansson, Florence Pugh, David Harbour, O-T Fagbenle, Olga Kurylenko', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MARVEL', 'Writers': 'Eric Pearson', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat marvel movie. should have be made way earlier. black widow can carry a movie on her own.\ngreat marvel movie. should have be made way earlier. black widow can carry a movie on her own.\nSnake Eyes: G.I. Joe Origins\nSamara Weaving  (Actor),     Henry Golding  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The origins of the Joes\\' unseen, unspeaking, and undeniably most popular member have been shrouded in mystery-until now. Proved worthy of recruitment into the Arashikage ninja clan, the man called Snake Eyes (Henry Golding) swiftly forges a bond with heir apparent Tommy \"Storm Shadow\" Arashikage (Andrew Koji)... but will the truth of his past convert it to lifelong enmity? Samara Weaving, Úrsula Corberó, Iko Uwais, Peter Mensah co-star. AKA: \"Snake Eyes: G.I. Joe Origins.\" 121 min. Widescreen; Soundtrack: English.']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Iko Uwais, Samara Weaving, Henry Golding, rsula Corber, Andrew Koji', 'Language': 'English', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.93 x 5.43 x 0.51 inches; 2.88 ounces', 'Media Format': 'Blu-ray', 'Release date': 'February 1, 2022', 'Actors': 'Samara Weaving, Henry Golding, Iko Uwais, Andrew Koji, rsula Corber', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\ninteresting origin story. not sure if it follows character canon.\ninteresting origin story. not sure if it follows character canon.\nBlade / Blade 2 / Blade: Trinity (BD)(3FE) [Blu-ray]\nVarious  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Blade / Blade 2 / Blade: Trinity (BD)(3FE)', 'BLADE - Wesley Snipes stars as the tortured soul Blade, who is half man, half immortal. Blade sharpens his lethal skills under the FBI, he is forced into the daylight, where he joins forces with a clan of human vampire hunters, the Nightstalkers. Together with two deftly trained Nightstalkers, Blade follows a trail of blood to the original vampire: Dracula. guidance of Whistler – his mentor, guardian and fellow hunter of the night. When the bloodthirsty Immortals’ lord, Deacon Frost, declares war on the human race, Blade is humanity’s last hope for survival. BLADE II - Guillermo del Toro directs this high-voltage adventure from screenwriter David S. Goyer. When the world is threatened by a new and deadlier breed of super vampire, Blade and Whistler join forces with an elite team of vampire warriors made up of Blade’s sworn enemies to stop the carnage and destroy the ravenous fiends. BLADE: TRINITY - For years, Blade has fought the vampires under the cover of night. But after falling into the crosshairs of the', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC, Widescreen, Blu-ray', 'Contributor': 'Various', 'Initial release date': '2015-03-10', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.53 Ounces', 'Item model number': '1000479690', 'Director': 'Various', 'Media Format': 'NTSC, Widescreen, Blu-ray', 'Release date': 'March 10, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\ngreat action from movie 1 through 3. enjoy.\none of the best early adoptions of a marvel comic character. great work by Wesley Snipes\nThe Shannara Chronicles: Season Two\nManu Bennett  (Actor),     Poppy Drayton  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Based on author Terry Brooks\\' fantasy novel \"The Elfstones of Shannara,\" this exciting series is set a distant future where magic has replaced science. In the region known as the Four Lands, brave half-human/half-elf Wil Ohmsford (Austin Butler), Elven princess Amberle Elessedil (Poppy Drayton), and human thief Eretria (Ivan Baquero) are tasked with preventing an ancient tree from dying and releasing a horde of demons that could destroy the world. Debuting on MTV in 2016, the show also stars Manu Bennett, Aaron Jakubenko.10 episodes on 3 discs. 7 hrs. Widescreen; Soundtrack: English.']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Widescreen, AC-3', 'Contributor': 'Poppy Drayton, Austin Butler, Manu Bennett, Ivana Baquero', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Media Format': 'Widescreen, AC-3', 'Run time': '7 hours and 3 minutes', 'Release date': 'August 28, 2018', 'Actors': 'Manu Bennett, Poppy Drayton, Ivana Baquero, Austin Butler', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '3'}\nSeries should have had more $ backing to develop more content from books. Sad it ended.\nSeries should have had more $ backing to develop more content from books. Sad it ended.\nSoldier (BD) [Blu-ray]\nKurt Russell  (Actor),     Jason Scott Lee  (Actor),     Paul Anderson  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Galactic wars of the near-future are fought by soldiers trained as merciless, obedient warriors. But times change. New bioengineered combatants make veterans like Sgt. Todd (Kurt Russell) obsolete. But don’t expect to toss Todd on the scrap heap without a fight. Fans of explosive sci-fi sagas get their viewing orders with this hotwired-to-tomorrow adventure written by David Webb Peoples (Blade Runner, Unforgiven) and directed by Paul Anderson (Death Race, Resident Evil: Afterlife). Spectacular in scale, Soldier backs its searing action with a startling vision in which mammoth “crawler” vehicles roam, planetary outcasts survive amid the jetsam of Earth’s past and technology is almost beyond human control. It’s a vision that’s more than an eerie future. It’s a total combat zone.']\n{'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Blu-ray, DTS Surround Sound, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Anderson, Kurt Russell, Jared Thorne, Gary Busey, Connie Nielsen, Jason Scott Lee', 'Initial release date': '2011-07-26', 'Language': 'English (Dolby Digital Plus 5.1 EX)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '187158', 'Director': 'Paul Anderson', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, DTS Surround Sound, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'July 26, 2011', 'Actors': 'Kurt Russell, Jason Scott Lee, Gary Busey, Jared Thorne, Connie Nielsen', 'Subtitles': 'Spanish, English, French', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nVery good work by Kurt Russell. Unexptected life lessons learned by the characters.\nGood anti-hero underdog story.\nAlita: Battle Angel 4K UHD\nRosa Salazar  (Actor),     Christoph Waltz  (Actor),     Roberto Rodriguez  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['A deactivated cyborg is revived, but cannot remember anything of her past life and goes on a quest to find out who she is.']\n{'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Director': 'Roberto Rodriguez', 'Media Format': '4K, Dolby, Full Screen, NTSC, PAL, Subtitled, Widescreen', 'Run time': '2 hours and 2 minutes', 'Release date': 'July 23, 2019', 'Actors': 'Rosa Salazar, Christoph Waltz, Mahershala Ali, Ed Skrein, Keean Johnson', 'Dubbed': 'French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'James Cameron, Laeta Kalogridis', 'Country of Origin': 'USA', 'Number of discs': '3'}\nenjoyable. lead character back story was  very interesting.  if quality remains the same I like to see a prequel\ninteresting story taking place in sci-fi furturistic action genre.\nBeverly Hills Cop 3-Movie Collection [Blu-ray]\nJudge Reinhold  (Actor),     Ronny Cox  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['All three films together on Blu-ray for the first time, newly remastered from new 4K transfers. Celebrating it\\'s 35th anniversary, the comedy classic BEVERLY HILLS COP stars Eddie Murphy as Axel Foley, a street-smart cop from Detroit. Tracking down his best friend\\'s killer in Beverly Hills, Axel smashes through the local barriers in a hilarious, high-speed pursuit of justice. In BEVERLY HILLS COP II, Eddie Murphy returns as Axel goes deep undercover to investigate a gang of international munitions smugglers and in BEVERLY HILLS COP III Axel investigates a counterfeit money ring, run out of a theme park in Los Angeles. The BEVERLY HILLS COP Blu-ray boasts brand new special features, including: · Two never-before-seen deleted scenes · Four new behind-the-scenes featurettes incorporating vintage 1984 interviews · An isolated audio track of the original score by Harold Faltermeyer · A \"BHC Mixtape \\'84\", which allows viewers to go directly to the scenes featuring the hit songs \"The Heat Is On,\" \"Neutron Dance,\" \"New Attitude,\" \"Stir It Up,\" \"Do You Really,\" and \"Nasty Girl.\"']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Subtitled', 'Contributor': 'Ronny Cox, Eddie Murphy, John Ashton, Judge Reinhold', 'Language': 'English', 'Runtime': '5 hours and 11 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'BR59202988', 'Media Format': 'Subtitled', 'Run time': '5 hours and 11 minutes', 'Release date': 'January 14, 2020', 'Actors': 'Judge Reinhold, Ronny Cox, Eddie Murphy, John Ashton', 'Dubbed': 'French, Spanish', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\nmurphy during his prime. last one was average, missing sgt was a disappointment.\nmurphy during his prime. last one was average.\nBill & Ted Face the Music/Bill&Ted Bogus Journey/Bill&Ted Excellent Adventure (3 Film Bundle) [Blu-ray]\nVarious  (Actor, Director)    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Blu-ray, NTSC', 'Contributor': 'Various', 'Initial release date': '2020-11-10', 'Studio': 'Warner Bros.', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.23 Ounces', 'Item model number': 'BR782148', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Release date': 'November 10, 2020', 'Actors': 'Various', 'Country of Origin': 'USA', 'Number of discs': '3'}\npurchaed as a refresher for 4th movie. average.\npurchaed as a refresher for 4th movie. average.\n4 Film Favorites: The Matrix Collection\nVarious  (Actor, Director)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['4 Film Favorites: The Matrix Collection (BD)', ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.12 Ounces', 'Item model number': '1000427444', 'Director': 'Various', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 16 minutes', 'Release date': 'January 6, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nbought as refresher for 4th. VG for all three. binge watch advantage.\nbought as refresher for 4th. VG for all three. binge watch advantage.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Resident Evil: Vendetta\nReview Date: 2017/10/07\nStore: Takanori Tsujimoto  (Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['When a fearless enemy out for revenge unleashes a brutal and deadly new virus, BSAA captain Chris Redfield enlists the help of Agent Leon S. Kennedy and Professor Rebecca Chambers to bring down the death merchant and save New York City.']\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Sony', 'Format': 'AC-3, Dolby, Subtitled', 'Genre': 'Action, Sci-Fi, Anime, Horror, Thriller', 'Publication Date': 'July 18, 2017', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'D50162D', 'Director': 'Takanori Tsujimoto', 'Media Format': 'AC-3, Dolby, Subtitled', 'Run time': '1 hour and 37 minutes', 'Release date': 'July 18, 2017', 'Dubbed': 'Thai, Portuguese, French, Spanish', 'Subtitles': 'Thai, English, Korean, Mandarin Chinese, Portuguese, French, Spanish', 'Producers': 'Hiroyasu Shinohara', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: good resident evil story\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Underworld: Blood Wars\nReview Date: 2017/10/07\nStore: Kate Beckinsale  (Actor),     Theo James  (Actor),     Anna Foerster  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['In the next installment of the blockbuster franchise, Vampire death dealer Selene (Kate Beckinsale) fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David (Theo James) and his father Thomas (Charles Dance), she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action, Sci-Fi, Horror', 'Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Contributor': 'Oliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter AnderssonOliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter Andersson  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Anna Foerster', 'Media Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'April 25, 2017', 'Actors': 'Kate Beckinsale, Theo James, Lara Pulver, Tobias Menzies, Bradley James', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'David Kern, Richard Wright, Gary Lucchesi, Tom Rosenberg, Len Wiseman', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: kate is awesome\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Thousand Faces of Dunjia [Blu-ray]\nReview Date: 2021/11/21\nStore: Ni Ni  (Actor),     Dongyu Zhou  (Actor),     Yuen Woo-ping  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', 'Centuries ago, the ragtag warrior-sorcerors of the Wuyin clan were entrusted to safeguard China from threats beyond our plane of existence. But can even their skills keep a world-destroying device from the clutches of the alien invaders determined to claim it? Splashy big-budget Wuxia fantasy-actioner, directed by Woo-ping Yuen and scripted by Tsui Hark, stars Da Peng, Ni Ni, Wu Bai, Dongyu Zhou, and Arif Rahman Lee. 113 min. Widescreen; Soundtrack: Mandarin; Subtitles: English; featurette; theatrical trailer. In Mandarin with English subtitles.', 'Review', 'Dunjia is exuberant and visually inventive\" --Washington PostDelightful twists and turns and high energy performances --Film Combat SyndicateDunjia is a blast --Film Journal International']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'Chengpeng Dong, Yuen Woo-ping, Dongyu Zhou, Ni Ni', 'Language': 'Mandarin Chinese (DTS 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Yuen Woo-ping', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 27, 2018', 'Actors': 'Ni Ni, Dongyu Zhou, Chengpeng Dong', 'Subtitles': 'English', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: interesting story and characters. looking forward to part 2\nReview Title: interesting story and characters. looking forward to part 2\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Witch: Subversion\nReview Date: 2021/11/21\nStore: Choi Woo-shik  (Actor),     Kim Da-mi  (Actor),     Park Hoon-jung  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', '10 years ago, Ja-yoon escaped from a secret government facility in the midst of an inexplicable incident. An old couple finds her alone near death in the woods and takes her in even though she has no memory of who she is or how she got there. She grows up to be a bright high school student and enters a nationally televised audition program to win the top prize and help her struggling family. But as soon as she appears on TV, strange people start appearing in her life and Ja-yoon falls into turmoil as her seemingly ordinary life turns upside down in a blink of an eye Featuring an award-winning performance by Kim Da-mi and co-starring Choi Woo-shik (PARASITE, TRAIN TO BUSAN).', 'Review', 'the action sensation of the year that could rival any superhero movie --Starburst Magazinea kick-ass sci-fi action flick, with a satisfying gore factor to boot. --NerdlyAn ever-so-delicate twist on the Korean revenge thriller. --The Hollywood Reporter', 'About the Actor', 'Choi Woo-shik is known for Parasite (2019), Okja (2017), Set Me Free (2014), and Train to Busan (2016).', 'About the Director', 'Park Hoon-jung is known for New World (2013), The Tiger (2015), V.I.P. (2017), and I Saw the Devil (2010).', 'See more']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Director': 'Park Hoon-jung', 'Media Format': 'Dolby, Subtitled, Widescreen, Surround Sound', 'Run time': '2 hours and 7 minutes', 'Release date': 'March 10, 2020', 'Actors': 'Choi Woo-shik, Kim Da-mi, Cho Min-soo, Park Hee-soon', 'Subtitles': 'English', 'Language': 'Korean (DTS 5.1)', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: the title can throw you off. would like to see the story continue with a sequel with same cast.\nReview Title: likeable story and great characters on display.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heavy Metal [Blu-ray]\nReview Date: 2021/11/21\nStore: Gerald Potterton  (Director)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Based on the fantastical illustrated magazine', 'Heavy Metal', \", producer Ivan Reitman enlists the help of some of Hollywood's animation masters to create the otherworldly tale of a glowing green orb from outer space that spreads destruction throughout the galaxy. Only when encountered by its one true enemy, to whom it is inexplicably drawn, will goodness prevail throughout the universe. Richly and lavishly drawn, the vignettes of the orb's dark victories include the character voices of John Candy, Harold Ramis and a pounding soundtrack by Black Sabbath, Blue Oyster Cult, Cheap Trick, Devo, Donald Fagen, Don Felder, Grand Funk Railroad, Sammy Hagar, Journey, Nazareth, Stevie Nicks, Riggs, and Trust. Highly imaginative and full of surprising special effects,\", 'Heavy Metal', 'set the standard for the alternative contemporary animation. An intoxicating experience not to be missed!', 'Amazon.com', 'As long as there is a need for adolescent male sexual fantasy, there will be an audience for', 'Heavy Metal', \". Released in 1981 and based on stories from the graphic magazine of the same name (possibly the greatest publication to simultaneously provoke imagination and masturbation), the film has since become the most popular single title in Columbia/TriStar's entire film library. That's an amazing fact considering just how silly and senseless the movie really is--an aimless, juvenile amalgam of disjointed stories and clashing visual styles, employing hundreds of animators from around the world with a near-total absence of creative cohesion. It remains, for better and worse, a midnight-movie favorite for the stoner crowd--a movie best enjoyed by randy adolescents or near-adults in an altered state of consciousness. With a framing story about a glowing green orb claiming to be the embodiment of all evil, the film shuttles through eight episodic tales of sci-fi adventure, each fueled by some of the most wretched rock music to emerge from the 1980s. The most consistent trademark is an abundance of blood-splattering violence and wet-dream sex, the latter involving a succession of huge-breasted babes who shed their clothes at the drop of a G-string. It's all quite fun in its rampantly brainless desire to fuel the young male libido, and for all its incoherence\", 'Heavy Metal', \"remains impressive for the ambitious artistry of its individual segments. Courtesy of producer Ivan Reitman (who'd just scored a hit with Stripes), voice talents include several Canadian veterans of Second City comedy, including John Candy, Harold Ramis, Eugene Levy, and Joe Flaherty.\", '--Jeff Shannon']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Sci-Fi, Fantasy, Musical', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Columbia Pictures; Heavy Metal Animation Co., Ivan Reitman, Gerald Potterton', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '17211076', 'Director': 'Gerald Potterton', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 14, 2011', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great music. solid story. graphics look dated\nReview Title: great music. solid story. graphics look dated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Black Widow\nReview Date: 2021/11/21\nStore: Scarlett Johansson  (Actor),     Florence Pugh  (Actor),     Cate Shortland  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['In Marvel Studios\\' action-packed spy thriller \"Black Widow,\" Natasha Romanoff aka Black Widow confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Subtitled, NTSC', 'Contributor': 'Olga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh, Eric Pearson, CC SmiffOlga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh…  See more', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.39:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.73 x 5.31 x 0.47 inches; 0.01 Ounces', 'Director': 'Cate Shortland', 'Media Format': 'Subtitled, NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'September 14, 2021', 'Actors': 'Scarlett Johansson, Florence Pugh, David Harbour, O-T Fagbenle, Olga Kurylenko', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MARVEL', 'Writers': 'Eric Pearson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great marvel movie. should have be made way earlier. black widow can carry a movie on her own.\nReview Title: great marvel movie. should have be made way earlier. black widow can carry a movie on her own.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Snake Eyes: G.I. Joe Origins\nReview Date: 2021/12/19\nStore: Samara Weaving  (Actor),     Henry Golding  (Actor)    Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['The origins of the Joes\\' unseen, unspeaking, and undeniably most popular member have been shrouded in mystery-until now. Proved worthy of recruitment into the Arashikage ninja clan, the man called Snake Eyes (Henry Golding) swiftly forges a bond with heir apparent Tommy \"Storm Shadow\" Arashikage (Andrew Koji)... but will the truth of his past convert it to lifelong enmity? Samara Weaving, Úrsula Corberó, Iko Uwais, Peter Mensah co-star. AKA: \"Snake Eyes: G.I. Joe Origins.\" 121 min. Widescreen; Soundtrack: English.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Iko Uwais, Samara Weaving, Henry Golding, rsula Corber, Andrew Koji', 'Language': 'English', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.93 x 5.43 x 0.51 inches; 2.88 ounces', 'Media Format': 'Blu-ray', 'Release date': 'February 1, 2022', 'Actors': 'Samara Weaving, Henry Golding, Iko Uwais, Andrew Koji, rsula Corber', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nReview Text: interesting origin story. not sure if it follows character canon.\nReview Title: interesting origin story. not sure if it follows character canon.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blade / Blade 2 / Blade: Trinity (BD)(3FE) [Blu-ray]\nReview Date: 2022/05/29\nStore: Various  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Blade / Blade 2 / Blade: Trinity (BD)(3FE)', 'BLADE - Wesley Snipes stars as the tortured soul Blade, who is half man, half immortal. Blade sharpens his lethal skills under the FBI, he is forced into the daylight, where he joins forces with a clan of human vampire hunters, the Nightstalkers. Together with two deftly trained Nightstalkers, Blade follows a trail of blood to the original vampire: Dracula. guidance of Whistler – his mentor, guardian and fellow hunter of the night. When the bloodthirsty Immortals’ lord, Deacon Frost, declares war on the human race, Blade is humanity’s last hope for survival. BLADE II - Guillermo del Toro directs this high-voltage adventure from screenwriter David S. Goyer. When the world is threatened by a new and deadlier breed of super vampire, Blade and Whistler join forces with an elite team of vampire warriors made up of Blade’s sworn enemies to stop the carnage and destroy the ravenous fiends. BLADE: TRINITY - For years, Blade has fought the vampires under the cover of night. But after falling into the crosshairs of the', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'NTSC, Widescreen, Blu-ray', 'Contributor': 'Various', 'Initial release date': '2015-03-10', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.53 Ounces', 'Item model number': '1000479690', 'Director': 'Various', 'Media Format': 'NTSC, Widescreen, Blu-ray', 'Release date': 'March 10, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: great action from movie 1 through 3. enjoy.\nReview Title: one of the best early adoptions of a marvel comic character. great work by Wesley Snipes\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Shannara Chronicles: Season Two\nReview Date: 2022/05/30\nStore: Manu Bennett  (Actor),     Poppy Drayton  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['Based on author Terry Brooks\\' fantasy novel \"The Elfstones of Shannara,\" this exciting series is set a distant future where magic has replaced science. In the region known as the Four Lands, brave half-human/half-elf Wil Ohmsford (Austin Butler), Elven princess Amberle Elessedil (Poppy Drayton), and human thief Eretria (Ivan Baquero) are tasked with preventing an ancient tree from dying and releasing a horde of demons that could destroy the world. Debuting on MTV in 2016, the show also stars Manu Bennett, Aaron Jakubenko.10 episodes on 3 discs. 7 hrs. Widescreen; Soundtrack: English.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure/Television, Television', 'Format': 'Widescreen, AC-3', 'Contributor': 'Poppy Drayton, Austin Butler, Manu Bennett, Ivana Baquero', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Media Format': 'Widescreen, AC-3', 'Run time': '7 hours and 3 minutes', 'Release date': 'August 28, 2018', 'Actors': 'Manu Bennett, Poppy Drayton, Ivana Baquero, Austin Butler', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: Series should have had more $ backing to develop more content from books. Sad it ended.\nReview Title: Series should have had more $ backing to develop more content from books. Sad it ended.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Soldier (BD) [Blu-ray]\nReview Date: 2022/05/30\nStore: Kurt Russell  (Actor),     Jason Scott Lee  (Actor),     Paul Anderson  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Galactic wars of the near-future are fought by soldiers trained as merciless, obedient warriors. But times change. New bioengineered combatants make veterans like Sgt. Todd (Kurt Russell) obsolete. But don’t expect to toss Todd on the scrap heap without a fight. Fans of explosive sci-fi sagas get their viewing orders with this hotwired-to-tomorrow adventure written by David Webb Peoples (Blade Runner, Unforgiven) and directed by Paul Anderson (Death Race, Resident Evil: Afterlife). Spectacular in scale, Soldier backs its searing action with a startling vision in which mammoth “crawler” vehicles roam, planetary outcasts survive amid the jetsam of Earth’s past and technology is almost beyond human control. It’s a vision that’s more than an eerie future. It’s a total combat zone.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Blu-ray, DTS Surround Sound, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Anderson, Kurt Russell, Jared Thorne, Gary Busey, Connie Nielsen, Jason Scott Lee', 'Initial release date': '2011-07-26', 'Language': 'English (Dolby Digital Plus 5.1 EX)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '187158', 'Director': 'Paul Anderson', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, DTS Surround Sound, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'July 26, 2011', 'Actors': 'Kurt Russell, Jason Scott Lee, Gary Busey, Jared Thorne, Connie Nielsen', 'Subtitles': 'Spanish, English, French', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Very good work by Kurt Russell. Unexptected life lessons learned by the characters.\nReview Title: Good anti-hero underdog story.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alita: Battle Angel 4K UHD\nReview Date: 2022/11/09\nStore: Rosa Salazar  (Actor),     Christoph Waltz  (Actor),     Roberto Rodriguez  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['A deactivated cyborg is revived, but cannot remember anything of her past life and goes on a quest to find out who she is.']\nAverage Rating: 4.6\nProduct Details: {'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Director': 'Roberto Rodriguez', 'Media Format': '4K, Dolby, Full Screen, NTSC, PAL, Subtitled, Widescreen', 'Run time': '2 hours and 2 minutes', 'Release date': 'July 23, 2019', 'Actors': 'Rosa Salazar, Christoph Waltz, Mahershala Ali, Ed Skrein, Keean Johnson', 'Dubbed': 'French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'James Cameron, Laeta Kalogridis', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: enjoyable. lead character back story was  very interesting.  if quality remains the same I like to see a prequel\nReview Title: interesting story taking place in sci-fi furturistic action genre.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Beverly Hills Cop 3-Movie Collection [Blu-ray]\nReview Date: 2022/11/09\nStore: Judge Reinhold  (Actor),     Ronny Cox  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['All three films together on Blu-ray for the first time, newly remastered from new 4K transfers. Celebrating it\\'s 35th anniversary, the comedy classic BEVERLY HILLS COP stars Eddie Murphy as Axel Foley, a street-smart cop from Detroit. Tracking down his best friend\\'s killer in Beverly Hills, Axel smashes through the local barriers in a hilarious, high-speed pursuit of justice. In BEVERLY HILLS COP II, Eddie Murphy returns as Axel goes deep undercover to investigate a gang of international munitions smugglers and in BEVERLY HILLS COP III Axel investigates a counterfeit money ring, run out of a theme park in Los Angeles. The BEVERLY HILLS COP Blu-ray boasts brand new special features, including: · Two never-before-seen deleted scenes · Four new behind-the-scenes featurettes incorporating vintage 1984 interviews · An isolated audio track of the original score by Harold Faltermeyer · A \"BHC Mixtape \\'84\", which allows viewers to go directly to the scenes featuring the hit songs \"The Heat Is On,\" \"Neutron Dance,\" \"New Attitude,\" \"Stir It Up,\" \"Do You Really,\" and \"Nasty Girl.\"']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Subtitled', 'Contributor': 'Ronny Cox, Eddie Murphy, John Ashton, Judge Reinhold', 'Language': 'English', 'Runtime': '5 hours and 11 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'BR59202988', 'Media Format': 'Subtitled', 'Run time': '5 hours and 11 minutes', 'Release date': 'January 14, 2020', 'Actors': 'Judge Reinhold, Ronny Cox, Eddie Murphy, John Ashton', 'Dubbed': 'French, Spanish', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: murphy during his prime. last one was average, missing sgt was a disappointment.\nReview Title: murphy during his prime. last one was average.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bill & Ted Face the Music/Bill&Ted Bogus Journey/Bill&Ted Excellent Adventure (3 Film Bundle) [Blu-ray]\nReview Date: 2022/11/09\nStore: Various  (Actor, Director)    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Blu-ray, NTSC', 'Contributor': 'Various', 'Initial release date': '2020-11-10', 'Studio': 'Warner Bros.', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.23 Ounces', 'Item model number': 'BR782148', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Release date': 'November 10, 2020', 'Actors': 'Various', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: purchaed as a refresher for 4th movie. average.\nReview Title: purchaed as a refresher for 4th movie. average.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: The Matrix Collection\nReview Date: 2022/11/09\nStore: Various  (Actor, Director)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['4 Film Favorites: The Matrix Collection (BD)', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.12 Ounces', 'Item model number': '1000427444', 'Director': 'Various', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 16 minutes', 'Release date': 'January 6, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: bought as refresher for 4th. VG for all three. binge watch advantage.\nReview Title: bought as refresher for 4th. VG for all three. binge watch advantage.\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe shopping data reveals a strong preference for action, sci-fi, and horror genres in cinematic experiences, particularly through a consistent appreciation for films that blend elements of fantasy and adventure. The individual rates products highly, often giving them the maximum rating, indicating a positive sentiment and satisfaction with the narratives and character developments across similar themes. \n\nCommon themes identified include a fascination with franchises that have complex storylines, such as those involving supernatural elements like vampires and futuristic settings, suggesting an affinity for both traditional and unconventional storytelling. The buyer also seems to favor high-action scenarios with robust character arcs, aligning with a notable preference for strong female leads and anti-heroes. \n\nQuality remains paramount, as evidenced by frequent comments on production value and storytelling coherence, while the customer shows a low price sensitivity as they prioritize quality content over cost, reflected by their selection of Blu-ray formats and collections of multiple films. Overall, they exhibit a pronounced inclination towards immersive, well-crafted entertainment in the sci-fi and action-adventure realms, with an eye for sequels and series expansions.",
  "target_interaction": {
    "rating": 5.0,
    "title": "amusing, fast pace action movie with solid acting by its cast.",
    "text": "amusing, fast pace action movie with solid acting by its cast.",
    "images": [],
    "asin": "B0B64HSFTZ",
    "parent_asin": "B0B64HSFTZ",
    "user_id": "AGEWBBUZEXZJVYISJRSDQZIA7PIQ",
    "timestamp": "2023-01-12 23:16:41.384000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Bullet Train [Blu-ray] [DVD]",
    "average_rating": 4.3,
    "rating_number": 21172,
    "features": [],
    "description": [
      "In Bullet Train, Brad Pitt stars as Ladybug, an unlucky assassin determined to do his job peacefully after one too many gigs gone off the rails. Fate, however, may have other plans, as Ladybug's latest mission puts him on a collision course with lethal adversaries from around the globe – all with connected, yet conflicting, objectives – on the world's fastest train...and he's got to figure out how to get off. From the director of Deadpool 2, David Leitch, the end of the line is only the beginning in a wild, non-stop thrill ride through modern-day Japan."
    ],
    "price": 16.94,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51a9TLmVpvL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51a9TLmVpvL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91evXGKb6EL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41mg3MfCAbL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41mg3MfCAbL.jpg",
        "variant": "BOTT",
        "hi_res": "https://m.media-amazon.com/images/I/61+j9hELF-L._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Bullet Train Blu-Ray Unboxing",
        "url": "https://www.amazon.com/vdp/08db7fb115884f8d8df189ca9b948553?ref=dp_vse_rvc_0",
        "user_id": "/shop/bobbobson682"
      },
      {
        "title": "Bullet Train Blu-ray Movie Review",
        "url": "https://www.amazon.com/vdp/076000d88a26471f8909d2690721bf83?ref=dp_vse_rvc_1",
        "user_id": "/shop/ringsking"
      }
    ],
    "store": "Brad Pitt  (Actor),     Joey King  (Actor),     David Leitch  (Director, Producer)    &                   0                  more   Rated:    R    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Genre": "Action",
      "Format": "Blu-ray, Digital_copy, DVD, Subtitled",
      "Contributor": "Antoine Fuqua, Brian Henry, Zazie Beetz, Masi Oka, David Leitch, Kelly McCormick, Hiroyuki Sanada, Michael Shannon, Karen Fukuhara, Aaron Taylor-Johnson, Logan Lerman, Sandra Bullock, Brad Pitt, Benito Martínez Ocasio, Andrew Koji, 87North Production, Joey KingAntoine Fuqua, Brian Henry, Zazie Beetz, Masi Oka, David Leitch, Kelly McCormick, Hiroyuki Sanada, Michael Shannon, Karen Fukuhara, Aaron Taylor-Johnson, Logan Lerman, Sandra Bullock, Brad Pitt, Benito Martínez Ocasio, Andrew Koji, 87North Production, Joey King  See more",
      "Language": "English",
      "Runtime": "2 hours and 6 minutes",
      "MPAA rating": "R (Restricted)",
      "Package Dimensions": "6.69 x 5.35 x 0.43 inches; 2.88 Ounces",
      "Audio Description": "English",
      "Director": "David Leitch",
      "Media Format": "Blu-ray, Digital_copy, DVD, Subtitled",
      "Run time": "2 hours and 6 minutes",
      "Release date": "October 18, 2022",
      "Actors": "Brad Pitt, Joey King, Aaron Taylor-Johnson, Brian Henry, Andrew Koji",
      "Dubbed": "Thai, Portuguese, French, Spanish",
      "Subtitles": "Thai, Mandarin Chinese, Korean, English, Portuguese, French, Spanish",
      "Producers": "Kelly McCormick, David Leitch, Antoine Fuqua",
      "Studio": "Sony Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "2"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}