{
  "user_id": "AE2BH7Z4M243LVUXAFCCNPBW2HEA",
  "summary": "=== Purchase Information ===\nProduct Title: Mystery Science Theater 3000 - Mitchell\nReview Date: 2012/02/05\nStore: Ashby, John  (Actor),     Baker, Joe Don  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\nProduct Description: ['Rare Mystery Science theater 3000 episode where Joel and the bots riff on the awful film \"Mitchell\" starring Joe Don Baker']\nAverage Rating: 4.6\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 20, 2001', 'Actors': 'Ashby, John, Baker, Joe Don, Balsam, Martin, Barnes, Rayford, Bass, Todd', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Rhino Theatrical', 'Number of discs': '1'}\nReview Text: It's obvious  that \"Mitchell\" was a copy of the Shaft movie and short-lived television series: his own man; rebel within law enforcement while sticking it to the man;sex machine (sort of); and willing to take changes regardless of the odds. BUT the cast of MST3000 rip it to shreds.  With the exception of Gypsy (extremely annoying), the cast has some good one liners: \"Mr Treveno has been hit again\" ; \"he just landed just short of the green\"; \"fresh panties all around\"; and  Tom Servo's obsession with Joe Don Baker's eating/farting. One of the best!!!\nReview Title: Yes One of the Best\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Room 222: Season Two [DVD]\nReview Date: 2012/11/25\nStore: Lloyd Haynes  (Actor),     Denise Nicholas  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: [\"A compelling series about life at a multiracial Los Angeles high school, Room 222 left an indelible mark on popular culture by using the half-hour form to explore socially relevant issues (more than a year before Norman Lear's other groundbreaking shows—All in the Family and Maude) and by starting the still-popular trend of high school television series. Created by the now-legendary James L. Brooks (The Mary Tyler Moore Show, Rhoda, The Simpsons), the program was praised for dealing realistically with such subjects as racism, sexism, illiteracy, guns in school and drugs. Pete Dixon (Lloyd Haynes) is a dedicated and popular history teacher who fights the good fight on the side of his students. Joining him in his idealistic approach to education are guidance counselor Liz McIntyre (Denise Nicholas) and student teacher Alice Johnson (Karen Valentine). Experienced and slightly world-weary principal Seymour Kaufman (Michael Constantine) provides a balance to the youthful idealism of the '60s cultural revolution—but at the end of the day, everyone is on the side of the students. Season Two guest stars include Richard Dreyfuss, Kurt Russell, Cindy Williams, Chuck Norris, Tim Matheson and Ed Begley, Jr.\", ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Lloyd Haynes, James L. Brooks, Michael Constantine, Karen Valentine, Denise Nicholas', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '10 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'DSF11387D', 'Media Format': 'Subtitled, NTSC', 'Run time': '10 hours and 30 minutes', 'Release date': 'April 28, 2020', 'Actors': 'Lloyd Haynes, Denise Nicholas, Michael Constantine, Karen Valentine', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nReview Text: Great show... a far cry from the predicable cookie cutter scrips of contemporary drama. It's interesting to view the students or rather the actors portraying the students' feelings of anxiety and despair in the society i.e., the assassinations, the riots, conscription  and how their views mirrored the militant/counter culture groups of that time period (e.g., The Black Panthers; The Weather Underground; Brothers of Internal Love, FLQ). And to watch the following actors in the early stages of their careers and how skinny they were was comical:  i.e. , Teri Garr; Glynn Turman- A Different World, The Wire; Rob Riener; Cindy Williams--Lavern and Shirley; Ed Bagley Jr. and Kurt Russell.\nReview Title: What Memories of the Turbulent late 1960's\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Miami Vice: Season 4\nReview Date: 2013/06/16\nStore: Don Johnson  (Actor),     Philip Michael Thomas  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Hit the streets again with Don Johnson as James \"Sonny\" Crockett and Philip Michael Thomas as Ricardo Tubbs, two of the world\\'s slickest undercover cops, in Season Four of Miami Vice! Oscar-nominated director Michael Mann and Primetime Emmy Award-winning producer Dick Wolf bring you all 22 heart-pounding, fashion-forward episodes in this must-own 5-disc set. Joining the iconic detective duo in Miami\\'s steamy underworld is a powerful roster of guest stars, including James Brown, Julia Roberts, and Chris Rock. Miami Vice is an action-packed show whose \"influence is still evident\" (The New York Times).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Edward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael ThomasEdward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael Thomas  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.6 Ounces', 'Item model number': '61021031', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '17 hours and 34 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Don Johnson, Philip Michael Thomas, Edward James Olmos, Sheena Easton, Saundra Santiago', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Won't be disappointed. However, there are not any behind the scenes interviews if one is to inquire. The quality of the pictures are quite good.\nReview Title: Classic 1980's television\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Birdman and the Galaxy Trio: The Complete Series (DVD)\nReview Date: 2013/07/11\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Birdman and the Galaxy Trio: The Complete Series (DVD)', 'Featuring the episodes in the three-segment form as they originally aired, these popular retro hits take the action around the world and into outer space! First, winged hero Birdman harnesses the power of the sun to fight criminal masterminds like Number One, Vulturo and Dr. Millenium. Then, cosmic crusaders Gravity Girl, Vapor Man and Meteor Man – better known as the Galaxy Trio –serve up justice in space as they travel the universe eradicating evil and procuring peace across the cosmos. And finally, it’s more Birdman with his trusty eagle Avenger and his namesake battle cry that strikes fear into the hearts of his enemies. Fly away with these favorite retro heroes as they deliver old-school justice in this 2-disc collector’s dream compilation.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation, Action & Adventure', 'Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Contributor': 'Various', 'Language': 'English (Mono), Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.3 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Run time': '7 hours', 'Release date': 'July 17, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nReview Text: Used to watch the reruns in 1971-1972 on late Saturday afternoons on CBC television in Toronto. Had to wonder who i.e., Bill Hanna, Joe Barbera or Keith Andes, voice of Birdman, thought of the distinctive battle cry!!  Too bad the show was politically silent to the current events of time, i.e., 1967. Sadly Mr. Andes completed suicide in 2005 because of extreme ill heath (source: Internet movie data base).\nReview Title: What imagination BillHanna and Joe Barbera had back in the late 19060's\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vietnam: The Ten Thousand Day War\nReview Date: 2013/08/05\nStore: Richard Basehart  (Actor),     Alexander Haig  (Actor)    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Military & War\nProduct Description: ['Known as history s first \"living room war,\" The Vietnam conflict is presented on 4 DVDs with clarity, authority and insight in this nearly 10-hour documentary. Written by Pulitzer Prize-winning journalist Peter Arnett and narrated by Richard Basehart, our set covers the entire conflict, examining the shifting attitudes of the United States toward Vietnam from 1945, when the battleground was known as French Indochina, to 1975, when Saigon fell to the North Vietnamese.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'John Ehrlichman, Alexander Haig, Richard Basehart, Doris Kearns Goodwin, Peter Arnett, William Colby', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '26401918', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '10 hours', 'Release date': 'April 2, 2013', 'Actors': 'Richard Basehart, Alexander Haig, John Ehrlichman, William Colby, Doris Kearns Goodwin', 'Studio': 'Time Life Entertainment / VSC', 'Writers': 'Peter Arnett', 'Number of discs': '1'}\nReview Text: Just excellent file footage of the various battles and the anti-war protests. Would be a great source for anyone writing a college thesis.\nReview Title: Great Series from the 1980's. Great Interviews!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Threads [NON-USA FORMAT, PAL, Reg.2&4 Import - Great Britain]\nReview Date: 2013/08/15\nStore: Karen Meagher  (Actor),     Reece Dinsdale  (Actor),     Mick Jackson  (Director, Producer)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Documentary-style account of a nuclear attack on Sheffield during the 1980s. Ruth Beckett (Karen Meagher) and Jimmy Kemp (Reece Dinsdale) live in Sheffield and are busy preparing for their upcoming marriage. When Russia invades Iran, hoping to bring the country under its influence, tension is increased throughout the West, and particularly at the local R.A.F. base. Blissfully unconcerned with world events, Ruth and Jimmy carry on with their wedding preparations. However, when two Russian ICBM's hit Sheffield, turning the landscape into a radioactive desert, Ruth and Jimmy are forced to face up to the harsh reality of life in the aftermath of a nuclear explosion.\"]\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Documentary', 'Format': 'Import, PAL', 'Contributor': 'June Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham MasseyJune Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham Massey   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.48 x 5.35 x 0.63 inches; 2.82 Ounces', 'Director': 'Mick Jackson', 'Media Format': 'Import, PAL', 'Run time': '1 hour and 53 minutes', 'Actors': 'Karen Meagher, Reece Dinsdale, David Brierly, Rita May, Nicholas Lane', 'Subtitles': 'English', 'Producers': 'Graham Massey, John Purdie, Mick Jackson, Peter Wolfes', 'Studio': 'BBC', 'Writers': 'Barry Hines', 'Number of discs': '1'}\nReview Text: This film was released in the fall of 1984 a year later after ABC television's &#34;The Day After&#34;.<br />The producers absolutely did their homework: various levels of radiation; psychological behavior; martial law.The blips of the scientific, psychological,and biological information during the film personified the conditions the actors (outstanding job) were portraying. I wish the dvd had interviews of the cast. Note: the dvd format is non-US thus the dvd prompts you how many times you can watch it on their format.\nReview Title: best nuclear war movie during the cold war 1980s\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Weather Underground\nReview Date: 2013/09/28\nStore: Lili Taylor  (Actor),     Pamela Z  (Actor),     Sam Green  (Director),     Bill Siegel  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['Product Description', 'Hello. I m going to read a declaration of a state of war...Within the next 14 days we will attack a symbol or institution of American injustice --Bernardine Dohrn', 'Thirty years ago, with these words, a group of young American radicals called The Weathermen announced their intention to overthrow the U.S. government. Fueled by outrage over the Vietnam War and racism in America, they went undergound during the 1970s, bombing targets across the country that they felt symbolized the real violence that the U.S. government and capitalist power were wreaking throughout the world. From pitched battles with police on Chicago s city streets, to bombing the U.S. Capitol building, to breaking acid-guru Timothy Leary out of prison, this carefully organized clandestine network attempted to incite a national revolution, while successfully evading one of the largest FBI manhunts in history.', 'One of the top documentaries of the year, this award-winning film interweaves extensive archival material with modern-day interviews to explore the incredible story of The Weather Underground. As former members reflect candidly about the idealistic passion that drove them to bring the war home, they paint a compelling portrait of troubled and revolutionary times, with unexpected and often striking connections to the current world situation.', 'Special Features:', 'Commentary From Former Weathermen Bernardine Dohrn and Bill Ayers; Filmmaker Commentary; Original Weathermen Audio Communiques; Bonus Film on Former Weatherman David Gilbert: A Lifetime of Struggle; Excerpt from Emile de Antonio film Underground; Filmmaker Biographies; Filmmaker Statement; Spanish Subtitles; Interactive Menus; Scene Selection', 'Amazon.com', \"The key players in the radical movement known as the Weather Underground are skillfully brought to life in this Oscar-nominated documentary. The Weathermen were born of sixties protest, but took their scheme to overthrow the U.S. government to especially violent extremes. Never a well-populated movement, the Underground petered out as its leaders aged during the seventies; by decade's end, weary of hiding, most of them had turned themselves over to the authorities. That journey, by which a fire-breathing revolutionary such as Bernadine Dohrn became a (still fiery) gray-haired wife and mother, is an intriguing one. This film, rich in period footage (and some unnecessary sensationalism) captures the era somewhat broadly. But the present-day interviews with the participants, contrasted with their radical selves, provides an exceptionally detailed look inside the organization itself. It's not a nostalgic look back, and the overall mood is sobering rather than celebratory. Lili Taylor provides the narration.\", '--Robert Horton', 'Review', '. . . Gripping . . . the filmmakers raise some disturbing and highly relevant questions into the psychopathology of terrorism. --The New York Times. . . a fascinating window into American political history --The Washington PostAn important historical document thats also riveting entertainment. --Time Out New York', 'See more']\nAverage Rating: 4.4\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Contributor': 'Sam Green, Pamela Z, Lili Taylor, Jim Lange, Bill Siegel', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.2 Ounces', 'Director': 'Sam Green, Bill Siegel', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 25, 2004', 'Actors': 'Lili Taylor, Pamela Z, Jim Lange', 'Subtitles': 'Spanish', 'Studio': 'Docurama', 'Number of discs': '1'}\nReview Text: Very surprised no one had ever done documentary on this group until now. The film does not at all glorify them, the directors simply told a story of why these American college students simply wanted to stop the senseless armed conflict in Vietnam and their stance against oppression and racism in America. While I don't agree with their politics i.e., communism, and their unrealistic premise of the majority of Americans would violently revolt against the American government, their commitment ( by death if necessary) to the cause for social change, as told by the director, is very engaging!! I absolutely can't get enough of Weatherman Niomi Jaffee's quote early in the film: &#34; if you sit in your little white house and go to your little  white job and allow the country you live in to murder people, and you sit there and don't do anything about it that's violence&#34;...if one is not part of the solution they're part of the problem. In the director's commentary, the director said when he interviewed the group said that they didn't want to be &#34;good Germans&#34; (in relation to Jaffe's quote)---wow!!<br /><br />I was only five years old when the group went underground, officially,in 1970 after the townhouse explosion (I had my own problems with racism) but I had heard of the name around 1975 and in 1980 when most of charges (the many bombings the group committed)were dropped because of arrogant, stupid, and corrupt tactics of the FBI.<br /><br />Too bad these directors, although nominated, didn't win the academy award for best documentary film---and these directors were not born during that time!! Any unearthed story from the turbulent 1960s that would educate today's young adults in order to further civilize and clean up bad behavior is alright by me.  Great job fellas!!\nReview Title: A story long over due. Great Job!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Halls Of Anger\nReview Date: 2014/11/06\nCategories: Drama\nProduct Description: ['When an African American ex-basketball player becomes vice principal at an inner city school in his hometown, he comes face to face with the challenging problems of desegregation.']\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['BogartPaul'], 'Producers': ['Herbert Hirschman', 'Walter Mirisch'], 'Starring': ['Calvin Lockhart', 'Janet MacLachlan', 'Jeff Bridges']}\nReview Text: Horrible behavior of American teenagers in the 1970's . The acting by all was fantastic, especially, Jeff Bridges and Rob Reiner.Remembered a bits and pieces of it on late night television in mid-seventies. I was too young to see it  the theaters. Just as well I was living it myself. Not in the US but in Toronto, Ontario, Canada--not as violent but the name calling was prevalent. Being a child that grew up in the 1970's it was just a terrible time as far as race relations.  Nevertheless, the film captured the  savagery and primitive  behavior of the time period of 1970 at the time of the US secondary school busing enactment.<br /><br />Didn't understand the point of why the black girls were ripping  the  white girl's close off? A very eerie scene!!! Probably a reaction to black men would possibly pay more attention to her for various reasons, coupled with black women's insecurity of the alleged notion of the western culture's standard of beauty is caucasian. Regardless the scene did it's job of capturing the viewer's emotions.<br /><br />Dare I say, and it still stands today, when a women who are clearly more attractive than a certain mass of women, the low self-esteem and/or not so attractive women get attention starved and feel angry and scared of being ostracized and, worse case, they believe, they'll die alone.<br /><br />Perhaps this film should be archived in the US National Film Registry.\nReview Title: Just an Ugly time for Black Americans in the early 1970's, and the film captured it.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The War Game / Culloden [DVD]\nReview Date: 2016/01/28\nStore: Olivier Espitalier-Noel  (Actor),     George McBean  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nAverage Rating: 4.2\nProduct Details: {'Format': 'DVD, NTSC, Black & White', 'Contributor': 'Peter Watkins, Olivier Espitalier-Noel, Robert Oates, Kathy Staff, Michael Aspel, Peter Graham, George McBeanPeter Watkins, Olivier Espitalier-Noel, Robert Oates, Kathy Staff, Michael Aspel, Peter Graham, George McBean   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Director': 'Peter Watkins', 'Media Format': 'DVD, NTSC, Black & White', 'Run time': '2 hours', 'Release date': 'July 25, 2006', 'Actors': 'Olivier Espitalier-Noel, George McBean, Robert Oates, Peter Watkins, Michael Aspel', 'Studio': 'Project X', 'Writers': 'Peter Watkins', 'Number of discs': '1'}\nReview Text: Your watching a fictional biography where a reporter is interviewing people before and after a nuclear strike in an English town in 1965.<br />Its ok given being desensitized by post 9/11 and watching Threads and the The Day After in 1984 as a teenager. It does mention current events such as Vietnam,LBJ interestingly.<br /><br />One Of the scenes where people were moved to people's houses and the women asked the cop if the people are &#34;colored&#34;. I had to roll my eyes up at that stupid girl's comment, but that was the behavior at that time.<br /><br />But keeping in mind this was 1965, not long after the Cuban missile crisis, this film would freak anyone out. It's less than an hour long. There's much commentary between scenes with a reporters interviewing civilians like a documentary but the reporter was also acting.<br /><br />It was hard to take seriously this film because the actresses'  hair seemed to be exempted from any radiation let alone dirt in some scenes. YouTube personality Tommy Sotomayor's takes on black women's obsession with weave would have a field day with this one.<br /><br />But actors, actresses and writers did their homework to capture the pompous ignorance of the civilized before the catastrophe then the raw emotion of the destress, despair and horror and how civil defense is pointless. With the exception of the hair issue, it's a black and white short version of Threads. But it was well-written with the all the intense camera angles at that which are common today. Winning the Oscar in 1967 as a documentary film (yah I know but that's what IMDB says) is well deserved.\nReview Title: It's hard to take this movie seriously when the women's beehive hair appears in place after a nuclear explosion.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cinematic Titanic LIVE: East Meets Watts\nReview Date: 2016/04/24\nStore: Joel Hodgson  (Actor),     Trace Beaulieu  (Actor),     Sharp/Ford  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Kung Fu hits the streets! Young Larry Chin arrives from China looking for his long-lost brother and stumbles into some shady characters that'd just as soon see him go home - or get dead. He crosses paths with Stud Brown, and the two become an unlikely duo as they fight to clean up the 'hood, and make time for some lady loves they meet along the way. And hang on tight for the surprise twist ending. It's all living color kungsploitation glory, live with Cinematic Titanic.\"]\nAverage Rating: 4.3\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Sharp/Ford', 'Media Format': 'Color, Live, Full Screen', 'Run time': '1 hour and 30 minutes', 'Actors': 'Joel Hodgson, Trace Beaulieu, Frank Conniff, Mary Jo Pehl, J. Elvis Weinstein', 'Producers': 'Cinema Titan LLC', 'Language': 'Unqualified (Stereo)', 'Studio': 'Cinema Titan, LLC'}\nReview Text: The first live version of the MST3000 cast. Most of the jokes references events and television shows from the 1970's e.g., &#34;Barney, Wojo and Harris are fighting again&#34;, (Barney Miller Show)...&#34;It's Richard Roundtree's Birthday&#34; (movie Shaft, 1971).\nReview Title: Great 1970s references...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Live in L.A. (DVD)\nReview Date: 2019/05/19\nStore: Minnemann, Marco  (Actor),     Drum Workshop  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Music Videos & Concerts\nProduct Description: ['Directed by Jonathan Launer. Starring Marco Minnemann.']\nAverage Rating: 3.7\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Contributor': 'Minnemann, Marco, Drum Workshop', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Item model number': '77-4MMLADVD', 'Director': 'Drum Workshop', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 10, 2007', 'Actors': 'Minnemann, Marco', 'Studio': 'Alfred Music', 'Number of discs': '1'}\nReview Text: Had to take it back because it wasn't the 1980s version of Willam Petersen and William Defore.\nReview Title: It's not the 1980s version by direct William Fredkin\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1st and Ten - Complete Collection\nReview Date: 2019/05/19\nStore: Delta Burke  (Actor),     various  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Meet the California Bulls. They may not be the #1 football team in the league, but nobody does it better when it comes to outrageous exploits and sexy escapades. Join seductive owner Diane Barrow (Delta Burke) as she leads her team through a minefield of hilarious hijinks on and off the gridiron. And remember, whether the quarterback is getting sacked - or getting caught in the sack with a pair of cheerleaders, the object of the game is always the same: To Score!']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Delta Burke, various', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'MFR683904451422#VG', 'Director': 'various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '40 hours', 'Release date': 'January 24, 2006', 'Actors': 'Delta Burke', 'Studio': 'Tango Entertainment', 'Number of discs': '1'}\nReview Text: Some nudity--which is good. To see O.J. do visiting a prison, in one episode--- the irony.\nReview Title: The comedy is not  very good...but there is nudity\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The FBI: The Complete Sixth Season\nReview Date: 2019/05/19\nStore: Efrem Zimbalist, Jr.  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['At the dawn of the Seventies the Culture War captured as much attention as the Cold War, and the storylines seen in this sixth season of The FBI (drawn from real Bureau files) reflected this. While still on the watch for saboteurs and spies acting as agents for foreign powers, the dedicated crimebusters of the Bureau, as personified by Inspector Erskine (Efrem Zimbalist, Jr.), Special Agent Colby (William Reynolds), and Assistant Director Ward (Philip Abbott) were just as likely to be tasked with tracking down psychotic Vietnam veterans or stopping college kids with a terrorist bent. Among the all-star actors battling the FBI as kidnappers, bank robbers, and extortionist or as the innocent victims whose aid Erskine and co. come to, can be found Martin Sheen, Joan Van Ark, Billy Dee Williams, Robert Loggia, Bradford Dillman, Dabney Coleman, Suzanne Pleshette, and William Shatner (as a rogue customs officer turned drug dealer!).']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'NTSC', 'Contributor': 'Efrem Zimbalist, Jr.', 'Language': 'English', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': 'WARA688562DVD', 'Media Format': 'NTSC', 'Run time': '21 hours and 40 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Efrem Zimbalist, Jr.', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: I know it was the sign of the times, but the orchestra music in the background of most scenes is annoying. Funny to see well known actors of today appear in this series back in the early 1970s (so young).\nReview Title: Too much background music.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/05/20\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rod Holcomb', 'Christian I. Nyby II', 'Alan J. Levi', 'Daniel Haller', 'Donald P. Bellisario', 'Vince Edwards', 'Richard A. Colla', 'Winrich Kolbe'], 'Producers': ['Michael Sloan'], 'Studio': ['NBCUniversal']}\nReview Text: It does look good in digital viewing.\nReview Title: Great show...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/06/15\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ariel Vromen'], 'Producers': ['Ehud Bleiberg'], 'Starring': ['Michael Shannon', 'Winona Ryder', 'Chris Evans'], 'Studio': ['Millennium Entertainment']}\nReview Text: The movie does a great job in covering the real life biography of Richard Kuklinski.\nReview Title: Actor does a good job mimicking the real person\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Nuclear Football\nReview Date: 2019/06/15\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"Considered the world's most dangerous handbag, its contents enable the U.S. President to authorize a nuclear launch anytime, anywhere. Carried by a military aide, the President's Emergency Satchel, commonly called the Nuclear Football, is always within reach, whenever the President leaves the White House, whether for a jog or on a state visit abroad. From creation during the Cold War years of the Kennedy Administration to today, we detail the Football's history, protocol, safeguards, and rare mishaps.\"]\nAverage Rating: 2.0\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'NTSC', 'Run time': '50 minutes', 'Release date': 'November 1, 2004', 'Producers': 'Bill Brummel Productions', 'Studio': 'A&E Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The disk label is too hight that it jams the CD device. If it doesn't slide in easily, send it back. Aside from that great documentary of the history of the reasons why this device was need and some of the funny, well not so,  how the foot was temporarily lost; one President losing his authenticator card; and the selection process of being a military attache (the person who in charge of the football). Surprised the NFL network hasn't or at least yet written their own feature story of the one football no one wants to fumble.\nReview Title: Be careful of the disk label. Operation drop kick, thus you need a football on which to do it..\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Winter Soldier\nReview Date: 2019/10/19\nStore: Rusty Sachs  (Actor),     Joe Bangert  (Actor),     n/a  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'January 31, 1971. More than 125 Vietnam veterans, representing every major combat unit to see action, gathered in Detroit to heal a nation... and themselves. They risked everything to talk about the atrocities they had committed or witnessed in the presence of officers while stationed in Vietnam. These veterans saw themselves as winter soldiers battling against the wrongs of the war and the brutal training that had made them capable of unthinkable violence. Eighteen filmmakers calling themselves the Winterfilm Collective - including Barbara Kopple (Harlan County, USA), Robert Fiore (Pumping Iron) and Lucy Massie Phenix (You Got to Move) - captured this extraordinary event. Rarely seen since its 1972 Cannes premiere, Winter Soldier has been called one of the most powerful anti-war films ever made and remains to this day a remarkable plea for peace.', 'Amazon.com', 'The more things change, the more they stay the same. Thus it should come as little surprise that while the events described in', 'Winter Soldier', 'took place during the Vietnam conflict, the 2006 home video release of this 1972 documentary more or less coincides with recent, eerily similar revelations regarding the activities of U.S. military personnel stationed in Iraq, including the Abu Ghraib prison scandal and the alleged slaughter of civilians in the town of Haditha. The film centers on a day in January, 1971, when more than 100 former soldiers turned up at a motel in Detroit to give testimony as part of an investigation sponsored by a group calling itself Vietnam Veterans Against the War. Their stories are genuinely chilling, as they matter-of-factly describe civilians being thrown from helicopters, villages burned, children shot, women raped, and innocent people tortured, maimed (cutting off their ears was popular), or even skinned; the notorious My Lai massacre of 1968 was apparently more the rule than the exception. Some eighteen documentary filmmakers took part in the making of this production, including Barbara Kopple (', 'Harlan County, U.S.A.', ') and Robert Fiore (', 'Pumping Iron', '). But there is no great artistry on display here--the film is mostly a succession of talking heads, appearing in grainy black & white (there are also a few photographs and occasional color film footage shot in Vietnam) and recounting how they were brainwashed into believing that the atrocities in which they participated were \"in the best interests of our nation,\" as one puts it, especially since \"it wasn\\'t like (the Vietnamese) were human.\" Unlike Emile de Antonio\\x92s', 'In the Year of the Pig', ',', 'Winter Soldier', \"gives us nothing from the other side--the opposition to the opposition, if you will. All we have are the vets' terrible (and highly credible) tales of how officers who witnessed or took part in these horrors wrote them off as Standard Operating Procedure. Strong stuff, but the film starts to become repetitive and ultimately tedious after it passes the one hour mark. The abundance of bonus features, including a current interview with the filmmakers and three shorter films addressing the same theme as the main feature, will be of interest mainly to gluttons for punishment.\", '--Sam Graham', 'Review', '\"A live hand grenade brought home from a distant battlefield.\" --', 'David M. Halbfinger,', 'New York Times', '\"Dazzling! An eloquent, unforgettable tale of profound moral reckoning. Everyone should see WINTER SOLDIER!\" --', 'Ann Hornaday,', 'Washington Post', '\"Like Peter Davis\\x92s HEARTS AND MINDS and Michael Moore\\x92s FAHRENHEIT 9/11\\x85 a wake-up call\\x85 an important, lacerating document.\" --', 'Fernando F. Croce,', 'Slant Magazine', '\"One of the most devastating antiwar films ever made!\" --', 'David Fear,', 'Time Out New York', '\"WINTER SOLDIER \\x85 should be a voter registration requirement!\" --', 'Michael Atkinson,', 'Village Voice', 'See more']\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.96 Ounces', 'Item model number': 'Mile00100', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Black & White', 'Run time': '1 hour and 36 minutes', 'Release date': 'May 30, 2006', 'Actors': 'Rusty Sachs, Joe Bangert, Scott Shimabukuro, Kenneth Campbell, Scott Camil', 'Subtitles': 'German, French', 'Studio': 'Milestone Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The confessions of the senseless killing for superficial reasons was mind boggling! However these men were placed in situations where there was noend goal in site at all i.e., e.g, if we surround Hanoi and capture the 4 VC generals the war is over---no.  I don't believe they were wimps or crybabies, they had a conscience due to the war crimes they either witnessed or experienced;----it needed to be told!!<br /><br />Without spilling the meat of the video too much, it was very well written and, In my opinion, should be required viewing in all the US service academies (probably is).\nReview Title: The hidden truth of the atrocities committed by these guys; but they were set up to fail.\nRating: 5.0\n--------------------------------------------------",
  "reference": "Mystery Science Theater 3000 - Mitchell\nAshby, John  (Actor),     Baker, Joe Don  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Rare Mystery Science theater 3000 episode where Joel and the bots riff on the awful film \"Mitchell\" starring Joe Don Baker']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 20, 2001', 'Actors': 'Ashby, John, Baker, Joe Don, Balsam, Martin, Barnes, Rayford, Bass, Todd', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Rhino Theatrical', 'Number of discs': '1'}\nIt's obvious  that \"Mitchell\" was a copy of the Shaft movie and short-lived television series: his own man; rebel within law enforcement while sticking it to the man;sex machine (sort of); and willing to take changes regardless of the odds. BUT the cast of MST3000 rip it to shreds.  With the exception of Gypsy (extremely annoying), the cast has some good one liners: \"Mr Treveno has been hit again\" ; \"he just landed just short of the green\"; \"fresh panties all around\"; and  Tom Servo's obsession with Joe Don Baker's eating/farting. One of the best!!!\nYes One of the Best\nRoom 222: Season Two [DVD]\nLloyd Haynes  (Actor),     Denise Nicholas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n[\"A compelling series about life at a multiracial Los Angeles high school, Room 222 left an indelible mark on popular culture by using the half-hour form to explore socially relevant issues (more than a year before Norman Lear's other groundbreaking shows—All in the Family and Maude) and by starting the still-popular trend of high school television series. Created by the now-legendary James L. Brooks (The Mary Tyler Moore Show, Rhoda, The Simpsons), the program was praised for dealing realistically with such subjects as racism, sexism, illiteracy, guns in school and drugs. Pete Dixon (Lloyd Haynes) is a dedicated and popular history teacher who fights the good fight on the side of his students. Joining him in his idealistic approach to education are guidance counselor Liz McIntyre (Denise Nicholas) and student teacher Alice Johnson (Karen Valentine). Experienced and slightly world-weary principal Seymour Kaufman (Michael Constantine) provides a balance to the youthful idealism of the '60s cultural revolution—but at the end of the day, everyone is on the side of the students. Season Two guest stars include Richard Dreyfuss, Kurt Russell, Cindy Williams, Chuck Norris, Tim Matheson and Ed Begley, Jr.\", ']]>']\n{'Genre': 'Drama/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Lloyd Haynes, James L. Brooks, Michael Constantine, Karen Valentine, Denise Nicholas', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '10 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'DSF11387D', 'Media Format': 'Subtitled, NTSC', 'Run time': '10 hours and 30 minutes', 'Release date': 'April 28, 2020', 'Actors': 'Lloyd Haynes, Denise Nicholas, Michael Constantine, Karen Valentine', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nGreat show... a far cry from the predicable cookie cutter scrips of contemporary drama. It's interesting to view the students or rather the actors portraying the students' feelings of anxiety and despair in the society i.e., the assassinations, the riots, conscription  and how their views mirrored the militant/counter culture groups of that time period (e.g., The Black Panthers; The Weather Underground; Brothers of Internal Love, FLQ). And to watch the following actors in the early stages of their careers and how skinny they were was comical:  i.e. , Teri Garr; Glynn Turman- A Different World, The Wire; Rob Riener; Cindy Williams--Lavern and Shirley; Ed Bagley Jr. and Kurt Russell.\nWhat Memories of the Turbulent late 1960's\nMiami Vice: Season 4\nDon Johnson  (Actor),     Philip Michael Thomas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Hit the streets again with Don Johnson as James \"Sonny\" Crockett and Philip Michael Thomas as Ricardo Tubbs, two of the world\\'s slickest undercover cops, in Season Four of Miami Vice! Oscar-nominated director Michael Mann and Primetime Emmy Award-winning producer Dick Wolf bring you all 22 heart-pounding, fashion-forward episodes in this must-own 5-disc set. Joining the iconic detective duo in Miami\\'s steamy underworld is a powerful roster of guest stars, including James Brown, Julia Roberts, and Chris Rock. Miami Vice is an action-packed show whose \"influence is still evident\" (The New York Times).']\n{'Genre': 'Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Edward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael ThomasEdward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael Thomas  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.6 Ounces', 'Item model number': '61021031', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '17 hours and 34 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Don Johnson, Philip Michael Thomas, Edward James Olmos, Sheena Easton, Saundra Santiago', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nWon't be disappointed. However, there are not any behind the scenes interviews if one is to inquire. The quality of the pictures are quite good.\nClassic 1980's television\nBirdman and the Galaxy Trio: The Complete Series (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Birdman and the Galaxy Trio: The Complete Series (DVD)', 'Featuring the episodes in the three-segment form as they originally aired, these popular retro hits take the action around the world and into outer space! First, winged hero Birdman harnesses the power of the sun to fight criminal masterminds like Number One, Vulturo and Dr. Millenium. Then, cosmic crusaders Gravity Girl, Vapor Man and Meteor Man – better known as the Galaxy Trio –serve up justice in space as they travel the universe eradicating evil and procuring peace across the cosmos. And finally, it’s more Birdman with his trusty eagle Avenger and his namesake battle cry that strikes fear into the hearts of his enemies. Fly away with these favorite retro heroes as they deliver old-school justice in this 2-disc collector’s dream compilation.', ']]>']\n{'Genre': 'Animation, Action & Adventure', 'Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Contributor': 'Various', 'Language': 'English (Mono), Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.3 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Run time': '7 hours', 'Release date': 'July 17, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nUsed to watch the reruns in 1971-1972 on late Saturday afternoons on CBC television in Toronto. Had to wonder who i.e., Bill Hanna, Joe Barbera or Keith Andes, voice of Birdman, thought of the distinctive battle cry!!  Too bad the show was politically silent to the current events of time, i.e., 1967. Sadly Mr. Andes completed suicide in 2005 because of extreme ill heath (source: Internet movie data base).\nWhat imagination BillHanna and Joe Barbera had back in the late 19060's\nVietnam: The Ten Thousand Day War\nRichard Basehart  (Actor),     Alexander Haig  (Actor)    Format: DVD\nMovies & TV, Featured Categories, DVD, Military & War\n['Known as history s first \"living room war,\" The Vietnam conflict is presented on 4 DVDs with clarity, authority and insight in this nearly 10-hour documentary. Written by Pulitzer Prize-winning journalist Peter Arnett and narrated by Richard Basehart, our set covers the entire conflict, examining the shifting attitudes of the United States toward Vietnam from 1945, when the battleground was known as French Indochina, to 1975, when Saigon fell to the North Vietnamese.']\n{'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'John Ehrlichman, Alexander Haig, Richard Basehart, Doris Kearns Goodwin, Peter Arnett, William Colby', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '26401918', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '10 hours', 'Release date': 'April 2, 2013', 'Actors': 'Richard Basehart, Alexander Haig, John Ehrlichman, William Colby, Doris Kearns Goodwin', 'Studio': 'Time Life Entertainment / VSC', 'Writers': 'Peter Arnett', 'Number of discs': '1'}\nJust excellent file footage of the various battles and the anti-war protests. Would be a great source for anyone writing a college thesis.\nGreat Series from the 1980's. Great Interviews!!\nThreads [NON-USA FORMAT, PAL, Reg.2&4 Import - Great Britain]\nKaren Meagher  (Actor),     Reece Dinsdale  (Actor),     Mick Jackson  (Director, Producer)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Documentary-style account of a nuclear attack on Sheffield during the 1980s. Ruth Beckett (Karen Meagher) and Jimmy Kemp (Reece Dinsdale) live in Sheffield and are busy preparing for their upcoming marriage. When Russia invades Iran, hoping to bring the country under its influence, tension is increased throughout the West, and particularly at the local R.A.F. base. Blissfully unconcerned with world events, Ruth and Jimmy carry on with their wedding preparations. However, when two Russian ICBM's hit Sheffield, turning the landscape into a radioactive desert, Ruth and Jimmy are forced to face up to the harsh reality of life in the aftermath of a nuclear explosion.\"]\n{'Genre': 'Documentary', 'Format': 'Import, PAL', 'Contributor': 'June Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham MasseyJune Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham Massey   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.48 x 5.35 x 0.63 inches; 2.82 Ounces', 'Director': 'Mick Jackson', 'Media Format': 'Import, PAL', 'Run time': '1 hour and 53 minutes', 'Actors': 'Karen Meagher, Reece Dinsdale, David Brierly, Rita May, Nicholas Lane', 'Subtitles': 'English', 'Producers': 'Graham Massey, John Purdie, Mick Jackson, Peter Wolfes', 'Studio': 'BBC', 'Writers': 'Barry Hines', 'Number of discs': '1'}\nThis film was released in the fall of 1984 a year later after ABC television's &#34;The Day After&#34;.<br />The producers absolutely did their homework: various levels of radiation; psychological behavior; martial law.The blips of the scientific, psychological,and biological information during the film personified the conditions the actors (outstanding job) were portraying. I wish the dvd had interviews of the cast. Note: the dvd format is non-US thus the dvd prompts you how many times you can watch it on their format.\nbest nuclear war movie during the cold war 1980s\nThe Weather Underground\nLili Taylor  (Actor),     Pamela Z  (Actor),     Sam Green  (Director),     Bill Siegel  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Product Description', 'Hello. I m going to read a declaration of a state of war...Within the next 14 days we will attack a symbol or institution of American injustice --Bernardine Dohrn', 'Thirty years ago, with these words, a group of young American radicals called The Weathermen announced their intention to overthrow the U.S. government. Fueled by outrage over the Vietnam War and racism in America, they went undergound during the 1970s, bombing targets across the country that they felt symbolized the real violence that the U.S. government and capitalist power were wreaking throughout the world. From pitched battles with police on Chicago s city streets, to bombing the U.S. Capitol building, to breaking acid-guru Timothy Leary out of prison, this carefully organized clandestine network attempted to incite a national revolution, while successfully evading one of the largest FBI manhunts in history.', 'One of the top documentaries of the year, this award-winning film interweaves extensive archival material with modern-day interviews to explore the incredible story of The Weather Underground. As former members reflect candidly about the idealistic passion that drove them to bring the war home, they paint a compelling portrait of troubled and revolutionary times, with unexpected and often striking connections to the current world situation.', 'Special Features:', 'Commentary From Former Weathermen Bernardine Dohrn and Bill Ayers; Filmmaker Commentary; Original Weathermen Audio Communiques; Bonus Film on Former Weatherman David Gilbert: A Lifetime of Struggle; Excerpt from Emile de Antonio film Underground; Filmmaker Biographies; Filmmaker Statement; Spanish Subtitles; Interactive Menus; Scene Selection', 'Amazon.com', \"The key players in the radical movement known as the Weather Underground are skillfully brought to life in this Oscar-nominated documentary. The Weathermen were born of sixties protest, but took their scheme to overthrow the U.S. government to especially violent extremes. Never a well-populated movement, the Underground petered out as its leaders aged during the seventies; by decade's end, weary of hiding, most of them had turned themselves over to the authorities. That journey, by which a fire-breathing revolutionary such as Bernadine Dohrn became a (still fiery) gray-haired wife and mother, is an intriguing one. This film, rich in period footage (and some unnecessary sensationalism) captures the era somewhat broadly. But the present-day interviews with the participants, contrasted with their radical selves, provides an exceptionally detailed look inside the organization itself. It's not a nostalgic look back, and the overall mood is sobering rather than celebratory. Lili Taylor provides the narration.\", '--Robert Horton', 'Review', '. . . Gripping . . . the filmmakers raise some disturbing and highly relevant questions into the psychopathology of terrorism. --The New York Times. . . a fascinating window into American political history --The Washington PostAn important historical document thats also riveting entertainment. --Time Out New York', 'See more']\n{'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Contributor': 'Sam Green, Pamela Z, Lili Taylor, Jim Lange, Bill Siegel', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.2 Ounces', 'Director': 'Sam Green, Bill Siegel', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 25, 2004', 'Actors': 'Lili Taylor, Pamela Z, Jim Lange', 'Subtitles': 'Spanish', 'Studio': 'Docurama', 'Number of discs': '1'}\nVery surprised no one had ever done documentary on this group until now. The film does not at all glorify them, the directors simply told a story of why these American college students simply wanted to stop the senseless armed conflict in Vietnam and their stance against oppression and racism in America. While I don't agree with their politics i.e., communism, and their unrealistic premise of the majority of Americans would violently revolt against the American government, their commitment ( by death if necessary) to the cause for social change, as told by the director, is very engaging!! I absolutely can't get enough of Weatherman Niomi Jaffee's quote early in the film: &#34; if you sit in your little white house and go to your little  white job and allow the country you live in to murder people, and you sit there and don't do anything about it that's violence&#34;...if one is not part of the solution they're part of the problem. In the director's commentary, the director said when he interviewed the group said that they didn't want to be &#34;good Germans&#34; (in relation to Jaffe's quote)---wow!!<br /><br />I was only five years old when the group went underground, officially,in 1970 after the townhouse explosion (I had my own problems with racism) but I had heard of the name around 1975 and in 1980 when most of charges (the many bombings the group committed)were dropped because of arrogant, stupid, and corrupt tactics of the FBI.<br /><br />Too bad these directors, although nominated, didn't win the academy award for best documentary film---and these directors were not born during that time!! Any unearthed story from the turbulent 1960s that would educate today's young adults in order to further civilize and clean up bad behavior is alright by me.  Great job fellas!!\nA story long over due. Great Job!!!!\nHalls Of Anger\nDrama\n['When an African American ex-basketball player becomes vice principal at an inner city school in his hometown, he comes face to face with the challenging problems of desegregation.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['BogartPaul'], 'Producers': ['Herbert Hirschman', 'Walter Mirisch'], 'Starring': ['Calvin Lockhart', 'Janet MacLachlan', 'Jeff Bridges']}\nHorrible behavior of American teenagers in the 1970's . The acting by all was fantastic, especially, Jeff Bridges and Rob Reiner.Remembered a bits and pieces of it on late night television in mid-seventies. I was too young to see it  the theaters. Just as well I was living it myself. Not in the US but in Toronto, Ontario, Canada--not as violent but the name calling was prevalent. Being a child that grew up in the 1970's it was just a terrible time as far as race relations.  Nevertheless, the film captured the  savagery and primitive  behavior of the time period of 1970 at the time of the US secondary school busing enactment.<br /><br />Didn't understand the point of why the black girls were ripping  the  white girl's close off? A very eerie scene!!! Probably a reaction to black men would possibly pay more attention to her for various reasons, coupled with black women's insecurity of the alleged notion of the western culture's standard of beauty is caucasian. Regardless the scene did it's job of capturing the viewer's emotions.<br /><br />Dare I say, and it still stands today, when a women who are clearly more attractive than a certain mass of women, the low self-esteem and/or not so attractive women get attention starved and feel angry and scared of being ostracized and, worse case, they believe, they'll die alone.<br /><br />Perhaps this film should be archived in the US National Film Registry.\nJust an Ugly time for Black Americans in the early 1970's, and the film captured it.\nThe War Game / Culloden [DVD]\nOlivier Espitalier-Noel  (Actor),     George McBean  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n{'Format': 'DVD, NTSC, Black & White', 'Contributor': 'Peter Watkins, Olivier Espitalier-Noel, Robert Oates, Kathy Staff, Michael Aspel, Peter Graham, George McBeanPeter Watkins, Olivier Espitalier-Noel, Robert Oates, Kathy Staff, Michael Aspel, Peter Graham, George McBean   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Director': 'Peter Watkins', 'Media Format': 'DVD, NTSC, Black & White', 'Run time': '2 hours', 'Release date': 'July 25, 2006', 'Actors': 'Olivier Espitalier-Noel, George McBean, Robert Oates, Peter Watkins, Michael Aspel', 'Studio': 'Project X', 'Writers': 'Peter Watkins', 'Number of discs': '1'}\nYour watching a fictional biography where a reporter is interviewing people before and after a nuclear strike in an English town in 1965.<br />Its ok given being desensitized by post 9/11 and watching Threads and the The Day After in 1984 as a teenager. It does mention current events such as Vietnam,LBJ interestingly.<br /><br />One Of the scenes where people were moved to people's houses and the women asked the cop if the people are &#34;colored&#34;. I had to roll my eyes up at that stupid girl's comment, but that was the behavior at that time.<br /><br />But keeping in mind this was 1965, not long after the Cuban missile crisis, this film would freak anyone out. It's less than an hour long. There's much commentary between scenes with a reporters interviewing civilians like a documentary but the reporter was also acting.<br /><br />It was hard to take seriously this film because the actresses'  hair seemed to be exempted from any radiation let alone dirt in some scenes. YouTube personality Tommy Sotomayor's takes on black women's obsession with weave would have a field day with this one.<br /><br />But actors, actresses and writers did their homework to capture the pompous ignorance of the civilized before the catastrophe then the raw emotion of the destress, despair and horror and how civil defense is pointless. With the exception of the hair issue, it's a black and white short version of Threads. But it was well-written with the all the intense camera angles at that which are common today. Winning the Oscar in 1967 as a documentary film (yah I know but that's what IMDB says) is well deserved.\nIt's hard to take this movie seriously when the women's beehive hair appears in place after a nuclear explosion.\nCinematic Titanic LIVE: East Meets Watts\nJoel Hodgson  (Actor),     Trace Beaulieu  (Actor),     Sharp/Ford  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Kung Fu hits the streets! Young Larry Chin arrives from China looking for his long-lost brother and stumbles into some shady characters that'd just as soon see him go home - or get dead. He crosses paths with Stud Brown, and the two become an unlikely duo as they fight to clean up the 'hood, and make time for some lady loves they meet along the way. And hang on tight for the surprise twist ending. It's all living color kungsploitation glory, live with Cinematic Titanic.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Sharp/Ford', 'Media Format': 'Color, Live, Full Screen', 'Run time': '1 hour and 30 minutes', 'Actors': 'Joel Hodgson, Trace Beaulieu, Frank Conniff, Mary Jo Pehl, J. Elvis Weinstein', 'Producers': 'Cinema Titan LLC', 'Language': 'Unqualified (Stereo)', 'Studio': 'Cinema Titan, LLC'}\nThe first live version of the MST3000 cast. Most of the jokes references events and television shows from the 1970's e.g., &#34;Barney, Wojo and Harris are fighting again&#34;, (Barney Miller Show)...&#34;It's Richard Roundtree's Birthday&#34; (movie Shaft, 1971).\nGreat 1970s references...\nLive in L.A. (DVD)\nMinnemann, Marco  (Actor),     Drum Workshop  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['Directed by Jonathan Launer. Starring Marco Minnemann.']\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Contributor': 'Minnemann, Marco, Drum Workshop', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Item model number': '77-4MMLADVD', 'Director': 'Drum Workshop', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 10, 2007', 'Actors': 'Minnemann, Marco', 'Studio': 'Alfred Music', 'Number of discs': '1'}\nHad to take it back because it wasn't the 1980s version of Willam Petersen and William Defore.\nIt's not the 1980s version by direct William Fredkin\n1st and Ten - Complete Collection\nDelta Burke  (Actor),     various  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Meet the California Bulls. They may not be the #1 football team in the league, but nobody does it better when it comes to outrageous exploits and sexy escapades. Join seductive owner Diane Barrow (Delta Burke) as she leads her team through a minefield of hilarious hijinks on and off the gridiron. And remember, whether the quarterback is getting sacked - or getting caught in the sack with a pair of cheerleaders, the object of the game is always the same: To Score!']\n{'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Delta Burke, various', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'MFR683904451422#VG', 'Director': 'various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '40 hours', 'Release date': 'January 24, 2006', 'Actors': 'Delta Burke', 'Studio': 'Tango Entertainment', 'Number of discs': '1'}\nSome nudity--which is good. To see O.J. do visiting a prison, in one episode--- the irony.\nThe comedy is not  very good...but there is nudity\nThe FBI: The Complete Sixth Season\nEfrem Zimbalist, Jr.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['At the dawn of the Seventies the Culture War captured as much attention as the Cold War, and the storylines seen in this sixth season of The FBI (drawn from real Bureau files) reflected this. While still on the watch for saboteurs and spies acting as agents for foreign powers, the dedicated crimebusters of the Bureau, as personified by Inspector Erskine (Efrem Zimbalist, Jr.), Special Agent Colby (William Reynolds), and Assistant Director Ward (Philip Abbott) were just as likely to be tasked with tracking down psychotic Vietnam veterans or stopping college kids with a terrorist bent. Among the all-star actors battling the FBI as kidnappers, bank robbers, and extortionist or as the innocent victims whose aid Erskine and co. come to, can be found Martin Sheen, Joan Van Ark, Billy Dee Williams, Robert Loggia, Bradford Dillman, Dabney Coleman, Suzanne Pleshette, and William Shatner (as a rogue customs officer turned drug dealer!).']\n{'Genre': 'Television, Television/Crime', 'Format': 'NTSC', 'Contributor': 'Efrem Zimbalist, Jr.', 'Language': 'English', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': 'WARA688562DVD', 'Media Format': 'NTSC', 'Run time': '21 hours and 40 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Efrem Zimbalist, Jr.', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '6'}\nI know it was the sign of the times, but the orchestra music in the background of most scenes is annoying. Funny to see well known actors of today appear in this series back in the early 1970s (so young).\nToo much background music.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rod Holcomb', 'Christian I. Nyby II', 'Alan J. Levi', 'Daniel Haller', 'Donald P. Bellisario', 'Vince Edwards', 'Richard A. Colla', 'Winrich Kolbe'], 'Producers': ['Michael Sloan'], 'Studio': ['NBCUniversal']}\nIt does look good in digital viewing.\nGreat show...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ariel Vromen'], 'Producers': ['Ehud Bleiberg'], 'Starring': ['Michael Shannon', 'Winona Ryder', 'Chris Evans'], 'Studio': ['Millennium Entertainment']}\nThe movie does a great job in covering the real life biography of Richard Kuklinski.\nActor does a good job mimicking the real person\nThe Nuclear Football\nRated:    NR    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"Considered the world's most dangerous handbag, its contents enable the U.S. President to authorize a nuclear launch anytime, anywhere. Carried by a military aide, the President's Emergency Satchel, commonly called the Nuclear Football, is always within reach, whenever the President leaves the White House, whether for a jog or on a state visit abroad. From creation during the Cold War years of the Kennedy Administration to today, we detail the Football's history, protocol, safeguards, and rare mishaps.\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'NTSC', 'Run time': '50 minutes', 'Release date': 'November 1, 2004', 'Producers': 'Bill Brummel Productions', 'Studio': 'A&E Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe disk label is too hight that it jams the CD device. If it doesn't slide in easily, send it back. Aside from that great documentary of the history of the reasons why this device was need and some of the funny, well not so,  how the foot was temporarily lost; one President losing his authenticator card; and the selection process of being a military attache (the person who in charge of the football). Surprised the NFL network hasn't or at least yet written their own feature story of the one football no one wants to fumble.\nBe careful of the disk label. Operation drop kick, thus you need a football on which to do it..\nWinter Soldier\nRusty Sachs  (Actor),     Joe Bangert  (Actor),     n/a  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Product Description', 'January 31, 1971. More than 125 Vietnam veterans, representing every major combat unit to see action, gathered in Detroit to heal a nation... and themselves. They risked everything to talk about the atrocities they had committed or witnessed in the presence of officers while stationed in Vietnam. These veterans saw themselves as winter soldiers battling against the wrongs of the war and the brutal training that had made them capable of unthinkable violence. Eighteen filmmakers calling themselves the Winterfilm Collective - including Barbara Kopple (Harlan County, USA), Robert Fiore (Pumping Iron) and Lucy Massie Phenix (You Got to Move) - captured this extraordinary event. Rarely seen since its 1972 Cannes premiere, Winter Soldier has been called one of the most powerful anti-war films ever made and remains to this day a remarkable plea for peace.', 'Amazon.com', 'The more things change, the more they stay the same. Thus it should come as little surprise that while the events described in', 'Winter Soldier', 'took place during the Vietnam conflict, the 2006 home video release of this 1972 documentary more or less coincides with recent, eerily similar revelations regarding the activities of U.S. military personnel stationed in Iraq, including the Abu Ghraib prison scandal and the alleged slaughter of civilians in the town of Haditha. The film centers on a day in January, 1971, when more than 100 former soldiers turned up at a motel in Detroit to give testimony as part of an investigation sponsored by a group calling itself Vietnam Veterans Against the War. Their stories are genuinely chilling, as they matter-of-factly describe civilians being thrown from helicopters, villages burned, children shot, women raped, and innocent people tortured, maimed (cutting off their ears was popular), or even skinned; the notorious My Lai massacre of 1968 was apparently more the rule than the exception. Some eighteen documentary filmmakers took part in the making of this production, including Barbara Kopple (', 'Harlan County, U.S.A.', ') and Robert Fiore (', 'Pumping Iron', '). But there is no great artistry on display here--the film is mostly a succession of talking heads, appearing in grainy black & white (there are also a few photographs and occasional color film footage shot in Vietnam) and recounting how they were brainwashed into believing that the atrocities in which they participated were \"in the best interests of our nation,\" as one puts it, especially since \"it wasn\\'t like (the Vietnamese) were human.\" Unlike Emile de Antonio\\x92s', 'In the Year of the Pig', ',', 'Winter Soldier', \"gives us nothing from the other side--the opposition to the opposition, if you will. All we have are the vets' terrible (and highly credible) tales of how officers who witnessed or took part in these horrors wrote them off as Standard Operating Procedure. Strong stuff, but the film starts to become repetitive and ultimately tedious after it passes the one hour mark. The abundance of bonus features, including a current interview with the filmmakers and three shorter films addressing the same theme as the main feature, will be of interest mainly to gluttons for punishment.\", '--Sam Graham', 'Review', '\"A live hand grenade brought home from a distant battlefield.\" --', 'David M. Halbfinger,', 'New York Times', '\"Dazzling! An eloquent, unforgettable tale of profound moral reckoning. Everyone should see WINTER SOLDIER!\" --', 'Ann Hornaday,', 'Washington Post', '\"Like Peter Davis\\x92s HEARTS AND MINDS and Michael Moore\\x92s FAHRENHEIT 9/11\\x85 a wake-up call\\x85 an important, lacerating document.\" --', 'Fernando F. Croce,', 'Slant Magazine', '\"One of the most devastating antiwar films ever made!\" --', 'David Fear,', 'Time Out New York', '\"WINTER SOLDIER \\x85 should be a voter registration requirement!\" --', 'Michael Atkinson,', 'Village Voice', 'See more']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.96 Ounces', 'Item model number': 'Mile00100', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Black & White', 'Run time': '1 hour and 36 minutes', 'Release date': 'May 30, 2006', 'Actors': 'Rusty Sachs, Joe Bangert, Scott Shimabukuro, Kenneth Campbell, Scott Camil', 'Subtitles': 'German, French', 'Studio': 'Milestone Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe confessions of the senseless killing for superficial reasons was mind boggling! However these men were placed in situations where there was noend goal in site at all i.e., e.g, if we surround Hanoi and capture the 4 VC generals the war is over---no.  I don't believe they were wimps or crybabies, they had a conscience due to the war crimes they either witnessed or experienced;----it needed to be told!!<br /><br />Without spilling the meat of the video too much, it was very well written and, In my opinion, should be required viewing in all the US service academies (probably is).\nThe hidden truth of the atrocities committed by these guys; but they were set up to fail.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Mystery Science Theater 3000 - Mitchell\nReview Date: 2012/02/05\nStore: Ashby, John  (Actor),     Baker, Joe Don  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\nProduct Description: ['Rare Mystery Science theater 3000 episode where Joel and the bots riff on the awful film \"Mitchell\" starring Joe Don Baker']\nAverage Rating: 4.6\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 20, 2001', 'Actors': 'Ashby, John, Baker, Joe Don, Balsam, Martin, Barnes, Rayford, Bass, Todd', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Rhino Theatrical', 'Number of discs': '1'}\nReview Text: It's obvious  that \"Mitchell\" was a copy of the Shaft movie and short-lived television series: his own man; rebel within law enforcement while sticking it to the man;sex machine (sort of); and willing to take changes regardless of the odds. BUT the cast of MST3000 rip it to shreds.  With the exception of Gypsy (extremely annoying), the cast has some good one liners: \"Mr Treveno has been hit again\" ; \"he just landed just short of the green\"; \"fresh panties all around\"; and  Tom Servo's obsession with Joe Don Baker's eating/farting. One of the best!!!\nReview Title: Yes One of the Best\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Room 222: Season Two [DVD]\nReview Date: 2012/11/25\nStore: Lloyd Haynes  (Actor),     Denise Nicholas  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: [\"A compelling series about life at a multiracial Los Angeles high school, Room 222 left an indelible mark on popular culture by using the half-hour form to explore socially relevant issues (more than a year before Norman Lear's other groundbreaking shows—All in the Family and Maude) and by starting the still-popular trend of high school television series. Created by the now-legendary James L. Brooks (The Mary Tyler Moore Show, Rhoda, The Simpsons), the program was praised for dealing realistically with such subjects as racism, sexism, illiteracy, guns in school and drugs. Pete Dixon (Lloyd Haynes) is a dedicated and popular history teacher who fights the good fight on the side of his students. Joining him in his idealistic approach to education are guidance counselor Liz McIntyre (Denise Nicholas) and student teacher Alice Johnson (Karen Valentine). Experienced and slightly world-weary principal Seymour Kaufman (Michael Constantine) provides a balance to the youthful idealism of the '60s cultural revolution—but at the end of the day, everyone is on the side of the students. Season Two guest stars include Richard Dreyfuss, Kurt Russell, Cindy Williams, Chuck Norris, Tim Matheson and Ed Begley, Jr.\", ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Lloyd Haynes, James L. Brooks, Michael Constantine, Karen Valentine, Denise Nicholas', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '10 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'DSF11387D', 'Media Format': 'Subtitled, NTSC', 'Run time': '10 hours and 30 minutes', 'Release date': 'April 28, 2020', 'Actors': 'Lloyd Haynes, Denise Nicholas, Michael Constantine, Karen Valentine', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nReview Text: Great show... a far cry from the predicable cookie cutter scrips of contemporary drama. It's interesting to view the students or rather the actors portraying the students' feelings of anxiety and despair in the society i.e., the assassinations, the riots, conscription  and how their views mirrored the militant/counter culture groups of that time period (e.g., The Black Panthers; The Weather Underground; Brothers of Internal Love, FLQ). And to watch the following actors in the early stages of their careers and how skinny they were was comical:  i.e. , Teri Garr; Glynn Turman- A Different World, The Wire; Rob Riener; Cindy Williams--Lavern and Shirley; Ed Bagley Jr. and Kurt Russell.\nReview Title: What Memories of the Turbulent late 1960's\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Miami Vice: Season 4\nReview Date: 2013/06/16\nStore: Don Johnson  (Actor),     Philip Michael Thomas  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Hit the streets again with Don Johnson as James \"Sonny\" Crockett and Philip Michael Thomas as Ricardo Tubbs, two of the world\\'s slickest undercover cops, in Season Four of Miami Vice! Oscar-nominated director Michael Mann and Primetime Emmy Award-winning producer Dick Wolf bring you all 22 heart-pounding, fashion-forward episodes in this must-own 5-disc set. Joining the iconic detective duo in Miami\\'s steamy underworld is a powerful roster of guest stars, including James Brown, Julia Roberts, and Chris Rock. Miami Vice is an action-packed show whose \"influence is still evident\" (The New York Times).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Edward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael ThomasEdward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael Thomas  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.6 Ounces', 'Item model number': '61021031', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '17 hours and 34 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Don Johnson, Philip Michael Thomas, Edward James Olmos, Sheena Easton, Saundra Santiago', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Won't be disappointed. However, there are not any behind the scenes interviews if one is to inquire. The quality of the pictures are quite good.\nReview Title: Classic 1980's television\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Birdman and the Galaxy Trio: The Complete Series (DVD)\nReview Date: 2013/07/11\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Birdman and the Galaxy Trio: The Complete Series (DVD)', 'Featuring the episodes in the three-segment form as they originally aired, these popular retro hits take the action around the world and into outer space! First, winged hero Birdman harnesses the power of the sun to fight criminal masterminds like Number One, Vulturo and Dr. Millenium. Then, cosmic crusaders Gravity Girl, Vapor Man and Meteor Man – better known as the Galaxy Trio –serve up justice in space as they travel the universe eradicating evil and procuring peace across the cosmos. And finally, it’s more Birdman with his trusty eagle Avenger and his namesake battle cry that strikes fear into the hearts of his enemies. Fly away with these favorite retro heroes as they deliver old-school justice in this 2-disc collector’s dream compilation.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation, Action & Adventure', 'Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Contributor': 'Various', 'Language': 'English (Mono), Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.3 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Run time': '7 hours', 'Release date': 'July 17, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nReview Text: Used to watch the reruns in 1971-1972 on late Saturday afternoons on CBC television in Toronto. Had to wonder who i.e., Bill Hanna, Joe Barbera or Keith Andes, voice of Birdman, thought of the distinctive battle cry!!  Too bad the show was politically silent to the current events of time, i.e., 1967. Sadly Mr. Andes completed suicide in 2005 because of extreme ill heath (source: Internet movie data base).\nReview Title: What imagination BillHanna and Joe Barbera had back in the late 19060's\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vietnam: The Ten Thousand Day War\nReview Date: 2013/08/05\nStore: Richard Basehart  (Actor),     Alexander Haig  (Actor)    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Military & War\nProduct Description: ['Known as history s first \"living room war,\" The Vietnam conflict is presented on 4 DVDs with clarity, authority and insight in this nearly 10-hour documentary. Written by Pulitzer Prize-winning journalist Peter Arnett and narrated by Richard Basehart, our set covers the entire conflict, examining the shifting attitudes of the United States toward Vietnam from 1945, when the battleground was known as French Indochina, to 1975, when Saigon fell to the North Vietnamese.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'John Ehrlichman, Alexander Haig, Richard Basehart, Doris Kearns Goodwin, Peter Arnett, William Colby', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '26401918', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '10 hours', 'Release date': 'April 2, 2013', 'Actors': 'Richard Basehart, Alexander Haig, John Ehrlichman, William Colby, Doris Kearns Goodwin', 'Studio': 'Time Life Entertainment / VSC', 'Writers': 'Peter Arnett', 'Number of discs': '1'}\nReview Text: Just excellent file footage of the various battles and the anti-war protests. Would be a great source for anyone writing a college thesis.\nReview Title: Great Series from the 1980's. Great Interviews!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Threads [NON-USA FORMAT, PAL, Reg.2&4 Import - Great Britain]\nReview Date: 2013/08/15\nStore: Karen Meagher  (Actor),     Reece Dinsdale  (Actor),     Mick Jackson  (Director, Producer)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Documentary-style account of a nuclear attack on Sheffield during the 1980s. Ruth Beckett (Karen Meagher) and Jimmy Kemp (Reece Dinsdale) live in Sheffield and are busy preparing for their upcoming marriage. When Russia invades Iran, hoping to bring the country under its influence, tension is increased throughout the West, and particularly at the local R.A.F. base. Blissfully unconcerned with world events, Ruth and Jimmy carry on with their wedding preparations. However, when two Russian ICBM's hit Sheffield, turning the landscape into a radioactive desert, Ruth and Jimmy are forced to face up to the harsh reality of life in the aftermath of a nuclear explosion.\"]\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Documentary', 'Format': 'Import, PAL', 'Contributor': 'June Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham MasseyJune Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham Massey   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.48 x 5.35 x 0.63 inches; 2.82 Ounces', 'Director': 'Mick Jackson', 'Media Format': 'Import, PAL', 'Run time': '1 hour and 53 minutes', 'Actors': 'Karen Meagher, Reece Dinsdale, David Brierly, Rita May, Nicholas Lane', 'Subtitles': 'English', 'Producers': 'Graham Massey, John Purdie, Mick Jackson, Peter Wolfes', 'Studio': 'BBC', 'Writers': 'Barry Hines', 'Number of discs': '1'}\nReview Text: This film was released in the fall of 1984 a year later after ABC television's &#34;The Day After&#34;.<br />The producers absolutely did their homework: various levels of radiation; psychological behavior; martial law.The blips of the scientific, psychological,and biological information during the film personified the conditions the actors (outstanding job) were portraying. I wish the dvd had interviews of the cast. Note: the dvd format is non-US thus the dvd prompts you how many times you can watch it on their format.\nReview Title: best nuclear war movie during the cold war 1980s\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Weather Underground\nReview Date: 2013/09/28\nStore: Lili Taylor  (Actor),     Pamela Z  (Actor),     Sam Green  (Director),     Bill Siegel  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['Product Description', 'Hello. I m going to read a declaration of a state of war...Within the next 14 days we will attack a symbol or institution of American injustice --Bernardine Dohrn', 'Thirty years ago, with these words, a group of young American radicals called The Weathermen announced their intention to overthrow the U.S. government. Fueled by outrage over the Vietnam War and racism in America, they went undergound during the 1970s, bombing targets across the country that they felt symbolized the real violence that the U.S. government and capitalist power were wreaking throughout the world. From pitched battles with police on Chicago s city streets, to bombing the U.S. Capitol building, to breaking acid-guru Timothy Leary out of prison, this carefully organized clandestine network attempted to incite a national revolution, while successfully evading one of the largest FBI manhunts in history.', 'One of the top documentaries of the year, this award-winning film interweaves extensive archival material with modern-day interviews to explore the incredible story of The Weather Underground. As former members reflect candidly about the idealistic passion that drove them to bring the war home, they paint a compelling portrait of troubled and revolutionary times, with unexpected and often striking connections to the current world situation.', 'Special Features:', 'Commentary From Former Weathermen Bernardine Dohrn and Bill Ayers; Filmmaker Commentary; Original Weathermen Audio Communiques; Bonus Film on Former Weatherman David Gilbert: A Lifetime of Struggle; Excerpt from Emile de Antonio film Underground; Filmmaker Biographies; Filmmaker Statement; Spanish Subtitles; Interactive Menus; Scene Selection', 'Amazon.com', \"The key players in the radical movement known as the Weather Underground are skillfully brought to life in this Oscar-nominated documentary. The Weathermen were born of sixties protest, but took their scheme to overthrow the U.S. government to especially violent extremes. Never a well-populated movement, the Underground petered out as its leaders aged during the seventies; by decade's end, weary of hiding, most of them had turned themselves over to the authorities. That journey, by which a fire-breathing revolutionary such as Bernadine Dohrn became a (still fiery) gray-haired wife and mother, is an intriguing one. This film, rich in period footage (and some unnecessary sensationalism) captures the era somewhat broadly. But the present-day interviews with the participants, contrasted with their radical selves, provides an exceptionally detailed look inside the organization itself. It's not a nostalgic look back, and the overall mood is sobering rather than celebratory. Lili Taylor provides the narration.\", '--Robert Horton', 'Review', '. . . Gripping . . . the filmmakers raise some disturbing and highly relevant questions into the psychopathology of terrorism. --The New York Times. . . a fascinating window into American political history --The Washington PostAn important historical document thats also riveting entertainment. --Time Out New York', 'See more']\nAverage Rating: 4.4\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Contributor': 'Sam Green, Pamela Z, Lili Taylor, Jim Lange, Bill Siegel', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.2 Ounces', 'Director': 'Sam Green, Bill Siegel', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 25, 2004', 'Actors': 'Lili Taylor, Pamela Z, Jim Lange', 'Subtitles': 'Spanish', 'Studio': 'Docurama', 'Number of discs': '1'}\nReview Text: Very surprised no one had ever done documentary on this group until now. The film does not at all glorify them, the directors simply told a story of why these American college students simply wanted to stop the senseless armed conflict in Vietnam and their stance against oppression and racism in America. While I don't agree with their politics i.e., communism, and their unrealistic premise of the majority of Americans would violently revolt against the American government, their commitment ( by death if necessary) to the cause for social change, as told by the director, is very engaging!! I absolutely can't get enough of Weatherman Niomi Jaffee's quote early in the film: &#34; if you sit in your little white house and go to your little  white job and allow the country you live in to murder people, and you sit there and don't do anything about it that's violence&#34;...if one is not part of the solution they're part of the problem. In the director's commentary, the director said when he interviewed the group said that they didn't want to be &#34;good Germans&#34; (in relation to Jaffe's quote)---wow!!<br /><br />I was only five years old when the group went underground, officially,in 1970 after the townhouse explosion (I had my own problems with racism) but I had heard of the name around 1975 and in 1980 when most of charges (the many bombings the group committed)were dropped because of arrogant, stupid, and corrupt tactics of the FBI.<br /><br />Too bad these directors, although nominated, didn't win the academy award for best documentary film---and these directors were not born during that time!! Any unearthed story from the turbulent 1960s that would educate today's young adults in order to further civilize and clean up bad behavior is alright by me.  Great job fellas!!\nReview Title: A story long over due. Great Job!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Halls Of Anger\nReview Date: 2014/11/06\nCategories: Drama\nProduct Description: ['When an African American ex-basketball player becomes vice principal at an inner city school in his hometown, he comes face to face with the challenging problems of desegregation.']\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['BogartPaul'], 'Producers': ['Herbert Hirschman', 'Walter Mirisch'], 'Starring': ['Calvin Lockhart', 'Janet MacLachlan', 'Jeff Bridges']}\nReview Text: Horrible behavior of American teenagers in the 1970's . The acting by all was fantastic, especially, Jeff Bridges and Rob Reiner.Remembered a bits and pieces of it on late night television in mid-seventies. I was too young to see it  the theaters. Just as well I was living it myself. Not in the US but in Toronto, Ontario, Canada--not as violent but the name calling was prevalent. Being a child that grew up in the 1970's it was just a terrible time as far as race relations.  Nevertheless, the film captured the  savagery and primitive  behavior of the time period of 1970 at the time of the US secondary school busing enactment.<br /><br />Didn't understand the point of why the black girls were ripping  the  white girl's close off? A very eerie scene!!! Probably a reaction to black men would possibly pay more attention to her for various reasons, coupled with black women's insecurity of the alleged notion of the western culture's standard of beauty is caucasian. Regardless the scene did it's job of capturing the viewer's emotions.<br /><br />Dare I say, and it still stands today, when a women who are clearly more attractive than a certain mass of women, the low self-esteem and/or not so attractive women get attention starved and feel angry and scared of being ostracized and, worse case, they believe, they'll die alone.<br /><br />Perhaps this film should be archived in the US National Film Registry.\nReview Title: Just an Ugly time for Black Americans in the early 1970's, and the film captured it.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The War Game / Culloden [DVD]\nReview Date: 2016/01/28\nStore: Olivier Espitalier-Noel  (Actor),     George McBean  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nAverage Rating: 4.2\nProduct Details: {'Format': 'DVD, NTSC, Black & White', 'Contributor': 'Peter Watkins, Olivier Espitalier-Noel, Robert Oates, Kathy Staff, Michael Aspel, Peter Graham, George McBeanPeter Watkins, Olivier Espitalier-Noel, Robert Oates, Kathy Staff, Michael Aspel, Peter Graham, George McBean   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Director': 'Peter Watkins', 'Media Format': 'DVD, NTSC, Black & White', 'Run time': '2 hours', 'Release date': 'July 25, 2006', 'Actors': 'Olivier Espitalier-Noel, George McBean, Robert Oates, Peter Watkins, Michael Aspel', 'Studio': 'Project X', 'Writers': 'Peter Watkins', 'Number of discs': '1'}\nReview Text: Your watching a fictional biography where a reporter is interviewing people before and after a nuclear strike in an English town in 1965.<br />Its ok given being desensitized by post 9/11 and watching Threads and the The Day After in 1984 as a teenager. It does mention current events such as Vietnam,LBJ interestingly.<br /><br />One Of the scenes where people were moved to people's houses and the women asked the cop if the people are &#34;colored&#34;. I had to roll my eyes up at that stupid girl's comment, but that was the behavior at that time.<br /><br />But keeping in mind this was 1965, not long after the Cuban missile crisis, this film would freak anyone out. It's less than an hour long. There's much commentary between scenes with a reporters interviewing civilians like a documentary but the reporter was also acting.<br /><br />It was hard to take seriously this film because the actresses'  hair seemed to be exempted from any radiation let alone dirt in some scenes. YouTube personality Tommy Sotomayor's takes on black women's obsession with weave would have a field day with this one.<br /><br />But actors, actresses and writers did their homework to capture the pompous ignorance of the civilized before the catastrophe then the raw emotion of the destress, despair and horror and how civil defense is pointless. With the exception of the hair issue, it's a black and white short version of Threads. But it was well-written with the all the intense camera angles at that which are common today. Winning the Oscar in 1967 as a documentary film (yah I know but that's what IMDB says) is well deserved.\nReview Title: It's hard to take this movie seriously when the women's beehive hair appears in place after a nuclear explosion.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cinematic Titanic LIVE: East Meets Watts\nReview Date: 2016/04/24\nStore: Joel Hodgson  (Actor),     Trace Beaulieu  (Actor),     Sharp/Ford  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Kung Fu hits the streets! Young Larry Chin arrives from China looking for his long-lost brother and stumbles into some shady characters that'd just as soon see him go home - or get dead. He crosses paths with Stud Brown, and the two become an unlikely duo as they fight to clean up the 'hood, and make time for some lady loves they meet along the way. And hang on tight for the surprise twist ending. It's all living color kungsploitation glory, live with Cinematic Titanic.\"]\nAverage Rating: 4.3\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Sharp/Ford', 'Media Format': 'Color, Live, Full Screen', 'Run time': '1 hour and 30 minutes', 'Actors': 'Joel Hodgson, Trace Beaulieu, Frank Conniff, Mary Jo Pehl, J. Elvis Weinstein', 'Producers': 'Cinema Titan LLC', 'Language': 'Unqualified (Stereo)', 'Studio': 'Cinema Titan, LLC'}\nReview Text: The first live version of the MST3000 cast. Most of the jokes references events and television shows from the 1970's e.g., &#34;Barney, Wojo and Harris are fighting again&#34;, (Barney Miller Show)...&#34;It's Richard Roundtree's Birthday&#34; (movie Shaft, 1971).\nReview Title: Great 1970s references...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Live in L.A. (DVD)\nReview Date: 2019/05/19\nStore: Minnemann, Marco  (Actor),     Drum Workshop  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Music Videos & Concerts\nProduct Description: ['Directed by Jonathan Launer. Starring Marco Minnemann.']\nAverage Rating: 3.7\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Contributor': 'Minnemann, Marco, Drum Workshop', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Item model number': '77-4MMLADVD', 'Director': 'Drum Workshop', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 10, 2007', 'Actors': 'Minnemann, Marco', 'Studio': 'Alfred Music', 'Number of discs': '1'}\nReview Text: Had to take it back because it wasn't the 1980s version of Willam Petersen and William Defore.\nReview Title: It's not the 1980s version by direct William Fredkin\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1st and Ten - Complete Collection\nReview Date: 2019/05/19\nStore: Delta Burke  (Actor),     various  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Meet the California Bulls. They may not be the #1 football team in the league, but nobody does it better when it comes to outrageous exploits and sexy escapades. Join seductive owner Diane Barrow (Delta Burke) as she leads her team through a minefield of hilarious hijinks on and off the gridiron. And remember, whether the quarterback is getting sacked - or getting caught in the sack with a pair of cheerleaders, the object of the game is always the same: To Score!']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Delta Burke, various', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'MFR683904451422#VG', 'Director': 'various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '40 hours', 'Release date': 'January 24, 2006', 'Actors': 'Delta Burke', 'Studio': 'Tango Entertainment', 'Number of discs': '1'}\nReview Text: Some nudity--which is good. To see O.J. do visiting a prison, in one episode--- the irony.\nReview Title: The comedy is not  very good...but there is nudity\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The FBI: The Complete Sixth Season\nReview Date: 2019/05/19\nStore: Efrem Zimbalist, Jr.  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['At the dawn of the Seventies the Culture War captured as much attention as the Cold War, and the storylines seen in this sixth season of The FBI (drawn from real Bureau files) reflected this. While still on the watch for saboteurs and spies acting as agents for foreign powers, the dedicated crimebusters of the Bureau, as personified by Inspector Erskine (Efrem Zimbalist, Jr.), Special Agent Colby (William Reynolds), and Assistant Director Ward (Philip Abbott) were just as likely to be tasked with tracking down psychotic Vietnam veterans or stopping college kids with a terrorist bent. Among the all-star actors battling the FBI as kidnappers, bank robbers, and extortionist or as the innocent victims whose aid Erskine and co. come to, can be found Martin Sheen, Joan Van Ark, Billy Dee Williams, Robert Loggia, Bradford Dillman, Dabney Coleman, Suzanne Pleshette, and William Shatner (as a rogue customs officer turned drug dealer!).']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'NTSC', 'Contributor': 'Efrem Zimbalist, Jr.', 'Language': 'English', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': 'WARA688562DVD', 'Media Format': 'NTSC', 'Run time': '21 hours and 40 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Efrem Zimbalist, Jr.', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: I know it was the sign of the times, but the orchestra music in the background of most scenes is annoying. Funny to see well known actors of today appear in this series back in the early 1970s (so young).\nReview Title: Too much background music.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/05/20\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rod Holcomb', 'Christian I. Nyby II', 'Alan J. Levi', 'Daniel Haller', 'Donald P. Bellisario', 'Vince Edwards', 'Richard A. Colla', 'Winrich Kolbe'], 'Producers': ['Michael Sloan'], 'Studio': ['NBCUniversal']}\nReview Text: It does look good in digital viewing.\nReview Title: Great show...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/06/15\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ariel Vromen'], 'Producers': ['Ehud Bleiberg'], 'Starring': ['Michael Shannon', 'Winona Ryder', 'Chris Evans'], 'Studio': ['Millennium Entertainment']}\nReview Text: The movie does a great job in covering the real life biography of Richard Kuklinski.\nReview Title: Actor does a good job mimicking the real person\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Nuclear Football\nReview Date: 2019/06/15\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"Considered the world's most dangerous handbag, its contents enable the U.S. President to authorize a nuclear launch anytime, anywhere. Carried by a military aide, the President's Emergency Satchel, commonly called the Nuclear Football, is always within reach, whenever the President leaves the White House, whether for a jog or on a state visit abroad. From creation during the Cold War years of the Kennedy Administration to today, we detail the Football's history, protocol, safeguards, and rare mishaps.\"]\nAverage Rating: 2.0\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'NTSC', 'Run time': '50 minutes', 'Release date': 'November 1, 2004', 'Producers': 'Bill Brummel Productions', 'Studio': 'A&E Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The disk label is too hight that it jams the CD device. If it doesn't slide in easily, send it back. Aside from that great documentary of the history of the reasons why this device was need and some of the funny, well not so,  how the foot was temporarily lost; one President losing his authenticator card; and the selection process of being a military attache (the person who in charge of the football). Surprised the NFL network hasn't or at least yet written their own feature story of the one football no one wants to fumble.\nReview Title: Be careful of the disk label. Operation drop kick, thus you need a football on which to do it..\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Winter Soldier\nReview Date: 2019/10/19\nStore: Rusty Sachs  (Actor),     Joe Bangert  (Actor),     n/a  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'January 31, 1971. More than 125 Vietnam veterans, representing every major combat unit to see action, gathered in Detroit to heal a nation... and themselves. They risked everything to talk about the atrocities they had committed or witnessed in the presence of officers while stationed in Vietnam. These veterans saw themselves as winter soldiers battling against the wrongs of the war and the brutal training that had made them capable of unthinkable violence. Eighteen filmmakers calling themselves the Winterfilm Collective - including Barbara Kopple (Harlan County, USA), Robert Fiore (Pumping Iron) and Lucy Massie Phenix (You Got to Move) - captured this extraordinary event. Rarely seen since its 1972 Cannes premiere, Winter Soldier has been called one of the most powerful anti-war films ever made and remains to this day a remarkable plea for peace.', 'Amazon.com', 'The more things change, the more they stay the same. Thus it should come as little surprise that while the events described in', 'Winter Soldier', 'took place during the Vietnam conflict, the 2006 home video release of this 1972 documentary more or less coincides with recent, eerily similar revelations regarding the activities of U.S. military personnel stationed in Iraq, including the Abu Ghraib prison scandal and the alleged slaughter of civilians in the town of Haditha. The film centers on a day in January, 1971, when more than 100 former soldiers turned up at a motel in Detroit to give testimony as part of an investigation sponsored by a group calling itself Vietnam Veterans Against the War. Their stories are genuinely chilling, as they matter-of-factly describe civilians being thrown from helicopters, villages burned, children shot, women raped, and innocent people tortured, maimed (cutting off their ears was popular), or even skinned; the notorious My Lai massacre of 1968 was apparently more the rule than the exception. Some eighteen documentary filmmakers took part in the making of this production, including Barbara Kopple (', 'Harlan County, U.S.A.', ') and Robert Fiore (', 'Pumping Iron', '). But there is no great artistry on display here--the film is mostly a succession of talking heads, appearing in grainy black & white (there are also a few photographs and occasional color film footage shot in Vietnam) and recounting how they were brainwashed into believing that the atrocities in which they participated were \"in the best interests of our nation,\" as one puts it, especially since \"it wasn\\'t like (the Vietnamese) were human.\" Unlike Emile de Antonio\\x92s', 'In the Year of the Pig', ',', 'Winter Soldier', \"gives us nothing from the other side--the opposition to the opposition, if you will. All we have are the vets' terrible (and highly credible) tales of how officers who witnessed or took part in these horrors wrote them off as Standard Operating Procedure. Strong stuff, but the film starts to become repetitive and ultimately tedious after it passes the one hour mark. The abundance of bonus features, including a current interview with the filmmakers and three shorter films addressing the same theme as the main feature, will be of interest mainly to gluttons for punishment.\", '--Sam Graham', 'Review', '\"A live hand grenade brought home from a distant battlefield.\" --', 'David M. Halbfinger,', 'New York Times', '\"Dazzling! An eloquent, unforgettable tale of profound moral reckoning. Everyone should see WINTER SOLDIER!\" --', 'Ann Hornaday,', 'Washington Post', '\"Like Peter Davis\\x92s HEARTS AND MINDS and Michael Moore\\x92s FAHRENHEIT 9/11\\x85 a wake-up call\\x85 an important, lacerating document.\" --', 'Fernando F. Croce,', 'Slant Magazine', '\"One of the most devastating antiwar films ever made!\" --', 'David Fear,', 'Time Out New York', '\"WINTER SOLDIER \\x85 should be a voter registration requirement!\" --', 'Michael Atkinson,', 'Village Voice', 'See more']\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.96 Ounces', 'Item model number': 'Mile00100', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Black & White', 'Run time': '1 hour and 36 minutes', 'Release date': 'May 30, 2006', 'Actors': 'Rusty Sachs, Joe Bangert, Scott Shimabukuro, Kenneth Campbell, Scott Camil', 'Subtitles': 'German, French', 'Studio': 'Milestone Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The confessions of the senseless killing for superficial reasons was mind boggling! However these men were placed in situations where there was noend goal in site at all i.e., e.g, if we surround Hanoi and capture the 4 VC generals the war is over---no.  I don't believe they were wimps or crybabies, they had a conscience due to the war crimes they either witnessed or experienced;----it needed to be told!!<br /><br />Without spilling the meat of the video too much, it was very well written and, In my opinion, should be required viewing in all the US service academies (probably is).\nReview Title: The hidden truth of the atrocities committed by these guys; but they were set up to fail.\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual displays a strong preference for vintage movies and documentaries, particularly those that highlight social issues, historical events, and cultural critiques from the 1960s to the 1980s. Consistently high ratings (often 4.6 and above) indicate a genuine appreciation for quality storytelling and significant themes, particularly those addressing political and social justice. The sentiment in their reviews reflects nostalgia and a critical analysis of historical contexts, particularly regarding race relations and war.\n\nRecurring themes include science fiction, war documentaries, and classic comedies, suggesting a diverse taste that values both entertainment and education. The individual seems to favor quality over quantity, as they have ignored more recent products with lower quality ratings. \n\nWhile price sensitivity is not clearly indicated, a tendency towards purchasing value-based collections (e.g., complete series) suggests a willingness to invest in extensive viewing experiences. Lower ratings are primarily reserved for content that does not meet expectations, especially regarding formatting or representational accuracy, indicating a discerning taste for presentation and substance.\n\nIn conclusion, the core preferences can be synthesized as a strong affinity for classic, impactful cinema and television that reflects or critiques societal issues, combined with a thoughtful engagement with the historical context of these works.",
  "target_interaction": {
    "rating": 5.0,
    "title": "The word \"like\" is not said over again...",
    "text": "Well-written story line. Came out a few years after the takeover of the US Embassy in Tehran and the Iranian Embassy in London.<br /><br />Without giving it away the following military organization are involved: SAS, US Army Rangers; West Germany GSG9.",
    "images": [],
    "asin": "B00O1CZUCG",
    "parent_asin": "B00O1CZUCG",
    "user_id": "AE2BH7Z4M243LVUXAFCCNPBW2HEA",
    "timestamp": "2020-11-28 23:07:59.388000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.5,
    "rating_number": 927,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX360_FMwebp_.jpg",
        "480w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX480_FMwebp_.jpg",
        "720w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX720_FMwebp_.jpg",
        "1080w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1080_FMwebp_.jpg",
        "1440w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1440_FMwebp_.jpg",
        "1920w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Sharp",
        "Ian"
      ],
      "Producers": [
        "Chris Chrisafis",
        "Euan Lloyd",
        "Raymond Menmuir"
      ],
      "Starring": [
        "Richard Widmark",
        "Lewis Collins",
        "Judy Davis"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}