{
  "user_id": "AEAXAJACFMXIAAH4WOHRMXPSZWFA",
  "summary": "=== Purchase Information ===\nProduct Title: The Bollywood Dance Workout with Hemalayaa\nReview Date: 2010/10/13\nStore: Hemalayaa  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Product Description', 'Fitness instructor Hemalayaa mixes yoga techniques with Bollywood dance moves for a fun and invigorating exercise routine. BOLLYWOOD DANCE WORKOUT WITH HEMALAYAA presents a full program of dancing, stretching, and general fitness that will improve flexibility, strength, and cardiovascular health.', 'Review', 'Hallelujah. Hemalayaa has finally raised the bar in dance workout videos. --', 'St. Louis Post-Dispatch', \"Fun with a capital F. It's a good way to shake up your regular workout. --\", 'Dallas Morning News', \"Hemalayaa's teachings are infused with her training and passion for Indian dance, and this release embodies this passion most purely. --\", 'Yogi Times, March 2007', \"A fun way to burn calories, but sassy enough to make you feel like you're a sexy Bombay lovegoddess. --\", 'Oxygen, November 2007', 'A fun, inspiring teacher. --', 'Spartanburg Herald-Joural', 'A unique workout that will encourage you to get your brain and body moving. --', 'Santa Barbara Independent, February 1, 2007', 'The workout is playful and it is fun, exactly what a dance workout should be. --', 'FitSugar.com']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Hemalayaa', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '2229017', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '50 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Hemalayaa', 'Studio': 'ACORN MEDIA', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I am an older full figured woman who does not get much exercise. A distant gal-pal told me she had started this and said \"Shannon, this odd bump is protruding from my face! It's my CHIN!\"(she is hilarious)<br />I decided to give it a try. Previously, I had watched maybe 5 minutes of Tae Bo, 2 of a Richard Simmons, and seconds of an overpriced infomercial one. WOW! I LOVE this! It is for a beginner, others may find it too low cardio. For me it is a fun dance that someone sweetly talks you through. Great camerawork, and as Ms H says, it's most important to have fun. At last, a workout that you feel great about it AND yourself, no matter what level. You also can't help but feel beautiful and powerful with these sensual movements. And I don't need to move furniture, unless I want to, lol! That means you can download it to your travel computer (SO easy with Amazon's video library) and do it at a hotel. This was my first try at Amazon's library feature, if you haven't tried it, it is TERRIFIC!<br />But back to this video...her voice is like silk, which is important if you plan on watching over and over. This is a wonderful way to start moving if you are very large or have been inactive for a long time because it is very easy to adapt to anyone's limitations. By the same token, as you progress, it's just as easy to kick it up. All this for less than the price of one class!\nReview Title: A BEGINNERS Delight!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Elf (DVD)\nReview Date: 2014/03/29\nStore: Jon Favreau  (Director),     Leon Redbone  (Actor),     Will Ferrell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Product Description', \"This hilarious Christmas film tells the tale of a young orphan child who mistakenly crawls into Santa's bag of gifts on Christmas Eve and is transported back to the North Pole and raised as an elf. Years later Buddy learns he is not really an elf and goes on a journey to New York City to find his true identity.\", 'DVD Features:', 'Audio Commentary:', '2 commentaries with Will Ferrell & Director', 'DVD ROM Features', 'Deleted Scenes', 'Featurette:', 'Film school for kids Tag along with Will Ferrell How they made the North Pole Kids on Christmas and more!', 'Amazon.com', 'Elf', 'is genuinely good. Not just', 'Saturday Night Live', '-movie good, when the movie has some funny bits but is basically an insult to humanity;', 'Elf', 'is a smartly written, skillfully directed, and deftly acted story of a human being adopted by Christmas elves who returns to the human world to find his father. And because the writing, directing, and acting are all genuinely good,', 'Elf', 'is also genuinely funny. Will Ferrell, as Buddy the adopted elf, is hysterically sincere. James Caan, as his rediscovered father, executes his surly dumbfoundedness with perfect aplomb. Zooey Deschanel, as a department store worker with whom Buddy falls in love, is adorably sardonic. Director Jon Favreau (', 'Swingers', \") shepherds the movie through all the obligatory Christmas cliches and focuses on material that's sometimes subtle and consistently surprising. Frankly,\", 'Elf', 'feels miraculous. Also featuring Mary Steenburgen, Bob Newhart, Peter Dinklage, and Ed Asner as Santa Claus.', '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': 'NEWL7168DVD', 'Director': 'Jon Favreau', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 24, 2006', 'Actors': 'Leon Redbone, Will Ferrell, James Caan, Ray Harryhausen, Zooey Deschanel', 'Dubbed': 'Spanish', 'Subtitles': 'English, Korean, French, Thai, Portuguese, Spanish, Indonesian', 'Producers': 'Jon Berg, Toby Emmerich, Kent Alterman, Todd Komarnicki, Cale Boyter', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Studio': 'WarnerBrothers', 'Writers': 'David Berenbaum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: No, it isn't Citizen Kane. But it's one of the best 'feel good' movies that is entertaining for all ages.<br /><br />A baby in an orphanage sneaks into Santa's bag, winding up at the North Pole. The diaper tag reads 'Little Buddy Diapers' so it is assumed by the elves that his name is Buddy. Adopted and raised by the hilariously deadpan Bob Newhart, Buddy becomes suspicious when it becomes clear that he isn't quite like all the other elves.<br />Off to New York he goes, to connect with his biological father. One problem...<br /><br />Dad's on the NAUGHTY list!<br /><br />Child-like and without malice of any sort, Will Farrell's Buddy reminds us of the beauty of innocence and kindness.<br /><br />Well, perhaps not always beautiful, as a naive Buddy tries to hug a city hardened raccoon!<br />Or find common ground with 'an angry little elf'. That particular scene is so memorably funny that when faced with negative people, my sweetie and I look at each other and say in unison, &#34;He's an ANGRY little elf!&#34;<br /><br />Christmas classic that is fun all year round. Cheers!\nReview Title: Anytime of year, it makes you smile!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: V For Vendetta (Widescreen)\nReview Date: 2014/06/02\nStore: Natalie Portman  (Actor),     Hugo Weaving  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['\"Remember, remember the fifth of November,\" for on this day, in 2020, the minds of the masses shall be set free. So says code-name V (Hugo Weaving), a man on a mission to shake society out of its blank complacent stares in the film V for Vendetta. His tac']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Widescreen, NTSC', 'Contributor': 'Rupert Graves, Stephen Rea, Hugo Weaving, Natalie Portman, Stephen Fry', 'Language': 'English (Dolby Digital 5.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Widescreen, NTSC', 'Actors': 'Natalie Portman, Hugo Weaving, Rupert Graves, Stephen Rea, Stephen Fry'}\nReview Text: I had assumed just from the title that this was a film that wouldn't be my cup of tea.<br />Now here I am buying my third copy! It's one of the favorites that gets loaned out without an expectation of being returned, I love sharing it.<br />Evey (Natalie Portman) has a low level job at the state-run broadcast/media station. Being outside after curfew in an Orwellian England proves to be dangerous indeed, but a mysterious masked man known as The Terrorist (Hugo Weaving) comes her rescue. Within days, she is given the chance to return the favor, and protects him.<br />Over the next year, they continue to save each other, in every way that a person can be saved...physically, spiritually, and emotionally.<br />But it is also England and her people that need rescuing from a corrupt dictatorship, can two lone people possibly make a difference?<br /><br />Wonderful uses of color and lighting authentically nail the feel of each scene. Get your own copy.\nReview Title: Entertaining and Well Paced\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Napoleon Dynamite - Like, the Best Special Edition Ever!\nReview Date: 2014/08/09\nStore: Jon Heder  (Actor),     Efren Ramirez  (Actor),     Jared Hess  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, Special Editions\nProduct Description: ['Product Description', \"Napoleon Dynamite is a new kind of hero, complete with a tight red 'fro, sweet moon boots, and skills that can\\x92t be topped. Napoleon spends his days drawing mythical beasts, duking it out with his brother, Kip, and avoiding his scheming Uncle Rico. When t\", 'Amazon.com', 'Stills from', 'Napolean Dynamite', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': \"Multiple Formats, Color, NTSC, Widescreen, Collector's Edition\", 'Contributor': 'Haylie Duff, Tina Majorino, Jon Heder, Jon Gries, Bracken Johnson, Jerusha Hess, Shondrella Avery, Jared Hess, Aaron Ruell, Diedrich Bader, Sandy Martin, Trevor Snarr, Efren Ramirez, Carmen BradyHaylie Duff, Tina Majorino, Jon Heder, Jon Gries, Bracken Johnson, Jerusha Hess, Shondrella Avery, Jared Hess, Aaron Ruell, Diedrich Bader, Sandy Martin, Trevor Snarr, Efren Ramirez, Carmen Brady  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.1), Spanish (Dolby Digital 2.1)', 'Runtime': '1 hour and 22 minutes', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.56 x 5.31 x 0.51 inches; 2.88 Ounces', 'Director': 'Jared Hess', 'Media Format': \"Multiple Formats, Color, NTSC, Widescreen, Collector's Edition\", 'Run time': '1 hour and 22 minutes', 'Release date': 'May 16, 2006', 'Actors': 'Jon Heder, Efren Ramirez, Jon Gries, Aaron Ruell, Diedrich Bader', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Jared Hess, Jerusha Hess', 'Number of discs': '2'}\nReview Text: ....or you are a big old Dork like me. The kind that votes for Pedro.<br /><br />Almost every time this silly movie is on TV, I watch it. And it plays on TV quite a bit.<br />That's a heck of a lot of time to waste, watching Kip play footsies with La Fawnduh or seeing those moon boots attempt to moonwalk.<br /><br />So, if I buy a copy, I'll never have to watch it on TV again, right?<br /><br />Well, I just finished watching it again on E!, and realized I've never even unwrapped this DVD after purchasing it here on Amazon quite a while ago.<br /><br />And now I'm craving Tater Tots.\nReview Title: You either get it or you don't...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hannah Free\nReview Date: 2014/09/18\nStore: Sharon Gless  (Actor),     Maureen Gallagher  (Actor),     Wendy Jo Carlton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Starring multi-award winner Sharon Gless (Burn Notice, Queer as Folk, Cagney & Lacey) in a tremendous performance, Hannah Free tells the moving story of the lifelong love affair between two very different women. Weaving between past and present, the story reveals how they maintained their love affair despite a marriage, a world war, infidelity, and family denial. Additional actors include Maureen Gallagher, Ann Hagemann, Kelli Strickland, Taylor Miller (All My Children) and Jacqui Jackson.', 'Review', \"A terrific role for Sharon Gless, who runs with it gloriously! Los Angeles Times Beautiful . .. (Hannah is) masterfully played by Sharon Gless. Slant Magazine Ms. Gless delivers a stellar performance that is gritty, poignant, and real. Huffington Post Even at death s door, a lesbian couple still finds peace elusive. Stephen Holden, NY Times ... Sharon Gless captures the spotlight. Chicago Tribune Effortlessly shares the quintessential love story of two women. SF Examiner.com Sharon Gless's fire, candor and heart drive this intimate story. LA Splash Sharon Gless brings grit, authenticity and dimension to the title character. She commands the screen. San Francisco Chronicle Love scenes with Rachel and Hannah as mature older woman are beautiful in depicting how a love can age like fine wine. New York Q News This level of interpersonal lesbian drama definitely gives the women of The L Word a run for their money! After Ellen (Logo Online) --Wolfe\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Performing Arts', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Sharon Gless, Maureen Gallagher, Wendy Jo Carlton, Jacqui Jackson, Ann Hagemann, Kelli Strickland, Taylor MillerSharon Gless, Maureen Gallagher, Wendy Jo Carlton, Jacqui Jackson, Ann Hagemann, Kelli Strickland, Taylor Miller  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 26 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Wendy Jo Carlton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Sharon Gless, Maureen Gallagher, Ann Hagemann, Kelli Strickland, Taylor Miller', 'Studio': 'Wolfe Video', 'Number of discs': '1'}\nReview Text: To begin, I must disclose that I was one of the co-producers of this film.<br />Starring Sharon Gless of Cagney & Lacey, and more currently Burn Notice (among many other acting accomplishments), this film is based on famed Chicago playwright Claudia Allen's work of the same name.<br />Told primarily through flashbacks, it is the story of two women, Hannah (Gless) and Rachel that have loved each other for decades, but as elderly women in a nursing facility, Rachel is now in a coma with the expectation that death is imminent.<br />Her family has long struggled to understand the relationship, and in an effort to give themselves peace and closure, they have decided to prevent Hannah from seeing her beloved Rachel one last time before she passes. They hold all of the legal strings to do so, as this was before any recognition, be it civil union or marriage, could be given the couple.<br /><br />Hannah is a flawed woman, not always rising to the occasion for Rachel, played beautifully by the luminous Ann Hagemann (The Showdown, Fall Away). The film captures the viewer as the history and current turmoil is told, however, the ending was slightly reworked, and not for the better. Sadly, at the final few moments, it sinks to a bit of hokey, in my opinion.<br /><br />The acting, the story, so much of this film is good. It could have been better, but still worth a watch.<br /><br />As a bit of an aside, many of the actors and participants worked for less than their usual fee because they felt the story was important. Ms. Gless, who has long been married to Cagney & Lacey creator Barney Rosenzweig, has never forgotten her gay fan base.<br />At a time when so many are only 'in it for the money', being a part of this project was a privilege.\nReview Title: Worth Watching, up to a point\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Swing Dance Instructions on DVD: Beginner's Swing Volume 1, A Step-by-Step Guide\nReview Date: 2015/02/10\nStore: Format: DVD\nCategories: Movies & TV, Movies\nAverage Rating: 5.0\nProduct Details: {'Media Format': 'DVD'}\nReview Text: I don't think there is a more fun type of music than swing, the only music peppy enough to get a war torn world from the 1940s up and dancing.<br /><br />It's even more fun to DANCE swing!<br />I took a few ballroom and tango lessons many, many years ago, way before Dancing with the Stars was even conceived. Loved it, but lessons are expensive, and keeping appointments has never been a strong point.<br />Other than a few (and I mean VERY few) basics, little is remembered from those lessons.<br /><br />This DVD has you off the couch and dancing before you know it! The instructors are easy to follow, you see each step broken down slowly.<br />If you've never danced a step before, this is truly the way to go.<br /><br />Give a copy to each member of your wedding party, or have a group 'dance class'. The DVD shows how even just a few easy steps can have you dancing and lookin' swell, Daddy-O!<br /><br />DISCLOSURE: Product received to test, with the option to review. No financial compensation is EVER accepted. Views and opinions are my own.\nReview Title: Dig That CRAZY Beat, Daddy-O!\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Bollywood Dance Workout with Hemalayaa\nHemalayaa  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Product Description', 'Fitness instructor Hemalayaa mixes yoga techniques with Bollywood dance moves for a fun and invigorating exercise routine. BOLLYWOOD DANCE WORKOUT WITH HEMALAYAA presents a full program of dancing, stretching, and general fitness that will improve flexibility, strength, and cardiovascular health.', 'Review', 'Hallelujah. Hemalayaa has finally raised the bar in dance workout videos. --', 'St. Louis Post-Dispatch', \"Fun with a capital F. It's a good way to shake up your regular workout. --\", 'Dallas Morning News', \"Hemalayaa's teachings are infused with her training and passion for Indian dance, and this release embodies this passion most purely. --\", 'Yogi Times, March 2007', \"A fun way to burn calories, but sassy enough to make you feel like you're a sexy Bombay lovegoddess. --\", 'Oxygen, November 2007', 'A fun, inspiring teacher. --', 'Spartanburg Herald-Joural', 'A unique workout that will encourage you to get your brain and body moving. --', 'Santa Barbara Independent, February 1, 2007', 'The workout is playful and it is fun, exactly what a dance workout should be. --', 'FitSugar.com']\n{'Genre': 'exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Hemalayaa', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '2229017', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '50 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Hemalayaa', 'Studio': 'ACORN MEDIA', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI am an older full figured woman who does not get much exercise. A distant gal-pal told me she had started this and said \"Shannon, this odd bump is protruding from my face! It's my CHIN!\"(she is hilarious)<br />I decided to give it a try. Previously, I had watched maybe 5 minutes of Tae Bo, 2 of a Richard Simmons, and seconds of an overpriced infomercial one. WOW! I LOVE this! It is for a beginner, others may find it too low cardio. For me it is a fun dance that someone sweetly talks you through. Great camerawork, and as Ms H says, it's most important to have fun. At last, a workout that you feel great about it AND yourself, no matter what level. You also can't help but feel beautiful and powerful with these sensual movements. And I don't need to move furniture, unless I want to, lol! That means you can download it to your travel computer (SO easy with Amazon's video library) and do it at a hotel. This was my first try at Amazon's library feature, if you haven't tried it, it is TERRIFIC!<br />But back to this video...her voice is like silk, which is important if you plan on watching over and over. This is a wonderful way to start moving if you are very large or have been inactive for a long time because it is very easy to adapt to anyone's limitations. By the same token, as you progress, it's just as easy to kick it up. All this for less than the price of one class!\nA BEGINNERS Delight!\nElf (DVD)\nJon Favreau  (Director),     Leon Redbone  (Actor),     Will Ferrell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', \"This hilarious Christmas film tells the tale of a young orphan child who mistakenly crawls into Santa's bag of gifts on Christmas Eve and is transported back to the North Pole and raised as an elf. Years later Buddy learns he is not really an elf and goes on a journey to New York City to find his true identity.\", 'DVD Features:', 'Audio Commentary:', '2 commentaries with Will Ferrell & Director', 'DVD ROM Features', 'Deleted Scenes', 'Featurette:', 'Film school for kids Tag along with Will Ferrell How they made the North Pole Kids on Christmas and more!', 'Amazon.com', 'Elf', 'is genuinely good. Not just', 'Saturday Night Live', '-movie good, when the movie has some funny bits but is basically an insult to humanity;', 'Elf', 'is a smartly written, skillfully directed, and deftly acted story of a human being adopted by Christmas elves who returns to the human world to find his father. And because the writing, directing, and acting are all genuinely good,', 'Elf', 'is also genuinely funny. Will Ferrell, as Buddy the adopted elf, is hysterically sincere. James Caan, as his rediscovered father, executes his surly dumbfoundedness with perfect aplomb. Zooey Deschanel, as a department store worker with whom Buddy falls in love, is adorably sardonic. Director Jon Favreau (', 'Swingers', \") shepherds the movie through all the obligatory Christmas cliches and focuses on material that's sometimes subtle and consistently surprising. Frankly,\", 'Elf', 'feels miraculous. Also featuring Mary Steenburgen, Bob Newhart, Peter Dinklage, and Ed Asner as Santa Claus.', '--Bret Fetzer']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': 'NEWL7168DVD', 'Director': 'Jon Favreau', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 24, 2006', 'Actors': 'Leon Redbone, Will Ferrell, James Caan, Ray Harryhausen, Zooey Deschanel', 'Dubbed': 'Spanish', 'Subtitles': 'English, Korean, French, Thai, Portuguese, Spanish, Indonesian', 'Producers': 'Jon Berg, Toby Emmerich, Kent Alterman, Todd Komarnicki, Cale Boyter', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Studio': 'WarnerBrothers', 'Writers': 'David Berenbaum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nNo, it isn't Citizen Kane. But it's one of the best 'feel good' movies that is entertaining for all ages.<br /><br />A baby in an orphanage sneaks into Santa's bag, winding up at the North Pole. The diaper tag reads 'Little Buddy Diapers' so it is assumed by the elves that his name is Buddy. Adopted and raised by the hilariously deadpan Bob Newhart, Buddy becomes suspicious when it becomes clear that he isn't quite like all the other elves.<br />Off to New York he goes, to connect with his biological father. One problem...<br /><br />Dad's on the NAUGHTY list!<br /><br />Child-like and without malice of any sort, Will Farrell's Buddy reminds us of the beauty of innocence and kindness.<br /><br />Well, perhaps not always beautiful, as a naive Buddy tries to hug a city hardened raccoon!<br />Or find common ground with 'an angry little elf'. That particular scene is so memorably funny that when faced with negative people, my sweetie and I look at each other and say in unison, &#34;He's an ANGRY little elf!&#34;<br /><br />Christmas classic that is fun all year round. Cheers!\nAnytime of year, it makes you smile!\nV For Vendetta (Widescreen)\nNatalie Portman  (Actor),     Hugo Weaving  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Movies\n['\"Remember, remember the fifth of November,\" for on this day, in 2020, the minds of the masses shall be set free. So says code-name V (Hugo Weaving), a man on a mission to shake society out of its blank complacent stares in the film V for Vendetta. His tac']\n{'Format': 'Widescreen, NTSC', 'Contributor': 'Rupert Graves, Stephen Rea, Hugo Weaving, Natalie Portman, Stephen Fry', 'Language': 'English (Dolby Digital 5.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Widescreen, NTSC', 'Actors': 'Natalie Portman, Hugo Weaving, Rupert Graves, Stephen Rea, Stephen Fry'}\nI had assumed just from the title that this was a film that wouldn't be my cup of tea.<br />Now here I am buying my third copy! It's one of the favorites that gets loaned out without an expectation of being returned, I love sharing it.<br />Evey (Natalie Portman) has a low level job at the state-run broadcast/media station. Being outside after curfew in an Orwellian England proves to be dangerous indeed, but a mysterious masked man known as The Terrorist (Hugo Weaving) comes her rescue. Within days, she is given the chance to return the favor, and protects him.<br />Over the next year, they continue to save each other, in every way that a person can be saved...physically, spiritually, and emotionally.<br />But it is also England and her people that need rescuing from a corrupt dictatorship, can two lone people possibly make a difference?<br /><br />Wonderful uses of color and lighting authentically nail the feel of each scene. Get your own copy.\nEntertaining and Well Paced\nNapoleon Dynamite - Like, the Best Special Edition Ever!\nJon Heder  (Actor),     Efren Ramirez  (Actor),     Jared Hess  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n['Product Description', \"Napoleon Dynamite is a new kind of hero, complete with a tight red 'fro, sweet moon boots, and skills that can\\x92t be topped. Napoleon spends his days drawing mythical beasts, duking it out with his brother, Kip, and avoiding his scheming Uncle Rico. When t\", 'Amazon.com', 'Stills from', 'Napolean Dynamite', '(Click for larger image)']\n{'Genre': 'Comedy', 'Format': \"Multiple Formats, Color, NTSC, Widescreen, Collector's Edition\", 'Contributor': 'Haylie Duff, Tina Majorino, Jon Heder, Jon Gries, Bracken Johnson, Jerusha Hess, Shondrella Avery, Jared Hess, Aaron Ruell, Diedrich Bader, Sandy Martin, Trevor Snarr, Efren Ramirez, Carmen BradyHaylie Duff, Tina Majorino, Jon Heder, Jon Gries, Bracken Johnson, Jerusha Hess, Shondrella Avery, Jared Hess, Aaron Ruell, Diedrich Bader, Sandy Martin, Trevor Snarr, Efren Ramirez, Carmen Brady  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.1), Spanish (Dolby Digital 2.1)', 'Runtime': '1 hour and 22 minutes', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.56 x 5.31 x 0.51 inches; 2.88 Ounces', 'Director': 'Jared Hess', 'Media Format': \"Multiple Formats, Color, NTSC, Widescreen, Collector's Edition\", 'Run time': '1 hour and 22 minutes', 'Release date': 'May 16, 2006', 'Actors': 'Jon Heder, Efren Ramirez, Jon Gries, Aaron Ruell, Diedrich Bader', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Jared Hess, Jerusha Hess', 'Number of discs': '2'}\n....or you are a big old Dork like me. The kind that votes for Pedro.<br /><br />Almost every time this silly movie is on TV, I watch it. And it plays on TV quite a bit.<br />That's a heck of a lot of time to waste, watching Kip play footsies with La Fawnduh or seeing those moon boots attempt to moonwalk.<br /><br />So, if I buy a copy, I'll never have to watch it on TV again, right?<br /><br />Well, I just finished watching it again on E!, and realized I've never even unwrapped this DVD after purchasing it here on Amazon quite a while ago.<br /><br />And now I'm craving Tater Tots.\nYou either get it or you don't...\nHannah Free\nSharon Gless  (Actor),     Maureen Gallagher  (Actor),     Wendy Jo Carlton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Starring multi-award winner Sharon Gless (Burn Notice, Queer as Folk, Cagney & Lacey) in a tremendous performance, Hannah Free tells the moving story of the lifelong love affair between two very different women. Weaving between past and present, the story reveals how they maintained their love affair despite a marriage, a world war, infidelity, and family denial. Additional actors include Maureen Gallagher, Ann Hagemann, Kelli Strickland, Taylor Miller (All My Children) and Jacqui Jackson.', 'Review', \"A terrific role for Sharon Gless, who runs with it gloriously! Los Angeles Times Beautiful . .. (Hannah is) masterfully played by Sharon Gless. Slant Magazine Ms. Gless delivers a stellar performance that is gritty, poignant, and real. Huffington Post Even at death s door, a lesbian couple still finds peace elusive. Stephen Holden, NY Times ... Sharon Gless captures the spotlight. Chicago Tribune Effortlessly shares the quintessential love story of two women. SF Examiner.com Sharon Gless's fire, candor and heart drive this intimate story. LA Splash Sharon Gless brings grit, authenticity and dimension to the title character. She commands the screen. San Francisco Chronicle Love scenes with Rachel and Hannah as mature older woman are beautiful in depicting how a love can age like fine wine. New York Q News This level of interpersonal lesbian drama definitely gives the women of The L Word a run for their money! After Ellen (Logo Online) --Wolfe\"]\n{'Genre': 'Performing Arts', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Sharon Gless, Maureen Gallagher, Wendy Jo Carlton, Jacqui Jackson, Ann Hagemann, Kelli Strickland, Taylor MillerSharon Gless, Maureen Gallagher, Wendy Jo Carlton, Jacqui Jackson, Ann Hagemann, Kelli Strickland, Taylor Miller  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 26 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Wendy Jo Carlton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Sharon Gless, Maureen Gallagher, Ann Hagemann, Kelli Strickland, Taylor Miller', 'Studio': 'Wolfe Video', 'Number of discs': '1'}\nTo begin, I must disclose that I was one of the co-producers of this film.<br />Starring Sharon Gless of Cagney & Lacey, and more currently Burn Notice (among many other acting accomplishments), this film is based on famed Chicago playwright Claudia Allen's work of the same name.<br />Told primarily through flashbacks, it is the story of two women, Hannah (Gless) and Rachel that have loved each other for decades, but as elderly women in a nursing facility, Rachel is now in a coma with the expectation that death is imminent.<br />Her family has long struggled to understand the relationship, and in an effort to give themselves peace and closure, they have decided to prevent Hannah from seeing her beloved Rachel one last time before she passes. They hold all of the legal strings to do so, as this was before any recognition, be it civil union or marriage, could be given the couple.<br /><br />Hannah is a flawed woman, not always rising to the occasion for Rachel, played beautifully by the luminous Ann Hagemann (The Showdown, Fall Away). The film captures the viewer as the history and current turmoil is told, however, the ending was slightly reworked, and not for the better. Sadly, at the final few moments, it sinks to a bit of hokey, in my opinion.<br /><br />The acting, the story, so much of this film is good. It could have been better, but still worth a watch.<br /><br />As a bit of an aside, many of the actors and participants worked for less than their usual fee because they felt the story was important. Ms. Gless, who has long been married to Cagney & Lacey creator Barney Rosenzweig, has never forgotten her gay fan base.<br />At a time when so many are only 'in it for the money', being a part of this project was a privilege.\nWorth Watching, up to a point\nSwing Dance Instructions on DVD: Beginner's Swing Volume 1, A Step-by-Step Guide\nFormat: DVD\nMovies & TV, Movies\n{'Media Format': 'DVD'}\nI don't think there is a more fun type of music than swing, the only music peppy enough to get a war torn world from the 1940s up and dancing.<br /><br />It's even more fun to DANCE swing!<br />I took a few ballroom and tango lessons many, many years ago, way before Dancing with the Stars was even conceived. Loved it, but lessons are expensive, and keeping appointments has never been a strong point.<br />Other than a few (and I mean VERY few) basics, little is remembered from those lessons.<br /><br />This DVD has you off the couch and dancing before you know it! The instructors are easy to follow, you see each step broken down slowly.<br />If you've never danced a step before, this is truly the way to go.<br /><br />Give a copy to each member of your wedding party, or have a group 'dance class'. The DVD shows how even just a few easy steps can have you dancing and lookin' swell, Daddy-O!<br /><br />DISCLOSURE: Product received to test, with the option to review. No financial compensation is EVER accepted. Views and opinions are my own.\nDig That CRAZY Beat, Daddy-O!",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: The Bollywood Dance Workout with Hemalayaa\nReview Date: 2010/10/13\nStore: Hemalayaa  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Product Description', 'Fitness instructor Hemalayaa mixes yoga techniques with Bollywood dance moves for a fun and invigorating exercise routine. BOLLYWOOD DANCE WORKOUT WITH HEMALAYAA presents a full program of dancing, stretching, and general fitness that will improve flexibility, strength, and cardiovascular health.', 'Review', 'Hallelujah. Hemalayaa has finally raised the bar in dance workout videos. --', 'St. Louis Post-Dispatch', \"Fun with a capital F. It's a good way to shake up your regular workout. --\", 'Dallas Morning News', \"Hemalayaa's teachings are infused with her training and passion for Indian dance, and this release embodies this passion most purely. --\", 'Yogi Times, March 2007', \"A fun way to burn calories, but sassy enough to make you feel like you're a sexy Bombay lovegoddess. --\", 'Oxygen, November 2007', 'A fun, inspiring teacher. --', 'Spartanburg Herald-Joural', 'A unique workout that will encourage you to get your brain and body moving. --', 'Santa Barbara Independent, February 1, 2007', 'The workout is playful and it is fun, exactly what a dance workout should be. --', 'FitSugar.com']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Hemalayaa', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '2229017', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '50 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Hemalayaa', 'Studio': 'ACORN MEDIA', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I am an older full figured woman who does not get much exercise. A distant gal-pal told me she had started this and said \"Shannon, this odd bump is protruding from my face! It's my CHIN!\"(she is hilarious)<br />I decided to give it a try. Previously, I had watched maybe 5 minutes of Tae Bo, 2 of a Richard Simmons, and seconds of an overpriced infomercial one. WOW! I LOVE this! It is for a beginner, others may find it too low cardio. For me it is a fun dance that someone sweetly talks you through. Great camerawork, and as Ms H says, it's most important to have fun. At last, a workout that you feel great about it AND yourself, no matter what level. You also can't help but feel beautiful and powerful with these sensual movements. And I don't need to move furniture, unless I want to, lol! That means you can download it to your travel computer (SO easy with Amazon's video library) and do it at a hotel. This was my first try at Amazon's library feature, if you haven't tried it, it is TERRIFIC!<br />But back to this video...her voice is like silk, which is important if you plan on watching over and over. This is a wonderful way to start moving if you are very large or have been inactive for a long time because it is very easy to adapt to anyone's limitations. By the same token, as you progress, it's just as easy to kick it up. All this for less than the price of one class!\nReview Title: A BEGINNERS Delight!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Elf (DVD)\nReview Date: 2014/03/29\nStore: Jon Favreau  (Director),     Leon Redbone  (Actor),     Will Ferrell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Product Description', \"This hilarious Christmas film tells the tale of a young orphan child who mistakenly crawls into Santa's bag of gifts on Christmas Eve and is transported back to the North Pole and raised as an elf. Years later Buddy learns he is not really an elf and goes on a journey to New York City to find his true identity.\", 'DVD Features:', 'Audio Commentary:', '2 commentaries with Will Ferrell & Director', 'DVD ROM Features', 'Deleted Scenes', 'Featurette:', 'Film school for kids Tag along with Will Ferrell How they made the North Pole Kids on Christmas and more!', 'Amazon.com', 'Elf', 'is genuinely good. Not just', 'Saturday Night Live', '-movie good, when the movie has some funny bits but is basically an insult to humanity;', 'Elf', 'is a smartly written, skillfully directed, and deftly acted story of a human being adopted by Christmas elves who returns to the human world to find his father. And because the writing, directing, and acting are all genuinely good,', 'Elf', 'is also genuinely funny. Will Ferrell, as Buddy the adopted elf, is hysterically sincere. James Caan, as his rediscovered father, executes his surly dumbfoundedness with perfect aplomb. Zooey Deschanel, as a department store worker with whom Buddy falls in love, is adorably sardonic. Director Jon Favreau (', 'Swingers', \") shepherds the movie through all the obligatory Christmas cliches and focuses on material that's sometimes subtle and consistently surprising. Frankly,\", 'Elf', 'feels miraculous. Also featuring Mary Steenburgen, Bob Newhart, Peter Dinklage, and Ed Asner as Santa Claus.', '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': 'NEWL7168DVD', 'Director': 'Jon Favreau', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 24, 2006', 'Actors': 'Leon Redbone, Will Ferrell, James Caan, Ray Harryhausen, Zooey Deschanel', 'Dubbed': 'Spanish', 'Subtitles': 'English, Korean, French, Thai, Portuguese, Spanish, Indonesian', 'Producers': 'Jon Berg, Toby Emmerich, Kent Alterman, Todd Komarnicki, Cale Boyter', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Studio': 'WarnerBrothers', 'Writers': 'David Berenbaum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: No, it isn't Citizen Kane. But it's one of the best 'feel good' movies that is entertaining for all ages.<br /><br />A baby in an orphanage sneaks into Santa's bag, winding up at the North Pole. The diaper tag reads 'Little Buddy Diapers' so it is assumed by the elves that his name is Buddy. Adopted and raised by the hilariously deadpan Bob Newhart, Buddy becomes suspicious when it becomes clear that he isn't quite like all the other elves.<br />Off to New York he goes, to connect with his biological father. One problem...<br /><br />Dad's on the NAUGHTY list!<br /><br />Child-like and without malice of any sort, Will Farrell's Buddy reminds us of the beauty of innocence and kindness.<br /><br />Well, perhaps not always beautiful, as a naive Buddy tries to hug a city hardened raccoon!<br />Or find common ground with 'an angry little elf'. That particular scene is so memorably funny that when faced with negative people, my sweetie and I look at each other and say in unison, &#34;He's an ANGRY little elf!&#34;<br /><br />Christmas classic that is fun all year round. Cheers!\nReview Title: Anytime of year, it makes you smile!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: V For Vendetta (Widescreen)\nReview Date: 2014/06/02\nStore: Natalie Portman  (Actor),     Hugo Weaving  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['\"Remember, remember the fifth of November,\" for on this day, in 2020, the minds of the masses shall be set free. So says code-name V (Hugo Weaving), a man on a mission to shake society out of its blank complacent stares in the film V for Vendetta. His tac']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Widescreen, NTSC', 'Contributor': 'Rupert Graves, Stephen Rea, Hugo Weaving, Natalie Portman, Stephen Fry', 'Language': 'English (Dolby Digital 5.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Widescreen, NTSC', 'Actors': 'Natalie Portman, Hugo Weaving, Rupert Graves, Stephen Rea, Stephen Fry'}\nReview Text: I had assumed just from the title that this was a film that wouldn't be my cup of tea.<br />Now here I am buying my third copy! It's one of the favorites that gets loaned out without an expectation of being returned, I love sharing it.<br />Evey (Natalie Portman) has a low level job at the state-run broadcast/media station. Being outside after curfew in an Orwellian England proves to be dangerous indeed, but a mysterious masked man known as The Terrorist (Hugo Weaving) comes her rescue. Within days, she is given the chance to return the favor, and protects him.<br />Over the next year, they continue to save each other, in every way that a person can be saved...physically, spiritually, and emotionally.<br />But it is also England and her people that need rescuing from a corrupt dictatorship, can two lone people possibly make a difference?<br /><br />Wonderful uses of color and lighting authentically nail the feel of each scene. Get your own copy.\nReview Title: Entertaining and Well Paced\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Napoleon Dynamite - Like, the Best Special Edition Ever!\nReview Date: 2014/08/09\nStore: Jon Heder  (Actor),     Efren Ramirez  (Actor),     Jared Hess  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, Special Editions\nProduct Description: ['Product Description', \"Napoleon Dynamite is a new kind of hero, complete with a tight red 'fro, sweet moon boots, and skills that can\\x92t be topped. Napoleon spends his days drawing mythical beasts, duking it out with his brother, Kip, and avoiding his scheming Uncle Rico. When t\", 'Amazon.com', 'Stills from', 'Napolean Dynamite', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': \"Multiple Formats, Color, NTSC, Widescreen, Collector's Edition\", 'Contributor': 'Haylie Duff, Tina Majorino, Jon Heder, Jon Gries, Bracken Johnson, Jerusha Hess, Shondrella Avery, Jared Hess, Aaron Ruell, Diedrich Bader, Sandy Martin, Trevor Snarr, Efren Ramirez, Carmen BradyHaylie Duff, Tina Majorino, Jon Heder, Jon Gries, Bracken Johnson, Jerusha Hess, Shondrella Avery, Jared Hess, Aaron Ruell, Diedrich Bader, Sandy Martin, Trevor Snarr, Efren Ramirez, Carmen Brady  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.1), Spanish (Dolby Digital 2.1)', 'Runtime': '1 hour and 22 minutes', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.56 x 5.31 x 0.51 inches; 2.88 Ounces', 'Director': 'Jared Hess', 'Media Format': \"Multiple Formats, Color, NTSC, Widescreen, Collector's Edition\", 'Run time': '1 hour and 22 minutes', 'Release date': 'May 16, 2006', 'Actors': 'Jon Heder, Efren Ramirez, Jon Gries, Aaron Ruell, Diedrich Bader', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Jared Hess, Jerusha Hess', 'Number of discs': '2'}\nReview Text: ....or you are a big old Dork like me. The kind that votes for Pedro.<br /><br />Almost every time this silly movie is on TV, I watch it. And it plays on TV quite a bit.<br />That's a heck of a lot of time to waste, watching Kip play footsies with La Fawnduh or seeing those moon boots attempt to moonwalk.<br /><br />So, if I buy a copy, I'll never have to watch it on TV again, right?<br /><br />Well, I just finished watching it again on E!, and realized I've never even unwrapped this DVD after purchasing it here on Amazon quite a while ago.<br /><br />And now I'm craving Tater Tots.\nReview Title: You either get it or you don't...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hannah Free\nReview Date: 2014/09/18\nStore: Sharon Gless  (Actor),     Maureen Gallagher  (Actor),     Wendy Jo Carlton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Starring multi-award winner Sharon Gless (Burn Notice, Queer as Folk, Cagney & Lacey) in a tremendous performance, Hannah Free tells the moving story of the lifelong love affair between two very different women. Weaving between past and present, the story reveals how they maintained their love affair despite a marriage, a world war, infidelity, and family denial. Additional actors include Maureen Gallagher, Ann Hagemann, Kelli Strickland, Taylor Miller (All My Children) and Jacqui Jackson.', 'Review', \"A terrific role for Sharon Gless, who runs with it gloriously! Los Angeles Times Beautiful . .. (Hannah is) masterfully played by Sharon Gless. Slant Magazine Ms. Gless delivers a stellar performance that is gritty, poignant, and real. Huffington Post Even at death s door, a lesbian couple still finds peace elusive. Stephen Holden, NY Times ... Sharon Gless captures the spotlight. Chicago Tribune Effortlessly shares the quintessential love story of two women. SF Examiner.com Sharon Gless's fire, candor and heart drive this intimate story. LA Splash Sharon Gless brings grit, authenticity and dimension to the title character. She commands the screen. San Francisco Chronicle Love scenes with Rachel and Hannah as mature older woman are beautiful in depicting how a love can age like fine wine. New York Q News This level of interpersonal lesbian drama definitely gives the women of The L Word a run for their money! After Ellen (Logo Online) --Wolfe\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Performing Arts', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Sharon Gless, Maureen Gallagher, Wendy Jo Carlton, Jacqui Jackson, Ann Hagemann, Kelli Strickland, Taylor MillerSharon Gless, Maureen Gallagher, Wendy Jo Carlton, Jacqui Jackson, Ann Hagemann, Kelli Strickland, Taylor Miller  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 26 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Wendy Jo Carlton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Sharon Gless, Maureen Gallagher, Ann Hagemann, Kelli Strickland, Taylor Miller', 'Studio': 'Wolfe Video', 'Number of discs': '1'}\nReview Text: To begin, I must disclose that I was one of the co-producers of this film.<br />Starring Sharon Gless of Cagney & Lacey, and more currently Burn Notice (among many other acting accomplishments), this film is based on famed Chicago playwright Claudia Allen's work of the same name.<br />Told primarily through flashbacks, it is the story of two women, Hannah (Gless) and Rachel that have loved each other for decades, but as elderly women in a nursing facility, Rachel is now in a coma with the expectation that death is imminent.<br />Her family has long struggled to understand the relationship, and in an effort to give themselves peace and closure, they have decided to prevent Hannah from seeing her beloved Rachel one last time before she passes. They hold all of the legal strings to do so, as this was before any recognition, be it civil union or marriage, could be given the couple.<br /><br />Hannah is a flawed woman, not always rising to the occasion for Rachel, played beautifully by the luminous Ann Hagemann (The Showdown, Fall Away). The film captures the viewer as the history and current turmoil is told, however, the ending was slightly reworked, and not for the better. Sadly, at the final few moments, it sinks to a bit of hokey, in my opinion.<br /><br />The acting, the story, so much of this film is good. It could have been better, but still worth a watch.<br /><br />As a bit of an aside, many of the actors and participants worked for less than their usual fee because they felt the story was important. Ms. Gless, who has long been married to Cagney & Lacey creator Barney Rosenzweig, has never forgotten her gay fan base.<br />At a time when so many are only 'in it for the money', being a part of this project was a privilege.\nReview Title: Worth Watching, up to a point\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Swing Dance Instructions on DVD: Beginner's Swing Volume 1, A Step-by-Step Guide\nReview Date: 2015/02/10\nStore: Format: DVD\nCategories: Movies & TV, Movies\nAverage Rating: 5.0\nProduct Details: {'Media Format': 'DVD'}\nReview Text: I don't think there is a more fun type of music than swing, the only music peppy enough to get a war torn world from the 1940s up and dancing.<br /><br />It's even more fun to DANCE swing!<br />I took a few ballroom and tango lessons many, many years ago, way before Dancing with the Stars was even conceived. Loved it, but lessons are expensive, and keeping appointments has never been a strong point.<br />Other than a few (and I mean VERY few) basics, little is remembered from those lessons.<br /><br />This DVD has you off the couch and dancing before you know it! The instructors are easy to follow, you see each step broken down slowly.<br />If you've never danced a step before, this is truly the way to go.<br /><br />Give a copy to each member of your wedding party, or have a group 'dance class'. The DVD shows how even just a few easy steps can have you dancing and lookin' swell, Daddy-O!<br /><br />DISCLOSURE: Product received to test, with the option to review. No financial compensation is EVER accepted. Views and opinions are my own.\nReview Title: Dig That CRAZY Beat, Daddy-O!\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual demonstrates a strong preference for fun, engaging, and accessible workout and entertainment options, particularly in the form of dance and comedy. Their evaluations reflect consistent positivity, often awarding high ratings, particularly for products that promote enjoyable and beginner-friendly exercise routines. A common theme is the fusion of fitness with enjoyable experiences such as dance, indicating a preference for products that offer both physical and emotional benefits.\n\nThe focus on light-hearted comedy, especially family-friendly and feel-good films, suggests a desire for uplifting content that can be enjoyed repeatedly. This person also exhibits an appreciation for unique storytelling, as evidenced by their purchases across various genres, including drama and nuanced narratives.\n\nQuality appears to take precedence over brand loyalty, as they remain responsive to innovative and creative offerings regardless of the specific creators. Price sensitivity seems moderate, as the individual expresses value for affordable options, highlighting the social aspects of enjoying products with others, particularly in dance settings.\n\nIn summary, this shopper values enjoyable and accessible fitness and entertainment options that provide social engagement and positive experiences, with a focus on fun and emotional well-being.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Still Worth a Watch",
    "text": "Back in the 80s, so many elements of this film were fresh and new, in particular the editing.<br />Because these techniques are now standard, the film has lost that edge. The 'wow' factor is gone. It doesn't hold up well, but it's really fun to see the early roles for some of the now famous actors like Jean Reno.<br />It is the story of a woman that married for money and security, and the man from her past that is still obsessed with her.<br />He crashes back into her life by stealing incriminating papers from her shady dealing husband, who sends both her and his goons to retrieve the documents.<br />Wish it were subtitled instead of dubbed.",
    "images": [],
    "asin": "B00JXICO8Q",
    "parent_asin": "B00JXICO8Q",
    "user_id": "AEAXAJACFMXIAAH4WOHRMXPSZWFA",
    "timestamp": "2016-03-13 15:12:32",
    "helpful_vote": 5,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.0,
    "rating_number": 455,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/eb9acd4ee6fa3f076091558da65630d9948c16d0df4268bc42ae98a8e1007310._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/eb9acd4ee6fa3f076091558da65630d9948c16d0df4268bc42ae98a8e1007310._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/eb9acd4ee6fa3f076091558da65630d9948c16d0df4268bc42ae98a8e1007310._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/eb9acd4ee6fa3f076091558da65630d9948c16d0df4268bc42ae98a8e1007310._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/eb9acd4ee6fa3f076091558da65630d9948c16d0df4268bc42ae98a8e1007310._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/eb9acd4ee6fa3f076091558da65630d9948c16d0df4268bc42ae98a8e1007310._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Subtitles": [
        "None available"
      ],
      "Directors": [
        "Luc Besson"
      ],
      "Producers": [
        "Luc Besson",
        "Louis Duchesne",
        "François Ruggieri"
      ],
      "Starring": [
        "Isabelle Adjani",
        "Christopher Lambert",
        "Richard Bohringer"
      ],
      "Studio": [
        "Under The Milky Way"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}