{
  "user_id": "AGL6YWM6SX22YRIBEHXKRK6IS6WA",
  "summary": "=== Purchase Information ===\nProduct Title: Hostiles\nReview Date: 2019/04/19\nStore: Rosamund Pike  (Actor),     Jesse Plemons  (Actor),     Scott Cooper  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Adventure', 'Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund PikeChristian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund Pike   See more', 'Language': 'English', 'Runtime': '2 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'B079ZT1TYC', 'Director': 'Scott Cooper', 'Media Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'April 24, 2018', 'Actors': 'Rosamund Pike, Jesse Plemons, Ben Foster, Stephen Lang, Adam Beach', 'Subtitles': 'Spanish', 'Producers': 'Ken Kao, Scott Cooper, John Lesher', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: It's very good .\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/06/26\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['David Hayter'], 'Producers': ['Steven Hoban'], 'Starring': ['Jason Momoa', 'Lucas Till', 'Merritt Patterson'], 'Studio': ['Anderson Digital']}\nReview Text: Love it\nReview Title: 3❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Horror Double Feature (Hellraiser / Hellbound: Hellraiser 2)\nReview Date: 2019/06/26\nStore: Andrew Robinson  (Actor),     Ashley Laurence  (Actor),     Clive Barker  (Director),     Tony Randel  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Prepare to go to hell and back again in this double feature installment of one of the most iconic horror franchises of all time from horror master Clive Barker! See how it all began in the classic original HELLRAISER where Pinhead is introduced to the world, and the equally brilliant HELLBOUND sequel that proves there are no limits! HELLRAISER (1987, 94 Mins.): From horror master Clive Barker comes this chilling nightmare featuring the first appearance of the hideous, demonic Pinhead. When Kirsty Cotton’s family moves into their ancestral home, they are terrorized by the resurrected corpse of her uncle, who requires the flesh of murdered innocent victims in order to become whole and alive again. A creepy, thrillingly perverse tale straddling heaven and hell, extreme pleasure and unbearable pain, HELLRAISER will haunt your dreams. HELLBOUND: HELLRAISER 2 (1988, 99 Mins.): In 1988, it emerged as the shocking follow-up to the film that redefined the face of horror. Two decades later, it remains the most brutally original sequel in horror film history. Clare Higgins, Ashley Laurence and Kenneth Cranham co-star in this hit sequel from executive producer Clive Barker that experiences the flesh like no other. The time to play has come again: Surrender yourself to the infernal labyrinth of HELLBOUND: HELLRAISER II.']\nAverage Rating: 4.7\nProduct Details: {'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '25507355', 'Director': 'Clive Barker, Tony Randel', 'Media Format': 'Dolby, Color, Widescreen, Multiple Formats, NTSC', 'Run time': '3 hours and 13 minutes', 'Release date': 'September 4, 2012', 'Actors': 'Andrew Robinson, Ashley Laurence, Clare Higgins, Sean Chapman', 'Studio': 'Image Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: ❤❤❤❤❤❤❤\nReview Title: ❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Last of the Mohicans\nReview Date: 2019/06/26\nStore: Daniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Starring Daniel Day Lewis and Wes Studi. Includes deleted footage. (1992) Running time: 117 minutes.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '2200', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Mark Mann, Michael Mann, Hunt Lowry, Ned Dowd', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: ❤❤❤❤❤❤❤❤❤❤❤\nReview Title: ❤❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EDWARD SCISSORHANDS\nReview Date: 2019/06/26\nStore: Johnny Depp  (Actor),     Winona Ryder  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: [\"Celebrate the 25th anniversary of this beloved masterpiece starring Johnny Depp and directed by Tim Burton. Depp delivers the performance that launched his career, as Edward, an irresistibly charming creation with razor-sharp metal hands and a heart of gold. Edward's lonely life in a Gothic castle changes forever when he meets a kindhearted Avon Lady (Dianne Wiest), who takes him to a pastel paradise known as Suburbia. Thanks to his fantastic talents, Edward becomes a neighborhood sensation, but when he falls in love with Kim (Winona Ryder), he must go to extraordinary lengths to protect her.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Fantasy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Linda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susan J. Blommaert, O-Lan Jones, Robert Oliveri, Alan ArkinLinda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susa…   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2307933', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 13, 2015', 'Actors': 'Johnny Depp, Winona Ryder, Dianne Wiest, Anthony Michael Hall, Kathy Baker', 'Dubbed': 'French', 'Subtitles': 'Spanish, English', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Caroline Thompson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love Johnny\nReview Title: ❤❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sleepy Hollow (1999)\nReview Date: 2019/06/26\nStore: Johnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Sleepy Hollow (DVD)', 'Master storyteller Tim Burton (Batman, Edward Scissorhands) weaves an ee rie, enchanting version of this classic tale of horror. John ny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderou s Headless Horseman. Christina Ricci is Katrina V an Tassel, the beautif ul and mysterious girl with secret ties to the supernatural terror.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Christopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael GoughChristopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael Gough  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370409DVD', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 25 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: ❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dark Shadows\nReview Date: 2019/06/26\nStore: Johnny Depp  (Actor, Producer),     Michelle Pfeiffer  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Dark Shadows (DVD)', \"Continuing their creative and commercially incandescent partnership (Charlie and the Chocolate Factory, Sleepy Hollow, Edward Scissorhands), superstar Johnny Depp and macabre movie master Tim Burton reunite yet again in this silver screen adaptation of the cult classic supernatural soap opera that follows the life and loves of New England vampire Barnabas Collins. Also starring Michelle Pfeiffer (Batman Returns), Eva Green (Camelot), Helena Bonham Carter (Harry Potter) and Australian newcomer Bella Heathcote as a young woman who finds herself inexplicably entwined in the vampire's fated love story two centuries earlier, DARK SHADOWS brings to light Depp's vampire from 1752 into the lava lamped vamp camp of 1972!\", ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Eva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski, Richard D. Zanuck, Bella HeathcoteEva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'D279680D', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley', 'Subtitles': 'French, Spanish', 'Producers': 'Johnny Depp, Richard D. Zanuck, Graham King, Christi Dembrowski, David Kennedy', 'Studio': 'WarnerBrothers', 'Writers': 'Seth Grahame-Smith, John August', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: ❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Suicide Squad (DVD)\nReview Date: 2019/06/26\nStore: Will Smith  (Actor),     Jared Leto  (Actor),     David Ayer  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Suicide Squad: Special Edition (DVD)', 'It feels good to be bad… Assemble a team of the world’s most dangerous, incarcerated Super Villains, provide them with the most powerful arsenal at the government’s disposal, and send them off on a mission to defeat an enigmatic, insuperable entity. U.S. intelligence officer Amanda Waller has determined only a secretly convened group of disparate, despicable individuals with next to nothing to lose will do. However, once they realize they weren’t picked to succeed but chosen for their patent culpability when they inevitably fail, will the Suicide Squad resolve to die trying, or decide it’s every man for himself?', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Charles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin WilsonCharles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin Wilson   See more', 'Initial release date': '2016-12-13', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'D575439D', 'Director': 'David Ayer', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '2 hours and 3 minutes', 'Release date': 'December 13, 2016', 'Actors': 'Will Smith, Jared Leto, Margot Robbie, Joel Kinnaman, Viola Davis', 'Subtitles': 'French, Spanish, English', 'Producers': 'Zack Snyder, Charles Roven, Richard Suckle, Deborah Snyder, Colin Wilson', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Studio Distribution Services', 'Writers': 'David Ayer', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Cool\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Expendables 3\nReview Date: 2019/06/26\nStore: Sylvester Stallone  (Actor, Producer),     Jason Statham  (Actor),     Patrick Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Third film in the EXPENDABLES franchise.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny LernerKevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny Lerner  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Item model number': 'LGT46268DVD', 'Director': 'Patrick Hughes', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 50 minutes', 'Release date': 'November 25, 2014', 'Actors': 'Sylvester Stallone, Jason Statham, Jackie Chan, Dolph Lundgren, Nicolas Cage', 'Subtitles': 'English, Spanish', 'Producers': 'Sylvester Stallone, Kevin King Templeton, Les Weldon, Danny Lerner, Avi Lerner', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Cool\nReview Title: 😎\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hacksaw Ridge [DVD]\nReview Date: 2019/06/26\nStore: Andrew Garfield  (Actor),     Vince Vaughn  (Actor),     Mel Gibson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Product Description', 'The amazing true life story of Desmond Doss, the first conscientious objector ever to be awarded the Medal of Honor. A 7th Day Adventist who believed WWII was a just cause- even though killing was not- Doss was the only American soldier to serve on the front lines without a weapon, and single-handedly saved the lives of 75 men.', 'Review', 'Special Features Include:Deleted ScenesVeterans Day Greeting with Mel Gibson --Lionsgate']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Luke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian OliverLuke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian Oliver  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 19 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '43449040', 'Director': 'Mel Gibson', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'February 21, 2017', 'Actors': 'Andrew Garfield, Vince Vaughn, Rachel Griffiths, Hugo Weaving, Sam Worthington', 'Subtitles': 'Spanish', 'Producers': 'William Johnson, Brian Oliver, Paul Currie, Tyler Thompson, David Permut', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love\nReview Title: 😎\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alice Through the Looking Glass\nReview Date: 2019/06/30\nStore: Johnny Depp  (Actor),     Helena Bonham Carter  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Disney invites you to step through the looking glass and join Alice, the Mad Hatter, Cheshire Cat and the Red Queen on a wild ride back to Wonderland! The adventure begins when Alice embarks on a daring quest to save her dear friend the Hatter (Johnny Depp). Plunging back into the whimsical, topsy-turvy world of Wonderland with all her old companions and a host of zany new ones, Alice must take on Time himself to right a past wrong, find her muchness... and remember that nothing is impossible.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Matt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen FryMatt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen Fry   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936850901', 'Director': 'James Bobin', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 18, 2016', 'Actors': 'Johnny Depp, Helena Bonham Carter, Sacha Baron Cohen, Anne Hathaway, Mia Wasikowska', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Based On Characters Created By Lewis Carroll, Written By Linda Woolverton', 'Number of discs': '1'}\nReview Text: Love the movie. It come earlier then thought.\nReview Title: Wonderful movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Das Boot: The Original Uncut Miniseries\nReview Date: 2019/06/30\nStore: Jürgen Prochnow  (Actor),     Herbert Grönemeyer  (Actor),     Wolfgang Petersen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Cinematic WWII Classic!', 'Widely imitated yet never equaled, claustrophobic thriller', 'Das Boot', 'resurfaces in the definitive Original Uncut Version! At the height of WWII, a young submarine crew heads out to sea on a top-secret mission that all but ensures most will never make it home alive. Ordered to patrol the Atlantic and destroy an Allied armada bringing supplies to Britain, these raw recruits must band together, bracing themselves against a depth-charge assault from an unseen enemy - can the Captain and his crew summon the strength to escape their watery grave?', \"Oscar-nominated director Wolfgang Petersen's five-hour epic adventure deftly explores tensions as pressure builds to an explosive climax, packing a visceral punch few movies can match. As we hurtle through the sub's cramped quarters, telegraphing not only the controlled chaos of combat but the fearful faces of the U-boat's heroic crew, this adrenalin-rush of a war film still haunts audiences with one final heart-breaking dilemma: would you let others perish so you could survive?\", 'Nominated for 6 Oscars® Best Director, Best Writing, Best Cinematography, Best Film Editing and Best EffectsNominated for a Golden Globe® for Best Picture']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Wolfgang Petersen, Hubertus Bengsch, Bernd Tauber, Martin Semmelrogge, Klaus Wennemann, Jürgen Prochnow, Herbert GrönemeyerWolfgang Petersen, Hubertus Bengsch, Bernd Tauber, Martin Semmelrogge, Klaus Wennemann, Jürgen Prochnow, Herbert Grönemeyer  See more', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.88 Ounces', 'Director': 'Wolfgang Petersen', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '4 hours and 53 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann, Hubertus Bengsch, Martin Semmelrogge', 'Studio': 'Sony Pictures Home', 'Number of discs': '2'}\nReview Text: Movie skipped some but ok\nReview Title: Ok\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Soldier Blue\nReview Date: 2019/06/30\nStore: Candice Bergen  (Actor),     Peter Strauss  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['A wild west story of two survivors of an Indian attack who slowly fall in love.']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.54 x 5.34 x 7.41 inches; 0.71 Ounces', 'Item model number': '20569', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'December 12, 2006', 'Actors': 'Candice Bergen, Peter Strauss, Donald Pleasence, James Hampton, Mort Mills', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Digital 1.0)', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: Great\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Mummy Collector's Set (The Mummy/ The Mummy Returns/ The Scorpion King)\nReview Date: 2019/06/30\nStore: Brendon Fraser  (Actor),     Arnold Vosloo  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', \"Unearth non-stop action with The Mummy Collector's Set. Filled with spine-tingling suspense and amazing special effects, this 3-disc collection includes: The Mummy, The Mummy Returns and The Scorpion King. Adventure is reborn!Bonus Content:\", 'Disc 1 - The Mummy (1999):', 'Building a Better Mummy', 'Building a Better Mummy', 'Feature Commentary with Director Stephen Sommers and Editor Bob Ducsay', 'Feature Commentary with Director Stephen Sommers and Editor Bob Ducsay', 'Visual and Special Effects Formation', 'Visual and Special Effects Formation', 'Deleted Scenes', 'Deleted Scenes', 'Egyptology 101', 'Egyptology 101', 'Music Score Only', 'Music Score Only', 'Universal Showcase', 'Universal Showcase', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features Including an Interactive Mummy Game, 2 Screensavers and Electronic Postcards', 'DVD-ROM Features Including an Interactive Mummy Game, 2 Screensavers and Electronic Postcards', 'Disc 2 - The Mummy Returns:', 'An Exclusive Conversation with The Rock', 'An Exclusive Conversation with The Rock', 'Unlock the Secrets of The Scorpion King', 'Unlock the Secrets of The Scorpion King', 'Spotlight on Location: The Making of The Mummy Returns', 'Spotlight on Location: The Making of The Mummy Returns', 'Feature Commentary with Director / Writer Stephen Sommers and Executive Producer / Editor Bob Ducsay', 'Feature Commentary with Director / Writer Stephen Sommers and Executive Producer / Editor Bob Ducsay', 'Visual and Special Effects Formation', 'Visual and Special Effects Formation', 'Outtakes', 'Outtakes', 'Egyptology 201', 'Egyptology 201', 'Live \"Forever May Not Be Long Enough\" Music Video', 'Live \"Forever May Not Be Long Enough\" Music Video', 'The Mummy Returns Chamber of Doom', 'The Mummy Returns Chamber of Doom', 'Theatrical Trailer', 'Theatrical Trailer', 'A Special Message From Oded Fehr', 'A Special Message From Oded Fehr', 'The Mummy Returns Playstation 2 Game Trailer', 'The Mummy Returns Playstation 2 Game Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Recommendations', 'Recommendations', 'DVD-ROM Features Including The Mummy PC Game Demo and Screen Savers', 'DVD-ROM Features Including The Mummy PC Game Demo and Screen Savers', 'Disc 3 - The Scorpion King:', 'Alternate Version in Enhanced Viewing Mode', 'Alternate Version in Enhanced Viewing Mode', 'Enhanced Feature Commentary with The Rock', 'Enhanced Feature Commentary with The Rock', 'Outtakes', 'Outtakes', 'Alternate Versions of Key Scenes', 'Alternate Versions of Key Scenes', 'Spotlight on Location: The Making of The Scorpion King', 'Spotlight on Location: The Making of The Scorpion King', 'Ancient World Production Design', 'Ancient World Production Design', 'Preparing the Fight', 'Preparing the Fight', 'The Rock and Michael Clarke Duncan', 'The Rock and Michael Clarke Duncan', 'Working with Animals', 'Working with Animals', 'The Special Effects', 'The Special Effects', 'Godsmack \"I Stand Alone\" Music Video', 'Godsmack \"I Stand Alone\" Music Video', 'King Scorpion: Man or Myth?', 'King Scorpion: Man or Myth?', 'Theatrical Trailer', 'Theatrical Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Universal Showcase', 'Universal Showcase', 'The Scorpion King Movie Club', 'The Scorpion King Movie Club', 'DVD-ROM Features including Total Axess', 'DVD-ROM Features including Total Axess', 'Feature Commentary with Director Chuck Russell', 'Feature Commentary with Director Chuck Russell', 'Amazon.com', 'The Mummy', \"If you're expecting bandaged-wrapped corpses and a lurching Boris Karloff-type villain, then you've come to the wrong movie. But if outrageous effects, a hunky hero, and some hearty laughs are what you're looking for, the 1999 version of\", 'The Mummy', 'is spectacularly good fun. Yes, the critics called it \"hokey,\" \"cheesy,\" and \"pallid.\" Well, the critics are unjust. Granted, the plot tends to stray, the acting is a bit of a stretch, and the characters occasionally slip into cliché, but who cares? When that action gets going, hold tight--those two hours just fly by.', 'The premise of the movie isn\\'t that far off from the original. Egyptologist and general mess Evelyn (Rachel Weisz) discovers a map to the lost city of Hamunaptra, and so she hires rogue Rick O\\'Connell (Brendan Fraser) to lead her there. Once there, Evelyn accidentally unlocks the tomb of Imhotep (Arnold Vosloo), a man who had been buried alive a couple of millennia ago with flesh-eating bugs as punishment for sleeping with the pharaoh\\'s girlfriend. The ancient mummy is revived, and he is determined to bring his old love back to life, which of course means much mayhem (including the unleashing of the 10 plagues) and human sacrifice. Despite the rather gory premise, this movie is fairly tame in terms of violence; most of the magic and surprise come from the special effects, which are glorious to watch, although Imhotep, before being fully reconstituted, is, as one explorer puts it, rather \"juicy.\" Keep in mind this film is as much comedy as it is adventure--those looking for a straightforward horror pic will be disappointed. But for those who want good old-fashioned eye-candy kind of fun,', 'The Mummy', 'ranks as one of choicest flicks of 1999.', '--Jenny Brown', 'The Mummy Returns', 'Proving that bigger is rarely better,', 'The Mummy Returns', 'serves up so much action and so many computer-generated effects that it quickly grows exhausting. In his zeal to establish a lucrative franchise, writer-director Stephen Sommers dispenses with such trivial matters as character development and plot logic, and charges headlong into an almost random buffet of minimum story and maximum mayhem, beginning with a prologue establishing the ominous fate of the Scorpion King (played by World Wrestling Federation star the Rock, in a cameo teaser for his later starring role in--you guessed it--', 'The Scorpion King', '). Dormant for 5,000 years, under control of the Egyptian god Anubis, the Scorpion King will rise again in 1933, which is where we find', 'The Mummy', \"'s returning heroes Brendan Fraser and Rachel Weisz, now married and scouring Egyptian ruins with their 8-year-old son, Alex (Freddie Boath).\", \"John Hannah (as Weisz's brother) and Oded Fehr (as mystical warrior Ardeth Bay) also return from\", 'The Mummy', \", and trouble begins when Alex dons the Scorpion King's ancient bracelet, coveted by the evil mummy Imhotep (Arnold Vosloo), who's been revived by... oh, but does any of this matter? With a plot so disposable that it's impossible to care about anything that happens,\", 'The Mummy Returns', \"is best enjoyed as an intermittently amusing and physically impressive monument of Hollywood machinery, with gorgeous sets that scream for a better showcase, and digital trickery that tops its predecessor in ambition, if not in payoff. By the time our heroes encounter a hoard of ravenous pygmy mummies, you'll probably enjoy this movie in spite of itself.\", '--Jeff Shannon', 'The Scorpion King', \"There's nothing original in\", 'The Scorpion King', ', but this derivative action franchise gets off to a rousing start by cleverly stealing from a lot of better movies. Capitalizing on his brief cameo in', 'The Mummy Returns', \", Dwayne Johnson (a.k.a. World Wrestling Federation star the Rock) stars as Mathayus, an Akkadian assassin in the age preceding Egyptian pharaohs, who vows to avenge his brother's murder by an undefeated warlord (Steven Brand) prophesied to become the desert-ruling Scorpion King. Their battle for supremacy comprises most of the film's brisk 95-minute running time, punctuated by comic relief from Mathayus's obligatory sidekick (Grant Heslov), romance with a beautiful sorceress (Kelly Hu), and alliance with a massive Nubian (Michael Clarke Duncan) on the eve of their climactic showdown. There's no rhyme or reason to the film's depiction of ancient civilization (the costuming is particularly ludicrous), but the Rock demonstrates adequate action-star potential, and director Chuck Russell (\", 'The Mask', ') wraps it all in a slick, professional package.', '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & AdventureScience Fiction & Fantasy, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure  See more', 'Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Widescreen', 'Contributor': 'Arnold Vosloo, The Rock, Brendon Fraser', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround)', 'Runtime': '5 hours and 47 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Widescreen', 'Run time': '5 hours and 47 minutes', 'Release date': 'September 13, 2009', 'Actors': 'Brendon Fraser, Arnold Vosloo, The Rock', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: Great\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Thunderheart\nReview Date: 2019/06/30\nStore: Val Kilmer  (Actor),     Sam Shepard  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Val Kilmer, Sam Shepard and Graham Greene star in this powerful murder mystery with all the style and suspense of Witness. Kilmer stars as Ray Levoi, a hotshot FBI agent who's thrust into a strange new world when he is sent to solve a murder on an Indian reservation. Hand-picked because of his part-Sioux ancestry, Levoi is teamed with a legendary older agent (Shepard) to capture a radical Indian protester. But once on the reservation, Levoi encounters the irreverent local sheriff (Greene), and the tribe's religious leader (Chief Ted Thin Elk), who knows secrets about Levoi's own lost heritage. And as Levoi's awareness of the native culture grows, so does his belief that the U.S. government has framed an innocent man. A crackerjack mystery and a personal triumph of the heart.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, WidescreenMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, Widescreen  See more', 'Contributor': \"Julius Drum, Robert De Niro, Allan R.J. Joseph, Patrick Massett, Duane Brewer, Fred Dalton Thompson, Sam Shepard, Brian A. O'Meara, Dennis Banks, Ted Thin Elk, Fred Ward, Sarah Brave, Jerome Mack, Lewis C. Bradshaw, John Trudell, Rex Linn, Candy Hamilton, Val Kilmer, Graham Greene (II), Sheila Tousey, Sylvan Pumpkin SeedJulius Drum, Robert De Niro, Allan R.J. Joseph, Patrick Massett, Duane Brewer, Fred Dalton Thompson, Sam Shepard, Brian A. O'Meara, Dennis Banks, Ted Thin Elk, Fred Ward, Sarah Brave, Jerome Mack, Lewis C. Bradshaw, John Trudell, Rex Linn, Candy Hamilton, Val Kilmer…  See more\", 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '2227769', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, Widescreen', 'Run time': '2 hours and 2 minutes', 'Release date': 'April 24, 2003', 'Actors': 'Val Kilmer, Sam Shepard, Graham Greene (II), Fred Ward, Fred Dalton Thompson', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Robert De Niro', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Great movie\nReview Title: Very good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Practical Magic (Keep Case Packaging)\nReview Date: 2019/06/30\nStore: Sandra Bullock  (Actor),     Nicole Kidman  (Actor),     Griffin Dunne  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Product Description', \"If a broom falls, company is due. When a circle rings the moon, trouble looms, Should you misplace your broom, sorry; a hand vac can't be used in an exorcism rite. Fun and excitement abound in the Owens family of wily witches. One problem, though: the men the Owens women fall in love with are doomed to an untimely death.  Sandra Bullock and Nicole Kidman bring a sparkling screen magic to Practical Magic, adapted from Alice Hoffman's bestseller and directed by Griffin Dunne (Addicted to Love). They play Sally and Gillian Owens, sisters hexed by a centuries -old curse...and coping with a witches brew of events involving a possible love match (Aidan Quinn) for one, a zombie (Goran Visnjic) for the other and a need to resume the age-old witchcraft taught by two doting Owens aunts (Stockard Channing and Dianne Wiest). Sit for a spell and enjoy.\", 'Review', 'Actor Griffin Dunne improves a bit on his first film as a director,', 'Addicted to Love', \", with this drama-comedy about a family of witches. Nicole Kidman and Sandra Bullock play spell-casting sisters of different temperaments: the former is a high-living, free-spirited sort, while Bullock's character is a homebody who can't get around a family curse that kills the men in their lives. A widowed single mom, Bullock gets into a jam with an abusive Bulgarian (Goran Visnjic) and is helped out by her sibling, but the result brings a good-looking, warm, inquisitive cop (Aidan Quinn) into their lives. The film has a variety of tonal changes--cute, scary, glum--that Dunne can't always effectively juggle. But the female-centric, celebratory nature of the film (the fantasies, the sharing, the witchy bonds) is infectious, and supporting roles by Dianne Wiest and Stockard Channing as Kidman and Bullock's magical aunts are a lot of fun.\", '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Denise Di Novi, Evan Rachel Wood, Ellen Geer, Mark Feuerstein, Herta Ware, Robin Swicord, Bruce Berman, Alexandra Artrip, Chloe Webb, Goran Visnjic, Sandra Bullock, Caprice Benedetti, Mary McLaglen, Stockard Channing, Alice Hoffman, Nicole Kidman, Griffin Dunne, Dianne Wiest, Adam Brooks, Akiva Goldsman, Aidan QuinnDenise Di Novi, Evan Rachel Wood, Ellen Geer, Mark Feuerstein, Herta Ware, Robin Swicord, Bruce Berman, Alexandra Artrip, Chloe Webb, Goran Visnjic, Sandra Bullock, Caprice Benedetti, Mary McLaglen, Stockard Channing, Alice Hoffman, Nicole Kidman, Griffin Dunne,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '112617', 'Director': 'Griffin Dunne', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Sandra Bullock, Nicole Kidman, Dianne Wiest, Stockard Channing, Aidan Quinn', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Mary McLaglen, Denise Di Novi, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'Robin Swicord, Akiva Goldsman, Adam Brooks', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: Very happy\nRating: 5.0\n--------------------------------------------------",
  "reference": "Hostiles\nRosamund Pike  (Actor),     Jesse Plemons  (Actor),     Scott Cooper  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.']\n{'Genre': 'Adventure', 'Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund PikeChristian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund Pike   See more', 'Language': 'English', 'Runtime': '2 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'B079ZT1TYC', 'Director': 'Scott Cooper', 'Media Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'April 24, 2018', 'Actors': 'Rosamund Pike, Jesse Plemons, Ben Foster, Stephen Lang, Adam Beach', 'Subtitles': 'Spanish', 'Producers': 'Ken Kao, Scott Cooper, John Lesher', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt's very good .\nGreat\n{'Subtitles': ['None available'], 'Directors': ['David Hayter'], 'Producers': ['Steven Hoban'], 'Starring': ['Jason Momoa', 'Lucas Till', 'Merritt Patterson'], 'Studio': ['Anderson Digital']}\nLove it\n3❤\nHorror Double Feature (Hellraiser / Hellbound: Hellraiser 2)\nAndrew Robinson  (Actor),     Ashley Laurence  (Actor),     Clive Barker  (Director),     Tony Randel  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Prepare to go to hell and back again in this double feature installment of one of the most iconic horror franchises of all time from horror master Clive Barker! See how it all began in the classic original HELLRAISER where Pinhead is introduced to the world, and the equally brilliant HELLBOUND sequel that proves there are no limits! HELLRAISER (1987, 94 Mins.): From horror master Clive Barker comes this chilling nightmare featuring the first appearance of the hideous, demonic Pinhead. When Kirsty Cotton’s family moves into their ancestral home, they are terrorized by the resurrected corpse of her uncle, who requires the flesh of murdered innocent victims in order to become whole and alive again. A creepy, thrillingly perverse tale straddling heaven and hell, extreme pleasure and unbearable pain, HELLRAISER will haunt your dreams. HELLBOUND: HELLRAISER 2 (1988, 99 Mins.): In 1988, it emerged as the shocking follow-up to the film that redefined the face of horror. Two decades later, it remains the most brutally original sequel in horror film history. Clare Higgins, Ashley Laurence and Kenneth Cranham co-star in this hit sequel from executive producer Clive Barker that experiences the flesh like no other. The time to play has come again: Surrender yourself to the infernal labyrinth of HELLBOUND: HELLRAISER II.']\n{'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '25507355', 'Director': 'Clive Barker, Tony Randel', 'Media Format': 'Dolby, Color, Widescreen, Multiple Formats, NTSC', 'Run time': '3 hours and 13 minutes', 'Release date': 'September 4, 2012', 'Actors': 'Andrew Robinson, Ashley Laurence, Clare Higgins, Sean Chapman', 'Studio': 'Image Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\n❤❤❤❤❤❤❤\n❤\nThe Last of the Mohicans\nDaniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Starring Daniel Day Lewis and Wes Studi. Includes deleted footage. (1992) Running time: 117 minutes.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '2200', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Mark Mann, Michael Mann, Hunt Lowry, Ned Dowd', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\n❤❤❤❤❤❤❤❤❤❤❤\n❤❤\nEDWARD SCISSORHANDS\nJohnny Depp  (Actor),     Winona Ryder  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Celebrate the 25th anniversary of this beloved masterpiece starring Johnny Depp and directed by Tim Burton. Depp delivers the performance that launched his career, as Edward, an irresistibly charming creation with razor-sharp metal hands and a heart of gold. Edward's lonely life in a Gothic castle changes forever when he meets a kindhearted Avon Lady (Dianne Wiest), who takes him to a pastel paradise known as Suburbia. Thanks to his fantastic talents, Edward becomes a neighborhood sensation, but when he falls in love with Kim (Winona Ryder), he must go to extraordinary lengths to protect her.\"]\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Linda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susan J. Blommaert, O-Lan Jones, Robert Oliveri, Alan ArkinLinda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susa…   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2307933', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 13, 2015', 'Actors': 'Johnny Depp, Winona Ryder, Dianne Wiest, Anthony Michael Hall, Kathy Baker', 'Dubbed': 'French', 'Subtitles': 'Spanish, English', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Caroline Thompson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove Johnny\n❤❤\nSleepy Hollow (1999)\nJohnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Sleepy Hollow (DVD)', 'Master storyteller Tim Burton (Batman, Edward Scissorhands) weaves an ee rie, enchanting version of this classic tale of horror. John ny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderou s Headless Horseman. Christina Ricci is Katrina V an Tassel, the beautif ul and mysterious girl with secret ties to the supernatural terror.', ']]>']\n{'Genre': 'Horror, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Christopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael GoughChristopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael Gough  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370409DVD', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 25 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nLove it\n❤\nDark Shadows\nJohnny Depp  (Actor, Producer),     Michelle Pfeiffer  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Dark Shadows (DVD)', \"Continuing their creative and commercially incandescent partnership (Charlie and the Chocolate Factory, Sleepy Hollow, Edward Scissorhands), superstar Johnny Depp and macabre movie master Tim Burton reunite yet again in this silver screen adaptation of the cult classic supernatural soap opera that follows the life and loves of New England vampire Barnabas Collins. Also starring Michelle Pfeiffer (Batman Returns), Eva Green (Camelot), Helena Bonham Carter (Harry Potter) and Australian newcomer Bella Heathcote as a young woman who finds herself inexplicably entwined in the vampire's fated love story two centuries earlier, DARK SHADOWS brings to light Depp's vampire from 1752 into the lava lamped vamp camp of 1972!\", ']]>']\n{'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Eva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski, Richard D. Zanuck, Bella HeathcoteEva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'D279680D', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley', 'Subtitles': 'French, Spanish', 'Producers': 'Johnny Depp, Richard D. Zanuck, Graham King, Christi Dembrowski, David Kennedy', 'Studio': 'WarnerBrothers', 'Writers': 'Seth Grahame-Smith, John August', 'Number of discs': '1'}\nLove it\n❤\nSuicide Squad (DVD)\nWill Smith  (Actor),     Jared Leto  (Actor),     David Ayer  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Suicide Squad: Special Edition (DVD)', 'It feels good to be bad… Assemble a team of the world’s most dangerous, incarcerated Super Villains, provide them with the most powerful arsenal at the government’s disposal, and send them off on a mission to defeat an enigmatic, insuperable entity. U.S. intelligence officer Amanda Waller has determined only a secretly convened group of disparate, despicable individuals with next to nothing to lose will do. However, once they realize they weren’t picked to succeed but chosen for their patent culpability when they inevitably fail, will the Suicide Squad resolve to die trying, or decide it’s every man for himself?', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Charles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin WilsonCharles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin Wilson   See more', 'Initial release date': '2016-12-13', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'D575439D', 'Director': 'David Ayer', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '2 hours and 3 minutes', 'Release date': 'December 13, 2016', 'Actors': 'Will Smith, Jared Leto, Margot Robbie, Joel Kinnaman, Viola Davis', 'Subtitles': 'French, Spanish, English', 'Producers': 'Zack Snyder, Charles Roven, Richard Suckle, Deborah Snyder, Colin Wilson', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Studio Distribution Services', 'Writers': 'David Ayer', 'Number of discs': '2'}\nGood movie\nCool\nThe Expendables 3\nSylvester Stallone  (Actor, Producer),     Jason Statham  (Actor),     Patrick Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Third film in the EXPENDABLES franchise.']\n{'Genre': 'Action', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny LernerKevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny Lerner  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Item model number': 'LGT46268DVD', 'Director': 'Patrick Hughes', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 50 minutes', 'Release date': 'November 25, 2014', 'Actors': 'Sylvester Stallone, Jason Statham, Jackie Chan, Dolph Lundgren, Nicolas Cage', 'Subtitles': 'English, Spanish', 'Producers': 'Sylvester Stallone, Kevin King Templeton, Les Weldon, Danny Lerner, Avi Lerner', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nCool\n😎\nHacksaw Ridge [DVD]\nAndrew Garfield  (Actor),     Vince Vaughn  (Actor),     Mel Gibson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product Description', 'The amazing true life story of Desmond Doss, the first conscientious objector ever to be awarded the Medal of Honor. A 7th Day Adventist who believed WWII was a just cause- even though killing was not- Doss was the only American soldier to serve on the front lines without a weapon, and single-handedly saved the lives of 75 men.', 'Review', 'Special Features Include:Deleted ScenesVeterans Day Greeting with Mel Gibson --Lionsgate']\n{'Genre': 'Action', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Luke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian OliverLuke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian Oliver  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 19 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '43449040', 'Director': 'Mel Gibson', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'February 21, 2017', 'Actors': 'Andrew Garfield, Vince Vaughn, Rachel Griffiths, Hugo Weaving, Sam Worthington', 'Subtitles': 'Spanish', 'Producers': 'William Johnson, Brian Oliver, Paul Currie, Tyler Thompson, David Permut', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove\n😎\nAlice Through the Looking Glass\nJohnny Depp  (Actor),     Helena Bonham Carter  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney invites you to step through the looking glass and join Alice, the Mad Hatter, Cheshire Cat and the Red Queen on a wild ride back to Wonderland! The adventure begins when Alice embarks on a daring quest to save her dear friend the Hatter (Johnny Depp). Plunging back into the whimsical, topsy-turvy world of Wonderland with all her old companions and a host of zany new ones, Alice must take on Time himself to right a past wrong, find her muchness... and remember that nothing is impossible.']\n{'Genre': 'Action/Adventure', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Matt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen FryMatt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen Fry   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936850901', 'Director': 'James Bobin', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 18, 2016', 'Actors': 'Johnny Depp, Helena Bonham Carter, Sacha Baron Cohen, Anne Hathaway, Mia Wasikowska', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Based On Characters Created By Lewis Carroll, Written By Linda Woolverton', 'Number of discs': '1'}\nLove the movie. It come earlier then thought.\nWonderful movie\nDas Boot: The Original Uncut Miniseries\nJürgen Prochnow  (Actor),     Herbert Grönemeyer  (Actor),     Wolfgang Petersen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Cinematic WWII Classic!', 'Widely imitated yet never equaled, claustrophobic thriller', 'Das Boot', 'resurfaces in the definitive Original Uncut Version! At the height of WWII, a young submarine crew heads out to sea on a top-secret mission that all but ensures most will never make it home alive. Ordered to patrol the Atlantic and destroy an Allied armada bringing supplies to Britain, these raw recruits must band together, bracing themselves against a depth-charge assault from an unseen enemy - can the Captain and his crew summon the strength to escape their watery grave?', \"Oscar-nominated director Wolfgang Petersen's five-hour epic adventure deftly explores tensions as pressure builds to an explosive climax, packing a visceral punch few movies can match. As we hurtle through the sub's cramped quarters, telegraphing not only the controlled chaos of combat but the fearful faces of the U-boat's heroic crew, this adrenalin-rush of a war film still haunts audiences with one final heart-breaking dilemma: would you let others perish so you could survive?\", 'Nominated for 6 Oscars® Best Director, Best Writing, Best Cinematography, Best Film Editing and Best EffectsNominated for a Golden Globe® for Best Picture']\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Wolfgang Petersen, Hubertus Bengsch, Bernd Tauber, Martin Semmelrogge, Klaus Wennemann, Jürgen Prochnow, Herbert GrönemeyerWolfgang Petersen, Hubertus Bengsch, Bernd Tauber, Martin Semmelrogge, Klaus Wennemann, Jürgen Prochnow, Herbert Grönemeyer  See more', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.88 Ounces', 'Director': 'Wolfgang Petersen', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '4 hours and 53 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann, Hubertus Bengsch, Martin Semmelrogge', 'Studio': 'Sony Pictures Home', 'Number of discs': '2'}\nMovie skipped some but ok\nOk\nSoldier Blue\nCandice Bergen  (Actor),     Peter Strauss  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['A wild west story of two survivors of an Indian attack who slowly fall in love.']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.54 x 5.34 x 7.41 inches; 0.71 Ounces', 'Item model number': '20569', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'December 12, 2006', 'Actors': 'Candice Bergen, Peter Strauss, Donald Pleasence, James Hampton, Mort Mills', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Digital 1.0)', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nGreat\nGreat movie\nThe Mummy Collector's Set (The Mummy/ The Mummy Returns/ The Scorpion King)\nBrendon Fraser  (Actor),     Arnold Vosloo  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"Unearth non-stop action with The Mummy Collector's Set. Filled with spine-tingling suspense and amazing special effects, this 3-disc collection includes: The Mummy, The Mummy Returns and The Scorpion King. Adventure is reborn!Bonus Content:\", 'Disc 1 - The Mummy (1999):', 'Building a Better Mummy', 'Building a Better Mummy', 'Feature Commentary with Director Stephen Sommers and Editor Bob Ducsay', 'Feature Commentary with Director Stephen Sommers and Editor Bob Ducsay', 'Visual and Special Effects Formation', 'Visual and Special Effects Formation', 'Deleted Scenes', 'Deleted Scenes', 'Egyptology 101', 'Egyptology 101', 'Music Score Only', 'Music Score Only', 'Universal Showcase', 'Universal Showcase', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features Including an Interactive Mummy Game, 2 Screensavers and Electronic Postcards', 'DVD-ROM Features Including an Interactive Mummy Game, 2 Screensavers and Electronic Postcards', 'Disc 2 - The Mummy Returns:', 'An Exclusive Conversation with The Rock', 'An Exclusive Conversation with The Rock', 'Unlock the Secrets of The Scorpion King', 'Unlock the Secrets of The Scorpion King', 'Spotlight on Location: The Making of The Mummy Returns', 'Spotlight on Location: The Making of The Mummy Returns', 'Feature Commentary with Director / Writer Stephen Sommers and Executive Producer / Editor Bob Ducsay', 'Feature Commentary with Director / Writer Stephen Sommers and Executive Producer / Editor Bob Ducsay', 'Visual and Special Effects Formation', 'Visual and Special Effects Formation', 'Outtakes', 'Outtakes', 'Egyptology 201', 'Egyptology 201', 'Live \"Forever May Not Be Long Enough\" Music Video', 'Live \"Forever May Not Be Long Enough\" Music Video', 'The Mummy Returns Chamber of Doom', 'The Mummy Returns Chamber of Doom', 'Theatrical Trailer', 'Theatrical Trailer', 'A Special Message From Oded Fehr', 'A Special Message From Oded Fehr', 'The Mummy Returns Playstation 2 Game Trailer', 'The Mummy Returns Playstation 2 Game Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Recommendations', 'Recommendations', 'DVD-ROM Features Including The Mummy PC Game Demo and Screen Savers', 'DVD-ROM Features Including The Mummy PC Game Demo and Screen Savers', 'Disc 3 - The Scorpion King:', 'Alternate Version in Enhanced Viewing Mode', 'Alternate Version in Enhanced Viewing Mode', 'Enhanced Feature Commentary with The Rock', 'Enhanced Feature Commentary with The Rock', 'Outtakes', 'Outtakes', 'Alternate Versions of Key Scenes', 'Alternate Versions of Key Scenes', 'Spotlight on Location: The Making of The Scorpion King', 'Spotlight on Location: The Making of The Scorpion King', 'Ancient World Production Design', 'Ancient World Production Design', 'Preparing the Fight', 'Preparing the Fight', 'The Rock and Michael Clarke Duncan', 'The Rock and Michael Clarke Duncan', 'Working with Animals', 'Working with Animals', 'The Special Effects', 'The Special Effects', 'Godsmack \"I Stand Alone\" Music Video', 'Godsmack \"I Stand Alone\" Music Video', 'King Scorpion: Man or Myth?', 'King Scorpion: Man or Myth?', 'Theatrical Trailer', 'Theatrical Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Universal Showcase', 'Universal Showcase', 'The Scorpion King Movie Club', 'The Scorpion King Movie Club', 'DVD-ROM Features including Total Axess', 'DVD-ROM Features including Total Axess', 'Feature Commentary with Director Chuck Russell', 'Feature Commentary with Director Chuck Russell', 'Amazon.com', 'The Mummy', \"If you're expecting bandaged-wrapped corpses and a lurching Boris Karloff-type villain, then you've come to the wrong movie. But if outrageous effects, a hunky hero, and some hearty laughs are what you're looking for, the 1999 version of\", 'The Mummy', 'is spectacularly good fun. Yes, the critics called it \"hokey,\" \"cheesy,\" and \"pallid.\" Well, the critics are unjust. Granted, the plot tends to stray, the acting is a bit of a stretch, and the characters occasionally slip into cliché, but who cares? When that action gets going, hold tight--those two hours just fly by.', 'The premise of the movie isn\\'t that far off from the original. Egyptologist and general mess Evelyn (Rachel Weisz) discovers a map to the lost city of Hamunaptra, and so she hires rogue Rick O\\'Connell (Brendan Fraser) to lead her there. Once there, Evelyn accidentally unlocks the tomb of Imhotep (Arnold Vosloo), a man who had been buried alive a couple of millennia ago with flesh-eating bugs as punishment for sleeping with the pharaoh\\'s girlfriend. The ancient mummy is revived, and he is determined to bring his old love back to life, which of course means much mayhem (including the unleashing of the 10 plagues) and human sacrifice. Despite the rather gory premise, this movie is fairly tame in terms of violence; most of the magic and surprise come from the special effects, which are glorious to watch, although Imhotep, before being fully reconstituted, is, as one explorer puts it, rather \"juicy.\" Keep in mind this film is as much comedy as it is adventure--those looking for a straightforward horror pic will be disappointed. But for those who want good old-fashioned eye-candy kind of fun,', 'The Mummy', 'ranks as one of choicest flicks of 1999.', '--Jenny Brown', 'The Mummy Returns', 'Proving that bigger is rarely better,', 'The Mummy Returns', 'serves up so much action and so many computer-generated effects that it quickly grows exhausting. In his zeal to establish a lucrative franchise, writer-director Stephen Sommers dispenses with such trivial matters as character development and plot logic, and charges headlong into an almost random buffet of minimum story and maximum mayhem, beginning with a prologue establishing the ominous fate of the Scorpion King (played by World Wrestling Federation star the Rock, in a cameo teaser for his later starring role in--you guessed it--', 'The Scorpion King', '). Dormant for 5,000 years, under control of the Egyptian god Anubis, the Scorpion King will rise again in 1933, which is where we find', 'The Mummy', \"'s returning heroes Brendan Fraser and Rachel Weisz, now married and scouring Egyptian ruins with their 8-year-old son, Alex (Freddie Boath).\", \"John Hannah (as Weisz's brother) and Oded Fehr (as mystical warrior Ardeth Bay) also return from\", 'The Mummy', \", and trouble begins when Alex dons the Scorpion King's ancient bracelet, coveted by the evil mummy Imhotep (Arnold Vosloo), who's been revived by... oh, but does any of this matter? With a plot so disposable that it's impossible to care about anything that happens,\", 'The Mummy Returns', \"is best enjoyed as an intermittently amusing and physically impressive monument of Hollywood machinery, with gorgeous sets that scream for a better showcase, and digital trickery that tops its predecessor in ambition, if not in payoff. By the time our heroes encounter a hoard of ravenous pygmy mummies, you'll probably enjoy this movie in spite of itself.\", '--Jeff Shannon', 'The Scorpion King', \"There's nothing original in\", 'The Scorpion King', ', but this derivative action franchise gets off to a rousing start by cleverly stealing from a lot of better movies. Capitalizing on his brief cameo in', 'The Mummy Returns', \", Dwayne Johnson (a.k.a. World Wrestling Federation star the Rock) stars as Mathayus, an Akkadian assassin in the age preceding Egyptian pharaohs, who vows to avenge his brother's murder by an undefeated warlord (Steven Brand) prophesied to become the desert-ruling Scorpion King. Their battle for supremacy comprises most of the film's brisk 95-minute running time, punctuated by comic relief from Mathayus's obligatory sidekick (Grant Heslov), romance with a beautiful sorceress (Kelly Hu), and alliance with a massive Nubian (Michael Clarke Duncan) on the eve of their climactic showdown. There's no rhyme or reason to the film's depiction of ancient civilization (the costuming is particularly ludicrous), but the Rock demonstrates adequate action-star potential, and director Chuck Russell (\", 'The Mask', ') wraps it all in a slick, professional package.', '--Jeff Shannon']\n{'Genre': 'Science Fiction & Fantasy, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & AdventureScience Fiction & Fantasy, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure  See more', 'Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Widescreen', 'Contributor': 'Arnold Vosloo, The Rock, Brendon Fraser', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround)', 'Runtime': '5 hours and 47 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Widescreen', 'Run time': '5 hours and 47 minutes', 'Release date': 'September 13, 2009', 'Actors': 'Brendon Fraser, Arnold Vosloo, The Rock', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nGreat\nGreat\nThunderheart\nVal Kilmer  (Actor),     Sam Shepard  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Val Kilmer, Sam Shepard and Graham Greene star in this powerful murder mystery with all the style and suspense of Witness. Kilmer stars as Ray Levoi, a hotshot FBI agent who's thrust into a strange new world when he is sent to solve a murder on an Indian reservation. Hand-picked because of his part-Sioux ancestry, Levoi is teamed with a legendary older agent (Shepard) to capture a radical Indian protester. But once on the reservation, Levoi encounters the irreverent local sheriff (Greene), and the tribe's religious leader (Chief Ted Thin Elk), who knows secrets about Levoi's own lost heritage. And as Levoi's awareness of the native culture grows, so does his belief that the U.S. government has framed an innocent man. A crackerjack mystery and a personal triumph of the heart.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, WidescreenMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, Widescreen  See more', 'Contributor': \"Julius Drum, Robert De Niro, Allan R.J. Joseph, Patrick Massett, Duane Brewer, Fred Dalton Thompson, Sam Shepard, Brian A. O'Meara, Dennis Banks, Ted Thin Elk, Fred Ward, Sarah Brave, Jerome Mack, Lewis C. Bradshaw, John Trudell, Rex Linn, Candy Hamilton, Val Kilmer, Graham Greene (II), Sheila Tousey, Sylvan Pumpkin SeedJulius Drum, Robert De Niro, Allan R.J. Joseph, Patrick Massett, Duane Brewer, Fred Dalton Thompson, Sam Shepard, Brian A. O'Meara, Dennis Banks, Ted Thin Elk, Fred Ward, Sarah Brave, Jerome Mack, Lewis C. Bradshaw, John Trudell, Rex Linn, Candy Hamilton, Val Kilmer…  See more\", 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '2227769', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, Widescreen', 'Run time': '2 hours and 2 minutes', 'Release date': 'April 24, 2003', 'Actors': 'Val Kilmer, Sam Shepard, Graham Greene (II), Fred Ward, Fred Dalton Thompson', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Robert De Niro', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nGreat movie\nVery good\nPractical Magic (Keep Case Packaging)\nSandra Bullock  (Actor),     Nicole Kidman  (Actor),     Griffin Dunne  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', \"If a broom falls, company is due. When a circle rings the moon, trouble looms, Should you misplace your broom, sorry; a hand vac can't be used in an exorcism rite. Fun and excitement abound in the Owens family of wily witches. One problem, though: the men the Owens women fall in love with are doomed to an untimely death.  Sandra Bullock and Nicole Kidman bring a sparkling screen magic to Practical Magic, adapted from Alice Hoffman's bestseller and directed by Griffin Dunne (Addicted to Love). They play Sally and Gillian Owens, sisters hexed by a centuries -old curse...and coping with a witches brew of events involving a possible love match (Aidan Quinn) for one, a zombie (Goran Visnjic) for the other and a need to resume the age-old witchcraft taught by two doting Owens aunts (Stockard Channing and Dianne Wiest). Sit for a spell and enjoy.\", 'Review', 'Actor Griffin Dunne improves a bit on his first film as a director,', 'Addicted to Love', \", with this drama-comedy about a family of witches. Nicole Kidman and Sandra Bullock play spell-casting sisters of different temperaments: the former is a high-living, free-spirited sort, while Bullock's character is a homebody who can't get around a family curse that kills the men in their lives. A widowed single mom, Bullock gets into a jam with an abusive Bulgarian (Goran Visnjic) and is helped out by her sibling, but the result brings a good-looking, warm, inquisitive cop (Aidan Quinn) into their lives. The film has a variety of tonal changes--cute, scary, glum--that Dunne can't always effectively juggle. But the female-centric, celebratory nature of the film (the fantasies, the sharing, the witchy bonds) is infectious, and supporting roles by Dianne Wiest and Stockard Channing as Kidman and Bullock's magical aunts are a lot of fun.\", '--Tom Keogh']\n{'Genre': 'Science Fiction & Fantasy, Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Denise Di Novi, Evan Rachel Wood, Ellen Geer, Mark Feuerstein, Herta Ware, Robin Swicord, Bruce Berman, Alexandra Artrip, Chloe Webb, Goran Visnjic, Sandra Bullock, Caprice Benedetti, Mary McLaglen, Stockard Channing, Alice Hoffman, Nicole Kidman, Griffin Dunne, Dianne Wiest, Adam Brooks, Akiva Goldsman, Aidan QuinnDenise Di Novi, Evan Rachel Wood, Ellen Geer, Mark Feuerstein, Herta Ware, Robin Swicord, Bruce Berman, Alexandra Artrip, Chloe Webb, Goran Visnjic, Sandra Bullock, Caprice Benedetti, Mary McLaglen, Stockard Channing, Alice Hoffman, Nicole Kidman, Griffin Dunne,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '112617', 'Director': 'Griffin Dunne', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Sandra Bullock, Nicole Kidman, Dianne Wiest, Stockard Channing, Aidan Quinn', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Mary McLaglen, Denise Di Novi, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'Robin Swicord, Akiva Goldsman, Adam Brooks', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove it\nVery happy",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Hostiles\nReview Date: 2019/04/19\nStore: Rosamund Pike  (Actor),     Jesse Plemons  (Actor),     Scott Cooper  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Adventure', 'Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund PikeChristian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund Pike   See more', 'Language': 'English', 'Runtime': '2 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'B079ZT1TYC', 'Director': 'Scott Cooper', 'Media Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'April 24, 2018', 'Actors': 'Rosamund Pike, Jesse Plemons, Ben Foster, Stephen Lang, Adam Beach', 'Subtitles': 'Spanish', 'Producers': 'Ken Kao, Scott Cooper, John Lesher', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: It's very good .\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/06/26\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['David Hayter'], 'Producers': ['Steven Hoban'], 'Starring': ['Jason Momoa', 'Lucas Till', 'Merritt Patterson'], 'Studio': ['Anderson Digital']}\nReview Text: Love it\nReview Title: 3❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Horror Double Feature (Hellraiser / Hellbound: Hellraiser 2)\nReview Date: 2019/06/26\nStore: Andrew Robinson  (Actor),     Ashley Laurence  (Actor),     Clive Barker  (Director),     Tony Randel  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Prepare to go to hell and back again in this double feature installment of one of the most iconic horror franchises of all time from horror master Clive Barker! See how it all began in the classic original HELLRAISER where Pinhead is introduced to the world, and the equally brilliant HELLBOUND sequel that proves there are no limits! HELLRAISER (1987, 94 Mins.): From horror master Clive Barker comes this chilling nightmare featuring the first appearance of the hideous, demonic Pinhead. When Kirsty Cotton’s family moves into their ancestral home, they are terrorized by the resurrected corpse of her uncle, who requires the flesh of murdered innocent victims in order to become whole and alive again. A creepy, thrillingly perverse tale straddling heaven and hell, extreme pleasure and unbearable pain, HELLRAISER will haunt your dreams. HELLBOUND: HELLRAISER 2 (1988, 99 Mins.): In 1988, it emerged as the shocking follow-up to the film that redefined the face of horror. Two decades later, it remains the most brutally original sequel in horror film history. Clare Higgins, Ashley Laurence and Kenneth Cranham co-star in this hit sequel from executive producer Clive Barker that experiences the flesh like no other. The time to play has come again: Surrender yourself to the infernal labyrinth of HELLBOUND: HELLRAISER II.']\nAverage Rating: 4.7\nProduct Details: {'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '25507355', 'Director': 'Clive Barker, Tony Randel', 'Media Format': 'Dolby, Color, Widescreen, Multiple Formats, NTSC', 'Run time': '3 hours and 13 minutes', 'Release date': 'September 4, 2012', 'Actors': 'Andrew Robinson, Ashley Laurence, Clare Higgins, Sean Chapman', 'Studio': 'Image Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: ❤❤❤❤❤❤❤\nReview Title: ❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Last of the Mohicans\nReview Date: 2019/06/26\nStore: Daniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Starring Daniel Day Lewis and Wes Studi. Includes deleted footage. (1992) Running time: 117 minutes.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '2200', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Mark Mann, Michael Mann, Hunt Lowry, Ned Dowd', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: ❤❤❤❤❤❤❤❤❤❤❤\nReview Title: ❤❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EDWARD SCISSORHANDS\nReview Date: 2019/06/26\nStore: Johnny Depp  (Actor),     Winona Ryder  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: [\"Celebrate the 25th anniversary of this beloved masterpiece starring Johnny Depp and directed by Tim Burton. Depp delivers the performance that launched his career, as Edward, an irresistibly charming creation with razor-sharp metal hands and a heart of gold. Edward's lonely life in a Gothic castle changes forever when he meets a kindhearted Avon Lady (Dianne Wiest), who takes him to a pastel paradise known as Suburbia. Thanks to his fantastic talents, Edward becomes a neighborhood sensation, but when he falls in love with Kim (Winona Ryder), he must go to extraordinary lengths to protect her.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Fantasy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Linda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susan J. Blommaert, O-Lan Jones, Robert Oliveri, Alan ArkinLinda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susa…   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2307933', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 13, 2015', 'Actors': 'Johnny Depp, Winona Ryder, Dianne Wiest, Anthony Michael Hall, Kathy Baker', 'Dubbed': 'French', 'Subtitles': 'Spanish, English', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Caroline Thompson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love Johnny\nReview Title: ❤❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sleepy Hollow (1999)\nReview Date: 2019/06/26\nStore: Johnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Sleepy Hollow (DVD)', 'Master storyteller Tim Burton (Batman, Edward Scissorhands) weaves an ee rie, enchanting version of this classic tale of horror. John ny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderou s Headless Horseman. Christina Ricci is Katrina V an Tassel, the beautif ul and mysterious girl with secret ties to the supernatural terror.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Christopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael GoughChristopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael Gough  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370409DVD', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 25 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: ❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dark Shadows\nReview Date: 2019/06/26\nStore: Johnny Depp  (Actor, Producer),     Michelle Pfeiffer  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Dark Shadows (DVD)', \"Continuing their creative and commercially incandescent partnership (Charlie and the Chocolate Factory, Sleepy Hollow, Edward Scissorhands), superstar Johnny Depp and macabre movie master Tim Burton reunite yet again in this silver screen adaptation of the cult classic supernatural soap opera that follows the life and loves of New England vampire Barnabas Collins. Also starring Michelle Pfeiffer (Batman Returns), Eva Green (Camelot), Helena Bonham Carter (Harry Potter) and Australian newcomer Bella Heathcote as a young woman who finds herself inexplicably entwined in the vampire's fated love story two centuries earlier, DARK SHADOWS brings to light Depp's vampire from 1752 into the lava lamped vamp camp of 1972!\", ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Eva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski, Richard D. Zanuck, Bella HeathcoteEva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'D279680D', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley', 'Subtitles': 'French, Spanish', 'Producers': 'Johnny Depp, Richard D. Zanuck, Graham King, Christi Dembrowski, David Kennedy', 'Studio': 'WarnerBrothers', 'Writers': 'Seth Grahame-Smith, John August', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: ❤\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Suicide Squad (DVD)\nReview Date: 2019/06/26\nStore: Will Smith  (Actor),     Jared Leto  (Actor),     David Ayer  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Suicide Squad: Special Edition (DVD)', 'It feels good to be bad… Assemble a team of the world’s most dangerous, incarcerated Super Villains, provide them with the most powerful arsenal at the government’s disposal, and send them off on a mission to defeat an enigmatic, insuperable entity. U.S. intelligence officer Amanda Waller has determined only a secretly convened group of disparate, despicable individuals with next to nothing to lose will do. However, once they realize they weren’t picked to succeed but chosen for their patent culpability when they inevitably fail, will the Suicide Squad resolve to die trying, or decide it’s every man for himself?', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Charles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin WilsonCharles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin Wilson   See more', 'Initial release date': '2016-12-13', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'D575439D', 'Director': 'David Ayer', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '2 hours and 3 minutes', 'Release date': 'December 13, 2016', 'Actors': 'Will Smith, Jared Leto, Margot Robbie, Joel Kinnaman, Viola Davis', 'Subtitles': 'French, Spanish, English', 'Producers': 'Zack Snyder, Charles Roven, Richard Suckle, Deborah Snyder, Colin Wilson', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Studio Distribution Services', 'Writers': 'David Ayer', 'Number of discs': '2'}\nReview Text: Good movie\nReview Title: Cool\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Expendables 3\nReview Date: 2019/06/26\nStore: Sylvester Stallone  (Actor, Producer),     Jason Statham  (Actor),     Patrick Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Third film in the EXPENDABLES franchise.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny LernerKevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny Lerner  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Item model number': 'LGT46268DVD', 'Director': 'Patrick Hughes', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 50 minutes', 'Release date': 'November 25, 2014', 'Actors': 'Sylvester Stallone, Jason Statham, Jackie Chan, Dolph Lundgren, Nicolas Cage', 'Subtitles': 'English, Spanish', 'Producers': 'Sylvester Stallone, Kevin King Templeton, Les Weldon, Danny Lerner, Avi Lerner', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Cool\nReview Title: 😎\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hacksaw Ridge [DVD]\nReview Date: 2019/06/26\nStore: Andrew Garfield  (Actor),     Vince Vaughn  (Actor),     Mel Gibson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Product Description', 'The amazing true life story of Desmond Doss, the first conscientious objector ever to be awarded the Medal of Honor. A 7th Day Adventist who believed WWII was a just cause- even though killing was not- Doss was the only American soldier to serve on the front lines without a weapon, and single-handedly saved the lives of 75 men.', 'Review', 'Special Features Include:Deleted ScenesVeterans Day Greeting with Mel Gibson --Lionsgate']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Luke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian OliverLuke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian Oliver  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 19 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '43449040', 'Director': 'Mel Gibson', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'February 21, 2017', 'Actors': 'Andrew Garfield, Vince Vaughn, Rachel Griffiths, Hugo Weaving, Sam Worthington', 'Subtitles': 'Spanish', 'Producers': 'William Johnson, Brian Oliver, Paul Currie, Tyler Thompson, David Permut', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love\nReview Title: 😎\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alice Through the Looking Glass\nReview Date: 2019/06/30\nStore: Johnny Depp  (Actor),     Helena Bonham Carter  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Disney invites you to step through the looking glass and join Alice, the Mad Hatter, Cheshire Cat and the Red Queen on a wild ride back to Wonderland! The adventure begins when Alice embarks on a daring quest to save her dear friend the Hatter (Johnny Depp). Plunging back into the whimsical, topsy-turvy world of Wonderland with all her old companions and a host of zany new ones, Alice must take on Time himself to right a past wrong, find her muchness... and remember that nothing is impossible.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Matt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen FryMatt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen Fry   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936850901', 'Director': 'James Bobin', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 18, 2016', 'Actors': 'Johnny Depp, Helena Bonham Carter, Sacha Baron Cohen, Anne Hathaway, Mia Wasikowska', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Based On Characters Created By Lewis Carroll, Written By Linda Woolverton', 'Number of discs': '1'}\nReview Text: Love the movie. It come earlier then thought.\nReview Title: Wonderful movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Das Boot: The Original Uncut Miniseries\nReview Date: 2019/06/30\nStore: Jürgen Prochnow  (Actor),     Herbert Grönemeyer  (Actor),     Wolfgang Petersen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Cinematic WWII Classic!', 'Widely imitated yet never equaled, claustrophobic thriller', 'Das Boot', 'resurfaces in the definitive Original Uncut Version! At the height of WWII, a young submarine crew heads out to sea on a top-secret mission that all but ensures most will never make it home alive. Ordered to patrol the Atlantic and destroy an Allied armada bringing supplies to Britain, these raw recruits must band together, bracing themselves against a depth-charge assault from an unseen enemy - can the Captain and his crew summon the strength to escape their watery grave?', \"Oscar-nominated director Wolfgang Petersen's five-hour epic adventure deftly explores tensions as pressure builds to an explosive climax, packing a visceral punch few movies can match. As we hurtle through the sub's cramped quarters, telegraphing not only the controlled chaos of combat but the fearful faces of the U-boat's heroic crew, this adrenalin-rush of a war film still haunts audiences with one final heart-breaking dilemma: would you let others perish so you could survive?\", 'Nominated for 6 Oscars® Best Director, Best Writing, Best Cinematography, Best Film Editing and Best EffectsNominated for a Golden Globe® for Best Picture']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Wolfgang Petersen, Hubertus Bengsch, Bernd Tauber, Martin Semmelrogge, Klaus Wennemann, Jürgen Prochnow, Herbert GrönemeyerWolfgang Petersen, Hubertus Bengsch, Bernd Tauber, Martin Semmelrogge, Klaus Wennemann, Jürgen Prochnow, Herbert Grönemeyer  See more', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.88 Ounces', 'Director': 'Wolfgang Petersen', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '4 hours and 53 minutes', 'Release date': 'May 13, 2014', 'Actors': 'Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann, Hubertus Bengsch, Martin Semmelrogge', 'Studio': 'Sony Pictures Home', 'Number of discs': '2'}\nReview Text: Movie skipped some but ok\nReview Title: Ok\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Soldier Blue\nReview Date: 2019/06/30\nStore: Candice Bergen  (Actor),     Peter Strauss  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['A wild west story of two survivors of an Indian attack who slowly fall in love.']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.54 x 5.34 x 7.41 inches; 0.71 Ounces', 'Item model number': '20569', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'December 12, 2006', 'Actors': 'Candice Bergen, Peter Strauss, Donald Pleasence, James Hampton, Mort Mills', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Digital 1.0)', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: Great\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Mummy Collector's Set (The Mummy/ The Mummy Returns/ The Scorpion King)\nReview Date: 2019/06/30\nStore: Brendon Fraser  (Actor),     Arnold Vosloo  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', \"Unearth non-stop action with The Mummy Collector's Set. Filled with spine-tingling suspense and amazing special effects, this 3-disc collection includes: The Mummy, The Mummy Returns and The Scorpion King. Adventure is reborn!Bonus Content:\", 'Disc 1 - The Mummy (1999):', 'Building a Better Mummy', 'Building a Better Mummy', 'Feature Commentary with Director Stephen Sommers and Editor Bob Ducsay', 'Feature Commentary with Director Stephen Sommers and Editor Bob Ducsay', 'Visual and Special Effects Formation', 'Visual and Special Effects Formation', 'Deleted Scenes', 'Deleted Scenes', 'Egyptology 101', 'Egyptology 101', 'Music Score Only', 'Music Score Only', 'Universal Showcase', 'Universal Showcase', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features Including an Interactive Mummy Game, 2 Screensavers and Electronic Postcards', 'DVD-ROM Features Including an Interactive Mummy Game, 2 Screensavers and Electronic Postcards', 'Disc 2 - The Mummy Returns:', 'An Exclusive Conversation with The Rock', 'An Exclusive Conversation with The Rock', 'Unlock the Secrets of The Scorpion King', 'Unlock the Secrets of The Scorpion King', 'Spotlight on Location: The Making of The Mummy Returns', 'Spotlight on Location: The Making of The Mummy Returns', 'Feature Commentary with Director / Writer Stephen Sommers and Executive Producer / Editor Bob Ducsay', 'Feature Commentary with Director / Writer Stephen Sommers and Executive Producer / Editor Bob Ducsay', 'Visual and Special Effects Formation', 'Visual and Special Effects Formation', 'Outtakes', 'Outtakes', 'Egyptology 201', 'Egyptology 201', 'Live \"Forever May Not Be Long Enough\" Music Video', 'Live \"Forever May Not Be Long Enough\" Music Video', 'The Mummy Returns Chamber of Doom', 'The Mummy Returns Chamber of Doom', 'Theatrical Trailer', 'Theatrical Trailer', 'A Special Message From Oded Fehr', 'A Special Message From Oded Fehr', 'The Mummy Returns Playstation 2 Game Trailer', 'The Mummy Returns Playstation 2 Game Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Recommendations', 'Recommendations', 'DVD-ROM Features Including The Mummy PC Game Demo and Screen Savers', 'DVD-ROM Features Including The Mummy PC Game Demo and Screen Savers', 'Disc 3 - The Scorpion King:', 'Alternate Version in Enhanced Viewing Mode', 'Alternate Version in Enhanced Viewing Mode', 'Enhanced Feature Commentary with The Rock', 'Enhanced Feature Commentary with The Rock', 'Outtakes', 'Outtakes', 'Alternate Versions of Key Scenes', 'Alternate Versions of Key Scenes', 'Spotlight on Location: The Making of The Scorpion King', 'Spotlight on Location: The Making of The Scorpion King', 'Ancient World Production Design', 'Ancient World Production Design', 'Preparing the Fight', 'Preparing the Fight', 'The Rock and Michael Clarke Duncan', 'The Rock and Michael Clarke Duncan', 'Working with Animals', 'Working with Animals', 'The Special Effects', 'The Special Effects', 'Godsmack \"I Stand Alone\" Music Video', 'Godsmack \"I Stand Alone\" Music Video', 'King Scorpion: Man or Myth?', 'King Scorpion: Man or Myth?', 'Theatrical Trailer', 'Theatrical Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Universal Showcase', 'Universal Showcase', 'The Scorpion King Movie Club', 'The Scorpion King Movie Club', 'DVD-ROM Features including Total Axess', 'DVD-ROM Features including Total Axess', 'Feature Commentary with Director Chuck Russell', 'Feature Commentary with Director Chuck Russell', 'Amazon.com', 'The Mummy', \"If you're expecting bandaged-wrapped corpses and a lurching Boris Karloff-type villain, then you've come to the wrong movie. But if outrageous effects, a hunky hero, and some hearty laughs are what you're looking for, the 1999 version of\", 'The Mummy', 'is spectacularly good fun. Yes, the critics called it \"hokey,\" \"cheesy,\" and \"pallid.\" Well, the critics are unjust. Granted, the plot tends to stray, the acting is a bit of a stretch, and the characters occasionally slip into cliché, but who cares? When that action gets going, hold tight--those two hours just fly by.', 'The premise of the movie isn\\'t that far off from the original. Egyptologist and general mess Evelyn (Rachel Weisz) discovers a map to the lost city of Hamunaptra, and so she hires rogue Rick O\\'Connell (Brendan Fraser) to lead her there. Once there, Evelyn accidentally unlocks the tomb of Imhotep (Arnold Vosloo), a man who had been buried alive a couple of millennia ago with flesh-eating bugs as punishment for sleeping with the pharaoh\\'s girlfriend. The ancient mummy is revived, and he is determined to bring his old love back to life, which of course means much mayhem (including the unleashing of the 10 plagues) and human sacrifice. Despite the rather gory premise, this movie is fairly tame in terms of violence; most of the magic and surprise come from the special effects, which are glorious to watch, although Imhotep, before being fully reconstituted, is, as one explorer puts it, rather \"juicy.\" Keep in mind this film is as much comedy as it is adventure--those looking for a straightforward horror pic will be disappointed. But for those who want good old-fashioned eye-candy kind of fun,', 'The Mummy', 'ranks as one of choicest flicks of 1999.', '--Jenny Brown', 'The Mummy Returns', 'Proving that bigger is rarely better,', 'The Mummy Returns', 'serves up so much action and so many computer-generated effects that it quickly grows exhausting. In his zeal to establish a lucrative franchise, writer-director Stephen Sommers dispenses with such trivial matters as character development and plot logic, and charges headlong into an almost random buffet of minimum story and maximum mayhem, beginning with a prologue establishing the ominous fate of the Scorpion King (played by World Wrestling Federation star the Rock, in a cameo teaser for his later starring role in--you guessed it--', 'The Scorpion King', '). Dormant for 5,000 years, under control of the Egyptian god Anubis, the Scorpion King will rise again in 1933, which is where we find', 'The Mummy', \"'s returning heroes Brendan Fraser and Rachel Weisz, now married and scouring Egyptian ruins with their 8-year-old son, Alex (Freddie Boath).\", \"John Hannah (as Weisz's brother) and Oded Fehr (as mystical warrior Ardeth Bay) also return from\", 'The Mummy', \", and trouble begins when Alex dons the Scorpion King's ancient bracelet, coveted by the evil mummy Imhotep (Arnold Vosloo), who's been revived by... oh, but does any of this matter? With a plot so disposable that it's impossible to care about anything that happens,\", 'The Mummy Returns', \"is best enjoyed as an intermittently amusing and physically impressive monument of Hollywood machinery, with gorgeous sets that scream for a better showcase, and digital trickery that tops its predecessor in ambition, if not in payoff. By the time our heroes encounter a hoard of ravenous pygmy mummies, you'll probably enjoy this movie in spite of itself.\", '--Jeff Shannon', 'The Scorpion King', \"There's nothing original in\", 'The Scorpion King', ', but this derivative action franchise gets off to a rousing start by cleverly stealing from a lot of better movies. Capitalizing on his brief cameo in', 'The Mummy Returns', \", Dwayne Johnson (a.k.a. World Wrestling Federation star the Rock) stars as Mathayus, an Akkadian assassin in the age preceding Egyptian pharaohs, who vows to avenge his brother's murder by an undefeated warlord (Steven Brand) prophesied to become the desert-ruling Scorpion King. Their battle for supremacy comprises most of the film's brisk 95-minute running time, punctuated by comic relief from Mathayus's obligatory sidekick (Grant Heslov), romance with a beautiful sorceress (Kelly Hu), and alliance with a massive Nubian (Michael Clarke Duncan) on the eve of their climactic showdown. There's no rhyme or reason to the film's depiction of ancient civilization (the costuming is particularly ludicrous), but the Rock demonstrates adequate action-star potential, and director Chuck Russell (\", 'The Mask', ') wraps it all in a slick, professional package.', '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & AdventureScience Fiction & Fantasy, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure  See more', 'Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Widescreen', 'Contributor': 'Arnold Vosloo, The Rock, Brendon Fraser', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround)', 'Runtime': '5 hours and 47 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Widescreen', 'Run time': '5 hours and 47 minutes', 'Release date': 'September 13, 2009', 'Actors': 'Brendon Fraser, Arnold Vosloo, The Rock', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: Great\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Thunderheart\nReview Date: 2019/06/30\nStore: Val Kilmer  (Actor),     Sam Shepard  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Val Kilmer, Sam Shepard and Graham Greene star in this powerful murder mystery with all the style and suspense of Witness. Kilmer stars as Ray Levoi, a hotshot FBI agent who's thrust into a strange new world when he is sent to solve a murder on an Indian reservation. Hand-picked because of his part-Sioux ancestry, Levoi is teamed with a legendary older agent (Shepard) to capture a radical Indian protester. But once on the reservation, Levoi encounters the irreverent local sheriff (Greene), and the tribe's religious leader (Chief Ted Thin Elk), who knows secrets about Levoi's own lost heritage. And as Levoi's awareness of the native culture grows, so does his belief that the U.S. government has framed an innocent man. A crackerjack mystery and a personal triumph of the heart.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, WidescreenMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, Widescreen  See more', 'Contributor': \"Julius Drum, Robert De Niro, Allan R.J. Joseph, Patrick Massett, Duane Brewer, Fred Dalton Thompson, Sam Shepard, Brian A. O'Meara, Dennis Banks, Ted Thin Elk, Fred Ward, Sarah Brave, Jerome Mack, Lewis C. Bradshaw, John Trudell, Rex Linn, Candy Hamilton, Val Kilmer, Graham Greene (II), Sheila Tousey, Sylvan Pumpkin SeedJulius Drum, Robert De Niro, Allan R.J. Joseph, Patrick Massett, Duane Brewer, Fred Dalton Thompson, Sam Shepard, Brian A. O'Meara, Dennis Banks, Ted Thin Elk, Fred Ward, Sarah Brave, Jerome Mack, Lewis C. Bradshaw, John Trudell, Rex Linn, Candy Hamilton, Val Kilmer…  See more\", 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '2227769', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen, Widescreen', 'Run time': '2 hours and 2 minutes', 'Release date': 'April 24, 2003', 'Actors': 'Val Kilmer, Sam Shepard, Graham Greene (II), Fred Ward, Fred Dalton Thompson', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Robert De Niro', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Great movie\nReview Title: Very good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Practical Magic (Keep Case Packaging)\nReview Date: 2019/06/30\nStore: Sandra Bullock  (Actor),     Nicole Kidman  (Actor),     Griffin Dunne  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Product Description', \"If a broom falls, company is due. When a circle rings the moon, trouble looms, Should you misplace your broom, sorry; a hand vac can't be used in an exorcism rite. Fun and excitement abound in the Owens family of wily witches. One problem, though: the men the Owens women fall in love with are doomed to an untimely death.  Sandra Bullock and Nicole Kidman bring a sparkling screen magic to Practical Magic, adapted from Alice Hoffman's bestseller and directed by Griffin Dunne (Addicted to Love). They play Sally and Gillian Owens, sisters hexed by a centuries -old curse...and coping with a witches brew of events involving a possible love match (Aidan Quinn) for one, a zombie (Goran Visnjic) for the other and a need to resume the age-old witchcraft taught by two doting Owens aunts (Stockard Channing and Dianne Wiest). Sit for a spell and enjoy.\", 'Review', 'Actor Griffin Dunne improves a bit on his first film as a director,', 'Addicted to Love', \", with this drama-comedy about a family of witches. Nicole Kidman and Sandra Bullock play spell-casting sisters of different temperaments: the former is a high-living, free-spirited sort, while Bullock's character is a homebody who can't get around a family curse that kills the men in their lives. A widowed single mom, Bullock gets into a jam with an abusive Bulgarian (Goran Visnjic) and is helped out by her sibling, but the result brings a good-looking, warm, inquisitive cop (Aidan Quinn) into their lives. The film has a variety of tonal changes--cute, scary, glum--that Dunne can't always effectively juggle. But the female-centric, celebratory nature of the film (the fantasies, the sharing, the witchy bonds) is infectious, and supporting roles by Dianne Wiest and Stockard Channing as Kidman and Bullock's magical aunts are a lot of fun.\", '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Denise Di Novi, Evan Rachel Wood, Ellen Geer, Mark Feuerstein, Herta Ware, Robin Swicord, Bruce Berman, Alexandra Artrip, Chloe Webb, Goran Visnjic, Sandra Bullock, Caprice Benedetti, Mary McLaglen, Stockard Channing, Alice Hoffman, Nicole Kidman, Griffin Dunne, Dianne Wiest, Adam Brooks, Akiva Goldsman, Aidan QuinnDenise Di Novi, Evan Rachel Wood, Ellen Geer, Mark Feuerstein, Herta Ware, Robin Swicord, Bruce Berman, Alexandra Artrip, Chloe Webb, Goran Visnjic, Sandra Bullock, Caprice Benedetti, Mary McLaglen, Stockard Channing, Alice Hoffman, Nicole Kidman, Griffin Dunne,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '112617', 'Director': 'Griffin Dunne', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Sandra Bullock, Nicole Kidman, Dianne Wiest, Stockard Channing, Aidan Quinn', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Mary McLaglen, Denise Di Novi, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'Robin Swicord, Akiva Goldsman, Adam Brooks', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: Very happy\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual's purchase history reveals a clear preference for DVDs of adventure, horror, and action films, predominantly favoring content that blends these genres. Ratings consistently hover around 4.6 to 5.0, indicating a strong satisfaction with the quality of purchased movies. They particularly enjoy works with notable directors and actors, especially those involving Tim Burton and Johnny Depp, suggesting a loyalty to specific creators.\n\nFrequent purchases include films featuring historical or dramatic narratives set in adventurous or mystical contexts. They also exhibit an interest in horror classics and modern interpretations, as seen with purchases from iconic franchises. The individual's reviews emphasize emotions—expressing love or excitement toward the films—demonstrating a connection to the characters and storylines.\n\nIn terms of quality preferences, the individual consistently gives high ratings, indicating they value well-crafted films. Price sensitivity is not directly noted but appears minimal as they frequently purchase DVDs without reference to cost. Overall, the core preferences center on well-rated films that offer adventure, strong storytelling, and familiar actors in genres of action and horror, reflecting a discerning eye for memorable cinematic experiences.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Love it",
    "text": "Very good",
    "images": [],
    "asin": "B074J612DP",
    "parent_asin": "B074J612DP",
    "user_id": "AGL6YWM6SX22YRIBEHXKRK6IS6WA",
    "timestamp": "2019-08-06 12:30:22.665000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The Haunting",
    "average_rating": 4.6,
    "rating_number": 3948,
    "features": [],
    "description": [
      "In this special effects-filled version of Shirley Jackson's \"The Haunting of Hill House,\" Liam Neeson is a professor who recruits three people for experiments which he claims will help cure their insomnia. Little do they know that the house is haunted and they're in for the scariest evening of their lives! With Lili Taylor, Catherine Zeta-Jones, Owen Wilson, and Bruce Dern; directed by Jan de Bont (\"Speed\"). 112 min. Widescreen (Enhanced); Soundtracks: English Dolby Digital 5.1, Dolby Digital stereo; Subtitles: English (SDH)."
    ],
    "price": 5.39,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51Z92yBKEqL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Z92yBKEqL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/A1Veuo3wQaL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Liam Neeson  (Actor),     Alix Koromzay  (Actor),     Jan de Bont  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Horror"
    ],
    "details": {
      "Genre": "Horror",
      "Format": "AC-3, Dolby, Subtitled, Widescreen, NTSC",
      "Contributor": "Catherine Zeta-Jones, Bruce Dern, Jan de Bont, Lili Taylor, Todd Field, Virginia Madsen, Kelsey Mulrooney, Owen Wilson, Liam Neeson, Marian Seldes, Alix KoromzayCatherine Zeta-Jones, Bruce Dern, Jan de Bont, Lili Taylor, Todd Field, Virginia Madsen, Kelsey Mulrooney, Owen Wilson, Liam Neeson, Marian Seldes, Alix Koromzay  See more",
      "Language": "English",
      "Runtime": "1 hour and 53 minutes",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.72 Ounces",
      "Item model number": "haunting",
      "Director": "Jan de Bont",
      "Media Format": "AC-3, Dolby, Subtitled, Widescreen, NTSC",
      "Run time": "1 hour and 53 minutes",
      "Release date": "October 10, 2017",
      "Actors": "Liam Neeson, Alix Koromzay, Virginia Madsen, Catherine Zeta-Jones, Bruce Dern",
      "Subtitles": "English",
      "Studio": "Paramount Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}