{
  "user_id": "AFUK6B5ZSGP4BFLJWKJRIXD3GGYQ",
  "summary": "=== Purchase Information ===\nReview Date: 2016/08/19\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Peter Atencio'], 'Producers': ['Dave Callaham (Executive Producer)', 'David W. Zucker (Executive Producer)', 'Clayton Krueger (Co-Executive Producer)', 'Peter Atencio (Executive Producer)', 'Ridley Scott (Executive Producer)', 'Jean-Claude Van Damme (Executive Producer)', 'Diane Sabatini (Producer)'], 'Starring': ['Moises Arias', 'Jean-Claude Van Damme', 'Kat Foster'], 'Studio': ['Amazon Studios']}\nReview Text: I had my doubts, what with JCVD essentially turning into a loser of sorts, but he was a hero to me for a good run. I like the self depreciating humor and that he was a creaky she'll of the van-damage he was and hope if this continues that he doesn't magically become the win it all always of the past, including the girl.\nReview Title: Surprisingly fun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: House of Lies\nReview Date: 2016/09/26\nCategories: Comedy, Drama\nProduct Description: [\"Don Cheadle and Kristen Bell are twisting the facts, spinning the numbers and playing corporate America for everything they've got in the outrageous new series HOUSE OF LIES.\"]\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Hopkins', 'Matthew Carnahan', 'Daisy von Scherler Mayer', 'Don Cheadle', 'Adam Bernstein', 'John Dahl', 'Michael Uppendahl', 'Miguel Arteta', 'Seith Mann', 'Beth McCarthy-Miller'], 'Producers': ['Don Cheadle', 'Stephan Hopkins', 'Jessika Borsiczky', 'Matthew Carnahan'], 'Starring': ['Don Cheadle', 'Kristen Bell', 'Ben Schwartz']}\nReview Text: The writing and production of this show are pretty good, but my main problem is that it's another show about crappy people. I get the premise is a bunch of people who lie or polish turds or any number of other distasteful things, but this show is a reflection on how we might accept this. My guess is that people who loved the behavior of Sons of Anarchy characters will also love these people. At least the evil lead in Dexter was of value to society in SOME way.<br />That said... the side plot of the son is humanizing. Unfortunately, his parents are both scumbags and he really deserves far better.<br />The &#34;pause action while I explain something&#34; is a nice feature too, that thankfully does slow down a bit later on.\nReview Title: The writing and production of this show are pretty good, but my main problem is that it's ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Lord of the Rings: The Motion Picture Trilogy (Extended Edition Blu-ray)\nReview Date: 2017/01/02\nStore: Elijah Wood  (Actor),     Ian McKellen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', \"The Fellowship of the Ring; A meek hobbit of the Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron. The Two Towers: While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. The Return of the King: Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring. Peter Jackson directs these action adventure movies starring Elijah Wood, Viggo Mortensen, Ian McKellen, Sean Astin, Cate Blanchet and more. This special edition of The Lord of the Rings Trilogy includes extended edition of the movies on 15 Blu-Ray discs.\", 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Review', \"Jackson surpasses the expectations anyone might have had for him with The Fellowship of the Ring, the first installment of his trilogy devoted to J.R.R. Tolkien's masterwork. --Charlotte Observer, Lawrence ToppmanMoviegoers should be almost as entranced by the teeming, glorious landscapes and dark, bloody battlegrounds of Two Towers: astonishing midpoint of an epic movie fantasy journey for the ages. --Chicago Tribune, Michael Wilmington\", 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Contributor': 'Viggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando BloomViggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando Bloom  See more', 'Initial release date': '2012-05-01', 'Language': 'Portuguese (Dolby Digital 5.1), English (DTS-HD Master Audio 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Item model number': '939705', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 21 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Liv Tyler', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Studio Distribution Services', 'Number of discs': '15'}\nReview Text: I've had the extended DVD set for years and only bought this because it was a nice deal (sale) and I wanted to the HD options. I don't believe there are (m)any extras I didn't already have. Thankfully I'm not OCD enough to need even the theatrical releases as well... though, I do feel like they COULD have fit these each on one bluray and have the theatricals included as well.<br /><br />These movies, until another reboot - hopefully correcting major flaws in lore and such, are still on my list of must see.\nReview Title: HD of great films.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Batman Collection (Batman / Batman Forever / Batman and Robin / Batman Returns)\nReview Date: 2021/03/07\nStore: Michael Keaton  (Actor),     Val Kilmer  (Actor),     Tim Burton  (Director),     Joel Schumacher  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, Warner Bros. Featured Deals\nProduct Description: ['Product Description', '4 Film Favorites: Batman Collection (4FF) (DVD) (WS)', \"Rev up the Batmobile! An Awesome Action Foursome. BATMAN - Batman (Michael Keaton) vs. The Joker (Jack Nicholson) in the amazing first extravaganza! With Kim Basinger. BATMAN RETURNS - The Bat (Michael Keaton), the Cat (Michelle Pfeiffer), the Penguin (Danny DeVito). And Christopher Walken, too! BATMAN FOREVER - Riddle me this: The Dark Knight (Val Kilmer) bat-battles Two-Face (Tommy Lee Jones) and the Riddler (Jim Carrey). With Nicole Kidman, Chris O'Donnell. BATMAN & ROBIN - Will Mr. Freeze (Arnold Schwarzenegger) put the world on ice? George Clooney wears the hero's cape. Also with Chris O'Donnell, Uma Thurman, Alicia Silverstone.\", ']]>', 'Amazon.com', 'Batman', 'Thanks to the ambitious vision of director Tim Burton, the blockbuster hit of 1989 delivers the goods despite an occasionally spotty script, giving the caped crusader a thorough overhaul in keeping with the crime fighter\\'s evolution in DC Comics. Michael Keaton strikes just the right mood as the brooding \"Dark Knight\" of Gotham City; Kim Basinger plays Gotham\\'s intrepid reporter Vicki Vale; and Jack Nicholson goes wild as the maniacal and scene-stealing Joker, who plots a takeover of the city with his lethal Smilex gas. Triumphant Oscar-winning production design by the late Anton Furst turns', 'Batman', \"into a visual feast, and Burton brilliantly establishes a darkly mythic approach to Batman's legacy. Danny Elfman's now-classic score propels the action with bold, muscular verve.\", '--Jeff Shannon', 'Batman Returns', 'Tim Burton\\'s sequel to his phenomenally successful 1989 \"Batman\" doesn\\'t try to top the first picture, either with splashier special effects or with loftier pretensions to significance; nor does it simply go through the motions, repeating the surefire stuff with a self-satisfied air of professionalism. It\\'s a blend of playful novelty and reassuring familiarity-a difficult mixture to get right. This time, the hero (again Michael Keaton) does battle with a greedy businessman named Max Shreck (Christopher Walken) and the roly-poly arch-criminal known as the Penguin (Danny DeVito). And whenever Batman ventures out on one of his nocturnal crime-fighting missions, he runs into a mysterious woman who dresses like a cat and carries a whip. The hilariously twisted relationship between the hero and the Catwoman (Michelle Pfeiffer) plays like an apache dance in animal costumes, and it\\'s the glory of the movie. The cat clothes seem to release something strange and wild in Pfeiffer: her performance is ferociously sexy and uninhibitedly, over-the-top funny. As in the first movie, Burton gives the material a luxurious masked-ball quality and a sly contemporary wit without violating the myth\\'s low, cheesy comic-book origins. He\\'s an artist who\\'s comfortable with both the higher aspirations and the lower instincts of his nature as an entertainer: he and Batman are an ideal match.', 'Batman Forever', \"When Tim Burton and Michael Keaton announced that they'd had enough of the\", 'Batman', \"franchise, director Joel Schumacher stepped in (with Burton as coproducer) to make this action-packed extravaganza starring Val Kilmer as the caped crusader. Batman is up against two of Gotham City's most colorful criminals, the Riddler (a role tailor-made for funnyman Jim Carrey) and the diabolical Two-Face (Tommy Lee Jones), who join forces to conquer Gotham's population with a brain-draining device. Nicole Kidman plays the seductive psychologist who wants to know what makes Batman tick. Boasting a redesigned Batmobile and plenty of new Bat hardware,\", 'Batman Forever', \"also introduces Robin the Boy Wonder (Chris O'Donnell) whose close alliance with Batman led more than a few critics to ponder the series' homoerotic subtext. No matter how you interpret it, Schumacher's take on the\", 'Batman', 'legacy is simultaneously amusing, lavishly epic, and prone to chronic sensory overload.', '--Jeff Shannon', 'Batman & Robin', \"Following Val Kilmer's portrayal of the caped crusader in\", 'Batman Forever', ', the fourth', 'Batman', \"feature stars George Clooney under the pointy-eared cowl, with Chris O'Donnell returning as Robin the Boy Wonder. This time the dynamic duo is up against the nefarious Mr. Freeze (Arnold Schwarzenegger), who is bent on turning the world into an iceberg, and the slyly seductive but highly toxic Poison Ivy (Uma Thurman), who wants to eliminate all animal life and turn the Earth into a gigantic greenhouse. Alicia Silverstone lends a hand as Batgirl, and Elle McPherson plays the thankless role of Batman/Bruce Wayne's fiancée. A sensory assault of dazzling colors, senseless action, and lavish sets run amok, this\", 'Batman & Robin', 'offers an overdose of eye candy, but it is strictly for devoted Bat-o-philes.', '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': \"Kim Basinger, Uma Thurman, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Jim Carrey, Arnold Schwarzenegger, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, George Clooney, Val Kilmer, Tommy Lee Jones, Alicia Silverstone, Chris O'DonnellKim Basinger, Uma Thurman, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Jim Carrey, Arnold Schwarzenegger, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, George Clooney, Val Kilmer, Tommy Lee Jones, Alicia Silverstone, Chris O'Donnell  See more\", 'Initial release date': '2009-09-29', 'Language': 'English', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 1.6 Ounces', 'Item model number': '99261', 'Director': 'Tim Burton, Joel Schumacher', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '8 hours and 19 minutes', 'Release date': 'September 29, 2009', 'Actors': \"Michael Keaton, Val Kilmer, George Clooney, Chris O'Donnell, Jack Nicholson\", 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nReview Text: The movies are as good as they are/could be. The format on these discs is lackluster. The video quality looks like they were recorded from a widescreen VHS and trimmed to knock out the black bars.<br />\"This/other side\" markings for which one which movie is on is ambiguous.<br />That said, for as little as I paid for it, I can't complain too much.\nReview Title: Low quality video\nRating: 3.0\n--------------------------------------------------",
  "reference": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Peter Atencio'], 'Producers': ['Dave Callaham (Executive Producer)', 'David W. Zucker (Executive Producer)', 'Clayton Krueger (Co-Executive Producer)', 'Peter Atencio (Executive Producer)', 'Ridley Scott (Executive Producer)', 'Jean-Claude Van Damme (Executive Producer)', 'Diane Sabatini (Producer)'], 'Starring': ['Moises Arias', 'Jean-Claude Van Damme', 'Kat Foster'], 'Studio': ['Amazon Studios']}\nI had my doubts, what with JCVD essentially turning into a loser of sorts, but he was a hero to me for a good run. I like the self depreciating humor and that he was a creaky she'll of the van-damage he was and hope if this continues that he doesn't magically become the win it all always of the past, including the girl.\nSurprisingly fun\nHouse of Lies\nComedy, Drama\n[\"Don Cheadle and Kristen Bell are twisting the facts, spinning the numbers and playing corporate America for everything they've got in the outrageous new series HOUSE OF LIES.\"]\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Hopkins', 'Matthew Carnahan', 'Daisy von Scherler Mayer', 'Don Cheadle', 'Adam Bernstein', 'John Dahl', 'Michael Uppendahl', 'Miguel Arteta', 'Seith Mann', 'Beth McCarthy-Miller'], 'Producers': ['Don Cheadle', 'Stephan Hopkins', 'Jessika Borsiczky', 'Matthew Carnahan'], 'Starring': ['Don Cheadle', 'Kristen Bell', 'Ben Schwartz']}\nThe writing and production of this show are pretty good, but my main problem is that it's another show about crappy people. I get the premise is a bunch of people who lie or polish turds or any number of other distasteful things, but this show is a reflection on how we might accept this. My guess is that people who loved the behavior of Sons of Anarchy characters will also love these people. At least the evil lead in Dexter was of value to society in SOME way.<br />That said... the side plot of the son is humanizing. Unfortunately, his parents are both scumbags and he really deserves far better.<br />The &#34;pause action while I explain something&#34; is a nice feature too, that thankfully does slow down a bit later on.\nThe writing and production of this show are pretty good, but my main problem is that it's ...\nThe Lord of the Rings: The Motion Picture Trilogy (Extended Edition Blu-ray)\nElijah Wood  (Actor),     Ian McKellen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"The Fellowship of the Ring; A meek hobbit of the Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron. The Two Towers: While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. The Return of the King: Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring. Peter Jackson directs these action adventure movies starring Elijah Wood, Viggo Mortensen, Ian McKellen, Sean Astin, Cate Blanchet and more. This special edition of The Lord of the Rings Trilogy includes extended edition of the movies on 15 Blu-Ray discs.\", 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Review', \"Jackson surpasses the expectations anyone might have had for him with The Fellowship of the Ring, the first installment of his trilogy devoted to J.R.R. Tolkien's masterwork. --Charlotte Observer, Lawrence ToppmanMoviegoers should be almost as entranced by the teeming, glorious landscapes and dark, bloody battlegrounds of Two Towers: astonishing midpoint of an epic movie fantasy journey for the ages. --Chicago Tribune, Michael Wilmington\", 'See more']\n{'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Contributor': 'Viggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando BloomViggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando Bloom  See more', 'Initial release date': '2012-05-01', 'Language': 'Portuguese (Dolby Digital 5.1), English (DTS-HD Master Audio 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Item model number': '939705', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 21 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Liv Tyler', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Studio Distribution Services', 'Number of discs': '15'}\nI've had the extended DVD set for years and only bought this because it was a nice deal (sale) and I wanted to the HD options. I don't believe there are (m)any extras I didn't already have. Thankfully I'm not OCD enough to need even the theatrical releases as well... though, I do feel like they COULD have fit these each on one bluray and have the theatricals included as well.<br /><br />These movies, until another reboot - hopefully correcting major flaws in lore and such, are still on my list of must see.\nHD of great films.\n4 Film Favorites: Batman Collection (Batman / Batman Forever / Batman and Robin / Batman Returns)\nMichael Keaton  (Actor),     Val Kilmer  (Actor),     Tim Burton  (Director),     Joel Schumacher  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, Warner Bros. Featured Deals\n['Product Description', '4 Film Favorites: Batman Collection (4FF) (DVD) (WS)', \"Rev up the Batmobile! An Awesome Action Foursome. BATMAN - Batman (Michael Keaton) vs. The Joker (Jack Nicholson) in the amazing first extravaganza! With Kim Basinger. BATMAN RETURNS - The Bat (Michael Keaton), the Cat (Michelle Pfeiffer), the Penguin (Danny DeVito). And Christopher Walken, too! BATMAN FOREVER - Riddle me this: The Dark Knight (Val Kilmer) bat-battles Two-Face (Tommy Lee Jones) and the Riddler (Jim Carrey). With Nicole Kidman, Chris O'Donnell. BATMAN & ROBIN - Will Mr. Freeze (Arnold Schwarzenegger) put the world on ice? George Clooney wears the hero's cape. Also with Chris O'Donnell, Uma Thurman, Alicia Silverstone.\", ']]>', 'Amazon.com', 'Batman', 'Thanks to the ambitious vision of director Tim Burton, the blockbuster hit of 1989 delivers the goods despite an occasionally spotty script, giving the caped crusader a thorough overhaul in keeping with the crime fighter\\'s evolution in DC Comics. Michael Keaton strikes just the right mood as the brooding \"Dark Knight\" of Gotham City; Kim Basinger plays Gotham\\'s intrepid reporter Vicki Vale; and Jack Nicholson goes wild as the maniacal and scene-stealing Joker, who plots a takeover of the city with his lethal Smilex gas. Triumphant Oscar-winning production design by the late Anton Furst turns', 'Batman', \"into a visual feast, and Burton brilliantly establishes a darkly mythic approach to Batman's legacy. Danny Elfman's now-classic score propels the action with bold, muscular verve.\", '--Jeff Shannon', 'Batman Returns', 'Tim Burton\\'s sequel to his phenomenally successful 1989 \"Batman\" doesn\\'t try to top the first picture, either with splashier special effects or with loftier pretensions to significance; nor does it simply go through the motions, repeating the surefire stuff with a self-satisfied air of professionalism. It\\'s a blend of playful novelty and reassuring familiarity-a difficult mixture to get right. This time, the hero (again Michael Keaton) does battle with a greedy businessman named Max Shreck (Christopher Walken) and the roly-poly arch-criminal known as the Penguin (Danny DeVito). And whenever Batman ventures out on one of his nocturnal crime-fighting missions, he runs into a mysterious woman who dresses like a cat and carries a whip. The hilariously twisted relationship between the hero and the Catwoman (Michelle Pfeiffer) plays like an apache dance in animal costumes, and it\\'s the glory of the movie. The cat clothes seem to release something strange and wild in Pfeiffer: her performance is ferociously sexy and uninhibitedly, over-the-top funny. As in the first movie, Burton gives the material a luxurious masked-ball quality and a sly contemporary wit without violating the myth\\'s low, cheesy comic-book origins. He\\'s an artist who\\'s comfortable with both the higher aspirations and the lower instincts of his nature as an entertainer: he and Batman are an ideal match.', 'Batman Forever', \"When Tim Burton and Michael Keaton announced that they'd had enough of the\", 'Batman', \"franchise, director Joel Schumacher stepped in (with Burton as coproducer) to make this action-packed extravaganza starring Val Kilmer as the caped crusader. Batman is up against two of Gotham City's most colorful criminals, the Riddler (a role tailor-made for funnyman Jim Carrey) and the diabolical Two-Face (Tommy Lee Jones), who join forces to conquer Gotham's population with a brain-draining device. Nicole Kidman plays the seductive psychologist who wants to know what makes Batman tick. Boasting a redesigned Batmobile and plenty of new Bat hardware,\", 'Batman Forever', \"also introduces Robin the Boy Wonder (Chris O'Donnell) whose close alliance with Batman led more than a few critics to ponder the series' homoerotic subtext. No matter how you interpret it, Schumacher's take on the\", 'Batman', 'legacy is simultaneously amusing, lavishly epic, and prone to chronic sensory overload.', '--Jeff Shannon', 'Batman & Robin', \"Following Val Kilmer's portrayal of the caped crusader in\", 'Batman Forever', ', the fourth', 'Batman', \"feature stars George Clooney under the pointy-eared cowl, with Chris O'Donnell returning as Robin the Boy Wonder. This time the dynamic duo is up against the nefarious Mr. Freeze (Arnold Schwarzenegger), who is bent on turning the world into an iceberg, and the slyly seductive but highly toxic Poison Ivy (Uma Thurman), who wants to eliminate all animal life and turn the Earth into a gigantic greenhouse. Alicia Silverstone lends a hand as Batgirl, and Elle McPherson plays the thankless role of Batman/Bruce Wayne's fiancée. A sensory assault of dazzling colors, senseless action, and lavish sets run amok, this\", 'Batman & Robin', 'offers an overdose of eye candy, but it is strictly for devoted Bat-o-philes.', '--Jeff Shannon']\n{'Genre': 'Comedy, Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': \"Kim Basinger, Uma Thurman, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Jim Carrey, Arnold Schwarzenegger, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, George Clooney, Val Kilmer, Tommy Lee Jones, Alicia Silverstone, Chris O'DonnellKim Basinger, Uma Thurman, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Jim Carrey, Arnold Schwarzenegger, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, George Clooney, Val Kilmer, Tommy Lee Jones, Alicia Silverstone, Chris O'Donnell  See more\", 'Initial release date': '2009-09-29', 'Language': 'English', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 1.6 Ounces', 'Item model number': '99261', 'Director': 'Tim Burton, Joel Schumacher', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '8 hours and 19 minutes', 'Release date': 'September 29, 2009', 'Actors': \"Michael Keaton, Val Kilmer, George Clooney, Chris O'Donnell, Jack Nicholson\", 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nThe movies are as good as they are/could be. The format on these discs is lackluster. The video quality looks like they were recorded from a widescreen VHS and trimmed to knock out the black bars.<br />\"This/other side\" markings for which one which movie is on is ambiguous.<br />That said, for as little as I paid for it, I can't complain too much.\nLow quality video",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nReview Date: 2016/08/19\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Peter Atencio'], 'Producers': ['Dave Callaham (Executive Producer)', 'David W. Zucker (Executive Producer)', 'Clayton Krueger (Co-Executive Producer)', 'Peter Atencio (Executive Producer)', 'Ridley Scott (Executive Producer)', 'Jean-Claude Van Damme (Executive Producer)', 'Diane Sabatini (Producer)'], 'Starring': ['Moises Arias', 'Jean-Claude Van Damme', 'Kat Foster'], 'Studio': ['Amazon Studios']}\nReview Text: I had my doubts, what with JCVD essentially turning into a loser of sorts, but he was a hero to me for a good run. I like the self depreciating humor and that he was a creaky she'll of the van-damage he was and hope if this continues that he doesn't magically become the win it all always of the past, including the girl.\nReview Title: Surprisingly fun\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: House of Lies\nReview Date: 2016/09/26\nCategories: Comedy, Drama\nProduct Description: [\"Don Cheadle and Kristen Bell are twisting the facts, spinning the numbers and playing corporate America for everything they've got in the outrageous new series HOUSE OF LIES.\"]\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Hopkins', 'Matthew Carnahan', 'Daisy von Scherler Mayer', 'Don Cheadle', 'Adam Bernstein', 'John Dahl', 'Michael Uppendahl', 'Miguel Arteta', 'Seith Mann', 'Beth McCarthy-Miller'], 'Producers': ['Don Cheadle', 'Stephan Hopkins', 'Jessika Borsiczky', 'Matthew Carnahan'], 'Starring': ['Don Cheadle', 'Kristen Bell', 'Ben Schwartz']}\nReview Text: The writing and production of this show are pretty good, but my main problem is that it's another show about crappy people. I get the premise is a bunch of people who lie or polish turds or any number of other distasteful things, but this show is a reflection on how we might accept this. My guess is that people who loved the behavior of Sons of Anarchy characters will also love these people. At least the evil lead in Dexter was of value to society in SOME way.<br />That said... the side plot of the son is humanizing. Unfortunately, his parents are both scumbags and he really deserves far better.<br />The &#34;pause action while I explain something&#34; is a nice feature too, that thankfully does slow down a bit later on.\nReview Title: The writing and production of this show are pretty good, but my main problem is that it's ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Lord of the Rings: The Motion Picture Trilogy (Extended Edition Blu-ray)\nReview Date: 2017/01/02\nStore: Elijah Wood  (Actor),     Ian McKellen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', \"The Fellowship of the Ring; A meek hobbit of the Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron. The Two Towers: While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. The Return of the King: Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring. Peter Jackson directs these action adventure movies starring Elijah Wood, Viggo Mortensen, Ian McKellen, Sean Astin, Cate Blanchet and more. This special edition of The Lord of the Rings Trilogy includes extended edition of the movies on 15 Blu-Ray discs.\", 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Review', \"Jackson surpasses the expectations anyone might have had for him with The Fellowship of the Ring, the first installment of his trilogy devoted to J.R.R. Tolkien's masterwork. --Charlotte Observer, Lawrence ToppmanMoviegoers should be almost as entranced by the teeming, glorious landscapes and dark, bloody battlegrounds of Two Towers: astonishing midpoint of an epic movie fantasy journey for the ages. --Chicago Tribune, Michael Wilmington\", 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Contributor': 'Viggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando BloomViggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando Bloom  See more', 'Initial release date': '2012-05-01', 'Language': 'Portuguese (Dolby Digital 5.1), English (DTS-HD Master Audio 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Item model number': '939705', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 21 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Liv Tyler', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Studio Distribution Services', 'Number of discs': '15'}\nReview Text: I've had the extended DVD set for years and only bought this because it was a nice deal (sale) and I wanted to the HD options. I don't believe there are (m)any extras I didn't already have. Thankfully I'm not OCD enough to need even the theatrical releases as well... though, I do feel like they COULD have fit these each on one bluray and have the theatricals included as well.<br /><br />These movies, until another reboot - hopefully correcting major flaws in lore and such, are still on my list of must see.\nReview Title: HD of great films.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Batman Collection (Batman / Batman Forever / Batman and Robin / Batman Returns)\nReview Date: 2021/03/07\nStore: Michael Keaton  (Actor),     Val Kilmer  (Actor),     Tim Burton  (Director),     Joel Schumacher  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, Warner Bros. Featured Deals\nProduct Description: ['Product Description', '4 Film Favorites: Batman Collection (4FF) (DVD) (WS)', \"Rev up the Batmobile! An Awesome Action Foursome. BATMAN - Batman (Michael Keaton) vs. The Joker (Jack Nicholson) in the amazing first extravaganza! With Kim Basinger. BATMAN RETURNS - The Bat (Michael Keaton), the Cat (Michelle Pfeiffer), the Penguin (Danny DeVito). And Christopher Walken, too! BATMAN FOREVER - Riddle me this: The Dark Knight (Val Kilmer) bat-battles Two-Face (Tommy Lee Jones) and the Riddler (Jim Carrey). With Nicole Kidman, Chris O'Donnell. BATMAN & ROBIN - Will Mr. Freeze (Arnold Schwarzenegger) put the world on ice? George Clooney wears the hero's cape. Also with Chris O'Donnell, Uma Thurman, Alicia Silverstone.\", ']]>', 'Amazon.com', 'Batman', 'Thanks to the ambitious vision of director Tim Burton, the blockbuster hit of 1989 delivers the goods despite an occasionally spotty script, giving the caped crusader a thorough overhaul in keeping with the crime fighter\\'s evolution in DC Comics. Michael Keaton strikes just the right mood as the brooding \"Dark Knight\" of Gotham City; Kim Basinger plays Gotham\\'s intrepid reporter Vicki Vale; and Jack Nicholson goes wild as the maniacal and scene-stealing Joker, who plots a takeover of the city with his lethal Smilex gas. Triumphant Oscar-winning production design by the late Anton Furst turns', 'Batman', \"into a visual feast, and Burton brilliantly establishes a darkly mythic approach to Batman's legacy. Danny Elfman's now-classic score propels the action with bold, muscular verve.\", '--Jeff Shannon', 'Batman Returns', 'Tim Burton\\'s sequel to his phenomenally successful 1989 \"Batman\" doesn\\'t try to top the first picture, either with splashier special effects or with loftier pretensions to significance; nor does it simply go through the motions, repeating the surefire stuff with a self-satisfied air of professionalism. It\\'s a blend of playful novelty and reassuring familiarity-a difficult mixture to get right. This time, the hero (again Michael Keaton) does battle with a greedy businessman named Max Shreck (Christopher Walken) and the roly-poly arch-criminal known as the Penguin (Danny DeVito). And whenever Batman ventures out on one of his nocturnal crime-fighting missions, he runs into a mysterious woman who dresses like a cat and carries a whip. The hilariously twisted relationship between the hero and the Catwoman (Michelle Pfeiffer) plays like an apache dance in animal costumes, and it\\'s the glory of the movie. The cat clothes seem to release something strange and wild in Pfeiffer: her performance is ferociously sexy and uninhibitedly, over-the-top funny. As in the first movie, Burton gives the material a luxurious masked-ball quality and a sly contemporary wit without violating the myth\\'s low, cheesy comic-book origins. He\\'s an artist who\\'s comfortable with both the higher aspirations and the lower instincts of his nature as an entertainer: he and Batman are an ideal match.', 'Batman Forever', \"When Tim Burton and Michael Keaton announced that they'd had enough of the\", 'Batman', \"franchise, director Joel Schumacher stepped in (with Burton as coproducer) to make this action-packed extravaganza starring Val Kilmer as the caped crusader. Batman is up against two of Gotham City's most colorful criminals, the Riddler (a role tailor-made for funnyman Jim Carrey) and the diabolical Two-Face (Tommy Lee Jones), who join forces to conquer Gotham's population with a brain-draining device. Nicole Kidman plays the seductive psychologist who wants to know what makes Batman tick. Boasting a redesigned Batmobile and plenty of new Bat hardware,\", 'Batman Forever', \"also introduces Robin the Boy Wonder (Chris O'Donnell) whose close alliance with Batman led more than a few critics to ponder the series' homoerotic subtext. No matter how you interpret it, Schumacher's take on the\", 'Batman', 'legacy is simultaneously amusing, lavishly epic, and prone to chronic sensory overload.', '--Jeff Shannon', 'Batman & Robin', \"Following Val Kilmer's portrayal of the caped crusader in\", 'Batman Forever', ', the fourth', 'Batman', \"feature stars George Clooney under the pointy-eared cowl, with Chris O'Donnell returning as Robin the Boy Wonder. This time the dynamic duo is up against the nefarious Mr. Freeze (Arnold Schwarzenegger), who is bent on turning the world into an iceberg, and the slyly seductive but highly toxic Poison Ivy (Uma Thurman), who wants to eliminate all animal life and turn the Earth into a gigantic greenhouse. Alicia Silverstone lends a hand as Batgirl, and Elle McPherson plays the thankless role of Batman/Bruce Wayne's fiancée. A sensory assault of dazzling colors, senseless action, and lavish sets run amok, this\", 'Batman & Robin', 'offers an overdose of eye candy, but it is strictly for devoted Bat-o-philes.', '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': \"Kim Basinger, Uma Thurman, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Jim Carrey, Arnold Schwarzenegger, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, George Clooney, Val Kilmer, Tommy Lee Jones, Alicia Silverstone, Chris O'DonnellKim Basinger, Uma Thurman, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Jim Carrey, Arnold Schwarzenegger, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, George Clooney, Val Kilmer, Tommy Lee Jones, Alicia Silverstone, Chris O'Donnell  See more\", 'Initial release date': '2009-09-29', 'Language': 'English', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 1.6 Ounces', 'Item model number': '99261', 'Director': 'Tim Burton, Joel Schumacher', 'Media Format': 'Multiple Formats, AC-3, Color, Dubbed, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '8 hours and 19 minutes', 'Release date': 'September 29, 2009', 'Actors': \"Michael Keaton, Val Kilmer, George Clooney, Chris O'Donnell, Jack Nicholson\", 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nReview Text: The movies are as good as they are/could be. The format on these discs is lackluster. The video quality looks like they were recorded from a widescreen VHS and trimmed to knock out the black bars.<br />\"This/other side\" markings for which one which movie is on is ambiguous.<br />That said, for as little as I paid for it, I can't complain too much.\nReview Title: Low quality video\nRating: 3.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual exhibits a clear preference for genres such as comedy, drama, fantasy, and action-adventure, particularly those with complex characters and layered narratives. Ratings indicate a consistent appreciation for creative storytelling, yet there's a marked sensitivity toward character morality, with a tendency to critique morally ambiguous characters. Preferences lean towards well-produced items, with an evident fondness for special or extended editions that enhance the viewing experience.\n\nAcross their purchases, there’s a recurring interest in notable franchises, particularly those featuring rich cinematic worlds and acclaimed directors, reflecting an appreciation for quality filmmaking. Despite a history of positive ratings, a few products received lower ratings due to perceived production flaws or unsatisfactory video quality, signaling a quality threshold that impacts purchases.\n\nPrice sensitivity appears moderate, as the buyer is motivated by sales but also willing to invest in premium editions of beloved films. Furthermore, the individual is selective about content types, favoring those that combine entertainment with depth, suggesting that emotional resonance and thematic richness are significant to their experience. Overall, their core preferences center around high-quality, multifaceted cinematic experiences, with a notable standout for humor and drama woven into fantastical contexts.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Not really hd",
    "text": "This review is of the stream, not the movie. Id still give the movie a 3.5/5, maybe a 4 on a good day.<br />The only thing hd in this stream is the credits, which are obviously new/edited. You'd think a movie made on at least 35mm film could be converted to better quality hd.<br />This should be part of Prime Video though.",
    "images": [],
    "asin": "B07QM2YTYT",
    "parent_asin": "B07QM2YTYT",
    "user_id": "AFUK6B5ZSGP4BFLJWKJRIXD3GGYQ",
    "timestamp": "2022-01-29 18:08:54.163000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.8,
    "rating_number": 8038,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f54b82871db9c499ebf5e473eb724c2ee53e9c0cefa4e92b67df2a6ca19821a2._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f54b82871db9c499ebf5e473eb724c2ee53e9c0cefa4e92b67df2a6ca19821a2._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f54b82871db9c499ebf5e473eb724c2ee53e9c0cefa4e92b67df2a6ca19821a2._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f54b82871db9c499ebf5e473eb724c2ee53e9c0cefa4e92b67df2a6ca19821a2._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f54b82871db9c499ebf5e473eb724c2ee53e9c0cefa4e92b67df2a6ca19821a2._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f54b82871db9c499ebf5e473eb724c2ee53e9c0cefa4e92b67df2a6ca19821a2._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English Dialogue Boost: High",
        "English",
        "English Dialogue Boost: Medium"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "John G. Avildsen"
      ],
      "Producers": [
        "Jerry Weintraub"
      ],
      "Starring": [
        "Ralph Macchio",
        "Pat Morita",
        "Elisabeth Shue"
      ],
      "Studio": [
        "Sony Pictures Television"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}