{
  "user_id": "AFCLLS3FJK45DRQOBP3KTCVNQ2RQ",
  "summary": "=== Purchase Information ===\nProduct Title: Journey to the Center of the Earth\nReview Date: 2012/12/07\nStore: Brendan Fraser  (Actor),     Josh Hutcherson  (Actor),     Eric Brevig  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', 'Journey to the Center of the Earth (DVD) (FS/WS)', 'During a scientific expedition in Iceland, visionary scientist Trevor Anderson (Brendan Fraser), his nephew Sean (Josh Hutcherson) and their beautiful local guide, Hannah (Anita Briem), are unexpectedly trapped in a cave from which their only escape is to go deeper and deeper into the depths of the Earth. Traveling through never-before-seen worlds, the trio comes face-to-face with surreal and unimaginable creatures-- including man-eating plants, giant flying piranha, glow birds and terrifying dinosaurs from days past. The explorers soon realize that as volcanic activity increases around them, they must find a way back to the earth\\'s surface before it is too late. With spectacular photo-real environments and revolutionary new filmmaking techniques, \"Journey to the Center of the Earth\" is an epic adventure that takes audiences directly into the heart of our heroes\\' voyage, bringing them along for a wild, visceral ride.', ']]>', 'Amazon.com', \"When a seismic geologist (Brendan Fraser) discovers his lost brother's notes in a copy of the titular Jules Verne novel, he and his nephew (Josh Hutcherson,\", 'Bridge to Terabithia', ',', 'Zathura', ') head to Iceland. There, joined by a fetching mountain guide (played by Icelandic actress Anita Briem), they get trapped in a cavern and go down, down, down, finally arriving in a primeval underworld full of prehistoric beasts and carnivorous plants. It would be pointless to complain about the empty-headedness of it all;', 'Journey to the Center of the Earth', \"aspires to be a kinesthetic experience. It wants to engage your adrenal glands, not your brain or your heart (the dialogue and characters are so generic, the script may have been cut-and-pasted from previous versions of Verne's book). Fraser, with his goofy handsomeness and accessible presence, provides a reasonably human axis around which all the frantic flying and swooping CGI effects revolve. The movie is as hollow as the world it depicts, but as mindless action movies go, you could do a lot worse. (Note:\", 'Journey to the Center of the Earth', 'was released in theaters in 3-D, full of whizz-bang demonstrations of how far 3-D technology had come--trilobite antennae quivering towards the audience, a T-rex lunging out of the frame, even affable star Brendan Fraser spitting on us--as well as a half-dozen action sequences clearly destined to become video games or theme park rides.)', '--Bret Fetzer']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Full Screen', 'Contributor': 'Jean Michel Paré, Anita Briem, Frank Fontaine, Brendan Fraser, Eric Brevig, Giancarlo Caltabiano, Jane Wheeler, Josh Hutcherson, Seth MeyersJean Michel Paré, Anita Briem, Frank Fontaine, Brendan Fraser, Eric Brevig, Giancarlo Caltabiano, Jane Wheeler, Josh Hutcherson, Seth Meyers   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.08 Ounces', 'Item model number': '794043123429', 'Director': 'Eric Brevig', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Full Screen', 'Run time': '1 hour and 33 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Brendan Fraser, Josh Hutcherson, Anita Briem, Seth Meyers, Jean Michel Paré', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: My Grandson has seen Journey 2 and loved it.  He'll be surprised to get this first one for Christmas in his stocking!\nReview Title: Journey DVD\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bible: The Epic Miniseries\nReview Date: 2013/05/14\nStore: Keith David  (Actor),     Darwin Shaw  (Actor),     Crispin Reece  (Director),     Tony Mitchell  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: ['Product Description', 'From Executive Producers Roma Downey and Mark Burnett comes The Bible — an epic 10-part miniseries retelling stories from the Scriptures for a whole new generation. Breathtaking in scope and scale, The Bible features powerful performances, exotic locales and dazzling visual effects that breathe spectacular life into the dramatic tales of faith and courage from Genesis through Revelation. This historic television event is sure to entertain and inspire the whole family.Please note: Some scenes that were shown when The Bible aired may not be included in this release. These missing scenes are an artistic choice, not a defect.Note: The Packaging of the title comes in such a way that a single case is designed to hold all the 4 discs for the title.', 'Amazon.com', \"This 10-part miniseries meets the overwhelming challenge of bringing the story of the Bible to film in a way that embraces modern technology and makes the stories seem relevant and fresh to today's audiences.\", 'The Bible', \"was truly a project of passion for executive producers Mark Burnett and Roma Downey. By focusing on hope and love as the string of continuity throughout the Bible from Genesis to Revelation, Burnett, Roma, and the writers and filmmakers have created a powerful series about a historical text that's at once action film, adventure, and even love story. The many stories included in this presentation include those of Adam and Eve, Noah and the ark, the birth of Abraham's son Isaac, Moses's parting of the Red Sea, David and Goliath, Samson and Delilah, Mary's conception of Jesus and his birth, the crucifixion of Jesus, and the spread of Jesus's word through his disciples. Each of the 10 episodes is powerfully rendered--the subject matter is by nature moving, and the costuming, special effects, settings, and filming choices are fitting and realistic. The performances of the entire cast are stirring, but special recognition is deserved by Diogo Morgado for his performance as Jesus, Downey as Mother Mary, Darwin Shaw as Peter, Joe Wredden as Judas, and William Houston as Moses.\", 'The best thing about this miniseries is that it functions so well on three very disparate levels: it serves as an affirmation of faith and a bringing to life of a beloved story for the devout, a reminder and re-igniter of faith for those raised in faith who may have strayed from religion, and an overview of the Bible\\'s stories and a catalyst for faith for those who may never have been exposed to the Bible. One hesitates to characterize the series as \"highlights of the Bible\" because the moniker trivializes the subject (though Downey calls it just that), but indeed the film views like a \"highlights of\" in the best sense of the phrase: it offers an overview of most of the major, as well as some of the minor events related in the Bible and conveys a strong sense of the emotion, faith, devotion, and even fervor that has driven religious belief for thousands of years.', 'The Bible: The Epic Miniseries', 'is well crafted and powerfully delivered and it absolutely lives up to its professed desire to preserve the true spirit of the Bible. Special features include lots of interview footage with Burnett and Downey on a variety of subjects; featurettes on the Genesis and Creation segments of the series, casting, music, and special effects; and a \"Mary, Did You Know\" music video composed of visual excerpts from the film set to the 1996 recording by Kenny Rogers and Wynonna. (Ages 13 and older due to graphic violence)', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television/Miniseries', 'Format': 'Box set, Color, Multiple Formats, NTSC, Widescreen', 'Contributor': 'Darwin Shaw, Keith David, Diogo Morgado, Andrew Scarborough, Christopher Spencer, Roma Downey, Crispin Reece, Tony MitchellDarwin Shaw, Keith David, Diogo Morgado, Andrew Scarborough, Christopher Spencer, Roma Downey, Crispin Reece, Tony Mitchell  See more', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 5.6 Ounces', 'Item model number': '946642', 'Director': 'Crispin Reece, Tony Mitchell, Christopher Spencer', 'Media Format': 'Box set, Color, Multiple Formats, NTSC, Widescreen', 'Release date': 'April 8, 2014', 'Actors': 'Keith David, Darwin Shaw, Diogo Morgado, Roma Downey, Andrew Scarborough', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '4'}\nReview Text: INTERESTING THE WAY THE PRODUCERS CAPTURED EACH IMPORTANT ISSUE.  WOULD'VE LIKE A LITTLE LESS VIOLENCE.  ANOTHER GREAT TOOL FOR THE NEW CHRISTIAN!\nReview Title: TV BIBLE SERIES DVD\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Osdvd Jiro Dreams Of Sushi\nReview Date: 2014/02/24\nStore: Jiro Ono  (Actor),     David Gelb  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Jiro Dreams of Sushi', \"is the story of 85-year-old Jiro Ono, considered by many to be the world's greatest sushi chef. He is the proprietor of Sukiyabashi Jiro, a 10-seat, sushi-only restaurant inauspiciously located in a Tokyo subway station. Despite its humble appearances, it is the first restaurant of its kind to be awarded a prestigious three-star Michelin Guide rating, and sushi lovers from around the globe make repeated pilgrimage, calling months in advance and shelling out top dollar for a coveted seat at Jiro's sushi bar.\", 'Jiro Dreams of Sushi', \"is a thoughtful and elegant meditation on work, family, and the art of perfection, chronicling Jiro's life as both an unparalleled success in the culinary world and as a loving yet complicated father.\"]\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25334424', 'Director': 'David Gelb', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 22 minutes', 'Release date': 'July 24, 2012', 'Actors': 'Jiro Ono', 'Subtitles': 'English, Spanish', 'Studio': 'Magnolia Home Ent', 'Number of discs': '1'}\nReview Text: Lived in Tokyo several years back and alto we could've afforded going to this place back then....we not now.  Still it was a great film documenting Jiro-san and how his love to perfect the sushi presentation definitely earns him the Michelin award.  Maybe someday we'll go back to Tokyo and eat there.\nReview Title: Jiro Dreans of Sushi\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dark Shadows\nReview Date: 2014/02/24\nStore: Johnny Depp  (Actor, Producer),     Michelle Pfeiffer  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Dark Shadows (DVD)', \"Continuing their creative and commercially incandescent partnership (Charlie and the Chocolate Factory, Sleepy Hollow, Edward Scissorhands), superstar Johnny Depp and macabre movie master Tim Burton reunite yet again in this silver screen adaptation of the cult classic supernatural soap opera that follows the life and loves of New England vampire Barnabas Collins. Also starring Michelle Pfeiffer (Batman Returns), Eva Green (Camelot), Helena Bonham Carter (Harry Potter) and Australian newcomer Bella Heathcote as a young woman who finds herself inexplicably entwined in the vampire's fated love story two centuries earlier, DARK SHADOWS brings to light Depp's vampire from 1752 into the lava lamped vamp camp of 1972!\", ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Eva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski, Richard D. Zanuck, Bella HeathcoteEva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'D279680D', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley', 'Subtitles': 'French, Spanish', 'Producers': 'Johnny Depp, Richard D. Zanuck, Graham King, Christi Dembrowski, David Kennedy', 'Studio': 'WarnerBrothers', 'Writers': 'Seth Grahame-Smith, John August', 'Number of discs': '1'}\nReview Text: Johnny Depp at his usual  funny self!  He really added to humor and storyline.  I was a fan of the original Dark Shadows which I followed extensively.  This one is funny.\nReview Title: Dark Shadows\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: God's Not Dead 2 [DVD]\nReview Date: 2016/09/05\nStore: Melissa Joan Hart  (Actor),     Jesse Metcalfe  (Actor),     Harold Cronk  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"When high school history teacher Grace Wesley (Melissa Joan Hart) is asked a question about Jesus in class, her reasoned response lands her in deep trouble. The ensuing epic court case could expel God from the classroom—and the public square—once and for all! God's Not Dead 2 is a powerful call to action: Where will you stand?\", 'Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Man, Myth, Messiah with Rice Broocks', 'Man, Myth, Messiah with Rice Broocks', 'Between Heaven and Hollywood with David A.R. White', 'Between Heaven and Hollywood with David A.R. White', \"Visual Effects of God's Not Dead 2\", \"Visual Effects of God's Not Dead 2\", 'Filming in Arkansas', 'Filming in Arkansas', 'First Liberty', 'First Liberty', 'Trailers', 'Trailers', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Art House & International', 'Format': 'NTSC, Subtitled', 'Contributor': 'David A.R. White, Robin Givens, Pat Boone, Sadie Robertson, Harold Cronk, Jesse Metcalfe, Michael Scott, Russell Wolfe, Elizabeth Travis, Chuck Konzelman, Melissa Joan Hart, Ray Wise, Brittany Lefebvre, Cary SolomonDavid A.R. White, Robin Givens, Pat Boone, Sadie Robertson, Harold Cronk, Jesse Metcalfe, Michael Scott, Russell Wolfe, Elizabeth Travis, Chuck Konzelman, Melissa Joan Hart, Ray Wise, Brittany Lefebvre, Cary Solomon   See more', 'Initial release date': '2016-08-16', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.35 x 7.52 x 0.67 inches; 1.6 Ounces', 'Item model number': '35644885', 'Director': 'Harold Cronk', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'August 16, 2016', 'Actors': 'Melissa Joan Hart, Jesse Metcalfe, David A.R. White, Robin Givens, Sadie Robertson', 'Subtitles': 'Spanish', 'Producers': 'Michael Scott, David A.R. White, Russell Wolfe, Elizabeth Travis, Brittany Lefebvre', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Chuck Konzelman, Cary Solomon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: GREAT FOLLOWUP TO THE FIRST MOVIE.\nReview Title: GOD'S NOT DEAD 2\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Genius Season 1: Einstein\nReview Date: 2018/05/05\nStore: Geoffrey Rush  (Actor),     Johnny Flynn  (Actor)    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['From executive producers and Academy Award Winners Brian Grazer and Ron Howard*, National Geographic’s first-ever scripted series, GENIUS, offers an extraordinary look into the life of Nobel Prize-winning physicist Albert Einstein. Academy Award Winner Geoffrey Rush** stars as the rebellious daydreamer who went on to become the greatest scientific mind of the 20th century. Beyond his groundbreaking theories of relativity, you’ll witness Einstein’s struggles to be a good husband and father— and a man of principle during a time of global unrest. With Johnny Flynn as young Albert and Emily Watson as his second wife, Elsa, GENIUS takes you on an unprecedented, 10-episode journey of discovery guided by Einstein’s wit, wisdom and insatiable thirst for knowledge. *A Beautiful Mind, 2001: Best Picture (Brian Grazer and Ron Howard, Producers), Directing (Ron Howard). **Actor, Shine, 1996.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '2333911', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Release date': 'April 17, 2018', 'Actors': 'Geoffrey Rush, Johnny Flynn, Emily Watson', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nReview Text: Saw this on natgeo tv and decided to get this for grandson who is fascinated by science.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference": "Journey to the Center of the Earth\nBrendan Fraser  (Actor),     Josh Hutcherson  (Actor),     Eric Brevig  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', 'Journey to the Center of the Earth (DVD) (FS/WS)', 'During a scientific expedition in Iceland, visionary scientist Trevor Anderson (Brendan Fraser), his nephew Sean (Josh Hutcherson) and their beautiful local guide, Hannah (Anita Briem), are unexpectedly trapped in a cave from which their only escape is to go deeper and deeper into the depths of the Earth. Traveling through never-before-seen worlds, the trio comes face-to-face with surreal and unimaginable creatures-- including man-eating plants, giant flying piranha, glow birds and terrifying dinosaurs from days past. The explorers soon realize that as volcanic activity increases around them, they must find a way back to the earth\\'s surface before it is too late. With spectacular photo-real environments and revolutionary new filmmaking techniques, \"Journey to the Center of the Earth\" is an epic adventure that takes audiences directly into the heart of our heroes\\' voyage, bringing them along for a wild, visceral ride.', ']]>', 'Amazon.com', \"When a seismic geologist (Brendan Fraser) discovers his lost brother's notes in a copy of the titular Jules Verne novel, he and his nephew (Josh Hutcherson,\", 'Bridge to Terabithia', ',', 'Zathura', ') head to Iceland. There, joined by a fetching mountain guide (played by Icelandic actress Anita Briem), they get trapped in a cavern and go down, down, down, finally arriving in a primeval underworld full of prehistoric beasts and carnivorous plants. It would be pointless to complain about the empty-headedness of it all;', 'Journey to the Center of the Earth', \"aspires to be a kinesthetic experience. It wants to engage your adrenal glands, not your brain or your heart (the dialogue and characters are so generic, the script may have been cut-and-pasted from previous versions of Verne's book). Fraser, with his goofy handsomeness and accessible presence, provides a reasonably human axis around which all the frantic flying and swooping CGI effects revolve. The movie is as hollow as the world it depicts, but as mindless action movies go, you could do a lot worse. (Note:\", 'Journey to the Center of the Earth', 'was released in theaters in 3-D, full of whizz-bang demonstrations of how far 3-D technology had come--trilobite antennae quivering towards the audience, a T-rex lunging out of the frame, even affable star Brendan Fraser spitting on us--as well as a half-dozen action sequences clearly destined to become video games or theme park rides.)', '--Bret Fetzer']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Full Screen', 'Contributor': 'Jean Michel Paré, Anita Briem, Frank Fontaine, Brendan Fraser, Eric Brevig, Giancarlo Caltabiano, Jane Wheeler, Josh Hutcherson, Seth MeyersJean Michel Paré, Anita Briem, Frank Fontaine, Brendan Fraser, Eric Brevig, Giancarlo Caltabiano, Jane Wheeler, Josh Hutcherson, Seth Meyers   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.08 Ounces', 'Item model number': '794043123429', 'Director': 'Eric Brevig', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Full Screen', 'Run time': '1 hour and 33 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Brendan Fraser, Josh Hutcherson, Anita Briem, Seth Meyers, Jean Michel Paré', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nMy Grandson has seen Journey 2 and loved it.  He'll be surprised to get this first one for Christmas in his stocking!\nJourney DVD\nThe Bible: The Epic Miniseries\nKeith David  (Actor),     Darwin Shaw  (Actor),     Crispin Reece  (Director),     Tony Mitchell  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', 'From Executive Producers Roma Downey and Mark Burnett comes The Bible — an epic 10-part miniseries retelling stories from the Scriptures for a whole new generation. Breathtaking in scope and scale, The Bible features powerful performances, exotic locales and dazzling visual effects that breathe spectacular life into the dramatic tales of faith and courage from Genesis through Revelation. This historic television event is sure to entertain and inspire the whole family.Please note: Some scenes that were shown when The Bible aired may not be included in this release. These missing scenes are an artistic choice, not a defect.Note: The Packaging of the title comes in such a way that a single case is designed to hold all the 4 discs for the title.', 'Amazon.com', \"This 10-part miniseries meets the overwhelming challenge of bringing the story of the Bible to film in a way that embraces modern technology and makes the stories seem relevant and fresh to today's audiences.\", 'The Bible', \"was truly a project of passion for executive producers Mark Burnett and Roma Downey. By focusing on hope and love as the string of continuity throughout the Bible from Genesis to Revelation, Burnett, Roma, and the writers and filmmakers have created a powerful series about a historical text that's at once action film, adventure, and even love story. The many stories included in this presentation include those of Adam and Eve, Noah and the ark, the birth of Abraham's son Isaac, Moses's parting of the Red Sea, David and Goliath, Samson and Delilah, Mary's conception of Jesus and his birth, the crucifixion of Jesus, and the spread of Jesus's word through his disciples. Each of the 10 episodes is powerfully rendered--the subject matter is by nature moving, and the costuming, special effects, settings, and filming choices are fitting and realistic. The performances of the entire cast are stirring, but special recognition is deserved by Diogo Morgado for his performance as Jesus, Downey as Mother Mary, Darwin Shaw as Peter, Joe Wredden as Judas, and William Houston as Moses.\", 'The best thing about this miniseries is that it functions so well on three very disparate levels: it serves as an affirmation of faith and a bringing to life of a beloved story for the devout, a reminder and re-igniter of faith for those raised in faith who may have strayed from religion, and an overview of the Bible\\'s stories and a catalyst for faith for those who may never have been exposed to the Bible. One hesitates to characterize the series as \"highlights of the Bible\" because the moniker trivializes the subject (though Downey calls it just that), but indeed the film views like a \"highlights of\" in the best sense of the phrase: it offers an overview of most of the major, as well as some of the minor events related in the Bible and conveys a strong sense of the emotion, faith, devotion, and even fervor that has driven religious belief for thousands of years.', 'The Bible: The Epic Miniseries', 'is well crafted and powerfully delivered and it absolutely lives up to its professed desire to preserve the true spirit of the Bible. Special features include lots of interview footage with Burnett and Downey on a variety of subjects; featurettes on the Genesis and Creation segments of the series, casting, music, and special effects; and a \"Mary, Did You Know\" music video composed of visual excerpts from the film set to the 1996 recording by Kenny Rogers and Wynonna. (Ages 13 and older due to graphic violence)', '--Tami Horiuchi']\n{'Genre': 'Drama/Television, Television/Miniseries', 'Format': 'Box set, Color, Multiple Formats, NTSC, Widescreen', 'Contributor': 'Darwin Shaw, Keith David, Diogo Morgado, Andrew Scarborough, Christopher Spencer, Roma Downey, Crispin Reece, Tony MitchellDarwin Shaw, Keith David, Diogo Morgado, Andrew Scarborough, Christopher Spencer, Roma Downey, Crispin Reece, Tony Mitchell  See more', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 5.6 Ounces', 'Item model number': '946642', 'Director': 'Crispin Reece, Tony Mitchell, Christopher Spencer', 'Media Format': 'Box set, Color, Multiple Formats, NTSC, Widescreen', 'Release date': 'April 8, 2014', 'Actors': 'Keith David, Darwin Shaw, Diogo Morgado, Roma Downey, Andrew Scarborough', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '4'}\nINTERESTING THE WAY THE PRODUCERS CAPTURED EACH IMPORTANT ISSUE.  WOULD'VE LIKE A LITTLE LESS VIOLENCE.  ANOTHER GREAT TOOL FOR THE NEW CHRISTIAN!\nTV BIBLE SERIES DVD\nOsdvd Jiro Dreams Of Sushi\nJiro Ono  (Actor),     David Gelb  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Jiro Dreams of Sushi', \"is the story of 85-year-old Jiro Ono, considered by many to be the world's greatest sushi chef. He is the proprietor of Sukiyabashi Jiro, a 10-seat, sushi-only restaurant inauspiciously located in a Tokyo subway station. Despite its humble appearances, it is the first restaurant of its kind to be awarded a prestigious three-star Michelin Guide rating, and sushi lovers from around the globe make repeated pilgrimage, calling months in advance and shelling out top dollar for a coveted seat at Jiro's sushi bar.\", 'Jiro Dreams of Sushi', \"is a thoughtful and elegant meditation on work, family, and the art of perfection, chronicling Jiro's life as both an unparalleled success in the culinary world and as a loving yet complicated father.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25334424', 'Director': 'David Gelb', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 22 minutes', 'Release date': 'July 24, 2012', 'Actors': 'Jiro Ono', 'Subtitles': 'English, Spanish', 'Studio': 'Magnolia Home Ent', 'Number of discs': '1'}\nLived in Tokyo several years back and alto we could've afforded going to this place back then....we not now.  Still it was a great film documenting Jiro-san and how his love to perfect the sushi presentation definitely earns him the Michelin award.  Maybe someday we'll go back to Tokyo and eat there.\nJiro Dreans of Sushi\nDark Shadows\nJohnny Depp  (Actor, Producer),     Michelle Pfeiffer  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Dark Shadows (DVD)', \"Continuing their creative and commercially incandescent partnership (Charlie and the Chocolate Factory, Sleepy Hollow, Edward Scissorhands), superstar Johnny Depp and macabre movie master Tim Burton reunite yet again in this silver screen adaptation of the cult classic supernatural soap opera that follows the life and loves of New England vampire Barnabas Collins. Also starring Michelle Pfeiffer (Batman Returns), Eva Green (Camelot), Helena Bonham Carter (Harry Potter) and Australian newcomer Bella Heathcote as a young woman who finds herself inexplicably entwined in the vampire's fated love story two centuries earlier, DARK SHADOWS brings to light Depp's vampire from 1752 into the lava lamped vamp camp of 1972!\", ']]>']\n{'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Eva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski, Richard D. Zanuck, Bella HeathcoteEva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'D279680D', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley', 'Subtitles': 'French, Spanish', 'Producers': 'Johnny Depp, Richard D. Zanuck, Graham King, Christi Dembrowski, David Kennedy', 'Studio': 'WarnerBrothers', 'Writers': 'Seth Grahame-Smith, John August', 'Number of discs': '1'}\nJohnny Depp at his usual  funny self!  He really added to humor and storyline.  I was a fan of the original Dark Shadows which I followed extensively.  This one is funny.\nDark Shadows\nGod's Not Dead 2 [DVD]\nMelissa Joan Hart  (Actor),     Jesse Metcalfe  (Actor),     Harold Cronk  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"When high school history teacher Grace Wesley (Melissa Joan Hart) is asked a question about Jesus in class, her reasoned response lands her in deep trouble. The ensuing epic court case could expel God from the classroom—and the public square—once and for all! God's Not Dead 2 is a powerful call to action: Where will you stand?\", 'Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Man, Myth, Messiah with Rice Broocks', 'Man, Myth, Messiah with Rice Broocks', 'Between Heaven and Hollywood with David A.R. White', 'Between Heaven and Hollywood with David A.R. White', \"Visual Effects of God's Not Dead 2\", \"Visual Effects of God's Not Dead 2\", 'Filming in Arkansas', 'Filming in Arkansas', 'First Liberty', 'First Liberty', 'Trailers', 'Trailers', ']]>']\n{'Genre': 'Drama, Art House & International', 'Format': 'NTSC, Subtitled', 'Contributor': 'David A.R. White, Robin Givens, Pat Boone, Sadie Robertson, Harold Cronk, Jesse Metcalfe, Michael Scott, Russell Wolfe, Elizabeth Travis, Chuck Konzelman, Melissa Joan Hart, Ray Wise, Brittany Lefebvre, Cary SolomonDavid A.R. White, Robin Givens, Pat Boone, Sadie Robertson, Harold Cronk, Jesse Metcalfe, Michael Scott, Russell Wolfe, Elizabeth Travis, Chuck Konzelman, Melissa Joan Hart, Ray Wise, Brittany Lefebvre, Cary Solomon   See more', 'Initial release date': '2016-08-16', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.35 x 7.52 x 0.67 inches; 1.6 Ounces', 'Item model number': '35644885', 'Director': 'Harold Cronk', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'August 16, 2016', 'Actors': 'Melissa Joan Hart, Jesse Metcalfe, David A.R. White, Robin Givens, Sadie Robertson', 'Subtitles': 'Spanish', 'Producers': 'Michael Scott, David A.R. White, Russell Wolfe, Elizabeth Travis, Brittany Lefebvre', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Chuck Konzelman, Cary Solomon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGREAT FOLLOWUP TO THE FIRST MOVIE.\nGOD'S NOT DEAD 2\nGenius Season 1: Einstein\nGeoffrey Rush  (Actor),     Johnny Flynn  (Actor)    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['From executive producers and Academy Award Winners Brian Grazer and Ron Howard*, National Geographic’s first-ever scripted series, GENIUS, offers an extraordinary look into the life of Nobel Prize-winning physicist Albert Einstein. Academy Award Winner Geoffrey Rush** stars as the rebellious daydreamer who went on to become the greatest scientific mind of the 20th century. Beyond his groundbreaking theories of relativity, you’ll witness Einstein’s struggles to be a good husband and father— and a man of principle during a time of global unrest. With Johnny Flynn as young Albert and Emily Watson as his second wife, Elsa, GENIUS takes you on an unprecedented, 10-episode journey of discovery guided by Einstein’s wit, wisdom and insatiable thirst for knowledge. *A Beautiful Mind, 2001: Best Picture (Brian Grazer and Ron Howard, Producers), Directing (Ron Howard). **Actor, Shine, 1996.']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '2333911', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Release date': 'April 17, 2018', 'Actors': 'Geoffrey Rush, Johnny Flynn, Emily Watson', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nSaw this on natgeo tv and decided to get this for grandson who is fascinated by science.\nFive Stars",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Journey to the Center of the Earth\nReview Date: 2012/12/07\nStore: Brendan Fraser  (Actor),     Josh Hutcherson  (Actor),     Eric Brevig  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', 'Journey to the Center of the Earth (DVD) (FS/WS)', 'During a scientific expedition in Iceland, visionary scientist Trevor Anderson (Brendan Fraser), his nephew Sean (Josh Hutcherson) and their beautiful local guide, Hannah (Anita Briem), are unexpectedly trapped in a cave from which their only escape is to go deeper and deeper into the depths of the Earth. Traveling through never-before-seen worlds, the trio comes face-to-face with surreal and unimaginable creatures-- including man-eating plants, giant flying piranha, glow birds and terrifying dinosaurs from days past. The explorers soon realize that as volcanic activity increases around them, they must find a way back to the earth\\'s surface before it is too late. With spectacular photo-real environments and revolutionary new filmmaking techniques, \"Journey to the Center of the Earth\" is an epic adventure that takes audiences directly into the heart of our heroes\\' voyage, bringing them along for a wild, visceral ride.', ']]>', 'Amazon.com', \"When a seismic geologist (Brendan Fraser) discovers his lost brother's notes in a copy of the titular Jules Verne novel, he and his nephew (Josh Hutcherson,\", 'Bridge to Terabithia', ',', 'Zathura', ') head to Iceland. There, joined by a fetching mountain guide (played by Icelandic actress Anita Briem), they get trapped in a cavern and go down, down, down, finally arriving in a primeval underworld full of prehistoric beasts and carnivorous plants. It would be pointless to complain about the empty-headedness of it all;', 'Journey to the Center of the Earth', \"aspires to be a kinesthetic experience. It wants to engage your adrenal glands, not your brain or your heart (the dialogue and characters are so generic, the script may have been cut-and-pasted from previous versions of Verne's book). Fraser, with his goofy handsomeness and accessible presence, provides a reasonably human axis around which all the frantic flying and swooping CGI effects revolve. The movie is as hollow as the world it depicts, but as mindless action movies go, you could do a lot worse. (Note:\", 'Journey to the Center of the Earth', 'was released in theaters in 3-D, full of whizz-bang demonstrations of how far 3-D technology had come--trilobite antennae quivering towards the audience, a T-rex lunging out of the frame, even affable star Brendan Fraser spitting on us--as well as a half-dozen action sequences clearly destined to become video games or theme park rides.)', '--Bret Fetzer']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Full Screen', 'Contributor': 'Jean Michel Paré, Anita Briem, Frank Fontaine, Brendan Fraser, Eric Brevig, Giancarlo Caltabiano, Jane Wheeler, Josh Hutcherson, Seth MeyersJean Michel Paré, Anita Briem, Frank Fontaine, Brendan Fraser, Eric Brevig, Giancarlo Caltabiano, Jane Wheeler, Josh Hutcherson, Seth Meyers   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.08 Ounces', 'Item model number': '794043123429', 'Director': 'Eric Brevig', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Full Screen', 'Run time': '1 hour and 33 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Brendan Fraser, Josh Hutcherson, Anita Briem, Seth Meyers, Jean Michel Paré', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: My Grandson has seen Journey 2 and loved it.  He'll be surprised to get this first one for Christmas in his stocking!\nReview Title: Journey DVD\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bible: The Epic Miniseries\nReview Date: 2013/05/14\nStore: Keith David  (Actor),     Darwin Shaw  (Actor),     Crispin Reece  (Director),     Tony Mitchell  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: ['Product Description', 'From Executive Producers Roma Downey and Mark Burnett comes The Bible — an epic 10-part miniseries retelling stories from the Scriptures for a whole new generation. Breathtaking in scope and scale, The Bible features powerful performances, exotic locales and dazzling visual effects that breathe spectacular life into the dramatic tales of faith and courage from Genesis through Revelation. This historic television event is sure to entertain and inspire the whole family.Please note: Some scenes that were shown when The Bible aired may not be included in this release. These missing scenes are an artistic choice, not a defect.Note: The Packaging of the title comes in such a way that a single case is designed to hold all the 4 discs for the title.', 'Amazon.com', \"This 10-part miniseries meets the overwhelming challenge of bringing the story of the Bible to film in a way that embraces modern technology and makes the stories seem relevant and fresh to today's audiences.\", 'The Bible', \"was truly a project of passion for executive producers Mark Burnett and Roma Downey. By focusing on hope and love as the string of continuity throughout the Bible from Genesis to Revelation, Burnett, Roma, and the writers and filmmakers have created a powerful series about a historical text that's at once action film, adventure, and even love story. The many stories included in this presentation include those of Adam and Eve, Noah and the ark, the birth of Abraham's son Isaac, Moses's parting of the Red Sea, David and Goliath, Samson and Delilah, Mary's conception of Jesus and his birth, the crucifixion of Jesus, and the spread of Jesus's word through his disciples. Each of the 10 episodes is powerfully rendered--the subject matter is by nature moving, and the costuming, special effects, settings, and filming choices are fitting and realistic. The performances of the entire cast are stirring, but special recognition is deserved by Diogo Morgado for his performance as Jesus, Downey as Mother Mary, Darwin Shaw as Peter, Joe Wredden as Judas, and William Houston as Moses.\", 'The best thing about this miniseries is that it functions so well on three very disparate levels: it serves as an affirmation of faith and a bringing to life of a beloved story for the devout, a reminder and re-igniter of faith for those raised in faith who may have strayed from religion, and an overview of the Bible\\'s stories and a catalyst for faith for those who may never have been exposed to the Bible. One hesitates to characterize the series as \"highlights of the Bible\" because the moniker trivializes the subject (though Downey calls it just that), but indeed the film views like a \"highlights of\" in the best sense of the phrase: it offers an overview of most of the major, as well as some of the minor events related in the Bible and conveys a strong sense of the emotion, faith, devotion, and even fervor that has driven religious belief for thousands of years.', 'The Bible: The Epic Miniseries', 'is well crafted and powerfully delivered and it absolutely lives up to its professed desire to preserve the true spirit of the Bible. Special features include lots of interview footage with Burnett and Downey on a variety of subjects; featurettes on the Genesis and Creation segments of the series, casting, music, and special effects; and a \"Mary, Did You Know\" music video composed of visual excerpts from the film set to the 1996 recording by Kenny Rogers and Wynonna. (Ages 13 and older due to graphic violence)', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television/Miniseries', 'Format': 'Box set, Color, Multiple Formats, NTSC, Widescreen', 'Contributor': 'Darwin Shaw, Keith David, Diogo Morgado, Andrew Scarborough, Christopher Spencer, Roma Downey, Crispin Reece, Tony MitchellDarwin Shaw, Keith David, Diogo Morgado, Andrew Scarborough, Christopher Spencer, Roma Downey, Crispin Reece, Tony Mitchell  See more', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 5.6 Ounces', 'Item model number': '946642', 'Director': 'Crispin Reece, Tony Mitchell, Christopher Spencer', 'Media Format': 'Box set, Color, Multiple Formats, NTSC, Widescreen', 'Release date': 'April 8, 2014', 'Actors': 'Keith David, Darwin Shaw, Diogo Morgado, Roma Downey, Andrew Scarborough', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Number of discs': '4'}\nReview Text: INTERESTING THE WAY THE PRODUCERS CAPTURED EACH IMPORTANT ISSUE.  WOULD'VE LIKE A LITTLE LESS VIOLENCE.  ANOTHER GREAT TOOL FOR THE NEW CHRISTIAN!\nReview Title: TV BIBLE SERIES DVD\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Osdvd Jiro Dreams Of Sushi\nReview Date: 2014/02/24\nStore: Jiro Ono  (Actor),     David Gelb  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Jiro Dreams of Sushi', \"is the story of 85-year-old Jiro Ono, considered by many to be the world's greatest sushi chef. He is the proprietor of Sukiyabashi Jiro, a 10-seat, sushi-only restaurant inauspiciously located in a Tokyo subway station. Despite its humble appearances, it is the first restaurant of its kind to be awarded a prestigious three-star Michelin Guide rating, and sushi lovers from around the globe make repeated pilgrimage, calling months in advance and shelling out top dollar for a coveted seat at Jiro's sushi bar.\", 'Jiro Dreams of Sushi', \"is a thoughtful and elegant meditation on work, family, and the art of perfection, chronicling Jiro's life as both an unparalleled success in the culinary world and as a loving yet complicated father.\"]\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25334424', 'Director': 'David Gelb', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 22 minutes', 'Release date': 'July 24, 2012', 'Actors': 'Jiro Ono', 'Subtitles': 'English, Spanish', 'Studio': 'Magnolia Home Ent', 'Number of discs': '1'}\nReview Text: Lived in Tokyo several years back and alto we could've afforded going to this place back then....we not now.  Still it was a great film documenting Jiro-san and how his love to perfect the sushi presentation definitely earns him the Michelin award.  Maybe someday we'll go back to Tokyo and eat there.\nReview Title: Jiro Dreans of Sushi\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dark Shadows\nReview Date: 2014/02/24\nStore: Johnny Depp  (Actor, Producer),     Michelle Pfeiffer  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Dark Shadows (DVD)', \"Continuing their creative and commercially incandescent partnership (Charlie and the Chocolate Factory, Sleepy Hollow, Edward Scissorhands), superstar Johnny Depp and macabre movie master Tim Burton reunite yet again in this silver screen adaptation of the cult classic supernatural soap opera that follows the life and loves of New England vampire Barnabas Collins. Also starring Michelle Pfeiffer (Batman Returns), Eva Green (Camelot), Helena Bonham Carter (Harry Potter) and Australian newcomer Bella Heathcote as a young woman who finds herself inexplicably entwined in the vampire's fated love story two centuries earlier, DARK SHADOWS brings to light Depp's vampire from 1752 into the lava lamped vamp camp of 1972!\", ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Eva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski, Richard D. Zanuck, Bella HeathcoteEva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'D279680D', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley', 'Subtitles': 'French, Spanish', 'Producers': 'Johnny Depp, Richard D. Zanuck, Graham King, Christi Dembrowski, David Kennedy', 'Studio': 'WarnerBrothers', 'Writers': 'Seth Grahame-Smith, John August', 'Number of discs': '1'}\nReview Text: Johnny Depp at his usual  funny self!  He really added to humor and storyline.  I was a fan of the original Dark Shadows which I followed extensively.  This one is funny.\nReview Title: Dark Shadows\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: God's Not Dead 2 [DVD]\nReview Date: 2016/09/05\nStore: Melissa Joan Hart  (Actor),     Jesse Metcalfe  (Actor),     Harold Cronk  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"When high school history teacher Grace Wesley (Melissa Joan Hart) is asked a question about Jesus in class, her reasoned response lands her in deep trouble. The ensuing epic court case could expel God from the classroom—and the public square—once and for all! God's Not Dead 2 is a powerful call to action: Where will you stand?\", 'Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Man, Myth, Messiah with Rice Broocks', 'Man, Myth, Messiah with Rice Broocks', 'Between Heaven and Hollywood with David A.R. White', 'Between Heaven and Hollywood with David A.R. White', \"Visual Effects of God's Not Dead 2\", \"Visual Effects of God's Not Dead 2\", 'Filming in Arkansas', 'Filming in Arkansas', 'First Liberty', 'First Liberty', 'Trailers', 'Trailers', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Art House & International', 'Format': 'NTSC, Subtitled', 'Contributor': 'David A.R. White, Robin Givens, Pat Boone, Sadie Robertson, Harold Cronk, Jesse Metcalfe, Michael Scott, Russell Wolfe, Elizabeth Travis, Chuck Konzelman, Melissa Joan Hart, Ray Wise, Brittany Lefebvre, Cary SolomonDavid A.R. White, Robin Givens, Pat Boone, Sadie Robertson, Harold Cronk, Jesse Metcalfe, Michael Scott, Russell Wolfe, Elizabeth Travis, Chuck Konzelman, Melissa Joan Hart, Ray Wise, Brittany Lefebvre, Cary Solomon   See more', 'Initial release date': '2016-08-16', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.35 x 7.52 x 0.67 inches; 1.6 Ounces', 'Item model number': '35644885', 'Director': 'Harold Cronk', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'August 16, 2016', 'Actors': 'Melissa Joan Hart, Jesse Metcalfe, David A.R. White, Robin Givens, Sadie Robertson', 'Subtitles': 'Spanish', 'Producers': 'Michael Scott, David A.R. White, Russell Wolfe, Elizabeth Travis, Brittany Lefebvre', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Chuck Konzelman, Cary Solomon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: GREAT FOLLOWUP TO THE FIRST MOVIE.\nReview Title: GOD'S NOT DEAD 2\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Genius Season 1: Einstein\nReview Date: 2018/05/05\nStore: Geoffrey Rush  (Actor),     Johnny Flynn  (Actor)    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['From executive producers and Academy Award Winners Brian Grazer and Ron Howard*, National Geographic’s first-ever scripted series, GENIUS, offers an extraordinary look into the life of Nobel Prize-winning physicist Albert Einstein. Academy Award Winner Geoffrey Rush** stars as the rebellious daydreamer who went on to become the greatest scientific mind of the 20th century. Beyond his groundbreaking theories of relativity, you’ll witness Einstein’s struggles to be a good husband and father— and a man of principle during a time of global unrest. With Johnny Flynn as young Albert and Emily Watson as his second wife, Elsa, GENIUS takes you on an unprecedented, 10-episode journey of discovery guided by Einstein’s wit, wisdom and insatiable thirst for knowledge. *A Beautiful Mind, 2001: Best Picture (Brian Grazer and Ron Howard, Producers), Directing (Ron Howard). **Actor, Shine, 1996.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '2333911', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Release date': 'April 17, 2018', 'Actors': 'Geoffrey Rush, Johnny Flynn, Emily Watson', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nReview Text: Saw this on natgeo tv and decided to get this for grandson who is fascinated by science.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual demonstrates a clear preference for family-friendly entertainment, particularly in the genres of science fiction, drama, and documentaries. Consistent high ratings (averaging 4.6 to 5.0) across multiple purchases indicate positive sentiments towards both educational and imaginative narratives. The buyer often selects content that intertwines adventure and moral themes, as seen in choices like biblical adaptations and inspirational stories.\n\nThere is a notable trend toward products that are suitable for family viewing, suggesting a strong value placed on content that can engage children or younger audiences. The person gravitates towards well-reviewed box sets and miniseries, indicating an appreciation for in-depth storytelling and character development.\n\nIn terms of quality, the buyer seems to prefer higher production values and noteworthy performances, frequently highlighting the directing and acting talent involved. Price sensitivity appears moderate, with purchases reflecting a willingness to invest in quality over budget options.\n\nOverall, this consumer’s core preferences center around family-oriented, thought-provoking media that offers both entertainment and educational value, reinforced through high ratings and thoughtful engagement with the material.",
  "target_interaction": {
    "rating": 5.0,
    "title": "A Dog's Journey sequel to A Dog's Purpose, must watch with tissues ready!",
    "text": "Had opportunity to watch this tear jerking movie while on a flight to Asia.  I literally was sobbing and my heart heavy!  Hope the guy sitting next to me didn't notice!! Have not seen the 1st movie but am determined to do so.  Plan on buying the pack to watch again and again while sharing with my family.  We lost our beloved German Shepherd (Sachi)  at 14 yrs old 2 years ago and it's been hard for us to get another pup into our lives.  This movie spoke to me.  Sometimes I feel our Sachi is still with us; perhaps it's time to have a dog into our lives again.  I pray Sachi will help us find our next pup.",
    "images": [],
    "asin": "B07RD887CZ",
    "parent_asin": "B07RD887CZ",
    "user_id": "AFCLLS3FJK45DRQOBP3KTCVNQ2RQ",
    "timestamp": "2019-11-16 04:23:15.713000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.8,
    "rating_number": 12845,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/dab5821cff0a3d86c991841f58ee844586f0f65aa29cbcb58649c5c0c0c5dc39._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/dab5821cff0a3d86c991841f58ee844586f0f65aa29cbcb58649c5c0c0c5dc39._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/dab5821cff0a3d86c991841f58ee844586f0f65aa29cbcb58649c5c0c0c5dc39._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/dab5821cff0a3d86c991841f58ee844586f0f65aa29cbcb58649c5c0c0c5dc39._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/dab5821cff0a3d86c991841f58ee844586f0f65aa29cbcb58649c5c0c0c5dc39._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/dab5821cff0a3d86c991841f58ee844586f0f65aa29cbcb58649c5c0c0c5dc39._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English",
        "English [Audio Description]"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Gail Mancuso"
      ],
      "Producers": [
        "Gavin Polone"
      ],
      "Starring": [
        "Marg Helgenberger",
        "Betty Gilpin",
        "Henry Lau"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}