{
  "user_id": "AETRYWNQ7I7MEALQ2BBJXZ5MRDGA",
  "summary": "=== Purchase Information ===\nProduct Title: Holiday in Handcuffs\nReview Date: 2016/12/13\nStore: Melissa Joan Hart  (Actor),     Mario Lopez  (Actor),     Ron Underwood  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['A ne er-do-well thirty-something (Melissa Joan Hart) attempts to appease her family by kidnapping herself an attractive boyfriend (Mario Lopez) for the family Christmas. Despite unlikely odds and dysfunctional family moments, the two fall in love and share a magical Christmas.StarringMelissaJoan Hart and Mario Lopez SPECIAL FEATURES: Cast Interviews!  Film Trailers of ABC Family s Original Movies: Snow and Snowglobe Sneak Peek Trailer of ABC Family s 25 Days of Christmas Holiday Event!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Mario Lopez, Ron Underwood, Melissa Joan Hart', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '18713532770', 'Director': 'Ron Underwood', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 7, 2008', 'Actors': 'Melissa Joan Hart, Mario Lopez', 'Studio': 'ABC Family - Gaiam', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I bought this for my mom's birthday.  She loves this movie.\nReview Title: Gift\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ernest Saves Christmas\nReview Date: 2016/12/16\nStore: Jim Varney  (Actor),     Billie Bird  (Actor),     John Cherry  (Director),     Peter Stein  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: [\"High-flying reindeer! Mischievous elves! Warp-speed sleigh rides! Get set for a magical dose of holiday cheer, zany season's greetings, and spell-binding special effects in this fast-paced, heartwarming comedy hit! When Santa Claus decides to retire and pass on his magic bag of Christmas surprises to a new St. Nick, he enlists the aid of a hilarious assortment of characters, including that lovable know-it-all Ernest P. Worrell (Emmy Award-winning comedian Jim Varney)! Along the way, Santa and Ernest help a cynical teen experience the season's spirit like never before. And that's where the fun -- and magic -- begin! ERNEST SAVES CHRISTMAS ... one delightful, surprising tale you'll never forget!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Contributor': 'Patty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher MartinPatty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher Martin  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Surround)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936188196', 'Director': 'John Cherry, Peter Stein', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Run time': '1 hour and 31 minutes', 'Release date': 'September 3, 2002', 'Actors': 'Jim Varney, Billie Bird, Bill Byrge, Douglas Seale, Oliver Clark', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'B. Kline, Ed Turner', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I hadn't seen this in years.  It is cute.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Story (DVD)\nReview Date: 2016/12/19\nStore: Peter Billingsley  (Actor),     Melinda Dillon  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Product Description', 'Christmas Story, A (WBFE) (DVD)', \"It's the final days before Christmas in early 1940s Cleveland, and 9-year-old Ralphie wants one thing from Santa Clause more than anything else: a Red Ryder Carbine Action Air Rifle. As he trudges through the snow to school, faces the neighborhood bully and visits a malevolent department store Santa Clause, Ralphie connives, conspires and campaigns for the most fabulous Christmas present ever in this heartwarming, hysterical and sweetly nostalgic holiday film.\", ']]>', 'Amazon.com', \"Director Bob Clark's charming, touching, and very funny adaptation of humorist Jean Shepherd's nostalgic, autobiographical Yuletide novel,\", 'In God We Trust, All Others Pay Cash', ', remains essential holiday family viewing. Narrated by a man (Shepherd) recalling his childhood, the film looks back at the compulsive efforts of 7-year-old Ralphie (Peter Billingsley) as he tries every means possible to acquire his dream Christmas gift--a Daisy-brand Red Ryder repeating BB carbine with a compass mounted in the stock. Problem is, he lives in a Norman Rockwell-esque Midwestern town in the 1940s, where his parents, teachers, and even Santa Claus all warn Ralphie that \"he\\'ll shoot his eye out.\" Episodic in nature and seen entirely through the eyes of a child, the film offers a wonderful look at the day-to-day eccentricities that grew out of this conservative period. More interestingly, it cleverly captures childhood urgency, where even the most trivial fantasies or objects become immediate life-or-death necessities. While countless family Christmas movies serve up clichéd situations suffocating with preachy sermons, Clark\\'s acute eye for detail and odd mixture of warmth, satire, and quirky humor are the reasons why so many viewers have rediscovered this after it initially bombed in the theaters. Sentimental without being syrupy, it\\'s a true rarity: a holiday movie that adults and children can enjoy equally, for completely different reasons and regardless of the season.', '--Dave McCoy', 'Review', \"In short, A Christmas Story isn't just about Christmas; it's about childhood and it recaptures a time and place with love and wonder. It seems an instant classic, a film that will give pleasure to people not only this Christmas, but for many Christmases to come. --Jay Car, Boston GlobeThe cast is wonderful--especially McGavin, Billingsley and Petrella--the laughs are nonstop if rarely subtle, and the whole thing deserves to become a Christmastime classic. --TV Guide, StaffIt is pitch-perfect, telling the story through the enthusiastic and single-minded vision of its hero Ralphie, and finding in young Peter Billingsley a sly combination of innocence and calculation. --Roger Ebert, Chicago Sun-Times\", 'About the Actor', \"Peter Billingsley has been a member of the Hollywood community since he was a small child. After appearing on numerous television shows and films during his youth, the Emmy Award-nominated actor delivered a performance for the ages in the beloved holiday film, A Christmas Story (1983). Melinda Dillon made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969) and in Steven Spielberg's Close Encounters of the Third Kind (1977). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987).\", 'About the Director', \"Bob Clark is a director known for his '80s movies such as A Christmas Story (1983), Porky's (1982) and Rhinestone (1984).\", 'See more']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.33 Ounces', 'Item model number': '3349475', 'Director': 'Bob Clark', 'Media Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2007', 'Actors': 'Peter Billingsley, Melinda Dillon, Darren McGavin, Ian Petrella, Scott Schwartz', 'Subtitles': 'English, French, Spanish', 'Producers': 'Rene Dupont, Bob Clark', 'Studio': 'Studio Distribution Services', 'Writers': 'Jean Sheppard, Leigh Brown', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is one of my favorite Christmas movies.\nReview Title: Christmas classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)\nReview Date: 2016/12/19\nStore: Various  (Actor, Director)    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '8 hours and 38 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '11270413', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: Morgan Freeman is an excellent actor.  All these movies were good.  I don't regret my purchase. Great for when nothing is good on tv.\nReview Title: Good combo\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Princess Diaries: Two-Movie Collection (Three-Disc Combo Blu-ray/DVD Combo in Blu-ray Packaging)\nReview Date: 2016/12/19\nStore: Julie Andrews  (Actor),     Anne Hathaway  (Actor),     Garry Marshall  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['To commemorate the 10th anniversary (2001 - 2011) of a cherished family classic, Disney proudly presents a special movie collection featuring two modern-day fairy tales, THE PRINCESS DIARIES and THE PRINCESS DIARIES 2: ROYAL ENGAGEMENT, for the first time ever on Blu-ray! Starring Academy Award(R) winner Julie Andrews (Best Actress, MARY POPPINS, 1964) and Academy Award-nominated Anne Hathaway (Best Actress, RACHEL GETTING MARRIED, 2008), these two heartwarming and hilarious movies will touch your heart. As the future queen of Genovia, Princess Mia has everything a girl could want -- except the enchanting romance she\\'s always dreamed of. Comic complications rule the day in these delightfully engaging stories about finding out who you really are and discovering what it takes to make your dreams come true! Relive all the magic and excitement of these two beloved favorites on this 3-disc combo pack, which includes a DVD of each film. Share the laughter and the love for the first time on Disney Blu-ray.|Much of THE PRINCESS DIARIES was filmed on Stage 2 at The Walt Disney Studios in Burbank, the same sound stage where Julie Andrews filmed MARY POPPINS 37 years ago.|Director Garry Marshall says he almost didn\\'t accept the job at first -- because of a typo in the script. \"There was a typo on the title page which read The Princess \\'Dairies.\\' I thought it was a movie about privileged cows!\"|Recording artist Mandy Moore makes her film acting debut as Mia\\'s nemesis, Lana, and also sings the tune \"Stupid Cupid.\" The film also marks star Anne Hathaway\\'s big screen debut.|Whitney Houston is one of the film\\'s producers.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Robert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore, Sean O'Bryan, Meg CabotRobert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore,…  See more\", 'Language': 'French (Dolby Digital 5.1), English (DTS-HD High Res Audio), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.16 Ounces', 'Audio Description': 'English', 'Item model number': '109263', 'Director': 'Garry Marshall', 'Media Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'May 15, 2012', 'Actors': 'Julie Andrews, Anne Hathaway, Hector Elizondo, Heather Matarazzo, Mandy Moore', 'Subtitles': 'German, German', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Meg Cabot, Gina Wendkos', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I love these movies.\nReview Title: Love!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Last Holiday (2006)\nReview Date: 2016/12/19\nStore: Various  (Actor, Director)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Last Holiday (2006) (DVD)', \"Enjoy Yourself … It's Later Than You Think! It's advice to follow for sh y New Orleans cookware salesclerk Georgia Byrd (Oscar® nomin ee* Queen L atifah) when her doctor informs her that she has less than a month to li ve. With news like that, it's time to give your life a serious makeover ! So Georgia jets off on a dream vacation to live life like there's no tomorrow. Enjoy hearty laughs and ro llicking comedic misadventures whe n Georgia shakes up a glamorous European resort spa while enthusiastical ly embracing a new look … new moves … and a new attitude! LL Cool J is the handsome suitor back home who's not about to let Georgia slip away. And Timothy H utton, Gerard Depardieu, Alicia Witt and Giancarlo Esposi to also star in this comedy hit that makes the good times last forever.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '26193206', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'May 2, 2006', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: I really enjoy this movie.\nReview Title: Good movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/01/28\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Jonathan Newman'], 'Producers': ['Hale Coughlin', 'Alice Dawson', 'David Mutch', 'Deepak Nayar'], 'Starring': ['Toni Collette', 'Ioan Gruffudd', 'Hayley Mills'], 'Studio': ['Screen Media']}\nReview Text: I enjoyed this movie.  The little boy was so cute and did a good job.\nReview Title: Worth watching\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Disney Animation Collection Volume 6: The Reluctant Dragon\nReview Date: 2017/03/22\nStore: na  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['THE RELUCTANT DRAGON, a clever and entertaining short film, is now part of the Disney Animation Collection! This lighthearted story follows the adventures of a brave young boy who, emboldened by tales of brave knights, decides to pursue the horrible dragon that is terrifying the villagers. But what he discovers is a surprisingly friendly dragon that is more interested in reciting poetry and making music than devouring fair damsels. Will the boy be able to stop the local hero before he challenges the dragon to a fiery battle? Every volume in the Disney Animation Collection series is packed with classic Disney short films that will delight your entire family. Add them all to your DVD library today!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled', 'Language': 'Unqualified, English (Dolby Surround)', 'Runtime': '1 hour and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WD10185900DVD', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled', 'Run time': '1 hour and 2 minutes', 'Release date': 'May 12, 2009', 'Subtitles': 'French, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My nephew was very exciting about receiving this movie because he is an actor and a couple years ago he was in this play for a children's theater.\nReview Title: Nephew loved\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Billy Blanks: Ultimate Tae Bo [DVD]\nReview Date: 2017/04/17\nStore: Billy Blanks  (Actor),     Rebecca Stetson  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['World renowned fitness expert Billy Blanks has developed a NEW Tae Bo® workout with signature Tae Bo moves for maximum benefits and optimum results. This high-powered, high-energy, exhilarating workout will help you attain a toned and sculpted body, strengthen your core, burn fat and increase your overall fitness level to give you a total body workout. Longtime fans of Tae Bo and newcomers alike will experience a workout unlike any other with Billy providing the inspiration and motivation to work hard. Have fun while you challenge yourself!ULTIMATE TAE BO is the workout to do when you want a super intense workout. This workout involves non-stop, high-energy moves that will provide an extreme, heart-pumping fitness challenge. Billy keeps your whole body-feet, arms, legs and shoulders-moving every minute. You ll sweat hard and feel energized as you experience the ultimate Tae Bo workout!']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Rebecca Stetson, Billy Blanks', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.12 Ounces', 'Director': 'Rebecca Stetson', 'Media Format': 'Color, DVD, NTSC', 'Run time': '1 hour and 52 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Billy Blanks', 'Studio': 'Good Times Video', 'Number of discs': '1'}\nReview Text: If you love taebo you will enjoy this workout.  I am glad I bought it.\nReview Title: If you love taebo you will enjoy this DVD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TaeBo II: Get Ripped Advanced Workout [DVD]\nReview Date: 2017/06/07\nStore: Billy Blanks  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['Get Ripped is the most complete set of workouts for total body fitness. It will continue to energize you with fast-paced new moves and new music that drives you to peak performance and give you that \"Get Ripped\" look.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Exercise_&_fitness_-_kickboxing', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Billy Blanks', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.75 inches; 4 Ounces', 'Media Format': 'Color, DVD, NTSC', 'Run time': '3 hours', 'Release date': 'September 25, 2001', 'Actors': 'Billy Blanks', 'Studio': 'Ventura Distribution', 'Number of discs': '1'}\nReview Text: If you love the old school taebo, you will love this.  I would definitely recommend and I am so glad I found this!  I love that they have all different types of people and not just perfect model looking people and I especially love the older people in the video.\nReview Title: I love these workouts!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Billy Blanks: Tae Bo Platinum Collection\nReview Date: 2017/06/07\nStore: Billy Blanks  (Actor),     Not Available  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Billy Blanks is bringing you the ultimate in cardiovascular and strength training with Tae Bo Platinum Collection. This collection mixes the best of the original Tae Bo moves, along with rejuvenated cardio routines and focused abdominal training, creating a full body workout that will get you slimming down and powering up. Put your balance, coordination, and stamina to the test while toning and strengthening through four targeted workouts.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Billy Blanks, Not Available', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '13132624129', 'Director': 'Not Available', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '4 hours and 18 minutes', 'Release date': 'August 26, 2014', 'Actors': 'Billy Blanks', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nReview Text: I love all four workouts.  If you love taebo you will love these workouts too.  I would highly recommend these.  I don't really do the insane abs much.  The other three I do all the time.\nReview Title: Love all four workout!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Billy Blanks: This Is Tae Bo\nReview Date: 2017/07/30\nStore: Billy Blanks  (Actor),     Darren Capik  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['This is the definitive Tae Bo® workout. It brings you the best overall body workout combining cardio, sculpting and ab training for maximum fat burning. You will shed pounds, lose inches and shape your body like never before. Not to mention, you will change the way you think about fitness forever. Known for his amazing ability to motivate, Billy is your coach. He and the crew are with you step by step, as you change your life, one kick and punch at a time. The DVD includes an intense 1 hour workout that will blast away excess weight and lose inches. In addition to the workout is a Tae Bo basics tutorial where Billy will teach you proper form on the basic moves and get you started on your journey to a better, healthier body.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, NTSC, Color', 'Contributor': 'Billy Blanks, Darren Capik', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'MFR013132191492#VG', 'Director': 'Darren Capik', 'Media Format': 'Multiple Formats, NTSC, Color', 'Run time': '1 hour and 5 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Billy Blanks', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nReview Text: I love taebo.  This is one of my favorites.  I love that he keeps you moving.  I would definitely recommend adding this to your taebo collection.\nReview Title: Love this workout!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Transformers: The Last Knight\nReview Date: 2017/11/27\nStore: Mark Wahlberg  (Actor),     Josh Duhamel  (Actor),     Michael Bay  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: [\"Our world's greatest hero becomes our fiercest enemy when Optimus Prime launches a mission to save Cybertron by destroying Earth. Now Bumblebee and Cade Yeager (Mark Wahlberg) must lead the Autobots in the ultimate battle to save mankind.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Michael Bay, Mark Wahlberg, Stanley Tucci, Josh Duhamel', 'Language': 'English', 'Runtime': '2 hours and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'Michael Bay', 'Media Format': 'DVD, NTSC', 'Run time': '2 hours and 34 minutes', 'Release date': 'September 26, 2017', 'Actors': 'Mark Wahlberg, Josh Duhamel, Stanley Tucci', 'Dubbed': 'French, Portuguese, Spanish', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: My husband enjoyed this movie.\nReview Title: Husband approved\nRating: 5.0\n--------------------------------------------------",
  "reference": "Holiday in Handcuffs\nMelissa Joan Hart  (Actor),     Mario Lopez  (Actor),     Ron Underwood  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['A ne er-do-well thirty-something (Melissa Joan Hart) attempts to appease her family by kidnapping herself an attractive boyfriend (Mario Lopez) for the family Christmas. Despite unlikely odds and dysfunctional family moments, the two fall in love and share a magical Christmas.StarringMelissaJoan Hart and Mario Lopez SPECIAL FEATURES: Cast Interviews!  Film Trailers of ABC Family s Original Movies: Snow and Snowglobe Sneak Peek Trailer of ABC Family s 25 Days of Christmas Holiday Event!']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Mario Lopez, Ron Underwood, Melissa Joan Hart', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '18713532770', 'Director': 'Ron Underwood', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 7, 2008', 'Actors': 'Melissa Joan Hart, Mario Lopez', 'Studio': 'ABC Family - Gaiam', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI bought this for my mom's birthday.  She loves this movie.\nGift\nErnest Saves Christmas\nJim Varney  (Actor),     Billie Bird  (Actor),     John Cherry  (Director),     Peter Stein  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n[\"High-flying reindeer! Mischievous elves! Warp-speed sleigh rides! Get set for a magical dose of holiday cheer, zany season's greetings, and spell-binding special effects in this fast-paced, heartwarming comedy hit! When Santa Claus decides to retire and pass on his magic bag of Christmas surprises to a new St. Nick, he enlists the aid of a hilarious assortment of characters, including that lovable know-it-all Ernest P. Worrell (Emmy Award-winning comedian Jim Varney)! Along the way, Santa and Ernest help a cynical teen experience the season's spirit like never before. And that's where the fun -- and magic -- begin! ERNEST SAVES CHRISTMAS ... one delightful, surprising tale you'll never forget!\"]\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Contributor': 'Patty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher MartinPatty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher Martin  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Surround)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936188196', 'Director': 'John Cherry, Peter Stein', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Run time': '1 hour and 31 minutes', 'Release date': 'September 3, 2002', 'Actors': 'Jim Varney, Billie Bird, Bill Byrge, Douglas Seale, Oliver Clark', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'B. Kline, Ed Turner', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI hadn't seen this in years.  It is cute.\nFive Stars\nA Christmas Story (DVD)\nPeter Billingsley  (Actor),     Melinda Dillon  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', 'Christmas Story, A (WBFE) (DVD)', \"It's the final days before Christmas in early 1940s Cleveland, and 9-year-old Ralphie wants one thing from Santa Clause more than anything else: a Red Ryder Carbine Action Air Rifle. As he trudges through the snow to school, faces the neighborhood bully and visits a malevolent department store Santa Clause, Ralphie connives, conspires and campaigns for the most fabulous Christmas present ever in this heartwarming, hysterical and sweetly nostalgic holiday film.\", ']]>', 'Amazon.com', \"Director Bob Clark's charming, touching, and very funny adaptation of humorist Jean Shepherd's nostalgic, autobiographical Yuletide novel,\", 'In God We Trust, All Others Pay Cash', ', remains essential holiday family viewing. Narrated by a man (Shepherd) recalling his childhood, the film looks back at the compulsive efforts of 7-year-old Ralphie (Peter Billingsley) as he tries every means possible to acquire his dream Christmas gift--a Daisy-brand Red Ryder repeating BB carbine with a compass mounted in the stock. Problem is, he lives in a Norman Rockwell-esque Midwestern town in the 1940s, where his parents, teachers, and even Santa Claus all warn Ralphie that \"he\\'ll shoot his eye out.\" Episodic in nature and seen entirely through the eyes of a child, the film offers a wonderful look at the day-to-day eccentricities that grew out of this conservative period. More interestingly, it cleverly captures childhood urgency, where even the most trivial fantasies or objects become immediate life-or-death necessities. While countless family Christmas movies serve up clichéd situations suffocating with preachy sermons, Clark\\'s acute eye for detail and odd mixture of warmth, satire, and quirky humor are the reasons why so many viewers have rediscovered this after it initially bombed in the theaters. Sentimental without being syrupy, it\\'s a true rarity: a holiday movie that adults and children can enjoy equally, for completely different reasons and regardless of the season.', '--Dave McCoy', 'Review', \"In short, A Christmas Story isn't just about Christmas; it's about childhood and it recaptures a time and place with love and wonder. It seems an instant classic, a film that will give pleasure to people not only this Christmas, but for many Christmases to come. --Jay Car, Boston GlobeThe cast is wonderful--especially McGavin, Billingsley and Petrella--the laughs are nonstop if rarely subtle, and the whole thing deserves to become a Christmastime classic. --TV Guide, StaffIt is pitch-perfect, telling the story through the enthusiastic and single-minded vision of its hero Ralphie, and finding in young Peter Billingsley a sly combination of innocence and calculation. --Roger Ebert, Chicago Sun-Times\", 'About the Actor', \"Peter Billingsley has been a member of the Hollywood community since he was a small child. After appearing on numerous television shows and films during his youth, the Emmy Award-nominated actor delivered a performance for the ages in the beloved holiday film, A Christmas Story (1983). Melinda Dillon made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969) and in Steven Spielberg's Close Encounters of the Third Kind (1977). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987).\", 'About the Director', \"Bob Clark is a director known for his '80s movies such as A Christmas Story (1983), Porky's (1982) and Rhinestone (1984).\", 'See more']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.33 Ounces', 'Item model number': '3349475', 'Director': 'Bob Clark', 'Media Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2007', 'Actors': 'Peter Billingsley, Melinda Dillon, Darren McGavin, Ian Petrella, Scott Schwartz', 'Subtitles': 'English, French, Spanish', 'Producers': 'Rene Dupont, Bob Clark', 'Studio': 'Studio Distribution Services', 'Writers': 'Jean Sheppard, Leigh Brown', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of my favorite Christmas movies.\nChristmas classic\n4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)', ']]>']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '8 hours and 38 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '11270413', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nMorgan Freeman is an excellent actor.  All these movies were good.  I don't regret my purchase. Great for when nothing is good on tv.\nGood combo\nThe Princess Diaries: Two-Movie Collection (Three-Disc Combo Blu-ray/DVD Combo in Blu-ray Packaging)\nJulie Andrews  (Actor),     Anne Hathaway  (Actor),     Garry Marshall  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['To commemorate the 10th anniversary (2001 - 2011) of a cherished family classic, Disney proudly presents a special movie collection featuring two modern-day fairy tales, THE PRINCESS DIARIES and THE PRINCESS DIARIES 2: ROYAL ENGAGEMENT, for the first time ever on Blu-ray! Starring Academy Award(R) winner Julie Andrews (Best Actress, MARY POPPINS, 1964) and Academy Award-nominated Anne Hathaway (Best Actress, RACHEL GETTING MARRIED, 2008), these two heartwarming and hilarious movies will touch your heart. As the future queen of Genovia, Princess Mia has everything a girl could want -- except the enchanting romance she\\'s always dreamed of. Comic complications rule the day in these delightfully engaging stories about finding out who you really are and discovering what it takes to make your dreams come true! Relive all the magic and excitement of these two beloved favorites on this 3-disc combo pack, which includes a DVD of each film. Share the laughter and the love for the first time on Disney Blu-ray.|Much of THE PRINCESS DIARIES was filmed on Stage 2 at The Walt Disney Studios in Burbank, the same sound stage where Julie Andrews filmed MARY POPPINS 37 years ago.|Director Garry Marshall says he almost didn\\'t accept the job at first -- because of a typo in the script. \"There was a typo on the title page which read The Princess \\'Dairies.\\' I thought it was a movie about privileged cows!\"|Recording artist Mandy Moore makes her film acting debut as Mia\\'s nemesis, Lana, and also sings the tune \"Stupid Cupid.\" The film also marks star Anne Hathaway\\'s big screen debut.|Whitney Houston is one of the film\\'s producers.']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Robert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore, Sean O'Bryan, Meg CabotRobert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore,…  See more\", 'Language': 'French (Dolby Digital 5.1), English (DTS-HD High Res Audio), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.16 Ounces', 'Audio Description': 'English', 'Item model number': '109263', 'Director': 'Garry Marshall', 'Media Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'May 15, 2012', 'Actors': 'Julie Andrews, Anne Hathaway, Hector Elizondo, Heather Matarazzo, Mandy Moore', 'Subtitles': 'German, German', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Meg Cabot, Gina Wendkos', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI love these movies.\nLove!\nLast Holiday (2006)\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Last Holiday (2006) (DVD)', \"Enjoy Yourself … It's Later Than You Think! It's advice to follow for sh y New Orleans cookware salesclerk Georgia Byrd (Oscar® nomin ee* Queen L atifah) when her doctor informs her that she has less than a month to li ve. With news like that, it's time to give your life a serious makeover ! So Georgia jets off on a dream vacation to live life like there's no tomorrow. Enjoy hearty laughs and ro llicking comedic misadventures whe n Georgia shakes up a glamorous European resort spa while enthusiastical ly embracing a new look … new moves … and a new attitude! LL Cool J is the handsome suitor back home who's not about to let Georgia slip away. And Timothy H utton, Gerard Depardieu, Alicia Witt and Giancarlo Esposi to also star in this comedy hit that makes the good times last forever.\", ']]>']\n{'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '26193206', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'May 2, 2006', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nI really enjoy this movie.\nGood movie\n{'Subtitles': ['None available'], 'Directors': ['Jonathan Newman'], 'Producers': ['Hale Coughlin', 'Alice Dawson', 'David Mutch', 'Deepak Nayar'], 'Starring': ['Toni Collette', 'Ioan Gruffudd', 'Hayley Mills'], 'Studio': ['Screen Media']}\nI enjoyed this movie.  The little boy was so cute and did a good job.\nWorth watching\nDisney Animation Collection Volume 6: The Reluctant Dragon\nna  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['THE RELUCTANT DRAGON, a clever and entertaining short film, is now part of the Disney Animation Collection! This lighthearted story follows the adventures of a brave young boy who, emboldened by tales of brave knights, decides to pursue the horrible dragon that is terrifying the villagers. But what he discovers is a surprisingly friendly dragon that is more interested in reciting poetry and making music than devouring fair damsels. Will the boy be able to stop the local hero before he challenges the dragon to a fiery battle? Every volume in the Disney Animation Collection series is packed with classic Disney short films that will delight your entire family. Add them all to your DVD library today!']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled', 'Language': 'Unqualified, English (Dolby Surround)', 'Runtime': '1 hour and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WD10185900DVD', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled', 'Run time': '1 hour and 2 minutes', 'Release date': 'May 12, 2009', 'Subtitles': 'French, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy nephew was very exciting about receiving this movie because he is an actor and a couple years ago he was in this play for a children's theater.\nNephew loved\nBilly Blanks: Ultimate Tae Bo [DVD]\nBilly Blanks  (Actor),     Rebecca Stetson  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['World renowned fitness expert Billy Blanks has developed a NEW Tae Bo® workout with signature Tae Bo moves for maximum benefits and optimum results. This high-powered, high-energy, exhilarating workout will help you attain a toned and sculpted body, strengthen your core, burn fat and increase your overall fitness level to give you a total body workout. Longtime fans of Tae Bo and newcomers alike will experience a workout unlike any other with Billy providing the inspiration and motivation to work hard. Have fun while you challenge yourself!ULTIMATE TAE BO is the workout to do when you want a super intense workout. This workout involves non-stop, high-energy moves that will provide an extreme, heart-pumping fitness challenge. Billy keeps your whole body-feet, arms, legs and shoulders-moving every minute. You ll sweat hard and feel energized as you experience the ultimate Tae Bo workout!']\n{'Genre': 'Exercise & Fitness', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Rebecca Stetson, Billy Blanks', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.12 Ounces', 'Director': 'Rebecca Stetson', 'Media Format': 'Color, DVD, NTSC', 'Run time': '1 hour and 52 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Billy Blanks', 'Studio': 'Good Times Video', 'Number of discs': '1'}\nIf you love taebo you will enjoy this workout.  I am glad I bought it.\nIf you love taebo you will enjoy this DVD\nTaeBo II: Get Ripped Advanced Workout [DVD]\nBilly Blanks  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['Get Ripped is the most complete set of workouts for total body fitness. It will continue to energize you with fast-paced new moves and new music that drives you to peak performance and give you that \"Get Ripped\" look.']\n{'Genre': 'Exercise_&_fitness_-_kickboxing', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Billy Blanks', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.75 inches; 4 Ounces', 'Media Format': 'Color, DVD, NTSC', 'Run time': '3 hours', 'Release date': 'September 25, 2001', 'Actors': 'Billy Blanks', 'Studio': 'Ventura Distribution', 'Number of discs': '1'}\nIf you love the old school taebo, you will love this.  I would definitely recommend and I am so glad I found this!  I love that they have all different types of people and not just perfect model looking people and I especially love the older people in the video.\nI love these workouts!\nBilly Blanks: Tae Bo Platinum Collection\nBilly Blanks  (Actor),     Not Available  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Billy Blanks is bringing you the ultimate in cardiovascular and strength training with Tae Bo Platinum Collection. This collection mixes the best of the original Tae Bo moves, along with rejuvenated cardio routines and focused abdominal training, creating a full body workout that will get you slimming down and powering up. Put your balance, coordination, and stamina to the test while toning and strengthening through four targeted workouts.']\n{'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Billy Blanks, Not Available', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '13132624129', 'Director': 'Not Available', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '4 hours and 18 minutes', 'Release date': 'August 26, 2014', 'Actors': 'Billy Blanks', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nI love all four workouts.  If you love taebo you will love these workouts too.  I would highly recommend these.  I don't really do the insane abs much.  The other three I do all the time.\nLove all four workout!\nBilly Blanks: This Is Tae Bo\nBilly Blanks  (Actor),     Darren Capik  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['This is the definitive Tae Bo® workout. It brings you the best overall body workout combining cardio, sculpting and ab training for maximum fat burning. You will shed pounds, lose inches and shape your body like never before. Not to mention, you will change the way you think about fitness forever. Known for his amazing ability to motivate, Billy is your coach. He and the crew are with you step by step, as you change your life, one kick and punch at a time. The DVD includes an intense 1 hour workout that will blast away excess weight and lose inches. In addition to the workout is a Tae Bo basics tutorial where Billy will teach you proper form on the basic moves and get you started on your journey to a better, healthier body.']\n{'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, NTSC, Color', 'Contributor': 'Billy Blanks, Darren Capik', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'MFR013132191492#VG', 'Director': 'Darren Capik', 'Media Format': 'Multiple Formats, NTSC, Color', 'Run time': '1 hour and 5 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Billy Blanks', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nI love taebo.  This is one of my favorites.  I love that he keeps you moving.  I would definitely recommend adding this to your taebo collection.\nLove this workout!\nTransformers: The Last Knight\nMark Wahlberg  (Actor),     Josh Duhamel  (Actor),     Michael Bay  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"Our world's greatest hero becomes our fiercest enemy when Optimus Prime launches a mission to save Cybertron by destroying Earth. Now Bumblebee and Cade Yeager (Mark Wahlberg) must lead the Autobots in the ultimate battle to save mankind.\"]\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Michael Bay, Mark Wahlberg, Stanley Tucci, Josh Duhamel', 'Language': 'English', 'Runtime': '2 hours and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'Michael Bay', 'Media Format': 'DVD, NTSC', 'Run time': '2 hours and 34 minutes', 'Release date': 'September 26, 2017', 'Actors': 'Mark Wahlberg, Josh Duhamel, Stanley Tucci', 'Dubbed': 'French, Portuguese, Spanish', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '3'}\nMy husband enjoyed this movie.\nHusband approved",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Holiday in Handcuffs\nReview Date: 2016/12/13\nStore: Melissa Joan Hart  (Actor),     Mario Lopez  (Actor),     Ron Underwood  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['A ne er-do-well thirty-something (Melissa Joan Hart) attempts to appease her family by kidnapping herself an attractive boyfriend (Mario Lopez) for the family Christmas. Despite unlikely odds and dysfunctional family moments, the two fall in love and share a magical Christmas.StarringMelissaJoan Hart and Mario Lopez SPECIAL FEATURES: Cast Interviews!  Film Trailers of ABC Family s Original Movies: Snow and Snowglobe Sneak Peek Trailer of ABC Family s 25 Days of Christmas Holiday Event!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Mario Lopez, Ron Underwood, Melissa Joan Hart', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '18713532770', 'Director': 'Ron Underwood', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 7, 2008', 'Actors': 'Melissa Joan Hart, Mario Lopez', 'Studio': 'ABC Family - Gaiam', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I bought this for my mom's birthday.  She loves this movie.\nReview Title: Gift\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ernest Saves Christmas\nReview Date: 2016/12/16\nStore: Jim Varney  (Actor),     Billie Bird  (Actor),     John Cherry  (Director),     Peter Stein  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: [\"High-flying reindeer! Mischievous elves! Warp-speed sleigh rides! Get set for a magical dose of holiday cheer, zany season's greetings, and spell-binding special effects in this fast-paced, heartwarming comedy hit! When Santa Claus decides to retire and pass on his magic bag of Christmas surprises to a new St. Nick, he enlists the aid of a hilarious assortment of characters, including that lovable know-it-all Ernest P. Worrell (Emmy Award-winning comedian Jim Varney)! Along the way, Santa and Ernest help a cynical teen experience the season's spirit like never before. And that's where the fun -- and magic -- begin! ERNEST SAVES CHRISTMAS ... one delightful, surprising tale you'll never forget!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Contributor': 'Patty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher MartinPatty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher Martin  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Surround)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936188196', 'Director': 'John Cherry, Peter Stein', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Run time': '1 hour and 31 minutes', 'Release date': 'September 3, 2002', 'Actors': 'Jim Varney, Billie Bird, Bill Byrge, Douglas Seale, Oliver Clark', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'B. Kline, Ed Turner', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I hadn't seen this in years.  It is cute.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Story (DVD)\nReview Date: 2016/12/19\nStore: Peter Billingsley  (Actor),     Melinda Dillon  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Product Description', 'Christmas Story, A (WBFE) (DVD)', \"It's the final days before Christmas in early 1940s Cleveland, and 9-year-old Ralphie wants one thing from Santa Clause more than anything else: a Red Ryder Carbine Action Air Rifle. As he trudges through the snow to school, faces the neighborhood bully and visits a malevolent department store Santa Clause, Ralphie connives, conspires and campaigns for the most fabulous Christmas present ever in this heartwarming, hysterical and sweetly nostalgic holiday film.\", ']]>', 'Amazon.com', \"Director Bob Clark's charming, touching, and very funny adaptation of humorist Jean Shepherd's nostalgic, autobiographical Yuletide novel,\", 'In God We Trust, All Others Pay Cash', ', remains essential holiday family viewing. Narrated by a man (Shepherd) recalling his childhood, the film looks back at the compulsive efforts of 7-year-old Ralphie (Peter Billingsley) as he tries every means possible to acquire his dream Christmas gift--a Daisy-brand Red Ryder repeating BB carbine with a compass mounted in the stock. Problem is, he lives in a Norman Rockwell-esque Midwestern town in the 1940s, where his parents, teachers, and even Santa Claus all warn Ralphie that \"he\\'ll shoot his eye out.\" Episodic in nature and seen entirely through the eyes of a child, the film offers a wonderful look at the day-to-day eccentricities that grew out of this conservative period. More interestingly, it cleverly captures childhood urgency, where even the most trivial fantasies or objects become immediate life-or-death necessities. While countless family Christmas movies serve up clichéd situations suffocating with preachy sermons, Clark\\'s acute eye for detail and odd mixture of warmth, satire, and quirky humor are the reasons why so many viewers have rediscovered this after it initially bombed in the theaters. Sentimental without being syrupy, it\\'s a true rarity: a holiday movie that adults and children can enjoy equally, for completely different reasons and regardless of the season.', '--Dave McCoy', 'Review', \"In short, A Christmas Story isn't just about Christmas; it's about childhood and it recaptures a time and place with love and wonder. It seems an instant classic, a film that will give pleasure to people not only this Christmas, but for many Christmases to come. --Jay Car, Boston GlobeThe cast is wonderful--especially McGavin, Billingsley and Petrella--the laughs are nonstop if rarely subtle, and the whole thing deserves to become a Christmastime classic. --TV Guide, StaffIt is pitch-perfect, telling the story through the enthusiastic and single-minded vision of its hero Ralphie, and finding in young Peter Billingsley a sly combination of innocence and calculation. --Roger Ebert, Chicago Sun-Times\", 'About the Actor', \"Peter Billingsley has been a member of the Hollywood community since he was a small child. After appearing on numerous television shows and films during his youth, the Emmy Award-nominated actor delivered a performance for the ages in the beloved holiday film, A Christmas Story (1983). Melinda Dillon made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969) and in Steven Spielberg's Close Encounters of the Third Kind (1977). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987).\", 'About the Director', \"Bob Clark is a director known for his '80s movies such as A Christmas Story (1983), Porky's (1982) and Rhinestone (1984).\", 'See more']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.33 Ounces', 'Item model number': '3349475', 'Director': 'Bob Clark', 'Media Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2007', 'Actors': 'Peter Billingsley, Melinda Dillon, Darren McGavin, Ian Petrella, Scott Schwartz', 'Subtitles': 'English, French, Spanish', 'Producers': 'Rene Dupont, Bob Clark', 'Studio': 'Studio Distribution Services', 'Writers': 'Jean Sheppard, Leigh Brown', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is one of my favorite Christmas movies.\nReview Title: Christmas classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)\nReview Date: 2016/12/19\nStore: Various  (Actor, Director)    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '8 hours and 38 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '11270413', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: Morgan Freeman is an excellent actor.  All these movies were good.  I don't regret my purchase. Great for when nothing is good on tv.\nReview Title: Good combo\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Princess Diaries: Two-Movie Collection (Three-Disc Combo Blu-ray/DVD Combo in Blu-ray Packaging)\nReview Date: 2016/12/19\nStore: Julie Andrews  (Actor),     Anne Hathaway  (Actor),     Garry Marshall  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['To commemorate the 10th anniversary (2001 - 2011) of a cherished family classic, Disney proudly presents a special movie collection featuring two modern-day fairy tales, THE PRINCESS DIARIES and THE PRINCESS DIARIES 2: ROYAL ENGAGEMENT, for the first time ever on Blu-ray! Starring Academy Award(R) winner Julie Andrews (Best Actress, MARY POPPINS, 1964) and Academy Award-nominated Anne Hathaway (Best Actress, RACHEL GETTING MARRIED, 2008), these two heartwarming and hilarious movies will touch your heart. As the future queen of Genovia, Princess Mia has everything a girl could want -- except the enchanting romance she\\'s always dreamed of. Comic complications rule the day in these delightfully engaging stories about finding out who you really are and discovering what it takes to make your dreams come true! Relive all the magic and excitement of these two beloved favorites on this 3-disc combo pack, which includes a DVD of each film. Share the laughter and the love for the first time on Disney Blu-ray.|Much of THE PRINCESS DIARIES was filmed on Stage 2 at The Walt Disney Studios in Burbank, the same sound stage where Julie Andrews filmed MARY POPPINS 37 years ago.|Director Garry Marshall says he almost didn\\'t accept the job at first -- because of a typo in the script. \"There was a typo on the title page which read The Princess \\'Dairies.\\' I thought it was a movie about privileged cows!\"|Recording artist Mandy Moore makes her film acting debut as Mia\\'s nemesis, Lana, and also sings the tune \"Stupid Cupid.\" The film also marks star Anne Hathaway\\'s big screen debut.|Whitney Houston is one of the film\\'s producers.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Robert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore, Sean O'Bryan, Meg CabotRobert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore,…  See more\", 'Language': 'French (Dolby Digital 5.1), English (DTS-HD High Res Audio), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.16 Ounces', 'Audio Description': 'English', 'Item model number': '109263', 'Director': 'Garry Marshall', 'Media Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'May 15, 2012', 'Actors': 'Julie Andrews, Anne Hathaway, Hector Elizondo, Heather Matarazzo, Mandy Moore', 'Subtitles': 'German, German', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Meg Cabot, Gina Wendkos', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I love these movies.\nReview Title: Love!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Last Holiday (2006)\nReview Date: 2016/12/19\nStore: Various  (Actor, Director)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Last Holiday (2006) (DVD)', \"Enjoy Yourself … It's Later Than You Think! It's advice to follow for sh y New Orleans cookware salesclerk Georgia Byrd (Oscar® nomin ee* Queen L atifah) when her doctor informs her that she has less than a month to li ve. With news like that, it's time to give your life a serious makeover ! So Georgia jets off on a dream vacation to live life like there's no tomorrow. Enjoy hearty laughs and ro llicking comedic misadventures whe n Georgia shakes up a glamorous European resort spa while enthusiastical ly embracing a new look … new moves … and a new attitude! LL Cool J is the handsome suitor back home who's not about to let Georgia slip away. And Timothy H utton, Gerard Depardieu, Alicia Witt and Giancarlo Esposi to also star in this comedy hit that makes the good times last forever.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '26193206', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'May 2, 2006', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: I really enjoy this movie.\nReview Title: Good movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/01/28\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Jonathan Newman'], 'Producers': ['Hale Coughlin', 'Alice Dawson', 'David Mutch', 'Deepak Nayar'], 'Starring': ['Toni Collette', 'Ioan Gruffudd', 'Hayley Mills'], 'Studio': ['Screen Media']}\nReview Text: I enjoyed this movie.  The little boy was so cute and did a good job.\nReview Title: Worth watching\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Disney Animation Collection Volume 6: The Reluctant Dragon\nReview Date: 2017/03/22\nStore: na  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['THE RELUCTANT DRAGON, a clever and entertaining short film, is now part of the Disney Animation Collection! This lighthearted story follows the adventures of a brave young boy who, emboldened by tales of brave knights, decides to pursue the horrible dragon that is terrifying the villagers. But what he discovers is a surprisingly friendly dragon that is more interested in reciting poetry and making music than devouring fair damsels. Will the boy be able to stop the local hero before he challenges the dragon to a fiery battle? Every volume in the Disney Animation Collection series is packed with classic Disney short films that will delight your entire family. Add them all to your DVD library today!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled', 'Language': 'Unqualified, English (Dolby Surround)', 'Runtime': '1 hour and 2 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WD10185900DVD', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled', 'Run time': '1 hour and 2 minutes', 'Release date': 'May 12, 2009', 'Subtitles': 'French, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My nephew was very exciting about receiving this movie because he is an actor and a couple years ago he was in this play for a children's theater.\nReview Title: Nephew loved\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Billy Blanks: Ultimate Tae Bo [DVD]\nReview Date: 2017/04/17\nStore: Billy Blanks  (Actor),     Rebecca Stetson  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['World renowned fitness expert Billy Blanks has developed a NEW Tae Bo® workout with signature Tae Bo moves for maximum benefits and optimum results. This high-powered, high-energy, exhilarating workout will help you attain a toned and sculpted body, strengthen your core, burn fat and increase your overall fitness level to give you a total body workout. Longtime fans of Tae Bo and newcomers alike will experience a workout unlike any other with Billy providing the inspiration and motivation to work hard. Have fun while you challenge yourself!ULTIMATE TAE BO is the workout to do when you want a super intense workout. This workout involves non-stop, high-energy moves that will provide an extreme, heart-pumping fitness challenge. Billy keeps your whole body-feet, arms, legs and shoulders-moving every minute. You ll sweat hard and feel energized as you experience the ultimate Tae Bo workout!']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Rebecca Stetson, Billy Blanks', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.12 Ounces', 'Director': 'Rebecca Stetson', 'Media Format': 'Color, DVD, NTSC', 'Run time': '1 hour and 52 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Billy Blanks', 'Studio': 'Good Times Video', 'Number of discs': '1'}\nReview Text: If you love taebo you will enjoy this workout.  I am glad I bought it.\nReview Title: If you love taebo you will enjoy this DVD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TaeBo II: Get Ripped Advanced Workout [DVD]\nReview Date: 2017/06/07\nStore: Billy Blanks  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['Get Ripped is the most complete set of workouts for total body fitness. It will continue to energize you with fast-paced new moves and new music that drives you to peak performance and give you that \"Get Ripped\" look.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Exercise_&_fitness_-_kickboxing', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Billy Blanks', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.75 inches; 4 Ounces', 'Media Format': 'Color, DVD, NTSC', 'Run time': '3 hours', 'Release date': 'September 25, 2001', 'Actors': 'Billy Blanks', 'Studio': 'Ventura Distribution', 'Number of discs': '1'}\nReview Text: If you love the old school taebo, you will love this.  I would definitely recommend and I am so glad I found this!  I love that they have all different types of people and not just perfect model looking people and I especially love the older people in the video.\nReview Title: I love these workouts!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Billy Blanks: Tae Bo Platinum Collection\nReview Date: 2017/06/07\nStore: Billy Blanks  (Actor),     Not Available  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Billy Blanks is bringing you the ultimate in cardiovascular and strength training with Tae Bo Platinum Collection. This collection mixes the best of the original Tae Bo moves, along with rejuvenated cardio routines and focused abdominal training, creating a full body workout that will get you slimming down and powering up. Put your balance, coordination, and stamina to the test while toning and strengthening through four targeted workouts.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Billy Blanks, Not Available', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '13132624129', 'Director': 'Not Available', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '4 hours and 18 minutes', 'Release date': 'August 26, 2014', 'Actors': 'Billy Blanks', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nReview Text: I love all four workouts.  If you love taebo you will love these workouts too.  I would highly recommend these.  I don't really do the insane abs much.  The other three I do all the time.\nReview Title: Love all four workout!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Billy Blanks: This Is Tae Bo\nReview Date: 2017/07/30\nStore: Billy Blanks  (Actor),     Darren Capik  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['This is the definitive Tae Bo® workout. It brings you the best overall body workout combining cardio, sculpting and ab training for maximum fat burning. You will shed pounds, lose inches and shape your body like never before. Not to mention, you will change the way you think about fitness forever. Known for his amazing ability to motivate, Billy is your coach. He and the crew are with you step by step, as you change your life, one kick and punch at a time. The DVD includes an intense 1 hour workout that will blast away excess weight and lose inches. In addition to the workout is a Tae Bo basics tutorial where Billy will teach you proper form on the basic moves and get you started on your journey to a better, healthier body.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, NTSC, Color', 'Contributor': 'Billy Blanks, Darren Capik', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'MFR013132191492#VG', 'Director': 'Darren Capik', 'Media Format': 'Multiple Formats, NTSC, Color', 'Run time': '1 hour and 5 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Billy Blanks', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nReview Text: I love taebo.  This is one of my favorites.  I love that he keeps you moving.  I would definitely recommend adding this to your taebo collection.\nReview Title: Love this workout!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Transformers: The Last Knight\nReview Date: 2017/11/27\nStore: Mark Wahlberg  (Actor),     Josh Duhamel  (Actor),     Michael Bay  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: [\"Our world's greatest hero becomes our fiercest enemy when Optimus Prime launches a mission to save Cybertron by destroying Earth. Now Bumblebee and Cade Yeager (Mark Wahlberg) must lead the Autobots in the ultimate battle to save mankind.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Michael Bay, Mark Wahlberg, Stanley Tucci, Josh Duhamel', 'Language': 'English', 'Runtime': '2 hours and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'Michael Bay', 'Media Format': 'DVD, NTSC', 'Run time': '2 hours and 34 minutes', 'Release date': 'September 26, 2017', 'Actors': 'Mark Wahlberg, Josh Duhamel, Stanley Tucci', 'Dubbed': 'French, Portuguese, Spanish', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: My husband enjoyed this movie.\nReview Title: Husband approved\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe purchase history reveals a strong preference for family-oriented and holiday-themed entertainment, particularly Christmas movies, which consistently receive high ratings. Positive sentiments are expressed towards films that blend humor, nostalgia, and heartwarming themes, indicating a desire for feel-good content suitable for family viewing. The buyer also appreciates the works of specific actors, like Melissa Joan Hart and Morgan Freeman, suggesting a loyalty to familiar talent. \n\nIn terms of quality, the buyer prioritizes ratings of 4.5 and above, indicating a preference for well-reviewed products. Price sensitivity is not explicit, but consistent purchases of DVDs with a focus on value and enjoyment suggest a willingness to invest in quality entertainment. Lastly, fitness-related purchases show a commitment to maintaining physical health, specifically through engaging and dynamic workout programs, indicating a balanced lifestyle focus that values both leisure and fitness. Overall, the core preferences point towards a person who enjoys quality family films, nostalgic holiday content, and energetic fitness routines.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Christmas classic",
    "text": "I love this movie.  I watch it every Christmas.",
    "images": [],
    "asin": "B003U0AHG4",
    "parent_asin": "B003U0AHG4",
    "user_id": "AETRYWNQ7I7MEALQ2BBJXZ5MRDGA",
    "timestamp": "2018-02-01 20:52:43.801000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Twas the Night Before Christmas: Deluxe Edition",
    "average_rating": 4.9,
    "rating_number": 2183,
    "features": [],
    "description": [
      "Twas the Night Before Christmas: Deluxe Edition",
      "For some unexplained reason, letters to Santa Claus are being returned to the children of Junctionville. It seems some sour soul has angered St. Nick, calling Christmas \"a fraudulent myth!\" The skeptical rodent Albert Mouse has to be brought to his senses \"and let up a little on the wonder why.\" How Albert is persuaded to change his tune paves the way for Santa's jolly return to Junctionville -- and the joyous finale of this charming animated fable inspired by Clement Moore's poem. Joel Grey, Tammy Grimes, John McGiver and George Gobel are featured voices. Approx. 23 minutes. Year: 1974",
      "]]>"
    ],
    "price": 11.15,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51y7WHCSD0L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51y7WHCSD0L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91sBzXfbETL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61uXWB21GsL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61uXWB21GsL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/91oSZukB4NL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "The Night Before Christmas",
        "url": "https://www.amazon.com/vdp/a6fd1591e37f4bf3b4ed1500e43ff506?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Joel Grey  (Actor),     Tammy Grimes  (Actor),     Arthur Rankin, Jr.  (Director, Producer)    &                   0                  more   Rated:    G    Format: DVD",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "DVD",
      "Kids & Family"
    ],
    "details": {
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "G (General Audience)",
      "Product Dimensions": "7.5 x 5.5 x 0.5 inches; 0.01 Ounces",
      "Item model number": "883929101207",
      "Director": "Arthur Rankin, Jr., Jules Bass",
      "Media Format": "Multiple Formats, NTSC, Original recording remastered, Color, Animated",
      "Run time": "25 minutes",
      "Release date": "October 5, 2010",
      "Actors": "Joel Grey, Tammy Grimes, Richard O. Fleischer, George Gobel, Allen Swift",
      "Producers": "Arthur Rankin, Jr., Jules Bass",
      "Language": "Unqualified",
      "Studio": "Studio Distribution Services",
      "Writers": "Jerome Coopersmith, Clement Moore, Maury Laws, Jules Bass",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}