{
  "user_id": "AE4YPEAUCXQTFH3H5OE7CWZH76TA",
  "summary": "=== Purchase Information ===\nProduct Title: The Love Letter\nReview Date: 2001/08/14\nStore: Kate Capshaw  (Actor),     Tom Everett Scott  (Actor),     Peter Chan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['An unsigned and unaddressed love letter creates romantic turmoil in a small seaside town']\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Comedy', 'Format': 'Closed-captioned, AC-3, Anamorphic, Color, Dolby, Widescreen, NTSC, Multiple Formats', 'Contributor': 'Tom Everett Scott, Ellen DeGeneres, Alice Drummond, Erik Jensen, Kate Capshaw, Tom Selleck, Gloria Stuart, Maria Maggenti, Jessica Capshaw, Bill Buell, Julianne Nicholson, Blythe Danner, Cathleen Schine, Margaret Ann Brady, Peter ChanTom Everett Scott, Ellen DeGeneres, Alice Drummond, Erik Jensen, Kate Capshaw, Tom Selleck, Gloria Stuart, Maria Maggenti, Jessica Capshaw, Bill Buell, Julianne Nicholson, Blythe Danner, Cathleen Schine, Margaret Ann Brady, Peter Chan  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 5.1)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': '85302', 'Director': 'Peter Chan', 'Media Format': 'Closed-captioned, AC-3, Anamorphic, Color, Dolby, Widescreen, NTSC, Multiple Formats', 'Run time': '1 hour and 28 minutes', 'Release date': 'November 23, 1999', 'Actors': 'Kate Capshaw, Tom Everett Scott, Tom Selleck, Blythe Danner, Ellen DeGeneres', 'Subtitles': 'English', 'Studio': 'Dreamworks Video', 'Writers': 'Cathleen Schine, Maria Maggenti', 'Number of discs': '1'}\nReview Text: When this movie was over, I couldn't believe I'd wasted two hours of my life on it. It might have been almost watchable if it had starred, say, Meg Ryan, whose sometimes irritating cuteness might have lightened up the heroine's basically dour and unpleasant personality. Instead we're sentenced to two hours of the dreadful Kate Capshaw. It's not necessarily that she's a bad actress; she just seems like an awful person. Ellen DeGeneres isn't much more fun to watch. And the solution to the mystery of the love letter is not merely ridiculous; it's insultingly stupid.<br />Tom Selleck, as always, lights up the screen (too bad he's only on it for about 15 minutes), and the other supporting players are fine as well. And the scenes of New England are pretty. Maybe an enterprising fan will find a way to digitally insert them into a better movie.\nReview Title: Blech!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Serendipity\nReview Date: 2002/07/15\nStore: John Cusack  (Actor),     Kate Beckinsale  (Actor),     Peter Chelsom  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Miramax Home Entertainment, All Titles\nProduct Description: [\"Irresistible stars John Cusack (AMERICA'S SWEETHEARTS, HIGH FIDELITY) and Kate Beckinsale (PEARL HARBOR, BROKEDOWN PALACE) are drawn together and take a chance on love in this critically acclaimed romantic comedy! In the course of one magical evening, Jonathan (Cusack) and Sara (Beckinsale) meet unexpectedly ... then part without expectation when she decides they must let fate determine if they are meant to be together. Years later, they are both engaged to others but cannot give up the dream that -- despite time, distance, and the obstacles that conspire to keep them apart -- they will one day meet again. Also starring Jeremy Piven (THE FAMILY MAN, VERY BAD THINGS) and Molly Shannon (SUPERSTAR, NEVER BEEN KISSED) in a stellar supporting cast -- you're destined to agree with audiences everywhere who fell for the surprising charms of this delightful big-screen romance!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Destiny... with a sense of humor', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Crystal Bock, Bridget Moynahan, Ann Talman, Peter Chelsom, Marc Klein, Jeremy Piven, Michael Guarino Jr., Gary Gerbrandt, Lilli Lavine, Stephen Bruce, David Sparrow, John Cusack, Abdul Alshawish, Kate BeckinsaleCrystal Bock, Bridget Moynahan, Ann Talman, Peter Chelsom, Marc Klein, Jeremy Piven, Michael Guarino Jr., Gary Gerbrandt, Lilli Lavine, Stephen Bruce, David Sparrow, John Cusack, Abdul Alshawish, Kate Beckinsale  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': 'MFR786936166583#VG', 'Director': 'Peter Chelsom', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 9, 2002', 'Actors': 'John Cusack, Kate Beckinsale, Lilli Lavine, Michael Guarino Jr., Abdul Alshawish', 'Studio': 'Miramax Home Entertainment', 'Writers': 'Marc Klein', 'Number of discs': '1'}\nReview Text: John Cusack is one of my all-time favorite actors, and clearly a smart person, too--I can't think of another bad film he's done. And Kate Beckinsale is reliably interesting, as well as beautiful. So I can't figure out how they wound up in this half-hearted loser of a movie. In addition to numerous irritating implausibilities (starting with Cusack not knowing the definition of \"serendipity\"), the main characters have no, well, characteristics, beyond their obsession with each other. Cusack ultimately treats the woman in his life horribly, but we're supposed to forgive him because he does it all for true love. Yuck. It's a shame, because this promised to be the kind of fluffy New York love story we all needed this past year. It seems as if either the movie got edited to death after production, or the writer just didn't care enough to make the story interesting in the first place--I can't tell which.<br />In any case, \"Serendipity\" turns out to be a sad waste of time and talent. If you're a Cusack fan, get \"Say Anything,\"  \"High Fidelity,\" \"The Grifters,\" or even \"Grosse Pointe Blank.\" If Beckinsale's the one you want to watch, try \"Haunted,\" \"Cold Comfort Farm,\" \"Last Days of Disco,\" or even \"Brokedown Palace.\"\nReview Title: A depressing waste of some fine actors.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kate & Leopold\nReview Date: 2002/07/15\nStore: Meg Ryan  (Actor),     Hugh Jackman  (Actor),     James Mangold  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Miramax Home Entertainment, All Titles\nProduct Description: [\"Meg Ryan (YOU'VE GOT MAIL) and Hugh Jackman (X-MEN) are paired as star-crossed lovers who discover that passion and chivalry never go out of style! When a rip in time brings together a charming 19th century bachelor and a thoroughly 21st century woman, the potential for an old-fashioned modern romance ignites! Also starring Breckin Meyer (ROAD TRIP) and Liev Schreiber (SCREAM 3).\"]\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'Josh Stamberg, Philip Bosco, Liev Schreiber, Natasha Lyonne, Matthew Sussman, Bradley Whitford, James Mangold, Steven Rogers, Paxton Whitehead, Meg Ryan, Charlotte Ayanna, Hugh Jackman, Spalding Gray, Breckin MeyerJosh Stamberg, Philip Bosco, Liev Schreiber, Natasha Lyonne, Matthew Sussman, Bradley Whitford, James Mangold, Steven Rogers, Paxton Whitehead, Meg Ryan, Charlotte Ayanna, Hugh Jackman, Spalding Gray, Breckin Meyer   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Director': 'James Mangold', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'June 11, 2002', 'Actors': 'Meg Ryan, Hugh Jackman, Liev Schreiber, Breckin Meyer, Natasha Lyonne', 'Studio': 'Miramax', 'Writers': 'James Mangold, Steven Rogers', 'Number of discs': '1'}\nReview Text: This movie had its moments, most of them provided by the yummy Hugh Jackman. And Liev Schreiber is very funny.  But it suffers from a bad case of Meg Ryan wrinkling up her adorable little nose and sighing at her hellish, though expensive, life.<br />It's also one of these new movies that specializes in insulting the intelligence of its audience. An example: the \"villain\" (a confused character played by Bradley Whitford--he's supposed to be bad, but I'm pretty sure he's not supposed to be an idiot) gets caught lying about an opera he hasn't really seen. Here's the thing: Many, many people in New York City (not just incredibly rich ones) love opera. If you don't know the plot of an opera, there's no point in lying about it, because the chances of getting caught are very high. But, apparently, the people who made this movie believe that the potential audience of this movie thinks that opera is only ever watched by upper-class snobs. And of course, in the end, true love conquers all, which in this case means the woman gives up everything she's worked for all her life, not to mention all her family and friends, to be with her man.<br />I can't say I didn't enjoy watching this movie. But the more I thought about it afterwards, the more insulted I felt by it.\nReview Title: Could have been so much better! (warning---spoilers)\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Route 666\nReview Date: 2008/10/27\nStore: Lou Diamond Phillips  (Actor),     Lori Petty  (Actor),     William Wesley  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: ['When two Special Agencts cut through a condemned, desolated highway known as Route 666 while tracking a suspect, they discover a danger far worse than deadly twists and turns. Years ago, a notorious chain gang was killed in a horrific roadside murder, and the highway still echoes with its brutal legacy.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': \"Lou Diamond Phillips, William Wesley, Lori Petty, Lion's Gate Films\", 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT71292DVD', 'Director': 'William Wesley', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 19, 2004', 'Actors': 'Lou Diamond Phillips, Lori Petty', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The plot is dumb and the zombies and the bad guys are all equally ridiculous. Still, I found this movie strangely watchable. Lou Diamond Phillips, Lori Petty, and Steven Williams make a great trio, and the evil sheriff is satisfyingly EEEEVIL. But what I think makes this movie work is the spooky/beautiful desert setting, which gives it a bit more of a sense of spirituality than it really deserves. Plus, there's an encounter with a wacky shaman who serves magic tea. Silly, but fun.\nReview Title: Bad, but fun bad.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tamara Drewe\nReview Date: 2011/03/13\nStore: Gemma Arterton  (Actor),     Dominic Cooper  (Actor),     Stephen Frears  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'When journalist Tamara Drewe returns to her parents’ house with a new assignment – and a new nose – she sets the surrounding countryside’s male hearts aflame, breaking the picturesque tranquility and transforming the village of her youth into a swirling maelstrom of temptation, seduction, and tawdry gossip. But when a bit of silly mischief puts lives and loves at risk, Tamara Drewe must choose between getting it all and getting the one. In this fun, witty romance, director Stephen Frears (', 'The Queen', ',', 'Dangerous Liaisons', ') perfectly captures the spirit of the beloved graphic novel.', 'Amazon.com', \"Is there anything more idyllic than the English countryside? Perhaps not, but even the most bucolic of settings holds its dark secrets, according to Stephen Frears's lovely, offbeat\", 'Tamara Drewe', '.', 'Tamara Drewe', \"is based on the graphic novel by Posy Simmonds, a British cartoonist who based her work on Thomas Hardy's\", 'Far from the Madding Crowd', '. There are homages, subtle and not, throughout to Hardy and his work, but even non-Hardy aficionados will enjoy', 'Tamara Drewe', \"and its dark, microscopic view of the gentry. The title character is played by the winsome Gemma Arterton, who as a young lass in the lovely burg of Ewedown was a bit of an ugly duckling, with a nose to give Cyrano a run for his money. But thanks to modern comforts like plastic surgery, Tamara's blossomed into a beauty and successful writer. When she returns to Ewedown, she manages to turn the entire tiny town on its ear. The cast is first rate, including Roger Allam as Nicholas, a bestselling novelist and randy old goat who cheats on his long-suffering wife, Beth (Tamsin Greig), who runs the writers' retreat that centers on Nicholas and his giant ego. Tamara attracts the attention of her childhood pal Andy (Luke Evans) and an annoying rock drummer, Ben (Dominic Cooper), as well as the distasteful Nicholas. With fawning writers descending on Ewedown, and two cheeky, bored teenagers, Jody and Casey (Jessica Barden and Charlotte Christie), acting as the story's Greek chorus, there are plenty of characters to keep things moving in\", 'Tamara Drewe', \". And it's to Frears's and the actors' credit that if none of the characters is particularly likable (except for Greig's Beth), the action is enough to keep the viewer engaged. There are laughs, cringes, and some true poignancy--and a climactic event that will touch everyone.\", 'Tamara Drewe', 'will satisfy fans of Hardy, Frears, dark indie comedies--and those who want to stay far, far from the madding crowd. --', 'A.T. Hurley']\nAverage Rating: 4.0\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '36910', 'Director': 'Stephen Frears', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Gemma Arterton, Dominic Cooper', 'Subtitles': 'Spanish', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\nReview Text: \"Tamara Drewe\" is deadly clever comedy of manners with a wickedly British sense of black humor. Post-plastic-surgery, the gorgeous Tamara Drewe comes home to her boring rural village -- ostensibly to fix up and sell her deceased mother's house, but also to show up everyone who was cruel to her when she was a bright, angry teenager with an outsize nose. One of those people was her writer neighbor, a serial adulterer who reigns over the fawning guests at the farm/writer's colony actually run by his devoted and ultra-capable wife. Throw in the hot local handyman, a couple of dangerously bored teenaged girls, the drummer from a punk band, and a mannerless dog. All kinds of trouble ensue. Don't expect any noble characters or heroic actions from this movie; watch it to enjoy the spectacle of people behaving mostly -- but not totally -- badly, and doing it in a generally clever and funny way.\nReview Title: Utterly charming and totally British\nRating: 4.0\n--------------------------------------------------",
  "reference": "The Love Letter\nKate Capshaw  (Actor),     Tom Everett Scott  (Actor),     Peter Chan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['An unsigned and unaddressed love letter creates romantic turmoil in a small seaside town']\n{'Genre': 'Comedy', 'Format': 'Closed-captioned, AC-3, Anamorphic, Color, Dolby, Widescreen, NTSC, Multiple Formats', 'Contributor': 'Tom Everett Scott, Ellen DeGeneres, Alice Drummond, Erik Jensen, Kate Capshaw, Tom Selleck, Gloria Stuart, Maria Maggenti, Jessica Capshaw, Bill Buell, Julianne Nicholson, Blythe Danner, Cathleen Schine, Margaret Ann Brady, Peter ChanTom Everett Scott, Ellen DeGeneres, Alice Drummond, Erik Jensen, Kate Capshaw, Tom Selleck, Gloria Stuart, Maria Maggenti, Jessica Capshaw, Bill Buell, Julianne Nicholson, Blythe Danner, Cathleen Schine, Margaret Ann Brady, Peter Chan  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 5.1)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': '85302', 'Director': 'Peter Chan', 'Media Format': 'Closed-captioned, AC-3, Anamorphic, Color, Dolby, Widescreen, NTSC, Multiple Formats', 'Run time': '1 hour and 28 minutes', 'Release date': 'November 23, 1999', 'Actors': 'Kate Capshaw, Tom Everett Scott, Tom Selleck, Blythe Danner, Ellen DeGeneres', 'Subtitles': 'English', 'Studio': 'Dreamworks Video', 'Writers': 'Cathleen Schine, Maria Maggenti', 'Number of discs': '1'}\nWhen this movie was over, I couldn't believe I'd wasted two hours of my life on it. It might have been almost watchable if it had starred, say, Meg Ryan, whose sometimes irritating cuteness might have lightened up the heroine's basically dour and unpleasant personality. Instead we're sentenced to two hours of the dreadful Kate Capshaw. It's not necessarily that she's a bad actress; she just seems like an awful person. Ellen DeGeneres isn't much more fun to watch. And the solution to the mystery of the love letter is not merely ridiculous; it's insultingly stupid.<br />Tom Selleck, as always, lights up the screen (too bad he's only on it for about 15 minutes), and the other supporting players are fine as well. And the scenes of New England are pretty. Maybe an enterprising fan will find a way to digitally insert them into a better movie.\nBlech!\nSerendipity\nJohn Cusack  (Actor),     Kate Beckinsale  (Actor),     Peter Chelsom  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n[\"Irresistible stars John Cusack (AMERICA'S SWEETHEARTS, HIGH FIDELITY) and Kate Beckinsale (PEARL HARBOR, BROKEDOWN PALACE) are drawn together and take a chance on love in this critically acclaimed romantic comedy! In the course of one magical evening, Jonathan (Cusack) and Sara (Beckinsale) meet unexpectedly ... then part without expectation when she decides they must let fate determine if they are meant to be together. Years later, they are both engaged to others but cannot give up the dream that -- despite time, distance, and the obstacles that conspire to keep them apart -- they will one day meet again. Also starring Jeremy Piven (THE FAMILY MAN, VERY BAD THINGS) and Molly Shannon (SUPERSTAR, NEVER BEEN KISSED) in a stellar supporting cast -- you're destined to agree with audiences everywhere who fell for the surprising charms of this delightful big-screen romance!\"]\n{'Genre': 'Destiny... with a sense of humor', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Crystal Bock, Bridget Moynahan, Ann Talman, Peter Chelsom, Marc Klein, Jeremy Piven, Michael Guarino Jr., Gary Gerbrandt, Lilli Lavine, Stephen Bruce, David Sparrow, John Cusack, Abdul Alshawish, Kate BeckinsaleCrystal Bock, Bridget Moynahan, Ann Talman, Peter Chelsom, Marc Klein, Jeremy Piven, Michael Guarino Jr., Gary Gerbrandt, Lilli Lavine, Stephen Bruce, David Sparrow, John Cusack, Abdul Alshawish, Kate Beckinsale  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': 'MFR786936166583#VG', 'Director': 'Peter Chelsom', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 9, 2002', 'Actors': 'John Cusack, Kate Beckinsale, Lilli Lavine, Michael Guarino Jr., Abdul Alshawish', 'Studio': 'Miramax Home Entertainment', 'Writers': 'Marc Klein', 'Number of discs': '1'}\nJohn Cusack is one of my all-time favorite actors, and clearly a smart person, too--I can't think of another bad film he's done. And Kate Beckinsale is reliably interesting, as well as beautiful. So I can't figure out how they wound up in this half-hearted loser of a movie. In addition to numerous irritating implausibilities (starting with Cusack not knowing the definition of \"serendipity\"), the main characters have no, well, characteristics, beyond their obsession with each other. Cusack ultimately treats the woman in his life horribly, but we're supposed to forgive him because he does it all for true love. Yuck. It's a shame, because this promised to be the kind of fluffy New York love story we all needed this past year. It seems as if either the movie got edited to death after production, or the writer just didn't care enough to make the story interesting in the first place--I can't tell which.<br />In any case, \"Serendipity\" turns out to be a sad waste of time and talent. If you're a Cusack fan, get \"Say Anything,\"  \"High Fidelity,\" \"The Grifters,\" or even \"Grosse Pointe Blank.\" If Beckinsale's the one you want to watch, try \"Haunted,\" \"Cold Comfort Farm,\" \"Last Days of Disco,\" or even \"Brokedown Palace.\"\nA depressing waste of some fine actors.\nKate & Leopold\nMeg Ryan  (Actor),     Hugh Jackman  (Actor),     James Mangold  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n[\"Meg Ryan (YOU'VE GOT MAIL) and Hugh Jackman (X-MEN) are paired as star-crossed lovers who discover that passion and chivalry never go out of style! When a rip in time brings together a charming 19th century bachelor and a thoroughly 21st century woman, the potential for an old-fashioned modern romance ignites! Also starring Breckin Meyer (ROAD TRIP) and Liev Schreiber (SCREAM 3).\"]\n{'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'Josh Stamberg, Philip Bosco, Liev Schreiber, Natasha Lyonne, Matthew Sussman, Bradley Whitford, James Mangold, Steven Rogers, Paxton Whitehead, Meg Ryan, Charlotte Ayanna, Hugh Jackman, Spalding Gray, Breckin MeyerJosh Stamberg, Philip Bosco, Liev Schreiber, Natasha Lyonne, Matthew Sussman, Bradley Whitford, James Mangold, Steven Rogers, Paxton Whitehead, Meg Ryan, Charlotte Ayanna, Hugh Jackman, Spalding Gray, Breckin Meyer   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Director': 'James Mangold', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'June 11, 2002', 'Actors': 'Meg Ryan, Hugh Jackman, Liev Schreiber, Breckin Meyer, Natasha Lyonne', 'Studio': 'Miramax', 'Writers': 'James Mangold, Steven Rogers', 'Number of discs': '1'}\nThis movie had its moments, most of them provided by the yummy Hugh Jackman. And Liev Schreiber is very funny.  But it suffers from a bad case of Meg Ryan wrinkling up her adorable little nose and sighing at her hellish, though expensive, life.<br />It's also one of these new movies that specializes in insulting the intelligence of its audience. An example: the \"villain\" (a confused character played by Bradley Whitford--he's supposed to be bad, but I'm pretty sure he's not supposed to be an idiot) gets caught lying about an opera he hasn't really seen. Here's the thing: Many, many people in New York City (not just incredibly rich ones) love opera. If you don't know the plot of an opera, there's no point in lying about it, because the chances of getting caught are very high. But, apparently, the people who made this movie believe that the potential audience of this movie thinks that opera is only ever watched by upper-class snobs. And of course, in the end, true love conquers all, which in this case means the woman gives up everything she's worked for all her life, not to mention all her family and friends, to be with her man.<br />I can't say I didn't enjoy watching this movie. But the more I thought about it afterwards, the more insulted I felt by it.\nCould have been so much better! (warning---spoilers)\nRoute 666\nLou Diamond Phillips  (Actor),     Lori Petty  (Actor),     William Wesley  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['When two Special Agencts cut through a condemned, desolated highway known as Route 666 while tracking a suspect, they discover a danger far worse than deadly twists and turns. Years ago, a notorious chain gang was killed in a horrific roadside murder, and the highway still echoes with its brutal legacy.']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': \"Lou Diamond Phillips, William Wesley, Lori Petty, Lion's Gate Films\", 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT71292DVD', 'Director': 'William Wesley', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 19, 2004', 'Actors': 'Lou Diamond Phillips, Lori Petty', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe plot is dumb and the zombies and the bad guys are all equally ridiculous. Still, I found this movie strangely watchable. Lou Diamond Phillips, Lori Petty, and Steven Williams make a great trio, and the evil sheriff is satisfyingly EEEEVIL. But what I think makes this movie work is the spooky/beautiful desert setting, which gives it a bit more of a sense of spirituality than it really deserves. Plus, there's an encounter with a wacky shaman who serves magic tea. Silly, but fun.\nBad, but fun bad.\nTamara Drewe\nGemma Arterton  (Actor),     Dominic Cooper  (Actor),     Stephen Frears  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'When journalist Tamara Drewe returns to her parents’ house with a new assignment – and a new nose – she sets the surrounding countryside’s male hearts aflame, breaking the picturesque tranquility and transforming the village of her youth into a swirling maelstrom of temptation, seduction, and tawdry gossip. But when a bit of silly mischief puts lives and loves at risk, Tamara Drewe must choose between getting it all and getting the one. In this fun, witty romance, director Stephen Frears (', 'The Queen', ',', 'Dangerous Liaisons', ') perfectly captures the spirit of the beloved graphic novel.', 'Amazon.com', \"Is there anything more idyllic than the English countryside? Perhaps not, but even the most bucolic of settings holds its dark secrets, according to Stephen Frears's lovely, offbeat\", 'Tamara Drewe', '.', 'Tamara Drewe', \"is based on the graphic novel by Posy Simmonds, a British cartoonist who based her work on Thomas Hardy's\", 'Far from the Madding Crowd', '. There are homages, subtle and not, throughout to Hardy and his work, but even non-Hardy aficionados will enjoy', 'Tamara Drewe', \"and its dark, microscopic view of the gentry. The title character is played by the winsome Gemma Arterton, who as a young lass in the lovely burg of Ewedown was a bit of an ugly duckling, with a nose to give Cyrano a run for his money. But thanks to modern comforts like plastic surgery, Tamara's blossomed into a beauty and successful writer. When she returns to Ewedown, she manages to turn the entire tiny town on its ear. The cast is first rate, including Roger Allam as Nicholas, a bestselling novelist and randy old goat who cheats on his long-suffering wife, Beth (Tamsin Greig), who runs the writers' retreat that centers on Nicholas and his giant ego. Tamara attracts the attention of her childhood pal Andy (Luke Evans) and an annoying rock drummer, Ben (Dominic Cooper), as well as the distasteful Nicholas. With fawning writers descending on Ewedown, and two cheeky, bored teenagers, Jody and Casey (Jessica Barden and Charlotte Christie), acting as the story's Greek chorus, there are plenty of characters to keep things moving in\", 'Tamara Drewe', \". And it's to Frears's and the actors' credit that if none of the characters is particularly likable (except for Greig's Beth), the action is enough to keep the viewer engaged. There are laughs, cringes, and some true poignancy--and a climactic event that will touch everyone.\", 'Tamara Drewe', 'will satisfy fans of Hardy, Frears, dark indie comedies--and those who want to stay far, far from the madding crowd. --', 'A.T. Hurley']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '36910', 'Director': 'Stephen Frears', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Gemma Arterton, Dominic Cooper', 'Subtitles': 'Spanish', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\n\"Tamara Drewe\" is deadly clever comedy of manners with a wickedly British sense of black humor. Post-plastic-surgery, the gorgeous Tamara Drewe comes home to her boring rural village -- ostensibly to fix up and sell her deceased mother's house, but also to show up everyone who was cruel to her when she was a bright, angry teenager with an outsize nose. One of those people was her writer neighbor, a serial adulterer who reigns over the fawning guests at the farm/writer's colony actually run by his devoted and ultra-capable wife. Throw in the hot local handyman, a couple of dangerously bored teenaged girls, the drummer from a punk band, and a mannerless dog. All kinds of trouble ensue. Don't expect any noble characters or heroic actions from this movie; watch it to enjoy the spectacle of people behaving mostly -- but not totally -- badly, and doing it in a generally clever and funny way.\nUtterly charming and totally British",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: The Love Letter\nReview Date: 2001/08/14\nStore: Kate Capshaw  (Actor),     Tom Everett Scott  (Actor),     Peter Chan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['An unsigned and unaddressed love letter creates romantic turmoil in a small seaside town']\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Comedy', 'Format': 'Closed-captioned, AC-3, Anamorphic, Color, Dolby, Widescreen, NTSC, Multiple Formats', 'Contributor': 'Tom Everett Scott, Ellen DeGeneres, Alice Drummond, Erik Jensen, Kate Capshaw, Tom Selleck, Gloria Stuart, Maria Maggenti, Jessica Capshaw, Bill Buell, Julianne Nicholson, Blythe Danner, Cathleen Schine, Margaret Ann Brady, Peter ChanTom Everett Scott, Ellen DeGeneres, Alice Drummond, Erik Jensen, Kate Capshaw, Tom Selleck, Gloria Stuart, Maria Maggenti, Jessica Capshaw, Bill Buell, Julianne Nicholson, Blythe Danner, Cathleen Schine, Margaret Ann Brady, Peter Chan  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 5.1)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': '85302', 'Director': 'Peter Chan', 'Media Format': 'Closed-captioned, AC-3, Anamorphic, Color, Dolby, Widescreen, NTSC, Multiple Formats', 'Run time': '1 hour and 28 minutes', 'Release date': 'November 23, 1999', 'Actors': 'Kate Capshaw, Tom Everett Scott, Tom Selleck, Blythe Danner, Ellen DeGeneres', 'Subtitles': 'English', 'Studio': 'Dreamworks Video', 'Writers': 'Cathleen Schine, Maria Maggenti', 'Number of discs': '1'}\nReview Text: When this movie was over, I couldn't believe I'd wasted two hours of my life on it. It might have been almost watchable if it had starred, say, Meg Ryan, whose sometimes irritating cuteness might have lightened up the heroine's basically dour and unpleasant personality. Instead we're sentenced to two hours of the dreadful Kate Capshaw. It's not necessarily that she's a bad actress; she just seems like an awful person. Ellen DeGeneres isn't much more fun to watch. And the solution to the mystery of the love letter is not merely ridiculous; it's insultingly stupid.<br />Tom Selleck, as always, lights up the screen (too bad he's only on it for about 15 minutes), and the other supporting players are fine as well. And the scenes of New England are pretty. Maybe an enterprising fan will find a way to digitally insert them into a better movie.\nReview Title: Blech!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Serendipity\nReview Date: 2002/07/15\nStore: John Cusack  (Actor),     Kate Beckinsale  (Actor),     Peter Chelsom  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Miramax Home Entertainment, All Titles\nProduct Description: [\"Irresistible stars John Cusack (AMERICA'S SWEETHEARTS, HIGH FIDELITY) and Kate Beckinsale (PEARL HARBOR, BROKEDOWN PALACE) are drawn together and take a chance on love in this critically acclaimed romantic comedy! In the course of one magical evening, Jonathan (Cusack) and Sara (Beckinsale) meet unexpectedly ... then part without expectation when she decides they must let fate determine if they are meant to be together. Years later, they are both engaged to others but cannot give up the dream that -- despite time, distance, and the obstacles that conspire to keep them apart -- they will one day meet again. Also starring Jeremy Piven (THE FAMILY MAN, VERY BAD THINGS) and Molly Shannon (SUPERSTAR, NEVER BEEN KISSED) in a stellar supporting cast -- you're destined to agree with audiences everywhere who fell for the surprising charms of this delightful big-screen romance!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Destiny... with a sense of humor', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Crystal Bock, Bridget Moynahan, Ann Talman, Peter Chelsom, Marc Klein, Jeremy Piven, Michael Guarino Jr., Gary Gerbrandt, Lilli Lavine, Stephen Bruce, David Sparrow, John Cusack, Abdul Alshawish, Kate BeckinsaleCrystal Bock, Bridget Moynahan, Ann Talman, Peter Chelsom, Marc Klein, Jeremy Piven, Michael Guarino Jr., Gary Gerbrandt, Lilli Lavine, Stephen Bruce, David Sparrow, John Cusack, Abdul Alshawish, Kate Beckinsale  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': 'MFR786936166583#VG', 'Director': 'Peter Chelsom', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 9, 2002', 'Actors': 'John Cusack, Kate Beckinsale, Lilli Lavine, Michael Guarino Jr., Abdul Alshawish', 'Studio': 'Miramax Home Entertainment', 'Writers': 'Marc Klein', 'Number of discs': '1'}\nReview Text: John Cusack is one of my all-time favorite actors, and clearly a smart person, too--I can't think of another bad film he's done. And Kate Beckinsale is reliably interesting, as well as beautiful. So I can't figure out how they wound up in this half-hearted loser of a movie. In addition to numerous irritating implausibilities (starting with Cusack not knowing the definition of \"serendipity\"), the main characters have no, well, characteristics, beyond their obsession with each other. Cusack ultimately treats the woman in his life horribly, but we're supposed to forgive him because he does it all for true love. Yuck. It's a shame, because this promised to be the kind of fluffy New York love story we all needed this past year. It seems as if either the movie got edited to death after production, or the writer just didn't care enough to make the story interesting in the first place--I can't tell which.<br />In any case, \"Serendipity\" turns out to be a sad waste of time and talent. If you're a Cusack fan, get \"Say Anything,\"  \"High Fidelity,\" \"The Grifters,\" or even \"Grosse Pointe Blank.\" If Beckinsale's the one you want to watch, try \"Haunted,\" \"Cold Comfort Farm,\" \"Last Days of Disco,\" or even \"Brokedown Palace.\"\nReview Title: A depressing waste of some fine actors.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kate & Leopold\nReview Date: 2002/07/15\nStore: Meg Ryan  (Actor),     Hugh Jackman  (Actor),     James Mangold  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Miramax Home Entertainment, All Titles\nProduct Description: [\"Meg Ryan (YOU'VE GOT MAIL) and Hugh Jackman (X-MEN) are paired as star-crossed lovers who discover that passion and chivalry never go out of style! When a rip in time brings together a charming 19th century bachelor and a thoroughly 21st century woman, the potential for an old-fashioned modern romance ignites! Also starring Breckin Meyer (ROAD TRIP) and Liev Schreiber (SCREAM 3).\"]\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'Josh Stamberg, Philip Bosco, Liev Schreiber, Natasha Lyonne, Matthew Sussman, Bradley Whitford, James Mangold, Steven Rogers, Paxton Whitehead, Meg Ryan, Charlotte Ayanna, Hugh Jackman, Spalding Gray, Breckin MeyerJosh Stamberg, Philip Bosco, Liev Schreiber, Natasha Lyonne, Matthew Sussman, Bradley Whitford, James Mangold, Steven Rogers, Paxton Whitehead, Meg Ryan, Charlotte Ayanna, Hugh Jackman, Spalding Gray, Breckin Meyer   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Director': 'James Mangold', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'June 11, 2002', 'Actors': 'Meg Ryan, Hugh Jackman, Liev Schreiber, Breckin Meyer, Natasha Lyonne', 'Studio': 'Miramax', 'Writers': 'James Mangold, Steven Rogers', 'Number of discs': '1'}\nReview Text: This movie had its moments, most of them provided by the yummy Hugh Jackman. And Liev Schreiber is very funny.  But it suffers from a bad case of Meg Ryan wrinkling up her adorable little nose and sighing at her hellish, though expensive, life.<br />It's also one of these new movies that specializes in insulting the intelligence of its audience. An example: the \"villain\" (a confused character played by Bradley Whitford--he's supposed to be bad, but I'm pretty sure he's not supposed to be an idiot) gets caught lying about an opera he hasn't really seen. Here's the thing: Many, many people in New York City (not just incredibly rich ones) love opera. If you don't know the plot of an opera, there's no point in lying about it, because the chances of getting caught are very high. But, apparently, the people who made this movie believe that the potential audience of this movie thinks that opera is only ever watched by upper-class snobs. And of course, in the end, true love conquers all, which in this case means the woman gives up everything she's worked for all her life, not to mention all her family and friends, to be with her man.<br />I can't say I didn't enjoy watching this movie. But the more I thought about it afterwards, the more insulted I felt by it.\nReview Title: Could have been so much better! (warning---spoilers)\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Route 666\nReview Date: 2008/10/27\nStore: Lou Diamond Phillips  (Actor),     Lori Petty  (Actor),     William Wesley  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: ['When two Special Agencts cut through a condemned, desolated highway known as Route 666 while tracking a suspect, they discover a danger far worse than deadly twists and turns. Years ago, a notorious chain gang was killed in a horrific roadside murder, and the highway still echoes with its brutal legacy.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': \"Lou Diamond Phillips, William Wesley, Lori Petty, Lion's Gate Films\", 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT71292DVD', 'Director': 'William Wesley', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 19, 2004', 'Actors': 'Lou Diamond Phillips, Lori Petty', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The plot is dumb and the zombies and the bad guys are all equally ridiculous. Still, I found this movie strangely watchable. Lou Diamond Phillips, Lori Petty, and Steven Williams make a great trio, and the evil sheriff is satisfyingly EEEEVIL. But what I think makes this movie work is the spooky/beautiful desert setting, which gives it a bit more of a sense of spirituality than it really deserves. Plus, there's an encounter with a wacky shaman who serves magic tea. Silly, but fun.\nReview Title: Bad, but fun bad.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tamara Drewe\nReview Date: 2011/03/13\nStore: Gemma Arterton  (Actor),     Dominic Cooper  (Actor),     Stephen Frears  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'When journalist Tamara Drewe returns to her parents’ house with a new assignment – and a new nose – she sets the surrounding countryside’s male hearts aflame, breaking the picturesque tranquility and transforming the village of her youth into a swirling maelstrom of temptation, seduction, and tawdry gossip. But when a bit of silly mischief puts lives and loves at risk, Tamara Drewe must choose between getting it all and getting the one. In this fun, witty romance, director Stephen Frears (', 'The Queen', ',', 'Dangerous Liaisons', ') perfectly captures the spirit of the beloved graphic novel.', 'Amazon.com', \"Is there anything more idyllic than the English countryside? Perhaps not, but even the most bucolic of settings holds its dark secrets, according to Stephen Frears's lovely, offbeat\", 'Tamara Drewe', '.', 'Tamara Drewe', \"is based on the graphic novel by Posy Simmonds, a British cartoonist who based her work on Thomas Hardy's\", 'Far from the Madding Crowd', '. There are homages, subtle and not, throughout to Hardy and his work, but even non-Hardy aficionados will enjoy', 'Tamara Drewe', \"and its dark, microscopic view of the gentry. The title character is played by the winsome Gemma Arterton, who as a young lass in the lovely burg of Ewedown was a bit of an ugly duckling, with a nose to give Cyrano a run for his money. But thanks to modern comforts like plastic surgery, Tamara's blossomed into a beauty and successful writer. When she returns to Ewedown, she manages to turn the entire tiny town on its ear. The cast is first rate, including Roger Allam as Nicholas, a bestselling novelist and randy old goat who cheats on his long-suffering wife, Beth (Tamsin Greig), who runs the writers' retreat that centers on Nicholas and his giant ego. Tamara attracts the attention of her childhood pal Andy (Luke Evans) and an annoying rock drummer, Ben (Dominic Cooper), as well as the distasteful Nicholas. With fawning writers descending on Ewedown, and two cheeky, bored teenagers, Jody and Casey (Jessica Barden and Charlotte Christie), acting as the story's Greek chorus, there are plenty of characters to keep things moving in\", 'Tamara Drewe', \". And it's to Frears's and the actors' credit that if none of the characters is particularly likable (except for Greig's Beth), the action is enough to keep the viewer engaged. There are laughs, cringes, and some true poignancy--and a climactic event that will touch everyone.\", 'Tamara Drewe', 'will satisfy fans of Hardy, Frears, dark indie comedies--and those who want to stay far, far from the madding crowd. --', 'A.T. Hurley']\nAverage Rating: 4.0\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '36910', 'Director': 'Stephen Frears', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Gemma Arterton, Dominic Cooper', 'Subtitles': 'Spanish', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\nReview Text: \"Tamara Drewe\" is deadly clever comedy of manners with a wickedly British sense of black humor. Post-plastic-surgery, the gorgeous Tamara Drewe comes home to her boring rural village -- ostensibly to fix up and sell her deceased mother's house, but also to show up everyone who was cruel to her when she was a bright, angry teenager with an outsize nose. One of those people was her writer neighbor, a serial adulterer who reigns over the fawning guests at the farm/writer's colony actually run by his devoted and ultra-capable wife. Throw in the hot local handyman, a couple of dangerously bored teenaged girls, the drummer from a punk band, and a mannerless dog. All kinds of trouble ensue. Don't expect any noble characters or heroic actions from this movie; watch it to enjoy the spectacle of people behaving mostly -- but not totally -- badly, and doing it in a generally clever and funny way.\nReview Title: Utterly charming and totally British\nRating: 4.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a clear preference for romantic comedies, particularly those featuring a blend of humor and drama, as evidenced by higher ratings for well-executed narratives involving romantic entanglements and character development. They favor films that emphasize character likability and engaging storytelling, showing dissatisfaction with productions that lack depth or present implausible situations.\n\nNotably, this person seems to gravitate towards films with appealing leads (notably actors like John Cusack and Meg Ryan), which strongly influences their ratings and sentiments. Their feedback reveals a disdain for mediocre performances, especially when portrayed by actors they consider capable, indicating a distinct preference for quality in casting.\n\nAcross their purchases, there’s a mix of sensitivity to price and an inclination towards established titles, hinting at a balance between seeking good value and a tendency to invest in known, successful films. The individual appreciates quality cinematography and well-crafted narratives but can overlook flaws if the overall experience is enjoyable.\n\nOverall, their core preferences suggest a love for clever, character-driven romantic comedies that maintain a balance of humor and emotional resonance, while also demonstrating a critical view of cinematic execution when expectations are not met.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Great cast, great performances, iffy story",
    "text": "In \"Solitary Man,\" Michael Douglas plays a liar, a cheater, and an all-around jerk -- yet he's got some inner quality so wonderful that the people who have been most hurt and disappointed by him still love him. Virtually every woman he meets falls into bed with him. And he used to be a stand-up guy; all this bad behavior was triggered by the traumatic discovery that he might possibly not live forever.<br /><br />If you buy this story, I've got a nice bridge in Brooklyn to sell you.<br /><br />And yet the cast makes the movie kind of worth seeing. Michael Douglas, Danny De Vito, Susan Sarandon, and Jenna Fisher are all outstanding. They're so good, in fact, that you hardly notice the thinness of the plot and the implausibility of the story. In particular, the brief scene in which De Vito explains why his nights are no longer troubled by mental images of the beautiful college girls who eat in his restaurant almost justifies the whole movie. I'm not surprised this movie didn't do well in the theaters (was it even released theatrically?), but if you're a fan of any of the actors in it, you'll enjoy it.",
    "images": [],
    "asin": "B003Q6D21Y",
    "parent_asin": "B003Q6D21Y",
    "user_id": "AE4YPEAUCXQTFH3H5OE7CWZH76TA",
    "timestamp": "2011-04-24 00:23:52",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Solitary Man",
    "average_rating": 3.9,
    "rating_number": 235,
    "features": [],
    "description": [
      "Product Description",
      "Ben (Michael Douglas) once ruled a car-dealership empire vast enough to fuel a glossy Manhattan lifestyle and endow a library at an East Coast university. But by the time he arrives at the college with his girlfriend’s daughter, Allyson (Imogen Poots), who is a prospective student, his world has collapsed around his ears. A business scandal has cost him his income and his marriage to Nancy (Susan Sarandon). His ever-present lust for every passing attractive woman threatens to take what little Ben has left. Even his new relationship with Jordan (Mary-Louise Parker) oscillates with tension. When Ben takes Allyson to tour the school, his motives are more than mixed.",
      "Amazon.com",
      "Michael Douglas has spent the second half of his career perfecting playing charming, morally flawed rakes (",
      "Fatal Attraction",
      ",",
      "Wall Street",
      ",",
      "Wonder Boys",
      "). So his performance in",
      "Solitary Man",
      "--as a morally flawed rake who is somehow ingratiating, if not exactly charming--is a subtle but real revelation of Douglas's acting skills. His character in",
      "Solitary Man",
      ", Ben, shows elements of his roles in the other films, yet Ben is no master of the universe; he's one step away from pathetic--and just enough so that viewers will be invested in finding out how his story plays out, even if at the same time they'd like to see Ben get some comeuppance. Douglas's Ben gets a late start on his midlife crisis, at roughly age 60, when his doctor suggests further tests on a heart irregularity. In the aftermath of that shocking news, Ben's tidy life (beautiful wife Nancy, played by Susan Sarandon; thoughtful daughter Susan, played by Jenna Fischer) has come undone, rent by divorce, a giant fall from his career as a successful car dealer, and a string of rather nauseatingly inappropriate liaisons with far younger women. Ben should have \"hit bottom\" by the time",
      "Solitary Man",
      "picks up his story, some six years later, and in many ways he has--broke, despondent, lonely. Yet somehow Ben can still charm the thongs off the ladies (and this is one area that",
      "Solitary Man",
      "just doesn't ring true in; Ben may be a good salesman, but no unemployed 65-year-old is",
      "that",
      "good a salesman). The supporting cast is outstanding, especially Sarandon and Fischer, whose characters should have given up on Ben long ago, and yet still remain invested, even bailing him out, sometimes unwisely. Mary-Louise Parker is also splendid as Jordan, Ben's wealthy girlfriend, who also keeps him afloat financially. The lovely Imogen Poots plays Allyson, Jordan's teenage daughter, whom Jordan entrusts to Ben's care on a trip to check out his alma mater. (Bad idea.) \"You can't cheat death, no matter how many 19-year-olds you talk into your bed,\" Nancy tells Ben, who seems to be listening--yet this old dog may not have it in himself to learn the new tricks he'll really need to make his life work. It's to Douglas's enormous credit, and to the script's, that",
      "Solitary Man",
      ", and Ben, manage to come off as human and real--even sympathetic. --",
      "A.T. Hurley"
    ],
    "price": 9.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51bmsJSmMZL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51bmsJSmMZL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81MMLPwDZrL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "View the trailer for Solitary Man",
        "url": "https://www.amazon.com/vdp/dd667dc9e2d84079929a18b7bdcf314d?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Michael Douglas  (Actor),     Susan Sarandon  (Actor),     Brian Koppelman, David Levien  (Director)    &                   0                  more   Rated:    R    Format: DVD",
    "categories": [
      "Movies & TV",
      "Today's Deals",
      "Anchor Bay Deals"
    ],
    "details": {
      "Genre": "Comedy",
      "Format": "Multiple Formats, Color, NTSC, Widescreen",
      "Contributor": "Danny Devito, Jesse Eisenberg, Susan Sarandon, Jenna Fischer, Brian Koppelman, David Levien, Michael Douglas, Mary-Louise ParkerDanny Devito, Jesse Eisenberg, Susan Sarandon, Jenna Fischer, Brian Koppelman, David Levien, Michael Douglas, Mary-Louise Parker  See more",
      "Language": "Unqualified",
      "Runtime": "1 hour and 29 minutes",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "0.62 x 5.47 x 7.58 inches; 2.72 Ounces",
      "Item model number": "ANCH21548DVD",
      "Director": "Brian Koppelman, David Levien",
      "Media Format": "Multiple Formats, Color, NTSC, Widescreen",
      "Run time": "1 hour and 29 minutes",
      "Release date": "September 7, 2010",
      "Actors": "Michael Douglas, Susan Sarandon, Danny Devito, Jenna Fischer, Mary-Louise Parker",
      "Subtitles": "Spanish",
      "Studio": "Anchor Bay",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}