{
  "user_id": "AFYEQGWZLEEM3VICX4K7GEITCNDQ",
  "summary": "=== Purchase Information ===\nProduct Title: Hart to Hart - The Complete Second Season\nReview Date: 2015/03/08\nStore: Robert Wagner  (Actor),     Stefanie Powers  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['The world’s most glamorous amateur sleuths are back for more mystery, fun and danger in the second sensational season of HART TO HART, starring Robert Wagner and Stefanie Powers. In 20 captivating cases ranging from kidnapping and robbery to industrial espionage and murder, romantic jetsetters Jonathan and Jennifer Hart risk life, limb and lifestyle to solve the most unsolvable of crimes. Featuring Lionel Stander as their faithful sidekick, Max, and a first class line-up of suspects and victims, HART TO HART: THE COMPLETE SECOND SEASON is a rich and sexy blend of adventure, intrigue and excitement. This top-rated classic was executive produced by TV powerhouses Aaron Spelling and Leonard Goldberg.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 10.4 Ounces', 'Item model number': '2227443', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '16 hours and 27 minutes', 'Release date': 'September 19, 2006', 'Actors': 'Robert Wagner, Stefanie Powers, Lionel Stander', 'Dubbed': 'Portuguese', 'Subtitles': 'Portuguese', 'Producers': 'Mart Crowley', 'Language': 'Portuguese (Dolby Digital 1.0), English (Dolby Digital 1.0)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '5'}\nReview Text: Perfect condition\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hart To Hart: Season 3\nReview Date: 2015/03/08\nStore: Robert Wagner  (Actor),     Stefanie Powers  (Actor),     Tom Mankiewicz  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: ['Robert Wagner (IT TAKES A THIEF) and Stefanie Powers (THE GIRL FROM U.N.C.L.E.) star in HART TO HART: SEASON THREE, a 24-episode collection of the stylish Emmy and Golden Globe-nominated detective drama. As Jonathan and Jennifer Hart, a wealthy and glamorous couple who always manage to find themselves caught up in mystery and adventure, Wagner and Powers charmed audiences with their lighthearted chemistry and thrilling adventures. Assisting the Harts in their jet-setting life of intrigue, the loyal and gravel-voiced servant Max (Lionel Stander) provided an earthy counterpoint to the elegance of his employers. Together, the three made for a team that viewers found irresistible. Created by Sidney Sheldon, both a bestselling novelist (MASTER OF THE GAME, WINDMILLS OF THE GODS) and hit television producer (I DREAM OF JEANNIE, THE PATTY DUKE SHOW), HART TO HART is a smart and sexy detective drama. Join the Harts on their globetrotting tour of danger and romance with HART TO HART: SEASON THREE.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Full Screen, NTSC', 'Contributor': 'Tom Mankiewicz, Lionel Stander, Robert Wagner, Stefanie Powers', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.24 Ounces', 'Item model number': '30473659', 'Director': 'Tom Mankiewicz', 'Media Format': 'Multiple Formats, Box set, Full Screen, NTSC', 'Run time': '19 hours', 'Release date': 'December 9, 2014', 'Actors': 'Robert Wagner, Stefanie Powers, Lionel Stander', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: Perfect condition\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Seinfeld: The Complete Series\nReview Date: 2017/10/14\nStore: Jerry Seinfeld  (Actor),     Julia Louis-Dreyfus  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Seinfeld stars Jerry Seinfeld as a stand-up comedian whose life in New York City is made even more chaotic by his quirky group of friends who join him in wrestling with life\\'s most perplexing, yet often trivial questions. Often described as \"a show about nothing,\" Seinfeld mines the humor in life\\'s mundane situations like waiting in line, searching for a lost item, or the trials and tribulations of dating. Co-starring are Julia Louis-Dreyfus as Jerry\\'s ex-girlfriend and current platonic pal, Elaine Benes; Jason Alexander as George Costanza, Jerry\\'s neurotic hard-luck best friend; and Michael Richards as Jerry\\'s eccentric neighbor, Kramer. This highly renowned sitcom set the bar in comedy with some of the most hilariously watchable characters in television history.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, NTSC, Box set', 'Contributor': 'Jason Alexander, Michael Richards, Jerry Seinfeld, Julia Louis-Dreyfus', 'Language': 'English', 'Number Of Discs': '33', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '3.1 x 5.9 x 7.8 inches; 1.81 Pounds', 'Audio Description': 'English', 'Item model number': '043396428768', 'Media Format': 'Color, NTSC, Box set', 'Release date': 'November 5, 2013', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander', 'Subtitles': 'English', 'Studio': 'Sony Pictures Entertainment', 'Number of discs': '33'}\nReview Text: DVDs are in very good condition!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sanford and Son: The Complete Series (Slim Packaging)\nReview Date: 2019/01/14\nStore: Foxx, Redd  (Actor),     Wilson, Demond  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Sanford and Son', 'An early milestone in urban TV comedy,', 'Sanford and Son', 'was an immediate critical and audience favorite when it debuted in the early \\'70s, signaling the arrival of one of TV\\'s most memorable characters: Cantankerous-but-lovable junk dealer Fred Sanford (Redd Foxx). An African American answer to \"Archie Bunker,\" widower Sanford and his \"Dummy\" son Lamont (Demond Wilson) run a family junk business in Watts, dreaming up schemes to strike it rich. Outspoken and outrageous, Sanford serves up big laughs as he skewers stereotypes, forever threatening, \"How\\'d you like one across your lip?\" Aided by a colorful cast that includes acid-tongued Aunt Esther (LaWanda Page),', 'Sanford and Sons', 'provided a showcase of black talent of all generations, featuring guest stars like Lena Horne and episodes written by Richard Pryor. Timely and topical during its highly-rated five-year run (1972-1977),', 'Sanford and Son', \"emerged as one of the decade's biggest TV hits, inspiring producer Norman Lear to develop more barrier-breaking shows like\", 'The Jeffersons', 'and', 'Good Times', '.', 'Amazon.com', 'Sanford and Son: The Complete Second Season', 'Sanford and Son', \"'s second season began on September 15, 1972. The sitcom quickly vaulted to the No. 2 spot on the network ratings--right behind creators Norman Lear and Bud Yorkin's previous effort,\", 'All in the Family', '. The second season brought no changes to the show\\'s basic format--comedian Redd Foxx remained the focus as cantankerous junkman Fred Sanford, with Demond Wilson as his son and perennial foil, Lamont. What the second season did bring was several new characters and some of the series\\' funniest episodes. The second season supporting cast was filled out by some of Foxx\\'s fellow comics, including Leroy and Skillet (\"A Visit from Lena Horne\") and LaWanda Page as Aunt Esther, who became a recurring character after \"The Big Party.\" Also joining was Don Bexley as Bubba (\"By the Numbers\"), Nathaniel Taylor as Rollo (\"Have Gun, Will Sell\"), and', 'Barney Miller', '\\'s Gregory Sierra as neighbor Julio (\"The Puerto Ricans Are Coming!\").  But', 'Sanford and Son', \"'s strength remained in Foxx's sharp-tongued and often improvised performance, which was ably abetted by the scripts (a number of plotlines were taken directly from\", 'Steptoe and Son', ', the U.K. series that inspired', 'Sanford', '). Richard Pryor and Paul Mooney penned two of the collection\\'s most laugh-filled half-hours, \"The Dowry\" and \"Sanford and Son and Sister Make Three,\" but every episode has its share of hilarity thanks to Foxx and his costars. Though only English and Spanish subtitles are offered as extras, series fans should be pleased with the set, especially as a reference for Fred\\'s best zingers (\"I\\'m gonna stick your face in a bowl full of dough and make gorilla cookies!\").', '--Paul Gaita', 'Sanford and Son: The Complete Third Season', 'Though conflict erupted between comic Redd Foxx and the producers of', 'Sanford and Son', \"during its third season, viewers are spared the backstage rancor and instead enjoy more hilarious episodes, fueled as always by Foxx's Emmy-nominated performance as cantankerous junkman Fred Sanford.\", 'Sanford and Son', \"was a solid ratings hit as it entered its third season (ranked third among network shows) and Foxx had won a Golden Globe the previous year, but a contract dispute had driven a wedge between him and series producers Bud Yorkin and Norman Lear (who also ran the season's top-rated program,\", 'All in the Family', '). Negotiations would eventually break down, and Foxx would be absent from six episodes (Fred was said to be visiting relatives in St. Louis) and did not return to the show until season 4 was underway. Foxx\\'s departure allowed the spotlight to shine more brightly on co-star Demond Wilson (who would soon launch his own contract disputes, which prompted his leaving the series in 1976) as well as new cast member Whitman Mayo, who joined the show that season as Fred\\'s pal Grady. While series aficionados are firmly divided over Grady, Mayo is quite funny, especially during the final six episodes (in particular \"Will the Real Fred Sanford Please Stand Up?\" and season closer \"Hello Cousin Emma, Goodbye Cousin Emma\"). Other standout episodes include \"The Blind Mellow Jelly Collection\" (in which Fred attempts to reclaim his donated record collection) and \"Fred Sanford, Legal Eagle\" (Fred defends Lamont in traffic court), which features', 'Starsky and Hutch', \"'s Antonio Fargas. The third-season scripts, penned mostly by story editor Ilunga Adell (\", 'Moesha', \"), remain sharp, as does the direction (the lion's share is handled by Peter Baldwin, though Bud Yorkin helms two episodes). Fans and first-timers alike will find plenty of laughs, which unfortunately lack any extras.\", '--Paul Gaita', 'Sanford and Son: The Complete Fourth Season', \"Sanford and Son'\", \"s fourth season (1974-1975) was the highest rated of its five years on network TV (the program reached no. 2 on the Nielsen charts); the program and star Redd Foxx both received Emmy and Golden Globe nominations for the season. Behind the scenes, however, the series was in turmoil due to Foxx's dissatisfaction with the tone and quality of the program, and he went missing from nine episodes, three of which kick off the first disc (Fred's absence is explained away as a trip to St. Louis).  But even without Foxx,\", 'Sanford and Son', 'still managed to generate plenty of laughs, thanks in no small part to its hard-working supporting cast; Whitman Mayo\\'s Grady, in particular, gets plenty of chances to shine, especially in \"Grady and His Lady\" and \"The Family Man\" (which served as the pilot for Mayo\\'s own short-lived series). Pat Morita\\'s Ah Chew makes his first appearance in \"There\\'ll Be Some Changes Made and Gregory Sierra as Julio makes his last in \"The Stung\"; guest stars include Billy Eckstine and Scatman Crothers.', \"Sanford and Son'\", 's fourth season can be viewed as something of a swan song for the popular series; after a ratings dip and timeslot change in the fifth season, Foxx and Wilson would both depart the show by the sixth season, and the show was cancelled in 1977.', '--Paul Gaita', 'Sanford and Son: The Complete Fifth Season', 'Guest stars and more guest stars seem to be the theme of', \"Sanford and Son'\", 's very funny fifth season (1975-1976). The 25 episodes feature a parade of celebrities supporting stars Redd Foxx and Demond Wilson in guest and recurring roles, including John Larroquette and Robert Guillaume in', 'Steinberg and Son', \", a TV sitcom based on Fred and Lamont's life; Marlene Clark as Lamont's girlfriend June; Nancy (\", 'The Beverly Hillbillies', \") as Officer Hoppy's overprotective mom; and George Foreman, Merv Griffin, Steve Lawrence, and Eydie Gorme as themselves. The other addition to the series comes with the introduction of the Sanford Arms, a apartment built on former neighbor Julio's place, and which comes complete with a host of eccentric guests (the hotel, along with\", 'Sanford', 'stars LaWanda Page and Don Bexley, would be the focus of its own short-lived sitcom following', \"Sanford and Son'\", \"s cancellation in 1977).  Otherwise, it's business as usual at Fred and Lamont's junkyard, with the pair getting involved in bank robberies, earthquakes, and escort services, while still finding time to go camping (in the season finale, written by Garry Shandling). The sheer amount of laughs offered by season 5 was a strong reminder of why the show had remained so popular for four seasons; unfortunately, time slot changes and the disinterest of both leads would spell the show's demise only one season later.\", '--Paul Gaita']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Taylor, Nathaniel, Mayo, Whitman, Wilson, Demond, Foxx, Redd, Bexley, Don', 'Language': 'Unqualified', 'Number Of Discs': '17', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.5 inches; 11.2 Ounces', 'Item model number': '4313326', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '55 hours and 31 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Foxx, Redd, Wilson, Demond, Bexley, Don, Mayo, Whitman, Taylor, Nathaniel', 'Subtitles': 'English, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '17'}\nReview Text: This is a great show to watch !\nReview Title: Great show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Benny Hill 1969 - 1985 Complete & Unadulterated\nReview Date: 2019/01/14\nStore: Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Classic TV\nProduct Description: ['Benny Hill collection 1969-1985']\nAverage Rating: 5.0\nProduct Details: {'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Run time': '41 hours and 40 minutes', 'Language': 'Unqualified (Dolby Digital 2.0 Stereo)', 'Studio': 'A&E TV'}\nReview Text: Great if you are into this kind of humor\nReview Title: Video\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Magic School Bus: Greatest Original Episodes\nReview Date: 2019/04/03\nStore: None  (Actor, Director)    Format: DVD\nCategories: Movies & TV, 3-6 Years\nProduct Description: ['WAHOO! Join Ms. Frizzle, Liz and the entire Magic School Bus gang in seven GREATEST ORIGINAL EPISODES of the Emmy Award-winning science-adventure series. The Bus will take you on a journey through space, the human body and even into the eye of a storm. Buckle up for all your favorite field trips!Episodes include: Inside Ralphie, For Lunch, Gets Lost In Space, The Busasaurus, Going Batty, Flexes Its Muscles, Kicks Up A Storm']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family/Animation', 'Format': 'Full Screen, NTSC, Widescreen', 'Contributor': 'None', 'Language': 'English', 'Runtime': '2 hours and 34 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'None', 'Media Format': 'Full Screen, NTSC, Widescreen', 'Run time': '2 hours and 34 minutes', 'Release date': 'September 12, 2017', 'Actors': 'None', 'Studio': 'Scholastic', 'Number of discs': '1'}\nReview Text: Arrived on time. Kids just love this.\nReview Title: Great movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Schoolhouse Rock! (Special 30th Anniversary Edition)\nReview Date: 2019/04/03\nStore: Lauren Yohe  (Actor),     Bob Kaliban  (Actor),     Tom Warburton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, Special Editions\nProduct Description: ['Schoolhouse Rock!, the timeless collection of animated songs that taught an entire generation that \"knowledge is power\" is on DVD for in this Ultimate Collector\\'s Edition 2-disc set. Now every day can feel like Saturday morning as you sing along with \"I\\'m Just A Bill,\" \"Three Is A Magic Number,\" \"Interjections!\" and the rest of your favorite tunes. Featuring an additional catchy animated song by the original series\\' creators, the 30th Anniversary Edition DVD rocks your house.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Tom Warburton, Sue Manchester, Maeretha Stewart, Bob Kaliban, Darrel Stern, Lauren Yohe, Joshie Armstead, Mary Sue Berry, Lori Lieberman, Christine LangnerTom Warburton, Sue Manchester, Maeretha Stewart, Bob Kaliban, Darrel Stern, Lauren Yohe, Joshie Armstead, Mary Sue Berry, Lori Lieberman, Christine Langner  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '4 hours and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '2304803', 'Director': 'Tom Warburton', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC', 'Run time': '4 hours and 43 minutes', 'Release date': 'August 27, 2002', 'Actors': 'Lauren Yohe, Bob Kaliban, Darrel Stern, Joshie Armstead, Mary Sue Berry', 'Studio': 'ABC STUDIOS', 'Number of discs': '2'}\nReview Text: I grew up with this . Great for kids . Love it\nReview Title: Great!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Chronicles of Narnia: Prince Caspian\nReview Date: 2019/07/28\nStore: Ben Barnes  (Actor),     Georgie Henley  (Actor),     Andrew Adamson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', \"The magical world of C.S. Lewis' beloved fantasy comes to life once again in PRINCE CASPIAN, the second installment of THE CHRONICLES OF NARNIA series. Join Peter, Susan, Edmund, Lucy, the mighty and majestic Aslan, friendly new Narnian creatures and Prince Caspian as they lead the Narnians on a remarkable journey to restore peace and glory to their enchanted land. Continuing the adventure of THE LION, THE WITCH AND THE WARDROBE with more magic and a brand-new hero, PRINCE CASPIAN is a triumph of imagination, courage, love, joy and humor your whole family will want to watch again and again. The Chronicles of Narnia, Narnia, and all other book titles, characters and locales original thereto are trademarks of C.S. Lewis Pte Ltd. and are used with permission. (c) Disney/Walden\", 'Amazon.com', 'More exciting than The Lion, the Witch, and the Wardrobe,', 'The Chronicles of Narnia: Prince Caspian', \"continues the movie franchise based on C.S. Lewis' classic fantasy books. The movie picks up where the first left off... sort of. It's been a year since the Pevensie children--Peter (William Moseley), Susan (Anna Popplewell), Edmund (Skandar Keynes), and Lucy (Georgie Henley)--returned to England from Narnia, and they've just about resigned themselves to living their ordinary lives. But just like that, they're once again transported to a fantastical land, but one with a long-abandoned castle. It turns out that they are in Narnia again--and they themselves lived in that castle, but hundreds of years ago in Narnia time. They've been summoned back to help Prince Caspian (Stardust's Ben Barnes, resembling a young, cultured Keanu Reeves), the rightful heir to the throne who's become the target of his power-hungry uncle, King Mraz (Sergio Castellitto). And he's not the only one threatened: Mraz's people, the Telmarines, have pushed all the Narnians--the talking animals, the centaurs and other beasts, the walking trees--to the brink of extinction. Despite some alpha-male bickering, Peter and Caspian agree to fight Mraz alongside the remaining Narnians, including the dwarf Trumpkin (Peter Dinklage) and the swashbuckling mouse Reepicheep (voiced by Eddie Izzard). (Also appearing is Warwick Davis, who was in Willow and the 1989 BBC Prince Caspian.) But of course they most of all miss the noble lion, Aslan, who would have never let this happen to Narnia if he hadn't disappeared. Prince Caspian is epic, evoking memories of Peter Jackson's Lord of the Rings films. (Some of the battle elements may seem too familiar, but they were in Lewis's book.) And it's appropriate for kids (Reepicheep could have come out of a Shrek movie), though the tone is dark and there is a lot of death, albeit bloodless. After two successful films, Disney and Walden Media's franchise has proved successful enough that many of the characters are scheduled to return in The Voyage of the Dawn Treader. --\", 'David Horiuchi', 'Stills from', 'The Chronicles of Narnia: Prince Caspian', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Fantasy', 'Format': 'NTSC, Color, Widescreen, Subtitled, Multiple Formats', 'Contributor': 'Vincent Grass, Anna Popplewell, Skandar Keynes, Georgie Henley, Cornell John, Predrag Bjelac, Liam Neeson, Shane Rangi, Peter Dinklage, Pierfrancesco Favino, Alicia Borrachero, William Moseley, SimÃ³n Andreu, Sergio Castellitto, Andrew Adamson, Warwick Davis, Ben Barnes, Damián AlcázarVincent Grass, Anna Popplewell, Skandar Keynes, Georgie Henley, Cornell John, Predrag Bjelac, Liam Neeson, Shane Rangi, Peter Dinklage, Pierfrancesco Favino, Alicia Borrachero, William Moseley, SimÃ³n Andreu, Sergio Castellitto, Andrew Adamson, Warwick Davis, Ben…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '786936735437', 'Director': 'Andrew Adamson', 'Media Format': 'NTSC, Color, Widescreen, Subtitled, Multiple Formats', 'Run time': '2 hours and 29 minutes', 'Release date': 'December 2, 2008', 'Actors': 'Ben Barnes, Georgie Henley, Anna Popplewell, William Moseley, Skandar Keynes', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great movie\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Looney Tunes Video Show 2 [VHS]\nReview Date: 2022/09/25\nStore: Mel Blanc  (Actor),     Bea Benaderet  (Actor),     Arthur Davis  (Director),     Chuck Jones  (Director, Writer)    &                   1                  more   Rated:    G    Format: VHS Tape\nCategories: Movies & TV, Spanish Language, Infantil y familiar, Feature Films\nProduct Description: ['Looney Tunes Video Show 2 [VHS]']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Arthur Davis, Chuck Jones, Friz Freleng, Hawley Pratt, Robert McKimson', 'Release date': 'December 2, 1994', 'Date First Available': 'October 26, 2006', 'Actors': 'Mel Blanc, Bea Benaderet, June Foray, Robert C. Bruce', 'Studio': 'Warner Home Video', 'Producers': 'David H. DePatie, Edward Selzer, Friz Freleng', 'Writers': 'Carl Kohler, Charles McKimson, Chuck Jones, John W. Dunn, Sid Marcus'}\nReview Text: Kids love watching this video\nReview Title: Great video\nRating: 4.0\n--------------------------------------------------",
  "reference": "Hart to Hart - The Complete Second Season\nRobert Wagner  (Actor),     Stefanie Powers  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['The world’s most glamorous amateur sleuths are back for more mystery, fun and danger in the second sensational season of HART TO HART, starring Robert Wagner and Stefanie Powers. In 20 captivating cases ranging from kidnapping and robbery to industrial espionage and murder, romantic jetsetters Jonathan and Jennifer Hart risk life, limb and lifestyle to solve the most unsolvable of crimes. Featuring Lionel Stander as their faithful sidekick, Max, and a first class line-up of suspects and victims, HART TO HART: THE COMPLETE SECOND SEASON is a rich and sexy blend of adventure, intrigue and excitement. This top-rated classic was executive produced by TV powerhouses Aaron Spelling and Leonard Goldberg.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 10.4 Ounces', 'Item model number': '2227443', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '16 hours and 27 minutes', 'Release date': 'September 19, 2006', 'Actors': 'Robert Wagner, Stefanie Powers, Lionel Stander', 'Dubbed': 'Portuguese', 'Subtitles': 'Portuguese', 'Producers': 'Mart Crowley', 'Language': 'Portuguese (Dolby Digital 1.0), English (Dolby Digital 1.0)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '5'}\nPerfect condition\nFour Stars\nHart To Hart: Season 3\nRobert Wagner  (Actor),     Stefanie Powers  (Actor),     Tom Mankiewicz  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Robert Wagner (IT TAKES A THIEF) and Stefanie Powers (THE GIRL FROM U.N.C.L.E.) star in HART TO HART: SEASON THREE, a 24-episode collection of the stylish Emmy and Golden Globe-nominated detective drama. As Jonathan and Jennifer Hart, a wealthy and glamorous couple who always manage to find themselves caught up in mystery and adventure, Wagner and Powers charmed audiences with their lighthearted chemistry and thrilling adventures. Assisting the Harts in their jet-setting life of intrigue, the loyal and gravel-voiced servant Max (Lionel Stander) provided an earthy counterpoint to the elegance of his employers. Together, the three made for a team that viewers found irresistible. Created by Sidney Sheldon, both a bestselling novelist (MASTER OF THE GAME, WINDMILLS OF THE GODS) and hit television producer (I DREAM OF JEANNIE, THE PATTY DUKE SHOW), HART TO HART is a smart and sexy detective drama. Join the Harts on their globetrotting tour of danger and romance with HART TO HART: SEASON THREE.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Full Screen, NTSC', 'Contributor': 'Tom Mankiewicz, Lionel Stander, Robert Wagner, Stefanie Powers', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.24 Ounces', 'Item model number': '30473659', 'Director': 'Tom Mankiewicz', 'Media Format': 'Multiple Formats, Box set, Full Screen, NTSC', 'Run time': '19 hours', 'Release date': 'December 9, 2014', 'Actors': 'Robert Wagner, Stefanie Powers, Lionel Stander', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '6'}\nPerfect condition\nThree Stars\nSeinfeld: The Complete Series\nJerry Seinfeld  (Actor),     Julia Louis-Dreyfus  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Seinfeld stars Jerry Seinfeld as a stand-up comedian whose life in New York City is made even more chaotic by his quirky group of friends who join him in wrestling with life\\'s most perplexing, yet often trivial questions. Often described as \"a show about nothing,\" Seinfeld mines the humor in life\\'s mundane situations like waiting in line, searching for a lost item, or the trials and tribulations of dating. Co-starring are Julia Louis-Dreyfus as Jerry\\'s ex-girlfriend and current platonic pal, Elaine Benes; Jason Alexander as George Costanza, Jerry\\'s neurotic hard-luck best friend; and Michael Richards as Jerry\\'s eccentric neighbor, Kramer. This highly renowned sitcom set the bar in comedy with some of the most hilariously watchable characters in television history.']\n{'Genre': 'Comedy', 'Format': 'Color, NTSC, Box set', 'Contributor': 'Jason Alexander, Michael Richards, Jerry Seinfeld, Julia Louis-Dreyfus', 'Language': 'English', 'Number Of Discs': '33', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '3.1 x 5.9 x 7.8 inches; 1.81 Pounds', 'Audio Description': 'English', 'Item model number': '043396428768', 'Media Format': 'Color, NTSC, Box set', 'Release date': 'November 5, 2013', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander', 'Subtitles': 'English', 'Studio': 'Sony Pictures Entertainment', 'Number of discs': '33'}\nDVDs are in very good condition!\nFive Stars\nSanford and Son: The Complete Series (Slim Packaging)\nFoxx, Redd  (Actor),     Wilson, Demond  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Sanford and Son', 'An early milestone in urban TV comedy,', 'Sanford and Son', 'was an immediate critical and audience favorite when it debuted in the early \\'70s, signaling the arrival of one of TV\\'s most memorable characters: Cantankerous-but-lovable junk dealer Fred Sanford (Redd Foxx). An African American answer to \"Archie Bunker,\" widower Sanford and his \"Dummy\" son Lamont (Demond Wilson) run a family junk business in Watts, dreaming up schemes to strike it rich. Outspoken and outrageous, Sanford serves up big laughs as he skewers stereotypes, forever threatening, \"How\\'d you like one across your lip?\" Aided by a colorful cast that includes acid-tongued Aunt Esther (LaWanda Page),', 'Sanford and Sons', 'provided a showcase of black talent of all generations, featuring guest stars like Lena Horne and episodes written by Richard Pryor. Timely and topical during its highly-rated five-year run (1972-1977),', 'Sanford and Son', \"emerged as one of the decade's biggest TV hits, inspiring producer Norman Lear to develop more barrier-breaking shows like\", 'The Jeffersons', 'and', 'Good Times', '.', 'Amazon.com', 'Sanford and Son: The Complete Second Season', 'Sanford and Son', \"'s second season began on September 15, 1972. The sitcom quickly vaulted to the No. 2 spot on the network ratings--right behind creators Norman Lear and Bud Yorkin's previous effort,\", 'All in the Family', '. The second season brought no changes to the show\\'s basic format--comedian Redd Foxx remained the focus as cantankerous junkman Fred Sanford, with Demond Wilson as his son and perennial foil, Lamont. What the second season did bring was several new characters and some of the series\\' funniest episodes. The second season supporting cast was filled out by some of Foxx\\'s fellow comics, including Leroy and Skillet (\"A Visit from Lena Horne\") and LaWanda Page as Aunt Esther, who became a recurring character after \"The Big Party.\" Also joining was Don Bexley as Bubba (\"By the Numbers\"), Nathaniel Taylor as Rollo (\"Have Gun, Will Sell\"), and', 'Barney Miller', '\\'s Gregory Sierra as neighbor Julio (\"The Puerto Ricans Are Coming!\").  But', 'Sanford and Son', \"'s strength remained in Foxx's sharp-tongued and often improvised performance, which was ably abetted by the scripts (a number of plotlines were taken directly from\", 'Steptoe and Son', ', the U.K. series that inspired', 'Sanford', '). Richard Pryor and Paul Mooney penned two of the collection\\'s most laugh-filled half-hours, \"The Dowry\" and \"Sanford and Son and Sister Make Three,\" but every episode has its share of hilarity thanks to Foxx and his costars. Though only English and Spanish subtitles are offered as extras, series fans should be pleased with the set, especially as a reference for Fred\\'s best zingers (\"I\\'m gonna stick your face in a bowl full of dough and make gorilla cookies!\").', '--Paul Gaita', 'Sanford and Son: The Complete Third Season', 'Though conflict erupted between comic Redd Foxx and the producers of', 'Sanford and Son', \"during its third season, viewers are spared the backstage rancor and instead enjoy more hilarious episodes, fueled as always by Foxx's Emmy-nominated performance as cantankerous junkman Fred Sanford.\", 'Sanford and Son', \"was a solid ratings hit as it entered its third season (ranked third among network shows) and Foxx had won a Golden Globe the previous year, but a contract dispute had driven a wedge between him and series producers Bud Yorkin and Norman Lear (who also ran the season's top-rated program,\", 'All in the Family', '). Negotiations would eventually break down, and Foxx would be absent from six episodes (Fred was said to be visiting relatives in St. Louis) and did not return to the show until season 4 was underway. Foxx\\'s departure allowed the spotlight to shine more brightly on co-star Demond Wilson (who would soon launch his own contract disputes, which prompted his leaving the series in 1976) as well as new cast member Whitman Mayo, who joined the show that season as Fred\\'s pal Grady. While series aficionados are firmly divided over Grady, Mayo is quite funny, especially during the final six episodes (in particular \"Will the Real Fred Sanford Please Stand Up?\" and season closer \"Hello Cousin Emma, Goodbye Cousin Emma\"). Other standout episodes include \"The Blind Mellow Jelly Collection\" (in which Fred attempts to reclaim his donated record collection) and \"Fred Sanford, Legal Eagle\" (Fred defends Lamont in traffic court), which features', 'Starsky and Hutch', \"'s Antonio Fargas. The third-season scripts, penned mostly by story editor Ilunga Adell (\", 'Moesha', \"), remain sharp, as does the direction (the lion's share is handled by Peter Baldwin, though Bud Yorkin helms two episodes). Fans and first-timers alike will find plenty of laughs, which unfortunately lack any extras.\", '--Paul Gaita', 'Sanford and Son: The Complete Fourth Season', \"Sanford and Son'\", \"s fourth season (1974-1975) was the highest rated of its five years on network TV (the program reached no. 2 on the Nielsen charts); the program and star Redd Foxx both received Emmy and Golden Globe nominations for the season. Behind the scenes, however, the series was in turmoil due to Foxx's dissatisfaction with the tone and quality of the program, and he went missing from nine episodes, three of which kick off the first disc (Fred's absence is explained away as a trip to St. Louis).  But even without Foxx,\", 'Sanford and Son', 'still managed to generate plenty of laughs, thanks in no small part to its hard-working supporting cast; Whitman Mayo\\'s Grady, in particular, gets plenty of chances to shine, especially in \"Grady and His Lady\" and \"The Family Man\" (which served as the pilot for Mayo\\'s own short-lived series). Pat Morita\\'s Ah Chew makes his first appearance in \"There\\'ll Be Some Changes Made and Gregory Sierra as Julio makes his last in \"The Stung\"; guest stars include Billy Eckstine and Scatman Crothers.', \"Sanford and Son'\", 's fourth season can be viewed as something of a swan song for the popular series; after a ratings dip and timeslot change in the fifth season, Foxx and Wilson would both depart the show by the sixth season, and the show was cancelled in 1977.', '--Paul Gaita', 'Sanford and Son: The Complete Fifth Season', 'Guest stars and more guest stars seem to be the theme of', \"Sanford and Son'\", 's very funny fifth season (1975-1976). The 25 episodes feature a parade of celebrities supporting stars Redd Foxx and Demond Wilson in guest and recurring roles, including John Larroquette and Robert Guillaume in', 'Steinberg and Son', \", a TV sitcom based on Fred and Lamont's life; Marlene Clark as Lamont's girlfriend June; Nancy (\", 'The Beverly Hillbillies', \") as Officer Hoppy's overprotective mom; and George Foreman, Merv Griffin, Steve Lawrence, and Eydie Gorme as themselves. The other addition to the series comes with the introduction of the Sanford Arms, a apartment built on former neighbor Julio's place, and which comes complete with a host of eccentric guests (the hotel, along with\", 'Sanford', 'stars LaWanda Page and Don Bexley, would be the focus of its own short-lived sitcom following', \"Sanford and Son'\", \"s cancellation in 1977).  Otherwise, it's business as usual at Fred and Lamont's junkyard, with the pair getting involved in bank robberies, earthquakes, and escort services, while still finding time to go camping (in the season finale, written by Garry Shandling). The sheer amount of laughs offered by season 5 was a strong reminder of why the show had remained so popular for four seasons; unfortunately, time slot changes and the disinterest of both leads would spell the show's demise only one season later.\", '--Paul Gaita']\n{'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Taylor, Nathaniel, Mayo, Whitman, Wilson, Demond, Foxx, Redd, Bexley, Don', 'Language': 'Unqualified', 'Number Of Discs': '17', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.5 inches; 11.2 Ounces', 'Item model number': '4313326', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '55 hours and 31 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Foxx, Redd, Wilson, Demond, Bexley, Don, Mayo, Whitman, Taylor, Nathaniel', 'Subtitles': 'English, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '17'}\nThis is a great show to watch !\nGreat show\nBenny Hill 1969 - 1985 Complete & Unadulterated\nRated:    PG-13    Format: DVD\nMovies & TV, Classic TV\n['Benny Hill collection 1969-1985']\n{'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Run time': '41 hours and 40 minutes', 'Language': 'Unqualified (Dolby Digital 2.0 Stereo)', 'Studio': 'A&E TV'}\nGreat if you are into this kind of humor\nVideo\nThe Magic School Bus: Greatest Original Episodes\nNone  (Actor, Director)    Format: DVD\nMovies & TV, 3-6 Years\n['WAHOO! Join Ms. Frizzle, Liz and the entire Magic School Bus gang in seven GREATEST ORIGINAL EPISODES of the Emmy Award-winning science-adventure series. The Bus will take you on a journey through space, the human body and even into the eye of a storm. Buckle up for all your favorite field trips!Episodes include: Inside Ralphie, For Lunch, Gets Lost In Space, The Busasaurus, Going Batty, Flexes Its Muscles, Kicks Up A Storm']\n{'Genre': 'Kids & Family/Animation', 'Format': 'Full Screen, NTSC, Widescreen', 'Contributor': 'None', 'Language': 'English', 'Runtime': '2 hours and 34 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'None', 'Media Format': 'Full Screen, NTSC, Widescreen', 'Run time': '2 hours and 34 minutes', 'Release date': 'September 12, 2017', 'Actors': 'None', 'Studio': 'Scholastic', 'Number of discs': '1'}\nArrived on time. Kids just love this.\nGreat movie.\nSchoolhouse Rock! (Special 30th Anniversary Edition)\nLauren Yohe  (Actor),     Bob Kaliban  (Actor),     Tom Warburton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n['Schoolhouse Rock!, the timeless collection of animated songs that taught an entire generation that \"knowledge is power\" is on DVD for in this Ultimate Collector\\'s Edition 2-disc set. Now every day can feel like Saturday morning as you sing along with \"I\\'m Just A Bill,\" \"Three Is A Magic Number,\" \"Interjections!\" and the rest of your favorite tunes. Featuring an additional catchy animated song by the original series\\' creators, the 30th Anniversary Edition DVD rocks your house.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Tom Warburton, Sue Manchester, Maeretha Stewart, Bob Kaliban, Darrel Stern, Lauren Yohe, Joshie Armstead, Mary Sue Berry, Lori Lieberman, Christine LangnerTom Warburton, Sue Manchester, Maeretha Stewart, Bob Kaliban, Darrel Stern, Lauren Yohe, Joshie Armstead, Mary Sue Berry, Lori Lieberman, Christine Langner  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '4 hours and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '2304803', 'Director': 'Tom Warburton', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC', 'Run time': '4 hours and 43 minutes', 'Release date': 'August 27, 2002', 'Actors': 'Lauren Yohe, Bob Kaliban, Darrel Stern, Joshie Armstead, Mary Sue Berry', 'Studio': 'ABC STUDIOS', 'Number of discs': '2'}\nI grew up with this . Great for kids . Love it\nGreat!!\nThe Chronicles of Narnia: Prince Caspian\nBen Barnes  (Actor),     Georgie Henley  (Actor),     Andrew Adamson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', \"The magical world of C.S. Lewis' beloved fantasy comes to life once again in PRINCE CASPIAN, the second installment of THE CHRONICLES OF NARNIA series. Join Peter, Susan, Edmund, Lucy, the mighty and majestic Aslan, friendly new Narnian creatures and Prince Caspian as they lead the Narnians on a remarkable journey to restore peace and glory to their enchanted land. Continuing the adventure of THE LION, THE WITCH AND THE WARDROBE with more magic and a brand-new hero, PRINCE CASPIAN is a triumph of imagination, courage, love, joy and humor your whole family will want to watch again and again. The Chronicles of Narnia, Narnia, and all other book titles, characters and locales original thereto are trademarks of C.S. Lewis Pte Ltd. and are used with permission. (c) Disney/Walden\", 'Amazon.com', 'More exciting than The Lion, the Witch, and the Wardrobe,', 'The Chronicles of Narnia: Prince Caspian', \"continues the movie franchise based on C.S. Lewis' classic fantasy books. The movie picks up where the first left off... sort of. It's been a year since the Pevensie children--Peter (William Moseley), Susan (Anna Popplewell), Edmund (Skandar Keynes), and Lucy (Georgie Henley)--returned to England from Narnia, and they've just about resigned themselves to living their ordinary lives. But just like that, they're once again transported to a fantastical land, but one with a long-abandoned castle. It turns out that they are in Narnia again--and they themselves lived in that castle, but hundreds of years ago in Narnia time. They've been summoned back to help Prince Caspian (Stardust's Ben Barnes, resembling a young, cultured Keanu Reeves), the rightful heir to the throne who's become the target of his power-hungry uncle, King Mraz (Sergio Castellitto). And he's not the only one threatened: Mraz's people, the Telmarines, have pushed all the Narnians--the talking animals, the centaurs and other beasts, the walking trees--to the brink of extinction. Despite some alpha-male bickering, Peter and Caspian agree to fight Mraz alongside the remaining Narnians, including the dwarf Trumpkin (Peter Dinklage) and the swashbuckling mouse Reepicheep (voiced by Eddie Izzard). (Also appearing is Warwick Davis, who was in Willow and the 1989 BBC Prince Caspian.) But of course they most of all miss the noble lion, Aslan, who would have never let this happen to Narnia if he hadn't disappeared. Prince Caspian is epic, evoking memories of Peter Jackson's Lord of the Rings films. (Some of the battle elements may seem too familiar, but they were in Lewis's book.) And it's appropriate for kids (Reepicheep could have come out of a Shrek movie), though the tone is dark and there is a lot of death, albeit bloodless. After two successful films, Disney and Walden Media's franchise has proved successful enough that many of the characters are scheduled to return in The Voyage of the Dawn Treader. --\", 'David Horiuchi', 'Stills from', 'The Chronicles of Narnia: Prince Caspian', '(Click for larger image)']\n{'Genre': 'Fantasy', 'Format': 'NTSC, Color, Widescreen, Subtitled, Multiple Formats', 'Contributor': 'Vincent Grass, Anna Popplewell, Skandar Keynes, Georgie Henley, Cornell John, Predrag Bjelac, Liam Neeson, Shane Rangi, Peter Dinklage, Pierfrancesco Favino, Alicia Borrachero, William Moseley, SimÃ³n Andreu, Sergio Castellitto, Andrew Adamson, Warwick Davis, Ben Barnes, Damián AlcázarVincent Grass, Anna Popplewell, Skandar Keynes, Georgie Henley, Cornell John, Predrag Bjelac, Liam Neeson, Shane Rangi, Peter Dinklage, Pierfrancesco Favino, Alicia Borrachero, William Moseley, SimÃ³n Andreu, Sergio Castellitto, Andrew Adamson, Warwick Davis, Ben…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '786936735437', 'Director': 'Andrew Adamson', 'Media Format': 'NTSC, Color, Widescreen, Subtitled, Multiple Formats', 'Run time': '2 hours and 29 minutes', 'Release date': 'December 2, 2008', 'Actors': 'Ben Barnes, Georgie Henley, Anna Popplewell, William Moseley, Skandar Keynes', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie\nGreat movie\nLooney Tunes Video Show 2 [VHS]\nMel Blanc  (Actor),     Bea Benaderet  (Actor),     Arthur Davis  (Director),     Chuck Jones  (Director, Writer)    &                   1                  more   Rated:    G    Format: VHS Tape\nMovies & TV, Spanish Language, Infantil y familiar, Feature Films\n['Looney Tunes Video Show 2 [VHS]']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Arthur Davis, Chuck Jones, Friz Freleng, Hawley Pratt, Robert McKimson', 'Release date': 'December 2, 1994', 'Date First Available': 'October 26, 2006', 'Actors': 'Mel Blanc, Bea Benaderet, June Foray, Robert C. Bruce', 'Studio': 'Warner Home Video', 'Producers': 'David H. DePatie, Edward Selzer, Friz Freleng', 'Writers': 'Carl Kohler, Charles McKimson, Chuck Jones, John W. Dunn, Sid Marcus'}\nKids love watching this video\nGreat video",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Hart to Hart - The Complete Second Season\nReview Date: 2015/03/08\nStore: Robert Wagner  (Actor),     Stefanie Powers  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['The world’s most glamorous amateur sleuths are back for more mystery, fun and danger in the second sensational season of HART TO HART, starring Robert Wagner and Stefanie Powers. In 20 captivating cases ranging from kidnapping and robbery to industrial espionage and murder, romantic jetsetters Jonathan and Jennifer Hart risk life, limb and lifestyle to solve the most unsolvable of crimes. Featuring Lionel Stander as their faithful sidekick, Max, and a first class line-up of suspects and victims, HART TO HART: THE COMPLETE SECOND SEASON is a rich and sexy blend of adventure, intrigue and excitement. This top-rated classic was executive produced by TV powerhouses Aaron Spelling and Leonard Goldberg.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 10.4 Ounces', 'Item model number': '2227443', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '16 hours and 27 minutes', 'Release date': 'September 19, 2006', 'Actors': 'Robert Wagner, Stefanie Powers, Lionel Stander', 'Dubbed': 'Portuguese', 'Subtitles': 'Portuguese', 'Producers': 'Mart Crowley', 'Language': 'Portuguese (Dolby Digital 1.0), English (Dolby Digital 1.0)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '5'}\nReview Text: Perfect condition\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hart To Hart: Season 3\nReview Date: 2015/03/08\nStore: Robert Wagner  (Actor),     Stefanie Powers  (Actor),     Tom Mankiewicz  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: ['Robert Wagner (IT TAKES A THIEF) and Stefanie Powers (THE GIRL FROM U.N.C.L.E.) star in HART TO HART: SEASON THREE, a 24-episode collection of the stylish Emmy and Golden Globe-nominated detective drama. As Jonathan and Jennifer Hart, a wealthy and glamorous couple who always manage to find themselves caught up in mystery and adventure, Wagner and Powers charmed audiences with their lighthearted chemistry and thrilling adventures. Assisting the Harts in their jet-setting life of intrigue, the loyal and gravel-voiced servant Max (Lionel Stander) provided an earthy counterpoint to the elegance of his employers. Together, the three made for a team that viewers found irresistible. Created by Sidney Sheldon, both a bestselling novelist (MASTER OF THE GAME, WINDMILLS OF THE GODS) and hit television producer (I DREAM OF JEANNIE, THE PATTY DUKE SHOW), HART TO HART is a smart and sexy detective drama. Join the Harts on their globetrotting tour of danger and romance with HART TO HART: SEASON THREE.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Full Screen, NTSC', 'Contributor': 'Tom Mankiewicz, Lionel Stander, Robert Wagner, Stefanie Powers', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.24 Ounces', 'Item model number': '30473659', 'Director': 'Tom Mankiewicz', 'Media Format': 'Multiple Formats, Box set, Full Screen, NTSC', 'Run time': '19 hours', 'Release date': 'December 9, 2014', 'Actors': 'Robert Wagner, Stefanie Powers, Lionel Stander', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: Perfect condition\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Seinfeld: The Complete Series\nReview Date: 2017/10/14\nStore: Jerry Seinfeld  (Actor),     Julia Louis-Dreyfus  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Seinfeld stars Jerry Seinfeld as a stand-up comedian whose life in New York City is made even more chaotic by his quirky group of friends who join him in wrestling with life\\'s most perplexing, yet often trivial questions. Often described as \"a show about nothing,\" Seinfeld mines the humor in life\\'s mundane situations like waiting in line, searching for a lost item, or the trials and tribulations of dating. Co-starring are Julia Louis-Dreyfus as Jerry\\'s ex-girlfriend and current platonic pal, Elaine Benes; Jason Alexander as George Costanza, Jerry\\'s neurotic hard-luck best friend; and Michael Richards as Jerry\\'s eccentric neighbor, Kramer. This highly renowned sitcom set the bar in comedy with some of the most hilariously watchable characters in television history.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, NTSC, Box set', 'Contributor': 'Jason Alexander, Michael Richards, Jerry Seinfeld, Julia Louis-Dreyfus', 'Language': 'English', 'Number Of Discs': '33', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '3.1 x 5.9 x 7.8 inches; 1.81 Pounds', 'Audio Description': 'English', 'Item model number': '043396428768', 'Media Format': 'Color, NTSC, Box set', 'Release date': 'November 5, 2013', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander', 'Subtitles': 'English', 'Studio': 'Sony Pictures Entertainment', 'Number of discs': '33'}\nReview Text: DVDs are in very good condition!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sanford and Son: The Complete Series (Slim Packaging)\nReview Date: 2019/01/14\nStore: Foxx, Redd  (Actor),     Wilson, Demond  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Sanford and Son', 'An early milestone in urban TV comedy,', 'Sanford and Son', 'was an immediate critical and audience favorite when it debuted in the early \\'70s, signaling the arrival of one of TV\\'s most memorable characters: Cantankerous-but-lovable junk dealer Fred Sanford (Redd Foxx). An African American answer to \"Archie Bunker,\" widower Sanford and his \"Dummy\" son Lamont (Demond Wilson) run a family junk business in Watts, dreaming up schemes to strike it rich. Outspoken and outrageous, Sanford serves up big laughs as he skewers stereotypes, forever threatening, \"How\\'d you like one across your lip?\" Aided by a colorful cast that includes acid-tongued Aunt Esther (LaWanda Page),', 'Sanford and Sons', 'provided a showcase of black talent of all generations, featuring guest stars like Lena Horne and episodes written by Richard Pryor. Timely and topical during its highly-rated five-year run (1972-1977),', 'Sanford and Son', \"emerged as one of the decade's biggest TV hits, inspiring producer Norman Lear to develop more barrier-breaking shows like\", 'The Jeffersons', 'and', 'Good Times', '.', 'Amazon.com', 'Sanford and Son: The Complete Second Season', 'Sanford and Son', \"'s second season began on September 15, 1972. The sitcom quickly vaulted to the No. 2 spot on the network ratings--right behind creators Norman Lear and Bud Yorkin's previous effort,\", 'All in the Family', '. The second season brought no changes to the show\\'s basic format--comedian Redd Foxx remained the focus as cantankerous junkman Fred Sanford, with Demond Wilson as his son and perennial foil, Lamont. What the second season did bring was several new characters and some of the series\\' funniest episodes. The second season supporting cast was filled out by some of Foxx\\'s fellow comics, including Leroy and Skillet (\"A Visit from Lena Horne\") and LaWanda Page as Aunt Esther, who became a recurring character after \"The Big Party.\" Also joining was Don Bexley as Bubba (\"By the Numbers\"), Nathaniel Taylor as Rollo (\"Have Gun, Will Sell\"), and', 'Barney Miller', '\\'s Gregory Sierra as neighbor Julio (\"The Puerto Ricans Are Coming!\").  But', 'Sanford and Son', \"'s strength remained in Foxx's sharp-tongued and often improvised performance, which was ably abetted by the scripts (a number of plotlines were taken directly from\", 'Steptoe and Son', ', the U.K. series that inspired', 'Sanford', '). Richard Pryor and Paul Mooney penned two of the collection\\'s most laugh-filled half-hours, \"The Dowry\" and \"Sanford and Son and Sister Make Three,\" but every episode has its share of hilarity thanks to Foxx and his costars. Though only English and Spanish subtitles are offered as extras, series fans should be pleased with the set, especially as a reference for Fred\\'s best zingers (\"I\\'m gonna stick your face in a bowl full of dough and make gorilla cookies!\").', '--Paul Gaita', 'Sanford and Son: The Complete Third Season', 'Though conflict erupted between comic Redd Foxx and the producers of', 'Sanford and Son', \"during its third season, viewers are spared the backstage rancor and instead enjoy more hilarious episodes, fueled as always by Foxx's Emmy-nominated performance as cantankerous junkman Fred Sanford.\", 'Sanford and Son', \"was a solid ratings hit as it entered its third season (ranked third among network shows) and Foxx had won a Golden Globe the previous year, but a contract dispute had driven a wedge between him and series producers Bud Yorkin and Norman Lear (who also ran the season's top-rated program,\", 'All in the Family', '). Negotiations would eventually break down, and Foxx would be absent from six episodes (Fred was said to be visiting relatives in St. Louis) and did not return to the show until season 4 was underway. Foxx\\'s departure allowed the spotlight to shine more brightly on co-star Demond Wilson (who would soon launch his own contract disputes, which prompted his leaving the series in 1976) as well as new cast member Whitman Mayo, who joined the show that season as Fred\\'s pal Grady. While series aficionados are firmly divided over Grady, Mayo is quite funny, especially during the final six episodes (in particular \"Will the Real Fred Sanford Please Stand Up?\" and season closer \"Hello Cousin Emma, Goodbye Cousin Emma\"). Other standout episodes include \"The Blind Mellow Jelly Collection\" (in which Fred attempts to reclaim his donated record collection) and \"Fred Sanford, Legal Eagle\" (Fred defends Lamont in traffic court), which features', 'Starsky and Hutch', \"'s Antonio Fargas. The third-season scripts, penned mostly by story editor Ilunga Adell (\", 'Moesha', \"), remain sharp, as does the direction (the lion's share is handled by Peter Baldwin, though Bud Yorkin helms two episodes). Fans and first-timers alike will find plenty of laughs, which unfortunately lack any extras.\", '--Paul Gaita', 'Sanford and Son: The Complete Fourth Season', \"Sanford and Son'\", \"s fourth season (1974-1975) was the highest rated of its five years on network TV (the program reached no. 2 on the Nielsen charts); the program and star Redd Foxx both received Emmy and Golden Globe nominations for the season. Behind the scenes, however, the series was in turmoil due to Foxx's dissatisfaction with the tone and quality of the program, and he went missing from nine episodes, three of which kick off the first disc (Fred's absence is explained away as a trip to St. Louis).  But even without Foxx,\", 'Sanford and Son', 'still managed to generate plenty of laughs, thanks in no small part to its hard-working supporting cast; Whitman Mayo\\'s Grady, in particular, gets plenty of chances to shine, especially in \"Grady and His Lady\" and \"The Family Man\" (which served as the pilot for Mayo\\'s own short-lived series). Pat Morita\\'s Ah Chew makes his first appearance in \"There\\'ll Be Some Changes Made and Gregory Sierra as Julio makes his last in \"The Stung\"; guest stars include Billy Eckstine and Scatman Crothers.', \"Sanford and Son'\", 's fourth season can be viewed as something of a swan song for the popular series; after a ratings dip and timeslot change in the fifth season, Foxx and Wilson would both depart the show by the sixth season, and the show was cancelled in 1977.', '--Paul Gaita', 'Sanford and Son: The Complete Fifth Season', 'Guest stars and more guest stars seem to be the theme of', \"Sanford and Son'\", 's very funny fifth season (1975-1976). The 25 episodes feature a parade of celebrities supporting stars Redd Foxx and Demond Wilson in guest and recurring roles, including John Larroquette and Robert Guillaume in', 'Steinberg and Son', \", a TV sitcom based on Fred and Lamont's life; Marlene Clark as Lamont's girlfriend June; Nancy (\", 'The Beverly Hillbillies', \") as Officer Hoppy's overprotective mom; and George Foreman, Merv Griffin, Steve Lawrence, and Eydie Gorme as themselves. The other addition to the series comes with the introduction of the Sanford Arms, a apartment built on former neighbor Julio's place, and which comes complete with a host of eccentric guests (the hotel, along with\", 'Sanford', 'stars LaWanda Page and Don Bexley, would be the focus of its own short-lived sitcom following', \"Sanford and Son'\", \"s cancellation in 1977).  Otherwise, it's business as usual at Fred and Lamont's junkyard, with the pair getting involved in bank robberies, earthquakes, and escort services, while still finding time to go camping (in the season finale, written by Garry Shandling). The sheer amount of laughs offered by season 5 was a strong reminder of why the show had remained so popular for four seasons; unfortunately, time slot changes and the disinterest of both leads would spell the show's demise only one season later.\", '--Paul Gaita']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Taylor, Nathaniel, Mayo, Whitman, Wilson, Demond, Foxx, Redd, Bexley, Don', 'Language': 'Unqualified', 'Number Of Discs': '17', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.5 inches; 11.2 Ounces', 'Item model number': '4313326', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '55 hours and 31 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Foxx, Redd, Wilson, Demond, Bexley, Don, Mayo, Whitman, Taylor, Nathaniel', 'Subtitles': 'English, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '17'}\nReview Text: This is a great show to watch !\nReview Title: Great show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Benny Hill 1969 - 1985 Complete & Unadulterated\nReview Date: 2019/01/14\nStore: Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Classic TV\nProduct Description: ['Benny Hill collection 1969-1985']\nAverage Rating: 5.0\nProduct Details: {'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Run time': '41 hours and 40 minutes', 'Language': 'Unqualified (Dolby Digital 2.0 Stereo)', 'Studio': 'A&E TV'}\nReview Text: Great if you are into this kind of humor\nReview Title: Video\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Magic School Bus: Greatest Original Episodes\nReview Date: 2019/04/03\nStore: None  (Actor, Director)    Format: DVD\nCategories: Movies & TV, 3-6 Years\nProduct Description: ['WAHOO! Join Ms. Frizzle, Liz and the entire Magic School Bus gang in seven GREATEST ORIGINAL EPISODES of the Emmy Award-winning science-adventure series. The Bus will take you on a journey through space, the human body and even into the eye of a storm. Buckle up for all your favorite field trips!Episodes include: Inside Ralphie, For Lunch, Gets Lost In Space, The Busasaurus, Going Batty, Flexes Its Muscles, Kicks Up A Storm']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family/Animation', 'Format': 'Full Screen, NTSC, Widescreen', 'Contributor': 'None', 'Language': 'English', 'Runtime': '2 hours and 34 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'None', 'Media Format': 'Full Screen, NTSC, Widescreen', 'Run time': '2 hours and 34 minutes', 'Release date': 'September 12, 2017', 'Actors': 'None', 'Studio': 'Scholastic', 'Number of discs': '1'}\nReview Text: Arrived on time. Kids just love this.\nReview Title: Great movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Schoolhouse Rock! (Special 30th Anniversary Edition)\nReview Date: 2019/04/03\nStore: Lauren Yohe  (Actor),     Bob Kaliban  (Actor),     Tom Warburton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, Special Editions\nProduct Description: ['Schoolhouse Rock!, the timeless collection of animated songs that taught an entire generation that \"knowledge is power\" is on DVD for in this Ultimate Collector\\'s Edition 2-disc set. Now every day can feel like Saturday morning as you sing along with \"I\\'m Just A Bill,\" \"Three Is A Magic Number,\" \"Interjections!\" and the rest of your favorite tunes. Featuring an additional catchy animated song by the original series\\' creators, the 30th Anniversary Edition DVD rocks your house.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Tom Warburton, Sue Manchester, Maeretha Stewart, Bob Kaliban, Darrel Stern, Lauren Yohe, Joshie Armstead, Mary Sue Berry, Lori Lieberman, Christine LangnerTom Warburton, Sue Manchester, Maeretha Stewart, Bob Kaliban, Darrel Stern, Lauren Yohe, Joshie Armstead, Mary Sue Berry, Lori Lieberman, Christine Langner  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '4 hours and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '2304803', 'Director': 'Tom Warburton', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC', 'Run time': '4 hours and 43 minutes', 'Release date': 'August 27, 2002', 'Actors': 'Lauren Yohe, Bob Kaliban, Darrel Stern, Joshie Armstead, Mary Sue Berry', 'Studio': 'ABC STUDIOS', 'Number of discs': '2'}\nReview Text: I grew up with this . Great for kids . Love it\nReview Title: Great!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Chronicles of Narnia: Prince Caspian\nReview Date: 2019/07/28\nStore: Ben Barnes  (Actor),     Georgie Henley  (Actor),     Andrew Adamson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', \"The magical world of C.S. Lewis' beloved fantasy comes to life once again in PRINCE CASPIAN, the second installment of THE CHRONICLES OF NARNIA series. Join Peter, Susan, Edmund, Lucy, the mighty and majestic Aslan, friendly new Narnian creatures and Prince Caspian as they lead the Narnians on a remarkable journey to restore peace and glory to their enchanted land. Continuing the adventure of THE LION, THE WITCH AND THE WARDROBE with more magic and a brand-new hero, PRINCE CASPIAN is a triumph of imagination, courage, love, joy and humor your whole family will want to watch again and again. The Chronicles of Narnia, Narnia, and all other book titles, characters and locales original thereto are trademarks of C.S. Lewis Pte Ltd. and are used with permission. (c) Disney/Walden\", 'Amazon.com', 'More exciting than The Lion, the Witch, and the Wardrobe,', 'The Chronicles of Narnia: Prince Caspian', \"continues the movie franchise based on C.S. Lewis' classic fantasy books. The movie picks up where the first left off... sort of. It's been a year since the Pevensie children--Peter (William Moseley), Susan (Anna Popplewell), Edmund (Skandar Keynes), and Lucy (Georgie Henley)--returned to England from Narnia, and they've just about resigned themselves to living their ordinary lives. But just like that, they're once again transported to a fantastical land, but one with a long-abandoned castle. It turns out that they are in Narnia again--and they themselves lived in that castle, but hundreds of years ago in Narnia time. They've been summoned back to help Prince Caspian (Stardust's Ben Barnes, resembling a young, cultured Keanu Reeves), the rightful heir to the throne who's become the target of his power-hungry uncle, King Mraz (Sergio Castellitto). And he's not the only one threatened: Mraz's people, the Telmarines, have pushed all the Narnians--the talking animals, the centaurs and other beasts, the walking trees--to the brink of extinction. Despite some alpha-male bickering, Peter and Caspian agree to fight Mraz alongside the remaining Narnians, including the dwarf Trumpkin (Peter Dinklage) and the swashbuckling mouse Reepicheep (voiced by Eddie Izzard). (Also appearing is Warwick Davis, who was in Willow and the 1989 BBC Prince Caspian.) But of course they most of all miss the noble lion, Aslan, who would have never let this happen to Narnia if he hadn't disappeared. Prince Caspian is epic, evoking memories of Peter Jackson's Lord of the Rings films. (Some of the battle elements may seem too familiar, but they were in Lewis's book.) And it's appropriate for kids (Reepicheep could have come out of a Shrek movie), though the tone is dark and there is a lot of death, albeit bloodless. After two successful films, Disney and Walden Media's franchise has proved successful enough that many of the characters are scheduled to return in The Voyage of the Dawn Treader. --\", 'David Horiuchi', 'Stills from', 'The Chronicles of Narnia: Prince Caspian', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Fantasy', 'Format': 'NTSC, Color, Widescreen, Subtitled, Multiple Formats', 'Contributor': 'Vincent Grass, Anna Popplewell, Skandar Keynes, Georgie Henley, Cornell John, Predrag Bjelac, Liam Neeson, Shane Rangi, Peter Dinklage, Pierfrancesco Favino, Alicia Borrachero, William Moseley, SimÃ³n Andreu, Sergio Castellitto, Andrew Adamson, Warwick Davis, Ben Barnes, Damián AlcázarVincent Grass, Anna Popplewell, Skandar Keynes, Georgie Henley, Cornell John, Predrag Bjelac, Liam Neeson, Shane Rangi, Peter Dinklage, Pierfrancesco Favino, Alicia Borrachero, William Moseley, SimÃ³n Andreu, Sergio Castellitto, Andrew Adamson, Warwick Davis, Ben…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1 EX)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '786936735437', 'Director': 'Andrew Adamson', 'Media Format': 'NTSC, Color, Widescreen, Subtitled, Multiple Formats', 'Run time': '2 hours and 29 minutes', 'Release date': 'December 2, 2008', 'Actors': 'Ben Barnes, Georgie Henley, Anna Popplewell, William Moseley, Skandar Keynes', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great movie\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Looney Tunes Video Show 2 [VHS]\nReview Date: 2022/09/25\nStore: Mel Blanc  (Actor),     Bea Benaderet  (Actor),     Arthur Davis  (Director),     Chuck Jones  (Director, Writer)    &                   1                  more   Rated:    G    Format: VHS Tape\nCategories: Movies & TV, Spanish Language, Infantil y familiar, Feature Films\nProduct Description: ['Looney Tunes Video Show 2 [VHS]']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Arthur Davis, Chuck Jones, Friz Freleng, Hawley Pratt, Robert McKimson', 'Release date': 'December 2, 1994', 'Date First Available': 'October 26, 2006', 'Actors': 'Mel Blanc, Bea Benaderet, June Foray, Robert C. Bruce', 'Studio': 'Warner Home Video', 'Producers': 'David H. DePatie, Edward Selzer, Friz Freleng', 'Writers': 'Carl Kohler, Charles McKimson, Chuck Jones, John W. Dunn, Sid Marcus'}\nReview Text: Kids love watching this video\nReview Title: Great video\nRating: 4.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe purchase history reveals a strong preference for classic television shows and movies, particularly from the comedy and mystery genres. The individual consistently rates products above average, indicating a genuine satisfaction with their selections. Titles like detective dramas and sitcoms suggest a fondness for light-hearted storytelling, familial themes, and nostalgia. \n\nA recurring theme is the enjoyment of ensemble casts and charismatic lead performances, particularly those from the '70s and '80s. Additionally, high ratings for children's programming also point to an interest in family-friendly content, implying a buyer who appreciates entertainment suitable for younger audiences.\n\nQuality is a significant factor, as evidenced by positive comments about the condition of DVDs and overall satisfaction with purchases, even when ratings vary. Price sensitivity appears moderate; the individual favors collections or box sets, suggesting value-driven choices for extensive viewing experiences.\n\nIn summary, this purchaser favors classic comedies, engaging storytelling, nostalgic entertainment, and content appealing to both adults and children. They prioritize quality in their purchases while enjoying the sentimental aspects of their collections.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Good movie!",
    "text": "Kids love watching this cartoon",
    "images": [],
    "asin": "6301290925",
    "parent_asin": "6301290925",
    "user_id": "AFYEQGWZLEEM3VICX4K7GEITCNDQ",
    "timestamp": "2022-09-25 18:00:19.442000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Walt Disney Cartoon Classics, V. 12: Nuts About Chip 'N' Dale [VHS]",
    "average_rating": 4.2,
    "rating_number": 24,
    "features": [],
    "description": [
      "VHS from Buena Vista / Disney in slip case, as pictured, a collection of cartoons of those two lovable chipmunks - Chip 'n' Dale"
    ],
    "price": null,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/21YEEA5EX9L._AC_SR38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/21YEEA5EX9L._AC_.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Format: VHS Tape",
    "categories": [
      "Movies & TV",
      "Disney Home Video",
      "All Disney Titles"
    ],
    "details": {
      "Genre": "Kids & Family",
      "Format": "Closed-captioned, Color, NTSC",
      "Contributor": "Chip & Dale",
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "7.32 x 4.19 x 1.12 inches; 6.08 Ounces",
      "Release date": "June 16, 1992",
      "Date First Available": "June 16, 2006",
      "Actors": "Chip & Dale",
      "Studio": "Disney Studios"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}