{
  "user_id": "AGEGRCKAVOOM2RWMHNQZATHZTUXA",
  "summary": "=== Purchase Information ===\nProduct Title: Don't Go Near The Water (Remastered)\nReview Date: 2011/12/16\nStore: Charles Walters  (Director),     Glenn Ford  (Actor),     Gia Scala  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: [\"They also serve who only sit and type! Hollywood brought audiences to atten-hut! in the 1950s and '60s with a string of military comedies like Mr. Roberts, Operation Petticoat, Ensign Pulver, No Time for Sergeants and this splash into the typing pool of dry-land sailors -- a Navy publicity team in the World War II Pacific. Glenn Ford, who appeared in a fistful of the era's service comedies, stars as a lieutenant with a knack for PR activities like placating big shots, calming romantic waters, deflating puffed-up journalists and puffing a profane-mouthed gob into the public's idea of the perfect enlisted man. Also in the large, shipshape cast: Anne Francis, Keenan Wynn and Mickey Shaughnessy.\"]\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC, Original recording remastered', 'Contributor': 'Glenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ TamblynGlenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ Tamblyn   See more', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.12 Ounces', 'Director': 'Charles Walters', 'Media Format': 'NTSC, Original recording remastered', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 1, 2011', 'Actors': 'Glenn Ford, Gia Scala, Earl Holliman, Anne Francis, Keenan Wynn', 'Studio': 'MGM', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This has always been one of my favorite movies. I was so happy to see it finally release on DVD.  However, Warner Brothers could have done a much better job on the DVD.  It is shown in a 2.35:1 widescreen format.  I believe that Amazon said 1.78:1, which is incorrect.  The case says remastered, but I found the quality of the picture way below what it should be.  The picture is grainy and the sound is only so-so.  For the price, I was expecting better.  There are NO SUBTITLES.  You would think if it was \"remastered\" they could at least add that feature.  Having said all this, the movie is still a hoot.  Glad to add it to my dvd collection.  They just don't make them this entertaining anymore.\nReview Title: WB could have done better!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: WKRP in Cincinnati: The Complete Series [DVD]\nReview Date: 2014/09/17\nStore: Howard Hesseman  (Actor),     Frank Bonner  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', \"Pairing an impeccable ensemble cast with hilarious wit and popular tunes, WKRP in Cincinnati celebrated four amazing seasons, making it the quintessential situation comedy for any music lover! Join everyone's favorite radio DJs—the rockin' Dr. Johnny Fever (Howard Hesseman) and the soulful Venus Flytrap (Tim Reid)—as they weave through the inner-office antics of the crazy WKRP staff including the station's steady program director Andy (Gary Sandy), indecisive manager Carlson (Gordon Jump), smarmy advertising executive Herb (Frank Bonner), quirky news man Les Nessman (Richard Sanders), shy ingénue Bailey (Jan Smithers) and, of course, the station's lovely receptionist, Jennifer (Loni Anderson). So sit back and enjoy the sound of uproarious laughter as you watch all 90 episodes of this iconic series!\", 'Bonus Content:', 'Disc 13:', 'WKRP in Cincinnati: A Paley Center Reunion', 'WKRP in Cincinnati: A Paley Center Reunion', '\"Do My Eyes Say Yes?\" Featurette', '\"Do My Eyes Say Yes?\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', 'A Conversation with Gary Sandy', 'A Conversation with Gary Sandy', ']]>', 'Review', 'Shout! Factory has done yeoman’s work in trying to correct this with', 'WKRP in Cincinnati: The Complete Series', '...The image quality, considering this series was originally shot on video tape, is almost uniformly outstanding. And, once again, Andy is overseeing a station playing the likes of Bruce Springsteen, the Rolling Stones, AC/DC, the Grateful Dead, Tom Petty, Elvis Costello, the Cars, Wings and the Police, instead of a series of featureless Muzak tracks.  Nick DeRiso -Nick DeRisosomethingelsereviews.com']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'DVD', 'Contributor': 'Richard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim ReidRichard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim Reid  See more', 'Language': 'English', 'Number Of Discs': '12', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.45 Pounds', 'Item model number': 'generic', 'Media Format': 'DVD', 'Run time': '37 hours and 30 minutes', 'Release date': 'April 17, 2018', 'Actors': 'Howard Hesseman, Frank Bonner, Gary Sandy, Tim Reid, Richard Sanders', 'Subtitles': 'Afrikaans', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '12'}\nReview Text: This was a great series for sure and the music is important to me.  However, I also want a great picture.  Too many of the Shout Factory TV series releases video and sound quality have been poor.  I just watched a video teaser on the Shout website and if this is the same quality as the actual release, we are all in for a real treat.  This looks so much better than the original TV broadcasts.  Can't wait to see this.....\nReview Title: Music important, but so is picture quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Big Bang Theory: Season 8\nReview Date: 2016/02/11\nStore: Johnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley CuocoMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley Cuoco   See more', 'Initial release date': '2015-09-15', 'Language': 'English'}\nReview Text: What can I say?  This is my favorite show.  Picture quality is excellent.  Nice not to have to look at station logos, pop-ups and commercials as when originally aired.  Looking forward to buying season 9.\nReview Title: My favorite show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: Season 4\nReview Date: 2016/06/02\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['The Middle: The Complete Fourth Season', 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher and Atticus Shaffer star as the middle class, middle of the country (i.e. Orson, Indiana) Heck family in this warm and witty comedy about raising a family and lowering your expectations. While Frankie continues to struggle selling cars at the only remaining car dealer in town, an unexpected turn of events might force her to reevaluate her career path. Axl’s slothlike days are numbered, now that Mike’s made it his mission to ensure that his oldest son somehow earns a sports scholarship and goes to college next year. Meanwhile, Sue’s not only navigating high school, but wants to navigate Indiana roads – by getting her driver’s license. It’s no wonder that youngest son Brick keeps his nose in a book!', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn HelinePatricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn Heline   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '883929373925', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Run time': '8 hours and 32 minutes', 'Release date': 'February 25, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'Spanish, French, English', 'Producers': 'DeAnn Heline, Eileen Heisler', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Either you like this show, or you hate it.  I like it a lot.  Laugh out loud several time every episode.  Video and audio quality is excellent.\nReview Title: Funny, Funny, Funny\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: The Complete Fifth Season\nReview Date: 2016/06/02\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['The quirky misadventures of one of the Heartland’s most hilarious families continue as the middle returns for a fifth fitful season… and family dynamics have never been funnier. As the middle-aged, middle-class, middle of the country mom, Frankie Heck (Patricia Heaton) tackles the mundane chaos of everyday life, her kids – recent high school graduate Axl (Charlie McDermott), sophomore Sue (Eden Sher) and the quirky middle-schooler Brick (Atticus Shaffer) – are continually manufacturing drama, while her laconic husband, Mike (Neal Flynn) offers support from the sidelines (re. the living room couch). Juggling her new job as a dental assistant with school projects, teenage theatrics and a husband in emotional low gear, Frankie struggles to use her wry wit and sense of humor to get her family through each day intact. But through all the madness, the Hecks muddle through…and together they’re keeping the middle on the map.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Eden Sher, Neil Flynn, Atticus Shaffer, Charlie Mcdermott', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '1000532061', 'Media Format': 'NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 9, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie Mcdermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'English', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nReview Text: Super funny show.  Every season actually gets better in my opinion.  Audio and video quality is very good.\nReview Title: Still funny....\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hearts Afire - The Complete Series\nReview Date: 2016/08/02\nStore: John Ritter  (Actor),     Markie Post  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: ['Hearts Afire - The Complete Series 7-Disc DVD']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Contributor': 'Markie Post, John Ritter, Billy Bob Thornton', 'Language': 'English', 'Number Of Discs': '7', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8 Ounces', 'Item model number': '52888', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Run time': '21 hours and 44 minutes', 'Release date': 'January 8, 2013', 'Actors': 'John Ritter, Markie Post, Billy Bob Thornton', 'Studio': 'Mill Creek Ent', 'Number of discs': '7'}\nReview Text: I have just started watching this series on DVD for the first time.  So far, I like it.  However, the quality of the video is not what it should be.  Yes, this is an older series, but I have DVD's of much older series that look far superior.  I don't think any effort was taken to improve the picture quality by Mill Creek Entertainment.  For that reason I have deducted the one star.\nReview Title: Good, except for picture quality....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night Court: The Complete Ninth Season\nReview Date: 2016/08/03\nStore: Harry Anderson  (Actor),     John Larroquette  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Night Court's ninth and final season sees Judge Harry(HARRY ANDERSON) and company rethinking careers and companions, while Bull (RICHARD MOLL) stumbles through the wedding china on his way to matrimonial bliss. It's a good thing Bull has Harry, Mac (CHARLES ROBINSON), Roz (MARSHA WARFIELD) , Christine (MARKIE POST) and even Dan (JOHN LARROQUETTE) on hand to get him to the altar on time. While Harry considers a career in higher education, Christine takes a look at Congress as Dan rethinks his commitment to his primary field of interest (it's spelled S-E-X). Meanwhile ditzy-but-stunning court steno Lisette (JOLEEN LUTZ) is harboring a secret of her own, one that concerns a prominent member of the cast. And what on Earth do aliens want with Bull? Mel Torme, Gilbert Gottfried, and Stephen Root are all found among the season's memorable guest-stars. But as the final hour airs -- and the cast depart for different climes, whither Judge Harry? A 3-Disc, 22-Episode Collection.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Charles Robinson, John Larroquette, Markie Post, Marsha Warfield, Richard Moll, Harry Anderson', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '402621', 'Media Format': 'NTSC', 'Run time': '11 hours', 'Release date': 'June 11, 2013', 'Actors': 'Harry Anderson, John Larroquette, Markie Post, Richard Moll, Charles Robinson', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nReview Text: Just finished watching all nine seasons on DVD.  Pretty good series.  Nice to see how things were wrapped up the final season.  Glad I bought the whole series.\nReview Title: Still Funny....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night Court: The Complete Eighth Season\nReview Date: 2016/08/07\nStore: Harry Anderson  (Actor),     John Larroquette  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Originally conceived as the final season, Night Court's eighth hit year saw the show's creators moving some very long simmering subplots off the back burner and on the boil. As the season begins, Judge Harry (HARRY ANDERSON), DA Dan (JOHN LARROQUETTE), bailiff Bull (RICHARD MOLL), clerk Mac (CHARLES ROBINSON) and bailiff Roz (MARSHA WARFIELD) are welcoming Christine (MARKIE POST) back from maternity leave. The happy reunion is short-lived, however, as long-buried passions, secret guilts and long-lost relatives plunge the court into chaos. This being Night Court we are also treated to visits from a trick-or-treating Death (STEPHEN ROOT) and time travels with an angel (MEL TORME), and we brave a session at the horrific Day Court. By season's end, two characters may be unable to deny their love any longer in this 3-Disc, 24 Episode Collection.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'John Larroquette, Richard Moll, Harry Anderson', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '380233', 'Media Format': 'NTSC', 'Run time': '9 hours and 34 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Harry Anderson, John Larroquette, Richard Moll', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I have all nine seasons and find them all funny.  So much better than some of the newer shows.  I really think the show got even better when Markie Post joined the cast.\nReview Title: Still funny....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: The Complete Seventh Season\nReview Date: 2017/04/22\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"The Middle's seventh season sees each member of the Heck family breaking out of their comfort zones. Oldest son Axl (Charlie McDermott) begins his junior year, and the business major starts thinking seriously about his future. Daughter Sue (Eden Sher) starts her first year of college at the same campus that Axl attends -- much to his disgust -- with a new haircut and an even more optimistic outlook. Quirky youngest son Brick (Atticus Shaffer) begins his final year of middle school, and his equally quirky girlfriend, Cindy (Casey Burke), wants to take their romance to the next level -- holding hands! Finding themselves facing an emptier nest, Frankie (Patricia Heaton) wonders if her parental duties will ease up while Mike (Neil Flynn) finds himself in a bit of a midlife crisis -- shocking everyone by deciding to take some new chances. Could this finally be the year of the Hecks?\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Neil Flynn, Atticus Shaffer', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'NTSC', 'Run time': '8 hours and 48 minutes', 'Release date': 'November 15, 2016', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'English', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nReview Text: What can I say.  I like this series a lot and have all seasons on DVD.  Quality is fine.\nReview Title: A wonderful show.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Just Shoot Me!: The Complete Series\nReview Date: 2017/05/23\nStore: Laura San Giacomo  (Actor),     George Segal  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Box set, Color, NTSC, Full Screen', 'Contributor': 'Laura San Giacomo, David Spade, George Segal, Enrico Colantoni, Wendie Malick, Various', 'Language': 'English', 'Number Of Discs': '19', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Director': 'Various', 'Media Format': 'Box set, Color, NTSC, Full Screen', 'Run time': '54 hours and 28 minutes', 'Release date': 'September 5, 2017', 'Actors': 'Laura San Giacomo, George Segal, Wendie Malick, Enrico Colantoni, David Spade', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '19'}\nReview Text: While I am glad the entire 7 seasons will soon be available, it is a shame that now I have to buy duplicates of seasons 1,2,and 3 that I already purchase years ago.  So now no other choice if I want 4,5,6 and 7.<br />UPDATE:  9/22/17<br />Went ahead and got the full set.  Glad I did.  The picture quality is excellent.  Money well spent.\nReview Title: Great Show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bill Engvall Show: The Complete Second and Third Seasons\nReview Date: 2017/07/16\nStore: Bill Engvall  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Blue Collar Comedy Tour's breakout star Bill Engvall created, executive produces and stars as Bill Pearson, a family counselor who could use some counseling of his own to deal with his unconventional brood in this family-centered sitcom. TV titans Nancy Travis and Tim Meadows costar as wife and pal, while a pre-superstar Jennifer Lawrence (The Hunger Games) plays his precocious and pugnacious teenage daughter. Graham Patrick Martin and Skyler Gisondo round out the clan as Bill's boys: one a slacker, the other sly. This 3-Disc, 22-Episode Collection delivers up the remaining seasons of this TV favorite to a clamoring crowd of comedy fans hungry for some savory, old-fashioned family fare. In the final two seasons, the Pearsons face challenges both ordinary and unexpected, from the proper allowance to chore ratio and the horrors of prom to using Facebook to spy on your kids and a sudden, frightening downturn in the family finances.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Bill Engvall', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': 'WARA671737DVD', 'Media Format': 'NTSC', 'Run time': '7 hours and 44 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Bill Engvall', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Never watched this show when it was on TV.  I think the show is good.  I have always liked the red neck humor and I am a big fan of Nancy Travis (great actress and easy on the eyes).  Kids are funny and true to life.  Happy with the purchase.  I have all three seasons now on DVD.\nReview Title: Good Show!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bill Engvall Show: Season 1\nReview Date: 2017/07/16\nStore: Nancy Travis  (Actor),     Tim Meadows  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Bill Engvall Show: The Complete First Season (DVD)', 'A pet snake is loose in the house. A teen daughter thinks “no” is an insufficient response to her desire to get a belly button ring (okay, how about “NO!” ). Welcome to the Pearson home, where dad Bill, a family counselor, finds that guiding his own family is an ongoing therapy session. Blue Collar comedian Bill Engvall brings his winning dad-itude to the eight Season One episodes of this series that’s easygoing, relatable and therapeutically funny. As his own brood can use more than its fair share of counseling, Bill and wife Susan (Nancy Travis) search for ways to raise three mischievous kids. Hassles, humor and heart are all in abundance – from the Pearson family to yours.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Romance, Comedy, Sports', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Closed-captioned, Widescreen', 'Contributor': 'Nancy Travis, Skyler Gisondo, Graham Patrick Martin, Michael Leeson, J.P. Williams, Tim Meadows, Steve Hytner, Melanie Patterson, Bill Engvall, Jennifer LawrenceNancy Travis, Skyler Gisondo, Graham Patrick Martin, Michael Leeson, J.P. Williams, Tim Meadows, Steve Hytner, Melanie Patterson, Bill Engvall, Jennifer Lawrence  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.32 Ounces', 'Item model number': '3712275', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Closed-captioned, Widescreen', 'Run time': '2 hours and 56 minutes', 'Release date': 'May 20, 2008', 'Actors': 'Bill Engvall, Nancy Travis, Tim Meadows, Steve Hytner, Jennifer Lawrence', 'Subtitles': 'English', 'Producers': 'Melanie Patterson, Michael Leeson, Bill Engvall, J.P. Williams', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nReview Text: I purchased this because I had never seen the show.  I do like the series.  Liked it so much I bought seasons 2 and 3.  Good family show....\nReview Title: Family friendly viewing....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Married... with Children: The Complete Series\nReview Date: 2017/08/01\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Spend some quality time with the family as you join hard-working husband Al (Ed O'Neill), housework-hating wife Peg (Katey Sagal), sexy daughter Kelly (Christina Applegate) and hopelessly horny son Bud (David Faustino) to celebrate the landmark TV sitcom\", 'Married...with Children', '. For 11 seasons it was brilliantly tasteless, daringly raunchy and a devilishly clever comedy that pun the \"fun\" in \"dysfunctional\". Now you can own this great collectible box set that\\'s guaranteed to give you hours and hours of domestic bliss.', 'Amazon.com', 'Married...with Children: The Complete First Season', 'When', 'Married... with Children', 'debuted on Fox TV on April 5, 1987 (followed by', 'The Tracey Ullman Show', \"a half-hour later), the grungy sitcom became an instant flagship for Rupert Murdoch's upstart network. The program's much-publicized working title,\", 'Not the Cosbys', \"(a dismissive reference to the cheerful vitality of Bill Cosby's hugely popular television clan on NBC's\", 'The Cosby Show', ') was a dead giveaway.', 'Married... with Children', 'was going to be a trashier, raunchier, and far more cynical view of the American nuclear family. But it turned out the series actually fell into other caustic-domestic entertainment traditions, notably the Don Ameche and Frances Langford radio comedy series from the 1940s,', 'The Bickersons', \", and Jackie Gleason's TV classic,\", 'The Honeymooners', '.', \"The jokes were savage, key relationships were marked by ennui and indifference, and the Bundy family name couldn't help but make one think of America's most notorious, real-life serial killer at the time. Yet the show had a hint of Golden Age Hollywood gloss, a retro-screwball feel that one could detect in the snappy verbal warfare between husband Al Bundy (Ed O'Neill) and wife Peggy (Katey Sagal). The characters, and the show, eschewed sentimentality, which certainly opened the floodgates to comic cynicism but also kept a door ajar for moments of genuine sweetness. A decade later, however, by the time Fox cancelled the increasingly expensive series,\", 'Married... with Children', \"'s first-season tone would be considerably different, replaced by a stronger reliance on running jokes and character stereotypes, particularly concerning Bundy children Kelly (Christina Applegate) and Bud (David Faustino).\", 'That evolution makes watching', 'Married... with Children', '\\'s first 13 episodes, once again, quite instructive. Those programs are all on this two-disc set, including the startling pilot, in which Al and Peggy lock horns over marital politics and enlist naive new neighbors Steve (David Garrison) and Marcy (Amanda Bearse) in a battle of the sexes. There\\'s also the classic \"Whose Room Is It, Anyway,\" concerning the Bundys\\' competition to connive Steve and Marcy into building a recreation room, and \"Thinnergy,\" a very funny piece about a diet that supposedly boosts sexual interest.', '--Tom Keogh', 'Married...with Children: The Complete Second Season', 'Perhaps the definitive episode of', 'Married... with Children', 'is near the end of the second season, when Al and Peg Bundy (Ed O\\'Neill and Katey Segal), pretending to be their recently married neighbors, go on a game show that tests how willing each newlywed is to torture their spouse. This episode has everything: The cascade of blithe insults, the cheerful shredding of all dignity, the outright celebration of humanity\\'s worst instincts-- everything that has led self-satisfied arbiters of \"culture\" to proclaim', 'Married... with Children', \"the most sordid, distasteful sitcom in the history of mankind. In short, it's sheer genius.\", \"As the petty, miserable, conniving, yet perversely vital Bundy family, O'Neill, Segal, Christina Applegate, and David Faustino give performances that walk a fine line between outrageous satire and painful truth. It's the anti-\", 'Cosby', \"; family breeds contempt. Children scoff at their parents, parents resent their children, husbands and wives eye each other with suspicion and disdain. Episodes hinge on neutering their oversexed dog, fighting the phone company, and trying to humiliate a high school nemesis in a bowling tournament, but it's all an excuse for squalid delirium. This is not an ironic description of the show;\", 'Married... with Children', 'is both ruthless and deeply funny. (Though created by men,', 'Married... with Children', \"was frequently produced, written, and directed by women, which is unusual in the sitcom world. This doesn't necessarily have anything to do with its sense of humor, but its eagerness to skewer and roast sacred cows is shared by such women-driven shows as\", 'Roseanne', 'and', 'Absolutely Fabulous', \".) The jokes are like blunt instruments, yet delivered with a unique panache that got honed to razor sharpness in the second season. If you've never experienced the Bundy clan, this is an excellent place to start.\", '--Bret Fetzer', 'Married...with Children: The Complete Fourth Season', \"It's fitting that the producers of\", 'Married...With Children--The Complete Fourth Season', 'were too cheap to pay for the rights to the show\\'s classic theme song, the jaunty Sinatra tune \"Love & Marriage,\" replacing it with some crappy instrumental. Not because the season is lousy--on the contrary, the show\\'s crass and cynical wit is in full bloom--but because if the Bundys themselves were putting this out, they\\'d blow off the theme song as well. One of the longest-running sitcoms ever,', 'Married...With Children', \"portrayed American domestic life as bitter, sleazy, and perpetually hungry, yet bound together by the loyalty of the mutually damned. Emasculated shoe salesman Al Bundy (Ed O'Neill,\", 'Dutch', ',', 'Spartan', '), his lazy and unsatisfied wife Peg (Katey Sagal,', '8 Simple Rules', '), his dimwitted slut of a daughter Kelly (Christina Applegate,', 'Anchorman', ',', 'View from the Top', '), and his horny, conniving son Bud (David Faustino,', 'The Trouble with Frank', \") all bicker and scheme to achieve any meager improvement of their lives. For example, Peg wants to buy an idol of Tubro, the fat Panamanian god of money, hoping that good luck will help her win the lottery; so she sells Al's beloved\", 'Playboy', \"collection, launching Al into the depths of despair until he musters the shreds of his manhood and orders her to retrieve them. Or when Al, feeling suicidal on Christmas, gets a glimpse of how happy his family would be if he'd never been born and decides to live to keep their lives as awful as his has been. But it's not simply the parade of suburban atrocity that makes the show funny--it's the zest of the cast, who wallow in their white trash characters with gusto and commitment. Their glee gives the show a sardonic bite that transforms the squalor into something strangely giddy and transcendent, a vivisection of human pettiness that an 18th century novelist like Thackeray would appreciate. The fourth season features a startling array of guest stars, including Milla Jovovich (\", 'The Fifth Element', '), Joe Flaherty (', 'SCTV', '), Tiffani-Amber Thiessen (', 'Beverly Hills 90210', '), screaming comedian Sam Kinison, and former porn starlet Traci Lords.', '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Married With Children', 'Language': 'English', 'Number Of Discs': '32', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '8.1 x 5.7 x 2.9 inches; 1 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '99 hours and 22 minutes', 'Release date': 'September 27, 2011', 'Actors': 'Married With Children', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '32'}\nReview Text: What can I say.  Either you will like this show or hate it.  I like it.  However, it is starting to show its age.  Not as funny as I remembered it, but still makes me laugh.  Well worth the price.\nReview Title: Good addition to my collection\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jeff Foxworthy Show: The Complete Series\nReview Date: 2017/08/11\nStore: Jeff Foxworthy  (Actor),     Anita Barone  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['A comedy fit for the whole trailer park!', 'There goes the neighborhood!', \"If you're a redneck, then... you'll love Jeff Foxworthy in his first TV show! Foxworthy, a popular stand-up comic, stars as a hardworking husband and father. With his loving wife Karen and precocious son Matt (Haley Joel Osment), he has a single-family house full of double-wide laughs!\", 'Together, the Foxworthy clan is giving the Midwest a taste of Southern hilarity. As the owner of a heating and air company, Jeff takes his signature brand of humor and turns the American dream on its ear. Between paying his mortgage, running his business and raising his son, he learns what every self-respecting redneck knows: tractor pulls come and go, but family is forever!', 'Contents:', 'Disc 1', 'SEASON 1', \"Episode 1: Jeff's Life 101 Sept. 12, 1995Episode 2: A Non-Affair to Remember Sept. 16, 1995 Episode 3: The Gene Pool Sept. 23, 1995 Episode 4: Elliot and Victoria's Secret Sept. 30, 1995 Episode 5: Womb with a View Oct. 14, 1995 Episode 6: With Two You Get Cow's Milk Oct. 28, 1995 Episode 7: Jeff & Ray & Rascal's Big Adventure Nov. 4, 1995 Episode 8: A Sore Winner Nov. 11, 1995 Episode 9: He's Making a List, Checking It Twice Nov. 25, 1995\", 'Disc 2', \"Episode 10: Foxworthy Family Feud Dec. 16, 1995 Episode 11: Matt About You Dec. 23, 1995 Episode 12: Clan of the Bare Caves Jan. 6, 1996 Episode 13: Before You Say 'No' Just Hear Me Out Jan. 13, 1996 Episode 14: DeeDee Day Jan. 20, 1996 Episode 15: He Ain't Heavy, He's a Bully Jan. 24, 1996 Episode 16: Moonstruck Feb. 3, 1996 Episode 17: Shootout at the Comedy Corral Unaired Episode 18: One Wedding and a Baby May 15, 1996\", 'Disc 3', 'SEASON 2', \"Episode 1: Where the Donuts Are Good, Not Great Sept. 23, 1996Episode 2: The List Is Strife Sept. 30, 1996 Episode 3: The Poor Sportsmen of the Apocalypse Oct. 7, 1996 Episode 4: My Dinner with Betty Oct. 14, 1996 Episode 5: The Gift Oct. 21, 1996 Episode 6: The Practical Joke Oct. 28, 1996 Episode 7: Puppy Love Triangle Nov. 11, 1996 Episode 8: Like Florus, Like Son Nov. 18, 1996 Episode 9: The Thanksgiving Episode Nov. 25, 1996Episode 10: Merry Christmas, Y'All Dec. 16, 1996 Episode 11: Feud for Thought Jan. 6, 1997\", 'Disc 4', \"Episode 12: Can't Teach an Old Dog New Tricks Jan. 13, 1997Episode 13: The Briarton Syndrome Jan. 20, 1997 Episode 14: Jeff, You the Man Feb. 3, 1997 Episode 15: Big Dogs Feb. 17, 1997 Episode 16: Foxworthy Shall Rise Again March 3, 1997 Episode 17: Gone Fishin' March 10, 1997 Episode 18: Mooseface Loves Nuzzles March 17, 1997 Episode 19: The Good, the Bad and the Hairless April 7, 1997 Episode 20: Real Men April 14, 1997 Episode 21: Wrestling Opera April 28, 1997 Episode 22: Twister of Fate May 5, 1997 Episode 23: Field of Schemes May 5, 1997\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'Haley Joel Osment, Jonathan Lipnicki, Ann Cusack, Matt Borlenghi, Matt Clark, Anita Barone, Various, Jeff Foxworthy, Bill Engvall, G.W. BaileyHaley Joel Osment, Jonathan Lipnicki, Ann Cusack, Matt Borlenghi, Matt Clark, Anita Barone, Various, Jeff Foxworthy, Bill Engvall, G.W. Bailey   See more', 'Language': 'English', 'Runtime': '15 hours and 23 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '15 hours and 23 minutes', 'Release date': 'August 18, 2015', 'Actors': 'Jeff Foxworthy, Anita Barone, Ann Cusack, Haley Joel Osment, Matt Clark', 'Studio': 'Sony Pictures Home', 'Number of discs': '4'}\nReview Text: Since reviews were so positive I purchased this show, never having seen the show.  I agree, this is a good funny family show.\nReview Title: Funny redneck humor....\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: The Complete Eighth Season\nReview Date: 2017/09/10\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Neil Flynn, Atticus Shaffer', 'Language': 'English', 'Number Of Discs': '3'}\nReview Text: Glad to see the DVD for this season was available.  One of my favorite TV shows.  Have all seasons so far.  Quality of the picture is excellent.  Well worth the price if you are a fan and want to watch anytime without commercials....\nReview Title: Worth the Price\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Norm Show: The Complete Series\nReview Date: 2017/09/10\nStore: Norm MacDonald  (Actor),     Ian Gomez  (Actor),     Steve Zuckerman  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: ['Product Description', 'All 54 Original EpisodesFrom Norm Macdonald and executive producer Bruce Helford (creator of', 'The Drew Carey Show', ') comes this warped look at a pro hockey player turned criminal turned social worker. Meet Norm Henderson. Once a fairly well-known, but not particularly skilled, professional hockey player, Norm had a penchant for gambling and an aversion to paying taxes that resulted in his expulsion from hockey for life. Facing a possible jail term, Norm was instead sentenced to community service as a caseworker in social services, where his mischievous and sarcastic personality has him breaking all the rules, leaving his friends, by-the-book coworker Laurie (Laurie Metcalf,', 'Roseanne', ') and neurotic colleague Danny (Ian Gomez,', 'Cougar Town', '), to constantly help him out of trouble. Also starring Max Wright (', 'ALF', ') as his Boss Mr. Denby, Nikki Cox (', 'Las Vegas', ') as Taylor the ex-prostitute social worker and Artie Lange (', 'The Howard Stern Show, Dirty Work', ') as his crooked if not crazy half-brother: smart, edgy, dry comedy was the norm.', 'Amazon.com', 'In the booklet that accompanies this welcome boxed set,', 'The Norm Show', 'cocreator Bruce Helford calls this late lamented series \"the one that got away.\" A show that was just getting better as it went along, it fell prey to the vagaries of network scheduling, moved from Wednesday nights where it did very well to the programming sinkhole that is Friday night, where it did not, and was cancelled after three seasons. Helford also cocreated', 'The Drew Carey Show', ', and', 'Norm', \"is cut from the same cloth. It shares the same off-center rhythms, delight in meta-musings and tweaking sitcom conventions, and cold openings, such as Norm's parsing of TV's ratings system (with rebuttal in one episode by the Devil) and the episode that begins apropos of nothing with costumed cast members engaged in a Pokémon battle. The show also engaged in Carey-esque stunts, such as the punch line and movie reference contests. Norm MacDonald is a pricklier personality than Carey. His Norm is not as likeable as Carey's Everyman. He is a former professional hockey player who avoids jail for tax evasion by performing community service as a social worker. He is a slacker in an office of dedicated professionals, including compassionate and overworked Laurie (the remarkable Laurie Metcalf) and the luckless and sensitive Danny (Ian Gomez). To the show's credit, little effort is made to dull Norm's sarcastic and acerbic edge that made him one of\", 'SNL', '\\'s best Weekend Update anchors and Conan O\\'Brien\\'s most dependably funny talk show guests. In one episode, when Danny says, \"But you don\\'t want to hear my problems,\" Norm replies, \"Thanks, buddy. I was gonna say that but I thought it\\'d sound bad.\" The ensemble also includes sitcom veterans who raised MacDonald\\'s game, including', 'Murphy Brown', \"'s Faith Ford as Norm's social worker and romantic interest,\", 'Alf', \"'s Max Wright as Norm's tormented boss, MacDonald's\", 'Dirty Work', 'costar Artie Lange as Norm\\'s irresponsible brother, and Nikki Cox as Taylor, a former hooker, whom Norm helps rehabilitate. There are no Very Special Episodes, but several involving story arcs (Norm lapses into gambling, Danny and Taylor\\'s budding relationship). And just for fun, there are memorable cameos (Richard Pryor in his last screen appearance as an abusive and uncooperative case, Lou Rawls as a hansom cab driver) and guest star turns, including Jack Warden as Danny\\'s macho father who may be gay and Tommy Smothers as Norm\\'s less than paternalistic father. As the show got better, so did its opening credit sequences. Season 2\\'s never gets old, a comically choreographed street scene that perfectly encapsulates the characters. Extras are limited to several entertaining audio commentaries by MacDonald and Helford, who share writing and comedy insights and secrets from the set (during the episode \"Norm Dates Danny\\'s Dad,\" Helford reveals Norm\\'s failed catchphrase that, alas, can\\'t be repeated here).', '--Donald Liebenson']\nAverage Rating: 4.6\nProduct Details: {'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Steve Zuckerman, Faith Ford, Laurie Metcalf, Artie Lange, Norm MacDonald, Max Wright, Ian Gomez', 'Language': 'Unqualified', 'Number Of Discs': '8', 'Runtime': '19 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'SF12056', 'Director': 'Steve Zuckerman', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Run time': '19 hours and 45 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Norm MacDonald, Ian Gomez, Laurie Metcalf, Faith Ford, Artie Lange', 'Studio': 'Shout Factory', 'Number of discs': '8'}\nReview Text: Had not seen the show before.  Find it funny after watching the first few episodes.  Picture quality is good.  Sound not bad either.  Glad I took the plunge.\nReview Title: Funny Show\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Monuments Men [DVD]\nReview Date: 2019/07/24\nStore: George Clooney  (Actor, Director, Writer),     Matt Damon  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Based on the true story of the greatest treasure hunt in history, THE MONUMENTS MEN centers around an unlikely World War II platoon, tasked with going into Germany to rescue artistic masterpieces from Nazi thieves and returning them to their rightful owners. In a seemingly impossible mission, the Monuments Men, as they were called, find themselves risking their lives in a race against time to avoid the destruction of 1,000 years of culture.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama, Action/Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Hugh Bonneville, Matt Damon, Jean Dujardin, Robert M. Edsel, Grant Heslov, George Clooney, Cate Blanchett, Bret Witter, John Goodman, Bill MurrayHugh Bonneville, Matt Damon, Jean Dujardin, Robert M. Edsel, Grant Heslov, George Clooney, Cate Blanchett, Bret Witter, John Goodman, Bill Murray  See more', 'Language': 'Unknown (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 58 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Audio Description': 'English', 'Item model number': 'CTR42488DVD', 'Director': 'George Clooney', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'May 20, 2014', 'Actors': 'George Clooney, Matt Damon, Cate Blanchett, John Goodman, Jean Dujardin', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Columbia Pictures / Fox 2000 Pictures', 'Writers': 'Grant Heslov, George Clooney, Robert M. Edsel, Bret Witter', 'Number of discs': '1'}\nReview Text: Have not watched the movie, saw that it got good reviews and the trailer looked good.  Price was too low to pass up.\nReview Title: Great price\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Til Death - The Complete Series (Season 1-4)\nReview Date: 2019/08/09\nStore: Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'DVD', 'Language': 'English', 'Number Of Discs': '12', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.4 x 2.4 inches; 1.2 Pounds', 'Media Format': 'DVD', 'Number of discs': '12'}\nReview Text: This is a really funny show, that is a little over the top, but somehow manages to not go too far out of the ordinary.  Great cast and many topical subjects buried within the story.  So glad I was able to buy on DVD.\nReview Title: Funny Show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Becker, Season 5 (2002-2003)\nReview Date: 2019/10/29\nStore: Ted Danson  (Actor),     Alex Desert  (Actor)    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"BECKER returns in the fifth season of the hit series starring Emmy -Award-winner* Ted Danson as the angry and difficult, yet talented and dedicated, Dr. John Becker. Becker's head nurse Margaret (Hattie Winston) continues to maintain order out of chaos, keeping John and ditzy nurse's aide Linda (Shawnee Smith) in line. Becker's friends, Jake (Alex Desert), the blind proprietor of the local newsstand, and Bob (Saverio Guerra), the annoying yet somehow likable super of Becker's apartment building, also return to listen to Becker's constant rants on his views of the world. This season, romance will rear its ugly head as Becker tries to deny his feelings for Chris (Nancy Travis), his new neighbor who acts uninterested. Later, Becker must deal with a patient who not only has high cholesterol, but also suffers from multiple personality disorder. Also, after overhearing a phone conversation, Linda and Margaret suspect Becker is taking drugs or having an affair. Catch up on all the laughter in this 3-disc set including all 22 Season Five episodes. *Outstanding Lead Actor In A Comedy Series, Cheers, 1990 and 1993\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Nancy Travis, Shawnee Smith, Ted Danson, Alex Desert, Hattie Winston, Saverio Guerra', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Item model number': '6456558', 'Media Format': 'NTSC', 'Run time': '8 hours', 'Release date': 'June 11, 2013', 'Actors': 'Ted Danson, Alex Desert, Shawnee Smith, Hattie Winston, Saverio Guerra', 'Studio': 'CBS Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Great Show.  DVD quality very good.\nReview Title: Funny Show\nRating: 5.0\n--------------------------------------------------",
  "reference": "Don't Go Near The Water (Remastered)\nCharles Walters  (Director),     Glenn Ford  (Actor),     Gia Scala  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"They also serve who only sit and type! Hollywood brought audiences to atten-hut! in the 1950s and '60s with a string of military comedies like Mr. Roberts, Operation Petticoat, Ensign Pulver, No Time for Sergeants and this splash into the typing pool of dry-land sailors -- a Navy publicity team in the World War II Pacific. Glenn Ford, who appeared in a fistful of the era's service comedies, stars as a lieutenant with a knack for PR activities like placating big shots, calming romantic waters, deflating puffed-up journalists and puffing a profane-mouthed gob into the public's idea of the perfect enlisted man. Also in the large, shipshape cast: Anne Francis, Keenan Wynn and Mickey Shaughnessy.\"]\n{'Genre': 'Comedy', 'Format': 'NTSC, Original recording remastered', 'Contributor': 'Glenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ TamblynGlenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ Tamblyn   See more', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.12 Ounces', 'Director': 'Charles Walters', 'Media Format': 'NTSC, Original recording remastered', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 1, 2011', 'Actors': 'Glenn Ford, Gia Scala, Earl Holliman, Anne Francis, Keenan Wynn', 'Studio': 'MGM', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis has always been one of my favorite movies. I was so happy to see it finally release on DVD.  However, Warner Brothers could have done a much better job on the DVD.  It is shown in a 2.35:1 widescreen format.  I believe that Amazon said 1.78:1, which is incorrect.  The case says remastered, but I found the quality of the picture way below what it should be.  The picture is grainy and the sound is only so-so.  For the price, I was expecting better.  There are NO SUBTITLES.  You would think if it was \"remastered\" they could at least add that feature.  Having said all this, the movie is still a hoot.  Glad to add it to my dvd collection.  They just don't make them this entertaining anymore.\nWB could have done better!\nWKRP in Cincinnati: The Complete Series [DVD]\nHoward Hesseman  (Actor),     Frank Bonner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', \"Pairing an impeccable ensemble cast with hilarious wit and popular tunes, WKRP in Cincinnati celebrated four amazing seasons, making it the quintessential situation comedy for any music lover! Join everyone's favorite radio DJs—the rockin' Dr. Johnny Fever (Howard Hesseman) and the soulful Venus Flytrap (Tim Reid)—as they weave through the inner-office antics of the crazy WKRP staff including the station's steady program director Andy (Gary Sandy), indecisive manager Carlson (Gordon Jump), smarmy advertising executive Herb (Frank Bonner), quirky news man Les Nessman (Richard Sanders), shy ingénue Bailey (Jan Smithers) and, of course, the station's lovely receptionist, Jennifer (Loni Anderson). So sit back and enjoy the sound of uproarious laughter as you watch all 90 episodes of this iconic series!\", 'Bonus Content:', 'Disc 13:', 'WKRP in Cincinnati: A Paley Center Reunion', 'WKRP in Cincinnati: A Paley Center Reunion', '\"Do My Eyes Say Yes?\" Featurette', '\"Do My Eyes Say Yes?\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', 'A Conversation with Gary Sandy', 'A Conversation with Gary Sandy', ']]>', 'Review', 'Shout! Factory has done yeoman’s work in trying to correct this with', 'WKRP in Cincinnati: The Complete Series', '...The image quality, considering this series was originally shot on video tape, is almost uniformly outstanding. And, once again, Andy is overseeing a station playing the likes of Bruce Springsteen, the Rolling Stones, AC/DC, the Grateful Dead, Tom Petty, Elvis Costello, the Cars, Wings and the Police, instead of a series of featureless Muzak tracks.  Nick DeRiso -Nick DeRisosomethingelsereviews.com']\n{'Genre': 'Comedy/Television, Television', 'Format': 'DVD', 'Contributor': 'Richard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim ReidRichard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim Reid  See more', 'Language': 'English', 'Number Of Discs': '12', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.45 Pounds', 'Item model number': 'generic', 'Media Format': 'DVD', 'Run time': '37 hours and 30 minutes', 'Release date': 'April 17, 2018', 'Actors': 'Howard Hesseman, Frank Bonner, Gary Sandy, Tim Reid, Richard Sanders', 'Subtitles': 'Afrikaans', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '12'}\nThis was a great series for sure and the music is important to me.  However, I also want a great picture.  Too many of the Shout Factory TV series releases video and sound quality have been poor.  I just watched a video teaser on the Shout website and if this is the same quality as the actual release, we are all in for a real treat.  This looks so much better than the original TV broadcasts.  Can't wait to see this.....\nMusic important, but so is picture quality\nBig Bang Theory: Season 8\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley CuocoMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley Cuoco   See more', 'Initial release date': '2015-09-15', 'Language': 'English'}\nWhat can I say?  This is my favorite show.  Picture quality is excellent.  Nice not to have to look at station logos, pop-ups and commercials as when originally aired.  Looking forward to buying season 9.\nMy favorite show!\nThe Middle: Season 4\nPatricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['The Middle: The Complete Fourth Season', 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher and Atticus Shaffer star as the middle class, middle of the country (i.e. Orson, Indiana) Heck family in this warm and witty comedy about raising a family and lowering your expectations. While Frankie continues to struggle selling cars at the only remaining car dealer in town, an unexpected turn of events might force her to reevaluate her career path. Axl’s slothlike days are numbered, now that Mike’s made it his mission to ensure that his oldest son somehow earns a sports scholarship and goes to college next year. Meanwhile, Sue’s not only navigating high school, but wants to navigate Indiana roads – by getting her driver’s license. It’s no wonder that youngest son Brick keeps his nose in a book!', ']]>']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn HelinePatricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn Heline   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '883929373925', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Run time': '8 hours and 32 minutes', 'Release date': 'February 25, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'Spanish, French, English', 'Producers': 'DeAnn Heline, Eileen Heisler', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nEither you like this show, or you hate it.  I like it a lot.  Laugh out loud several time every episode.  Video and audio quality is excellent.\nFunny, Funny, Funny\nThe Middle: The Complete Fifth Season\nPatricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['The quirky misadventures of one of the Heartland’s most hilarious families continue as the middle returns for a fifth fitful season… and family dynamics have never been funnier. As the middle-aged, middle-class, middle of the country mom, Frankie Heck (Patricia Heaton) tackles the mundane chaos of everyday life, her kids – recent high school graduate Axl (Charlie McDermott), sophomore Sue (Eden Sher) and the quirky middle-schooler Brick (Atticus Shaffer) – are continually manufacturing drama, while her laconic husband, Mike (Neal Flynn) offers support from the sidelines (re. the living room couch). Juggling her new job as a dental assistant with school projects, teenage theatrics and a husband in emotional low gear, Frankie struggles to use her wry wit and sense of humor to get her family through each day intact. But through all the madness, the Hecks muddle through…and together they’re keeping the middle on the map.']\n{'Genre': 'Comedy/Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Eden Sher, Neil Flynn, Atticus Shaffer, Charlie Mcdermott', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '1000532061', 'Media Format': 'NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 9, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie Mcdermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'English', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nSuper funny show.  Every season actually gets better in my opinion.  Audio and video quality is very good.\nStill funny....\nHearts Afire - The Complete Series\nJohn Ritter  (Actor),     Markie Post  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Hearts Afire - The Complete Series 7-Disc DVD']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Contributor': 'Markie Post, John Ritter, Billy Bob Thornton', 'Language': 'English', 'Number Of Discs': '7', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8 Ounces', 'Item model number': '52888', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Run time': '21 hours and 44 minutes', 'Release date': 'January 8, 2013', 'Actors': 'John Ritter, Markie Post, Billy Bob Thornton', 'Studio': 'Mill Creek Ent', 'Number of discs': '7'}\nI have just started watching this series on DVD for the first time.  So far, I like it.  However, the quality of the video is not what it should be.  Yes, this is an older series, but I have DVD's of much older series that look far superior.  I don't think any effort was taken to improve the picture quality by Mill Creek Entertainment.  For that reason I have deducted the one star.\nGood, except for picture quality....\nNight Court: The Complete Ninth Season\nHarry Anderson  (Actor),     John Larroquette  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Night Court's ninth and final season sees Judge Harry(HARRY ANDERSON) and company rethinking careers and companions, while Bull (RICHARD MOLL) stumbles through the wedding china on his way to matrimonial bliss. It's a good thing Bull has Harry, Mac (CHARLES ROBINSON), Roz (MARSHA WARFIELD) , Christine (MARKIE POST) and even Dan (JOHN LARROQUETTE) on hand to get him to the altar on time. While Harry considers a career in higher education, Christine takes a look at Congress as Dan rethinks his commitment to his primary field of interest (it's spelled S-E-X). Meanwhile ditzy-but-stunning court steno Lisette (JOLEEN LUTZ) is harboring a secret of her own, one that concerns a prominent member of the cast. And what on Earth do aliens want with Bull? Mel Torme, Gilbert Gottfried, and Stephen Root are all found among the season's memorable guest-stars. But as the final hour airs -- and the cast depart for different climes, whither Judge Harry? A 3-Disc, 22-Episode Collection.\"]\n{'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Charles Robinson, John Larroquette, Markie Post, Marsha Warfield, Richard Moll, Harry Anderson', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '402621', 'Media Format': 'NTSC', 'Run time': '11 hours', 'Release date': 'June 11, 2013', 'Actors': 'Harry Anderson, John Larroquette, Markie Post, Richard Moll, Charles Robinson', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nJust finished watching all nine seasons on DVD.  Pretty good series.  Nice to see how things were wrapped up the final season.  Glad I bought the whole series.\nStill Funny....\nNight Court: The Complete Eighth Season\nHarry Anderson  (Actor),     John Larroquette  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Originally conceived as the final season, Night Court's eighth hit year saw the show's creators moving some very long simmering subplots off the back burner and on the boil. As the season begins, Judge Harry (HARRY ANDERSON), DA Dan (JOHN LARROQUETTE), bailiff Bull (RICHARD MOLL), clerk Mac (CHARLES ROBINSON) and bailiff Roz (MARSHA WARFIELD) are welcoming Christine (MARKIE POST) back from maternity leave. The happy reunion is short-lived, however, as long-buried passions, secret guilts and long-lost relatives plunge the court into chaos. This being Night Court we are also treated to visits from a trick-or-treating Death (STEPHEN ROOT) and time travels with an angel (MEL TORME), and we brave a session at the horrific Day Court. By season's end, two characters may be unable to deny their love any longer in this 3-Disc, 24 Episode Collection.\"]\n{'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'John Larroquette, Richard Moll, Harry Anderson', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '380233', 'Media Format': 'NTSC', 'Run time': '9 hours and 34 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Harry Anderson, John Larroquette, Richard Moll', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI have all nine seasons and find them all funny.  So much better than some of the newer shows.  I really think the show got even better when Markie Post joined the cast.\nStill funny....\nThe Middle: The Complete Seventh Season\nPatricia Heaton  (Actor),     Neil Flynn  (Actor)    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"The Middle's seventh season sees each member of the Heck family breaking out of their comfort zones. Oldest son Axl (Charlie McDermott) begins his junior year, and the business major starts thinking seriously about his future. Daughter Sue (Eden Sher) starts her first year of college at the same campus that Axl attends -- much to his disgust -- with a new haircut and an even more optimistic outlook. Quirky youngest son Brick (Atticus Shaffer) begins his final year of middle school, and his equally quirky girlfriend, Cindy (Casey Burke), wants to take their romance to the next level -- holding hands! Finding themselves facing an emptier nest, Frankie (Patricia Heaton) wonders if her parental duties will ease up while Mike (Neil Flynn) finds himself in a bit of a midlife crisis -- shocking everyone by deciding to take some new chances. Could this finally be the year of the Hecks?\"]\n{'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Neil Flynn, Atticus Shaffer', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'NTSC', 'Run time': '8 hours and 48 minutes', 'Release date': 'November 15, 2016', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'English', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nWhat can I say.  I like this series a lot and have all seasons on DVD.  Quality is fine.\nA wonderful show.\nJust Shoot Me!: The Complete Series\nLaura San Giacomo  (Actor),     George Segal  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n{'Genre': 'Comedy/Television, Television', 'Format': 'Box set, Color, NTSC, Full Screen', 'Contributor': 'Laura San Giacomo, David Spade, George Segal, Enrico Colantoni, Wendie Malick, Various', 'Language': 'English', 'Number Of Discs': '19', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Director': 'Various', 'Media Format': 'Box set, Color, NTSC, Full Screen', 'Run time': '54 hours and 28 minutes', 'Release date': 'September 5, 2017', 'Actors': 'Laura San Giacomo, George Segal, Wendie Malick, Enrico Colantoni, David Spade', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '19'}\nWhile I am glad the entire 7 seasons will soon be available, it is a shame that now I have to buy duplicates of seasons 1,2,and 3 that I already purchase years ago.  So now no other choice if I want 4,5,6 and 7.<br />UPDATE:  9/22/17<br />Went ahead and got the full set.  Glad I did.  The picture quality is excellent.  Money well spent.\nGreat Show!\nThe Bill Engvall Show: The Complete Second and Third Seasons\nBill Engvall  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Blue Collar Comedy Tour's breakout star Bill Engvall created, executive produces and stars as Bill Pearson, a family counselor who could use some counseling of his own to deal with his unconventional brood in this family-centered sitcom. TV titans Nancy Travis and Tim Meadows costar as wife and pal, while a pre-superstar Jennifer Lawrence (The Hunger Games) plays his precocious and pugnacious teenage daughter. Graham Patrick Martin and Skyler Gisondo round out the clan as Bill's boys: one a slacker, the other sly. This 3-Disc, 22-Episode Collection delivers up the remaining seasons of this TV favorite to a clamoring crowd of comedy fans hungry for some savory, old-fashioned family fare. In the final two seasons, the Pearsons face challenges both ordinary and unexpected, from the proper allowance to chore ratio and the horrors of prom to using Facebook to spy on your kids and a sudden, frightening downturn in the family finances.\"]\n{'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Bill Engvall', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': 'WARA671737DVD', 'Media Format': 'NTSC', 'Run time': '7 hours and 44 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Bill Engvall', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '3'}\nNever watched this show when it was on TV.  I think the show is good.  I have always liked the red neck humor and I am a big fan of Nancy Travis (great actress and easy on the eyes).  Kids are funny and true to life.  Happy with the purchase.  I have all three seasons now on DVD.\nGood Show!\nThe Bill Engvall Show: Season 1\nNancy Travis  (Actor),     Tim Meadows  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Bill Engvall Show: The Complete First Season (DVD)', 'A pet snake is loose in the house. A teen daughter thinks “no” is an insufficient response to her desire to get a belly button ring (okay, how about “NO!” ). Welcome to the Pearson home, where dad Bill, a family counselor, finds that guiding his own family is an ongoing therapy session. Blue Collar comedian Bill Engvall brings his winning dad-itude to the eight Season One episodes of this series that’s easygoing, relatable and therapeutically funny. As his own brood can use more than its fair share of counseling, Bill and wife Susan (Nancy Travis) search for ways to raise three mischievous kids. Hassles, humor and heart are all in abundance – from the Pearson family to yours.', ']]>']\n{'Genre': 'Kids & Family, Romance, Comedy, Sports', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Closed-captioned, Widescreen', 'Contributor': 'Nancy Travis, Skyler Gisondo, Graham Patrick Martin, Michael Leeson, J.P. Williams, Tim Meadows, Steve Hytner, Melanie Patterson, Bill Engvall, Jennifer LawrenceNancy Travis, Skyler Gisondo, Graham Patrick Martin, Michael Leeson, J.P. Williams, Tim Meadows, Steve Hytner, Melanie Patterson, Bill Engvall, Jennifer Lawrence  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.32 Ounces', 'Item model number': '3712275', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Closed-captioned, Widescreen', 'Run time': '2 hours and 56 minutes', 'Release date': 'May 20, 2008', 'Actors': 'Bill Engvall, Nancy Travis, Tim Meadows, Steve Hytner, Jennifer Lawrence', 'Subtitles': 'English', 'Producers': 'Melanie Patterson, Michael Leeson, Bill Engvall, J.P. Williams', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nI purchased this because I had never seen the show.  I do like the series.  Liked it so much I bought seasons 2 and 3.  Good family show....\nFamily friendly viewing....\nMarried... with Children: The Complete Series\nRated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Spend some quality time with the family as you join hard-working husband Al (Ed O'Neill), housework-hating wife Peg (Katey Sagal), sexy daughter Kelly (Christina Applegate) and hopelessly horny son Bud (David Faustino) to celebrate the landmark TV sitcom\", 'Married...with Children', '. For 11 seasons it was brilliantly tasteless, daringly raunchy and a devilishly clever comedy that pun the \"fun\" in \"dysfunctional\". Now you can own this great collectible box set that\\'s guaranteed to give you hours and hours of domestic bliss.', 'Amazon.com', 'Married...with Children: The Complete First Season', 'When', 'Married... with Children', 'debuted on Fox TV on April 5, 1987 (followed by', 'The Tracey Ullman Show', \"a half-hour later), the grungy sitcom became an instant flagship for Rupert Murdoch's upstart network. The program's much-publicized working title,\", 'Not the Cosbys', \"(a dismissive reference to the cheerful vitality of Bill Cosby's hugely popular television clan on NBC's\", 'The Cosby Show', ') was a dead giveaway.', 'Married... with Children', 'was going to be a trashier, raunchier, and far more cynical view of the American nuclear family. But it turned out the series actually fell into other caustic-domestic entertainment traditions, notably the Don Ameche and Frances Langford radio comedy series from the 1940s,', 'The Bickersons', \", and Jackie Gleason's TV classic,\", 'The Honeymooners', '.', \"The jokes were savage, key relationships were marked by ennui and indifference, and the Bundy family name couldn't help but make one think of America's most notorious, real-life serial killer at the time. Yet the show had a hint of Golden Age Hollywood gloss, a retro-screwball feel that one could detect in the snappy verbal warfare between husband Al Bundy (Ed O'Neill) and wife Peggy (Katey Sagal). The characters, and the show, eschewed sentimentality, which certainly opened the floodgates to comic cynicism but also kept a door ajar for moments of genuine sweetness. A decade later, however, by the time Fox cancelled the increasingly expensive series,\", 'Married... with Children', \"'s first-season tone would be considerably different, replaced by a stronger reliance on running jokes and character stereotypes, particularly concerning Bundy children Kelly (Christina Applegate) and Bud (David Faustino).\", 'That evolution makes watching', 'Married... with Children', '\\'s first 13 episodes, once again, quite instructive. Those programs are all on this two-disc set, including the startling pilot, in which Al and Peggy lock horns over marital politics and enlist naive new neighbors Steve (David Garrison) and Marcy (Amanda Bearse) in a battle of the sexes. There\\'s also the classic \"Whose Room Is It, Anyway,\" concerning the Bundys\\' competition to connive Steve and Marcy into building a recreation room, and \"Thinnergy,\" a very funny piece about a diet that supposedly boosts sexual interest.', '--Tom Keogh', 'Married...with Children: The Complete Second Season', 'Perhaps the definitive episode of', 'Married... with Children', 'is near the end of the second season, when Al and Peg Bundy (Ed O\\'Neill and Katey Segal), pretending to be their recently married neighbors, go on a game show that tests how willing each newlywed is to torture their spouse. This episode has everything: The cascade of blithe insults, the cheerful shredding of all dignity, the outright celebration of humanity\\'s worst instincts-- everything that has led self-satisfied arbiters of \"culture\" to proclaim', 'Married... with Children', \"the most sordid, distasteful sitcom in the history of mankind. In short, it's sheer genius.\", \"As the petty, miserable, conniving, yet perversely vital Bundy family, O'Neill, Segal, Christina Applegate, and David Faustino give performances that walk a fine line between outrageous satire and painful truth. It's the anti-\", 'Cosby', \"; family breeds contempt. Children scoff at their parents, parents resent their children, husbands and wives eye each other with suspicion and disdain. Episodes hinge on neutering their oversexed dog, fighting the phone company, and trying to humiliate a high school nemesis in a bowling tournament, but it's all an excuse for squalid delirium. This is not an ironic description of the show;\", 'Married... with Children', 'is both ruthless and deeply funny. (Though created by men,', 'Married... with Children', \"was frequently produced, written, and directed by women, which is unusual in the sitcom world. This doesn't necessarily have anything to do with its sense of humor, but its eagerness to skewer and roast sacred cows is shared by such women-driven shows as\", 'Roseanne', 'and', 'Absolutely Fabulous', \".) The jokes are like blunt instruments, yet delivered with a unique panache that got honed to razor sharpness in the second season. If you've never experienced the Bundy clan, this is an excellent place to start.\", '--Bret Fetzer', 'Married...with Children: The Complete Fourth Season', \"It's fitting that the producers of\", 'Married...With Children--The Complete Fourth Season', 'were too cheap to pay for the rights to the show\\'s classic theme song, the jaunty Sinatra tune \"Love & Marriage,\" replacing it with some crappy instrumental. Not because the season is lousy--on the contrary, the show\\'s crass and cynical wit is in full bloom--but because if the Bundys themselves were putting this out, they\\'d blow off the theme song as well. One of the longest-running sitcoms ever,', 'Married...With Children', \"portrayed American domestic life as bitter, sleazy, and perpetually hungry, yet bound together by the loyalty of the mutually damned. Emasculated shoe salesman Al Bundy (Ed O'Neill,\", 'Dutch', ',', 'Spartan', '), his lazy and unsatisfied wife Peg (Katey Sagal,', '8 Simple Rules', '), his dimwitted slut of a daughter Kelly (Christina Applegate,', 'Anchorman', ',', 'View from the Top', '), and his horny, conniving son Bud (David Faustino,', 'The Trouble with Frank', \") all bicker and scheme to achieve any meager improvement of their lives. For example, Peg wants to buy an idol of Tubro, the fat Panamanian god of money, hoping that good luck will help her win the lottery; so she sells Al's beloved\", 'Playboy', \"collection, launching Al into the depths of despair until he musters the shreds of his manhood and orders her to retrieve them. Or when Al, feeling suicidal on Christmas, gets a glimpse of how happy his family would be if he'd never been born and decides to live to keep their lives as awful as his has been. But it's not simply the parade of suburban atrocity that makes the show funny--it's the zest of the cast, who wallow in their white trash characters with gusto and commitment. Their glee gives the show a sardonic bite that transforms the squalor into something strangely giddy and transcendent, a vivisection of human pettiness that an 18th century novelist like Thackeray would appreciate. The fourth season features a startling array of guest stars, including Milla Jovovich (\", 'The Fifth Element', '), Joe Flaherty (', 'SCTV', '), Tiffani-Amber Thiessen (', 'Beverly Hills 90210', '), screaming comedian Sam Kinison, and former porn starlet Traci Lords.', '--Bret Fetzer']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Married With Children', 'Language': 'English', 'Number Of Discs': '32', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '8.1 x 5.7 x 2.9 inches; 1 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '99 hours and 22 minutes', 'Release date': 'September 27, 2011', 'Actors': 'Married With Children', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '32'}\nWhat can I say.  Either you will like this show or hate it.  I like it.  However, it is starting to show its age.  Not as funny as I remembered it, but still makes me laugh.  Well worth the price.\nGood addition to my collection\nJeff Foxworthy Show: The Complete Series\nJeff Foxworthy  (Actor),     Anita Barone  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['A comedy fit for the whole trailer park!', 'There goes the neighborhood!', \"If you're a redneck, then... you'll love Jeff Foxworthy in his first TV show! Foxworthy, a popular stand-up comic, stars as a hardworking husband and father. With his loving wife Karen and precocious son Matt (Haley Joel Osment), he has a single-family house full of double-wide laughs!\", 'Together, the Foxworthy clan is giving the Midwest a taste of Southern hilarity. As the owner of a heating and air company, Jeff takes his signature brand of humor and turns the American dream on its ear. Between paying his mortgage, running his business and raising his son, he learns what every self-respecting redneck knows: tractor pulls come and go, but family is forever!', 'Contents:', 'Disc 1', 'SEASON 1', \"Episode 1: Jeff's Life 101 Sept. 12, 1995Episode 2: A Non-Affair to Remember Sept. 16, 1995 Episode 3: The Gene Pool Sept. 23, 1995 Episode 4: Elliot and Victoria's Secret Sept. 30, 1995 Episode 5: Womb with a View Oct. 14, 1995 Episode 6: With Two You Get Cow's Milk Oct. 28, 1995 Episode 7: Jeff & Ray & Rascal's Big Adventure Nov. 4, 1995 Episode 8: A Sore Winner Nov. 11, 1995 Episode 9: He's Making a List, Checking It Twice Nov. 25, 1995\", 'Disc 2', \"Episode 10: Foxworthy Family Feud Dec. 16, 1995 Episode 11: Matt About You Dec. 23, 1995 Episode 12: Clan of the Bare Caves Jan. 6, 1996 Episode 13: Before You Say 'No' Just Hear Me Out Jan. 13, 1996 Episode 14: DeeDee Day Jan. 20, 1996 Episode 15: He Ain't Heavy, He's a Bully Jan. 24, 1996 Episode 16: Moonstruck Feb. 3, 1996 Episode 17: Shootout at the Comedy Corral Unaired Episode 18: One Wedding and a Baby May 15, 1996\", 'Disc 3', 'SEASON 2', \"Episode 1: Where the Donuts Are Good, Not Great Sept. 23, 1996Episode 2: The List Is Strife Sept. 30, 1996 Episode 3: The Poor Sportsmen of the Apocalypse Oct. 7, 1996 Episode 4: My Dinner with Betty Oct. 14, 1996 Episode 5: The Gift Oct. 21, 1996 Episode 6: The Practical Joke Oct. 28, 1996 Episode 7: Puppy Love Triangle Nov. 11, 1996 Episode 8: Like Florus, Like Son Nov. 18, 1996 Episode 9: The Thanksgiving Episode Nov. 25, 1996Episode 10: Merry Christmas, Y'All Dec. 16, 1996 Episode 11: Feud for Thought Jan. 6, 1997\", 'Disc 4', \"Episode 12: Can't Teach an Old Dog New Tricks Jan. 13, 1997Episode 13: The Briarton Syndrome Jan. 20, 1997 Episode 14: Jeff, You the Man Feb. 3, 1997 Episode 15: Big Dogs Feb. 17, 1997 Episode 16: Foxworthy Shall Rise Again March 3, 1997 Episode 17: Gone Fishin' March 10, 1997 Episode 18: Mooseface Loves Nuzzles March 17, 1997 Episode 19: The Good, the Bad and the Hairless April 7, 1997 Episode 20: Real Men April 14, 1997 Episode 21: Wrestling Opera April 28, 1997 Episode 22: Twister of Fate May 5, 1997 Episode 23: Field of Schemes May 5, 1997\"]\n{'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'Haley Joel Osment, Jonathan Lipnicki, Ann Cusack, Matt Borlenghi, Matt Clark, Anita Barone, Various, Jeff Foxworthy, Bill Engvall, G.W. BaileyHaley Joel Osment, Jonathan Lipnicki, Ann Cusack, Matt Borlenghi, Matt Clark, Anita Barone, Various, Jeff Foxworthy, Bill Engvall, G.W. Bailey   See more', 'Language': 'English', 'Runtime': '15 hours and 23 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '15 hours and 23 minutes', 'Release date': 'August 18, 2015', 'Actors': 'Jeff Foxworthy, Anita Barone, Ann Cusack, Haley Joel Osment, Matt Clark', 'Studio': 'Sony Pictures Home', 'Number of discs': '4'}\nSince reviews were so positive I purchased this show, never having seen the show.  I agree, this is a good funny family show.\nFunny redneck humor....\nThe Middle: The Complete Eighth Season\nPatricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n{'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Neil Flynn, Atticus Shaffer', 'Language': 'English', 'Number Of Discs': '3'}\nGlad to see the DVD for this season was available.  One of my favorite TV shows.  Have all seasons so far.  Quality of the picture is excellent.  Well worth the price if you are a fan and want to watch anytime without commercials....\nWorth the Price\nThe Norm Show: The Complete Series\nNorm MacDonald  (Actor),     Ian Gomez  (Actor),     Steve Zuckerman  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Product Description', 'All 54 Original EpisodesFrom Norm Macdonald and executive producer Bruce Helford (creator of', 'The Drew Carey Show', ') comes this warped look at a pro hockey player turned criminal turned social worker. Meet Norm Henderson. Once a fairly well-known, but not particularly skilled, professional hockey player, Norm had a penchant for gambling and an aversion to paying taxes that resulted in his expulsion from hockey for life. Facing a possible jail term, Norm was instead sentenced to community service as a caseworker in social services, where his mischievous and sarcastic personality has him breaking all the rules, leaving his friends, by-the-book coworker Laurie (Laurie Metcalf,', 'Roseanne', ') and neurotic colleague Danny (Ian Gomez,', 'Cougar Town', '), to constantly help him out of trouble. Also starring Max Wright (', 'ALF', ') as his Boss Mr. Denby, Nikki Cox (', 'Las Vegas', ') as Taylor the ex-prostitute social worker and Artie Lange (', 'The Howard Stern Show, Dirty Work', ') as his crooked if not crazy half-brother: smart, edgy, dry comedy was the norm.', 'Amazon.com', 'In the booklet that accompanies this welcome boxed set,', 'The Norm Show', 'cocreator Bruce Helford calls this late lamented series \"the one that got away.\" A show that was just getting better as it went along, it fell prey to the vagaries of network scheduling, moved from Wednesday nights where it did very well to the programming sinkhole that is Friday night, where it did not, and was cancelled after three seasons. Helford also cocreated', 'The Drew Carey Show', ', and', 'Norm', \"is cut from the same cloth. It shares the same off-center rhythms, delight in meta-musings and tweaking sitcom conventions, and cold openings, such as Norm's parsing of TV's ratings system (with rebuttal in one episode by the Devil) and the episode that begins apropos of nothing with costumed cast members engaged in a Pokémon battle. The show also engaged in Carey-esque stunts, such as the punch line and movie reference contests. Norm MacDonald is a pricklier personality than Carey. His Norm is not as likeable as Carey's Everyman. He is a former professional hockey player who avoids jail for tax evasion by performing community service as a social worker. He is a slacker in an office of dedicated professionals, including compassionate and overworked Laurie (the remarkable Laurie Metcalf) and the luckless and sensitive Danny (Ian Gomez). To the show's credit, little effort is made to dull Norm's sarcastic and acerbic edge that made him one of\", 'SNL', '\\'s best Weekend Update anchors and Conan O\\'Brien\\'s most dependably funny talk show guests. In one episode, when Danny says, \"But you don\\'t want to hear my problems,\" Norm replies, \"Thanks, buddy. I was gonna say that but I thought it\\'d sound bad.\" The ensemble also includes sitcom veterans who raised MacDonald\\'s game, including', 'Murphy Brown', \"'s Faith Ford as Norm's social worker and romantic interest,\", 'Alf', \"'s Max Wright as Norm's tormented boss, MacDonald's\", 'Dirty Work', 'costar Artie Lange as Norm\\'s irresponsible brother, and Nikki Cox as Taylor, a former hooker, whom Norm helps rehabilitate. There are no Very Special Episodes, but several involving story arcs (Norm lapses into gambling, Danny and Taylor\\'s budding relationship). And just for fun, there are memorable cameos (Richard Pryor in his last screen appearance as an abusive and uncooperative case, Lou Rawls as a hansom cab driver) and guest star turns, including Jack Warden as Danny\\'s macho father who may be gay and Tommy Smothers as Norm\\'s less than paternalistic father. As the show got better, so did its opening credit sequences. Season 2\\'s never gets old, a comically choreographed street scene that perfectly encapsulates the characters. Extras are limited to several entertaining audio commentaries by MacDonald and Helford, who share writing and comedy insights and secrets from the set (during the episode \"Norm Dates Danny\\'s Dad,\" Helford reveals Norm\\'s failed catchphrase that, alas, can\\'t be repeated here).', '--Donald Liebenson']\n{'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Steve Zuckerman, Faith Ford, Laurie Metcalf, Artie Lange, Norm MacDonald, Max Wright, Ian Gomez', 'Language': 'Unqualified', 'Number Of Discs': '8', 'Runtime': '19 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'SF12056', 'Director': 'Steve Zuckerman', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Run time': '19 hours and 45 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Norm MacDonald, Ian Gomez, Laurie Metcalf, Faith Ford, Artie Lange', 'Studio': 'Shout Factory', 'Number of discs': '8'}\nHad not seen the show before.  Find it funny after watching the first few episodes.  Picture quality is good.  Sound not bad either.  Glad I took the plunge.\nFunny Show\nThe Monuments Men [DVD]\nGeorge Clooney  (Actor, Director, Writer),     Matt Damon  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Based on the true story of the greatest treasure hunt in history, THE MONUMENTS MEN centers around an unlikely World War II platoon, tasked with going into Germany to rescue artistic masterpieces from Nazi thieves and returning them to their rightful owners. In a seemingly impossible mission, the Monuments Men, as they were called, find themselves risking their lives in a race against time to avoid the destruction of 1,000 years of culture.']\n{'Genre': 'Drama, Action/Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Hugh Bonneville, Matt Damon, Jean Dujardin, Robert M. Edsel, Grant Heslov, George Clooney, Cate Blanchett, Bret Witter, John Goodman, Bill MurrayHugh Bonneville, Matt Damon, Jean Dujardin, Robert M. Edsel, Grant Heslov, George Clooney, Cate Blanchett, Bret Witter, John Goodman, Bill Murray  See more', 'Language': 'Unknown (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 58 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Audio Description': 'English', 'Item model number': 'CTR42488DVD', 'Director': 'George Clooney', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'May 20, 2014', 'Actors': 'George Clooney, Matt Damon, Cate Blanchett, John Goodman, Jean Dujardin', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Columbia Pictures / Fox 2000 Pictures', 'Writers': 'Grant Heslov, George Clooney, Robert M. Edsel, Bret Witter', 'Number of discs': '1'}\nHave not watched the movie, saw that it got good reviews and the trailer looked good.  Price was too low to pass up.\nGreat price\nTil Death - The Complete Series (Season 1-4)\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n{'Genre': 'Comedy', 'Format': 'DVD', 'Language': 'English', 'Number Of Discs': '12', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.4 x 2.4 inches; 1.2 Pounds', 'Media Format': 'DVD', 'Number of discs': '12'}\nThis is a really funny show, that is a little over the top, but somehow manages to not go too far out of the ordinary.  Great cast and many topical subjects buried within the story.  So glad I was able to buy on DVD.\nFunny Show\nBecker, Season 5 (2002-2003)\nTed Danson  (Actor),     Alex Desert  (Actor)    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"BECKER returns in the fifth season of the hit series starring Emmy -Award-winner* Ted Danson as the angry and difficult, yet talented and dedicated, Dr. John Becker. Becker's head nurse Margaret (Hattie Winston) continues to maintain order out of chaos, keeping John and ditzy nurse's aide Linda (Shawnee Smith) in line. Becker's friends, Jake (Alex Desert), the blind proprietor of the local newsstand, and Bob (Saverio Guerra), the annoying yet somehow likable super of Becker's apartment building, also return to listen to Becker's constant rants on his views of the world. This season, romance will rear its ugly head as Becker tries to deny his feelings for Chris (Nancy Travis), his new neighbor who acts uninterested. Later, Becker must deal with a patient who not only has high cholesterol, but also suffers from multiple personality disorder. Also, after overhearing a phone conversation, Linda and Margaret suspect Becker is taking drugs or having an affair. Catch up on all the laughter in this 3-disc set including all 22 Season Five episodes. *Outstanding Lead Actor In A Comedy Series, Cheers, 1990 and 1993\"]\n{'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Nancy Travis, Shawnee Smith, Ted Danson, Alex Desert, Hattie Winston, Saverio Guerra', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Item model number': '6456558', 'Media Format': 'NTSC', 'Run time': '8 hours', 'Release date': 'June 11, 2013', 'Actors': 'Ted Danson, Alex Desert, Shawnee Smith, Hattie Winston, Saverio Guerra', 'Studio': 'CBS Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\nGreat Show.  DVD quality very good.\nFunny Show",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Don't Go Near The Water (Remastered)\nReview Date: 2011/12/16\nStore: Charles Walters  (Director),     Glenn Ford  (Actor),     Gia Scala  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: [\"They also serve who only sit and type! Hollywood brought audiences to atten-hut! in the 1950s and '60s with a string of military comedies like Mr. Roberts, Operation Petticoat, Ensign Pulver, No Time for Sergeants and this splash into the typing pool of dry-land sailors -- a Navy publicity team in the World War II Pacific. Glenn Ford, who appeared in a fistful of the era's service comedies, stars as a lieutenant with a knack for PR activities like placating big shots, calming romantic waters, deflating puffed-up journalists and puffing a profane-mouthed gob into the public's idea of the perfect enlisted man. Also in the large, shipshape cast: Anne Francis, Keenan Wynn and Mickey Shaughnessy.\"]\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC, Original recording remastered', 'Contributor': 'Glenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ TamblynGlenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ Tamblyn   See more', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.12 Ounces', 'Director': 'Charles Walters', 'Media Format': 'NTSC, Original recording remastered', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 1, 2011', 'Actors': 'Glenn Ford, Gia Scala, Earl Holliman, Anne Francis, Keenan Wynn', 'Studio': 'MGM', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This has always been one of my favorite movies. I was so happy to see it finally release on DVD.  However, Warner Brothers could have done a much better job on the DVD.  It is shown in a 2.35:1 widescreen format.  I believe that Amazon said 1.78:1, which is incorrect.  The case says remastered, but I found the quality of the picture way below what it should be.  The picture is grainy and the sound is only so-so.  For the price, I was expecting better.  There are NO SUBTITLES.  You would think if it was \"remastered\" they could at least add that feature.  Having said all this, the movie is still a hoot.  Glad to add it to my dvd collection.  They just don't make them this entertaining anymore.\nReview Title: WB could have done better!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: WKRP in Cincinnati: The Complete Series [DVD]\nReview Date: 2014/09/17\nStore: Howard Hesseman  (Actor),     Frank Bonner  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', \"Pairing an impeccable ensemble cast with hilarious wit and popular tunes, WKRP in Cincinnati celebrated four amazing seasons, making it the quintessential situation comedy for any music lover! Join everyone's favorite radio DJs—the rockin' Dr. Johnny Fever (Howard Hesseman) and the soulful Venus Flytrap (Tim Reid)—as they weave through the inner-office antics of the crazy WKRP staff including the station's steady program director Andy (Gary Sandy), indecisive manager Carlson (Gordon Jump), smarmy advertising executive Herb (Frank Bonner), quirky news man Les Nessman (Richard Sanders), shy ingénue Bailey (Jan Smithers) and, of course, the station's lovely receptionist, Jennifer (Loni Anderson). So sit back and enjoy the sound of uproarious laughter as you watch all 90 episodes of this iconic series!\", 'Bonus Content:', 'Disc 13:', 'WKRP in Cincinnati: A Paley Center Reunion', 'WKRP in Cincinnati: A Paley Center Reunion', '\"Do My Eyes Say Yes?\" Featurette', '\"Do My Eyes Say Yes?\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', 'A Conversation with Gary Sandy', 'A Conversation with Gary Sandy', ']]>', 'Review', 'Shout! Factory has done yeoman’s work in trying to correct this with', 'WKRP in Cincinnati: The Complete Series', '...The image quality, considering this series was originally shot on video tape, is almost uniformly outstanding. And, once again, Andy is overseeing a station playing the likes of Bruce Springsteen, the Rolling Stones, AC/DC, the Grateful Dead, Tom Petty, Elvis Costello, the Cars, Wings and the Police, instead of a series of featureless Muzak tracks.  Nick DeRiso -Nick DeRisosomethingelsereviews.com']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'DVD', 'Contributor': 'Richard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim ReidRichard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim Reid  See more', 'Language': 'English', 'Number Of Discs': '12', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.45 Pounds', 'Item model number': 'generic', 'Media Format': 'DVD', 'Run time': '37 hours and 30 minutes', 'Release date': 'April 17, 2018', 'Actors': 'Howard Hesseman, Frank Bonner, Gary Sandy, Tim Reid, Richard Sanders', 'Subtitles': 'Afrikaans', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '12'}\nReview Text: This was a great series for sure and the music is important to me.  However, I also want a great picture.  Too many of the Shout Factory TV series releases video and sound quality have been poor.  I just watched a video teaser on the Shout website and if this is the same quality as the actual release, we are all in for a real treat.  This looks so much better than the original TV broadcasts.  Can't wait to see this.....\nReview Title: Music important, but so is picture quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Big Bang Theory: Season 8\nReview Date: 2016/02/11\nStore: Johnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley CuocoMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley Cuoco   See more', 'Initial release date': '2015-09-15', 'Language': 'English'}\nReview Text: What can I say?  This is my favorite show.  Picture quality is excellent.  Nice not to have to look at station logos, pop-ups and commercials as when originally aired.  Looking forward to buying season 9.\nReview Title: My favorite show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: Season 4\nReview Date: 2016/06/02\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['The Middle: The Complete Fourth Season', 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher and Atticus Shaffer star as the middle class, middle of the country (i.e. Orson, Indiana) Heck family in this warm and witty comedy about raising a family and lowering your expectations. While Frankie continues to struggle selling cars at the only remaining car dealer in town, an unexpected turn of events might force her to reevaluate her career path. Axl’s slothlike days are numbered, now that Mike’s made it his mission to ensure that his oldest son somehow earns a sports scholarship and goes to college next year. Meanwhile, Sue’s not only navigating high school, but wants to navigate Indiana roads – by getting her driver’s license. It’s no wonder that youngest son Brick keeps his nose in a book!', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn HelinePatricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn Heline   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '883929373925', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Run time': '8 hours and 32 minutes', 'Release date': 'February 25, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'Spanish, French, English', 'Producers': 'DeAnn Heline, Eileen Heisler', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Either you like this show, or you hate it.  I like it a lot.  Laugh out loud several time every episode.  Video and audio quality is excellent.\nReview Title: Funny, Funny, Funny\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: The Complete Fifth Season\nReview Date: 2016/06/02\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['The quirky misadventures of one of the Heartland’s most hilarious families continue as the middle returns for a fifth fitful season… and family dynamics have never been funnier. As the middle-aged, middle-class, middle of the country mom, Frankie Heck (Patricia Heaton) tackles the mundane chaos of everyday life, her kids – recent high school graduate Axl (Charlie McDermott), sophomore Sue (Eden Sher) and the quirky middle-schooler Brick (Atticus Shaffer) – are continually manufacturing drama, while her laconic husband, Mike (Neal Flynn) offers support from the sidelines (re. the living room couch). Juggling her new job as a dental assistant with school projects, teenage theatrics and a husband in emotional low gear, Frankie struggles to use her wry wit and sense of humor to get her family through each day intact. But through all the madness, the Hecks muddle through…and together they’re keeping the middle on the map.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Eden Sher, Neil Flynn, Atticus Shaffer, Charlie Mcdermott', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '1000532061', 'Media Format': 'NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 9, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie Mcdermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'English', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nReview Text: Super funny show.  Every season actually gets better in my opinion.  Audio and video quality is very good.\nReview Title: Still funny....\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hearts Afire - The Complete Series\nReview Date: 2016/08/02\nStore: John Ritter  (Actor),     Markie Post  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: ['Hearts Afire - The Complete Series 7-Disc DVD']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Contributor': 'Markie Post, John Ritter, Billy Bob Thornton', 'Language': 'English', 'Number Of Discs': '7', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8 Ounces', 'Item model number': '52888', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Run time': '21 hours and 44 minutes', 'Release date': 'January 8, 2013', 'Actors': 'John Ritter, Markie Post, Billy Bob Thornton', 'Studio': 'Mill Creek Ent', 'Number of discs': '7'}\nReview Text: I have just started watching this series on DVD for the first time.  So far, I like it.  However, the quality of the video is not what it should be.  Yes, this is an older series, but I have DVD's of much older series that look far superior.  I don't think any effort was taken to improve the picture quality by Mill Creek Entertainment.  For that reason I have deducted the one star.\nReview Title: Good, except for picture quality....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night Court: The Complete Ninth Season\nReview Date: 2016/08/03\nStore: Harry Anderson  (Actor),     John Larroquette  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Night Court's ninth and final season sees Judge Harry(HARRY ANDERSON) and company rethinking careers and companions, while Bull (RICHARD MOLL) stumbles through the wedding china on his way to matrimonial bliss. It's a good thing Bull has Harry, Mac (CHARLES ROBINSON), Roz (MARSHA WARFIELD) , Christine (MARKIE POST) and even Dan (JOHN LARROQUETTE) on hand to get him to the altar on time. While Harry considers a career in higher education, Christine takes a look at Congress as Dan rethinks his commitment to his primary field of interest (it's spelled S-E-X). Meanwhile ditzy-but-stunning court steno Lisette (JOLEEN LUTZ) is harboring a secret of her own, one that concerns a prominent member of the cast. And what on Earth do aliens want with Bull? Mel Torme, Gilbert Gottfried, and Stephen Root are all found among the season's memorable guest-stars. But as the final hour airs -- and the cast depart for different climes, whither Judge Harry? A 3-Disc, 22-Episode Collection.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Charles Robinson, John Larroquette, Markie Post, Marsha Warfield, Richard Moll, Harry Anderson', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '402621', 'Media Format': 'NTSC', 'Run time': '11 hours', 'Release date': 'June 11, 2013', 'Actors': 'Harry Anderson, John Larroquette, Markie Post, Richard Moll, Charles Robinson', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nReview Text: Just finished watching all nine seasons on DVD.  Pretty good series.  Nice to see how things were wrapped up the final season.  Glad I bought the whole series.\nReview Title: Still Funny....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night Court: The Complete Eighth Season\nReview Date: 2016/08/07\nStore: Harry Anderson  (Actor),     John Larroquette  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Originally conceived as the final season, Night Court's eighth hit year saw the show's creators moving some very long simmering subplots off the back burner and on the boil. As the season begins, Judge Harry (HARRY ANDERSON), DA Dan (JOHN LARROQUETTE), bailiff Bull (RICHARD MOLL), clerk Mac (CHARLES ROBINSON) and bailiff Roz (MARSHA WARFIELD) are welcoming Christine (MARKIE POST) back from maternity leave. The happy reunion is short-lived, however, as long-buried passions, secret guilts and long-lost relatives plunge the court into chaos. This being Night Court we are also treated to visits from a trick-or-treating Death (STEPHEN ROOT) and time travels with an angel (MEL TORME), and we brave a session at the horrific Day Court. By season's end, two characters may be unable to deny their love any longer in this 3-Disc, 24 Episode Collection.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'John Larroquette, Richard Moll, Harry Anderson', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '380233', 'Media Format': 'NTSC', 'Run time': '9 hours and 34 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Harry Anderson, John Larroquette, Richard Moll', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I have all nine seasons and find them all funny.  So much better than some of the newer shows.  I really think the show got even better when Markie Post joined the cast.\nReview Title: Still funny....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: The Complete Seventh Season\nReview Date: 2017/04/22\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"The Middle's seventh season sees each member of the Heck family breaking out of their comfort zones. Oldest son Axl (Charlie McDermott) begins his junior year, and the business major starts thinking seriously about his future. Daughter Sue (Eden Sher) starts her first year of college at the same campus that Axl attends -- much to his disgust -- with a new haircut and an even more optimistic outlook. Quirky youngest son Brick (Atticus Shaffer) begins his final year of middle school, and his equally quirky girlfriend, Cindy (Casey Burke), wants to take their romance to the next level -- holding hands! Finding themselves facing an emptier nest, Frankie (Patricia Heaton) wonders if her parental duties will ease up while Mike (Neil Flynn) finds himself in a bit of a midlife crisis -- shocking everyone by deciding to take some new chances. Could this finally be the year of the Hecks?\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Neil Flynn, Atticus Shaffer', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'NTSC', 'Run time': '8 hours and 48 minutes', 'Release date': 'November 15, 2016', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'English', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nReview Text: What can I say.  I like this series a lot and have all seasons on DVD.  Quality is fine.\nReview Title: A wonderful show.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Just Shoot Me!: The Complete Series\nReview Date: 2017/05/23\nStore: Laura San Giacomo  (Actor),     George Segal  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Box set, Color, NTSC, Full Screen', 'Contributor': 'Laura San Giacomo, David Spade, George Segal, Enrico Colantoni, Wendie Malick, Various', 'Language': 'English', 'Number Of Discs': '19', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Director': 'Various', 'Media Format': 'Box set, Color, NTSC, Full Screen', 'Run time': '54 hours and 28 minutes', 'Release date': 'September 5, 2017', 'Actors': 'Laura San Giacomo, George Segal, Wendie Malick, Enrico Colantoni, David Spade', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '19'}\nReview Text: While I am glad the entire 7 seasons will soon be available, it is a shame that now I have to buy duplicates of seasons 1,2,and 3 that I already purchase years ago.  So now no other choice if I want 4,5,6 and 7.<br />UPDATE:  9/22/17<br />Went ahead and got the full set.  Glad I did.  The picture quality is excellent.  Money well spent.\nReview Title: Great Show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bill Engvall Show: The Complete Second and Third Seasons\nReview Date: 2017/07/16\nStore: Bill Engvall  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Blue Collar Comedy Tour's breakout star Bill Engvall created, executive produces and stars as Bill Pearson, a family counselor who could use some counseling of his own to deal with his unconventional brood in this family-centered sitcom. TV titans Nancy Travis and Tim Meadows costar as wife and pal, while a pre-superstar Jennifer Lawrence (The Hunger Games) plays his precocious and pugnacious teenage daughter. Graham Patrick Martin and Skyler Gisondo round out the clan as Bill's boys: one a slacker, the other sly. This 3-Disc, 22-Episode Collection delivers up the remaining seasons of this TV favorite to a clamoring crowd of comedy fans hungry for some savory, old-fashioned family fare. In the final two seasons, the Pearsons face challenges both ordinary and unexpected, from the proper allowance to chore ratio and the horrors of prom to using Facebook to spy on your kids and a sudden, frightening downturn in the family finances.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Bill Engvall', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': 'WARA671737DVD', 'Media Format': 'NTSC', 'Run time': '7 hours and 44 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Bill Engvall', 'Subtitles': 'English', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Never watched this show when it was on TV.  I think the show is good.  I have always liked the red neck humor and I am a big fan of Nancy Travis (great actress and easy on the eyes).  Kids are funny and true to life.  Happy with the purchase.  I have all three seasons now on DVD.\nReview Title: Good Show!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bill Engvall Show: Season 1\nReview Date: 2017/07/16\nStore: Nancy Travis  (Actor),     Tim Meadows  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Bill Engvall Show: The Complete First Season (DVD)', 'A pet snake is loose in the house. A teen daughter thinks “no” is an insufficient response to her desire to get a belly button ring (okay, how about “NO!” ). Welcome to the Pearson home, where dad Bill, a family counselor, finds that guiding his own family is an ongoing therapy session. Blue Collar comedian Bill Engvall brings his winning dad-itude to the eight Season One episodes of this series that’s easygoing, relatable and therapeutically funny. As his own brood can use more than its fair share of counseling, Bill and wife Susan (Nancy Travis) search for ways to raise three mischievous kids. Hassles, humor and heart are all in abundance – from the Pearson family to yours.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Romance, Comedy, Sports', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Closed-captioned, Widescreen', 'Contributor': 'Nancy Travis, Skyler Gisondo, Graham Patrick Martin, Michael Leeson, J.P. Williams, Tim Meadows, Steve Hytner, Melanie Patterson, Bill Engvall, Jennifer LawrenceNancy Travis, Skyler Gisondo, Graham Patrick Martin, Michael Leeson, J.P. Williams, Tim Meadows, Steve Hytner, Melanie Patterson, Bill Engvall, Jennifer Lawrence  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.32 Ounces', 'Item model number': '3712275', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Closed-captioned, Widescreen', 'Run time': '2 hours and 56 minutes', 'Release date': 'May 20, 2008', 'Actors': 'Bill Engvall, Nancy Travis, Tim Meadows, Steve Hytner, Jennifer Lawrence', 'Subtitles': 'English', 'Producers': 'Melanie Patterson, Michael Leeson, Bill Engvall, J.P. Williams', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nReview Text: I purchased this because I had never seen the show.  I do like the series.  Liked it so much I bought seasons 2 and 3.  Good family show....\nReview Title: Family friendly viewing....\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Married... with Children: The Complete Series\nReview Date: 2017/08/01\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Spend some quality time with the family as you join hard-working husband Al (Ed O'Neill), housework-hating wife Peg (Katey Sagal), sexy daughter Kelly (Christina Applegate) and hopelessly horny son Bud (David Faustino) to celebrate the landmark TV sitcom\", 'Married...with Children', '. For 11 seasons it was brilliantly tasteless, daringly raunchy and a devilishly clever comedy that pun the \"fun\" in \"dysfunctional\". Now you can own this great collectible box set that\\'s guaranteed to give you hours and hours of domestic bliss.', 'Amazon.com', 'Married...with Children: The Complete First Season', 'When', 'Married... with Children', 'debuted on Fox TV on April 5, 1987 (followed by', 'The Tracey Ullman Show', \"a half-hour later), the grungy sitcom became an instant flagship for Rupert Murdoch's upstart network. The program's much-publicized working title,\", 'Not the Cosbys', \"(a dismissive reference to the cheerful vitality of Bill Cosby's hugely popular television clan on NBC's\", 'The Cosby Show', ') was a dead giveaway.', 'Married... with Children', 'was going to be a trashier, raunchier, and far more cynical view of the American nuclear family. But it turned out the series actually fell into other caustic-domestic entertainment traditions, notably the Don Ameche and Frances Langford radio comedy series from the 1940s,', 'The Bickersons', \", and Jackie Gleason's TV classic,\", 'The Honeymooners', '.', \"The jokes were savage, key relationships were marked by ennui and indifference, and the Bundy family name couldn't help but make one think of America's most notorious, real-life serial killer at the time. Yet the show had a hint of Golden Age Hollywood gloss, a retro-screwball feel that one could detect in the snappy verbal warfare between husband Al Bundy (Ed O'Neill) and wife Peggy (Katey Sagal). The characters, and the show, eschewed sentimentality, which certainly opened the floodgates to comic cynicism but also kept a door ajar for moments of genuine sweetness. A decade later, however, by the time Fox cancelled the increasingly expensive series,\", 'Married... with Children', \"'s first-season tone would be considerably different, replaced by a stronger reliance on running jokes and character stereotypes, particularly concerning Bundy children Kelly (Christina Applegate) and Bud (David Faustino).\", 'That evolution makes watching', 'Married... with Children', '\\'s first 13 episodes, once again, quite instructive. Those programs are all on this two-disc set, including the startling pilot, in which Al and Peggy lock horns over marital politics and enlist naive new neighbors Steve (David Garrison) and Marcy (Amanda Bearse) in a battle of the sexes. There\\'s also the classic \"Whose Room Is It, Anyway,\" concerning the Bundys\\' competition to connive Steve and Marcy into building a recreation room, and \"Thinnergy,\" a very funny piece about a diet that supposedly boosts sexual interest.', '--Tom Keogh', 'Married...with Children: The Complete Second Season', 'Perhaps the definitive episode of', 'Married... with Children', 'is near the end of the second season, when Al and Peg Bundy (Ed O\\'Neill and Katey Segal), pretending to be their recently married neighbors, go on a game show that tests how willing each newlywed is to torture their spouse. This episode has everything: The cascade of blithe insults, the cheerful shredding of all dignity, the outright celebration of humanity\\'s worst instincts-- everything that has led self-satisfied arbiters of \"culture\" to proclaim', 'Married... with Children', \"the most sordid, distasteful sitcom in the history of mankind. In short, it's sheer genius.\", \"As the petty, miserable, conniving, yet perversely vital Bundy family, O'Neill, Segal, Christina Applegate, and David Faustino give performances that walk a fine line between outrageous satire and painful truth. It's the anti-\", 'Cosby', \"; family breeds contempt. Children scoff at their parents, parents resent their children, husbands and wives eye each other with suspicion and disdain. Episodes hinge on neutering their oversexed dog, fighting the phone company, and trying to humiliate a high school nemesis in a bowling tournament, but it's all an excuse for squalid delirium. This is not an ironic description of the show;\", 'Married... with Children', 'is both ruthless and deeply funny. (Though created by men,', 'Married... with Children', \"was frequently produced, written, and directed by women, which is unusual in the sitcom world. This doesn't necessarily have anything to do with its sense of humor, but its eagerness to skewer and roast sacred cows is shared by such women-driven shows as\", 'Roseanne', 'and', 'Absolutely Fabulous', \".) The jokes are like blunt instruments, yet delivered with a unique panache that got honed to razor sharpness in the second season. If you've never experienced the Bundy clan, this is an excellent place to start.\", '--Bret Fetzer', 'Married...with Children: The Complete Fourth Season', \"It's fitting that the producers of\", 'Married...With Children--The Complete Fourth Season', 'were too cheap to pay for the rights to the show\\'s classic theme song, the jaunty Sinatra tune \"Love & Marriage,\" replacing it with some crappy instrumental. Not because the season is lousy--on the contrary, the show\\'s crass and cynical wit is in full bloom--but because if the Bundys themselves were putting this out, they\\'d blow off the theme song as well. One of the longest-running sitcoms ever,', 'Married...With Children', \"portrayed American domestic life as bitter, sleazy, and perpetually hungry, yet bound together by the loyalty of the mutually damned. Emasculated shoe salesman Al Bundy (Ed O'Neill,\", 'Dutch', ',', 'Spartan', '), his lazy and unsatisfied wife Peg (Katey Sagal,', '8 Simple Rules', '), his dimwitted slut of a daughter Kelly (Christina Applegate,', 'Anchorman', ',', 'View from the Top', '), and his horny, conniving son Bud (David Faustino,', 'The Trouble with Frank', \") all bicker and scheme to achieve any meager improvement of their lives. For example, Peg wants to buy an idol of Tubro, the fat Panamanian god of money, hoping that good luck will help her win the lottery; so she sells Al's beloved\", 'Playboy', \"collection, launching Al into the depths of despair until he musters the shreds of his manhood and orders her to retrieve them. Or when Al, feeling suicidal on Christmas, gets a glimpse of how happy his family would be if he'd never been born and decides to live to keep their lives as awful as his has been. But it's not simply the parade of suburban atrocity that makes the show funny--it's the zest of the cast, who wallow in their white trash characters with gusto and commitment. Their glee gives the show a sardonic bite that transforms the squalor into something strangely giddy and transcendent, a vivisection of human pettiness that an 18th century novelist like Thackeray would appreciate. The fourth season features a startling array of guest stars, including Milla Jovovich (\", 'The Fifth Element', '), Joe Flaherty (', 'SCTV', '), Tiffani-Amber Thiessen (', 'Beverly Hills 90210', '), screaming comedian Sam Kinison, and former porn starlet Traci Lords.', '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Married With Children', 'Language': 'English', 'Number Of Discs': '32', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '8.1 x 5.7 x 2.9 inches; 1 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '99 hours and 22 minutes', 'Release date': 'September 27, 2011', 'Actors': 'Married With Children', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '32'}\nReview Text: What can I say.  Either you will like this show or hate it.  I like it.  However, it is starting to show its age.  Not as funny as I remembered it, but still makes me laugh.  Well worth the price.\nReview Title: Good addition to my collection\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jeff Foxworthy Show: The Complete Series\nReview Date: 2017/08/11\nStore: Jeff Foxworthy  (Actor),     Anita Barone  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['A comedy fit for the whole trailer park!', 'There goes the neighborhood!', \"If you're a redneck, then... you'll love Jeff Foxworthy in his first TV show! Foxworthy, a popular stand-up comic, stars as a hardworking husband and father. With his loving wife Karen and precocious son Matt (Haley Joel Osment), he has a single-family house full of double-wide laughs!\", 'Together, the Foxworthy clan is giving the Midwest a taste of Southern hilarity. As the owner of a heating and air company, Jeff takes his signature brand of humor and turns the American dream on its ear. Between paying his mortgage, running his business and raising his son, he learns what every self-respecting redneck knows: tractor pulls come and go, but family is forever!', 'Contents:', 'Disc 1', 'SEASON 1', \"Episode 1: Jeff's Life 101 Sept. 12, 1995Episode 2: A Non-Affair to Remember Sept. 16, 1995 Episode 3: The Gene Pool Sept. 23, 1995 Episode 4: Elliot and Victoria's Secret Sept. 30, 1995 Episode 5: Womb with a View Oct. 14, 1995 Episode 6: With Two You Get Cow's Milk Oct. 28, 1995 Episode 7: Jeff & Ray & Rascal's Big Adventure Nov. 4, 1995 Episode 8: A Sore Winner Nov. 11, 1995 Episode 9: He's Making a List, Checking It Twice Nov. 25, 1995\", 'Disc 2', \"Episode 10: Foxworthy Family Feud Dec. 16, 1995 Episode 11: Matt About You Dec. 23, 1995 Episode 12: Clan of the Bare Caves Jan. 6, 1996 Episode 13: Before You Say 'No' Just Hear Me Out Jan. 13, 1996 Episode 14: DeeDee Day Jan. 20, 1996 Episode 15: He Ain't Heavy, He's a Bully Jan. 24, 1996 Episode 16: Moonstruck Feb. 3, 1996 Episode 17: Shootout at the Comedy Corral Unaired Episode 18: One Wedding and a Baby May 15, 1996\", 'Disc 3', 'SEASON 2', \"Episode 1: Where the Donuts Are Good, Not Great Sept. 23, 1996Episode 2: The List Is Strife Sept. 30, 1996 Episode 3: The Poor Sportsmen of the Apocalypse Oct. 7, 1996 Episode 4: My Dinner with Betty Oct. 14, 1996 Episode 5: The Gift Oct. 21, 1996 Episode 6: The Practical Joke Oct. 28, 1996 Episode 7: Puppy Love Triangle Nov. 11, 1996 Episode 8: Like Florus, Like Son Nov. 18, 1996 Episode 9: The Thanksgiving Episode Nov. 25, 1996Episode 10: Merry Christmas, Y'All Dec. 16, 1996 Episode 11: Feud for Thought Jan. 6, 1997\", 'Disc 4', \"Episode 12: Can't Teach an Old Dog New Tricks Jan. 13, 1997Episode 13: The Briarton Syndrome Jan. 20, 1997 Episode 14: Jeff, You the Man Feb. 3, 1997 Episode 15: Big Dogs Feb. 17, 1997 Episode 16: Foxworthy Shall Rise Again March 3, 1997 Episode 17: Gone Fishin' March 10, 1997 Episode 18: Mooseface Loves Nuzzles March 17, 1997 Episode 19: The Good, the Bad and the Hairless April 7, 1997 Episode 20: Real Men April 14, 1997 Episode 21: Wrestling Opera April 28, 1997 Episode 22: Twister of Fate May 5, 1997 Episode 23: Field of Schemes May 5, 1997\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'Haley Joel Osment, Jonathan Lipnicki, Ann Cusack, Matt Borlenghi, Matt Clark, Anita Barone, Various, Jeff Foxworthy, Bill Engvall, G.W. BaileyHaley Joel Osment, Jonathan Lipnicki, Ann Cusack, Matt Borlenghi, Matt Clark, Anita Barone, Various, Jeff Foxworthy, Bill Engvall, G.W. Bailey   See more', 'Language': 'English', 'Runtime': '15 hours and 23 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '15 hours and 23 minutes', 'Release date': 'August 18, 2015', 'Actors': 'Jeff Foxworthy, Anita Barone, Ann Cusack, Haley Joel Osment, Matt Clark', 'Studio': 'Sony Pictures Home', 'Number of discs': '4'}\nReview Text: Since reviews were so positive I purchased this show, never having seen the show.  I agree, this is a good funny family show.\nReview Title: Funny redneck humor....\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Middle: The Complete Eighth Season\nReview Date: 2017/09/10\nStore: Patricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Neil Flynn, Atticus Shaffer', 'Language': 'English', 'Number Of Discs': '3'}\nReview Text: Glad to see the DVD for this season was available.  One of my favorite TV shows.  Have all seasons so far.  Quality of the picture is excellent.  Well worth the price if you are a fan and want to watch anytime without commercials....\nReview Title: Worth the Price\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Norm Show: The Complete Series\nReview Date: 2017/09/10\nStore: Norm MacDonald  (Actor),     Ian Gomez  (Actor),     Steve Zuckerman  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: ['Product Description', 'All 54 Original EpisodesFrom Norm Macdonald and executive producer Bruce Helford (creator of', 'The Drew Carey Show', ') comes this warped look at a pro hockey player turned criminal turned social worker. Meet Norm Henderson. Once a fairly well-known, but not particularly skilled, professional hockey player, Norm had a penchant for gambling and an aversion to paying taxes that resulted in his expulsion from hockey for life. Facing a possible jail term, Norm was instead sentenced to community service as a caseworker in social services, where his mischievous and sarcastic personality has him breaking all the rules, leaving his friends, by-the-book coworker Laurie (Laurie Metcalf,', 'Roseanne', ') and neurotic colleague Danny (Ian Gomez,', 'Cougar Town', '), to constantly help him out of trouble. Also starring Max Wright (', 'ALF', ') as his Boss Mr. Denby, Nikki Cox (', 'Las Vegas', ') as Taylor the ex-prostitute social worker and Artie Lange (', 'The Howard Stern Show, Dirty Work', ') as his crooked if not crazy half-brother: smart, edgy, dry comedy was the norm.', 'Amazon.com', 'In the booklet that accompanies this welcome boxed set,', 'The Norm Show', 'cocreator Bruce Helford calls this late lamented series \"the one that got away.\" A show that was just getting better as it went along, it fell prey to the vagaries of network scheduling, moved from Wednesday nights where it did very well to the programming sinkhole that is Friday night, where it did not, and was cancelled after three seasons. Helford also cocreated', 'The Drew Carey Show', ', and', 'Norm', \"is cut from the same cloth. It shares the same off-center rhythms, delight in meta-musings and tweaking sitcom conventions, and cold openings, such as Norm's parsing of TV's ratings system (with rebuttal in one episode by the Devil) and the episode that begins apropos of nothing with costumed cast members engaged in a Pokémon battle. The show also engaged in Carey-esque stunts, such as the punch line and movie reference contests. Norm MacDonald is a pricklier personality than Carey. His Norm is not as likeable as Carey's Everyman. He is a former professional hockey player who avoids jail for tax evasion by performing community service as a social worker. He is a slacker in an office of dedicated professionals, including compassionate and overworked Laurie (the remarkable Laurie Metcalf) and the luckless and sensitive Danny (Ian Gomez). To the show's credit, little effort is made to dull Norm's sarcastic and acerbic edge that made him one of\", 'SNL', '\\'s best Weekend Update anchors and Conan O\\'Brien\\'s most dependably funny talk show guests. In one episode, when Danny says, \"But you don\\'t want to hear my problems,\" Norm replies, \"Thanks, buddy. I was gonna say that but I thought it\\'d sound bad.\" The ensemble also includes sitcom veterans who raised MacDonald\\'s game, including', 'Murphy Brown', \"'s Faith Ford as Norm's social worker and romantic interest,\", 'Alf', \"'s Max Wright as Norm's tormented boss, MacDonald's\", 'Dirty Work', 'costar Artie Lange as Norm\\'s irresponsible brother, and Nikki Cox as Taylor, a former hooker, whom Norm helps rehabilitate. There are no Very Special Episodes, but several involving story arcs (Norm lapses into gambling, Danny and Taylor\\'s budding relationship). And just for fun, there are memorable cameos (Richard Pryor in his last screen appearance as an abusive and uncooperative case, Lou Rawls as a hansom cab driver) and guest star turns, including Jack Warden as Danny\\'s macho father who may be gay and Tommy Smothers as Norm\\'s less than paternalistic father. As the show got better, so did its opening credit sequences. Season 2\\'s never gets old, a comically choreographed street scene that perfectly encapsulates the characters. Extras are limited to several entertaining audio commentaries by MacDonald and Helford, who share writing and comedy insights and secrets from the set (during the episode \"Norm Dates Danny\\'s Dad,\" Helford reveals Norm\\'s failed catchphrase that, alas, can\\'t be repeated here).', '--Donald Liebenson']\nAverage Rating: 4.6\nProduct Details: {'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Steve Zuckerman, Faith Ford, Laurie Metcalf, Artie Lange, Norm MacDonald, Max Wright, Ian Gomez', 'Language': 'Unqualified', 'Number Of Discs': '8', 'Runtime': '19 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'SF12056', 'Director': 'Steve Zuckerman', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Run time': '19 hours and 45 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Norm MacDonald, Ian Gomez, Laurie Metcalf, Faith Ford, Artie Lange', 'Studio': 'Shout Factory', 'Number of discs': '8'}\nReview Text: Had not seen the show before.  Find it funny after watching the first few episodes.  Picture quality is good.  Sound not bad either.  Glad I took the plunge.\nReview Title: Funny Show\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Monuments Men [DVD]\nReview Date: 2019/07/24\nStore: George Clooney  (Actor, Director, Writer),     Matt Damon  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Based on the true story of the greatest treasure hunt in history, THE MONUMENTS MEN centers around an unlikely World War II platoon, tasked with going into Germany to rescue artistic masterpieces from Nazi thieves and returning them to their rightful owners. In a seemingly impossible mission, the Monuments Men, as they were called, find themselves risking their lives in a race against time to avoid the destruction of 1,000 years of culture.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama, Action/Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Hugh Bonneville, Matt Damon, Jean Dujardin, Robert M. Edsel, Grant Heslov, George Clooney, Cate Blanchett, Bret Witter, John Goodman, Bill MurrayHugh Bonneville, Matt Damon, Jean Dujardin, Robert M. Edsel, Grant Heslov, George Clooney, Cate Blanchett, Bret Witter, John Goodman, Bill Murray  See more', 'Language': 'Unknown (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 58 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Audio Description': 'English', 'Item model number': 'CTR42488DVD', 'Director': 'George Clooney', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'May 20, 2014', 'Actors': 'George Clooney, Matt Damon, Cate Blanchett, John Goodman, Jean Dujardin', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Columbia Pictures / Fox 2000 Pictures', 'Writers': 'Grant Heslov, George Clooney, Robert M. Edsel, Bret Witter', 'Number of discs': '1'}\nReview Text: Have not watched the movie, saw that it got good reviews and the trailer looked good.  Price was too low to pass up.\nReview Title: Great price\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Til Death - The Complete Series (Season 1-4)\nReview Date: 2019/08/09\nStore: Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'DVD', 'Language': 'English', 'Number Of Discs': '12', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.4 x 2.4 inches; 1.2 Pounds', 'Media Format': 'DVD', 'Number of discs': '12'}\nReview Text: This is a really funny show, that is a little over the top, but somehow manages to not go too far out of the ordinary.  Great cast and many topical subjects buried within the story.  So glad I was able to buy on DVD.\nReview Title: Funny Show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Becker, Season 5 (2002-2003)\nReview Date: 2019/10/29\nStore: Ted Danson  (Actor),     Alex Desert  (Actor)    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"BECKER returns in the fifth season of the hit series starring Emmy -Award-winner* Ted Danson as the angry and difficult, yet talented and dedicated, Dr. John Becker. Becker's head nurse Margaret (Hattie Winston) continues to maintain order out of chaos, keeping John and ditzy nurse's aide Linda (Shawnee Smith) in line. Becker's friends, Jake (Alex Desert), the blind proprietor of the local newsstand, and Bob (Saverio Guerra), the annoying yet somehow likable super of Becker's apartment building, also return to listen to Becker's constant rants on his views of the world. This season, romance will rear its ugly head as Becker tries to deny his feelings for Chris (Nancy Travis), his new neighbor who acts uninterested. Later, Becker must deal with a patient who not only has high cholesterol, but also suffers from multiple personality disorder. Also, after overhearing a phone conversation, Linda and Margaret suspect Becker is taking drugs or having an affair. Catch up on all the laughter in this 3-disc set including all 22 Season Five episodes. *Outstanding Lead Actor In A Comedy Series, Cheers, 1990 and 1993\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'NTSC', 'Contributor': 'Nancy Travis, Shawnee Smith, Ted Danson, Alex Desert, Hattie Winston, Saverio Guerra', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Item model number': '6456558', 'Media Format': 'NTSC', 'Run time': '8 hours', 'Release date': 'June 11, 2013', 'Actors': 'Ted Danson, Alex Desert, Shawnee Smith, Hattie Winston, Saverio Guerra', 'Studio': 'CBS Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Great Show.  DVD quality very good.\nReview Title: Funny Show\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a strong preference for comedy, particularly in the form of TV series and movies, as evidenced by their consistent purchases across a variety of classic sitcoms and comedies. A notable admiration for older shows is present, reinforcing a desire for nostalgia and entertainment that emphasizes family dynamics and humor without excessive sentimentality.\n\nQuality is a recurrent theme, with multiple reviews expressing dissatisfaction with video and audio quality alongside praise for well-produced content. This suggests a discerning taste for media and a willingness to critique based on production standards. Price sensitivity is implied through reviews where the value of quality is contrasted with expectations, indicating that while high-quality productions are preferred, they are also mindful of cost-effectiveness.\n\nThe buyer’s reviews show an engagement in detailed assessments, highlighting specific aspects of picture and sound quality, while maintaining an appreciation for humor and storytelling. The consumer largely seeks comfort in familiar genres and narratives, and they express excitement about acquiring comprehensive collections to revisit beloved content. Overall, their preference leans heavily toward classic comedies with a focus on character-driven humor, satisfying production quality, and a balanced approach to pricing.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Funny, Funny, Funny",
    "text": "This is one of my favorite series.  Cast is great.  Wish it had gone on longer.  DVD quality is very good.",
    "images": [],
    "asin": "B00O83UNZM",
    "parent_asin": "B00O83UNZM",
    "user_id": "AGEGRCKAVOOM2RWMHNQZATHZTUXA",
    "timestamp": "2019-12-09 16:54:18.344000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Becker, Final Season",
    "average_rating": 4.7,
    "rating_number": 187,
    "features": [],
    "description": [
      "BECKER is back for the sixth and final season. Emmy Award winner* Ted Danson stars as Dr. John Becker who runs a small practice in The Bronx. Becker's head nurse Margaret (Hattie Winston) and ditzy nurse's aide Linda (Shawnee Smith) and friends, Chris (Nancy Travis), Jake (Alex Desert), and Hector (Jorge Garcia) joins Becker as he continues with his constant rants on his views of the world. This season Jake tells everyone he sold his dreadlocks for money because he is in so much debt. Chris and John admit they said \"I Love You\" to each other and have their first official date. Linda takes on a new hobby - Feng Shui and completely redesigns John's office making him furious. Margaret gets a part time job as a telemarketer, but accidentally signs on to be an operator for a sex talk phone line. Get a dose of comedy in this 3-disc set including all 22 season six episodes. *Outstanding Lead Actor In A Comedy Series, Cheers, 1990 and 1993"
    ],
    "price": 22.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51nQG1Rz9HL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51nQG1Rz9HL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Ted Danson  (Actor),     Nancy Travis  (Actor)    Format: DVD",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "DVD"
    ],
    "details": {
      "Genre": "Comedy/Television, Television",
      "Format": "NTSC",
      "Contributor": "Nancy Travis, Shawnee Smith, Ted Danson, Alex Desert, Jorge Garcia, Hattie Winston",
      "Language": "English",
      "Number Of Discs": "2",
      "Aspect Ratio": "1.33:1",
      "Product Dimensions": "7.5 x 5.5 x 0.5 inches; 3.5 Ounces",
      "Media Format": "NTSC",
      "Run time": "4 hours and 43 minutes",
      "Release date": "December 17, 2014",
      "Actors": "Ted Danson, Nancy Travis, Alex Desert, Shawnee Smith, Jorge Garcia",
      "Studio": "CBS",
      "Country of Origin": "USA",
      "Number of discs": "2"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}