{
  "user_id": "AF25FDK4Y2VBP3UX5PKPEZ5SIE3Q",
  "summary": "=== Purchase Information ===\nProduct Title: Cartoon Network: Chowder: Volume 2\nReview Date: 2012/12/24\nStore: Nicky Jones  (Actor),     John DiMaggio  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Cartoon Network: Chowder: Volume 2', 'Marzipan City is a place where anything can happen and the unorthodox is commonplace. In the middle of this bizarre city is a quaint little shop known as Mung Daal Catering, which is owned by Mung Daal, one of the ost accomplished chefs and well known in the entire world. However, things have become a bit hectic in the kitchen as of late, as Mung Daal has recently acquired a young apprentice named Chowder, whom he wishes to pass along all of his knowledge towards. Chowder is an energetic young lad who wishes to become the greatest chef in the world, but his love of food and his extremely short attention span often results in him causing unintended havoc. However, theyre not alone. Truffles works at Mung Daal Catering and she takes the orders that her husband, Mung Daal, must prepare. Shnitzel, a rock monster, also helps out in the kitchen as he has worked for Mung Daal for years. Along the way, theyll meet the many colorful and zany residents of Marzipan City, though there will always be new dishes to prepare and exciting recipes to follow.', ']]>', 'Amazon.com', 'Five more episodes of', 'Chowder', 'await fans of the surreal and sublimely silly animated television series on this delicious second volume DVD. As with its predecessor, the episodes are not in broadcast order, which has no effect on their enjoyment; each of the 22-minute stories (broken into two 11-minute episodes) stands on its own in terms of zaniness and visual charm. Strongest among the batch included here is the Emmy- and Annie-nominated “Burple Nurples,” which circles around a somewhat morbid conceit: in an attempt to make the title dish, aspiring chef Chowder accidentally laces it with rat poison, sending his boss and mentor Mung Daal on a mad quest to track down all of his creations. Other episodes underscore the show’s gentle blend of kid-friendly storylines and out-and-out wackiness: “Mung on the Rocks” gives Chowder a chance to prove himself by bailing Mung out of a pickle with his wife, Truffles, while its companion piece, “Sniffleball,” finds our hero facing the classic conundrum: will he be the hero in a game of sniffleball or the goat? It’s this inherent sweetness, mixed with the lovely, off-kilter artwork and characterizations that make', 'Chowder', 'so appealing to viewers of all ages. Extras detailing the conception of this unique show would have been appreciated, but only a gallery of sketches and designs are present on this disc.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Contributor': 'C.H. Greenblatt, Tara Strong, John DiMaggio, Dwight Schultz, Nicky Jones, Liliana Mumy, Dana Snyder', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.4 Ounces', 'Item model number': 'DT90008D', 'Media Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Run time': '1 hour and 50 minutes', 'Release date': 'March 3, 2009', 'Actors': 'Nicky Jones, John DiMaggio, Liliana Mumy, Tara Strong, Dana Snyder', 'Subtitles': 'English', 'Producers': 'C.H. Greenblatt', 'Studio': 'WarnerBrothers', 'Writers': 'C.H. Greenblatt', 'Number of discs': '1'}\nReview Text: My step-son loves chowder and has had the volume 1 disc for a long time. I got this one for him for good grades and he loves it. He watches it all the time.\nReview Title: For my step-son\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/05/25\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Farrne Blackburn', 'Tom Shankland'], 'Producers': ['Caroline Skinner', 'Sue Hogg'], 'Starring': ['Iain De Caestecker', 'Daniel Kaluuya', 'Tom Ellis'], 'Studio': ['BBC America']}\nReview Text: not very good quality, good concept, but bad acting as well. here are 9 more words, yep, there you go.\nReview Title: Couldn't get through it\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/09\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Yves Simoneau'], 'Producers': ['Not Specified'], 'Starring': ['Elizabeth Mitchell', 'Morris Chestnut', 'Joel Gretsch']}\nReview Text: Not as good as the original but worth watching if you're curious. Necessary spoiler, the second season ends abruptly with no resolution, so if you need a series to really end, this is not for you!\nReview Title: Not as good as the original but worth watching if you're curious\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/09\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Not Specified'], 'Starring': ['Eliza Taylor', 'Paige Turco', 'Thomas McDonell']}\nReview Text: Great first season for a show. A little cliche and predictable but over-all a good time.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/29\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill McClane', 'Ted Schillinger'], 'Producers': ['Bill McClane', 'Ted Schillinger', 'Emily Dillon Berry', 'Lena Bhise', 'Joe Flynn Connor', 'Shawn Cuddy', 'Jennifer DeQuattro', 'Bruce David Klein', 'Angela Marsh', 'Kevin Maguire'], 'Studio': ['National Geographic Channel']}\nReview Text: Not really a survival show and definitely not good. The first episode about &#34;zombies&#34; has nothing to do with zombies and drags on.\nReview Title: Not really a survival show and definitely not good. The first episode about \"zombies\" has nothing to ...\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/29\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Howard McCain'], 'Producers': ['Chris Roberts', 'John Schimmel'], 'Starring': ['Jim Caviezel', 'Sophia Myles', 'John Hurt'], 'Studio': ['Lionsgate']}\nReview Text: I've seen this before and loved it, but recently rented it so that my son could watch it. He loved it and I loved that it was action packed enough to keep his attention, but no nudity and I got to enjoy it too. Middle of the road movies are difficult to find with a 12-year-old and this one was definitely a hit.\nReview Title: I've seen this before and loved it, but recently rented it so that my ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/29\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susan Seidelman'], 'Producers': ['Midge Sanford', 'Sarah Pillsbury', 'Michael Peyser'], 'Starring': ['Rosanna Arquette', 'Madonna', 'Aidan Quinn'], 'Studio': ['MGM Domestic Television']}\nReview Text: Probably the best Madonna movie I've ever seen. Funny, cute, and great from beginning to end. Love this.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/04/06\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Testa', 'Luke Terbieten', 'Michael Simon', 'Ryan Polito', 'Brian Campbell'], 'Producers': ['Justin Sena', 'Mark Neal', 'Alevil Rincones', 'Carl Kocis III', 'Shawn Greenson']}\nReview Text: It's an MTV reality show so don't expect anything more than that. The first season was better but if you like some mindless drama and laughing at or yelling at the crazy things people will do for money, this is your show. The little southern girl is a kick in the pants.\nReview Title: The first season was better but if you like some mindless drama and laughing ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/04/06\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Robert Watts', 'George Lucas'], 'Starring': ['Harrison Ford', 'Kate Capshaw', 'Ke Huy Quan'], 'Studio': ['Paramount Internal ViacomCBS']}\nReview Text: 5*\nReview Title: Han solo with a whip.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Guyver\nReview Date: 2015/05/21\nStore: Jimmy Walker  (Actor),     Peter Spellos  (Actor),     Screaming Mad George  (Director),     Steve Wang  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\nProduct Description: ['Guyver, The (DVD)', 'An innocent college student is thrown into a world of bizarre adventures after finding “The Guyver,” an alien device that transforms him into a powerful fighting machine. Mark Hamill (Star Wars) stars as a CIA agent who is determined to keep the secret device from falling into the hands of evil Zoanoids, humans who mutate into monstrous soldiers. It’s sci-fi adventure at its best, with epic battles between the forces of good and evil.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Contributor': 'Michael Berryman, Spice Williams, Yoshiki Takaya, Brian Yuzna, Vivian Wu, Screaming Mad George, Jimmy Walker, Mark Hamill, David Gale, Steve Wang, Jack Armstrong, Peter SpellosMichael Berryman, Spice Williams, Yoshiki Takaya, Brian Yuzna, Vivian Wu, Screaming Mad George, Jimmy Walker, Mark Hamill, David Gale, Steve Wang, Jack Armstrong, Peter Spellos  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': '2261810', 'Director': 'Screaming Mad George, Steve Wang', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 31, 2005', 'Actors': 'Jimmy Walker, Peter Spellos, Michael Berryman, Spice Williams, Mark Hamill', 'Subtitles': 'English, Spanish', 'Producers': 'Brian Yuzna', 'Studio': 'New Line Home Entertainment', 'Writers': 'Yoshiki Takaya', 'Number of discs': '1'}\nReview Text: The Guyver is a kick ass 90's-tastic movie that is a childhood favorite of mine. So glad I finally have it on DVD. Introduced to my 12-year-old and he loves it too.\nReview Title: ... a kick ass 90's-tastic movie that is a childhood favorite of mine\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Ice Pirates\nReview Date: 2015/05/21\nStore: Robert Urich  (Actor),     Mary Crosby  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\nProduct Description: ['Product Description', 'Ice Pirates (DVD)', 'Robert Urich, Mary Crosby and Anjelica Huston star in this glorious send-up of the entire science fiction genre as an interstellar band of pirates steals from the rich to give to the poor, helps a princess find her lost father and discovers a source of water to slake the thirst of the entire galaxy!', ']]>', 'Amazon.com', 'The amiable sci-fi spoof', 'The Ice Pirates', 'has earned a small but vocal cadre of admirers thanks to its go-for-broke gags and a healthy disrespect for outer space epics like the', 'Star Wars', 'and', 'Star Trek', 'franchises. An atypically goofy Robert Urich stars as the leader of a band of space pirates who kidnap a princess (Mary Crosby of', 'Dallas', 'fame), and then join her quest to find a mythical planet that can solve the universe\\x92s water shortage. A completely game (shameless?) cast (which includes Anjelica Huston in fetching leather gear, Ron Perlman, John Matuszak, and fantastic film icon John Carradine) and Stewart (', 'The Philadelphia Experiment', ') and Raffill\\x92s breezy direction help sell the funniest bits (most notably, the notorious \"space herpy\" scene, and the frantic time-warp finale) and make the more leaden jokes palatable.', '--Paul Gaita']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Fantasy, Comedy, Science Fiction', 'Format': 'Multiple Formats, Closed-captioned, Color, Dubbed, NTSC, Subtitled', 'Contributor': 'John Matuszak, John Carradine, Natalie Core, Anjelica Huston, Mary Crosby, John Foreman, Stewart Raffill, Jeremy West, Robert Urich, Ron Perlman, Michael D. Roberts, Bruce VilanchJohn Matuszak, John Carradine, Natalie Core, Anjelica Huston, Mary Crosby, John Foreman, Stewart Raffill, Jeremy West, Robert Urich, Ron Perlman, Michael D. Roberts, Bruce Vilanch   See more', 'Initial release date': '2005-07-12', 'Language': 'English (Dolby Digital 1.0), French (Dolby Digital 1.0), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.08 Ounces', 'Item model number': 'WHV67011DVD', 'Director': 'Stewart Raffill', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 12, 2005', 'Actors': 'Robert Urich, Mary Crosby, Michael D. Roberts, Anjelica Huston, John Matuszak', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'John Foreman', 'Studio': 'Studio Distribution Services', 'Writers': 'Stewart Raffill', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Ice Pirates is just horrible in the best way. You have to love this movie for the goofy space parody that it is.\nReview Title: Ice Pirates is just horrible in the best way\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tangled\nReview Date: 2015/05/21\nStore: Mandy Moore  (Actor),     Zachary Levi  (Actor),     Nathan Greno  (Director),     Byron Howard  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Disney presents a new twist on one of the most hilarious and hair-raising tales ever told. Your whole family will get tangled up in the fun, excitement and adventure of this magical motion picture.When the kingdom\\'s most wanted - and most charming - bandit Flynn Rider hides in a mysterious tower, the last thing he expects to find is Rapunzel, a spirited teen with an unlikely superpower - 70 feet of magical golden hair! Together, the unlikely duo sets off on a fantastic journey filled with surprising heroes, laughter and suspense.Let your hair down and get ready to cheer for \"Tangled.\" Bursting with never-before-seen bonus features, it\\'s even more enchanting on Blu-ray Hi-Def.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, SubtitledMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled  See more', 'Contributor': 'M.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. TompkinsM.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. Tompkins  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'WD10633400DVD', 'Director': 'Nathan Greno, Byron Howard', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 29, 2011', 'Actors': 'Mandy Moore, Zachary Levi, Donna Murphy, Ron Perlman, M.C. Gainey', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Walt Disney Pictures', 'Number of discs': '1'}\nReview Text: No review necessary. It's great if you love Disney princess movies.\nReview Title: It's great if you love Disney princess movies\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ruby Sparks\nReview Date: 2015/08/05\nStore: Paul Dano  (Actor),     Zoe Kazan  (Actor),     Jonathan Dayton  (Director),     Valerie Faris  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Calvin (Paul Dano) is a young novelist who achieved phenomenal success early in his career but is now struggling with his writing -- as well as his romantic life. Finally, he makes a breakthrough and creates a character named Ruby who inspires him. When Calvin finds Ruby (Zoe Kazan), in the flesh, sitting on his couch about a week later, he is completely flabbergasted that his words have turned into a living, breathing person.', 'Amazon.com', 'A romantic comedy about love and control from the directors of', 'Little Miss Sunshine', ',', 'Ruby Sparks', \"is an appealingly wacky story about novelist Calvin (Paul Dano) and his relationship with a fictitious woman. Struggling with writer's block and grieving over a failed actual relationship, Calvin looks to his brother (Chris Messina) and therapist (Elliott Gould) for guidance, but initially he finds only distraction and frustration. The therapist suggests an assignment that soon has Calvin writing about Ruby Sparks (Zoe Kazan), a fictitious woman who loves him completely and unconditionally. The only problem is that Calvin is becoming obsessed with his new character, imagining that he's actually spending every waking moment with this ideal woman he's created--surely a sign that he's losing his mind. When Calvin discovers that other people can see Ruby too, he throws himself wholeheartedly into the perfect relationship with the perfect woman. Then he starts to feel guilty about possessing absolute control over Ruby's thoughts and actions and begins to question whether Ruby really loves him or whether he is making her love him. Calvin locks away his manuscript and stops writing, and things begin to change between the couple. Eventually Calvin must decide whether he can be content the way things are or whether he must set his creation free--even if it costs him his own happiness.\", 'Ruby Sparks', \"is a romantic comedy full of laughably ridiculous situations, but it's also a thought-provoking film about control and acceptance.\", '--Tami Horiuchi']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Zoe Kazan, Jonathan Dayton, Paul Dano, Valerie Faris', 'Language': 'English', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'FOX2279153DVD', 'Director': 'Jonathan Dayton, Valerie Faris', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 30, 2012', 'Actors': 'Paul Dano, Zoe Kazan', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Fox Searchlight', 'Number of discs': '1'}\nReview Text: I loved this movie. It was bright, funny, and surprisingly serious. It was everything I had hoped for when I first saw a preview for it.\nReview Title: I loved this movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Playing it Cool\nReview Date: 2015/08/05\nStore: Chris Evans  (Actor),     Michelle Monaghan  (Actor),     Justin Reardon  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Chris Evans stars as a disillusioned writer with a big imagination that consists mostly of hot women yielding to his every desire. He is indifferent to the whole concept of true love until he meets HER (Michelle Monaghan), a breathtaking young woman who shakes all his previous beliefs. His buddies, all fellow writers, give him way too much advice, mostly along the lines of getting lucky before getting in too deep. The one thing they do not tell him is to lie through his teeth, which he ends up doing just so he can spend time with her. When the truth comes out, all hell breaks loose and he ends up as the star in his own tragedy.']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC, Multiple Formats, Widescreen, Closed-captioned, Dolby', 'Contributor': 'Topher Grace, Aubrey Plaza, Michelle Monaghan, Luke Wilson, Anthony Mackie, Chris Evans, Justin ReardonTopher Grace, Aubrey Plaza, Michelle Monaghan, Luke Wilson, Anthony Mackie, Chris Evans, Justin Reardon   See more', 'Language': 'English', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Justin Reardon', 'Media Format': 'NTSC, Multiple Formats, Widescreen, Closed-captioned, Dolby', 'Run time': '1 hour and 35 minutes', 'Release date': 'June 16, 2015', 'Actors': 'Chris Evans, Michelle Monaghan, Topher Grace, Aubrey Plaza, Luke Wilson', 'Studio': 'Vertical', 'Number of discs': '1'}\nReview Text: Chris Evans doesn't seem committed to the character and Michelle Monaghan's character is a hollow shell through no fault of her own. The writign for this movie just doesn't seem to be there at all. Chris does manage to bring his usual charm and the chemistry between Chris and Michelle is there at times. Unfortunately this is just a filler movie with some good actors.\nReview Title: Not so \"cool\"\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tonight You're Mine\nReview Date: 2015/08/05\nStore: Luke Treadaway  (Actor),     Natalia Tena  (Actor),     David Mackenzie  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Two feuding rock stars, American pop star Adam and minor British rock chick Morello, are scheduled to perform at the same music festival. As their sarcastic banter escalates, a mischievous preacher handcuffs them together and disappears into the crowd. All attempts to break free are thwarted, and eventually Adam and Morello realize there is no escape from each other.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Dolby, AC-3, Subtitled, Widescreen, NTSC', 'Contributor': 'BBC Films; Head Gear Films; Sigma Films, Gillian Berrie, Gavin Mitchell, Sophie Wu, David Mackenzie, Joseph Mydell, Mathew Baynton, Ruta Gedmintas, Natalia Tena, Luke Treadaway, Alastair MackenzieBBC Films; Head Gear Films; Sigma Films, Gillian Berrie, Gavin Mitchell, Sophie Wu, David Mackenzie, Joseph Mydell, Mathew Baynton, Ruta Gedmintas, Natalia Tena, Luke Treadaway, Alastair Mackenzie   See more', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25366039', 'Director': 'David Mackenzie', 'Media Format': 'Dolby, AC-3, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 14, 2012', 'Actors': 'Luke Treadaway, Natalia Tena, Mathew Baynton, Ruta Gedmintas, Alastair Mackenzie', 'Subtitles': 'English', 'Producers': 'Gillian Berrie', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Unexpectedly great and very funny. Sexy, but not trying too hard. I loved it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/11/12\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Reiner'], 'Producers': ['Norman Lear', 'Steve Nicolaides', 'Andrew Scheinman', 'Jeffrey Stott', 'Rob Reiner'], 'Starring': ['Cary Elwes', 'Mandy Patinkin', 'Chris Sarandon'], 'Studio': ['MGM']}\nReview Text: A classic. We recently watched this with my 13-year-old step-son and he loved it! It never gets old and people of all ages can love it.\nReview Title: We recently watched this with my 13-year-old step-son and he loved it! It never gets old and people of ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Howl's Moving Castle\nReview Date: 2018/06/28\nStore: Emily Mortimer  (Actor),     Jean Simmons  (Actor),     Hayao Miyazaki  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From the legendary Studio Ghibli, creators of Spirited Away, and acclaimed director Hayao Miyazaki, comes the Academy Award®-nominated fantasy adventure for the whole family. Sophie, a quiet girl working in a hat shop, finds her life thrown into turmoil when she is literally swept off her feet by a handsome but mysterious wizard named Howl. The vain and vengeful Witch of the Waste, jealous of their friendship, puts a curse on Sophie and turns her into a 90-year-old woman. On a quest to break the spell, Sophie climbs aboard Howl's magnificent moving castle and into a new life of wonder and adventure. But as the true power of Howl's wizardry is revealed, Sophie finds herself fighting to protect them both from a dangerous war of sorcery that threatens their world. Featuring the voices of Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner, Emily Mortimer, Josh Hutcherson and Billy Crystal.\", 'Bonus Content:', 'Exclusive Booklet', 'Exclusive Booklet', 'Feature-Length Storyboards', 'Feature-Length Storyboards', 'Behind the Microphone', 'Behind the Microphone', 'Interview with Diana Wynne Jones', 'Interview with Diana Wynne Jones', \"Miyazaki's Visit to Pixar\", \"Miyazaki's Visit to Pixar\", 'The Birth Story of the Film Soundtrack', 'The Birth Story of the Film Soundtrack', 'Explanation of CG', 'Explanation of CG', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren BacallChristian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren Bacall  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.4 x 5.3 x 6.7 inches; 3.17 Ounces', 'Item model number': '43194-4191', 'Director': 'Hayao Miyazaki', 'Media Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'October 17, 2017', 'Actors': 'Emily Mortimer, Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner', 'Dubbed': 'French, Japanese', 'Subtitles': 'French, English', 'Producers': 'Toshio Suzuki', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I've always loved this movie. It's great to have it on BluRay.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference": "Cartoon Network: Chowder: Volume 2\nNicky Jones  (Actor),     John DiMaggio  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Cartoon Network: Chowder: Volume 2', 'Marzipan City is a place where anything can happen and the unorthodox is commonplace. In the middle of this bizarre city is a quaint little shop known as Mung Daal Catering, which is owned by Mung Daal, one of the ost accomplished chefs and well known in the entire world. However, things have become a bit hectic in the kitchen as of late, as Mung Daal has recently acquired a young apprentice named Chowder, whom he wishes to pass along all of his knowledge towards. Chowder is an energetic young lad who wishes to become the greatest chef in the world, but his love of food and his extremely short attention span often results in him causing unintended havoc. However, theyre not alone. Truffles works at Mung Daal Catering and she takes the orders that her husband, Mung Daal, must prepare. Shnitzel, a rock monster, also helps out in the kitchen as he has worked for Mung Daal for years. Along the way, theyll meet the many colorful and zany residents of Marzipan City, though there will always be new dishes to prepare and exciting recipes to follow.', ']]>', 'Amazon.com', 'Five more episodes of', 'Chowder', 'await fans of the surreal and sublimely silly animated television series on this delicious second volume DVD. As with its predecessor, the episodes are not in broadcast order, which has no effect on their enjoyment; each of the 22-minute stories (broken into two 11-minute episodes) stands on its own in terms of zaniness and visual charm. Strongest among the batch included here is the Emmy- and Annie-nominated “Burple Nurples,” which circles around a somewhat morbid conceit: in an attempt to make the title dish, aspiring chef Chowder accidentally laces it with rat poison, sending his boss and mentor Mung Daal on a mad quest to track down all of his creations. Other episodes underscore the show’s gentle blend of kid-friendly storylines and out-and-out wackiness: “Mung on the Rocks” gives Chowder a chance to prove himself by bailing Mung out of a pickle with his wife, Truffles, while its companion piece, “Sniffleball,” finds our hero facing the classic conundrum: will he be the hero in a game of sniffleball or the goat? It’s this inherent sweetness, mixed with the lovely, off-kilter artwork and characterizations that make', 'Chowder', 'so appealing to viewers of all ages. Extras detailing the conception of this unique show would have been appreciated, but only a gallery of sketches and designs are present on this disc.', '--Paul Gaita']\n{'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Contributor': 'C.H. Greenblatt, Tara Strong, John DiMaggio, Dwight Schultz, Nicky Jones, Liliana Mumy, Dana Snyder', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.4 Ounces', 'Item model number': 'DT90008D', 'Media Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Run time': '1 hour and 50 minutes', 'Release date': 'March 3, 2009', 'Actors': 'Nicky Jones, John DiMaggio, Liliana Mumy, Tara Strong, Dana Snyder', 'Subtitles': 'English', 'Producers': 'C.H. Greenblatt', 'Studio': 'WarnerBrothers', 'Writers': 'C.H. Greenblatt', 'Number of discs': '1'}\nMy step-son loves chowder and has had the volume 1 disc for a long time. I got this one for him for good grades and he loves it. He watches it all the time.\nFor my step-son\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Farrne Blackburn', 'Tom Shankland'], 'Producers': ['Caroline Skinner', 'Sue Hogg'], 'Starring': ['Iain De Caestecker', 'Daniel Kaluuya', 'Tom Ellis'], 'Studio': ['BBC America']}\nnot very good quality, good concept, but bad acting as well. here are 9 more words, yep, there you go.\nCouldn't get through it\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Yves Simoneau'], 'Producers': ['Not Specified'], 'Starring': ['Elizabeth Mitchell', 'Morris Chestnut', 'Joel Gretsch']}\nNot as good as the original but worth watching if you're curious. Necessary spoiler, the second season ends abruptly with no resolution, so if you need a series to really end, this is not for you!\nNot as good as the original but worth watching if you're curious\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Not Specified'], 'Starring': ['Eliza Taylor', 'Paige Turco', 'Thomas McDonell']}\nGreat first season for a show. A little cliche and predictable but over-all a good time.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill McClane', 'Ted Schillinger'], 'Producers': ['Bill McClane', 'Ted Schillinger', 'Emily Dillon Berry', 'Lena Bhise', 'Joe Flynn Connor', 'Shawn Cuddy', 'Jennifer DeQuattro', 'Bruce David Klein', 'Angela Marsh', 'Kevin Maguire'], 'Studio': ['National Geographic Channel']}\nNot really a survival show and definitely not good. The first episode about &#34;zombies&#34; has nothing to do with zombies and drags on.\nNot really a survival show and definitely not good. The first episode about \"zombies\" has nothing to ...\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Howard McCain'], 'Producers': ['Chris Roberts', 'John Schimmel'], 'Starring': ['Jim Caviezel', 'Sophia Myles', 'John Hurt'], 'Studio': ['Lionsgate']}\nI've seen this before and loved it, but recently rented it so that my son could watch it. He loved it and I loved that it was action packed enough to keep his attention, but no nudity and I got to enjoy it too. Middle of the road movies are difficult to find with a 12-year-old and this one was definitely a hit.\nI've seen this before and loved it, but recently rented it so that my ...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susan Seidelman'], 'Producers': ['Midge Sanford', 'Sarah Pillsbury', 'Michael Peyser'], 'Starring': ['Rosanna Arquette', 'Madonna', 'Aidan Quinn'], 'Studio': ['MGM Domestic Television']}\nProbably the best Madonna movie I've ever seen. Funny, cute, and great from beginning to end. Love this.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Testa', 'Luke Terbieten', 'Michael Simon', 'Ryan Polito', 'Brian Campbell'], 'Producers': ['Justin Sena', 'Mark Neal', 'Alevil Rincones', 'Carl Kocis III', 'Shawn Greenson']}\nIt's an MTV reality show so don't expect anything more than that. The first season was better but if you like some mindless drama and laughing at or yelling at the crazy things people will do for money, this is your show. The little southern girl is a kick in the pants.\nThe first season was better but if you like some mindless drama and laughing ...\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Robert Watts', 'George Lucas'], 'Starring': ['Harrison Ford', 'Kate Capshaw', 'Ke Huy Quan'], 'Studio': ['Paramount Internal ViacomCBS']}\n5*\nHan solo with a whip.\nThe Guyver\nJimmy Walker  (Actor),     Peter Spellos  (Actor),     Screaming Mad George  (Director),     Steve Wang  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\n['Guyver, The (DVD)', 'An innocent college student is thrown into a world of bizarre adventures after finding “The Guyver,” an alien device that transforms him into a powerful fighting machine. Mark Hamill (Star Wars) stars as a CIA agent who is determined to keep the secret device from falling into the hands of evil Zoanoids, humans who mutate into monstrous soldiers. It’s sci-fi adventure at its best, with epic battles between the forces of good and evil.', ']]>']\n{'Genre': 'Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Contributor': 'Michael Berryman, Spice Williams, Yoshiki Takaya, Brian Yuzna, Vivian Wu, Screaming Mad George, Jimmy Walker, Mark Hamill, David Gale, Steve Wang, Jack Armstrong, Peter SpellosMichael Berryman, Spice Williams, Yoshiki Takaya, Brian Yuzna, Vivian Wu, Screaming Mad George, Jimmy Walker, Mark Hamill, David Gale, Steve Wang, Jack Armstrong, Peter Spellos  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': '2261810', 'Director': 'Screaming Mad George, Steve Wang', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 31, 2005', 'Actors': 'Jimmy Walker, Peter Spellos, Michael Berryman, Spice Williams, Mark Hamill', 'Subtitles': 'English, Spanish', 'Producers': 'Brian Yuzna', 'Studio': 'New Line Home Entertainment', 'Writers': 'Yoshiki Takaya', 'Number of discs': '1'}\nThe Guyver is a kick ass 90's-tastic movie that is a childhood favorite of mine. So glad I finally have it on DVD. Introduced to my 12-year-old and he loves it too.\n... a kick ass 90's-tastic movie that is a childhood favorite of mine\nThe Ice Pirates\nRobert Urich  (Actor),     Mary Crosby  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Product Description', 'Ice Pirates (DVD)', 'Robert Urich, Mary Crosby and Anjelica Huston star in this glorious send-up of the entire science fiction genre as an interstellar band of pirates steals from the rich to give to the poor, helps a princess find her lost father and discovers a source of water to slake the thirst of the entire galaxy!', ']]>', 'Amazon.com', 'The amiable sci-fi spoof', 'The Ice Pirates', 'has earned a small but vocal cadre of admirers thanks to its go-for-broke gags and a healthy disrespect for outer space epics like the', 'Star Wars', 'and', 'Star Trek', 'franchises. An atypically goofy Robert Urich stars as the leader of a band of space pirates who kidnap a princess (Mary Crosby of', 'Dallas', 'fame), and then join her quest to find a mythical planet that can solve the universe\\x92s water shortage. A completely game (shameless?) cast (which includes Anjelica Huston in fetching leather gear, Ron Perlman, John Matuszak, and fantastic film icon John Carradine) and Stewart (', 'The Philadelphia Experiment', ') and Raffill\\x92s breezy direction help sell the funniest bits (most notably, the notorious \"space herpy\" scene, and the frantic time-warp finale) and make the more leaden jokes palatable.', '--Paul Gaita']\n{'Genre': 'Fantasy, Comedy, Science Fiction', 'Format': 'Multiple Formats, Closed-captioned, Color, Dubbed, NTSC, Subtitled', 'Contributor': 'John Matuszak, John Carradine, Natalie Core, Anjelica Huston, Mary Crosby, John Foreman, Stewart Raffill, Jeremy West, Robert Urich, Ron Perlman, Michael D. Roberts, Bruce VilanchJohn Matuszak, John Carradine, Natalie Core, Anjelica Huston, Mary Crosby, John Foreman, Stewart Raffill, Jeremy West, Robert Urich, Ron Perlman, Michael D. Roberts, Bruce Vilanch   See more', 'Initial release date': '2005-07-12', 'Language': 'English (Dolby Digital 1.0), French (Dolby Digital 1.0), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.08 Ounces', 'Item model number': 'WHV67011DVD', 'Director': 'Stewart Raffill', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 12, 2005', 'Actors': 'Robert Urich, Mary Crosby, Michael D. Roberts, Anjelica Huston, John Matuszak', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'John Foreman', 'Studio': 'Studio Distribution Services', 'Writers': 'Stewart Raffill', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIce Pirates is just horrible in the best way. You have to love this movie for the goofy space parody that it is.\nIce Pirates is just horrible in the best way\nTangled\nMandy Moore  (Actor),     Zachary Levi  (Actor),     Nathan Greno  (Director),     Byron Howard  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney presents a new twist on one of the most hilarious and hair-raising tales ever told. Your whole family will get tangled up in the fun, excitement and adventure of this magical motion picture.When the kingdom\\'s most wanted - and most charming - bandit Flynn Rider hides in a mysterious tower, the last thing he expects to find is Rapunzel, a spirited teen with an unlikely superpower - 70 feet of magical golden hair! Together, the unlikely duo sets off on a fantastic journey filled with surprising heroes, laughter and suspense.Let your hair down and get ready to cheer for \"Tangled.\" Bursting with never-before-seen bonus features, it\\'s even more enchanting on Blu-ray Hi-Def.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, SubtitledMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled  See more', 'Contributor': 'M.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. TompkinsM.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. Tompkins  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'WD10633400DVD', 'Director': 'Nathan Greno, Byron Howard', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 29, 2011', 'Actors': 'Mandy Moore, Zachary Levi, Donna Murphy, Ron Perlman, M.C. Gainey', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Walt Disney Pictures', 'Number of discs': '1'}\nNo review necessary. It's great if you love Disney princess movies.\nIt's great if you love Disney princess movies\nRuby Sparks\nPaul Dano  (Actor),     Zoe Kazan  (Actor),     Jonathan Dayton  (Director),     Valerie Faris  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'Calvin (Paul Dano) is a young novelist who achieved phenomenal success early in his career but is now struggling with his writing -- as well as his romantic life. Finally, he makes a breakthrough and creates a character named Ruby who inspires him. When Calvin finds Ruby (Zoe Kazan), in the flesh, sitting on his couch about a week later, he is completely flabbergasted that his words have turned into a living, breathing person.', 'Amazon.com', 'A romantic comedy about love and control from the directors of', 'Little Miss Sunshine', ',', 'Ruby Sparks', \"is an appealingly wacky story about novelist Calvin (Paul Dano) and his relationship with a fictitious woman. Struggling with writer's block and grieving over a failed actual relationship, Calvin looks to his brother (Chris Messina) and therapist (Elliott Gould) for guidance, but initially he finds only distraction and frustration. The therapist suggests an assignment that soon has Calvin writing about Ruby Sparks (Zoe Kazan), a fictitious woman who loves him completely and unconditionally. The only problem is that Calvin is becoming obsessed with his new character, imagining that he's actually spending every waking moment with this ideal woman he's created--surely a sign that he's losing his mind. When Calvin discovers that other people can see Ruby too, he throws himself wholeheartedly into the perfect relationship with the perfect woman. Then he starts to feel guilty about possessing absolute control over Ruby's thoughts and actions and begins to question whether Ruby really loves him or whether he is making her love him. Calvin locks away his manuscript and stops writing, and things begin to change between the couple. Eventually Calvin must decide whether he can be content the way things are or whether he must set his creation free--even if it costs him his own happiness.\", 'Ruby Sparks', \"is a romantic comedy full of laughably ridiculous situations, but it's also a thought-provoking film about control and acceptance.\", '--Tami Horiuchi']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Zoe Kazan, Jonathan Dayton, Paul Dano, Valerie Faris', 'Language': 'English', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'FOX2279153DVD', 'Director': 'Jonathan Dayton, Valerie Faris', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 30, 2012', 'Actors': 'Paul Dano, Zoe Kazan', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Fox Searchlight', 'Number of discs': '1'}\nI loved this movie. It was bright, funny, and surprisingly serious. It was everything I had hoped for when I first saw a preview for it.\nI loved this movie\nPlaying it Cool\nChris Evans  (Actor),     Michelle Monaghan  (Actor),     Justin Reardon  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Chris Evans stars as a disillusioned writer with a big imagination that consists mostly of hot women yielding to his every desire. He is indifferent to the whole concept of true love until he meets HER (Michelle Monaghan), a breathtaking young woman who shakes all his previous beliefs. His buddies, all fellow writers, give him way too much advice, mostly along the lines of getting lucky before getting in too deep. The one thing they do not tell him is to lie through his teeth, which he ends up doing just so he can spend time with her. When the truth comes out, all hell breaks loose and he ends up as the star in his own tragedy.']\n{'Genre': 'Comedy', 'Format': 'NTSC, Multiple Formats, Widescreen, Closed-captioned, Dolby', 'Contributor': 'Topher Grace, Aubrey Plaza, Michelle Monaghan, Luke Wilson, Anthony Mackie, Chris Evans, Justin ReardonTopher Grace, Aubrey Plaza, Michelle Monaghan, Luke Wilson, Anthony Mackie, Chris Evans, Justin Reardon   See more', 'Language': 'English', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Justin Reardon', 'Media Format': 'NTSC, Multiple Formats, Widescreen, Closed-captioned, Dolby', 'Run time': '1 hour and 35 minutes', 'Release date': 'June 16, 2015', 'Actors': 'Chris Evans, Michelle Monaghan, Topher Grace, Aubrey Plaza, Luke Wilson', 'Studio': 'Vertical', 'Number of discs': '1'}\nChris Evans doesn't seem committed to the character and Michelle Monaghan's character is a hollow shell through no fault of her own. The writign for this movie just doesn't seem to be there at all. Chris does manage to bring his usual charm and the chemistry between Chris and Michelle is there at times. Unfortunately this is just a filler movie with some good actors.\nNot so \"cool\"\nTonight You're Mine\nLuke Treadaway  (Actor),     Natalia Tena  (Actor),     David Mackenzie  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Two feuding rock stars, American pop star Adam and minor British rock chick Morello, are scheduled to perform at the same music festival. As their sarcastic banter escalates, a mischievous preacher handcuffs them together and disappears into the crowd. All attempts to break free are thwarted, and eventually Adam and Morello realize there is no escape from each other.']\n{'Genre': 'Romance, Comedy', 'Format': 'Dolby, AC-3, Subtitled, Widescreen, NTSC', 'Contributor': 'BBC Films; Head Gear Films; Sigma Films, Gillian Berrie, Gavin Mitchell, Sophie Wu, David Mackenzie, Joseph Mydell, Mathew Baynton, Ruta Gedmintas, Natalia Tena, Luke Treadaway, Alastair MackenzieBBC Films; Head Gear Films; Sigma Films, Gillian Berrie, Gavin Mitchell, Sophie Wu, David Mackenzie, Joseph Mydell, Mathew Baynton, Ruta Gedmintas, Natalia Tena, Luke Treadaway, Alastair Mackenzie   See more', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25366039', 'Director': 'David Mackenzie', 'Media Format': 'Dolby, AC-3, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 14, 2012', 'Actors': 'Luke Treadaway, Natalia Tena, Mathew Baynton, Ruta Gedmintas, Alastair Mackenzie', 'Subtitles': 'English', 'Producers': 'Gillian Berrie', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nUnexpectedly great and very funny. Sexy, but not trying too hard. I loved it.\nFive Stars\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Reiner'], 'Producers': ['Norman Lear', 'Steve Nicolaides', 'Andrew Scheinman', 'Jeffrey Stott', 'Rob Reiner'], 'Starring': ['Cary Elwes', 'Mandy Patinkin', 'Chris Sarandon'], 'Studio': ['MGM']}\nA classic. We recently watched this with my 13-year-old step-son and he loved it! It never gets old and people of all ages can love it.\nWe recently watched this with my 13-year-old step-son and he loved it! It never gets old and people of ...\nHowl's Moving Castle\nEmily Mortimer  (Actor),     Jean Simmons  (Actor),     Hayao Miyazaki  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From the legendary Studio Ghibli, creators of Spirited Away, and acclaimed director Hayao Miyazaki, comes the Academy Award®-nominated fantasy adventure for the whole family. Sophie, a quiet girl working in a hat shop, finds her life thrown into turmoil when she is literally swept off her feet by a handsome but mysterious wizard named Howl. The vain and vengeful Witch of the Waste, jealous of their friendship, puts a curse on Sophie and turns her into a 90-year-old woman. On a quest to break the spell, Sophie climbs aboard Howl's magnificent moving castle and into a new life of wonder and adventure. But as the true power of Howl's wizardry is revealed, Sophie finds herself fighting to protect them both from a dangerous war of sorcery that threatens their world. Featuring the voices of Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner, Emily Mortimer, Josh Hutcherson and Billy Crystal.\", 'Bonus Content:', 'Exclusive Booklet', 'Exclusive Booklet', 'Feature-Length Storyboards', 'Feature-Length Storyboards', 'Behind the Microphone', 'Behind the Microphone', 'Interview with Diana Wynne Jones', 'Interview with Diana Wynne Jones', \"Miyazaki's Visit to Pixar\", \"Miyazaki's Visit to Pixar\", 'The Birth Story of the Film Soundtrack', 'The Birth Story of the Film Soundtrack', 'Explanation of CG', 'Explanation of CG', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\n{'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren BacallChristian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren Bacall  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.4 x 5.3 x 6.7 inches; 3.17 Ounces', 'Item model number': '43194-4191', 'Director': 'Hayao Miyazaki', 'Media Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'October 17, 2017', 'Actors': 'Emily Mortimer, Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner', 'Dubbed': 'French, Japanese', 'Subtitles': 'French, English', 'Producers': 'Toshio Suzuki', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI've always loved this movie. It's great to have it on BluRay.\nFive Stars",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Cartoon Network: Chowder: Volume 2\nReview Date: 2012/12/24\nStore: Nicky Jones  (Actor),     John DiMaggio  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Cartoon Network: Chowder: Volume 2', 'Marzipan City is a place where anything can happen and the unorthodox is commonplace. In the middle of this bizarre city is a quaint little shop known as Mung Daal Catering, which is owned by Mung Daal, one of the ost accomplished chefs and well known in the entire world. However, things have become a bit hectic in the kitchen as of late, as Mung Daal has recently acquired a young apprentice named Chowder, whom he wishes to pass along all of his knowledge towards. Chowder is an energetic young lad who wishes to become the greatest chef in the world, but his love of food and his extremely short attention span often results in him causing unintended havoc. However, theyre not alone. Truffles works at Mung Daal Catering and she takes the orders that her husband, Mung Daal, must prepare. Shnitzel, a rock monster, also helps out in the kitchen as he has worked for Mung Daal for years. Along the way, theyll meet the many colorful and zany residents of Marzipan City, though there will always be new dishes to prepare and exciting recipes to follow.', ']]>', 'Amazon.com', 'Five more episodes of', 'Chowder', 'await fans of the surreal and sublimely silly animated television series on this delicious second volume DVD. As with its predecessor, the episodes are not in broadcast order, which has no effect on their enjoyment; each of the 22-minute stories (broken into two 11-minute episodes) stands on its own in terms of zaniness and visual charm. Strongest among the batch included here is the Emmy- and Annie-nominated “Burple Nurples,” which circles around a somewhat morbid conceit: in an attempt to make the title dish, aspiring chef Chowder accidentally laces it with rat poison, sending his boss and mentor Mung Daal on a mad quest to track down all of his creations. Other episodes underscore the show’s gentle blend of kid-friendly storylines and out-and-out wackiness: “Mung on the Rocks” gives Chowder a chance to prove himself by bailing Mung out of a pickle with his wife, Truffles, while its companion piece, “Sniffleball,” finds our hero facing the classic conundrum: will he be the hero in a game of sniffleball or the goat? It’s this inherent sweetness, mixed with the lovely, off-kilter artwork and characterizations that make', 'Chowder', 'so appealing to viewers of all ages. Extras detailing the conception of this unique show would have been appreciated, but only a gallery of sketches and designs are present on this disc.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Contributor': 'C.H. Greenblatt, Tara Strong, John DiMaggio, Dwight Schultz, Nicky Jones, Liliana Mumy, Dana Snyder', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.4 Ounces', 'Item model number': 'DT90008D', 'Media Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Run time': '1 hour and 50 minutes', 'Release date': 'March 3, 2009', 'Actors': 'Nicky Jones, John DiMaggio, Liliana Mumy, Tara Strong, Dana Snyder', 'Subtitles': 'English', 'Producers': 'C.H. Greenblatt', 'Studio': 'WarnerBrothers', 'Writers': 'C.H. Greenblatt', 'Number of discs': '1'}\nReview Text: My step-son loves chowder and has had the volume 1 disc for a long time. I got this one for him for good grades and he loves it. He watches it all the time.\nReview Title: For my step-son\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/05/25\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Farrne Blackburn', 'Tom Shankland'], 'Producers': ['Caroline Skinner', 'Sue Hogg'], 'Starring': ['Iain De Caestecker', 'Daniel Kaluuya', 'Tom Ellis'], 'Studio': ['BBC America']}\nReview Text: not very good quality, good concept, but bad acting as well. here are 9 more words, yep, there you go.\nReview Title: Couldn't get through it\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/09\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Yves Simoneau'], 'Producers': ['Not Specified'], 'Starring': ['Elizabeth Mitchell', 'Morris Chestnut', 'Joel Gretsch']}\nReview Text: Not as good as the original but worth watching if you're curious. Necessary spoiler, the second season ends abruptly with no resolution, so if you need a series to really end, this is not for you!\nReview Title: Not as good as the original but worth watching if you're curious\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/09\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Not Specified'], 'Starring': ['Eliza Taylor', 'Paige Turco', 'Thomas McDonell']}\nReview Text: Great first season for a show. A little cliche and predictable but over-all a good time.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/29\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill McClane', 'Ted Schillinger'], 'Producers': ['Bill McClane', 'Ted Schillinger', 'Emily Dillon Berry', 'Lena Bhise', 'Joe Flynn Connor', 'Shawn Cuddy', 'Jennifer DeQuattro', 'Bruce David Klein', 'Angela Marsh', 'Kevin Maguire'], 'Studio': ['National Geographic Channel']}\nReview Text: Not really a survival show and definitely not good. The first episode about &#34;zombies&#34; has nothing to do with zombies and drags on.\nReview Title: Not really a survival show and definitely not good. The first episode about \"zombies\" has nothing to ...\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/29\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Howard McCain'], 'Producers': ['Chris Roberts', 'John Schimmel'], 'Starring': ['Jim Caviezel', 'Sophia Myles', 'John Hurt'], 'Studio': ['Lionsgate']}\nReview Text: I've seen this before and loved it, but recently rented it so that my son could watch it. He loved it and I loved that it was action packed enough to keep his attention, but no nudity and I got to enjoy it too. Middle of the road movies are difficult to find with a 12-year-old and this one was definitely a hit.\nReview Title: I've seen this before and loved it, but recently rented it so that my ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/29\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susan Seidelman'], 'Producers': ['Midge Sanford', 'Sarah Pillsbury', 'Michael Peyser'], 'Starring': ['Rosanna Arquette', 'Madonna', 'Aidan Quinn'], 'Studio': ['MGM Domestic Television']}\nReview Text: Probably the best Madonna movie I've ever seen. Funny, cute, and great from beginning to end. Love this.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/04/06\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Testa', 'Luke Terbieten', 'Michael Simon', 'Ryan Polito', 'Brian Campbell'], 'Producers': ['Justin Sena', 'Mark Neal', 'Alevil Rincones', 'Carl Kocis III', 'Shawn Greenson']}\nReview Text: It's an MTV reality show so don't expect anything more than that. The first season was better but if you like some mindless drama and laughing at or yelling at the crazy things people will do for money, this is your show. The little southern girl is a kick in the pants.\nReview Title: The first season was better but if you like some mindless drama and laughing ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/04/06\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Robert Watts', 'George Lucas'], 'Starring': ['Harrison Ford', 'Kate Capshaw', 'Ke Huy Quan'], 'Studio': ['Paramount Internal ViacomCBS']}\nReview Text: 5*\nReview Title: Han solo with a whip.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Guyver\nReview Date: 2015/05/21\nStore: Jimmy Walker  (Actor),     Peter Spellos  (Actor),     Screaming Mad George  (Director),     Steve Wang  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\nProduct Description: ['Guyver, The (DVD)', 'An innocent college student is thrown into a world of bizarre adventures after finding “The Guyver,” an alien device that transforms him into a powerful fighting machine. Mark Hamill (Star Wars) stars as a CIA agent who is determined to keep the secret device from falling into the hands of evil Zoanoids, humans who mutate into monstrous soldiers. It’s sci-fi adventure at its best, with epic battles between the forces of good and evil.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure, Science Fiction', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Contributor': 'Michael Berryman, Spice Williams, Yoshiki Takaya, Brian Yuzna, Vivian Wu, Screaming Mad George, Jimmy Walker, Mark Hamill, David Gale, Steve Wang, Jack Armstrong, Peter SpellosMichael Berryman, Spice Williams, Yoshiki Takaya, Brian Yuzna, Vivian Wu, Screaming Mad George, Jimmy Walker, Mark Hamill, David Gale, Steve Wang, Jack Armstrong, Peter Spellos  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': '2261810', 'Director': 'Screaming Mad George, Steve Wang', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 31, 2005', 'Actors': 'Jimmy Walker, Peter Spellos, Michael Berryman, Spice Williams, Mark Hamill', 'Subtitles': 'English, Spanish', 'Producers': 'Brian Yuzna', 'Studio': 'New Line Home Entertainment', 'Writers': 'Yoshiki Takaya', 'Number of discs': '1'}\nReview Text: The Guyver is a kick ass 90's-tastic movie that is a childhood favorite of mine. So glad I finally have it on DVD. Introduced to my 12-year-old and he loves it too.\nReview Title: ... a kick ass 90's-tastic movie that is a childhood favorite of mine\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Ice Pirates\nReview Date: 2015/05/21\nStore: Robert Urich  (Actor),     Mary Crosby  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\nProduct Description: ['Product Description', 'Ice Pirates (DVD)', 'Robert Urich, Mary Crosby and Anjelica Huston star in this glorious send-up of the entire science fiction genre as an interstellar band of pirates steals from the rich to give to the poor, helps a princess find her lost father and discovers a source of water to slake the thirst of the entire galaxy!', ']]>', 'Amazon.com', 'The amiable sci-fi spoof', 'The Ice Pirates', 'has earned a small but vocal cadre of admirers thanks to its go-for-broke gags and a healthy disrespect for outer space epics like the', 'Star Wars', 'and', 'Star Trek', 'franchises. An atypically goofy Robert Urich stars as the leader of a band of space pirates who kidnap a princess (Mary Crosby of', 'Dallas', 'fame), and then join her quest to find a mythical planet that can solve the universe\\x92s water shortage. A completely game (shameless?) cast (which includes Anjelica Huston in fetching leather gear, Ron Perlman, John Matuszak, and fantastic film icon John Carradine) and Stewart (', 'The Philadelphia Experiment', ') and Raffill\\x92s breezy direction help sell the funniest bits (most notably, the notorious \"space herpy\" scene, and the frantic time-warp finale) and make the more leaden jokes palatable.', '--Paul Gaita']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Fantasy, Comedy, Science Fiction', 'Format': 'Multiple Formats, Closed-captioned, Color, Dubbed, NTSC, Subtitled', 'Contributor': 'John Matuszak, John Carradine, Natalie Core, Anjelica Huston, Mary Crosby, John Foreman, Stewart Raffill, Jeremy West, Robert Urich, Ron Perlman, Michael D. Roberts, Bruce VilanchJohn Matuszak, John Carradine, Natalie Core, Anjelica Huston, Mary Crosby, John Foreman, Stewart Raffill, Jeremy West, Robert Urich, Ron Perlman, Michael D. Roberts, Bruce Vilanch   See more', 'Initial release date': '2005-07-12', 'Language': 'English (Dolby Digital 1.0), French (Dolby Digital 1.0), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.08 Ounces', 'Item model number': 'WHV67011DVD', 'Director': 'Stewart Raffill', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 12, 2005', 'Actors': 'Robert Urich, Mary Crosby, Michael D. Roberts, Anjelica Huston, John Matuszak', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'John Foreman', 'Studio': 'Studio Distribution Services', 'Writers': 'Stewart Raffill', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Ice Pirates is just horrible in the best way. You have to love this movie for the goofy space parody that it is.\nReview Title: Ice Pirates is just horrible in the best way\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tangled\nReview Date: 2015/05/21\nStore: Mandy Moore  (Actor),     Zachary Levi  (Actor),     Nathan Greno  (Director),     Byron Howard  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Disney presents a new twist on one of the most hilarious and hair-raising tales ever told. Your whole family will get tangled up in the fun, excitement and adventure of this magical motion picture.When the kingdom\\'s most wanted - and most charming - bandit Flynn Rider hides in a mysterious tower, the last thing he expects to find is Rapunzel, a spirited teen with an unlikely superpower - 70 feet of magical golden hair! Together, the unlikely duo sets off on a fantastic journey filled with surprising heroes, laughter and suspense.Let your hair down and get ready to cheer for \"Tangled.\" Bursting with never-before-seen bonus features, it\\'s even more enchanting on Blu-ray Hi-Def.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, SubtitledMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled  See more', 'Contributor': 'M.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. TompkinsM.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. Tompkins  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'WD10633400DVD', 'Director': 'Nathan Greno, Byron Howard', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 29, 2011', 'Actors': 'Mandy Moore, Zachary Levi, Donna Murphy, Ron Perlman, M.C. Gainey', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Walt Disney Pictures', 'Number of discs': '1'}\nReview Text: No review necessary. It's great if you love Disney princess movies.\nReview Title: It's great if you love Disney princess movies\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ruby Sparks\nReview Date: 2015/08/05\nStore: Paul Dano  (Actor),     Zoe Kazan  (Actor),     Jonathan Dayton  (Director),     Valerie Faris  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Calvin (Paul Dano) is a young novelist who achieved phenomenal success early in his career but is now struggling with his writing -- as well as his romantic life. Finally, he makes a breakthrough and creates a character named Ruby who inspires him. When Calvin finds Ruby (Zoe Kazan), in the flesh, sitting on his couch about a week later, he is completely flabbergasted that his words have turned into a living, breathing person.', 'Amazon.com', 'A romantic comedy about love and control from the directors of', 'Little Miss Sunshine', ',', 'Ruby Sparks', \"is an appealingly wacky story about novelist Calvin (Paul Dano) and his relationship with a fictitious woman. Struggling with writer's block and grieving over a failed actual relationship, Calvin looks to his brother (Chris Messina) and therapist (Elliott Gould) for guidance, but initially he finds only distraction and frustration. The therapist suggests an assignment that soon has Calvin writing about Ruby Sparks (Zoe Kazan), a fictitious woman who loves him completely and unconditionally. The only problem is that Calvin is becoming obsessed with his new character, imagining that he's actually spending every waking moment with this ideal woman he's created--surely a sign that he's losing his mind. When Calvin discovers that other people can see Ruby too, he throws himself wholeheartedly into the perfect relationship with the perfect woman. Then he starts to feel guilty about possessing absolute control over Ruby's thoughts and actions and begins to question whether Ruby really loves him or whether he is making her love him. Calvin locks away his manuscript and stops writing, and things begin to change between the couple. Eventually Calvin must decide whether he can be content the way things are or whether he must set his creation free--even if it costs him his own happiness.\", 'Ruby Sparks', \"is a romantic comedy full of laughably ridiculous situations, but it's also a thought-provoking film about control and acceptance.\", '--Tami Horiuchi']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Zoe Kazan, Jonathan Dayton, Paul Dano, Valerie Faris', 'Language': 'English', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'FOX2279153DVD', 'Director': 'Jonathan Dayton, Valerie Faris', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 30, 2012', 'Actors': 'Paul Dano, Zoe Kazan', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Fox Searchlight', 'Number of discs': '1'}\nReview Text: I loved this movie. It was bright, funny, and surprisingly serious. It was everything I had hoped for when I first saw a preview for it.\nReview Title: I loved this movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Playing it Cool\nReview Date: 2015/08/05\nStore: Chris Evans  (Actor),     Michelle Monaghan  (Actor),     Justin Reardon  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Chris Evans stars as a disillusioned writer with a big imagination that consists mostly of hot women yielding to his every desire. He is indifferent to the whole concept of true love until he meets HER (Michelle Monaghan), a breathtaking young woman who shakes all his previous beliefs. His buddies, all fellow writers, give him way too much advice, mostly along the lines of getting lucky before getting in too deep. The one thing they do not tell him is to lie through his teeth, which he ends up doing just so he can spend time with her. When the truth comes out, all hell breaks loose and he ends up as the star in his own tragedy.']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC, Multiple Formats, Widescreen, Closed-captioned, Dolby', 'Contributor': 'Topher Grace, Aubrey Plaza, Michelle Monaghan, Luke Wilson, Anthony Mackie, Chris Evans, Justin ReardonTopher Grace, Aubrey Plaza, Michelle Monaghan, Luke Wilson, Anthony Mackie, Chris Evans, Justin Reardon   See more', 'Language': 'English', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Justin Reardon', 'Media Format': 'NTSC, Multiple Formats, Widescreen, Closed-captioned, Dolby', 'Run time': '1 hour and 35 minutes', 'Release date': 'June 16, 2015', 'Actors': 'Chris Evans, Michelle Monaghan, Topher Grace, Aubrey Plaza, Luke Wilson', 'Studio': 'Vertical', 'Number of discs': '1'}\nReview Text: Chris Evans doesn't seem committed to the character and Michelle Monaghan's character is a hollow shell through no fault of her own. The writign for this movie just doesn't seem to be there at all. Chris does manage to bring his usual charm and the chemistry between Chris and Michelle is there at times. Unfortunately this is just a filler movie with some good actors.\nReview Title: Not so \"cool\"\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tonight You're Mine\nReview Date: 2015/08/05\nStore: Luke Treadaway  (Actor),     Natalia Tena  (Actor),     David Mackenzie  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Two feuding rock stars, American pop star Adam and minor British rock chick Morello, are scheduled to perform at the same music festival. As their sarcastic banter escalates, a mischievous preacher handcuffs them together and disappears into the crowd. All attempts to break free are thwarted, and eventually Adam and Morello realize there is no escape from each other.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Dolby, AC-3, Subtitled, Widescreen, NTSC', 'Contributor': 'BBC Films; Head Gear Films; Sigma Films, Gillian Berrie, Gavin Mitchell, Sophie Wu, David Mackenzie, Joseph Mydell, Mathew Baynton, Ruta Gedmintas, Natalia Tena, Luke Treadaway, Alastair MackenzieBBC Films; Head Gear Films; Sigma Films, Gillian Berrie, Gavin Mitchell, Sophie Wu, David Mackenzie, Joseph Mydell, Mathew Baynton, Ruta Gedmintas, Natalia Tena, Luke Treadaway, Alastair Mackenzie   See more', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25366039', 'Director': 'David Mackenzie', 'Media Format': 'Dolby, AC-3, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 14, 2012', 'Actors': 'Luke Treadaway, Natalia Tena, Mathew Baynton, Ruta Gedmintas, Alastair Mackenzie', 'Subtitles': 'English', 'Producers': 'Gillian Berrie', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Unexpectedly great and very funny. Sexy, but not trying too hard. I loved it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/11/12\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Reiner'], 'Producers': ['Norman Lear', 'Steve Nicolaides', 'Andrew Scheinman', 'Jeffrey Stott', 'Rob Reiner'], 'Starring': ['Cary Elwes', 'Mandy Patinkin', 'Chris Sarandon'], 'Studio': ['MGM']}\nReview Text: A classic. We recently watched this with my 13-year-old step-son and he loved it! It never gets old and people of all ages can love it.\nReview Title: We recently watched this with my 13-year-old step-son and he loved it! It never gets old and people of ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Howl's Moving Castle\nReview Date: 2018/06/28\nStore: Emily Mortimer  (Actor),     Jean Simmons  (Actor),     Hayao Miyazaki  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From the legendary Studio Ghibli, creators of Spirited Away, and acclaimed director Hayao Miyazaki, comes the Academy Award®-nominated fantasy adventure for the whole family. Sophie, a quiet girl working in a hat shop, finds her life thrown into turmoil when she is literally swept off her feet by a handsome but mysterious wizard named Howl. The vain and vengeful Witch of the Waste, jealous of their friendship, puts a curse on Sophie and turns her into a 90-year-old woman. On a quest to break the spell, Sophie climbs aboard Howl's magnificent moving castle and into a new life of wonder and adventure. But as the true power of Howl's wizardry is revealed, Sophie finds herself fighting to protect them both from a dangerous war of sorcery that threatens their world. Featuring the voices of Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner, Emily Mortimer, Josh Hutcherson and Billy Crystal.\", 'Bonus Content:', 'Exclusive Booklet', 'Exclusive Booklet', 'Feature-Length Storyboards', 'Feature-Length Storyboards', 'Behind the Microphone', 'Behind the Microphone', 'Interview with Diana Wynne Jones', 'Interview with Diana Wynne Jones', \"Miyazaki's Visit to Pixar\", \"Miyazaki's Visit to Pixar\", 'The Birth Story of the Film Soundtrack', 'The Birth Story of the Film Soundtrack', 'Explanation of CG', 'Explanation of CG', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren BacallChristian Bale, Chieko Baisho, Haruko Kato, Hayao Miyazaki, Billy Crystal, Takuya Kimura, Ryunosuke Kamiki, Josh Hutcherson, Blythe Danner, Tatsuya Gashuin, Akihiro Miwa, Toshio Suzuki, Jean Simmons, Emily Mortimer, Lauren Bacall  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.4 x 5.3 x 6.7 inches; 3.17 Ounces', 'Item model number': '43194-4191', 'Director': 'Hayao Miyazaki', 'Media Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'October 17, 2017', 'Actors': 'Emily Mortimer, Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner', 'Dubbed': 'French, Japanese', 'Subtitles': 'French, English', 'Producers': 'Toshio Suzuki', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I've always loved this movie. It's great to have it on BluRay.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual displays a consistent preference for animated family content, particularly from well-known studios, indicating a strong inclination towards engaging, humorous, and imaginative storytelling. They favor high-quality productions, as evident from the predominantly positive ratings (averaging around 4.5-4.8) for family-friendly films, alongside some appreciation for nostalgic titles from their childhood that can also entertain their step-son.\n\nThe purchase history suggests a blend of genres, with a clear affinity for animation and comedy, reflecting an audience-centric approach. Their choices align with family viewing experiences that include adventure and light-hearted narratives, emphasizing a desire for films that can be enjoyed across age groups. \n\nQuality emerges as a significant factor; low ratings coincide with dissatisfaction regarding acting and production value, highlighting a moderate price sensitivity towards selecting higher-quality films for family viewing. Moreover, they express interest in engaging content that combines humor with relatable themes, suggesting a preference for films with both entertainment value and emotional resonance. This reveals a dual priority for quality storytelling in family-friendly formats and nostalgia-driven choices, underlining their commitment to curating enjoyable viewing experiences for their family.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Silly but wonderful",
    "text": "Is it silly and deviates from the novel? Obviously. Is lovely and sweet and tons of fun regardless? Also yes.",
    "images": [],
    "asin": "B003BOWF5K",
    "parent_asin": "B003BOWF5K",
    "user_id": "AF25FDK4Y2VBP3UX5PKPEZ5SIE3Q",
    "timestamp": "2021-08-06 00:31:51.994000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 655,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1424886aecfbf0e88924f34dd26ea4ba0e4b4e63be0273ebb952bfe353378a02._RI_SX360_FMwebp_.png",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1424886aecfbf0e88924f34dd26ea4ba0e4b4e63be0273ebb952bfe353378a02._RI_SX480_FMwebp_.png",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1424886aecfbf0e88924f34dd26ea4ba0e4b4e63be0273ebb952bfe353378a02._RI_SX720_FMwebp_.png",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1424886aecfbf0e88924f34dd26ea4ba0e4b4e63be0273ebb952bfe353378a02._RI_SX1080_FMwebp_.png",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1424886aecfbf0e88924f34dd26ea4ba0e4b4e63be0273ebb952bfe353378a02._RI_SX1440_FMwebp_.png",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/1424886aecfbf0e88924f34dd26ea4ba0e4b4e63be0273ebb952bfe353378a02._RI_SX1920_FMwebp_.png",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Dan Zeff"
      ],
      "Producers": [
        "Kate McKerrall"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}