{
  "user_id": "AFBQMCQZHMS626VDRBGBBC3HGM4Q",
  "summary": "=== Purchase Information ===\nProduct Title: Murder, She Wrote: Season 2\nReview Date: 2014/05/13\nStore: Angela Lansbury  (Actor),     Tom Bosley  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Emmy Award nominee Angela Lansbury is back on the case in all 22 episodes of the critically acclaimed series, Murder, She Wrote Season Two. Rejoin Jessica Fletcher, everyone\\'s favorite mystery writer, back in Cabot Cove, where she pens her whodunit books and keeps finding that her life is imitating her art. Teamed with some of the biggest guest stars on television, including Jerry Orbach, Adrienne Barbeau, Dick Van Patten and Carol Lawrence, Jessica continues her quest to find the truth in even the murkiest circumstances. Catch the complete second season of Murder, She Wrote, the classic mystery series that \"…remains well worth revisiting two decades later\" (Josef Adalian, Daily Variety).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Box set, Color, Dolby, Full Screen', 'Contributor': 'William Windom, Tom Bosley, Angela Lansbury', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.72 x 6.02 x 1.89 inches; 8.8 Ounces', 'Media Format': 'Box set, Color, Dolby, Full Screen', 'Run time': '35 hours and 28 minutes', 'Release date': 'December 6, 2005', 'Actors': 'Angela Lansbury, Tom Bosley, William Windom', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '3'}\nReview Text: enjoy watching crime stopper with mrs. fletcher<br />she's exciting to watch<br />anyone whose interest is in solving crimes will like it<br />as much as I do.\nReview Title: murder she wrote\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 1, Vol. 1\nReview Date: 2014/05/13\nStore: Raymond Burr  (Actor),     Barbara Hale  (Actor),     Robert Ellis Miller  (Director),     Ted Post  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Mystery & Thrillers\nProduct Description: ['Product Description', 'Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt. Steps to access the closed-captioning is as follows: 1. Press SETTINGS on your remote. 2. Using the left/right arrow buttons, scroll to Quick Settings. 3. Using the up/down arrow buttons, scroll to Closed Captioning. 4. Press SELECT on your remote. 5. Using the up/down arrow buttons, scroll to highlight On, On with Mute or Off. 6. Press SELECT on your remote.', 'Amazon.com', 'There was a time when the defense attorney was a heroic everyman, not the butt of bad jokes; think Atticus Finch in', 'To Kill a Mockingbird', \", and, of course, Raymond Burr's incomparable Perry Mason. The first season of\", 'Perry Mason', ', which launched in 1957 on CBS, shows just how dramatic a \"law and order\" show could be. Shot in lush black and white, on film, the episodes have been lovingly restored (including lost minutes hacked from reruns to accommodate commercials). The story arcs and atmosphere feel more like film noir (Perry Mason + Philip Marlowe = separated at birth?) than early TV. The cast was stellar, including Burr\\'s Emmy-winning Perry Mason, the indefatigable lawyer who takes tough cases no one else will touch. Burr\\'s chemistry crackles from episode 1 with his costars, including Barbara Hale as secretary Della, William Hopper as private detective Paul Drake, and William Talman as Hamilton Burger, the well-meaning but overmatched district attorney. While it\\'s true that the last-minute witness-stand confessions strain some credulity, the case-cracking, character development, and dialogue set a high bar for the legal shows that followed. \"The Case of the Negligent Nymph,\" for instance, involves a comely young woman--and murder suspect--fished out of the Pacific; Mason deadpans to Drake, \"Call off the search, Paul; we\\'ve landed our mermaid.\" The shows unfold at a leisurely pace, and yet don\\'t rely on the overly expositive dialogue that, say,', 'Law & Order', \"does; the viewer learns a lot about each case simply as it happens. The set contains the first 19 episodes of the first season and will hook you, even if you're not a procedural buff.\", '--A.T. Hurley']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Contributor': 'Gerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert KayGerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert Kay   See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.91 x 5.44 x 7.8 inches; 9.59 Ounces', 'Item model number': '097368878143', 'Director': 'Robert Ellis Miller, Ted Post, James Goldstone, Jack Arnold, Don Weis', 'Media Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Run time': '1 hour', 'Release date': 'July 11, 2006', 'Actors': 'Raymond Burr, Barbara Hale, William Talman, William Hopper', 'Studio': 'Paramount/CBS', 'Number of discs': '5'}\nReview Text: I am a any time fan of perry mason<br />murder,mystery, intrigue, excitement,keeps me guessing<br />all through the courtroom drama fascinated with the<br />actors that play the rolls.<br />Enjoyable!\nReview Title: perry mason, season 1,vol l\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Loves Music, Loves to Dance (Mary Higgins Clark Mystery Collection)\nReview Date: 2014/05/15\nStore: Patsy Kensit  (Actor),     Cynthia Preston  (Actor),     Mario Azzopardi  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"A talk show producer faces her own guilt when she discovers that her best friend was murdered after answering an online personal ad. Against the wishes of detective D'Salva, she begins a treacherous dating game, drawing the killer's sights to her.\"]\nAverage Rating: 3.7\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Michael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah JohnsonMichael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah Johnson   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4.8 Ounces', 'Director': 'Mario Azzopardi', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Patsy Kensit, Cynthia Preston, Dean McDermott, Frank Pellegrino, Yannick Bisson', 'Studio': 'Lions Gate', 'Writers': 'Mary Higgins Clark, Peter Mohan', 'Number of discs': '1'}\nReview Text: had the chance to watch this movies before purchasing, had fun<br />and excitement trying to figure who committed the crimes.<br />Had to purchase , still enjoying .<br />If you enjoy watching and solving crime of<br />the who done it, you will have fun with his movie.\nReview Title: mary higgins clark's loves music loves to dance\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 7 Men from Now (Widescreen Special Collector's Edition)\nReview Date: 2014/05/15\nStore: John Phillips  (Actor),     Chuck Roberson  (Actor),     Budd Boetticher  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Westerns', 'Format': \"Multiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, Widescreen   See more\", 'Contributor': 'Randolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail RussellRandolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail Russell   See more', 'Language': 'English', 'Runtime': '1 hour and 18 minutes'}\nReview Text: if you love western from the 1940-50's era, as I do<br />you will have fun watching hours of back in the day<br />cowboys in the old west, bringing law and order<br />to the western frontier!\nReview Title: 7 men from now\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Blue Gardenia\nReview Date: 2014/07/22\nStore: Anne Baxter  (Actor),     Richard Conte  (Actor),     Fritz Lang  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['A drunken woman hits her blind date with a poker, then reads about his death in the paper. Directed by Fritz Lang.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': \"Jeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann SothernJeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann Sothern   See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'ID9042AQDVD', 'Director': 'Fritz Lang', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 11, 2000', 'Actors': 'Anne Baxter, Richard Conte, Ann Sothern, Raymond Burr, Jeff Donnell', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Charles Hoffman, Vera Caspary', 'Number of discs': '1'}\nReview Text: Had previously viewed this movie, really enjoyed the<br />action and suspense.<br />Had fun watching, if you love solving puzzles, try it!\nReview Title: SUSPENSE MOVIEGOER!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: American President, The (DVD)\nReview Date: 2014/10/29\nStore: Michael Douglas  (Actor),     Annette Bening  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox. The blockbuster romantic comedy about a modern president and the beautiful environmental lobbyist who wins his heart. 1995/color/115 min/PG-13/widescreen.NOTE:Widescreen version Presented in a \"Letterbox\" widescreen format preserving the \"scope\" aspect ratio of its original theatrical exhibition.Enhance For widescreen TV\\'s.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Martin Sheen, Michael J. Fox, Rob Reiner, Michael Douglas', 'Language': 'Unqualified', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 0.01 Ounces', 'Item model number': '4314658', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Had to purchase now its on dvd, love this movie,<br />only had it on VHS.\nReview Title: Movie Anytime for Enjoyment\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Film Noir Double Feature: Please Murder Me / A Life At Stake\nReview Date: 2014/12/18\nStore: Peter Godfrey  (Director),     Paul Guilfoyle  (Director),     Lamont Johnson  (Actor),     Raymond Burr  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Please Murder Me', '(B&W, 1956):', '\"In 55 minutes I will be dead... murdered.\" Attorney Craig Carlson, sitting in the shadows of his dark office, solemnly dictates this stunning announcement into a tape recorder. Carlson has fallen in love with Myra, the wife of his best friend, Joe Leeds. Joe is found dead and Myra is arrested for murder. Carlson defends her at the trial. Things are not always as they seem and there are no happy endings for the doomed participants of this tragic triangle. One year before his Perry Mason show, Raymond Burr plays a similar role in this dark, low-budget film noir. A young Angela Lansbury plays the femme fatale, and Dick Foran, veteran of B Westerns and Universal horror movies plays the murder victim Joe Leeds.', 'A Life at Stake', '(B&W, 1954):', \"An architect embroiled in an adulterous affair suspects that he is marked for murder. Building designer Edward Shaw has been making time with Doris, his business partner's wife. After being pressured by the couple to take out a hefty life insurance policy, he narrowly escapes death in a strange, nearly fatal accident. Doris's own sister, Madge, divulges that Doris' first husband had died under mysterious circumstances, and Shaw even tells the police of his suspicions. Torn between his fear of death and his lust for Doris, Shaw nonetheless agrees to meet his lover in a mountaintop cabin. When her cuckolded husband finally appears at the door, hard-drinking Doris brings a gun into the picture, and death arrives shortly thereafter.\"]\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'ALVI5218DVD', 'Director': 'Peter Godfrey, Paul Guilfoyle', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 20, 2022', 'Actors': 'Lamont Johnson, Raymond Burr, Angela Lansbury', 'Studio': 'Alpha Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: purchased this movie, I am a big fan of Raymond Burr and Angela Lansbury,<br />really enjoy murder mystery and who done it film noir.\nReview Title: Film noir double feature\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: My Girl 2 [DVD]\nReview Date: 2015/02/13\nStore: Dan Aykroyd  (Actor),     Jamie Lee Curtis  (Actor),     Howard Zieff  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Vada is off to California for a visit with her uncle, his likable girlfriend, and her street-smart son Nick. Guided by Nick through the City of Angels in search of clues to her late mother's history, Vada makes some surprising discoveries about her past and her future place in the Sultenfuss family tree.\", 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG', 'Release Date:', '7-DEC-2004', 'Media Type:', 'DVD']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance', 'Format': 'Color, DVD, NTSC, Closed-captioned', 'Contributor': \"Anthony R. Jones, Gerrit Graham, Anna Chlumsky, Dan Aykroyd, Christine Ebersole, Jamie Lee Curtis, J.D. Souther, Janet Kovalcik, Richard Masur, Aubrey Morris, Austin O'Brien, Angeline Ball, Howard Zieff, Ben Stein, Laurice ElehwanyAnthony R. Jones, Gerrit Graham, Anna Chlumsky, Dan Aykroyd, Christine Ebersole, Jamie Lee Curtis, J.D. Souther, Janet Kovalcik, Richard Masur, Aubrey Morris, Austin O'Brien, Angeline Ball, Howard Zieff, Ben Stein, Laurice Elehwany   See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396078901', 'Director': 'Howard Zieff', 'Media Format': 'Color, DVD, NTSC, Closed-captioned', 'Run time': '1 hour and 39 minutes', 'Release date': 'December 3, 2002', 'Actors': \"Dan Aykroyd, Jamie Lee Curtis, Anna Chlumsky, Austin O'Brien, Richard Masur\", 'Dubbed': 'Portuguese, French', 'Subtitles': 'English, Portuguese, Spanish, French', 'Studio': 'Sony Pictures', 'Writers': 'Janet Kovalcik, Laurice Elehwany', 'Number of discs': '1'}\nReview Text: for adventure and entertainment from kids investigating leads for a school  project<br />meeting and interviewing friends from the past whom her mother had known,enteraining for family fun.\nReview Title: MY GIRL 2\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Murder, She Wrote: The Complete Sixth Season\nReview Date: 2015/02/13\nStore: Angela Lansbury  (Actor),     Ron Masak  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', \"Get ready for another chapter in this collection of clever, entertaining mysteries as all 22 episodes of Murder, She Wrote: The Complete Sixth Season arrive on DVD! Rejoin Angela Lansbury in the season that won her the Golden Globe® for Best Actress as writer/detective Jessica Fletcher, who's always uncovering crime whether she's nestled in the charming town of Cabot Cove or traveling the world. On the case with her is an impressive lineup of guest stars, including Megan Mullally, Erin Gray and Bill Maher. Featuring exclusive interviews with Angela Lansbury and members of the cast and crew, this 5-disc set includes the beloved sleuth's thrilling involvements with international espionage, high society crime, and low-life mercenaries. The sixth season of Murder, She Wrote earned 4 Emmy® and two Golden Globe® nominations and thrilled fans and critics alike. Return to the scene of the crime!\", 'Bonus Content:', 'Disc 1:', 'Recipe for a Hit', 'Recipe for a Hit', \"America's Top Sleuths\", \"America's Top Sleuths\", ']]>', 'Amazon.com', 'As', 'Murder, She Wrote', 'saunters through its sixth (of an eventual 12) season, star Angela Lansbury maintains her eternally buoyant and inquisitive air as Jessica Fletcher, professional writer and amateur sleuth. Though Jessica continued to investigate murders in her home town of Cabot Cove and elsewhere (in the worlds of high finance, opera, and voodoo, among other settings), this season began the practice of guest detective episodes, introduced by Jessica as either a story she wrote or a tale told by a friend, but starring a variety of quirky investigators: An ex-football player (Ken Howard,', 'The White Shadow', ') paired with a clever poodle; a television crime-show producer who solved crime in real life (Diana Canova,', 'Soap', '); a stout Irish detective (longtime character actor Pat Hingle); an abrasive homicide cop (Barry Newman,', 'Vanishing Point', '); as well as recurring', 'Murder, She Wrote', 'characters like former jewel thief Dennis Stanton (Keith Michell) and British secret agent Michael Haggerty (Len Cariou). The producers were obviously hoping to use', 'Murder, She Wrote', \"'s popularity to spin-off new series, but nothing from this season took off and viewer resistance soon brought the practice to an end. Executives must have been surprised to discover that, though murder mysteries are plot-driven, this show's success depends heavily on the undeniable charm of star Lansbury. Still, these one-off episodes are of a consistent quality with Lansbury's, and viewers open to variety will enjoy them just as much. The rest of the season features the usual astonishing array of guests, including movie stars old (Donald O'Connor,\", \"Singin' in the Rain\", ') and recent (Elliott Gould,', 'The Long Goodbye', '), television stalwarts (Shirley Jones,', 'The Partridge Family', '; Jerry Stiller,', 'The King of Queens', '; Doris Roberts,', 'Everyone Loves Raymond', '; Kevin Tighe,', 'Battlestar Galactica', '; and Gavin McLeod,', 'The Love Boat', '), and D-list celebrities to die for (Dack Rambo, Morgan Brittany, Susan Anton, and more).', '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '61032999', 'Media Format': 'Multiple Formats, Dolby, Full Screen, Subtitled, NTSC, Color', 'Run time': '17 hours and 24 minutes', 'Release date': 'April 17, 2007', 'Actors': 'Angela Lansbury, Ron Masak, William Windom, Barbara Parkins', 'Subtitles': 'English', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '5'}\nReview Text: love adventure and excitement solving crime, you will have fun<br />watching these mysteries.\nReview Title: MURDER. SHE WROTE\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Murder, She Wrote: The Complete Seventh Season\nReview Date: 2015/02/13\nStore: Angela Lansbury  (Actor),     Ron Masak  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Get ready for yet another chapter of television\\'s most clever series as all 22 episodes of Murder She Wrote: The Complete Seventh Season arrive on DVD! Rejoin Golden Globe winner Angela Lansbury as writer/detective Jessica Fletcher in the season that earned a Golden Globe nomination and two Primetime Emmy Award nominations! With her at the scene of the crime is an impressive lineup of guest stars, including Patricia Neal and the iconic Jerry Orbach. This 6-disc set includes the entertaining Bonus Feature \"The Perils of Success\" (exclusive interviews with Lansbury and other members of the cast and crew) and a season highlights reel. Whether Jessica is partnered with insurance investigator Dennis Stanton (Keith Michell), making her case in Nashville or even working to clear her own name, it\\'s no mystery why the acclaimed series earned 41 Primetime Emmy Award nominations and 16 Golden Globe nominations during its many years of broadcast. Murder She Wrote: The Complete Seventh Season: so good, it\\'s a crime!Bonus Content:', 'Disc 1:', 'The Perils of Success', 'The Perils of Success']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 2 inches; 13.76 Ounces', 'Media Format': 'Multiple Formats, Full Screen, Color, NTSC, Subtitled', 'Run time': '17 hours and 31 minutes', 'Release date': 'October 9, 2007', 'Actors': 'Angela Lansbury, Ron Masak, William Windom', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Mystery solving crime by a crime stopper, very enjoyable  not boring keeps you guessing.\nReview Title: MURDER, SHE WROTE\nRating: 4.0\n--------------------------------------------------",
  "reference": "Murder, She Wrote: Season 2\nAngela Lansbury  (Actor),     Tom Bosley  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Emmy Award nominee Angela Lansbury is back on the case in all 22 episodes of the critically acclaimed series, Murder, She Wrote Season Two. Rejoin Jessica Fletcher, everyone\\'s favorite mystery writer, back in Cabot Cove, where she pens her whodunit books and keeps finding that her life is imitating her art. Teamed with some of the biggest guest stars on television, including Jerry Orbach, Adrienne Barbeau, Dick Van Patten and Carol Lawrence, Jessica continues her quest to find the truth in even the murkiest circumstances. Catch the complete second season of Murder, She Wrote, the classic mystery series that \"…remains well worth revisiting two decades later\" (Josef Adalian, Daily Variety).']\n{'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Box set, Color, Dolby, Full Screen', 'Contributor': 'William Windom, Tom Bosley, Angela Lansbury', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.72 x 6.02 x 1.89 inches; 8.8 Ounces', 'Media Format': 'Box set, Color, Dolby, Full Screen', 'Run time': '35 hours and 28 minutes', 'Release date': 'December 6, 2005', 'Actors': 'Angela Lansbury, Tom Bosley, William Windom', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '3'}\nenjoy watching crime stopper with mrs. fletcher<br />she's exciting to watch<br />anyone whose interest is in solving crimes will like it<br />as much as I do.\nmurder she wrote\nPerry Mason: Season 1, Vol. 1\nRaymond Burr  (Actor),     Barbara Hale  (Actor),     Robert Ellis Miller  (Director),     Ted Post  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Mystery & Thrillers\n['Product Description', 'Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt. Steps to access the closed-captioning is as follows: 1. Press SETTINGS on your remote. 2. Using the left/right arrow buttons, scroll to Quick Settings. 3. Using the up/down arrow buttons, scroll to Closed Captioning. 4. Press SELECT on your remote. 5. Using the up/down arrow buttons, scroll to highlight On, On with Mute or Off. 6. Press SELECT on your remote.', 'Amazon.com', 'There was a time when the defense attorney was a heroic everyman, not the butt of bad jokes; think Atticus Finch in', 'To Kill a Mockingbird', \", and, of course, Raymond Burr's incomparable Perry Mason. The first season of\", 'Perry Mason', ', which launched in 1957 on CBS, shows just how dramatic a \"law and order\" show could be. Shot in lush black and white, on film, the episodes have been lovingly restored (including lost minutes hacked from reruns to accommodate commercials). The story arcs and atmosphere feel more like film noir (Perry Mason + Philip Marlowe = separated at birth?) than early TV. The cast was stellar, including Burr\\'s Emmy-winning Perry Mason, the indefatigable lawyer who takes tough cases no one else will touch. Burr\\'s chemistry crackles from episode 1 with his costars, including Barbara Hale as secretary Della, William Hopper as private detective Paul Drake, and William Talman as Hamilton Burger, the well-meaning but overmatched district attorney. While it\\'s true that the last-minute witness-stand confessions strain some credulity, the case-cracking, character development, and dialogue set a high bar for the legal shows that followed. \"The Case of the Negligent Nymph,\" for instance, involves a comely young woman--and murder suspect--fished out of the Pacific; Mason deadpans to Drake, \"Call off the search, Paul; we\\'ve landed our mermaid.\" The shows unfold at a leisurely pace, and yet don\\'t rely on the overly expositive dialogue that, say,', 'Law & Order', \"does; the viewer learns a lot about each case simply as it happens. The set contains the first 19 episodes of the first season and will hook you, even if you're not a procedural buff.\", '--A.T. Hurley']\n{'Genre': 'Television, Television/Crime', 'Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Contributor': 'Gerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert KayGerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert Kay   See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.91 x 5.44 x 7.8 inches; 9.59 Ounces', 'Item model number': '097368878143', 'Director': 'Robert Ellis Miller, Ted Post, James Goldstone, Jack Arnold, Don Weis', 'Media Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Run time': '1 hour', 'Release date': 'July 11, 2006', 'Actors': 'Raymond Burr, Barbara Hale, William Talman, William Hopper', 'Studio': 'Paramount/CBS', 'Number of discs': '5'}\nI am a any time fan of perry mason<br />murder,mystery, intrigue, excitement,keeps me guessing<br />all through the courtroom drama fascinated with the<br />actors that play the rolls.<br />Enjoyable!\nperry mason, season 1,vol l\nLoves Music, Loves to Dance (Mary Higgins Clark Mystery Collection)\nPatsy Kensit  (Actor),     Cynthia Preston  (Actor),     Mario Azzopardi  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"A talk show producer faces her own guilt when she discovers that her best friend was murdered after answering an online personal ad. Against the wishes of detective D'Salva, she begins a treacherous dating game, drawing the killer's sights to her.\"]\n{'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Michael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah JohnsonMichael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah Johnson   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4.8 Ounces', 'Director': 'Mario Azzopardi', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Patsy Kensit, Cynthia Preston, Dean McDermott, Frank Pellegrino, Yannick Bisson', 'Studio': 'Lions Gate', 'Writers': 'Mary Higgins Clark, Peter Mohan', 'Number of discs': '1'}\nhad the chance to watch this movies before purchasing, had fun<br />and excitement trying to figure who committed the crimes.<br />Had to purchase , still enjoying .<br />If you enjoy watching and solving crime of<br />the who done it, you will have fun with his movie.\nmary higgins clark's loves music loves to dance\n7 Men from Now (Widescreen Special Collector's Edition)\nJohn Phillips  (Actor),     Chuck Roberson  (Actor),     Budd Boetticher  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Westerns', 'Format': \"Multiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, Widescreen   See more\", 'Contributor': 'Randolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail RussellRandolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail Russell   See more', 'Language': 'English', 'Runtime': '1 hour and 18 minutes'}\nif you love western from the 1940-50's era, as I do<br />you will have fun watching hours of back in the day<br />cowboys in the old west, bringing law and order<br />to the western frontier!\n7 men from now\nThe Blue Gardenia\nAnne Baxter  (Actor),     Richard Conte  (Actor),     Fritz Lang  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['A drunken woman hits her blind date with a poker, then reads about his death in the paper. Directed by Fritz Lang.']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': \"Jeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann SothernJeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann Sothern   See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'ID9042AQDVD', 'Director': 'Fritz Lang', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 11, 2000', 'Actors': 'Anne Baxter, Richard Conte, Ann Sothern, Raymond Burr, Jeff Donnell', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Charles Hoffman, Vera Caspary', 'Number of discs': '1'}\nHad previously viewed this movie, really enjoyed the<br />action and suspense.<br />Had fun watching, if you love solving puzzles, try it!\nSUSPENSE MOVIEGOER!\nAmerican President, The (DVD)\nMichael Douglas  (Actor),     Annette Bening  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox. The blockbuster romantic comedy about a modern president and the beautiful environmental lobbyist who wins his heart. 1995/color/115 min/PG-13/widescreen.NOTE:Widescreen version Presented in a \"Letterbox\" widescreen format preserving the \"scope\" aspect ratio of its original theatrical exhibition.Enhance For widescreen TV\\'s.']\n{'Genre': 'Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Martin Sheen, Michael J. Fox, Rob Reiner, Michael Douglas', 'Language': 'Unqualified', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 0.01 Ounces', 'Item model number': '4314658', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nHad to purchase now its on dvd, love this movie,<br />only had it on VHS.\nMovie Anytime for Enjoyment\nFilm Noir Double Feature: Please Murder Me / A Life At Stake\nPeter Godfrey  (Director),     Paul Guilfoyle  (Director),     Lamont Johnson  (Actor),     Raymond Burr  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Please Murder Me', '(B&W, 1956):', '\"In 55 minutes I will be dead... murdered.\" Attorney Craig Carlson, sitting in the shadows of his dark office, solemnly dictates this stunning announcement into a tape recorder. Carlson has fallen in love with Myra, the wife of his best friend, Joe Leeds. Joe is found dead and Myra is arrested for murder. Carlson defends her at the trial. Things are not always as they seem and there are no happy endings for the doomed participants of this tragic triangle. One year before his Perry Mason show, Raymond Burr plays a similar role in this dark, low-budget film noir. A young Angela Lansbury plays the femme fatale, and Dick Foran, veteran of B Westerns and Universal horror movies plays the murder victim Joe Leeds.', 'A Life at Stake', '(B&W, 1954):', \"An architect embroiled in an adulterous affair suspects that he is marked for murder. Building designer Edward Shaw has been making time with Doris, his business partner's wife. After being pressured by the couple to take out a hefty life insurance policy, he narrowly escapes death in a strange, nearly fatal accident. Doris's own sister, Madge, divulges that Doris' first husband had died under mysterious circumstances, and Shaw even tells the police of his suspicions. Torn between his fear of death and his lust for Doris, Shaw nonetheless agrees to meet his lover in a mountaintop cabin. When her cuckolded husband finally appears at the door, hard-drinking Doris brings a gun into the picture, and death arrives shortly thereafter.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'ALVI5218DVD', 'Director': 'Peter Godfrey, Paul Guilfoyle', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 20, 2022', 'Actors': 'Lamont Johnson, Raymond Burr, Angela Lansbury', 'Studio': 'Alpha Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\npurchased this movie, I am a big fan of Raymond Burr and Angela Lansbury,<br />really enjoy murder mystery and who done it film noir.\nFilm noir double feature\nMy Girl 2 [DVD]\nDan Aykroyd  (Actor),     Jamie Lee Curtis  (Actor),     Howard Zieff  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Vada is off to California for a visit with her uncle, his likable girlfriend, and her street-smart son Nick. Guided by Nick through the City of Angels in search of clues to her late mother's history, Vada makes some surprising discoveries about her past and her future place in the Sultenfuss family tree.\", 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG', 'Release Date:', '7-DEC-2004', 'Media Type:', 'DVD']\n{'Genre': 'Romance', 'Format': 'Color, DVD, NTSC, Closed-captioned', 'Contributor': \"Anthony R. Jones, Gerrit Graham, Anna Chlumsky, Dan Aykroyd, Christine Ebersole, Jamie Lee Curtis, J.D. Souther, Janet Kovalcik, Richard Masur, Aubrey Morris, Austin O'Brien, Angeline Ball, Howard Zieff, Ben Stein, Laurice ElehwanyAnthony R. Jones, Gerrit Graham, Anna Chlumsky, Dan Aykroyd, Christine Ebersole, Jamie Lee Curtis, J.D. Souther, Janet Kovalcik, Richard Masur, Aubrey Morris, Austin O'Brien, Angeline Ball, Howard Zieff, Ben Stein, Laurice Elehwany   See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396078901', 'Director': 'Howard Zieff', 'Media Format': 'Color, DVD, NTSC, Closed-captioned', 'Run time': '1 hour and 39 minutes', 'Release date': 'December 3, 2002', 'Actors': \"Dan Aykroyd, Jamie Lee Curtis, Anna Chlumsky, Austin O'Brien, Richard Masur\", 'Dubbed': 'Portuguese, French', 'Subtitles': 'English, Portuguese, Spanish, French', 'Studio': 'Sony Pictures', 'Writers': 'Janet Kovalcik, Laurice Elehwany', 'Number of discs': '1'}\nfor adventure and entertainment from kids investigating leads for a school  project<br />meeting and interviewing friends from the past whom her mother had known,enteraining for family fun.\nMY GIRL 2\nMurder, She Wrote: The Complete Sixth Season\nAngela Lansbury  (Actor),     Ron Masak  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', \"Get ready for another chapter in this collection of clever, entertaining mysteries as all 22 episodes of Murder, She Wrote: The Complete Sixth Season arrive on DVD! Rejoin Angela Lansbury in the season that won her the Golden Globe® for Best Actress as writer/detective Jessica Fletcher, who's always uncovering crime whether she's nestled in the charming town of Cabot Cove or traveling the world. On the case with her is an impressive lineup of guest stars, including Megan Mullally, Erin Gray and Bill Maher. Featuring exclusive interviews with Angela Lansbury and members of the cast and crew, this 5-disc set includes the beloved sleuth's thrilling involvements with international espionage, high society crime, and low-life mercenaries. The sixth season of Murder, She Wrote earned 4 Emmy® and two Golden Globe® nominations and thrilled fans and critics alike. Return to the scene of the crime!\", 'Bonus Content:', 'Disc 1:', 'Recipe for a Hit', 'Recipe for a Hit', \"America's Top Sleuths\", \"America's Top Sleuths\", ']]>', 'Amazon.com', 'As', 'Murder, She Wrote', 'saunters through its sixth (of an eventual 12) season, star Angela Lansbury maintains her eternally buoyant and inquisitive air as Jessica Fletcher, professional writer and amateur sleuth. Though Jessica continued to investigate murders in her home town of Cabot Cove and elsewhere (in the worlds of high finance, opera, and voodoo, among other settings), this season began the practice of guest detective episodes, introduced by Jessica as either a story she wrote or a tale told by a friend, but starring a variety of quirky investigators: An ex-football player (Ken Howard,', 'The White Shadow', ') paired with a clever poodle; a television crime-show producer who solved crime in real life (Diana Canova,', 'Soap', '); a stout Irish detective (longtime character actor Pat Hingle); an abrasive homicide cop (Barry Newman,', 'Vanishing Point', '); as well as recurring', 'Murder, She Wrote', 'characters like former jewel thief Dennis Stanton (Keith Michell) and British secret agent Michael Haggerty (Len Cariou). The producers were obviously hoping to use', 'Murder, She Wrote', \"'s popularity to spin-off new series, but nothing from this season took off and viewer resistance soon brought the practice to an end. Executives must have been surprised to discover that, though murder mysteries are plot-driven, this show's success depends heavily on the undeniable charm of star Lansbury. Still, these one-off episodes are of a consistent quality with Lansbury's, and viewers open to variety will enjoy them just as much. The rest of the season features the usual astonishing array of guests, including movie stars old (Donald O'Connor,\", \"Singin' in the Rain\", ') and recent (Elliott Gould,', 'The Long Goodbye', '), television stalwarts (Shirley Jones,', 'The Partridge Family', '; Jerry Stiller,', 'The King of Queens', '; Doris Roberts,', 'Everyone Loves Raymond', '; Kevin Tighe,', 'Battlestar Galactica', '; and Gavin McLeod,', 'The Love Boat', '), and D-list celebrities to die for (Dack Rambo, Morgan Brittany, Susan Anton, and more).', '--Bret Fetzer']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '61032999', 'Media Format': 'Multiple Formats, Dolby, Full Screen, Subtitled, NTSC, Color', 'Run time': '17 hours and 24 minutes', 'Release date': 'April 17, 2007', 'Actors': 'Angela Lansbury, Ron Masak, William Windom, Barbara Parkins', 'Subtitles': 'English', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '5'}\nlove adventure and excitement solving crime, you will have fun<br />watching these mysteries.\nMURDER. SHE WROTE\nMurder, She Wrote: The Complete Seventh Season\nAngela Lansbury  (Actor),     Ron Masak  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Get ready for yet another chapter of television\\'s most clever series as all 22 episodes of Murder She Wrote: The Complete Seventh Season arrive on DVD! Rejoin Golden Globe winner Angela Lansbury as writer/detective Jessica Fletcher in the season that earned a Golden Globe nomination and two Primetime Emmy Award nominations! With her at the scene of the crime is an impressive lineup of guest stars, including Patricia Neal and the iconic Jerry Orbach. This 6-disc set includes the entertaining Bonus Feature \"The Perils of Success\" (exclusive interviews with Lansbury and other members of the cast and crew) and a season highlights reel. Whether Jessica is partnered with insurance investigator Dennis Stanton (Keith Michell), making her case in Nashville or even working to clear her own name, it\\'s no mystery why the acclaimed series earned 41 Primetime Emmy Award nominations and 16 Golden Globe nominations during its many years of broadcast. Murder She Wrote: The Complete Seventh Season: so good, it\\'s a crime!Bonus Content:', 'Disc 1:', 'The Perils of Success', 'The Perils of Success']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 2 inches; 13.76 Ounces', 'Media Format': 'Multiple Formats, Full Screen, Color, NTSC, Subtitled', 'Run time': '17 hours and 31 minutes', 'Release date': 'October 9, 2007', 'Actors': 'Angela Lansbury, Ron Masak, William Windom', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nMystery solving crime by a crime stopper, very enjoyable  not boring keeps you guessing.\nMURDER, SHE WROTE",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Murder, She Wrote: Season 2\nReview Date: 2014/05/13\nStore: Angela Lansbury  (Actor),     Tom Bosley  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Emmy Award nominee Angela Lansbury is back on the case in all 22 episodes of the critically acclaimed series, Murder, She Wrote Season Two. Rejoin Jessica Fletcher, everyone\\'s favorite mystery writer, back in Cabot Cove, where she pens her whodunit books and keeps finding that her life is imitating her art. Teamed with some of the biggest guest stars on television, including Jerry Orbach, Adrienne Barbeau, Dick Van Patten and Carol Lawrence, Jessica continues her quest to find the truth in even the murkiest circumstances. Catch the complete second season of Murder, She Wrote, the classic mystery series that \"…remains well worth revisiting two decades later\" (Josef Adalian, Daily Variety).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Box set, Color, Dolby, Full Screen', 'Contributor': 'William Windom, Tom Bosley, Angela Lansbury', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.72 x 6.02 x 1.89 inches; 8.8 Ounces', 'Media Format': 'Box set, Color, Dolby, Full Screen', 'Run time': '35 hours and 28 minutes', 'Release date': 'December 6, 2005', 'Actors': 'Angela Lansbury, Tom Bosley, William Windom', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '3'}\nReview Text: enjoy watching crime stopper with mrs. fletcher<br />she's exciting to watch<br />anyone whose interest is in solving crimes will like it<br />as much as I do.\nReview Title: murder she wrote\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 1, Vol. 1\nReview Date: 2014/05/13\nStore: Raymond Burr  (Actor),     Barbara Hale  (Actor),     Robert Ellis Miller  (Director),     Ted Post  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Mystery & Thrillers\nProduct Description: ['Product Description', 'Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt. Steps to access the closed-captioning is as follows: 1. Press SETTINGS on your remote. 2. Using the left/right arrow buttons, scroll to Quick Settings. 3. Using the up/down arrow buttons, scroll to Closed Captioning. 4. Press SELECT on your remote. 5. Using the up/down arrow buttons, scroll to highlight On, On with Mute or Off. 6. Press SELECT on your remote.', 'Amazon.com', 'There was a time when the defense attorney was a heroic everyman, not the butt of bad jokes; think Atticus Finch in', 'To Kill a Mockingbird', \", and, of course, Raymond Burr's incomparable Perry Mason. The first season of\", 'Perry Mason', ', which launched in 1957 on CBS, shows just how dramatic a \"law and order\" show could be. Shot in lush black and white, on film, the episodes have been lovingly restored (including lost minutes hacked from reruns to accommodate commercials). The story arcs and atmosphere feel more like film noir (Perry Mason + Philip Marlowe = separated at birth?) than early TV. The cast was stellar, including Burr\\'s Emmy-winning Perry Mason, the indefatigable lawyer who takes tough cases no one else will touch. Burr\\'s chemistry crackles from episode 1 with his costars, including Barbara Hale as secretary Della, William Hopper as private detective Paul Drake, and William Talman as Hamilton Burger, the well-meaning but overmatched district attorney. While it\\'s true that the last-minute witness-stand confessions strain some credulity, the case-cracking, character development, and dialogue set a high bar for the legal shows that followed. \"The Case of the Negligent Nymph,\" for instance, involves a comely young woman--and murder suspect--fished out of the Pacific; Mason deadpans to Drake, \"Call off the search, Paul; we\\'ve landed our mermaid.\" The shows unfold at a leisurely pace, and yet don\\'t rely on the overly expositive dialogue that, say,', 'Law & Order', \"does; the viewer learns a lot about each case simply as it happens. The set contains the first 19 episodes of the first season and will hook you, even if you're not a procedural buff.\", '--A.T. Hurley']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Contributor': 'Gerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert KayGerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert Kay   See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.91 x 5.44 x 7.8 inches; 9.59 Ounces', 'Item model number': '097368878143', 'Director': 'Robert Ellis Miller, Ted Post, James Goldstone, Jack Arnold, Don Weis', 'Media Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Run time': '1 hour', 'Release date': 'July 11, 2006', 'Actors': 'Raymond Burr, Barbara Hale, William Talman, William Hopper', 'Studio': 'Paramount/CBS', 'Number of discs': '5'}\nReview Text: I am a any time fan of perry mason<br />murder,mystery, intrigue, excitement,keeps me guessing<br />all through the courtroom drama fascinated with the<br />actors that play the rolls.<br />Enjoyable!\nReview Title: perry mason, season 1,vol l\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Loves Music, Loves to Dance (Mary Higgins Clark Mystery Collection)\nReview Date: 2014/05/15\nStore: Patsy Kensit  (Actor),     Cynthia Preston  (Actor),     Mario Azzopardi  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"A talk show producer faces her own guilt when she discovers that her best friend was murdered after answering an online personal ad. Against the wishes of detective D'Salva, she begins a treacherous dating game, drawing the killer's sights to her.\"]\nAverage Rating: 3.7\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Michael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah JohnsonMichael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah Johnson   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4.8 Ounces', 'Director': 'Mario Azzopardi', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Patsy Kensit, Cynthia Preston, Dean McDermott, Frank Pellegrino, Yannick Bisson', 'Studio': 'Lions Gate', 'Writers': 'Mary Higgins Clark, Peter Mohan', 'Number of discs': '1'}\nReview Text: had the chance to watch this movies before purchasing, had fun<br />and excitement trying to figure who committed the crimes.<br />Had to purchase , still enjoying .<br />If you enjoy watching and solving crime of<br />the who done it, you will have fun with his movie.\nReview Title: mary higgins clark's loves music loves to dance\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 7 Men from Now (Widescreen Special Collector's Edition)\nReview Date: 2014/05/15\nStore: John Phillips  (Actor),     Chuck Roberson  (Actor),     Budd Boetticher  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Westerns', 'Format': \"Multiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, Widescreen   See more\", 'Contributor': 'Randolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail RussellRandolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail Russell   See more', 'Language': 'English', 'Runtime': '1 hour and 18 minutes'}\nReview Text: if you love western from the 1940-50's era, as I do<br />you will have fun watching hours of back in the day<br />cowboys in the old west, bringing law and order<br />to the western frontier!\nReview Title: 7 men from now\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Blue Gardenia\nReview Date: 2014/07/22\nStore: Anne Baxter  (Actor),     Richard Conte  (Actor),     Fritz Lang  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['A drunken woman hits her blind date with a poker, then reads about his death in the paper. Directed by Fritz Lang.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': \"Jeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann SothernJeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann Sothern   See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'ID9042AQDVD', 'Director': 'Fritz Lang', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 11, 2000', 'Actors': 'Anne Baxter, Richard Conte, Ann Sothern, Raymond Burr, Jeff Donnell', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Charles Hoffman, Vera Caspary', 'Number of discs': '1'}\nReview Text: Had previously viewed this movie, really enjoyed the<br />action and suspense.<br />Had fun watching, if you love solving puzzles, try it!\nReview Title: SUSPENSE MOVIEGOER!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: American President, The (DVD)\nReview Date: 2014/10/29\nStore: Michael Douglas  (Actor),     Annette Bening  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox. The blockbuster romantic comedy about a modern president and the beautiful environmental lobbyist who wins his heart. 1995/color/115 min/PG-13/widescreen.NOTE:Widescreen version Presented in a \"Letterbox\" widescreen format preserving the \"scope\" aspect ratio of its original theatrical exhibition.Enhance For widescreen TV\\'s.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Martin Sheen, Michael J. Fox, Rob Reiner, Michael Douglas', 'Language': 'Unqualified', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 0.01 Ounces', 'Item model number': '4314658', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Had to purchase now its on dvd, love this movie,<br />only had it on VHS.\nReview Title: Movie Anytime for Enjoyment\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Film Noir Double Feature: Please Murder Me / A Life At Stake\nReview Date: 2014/12/18\nStore: Peter Godfrey  (Director),     Paul Guilfoyle  (Director),     Lamont Johnson  (Actor),     Raymond Burr  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Please Murder Me', '(B&W, 1956):', '\"In 55 minutes I will be dead... murdered.\" Attorney Craig Carlson, sitting in the shadows of his dark office, solemnly dictates this stunning announcement into a tape recorder. Carlson has fallen in love with Myra, the wife of his best friend, Joe Leeds. Joe is found dead and Myra is arrested for murder. Carlson defends her at the trial. Things are not always as they seem and there are no happy endings for the doomed participants of this tragic triangle. One year before his Perry Mason show, Raymond Burr plays a similar role in this dark, low-budget film noir. A young Angela Lansbury plays the femme fatale, and Dick Foran, veteran of B Westerns and Universal horror movies plays the murder victim Joe Leeds.', 'A Life at Stake', '(B&W, 1954):', \"An architect embroiled in an adulterous affair suspects that he is marked for murder. Building designer Edward Shaw has been making time with Doris, his business partner's wife. After being pressured by the couple to take out a hefty life insurance policy, he narrowly escapes death in a strange, nearly fatal accident. Doris's own sister, Madge, divulges that Doris' first husband had died under mysterious circumstances, and Shaw even tells the police of his suspicions. Torn between his fear of death and his lust for Doris, Shaw nonetheless agrees to meet his lover in a mountaintop cabin. When her cuckolded husband finally appears at the door, hard-drinking Doris brings a gun into the picture, and death arrives shortly thereafter.\"]\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'ALVI5218DVD', 'Director': 'Peter Godfrey, Paul Guilfoyle', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 20, 2022', 'Actors': 'Lamont Johnson, Raymond Burr, Angela Lansbury', 'Studio': 'Alpha Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: purchased this movie, I am a big fan of Raymond Burr and Angela Lansbury,<br />really enjoy murder mystery and who done it film noir.\nReview Title: Film noir double feature\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: My Girl 2 [DVD]\nReview Date: 2015/02/13\nStore: Dan Aykroyd  (Actor),     Jamie Lee Curtis  (Actor),     Howard Zieff  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Vada is off to California for a visit with her uncle, his likable girlfriend, and her street-smart son Nick. Guided by Nick through the City of Angels in search of clues to her late mother's history, Vada makes some surprising discoveries about her past and her future place in the Sultenfuss family tree.\", 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG', 'Release Date:', '7-DEC-2004', 'Media Type:', 'DVD']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance', 'Format': 'Color, DVD, NTSC, Closed-captioned', 'Contributor': \"Anthony R. Jones, Gerrit Graham, Anna Chlumsky, Dan Aykroyd, Christine Ebersole, Jamie Lee Curtis, J.D. Souther, Janet Kovalcik, Richard Masur, Aubrey Morris, Austin O'Brien, Angeline Ball, Howard Zieff, Ben Stein, Laurice ElehwanyAnthony R. Jones, Gerrit Graham, Anna Chlumsky, Dan Aykroyd, Christine Ebersole, Jamie Lee Curtis, J.D. Souther, Janet Kovalcik, Richard Masur, Aubrey Morris, Austin O'Brien, Angeline Ball, Howard Zieff, Ben Stein, Laurice Elehwany   See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396078901', 'Director': 'Howard Zieff', 'Media Format': 'Color, DVD, NTSC, Closed-captioned', 'Run time': '1 hour and 39 minutes', 'Release date': 'December 3, 2002', 'Actors': \"Dan Aykroyd, Jamie Lee Curtis, Anna Chlumsky, Austin O'Brien, Richard Masur\", 'Dubbed': 'Portuguese, French', 'Subtitles': 'English, Portuguese, Spanish, French', 'Studio': 'Sony Pictures', 'Writers': 'Janet Kovalcik, Laurice Elehwany', 'Number of discs': '1'}\nReview Text: for adventure and entertainment from kids investigating leads for a school  project<br />meeting and interviewing friends from the past whom her mother had known,enteraining for family fun.\nReview Title: MY GIRL 2\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Murder, She Wrote: The Complete Sixth Season\nReview Date: 2015/02/13\nStore: Angela Lansbury  (Actor),     Ron Masak  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', \"Get ready for another chapter in this collection of clever, entertaining mysteries as all 22 episodes of Murder, She Wrote: The Complete Sixth Season arrive on DVD! Rejoin Angela Lansbury in the season that won her the Golden Globe® for Best Actress as writer/detective Jessica Fletcher, who's always uncovering crime whether she's nestled in the charming town of Cabot Cove or traveling the world. On the case with her is an impressive lineup of guest stars, including Megan Mullally, Erin Gray and Bill Maher. Featuring exclusive interviews with Angela Lansbury and members of the cast and crew, this 5-disc set includes the beloved sleuth's thrilling involvements with international espionage, high society crime, and low-life mercenaries. The sixth season of Murder, She Wrote earned 4 Emmy® and two Golden Globe® nominations and thrilled fans and critics alike. Return to the scene of the crime!\", 'Bonus Content:', 'Disc 1:', 'Recipe for a Hit', 'Recipe for a Hit', \"America's Top Sleuths\", \"America's Top Sleuths\", ']]>', 'Amazon.com', 'As', 'Murder, She Wrote', 'saunters through its sixth (of an eventual 12) season, star Angela Lansbury maintains her eternally buoyant and inquisitive air as Jessica Fletcher, professional writer and amateur sleuth. Though Jessica continued to investigate murders in her home town of Cabot Cove and elsewhere (in the worlds of high finance, opera, and voodoo, among other settings), this season began the practice of guest detective episodes, introduced by Jessica as either a story she wrote or a tale told by a friend, but starring a variety of quirky investigators: An ex-football player (Ken Howard,', 'The White Shadow', ') paired with a clever poodle; a television crime-show producer who solved crime in real life (Diana Canova,', 'Soap', '); a stout Irish detective (longtime character actor Pat Hingle); an abrasive homicide cop (Barry Newman,', 'Vanishing Point', '); as well as recurring', 'Murder, She Wrote', 'characters like former jewel thief Dennis Stanton (Keith Michell) and British secret agent Michael Haggerty (Len Cariou). The producers were obviously hoping to use', 'Murder, She Wrote', \"'s popularity to spin-off new series, but nothing from this season took off and viewer resistance soon brought the practice to an end. Executives must have been surprised to discover that, though murder mysteries are plot-driven, this show's success depends heavily on the undeniable charm of star Lansbury. Still, these one-off episodes are of a consistent quality with Lansbury's, and viewers open to variety will enjoy them just as much. The rest of the season features the usual astonishing array of guests, including movie stars old (Donald O'Connor,\", \"Singin' in the Rain\", ') and recent (Elliott Gould,', 'The Long Goodbye', '), television stalwarts (Shirley Jones,', 'The Partridge Family', '; Jerry Stiller,', 'The King of Queens', '; Doris Roberts,', 'Everyone Loves Raymond', '; Kevin Tighe,', 'Battlestar Galactica', '; and Gavin McLeod,', 'The Love Boat', '), and D-list celebrities to die for (Dack Rambo, Morgan Brittany, Susan Anton, and more).', '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '61032999', 'Media Format': 'Multiple Formats, Dolby, Full Screen, Subtitled, NTSC, Color', 'Run time': '17 hours and 24 minutes', 'Release date': 'April 17, 2007', 'Actors': 'Angela Lansbury, Ron Masak, William Windom, Barbara Parkins', 'Subtitles': 'English', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '5'}\nReview Text: love adventure and excitement solving crime, you will have fun<br />watching these mysteries.\nReview Title: MURDER. SHE WROTE\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Murder, She Wrote: The Complete Seventh Season\nReview Date: 2015/02/13\nStore: Angela Lansbury  (Actor),     Ron Masak  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Get ready for yet another chapter of television\\'s most clever series as all 22 episodes of Murder She Wrote: The Complete Seventh Season arrive on DVD! Rejoin Golden Globe winner Angela Lansbury as writer/detective Jessica Fletcher in the season that earned a Golden Globe nomination and two Primetime Emmy Award nominations! With her at the scene of the crime is an impressive lineup of guest stars, including Patricia Neal and the iconic Jerry Orbach. This 6-disc set includes the entertaining Bonus Feature \"The Perils of Success\" (exclusive interviews with Lansbury and other members of the cast and crew) and a season highlights reel. Whether Jessica is partnered with insurance investigator Dennis Stanton (Keith Michell), making her case in Nashville or even working to clear her own name, it\\'s no mystery why the acclaimed series earned 41 Primetime Emmy Award nominations and 16 Golden Globe nominations during its many years of broadcast. Murder She Wrote: The Complete Seventh Season: so good, it\\'s a crime!Bonus Content:', 'Disc 1:', 'The Perils of Success', 'The Perils of Success']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 2 inches; 13.76 Ounces', 'Media Format': 'Multiple Formats, Full Screen, Color, NTSC, Subtitled', 'Run time': '17 hours and 31 minutes', 'Release date': 'October 9, 2007', 'Actors': 'Angela Lansbury, Ron Masak, William Windom', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Mystery solving crime by a crime stopper, very enjoyable  not boring keeps you guessing.\nReview Title: MURDER, SHE WROTE\nRating: 4.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe individual demonstrates a strong affinity for mystery and crime-solving narratives, consistently engaging with content featuring complex plots and suspenseful elements. This is evident from their high ratings (averaging around 4.5) and enthusiastic reviews focusing on intriguing storylines and character development across various mystery and drama titles, often involving amateur sleuths or legal battles.\n\nThey express a clear preference for classic and vintage productions, notably enjoying works from the 1940s and 1950s, indicating a taste for nostalgic cinema. Additionally, their purchase choices reflect a consistent interest in popular TV series that have garnered critical acclaim, suggesting they value quality storytelling and renowned actors.\n\nQuality appears to rank higher than price sensitivity, as they frequently opt for box sets and collector's editions, indicating a willingness to invest in comprehensive collections of beloved series. Overall, their habits reveal a dedicated viewer who seeks out engaging, character-driven mysteries within the genre of crime and suspense, often returning to the familiar charm of beloved classics.",
  "target_interaction": {
    "rating": 4.0,
    "title": "PERRY MASON",
    "text": "Courtroom drama great, solving case and crime really enjoy watching,<br />the actors make it great.",
    "images": [],
    "asin": "B000IHYXJO",
    "parent_asin": "B000IHYXJO",
    "user_id": "AFBQMCQZHMS626VDRBGBBC3HGM4Q",
    "timestamp": "2015-02-13 02:10:45",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Perry Mason: Season 1, Vol. 2",
    "average_rating": 4.8,
    "rating_number": 670,
    "features": [],
    "description": [
      "Product Description",
      "1040 minutes.",
      "Amazon.com",
      "The second volume of season 1 of",
      "Perry Mason",
      "fleshes out the splendid entire first year of the show, a masterpiece of '50s film noir and crisp, savvy TV writing. Raymond Burr's unflappable defense attorney Perry Mason is equal parts P.I., father confessor, and yes, judge, jury, and executioner. The crimes include murder most foul, and lots of that sordid specter that haunted people pre-internet: blackmail. Everyone has a motive, and everyone in the harsh light of Los Angeles seems to have something to hide. The boxed set contains the remaining 21 episodes of the first season, with highlights like \"The Case of the Lonely Heiress,\" in which detective and Mason sidekick Paul Drake tracks down a rich woman, who is then suddenly accused of the murder of the man who tried to find her. Some episodes haven't aged well (one involves Mason interviewing a \"schizophrenic\" woman on the witness stand, interviewing \"both\" her personalities). But overall, the writing and the assured ambience of the series, and Burr's commanding presence, make",
      "Perry Mason",
      "among TV's topnotch armchair crime series.",
      "--A.T. Hurley"
    ],
    "price": 18.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51GGvEvCyeL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GGvEvCyeL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Raymond Burr  (Actor),     William Hopper  (Actor)    Rated:    Unrated    Format: DVD",
    "categories": [
      "Movies & TV",
      "Paramount Home Entertainment",
      "Drama"
    ],
    "details": {
      "Genre": "Television, Television/Crime",
      "Format": "Multiple Formats, Box set, Black & White, NTSC, Closed-captioned",
      "Contributor": "S. John Launer, Michael Fox, Morris Ankrum, George E. Stone, Raymond Burr, Barbara Hale, Ray Collins, Kenneth MacDonald, Wesley Lau, Lee Miller, Erle Stanley Gardner, William Talman, William HopperS. John Launer, Michael Fox, Morris Ankrum, George E. Stone, Raymond Burr, Barbara Hale, Ray Collins, Kenneth MacDonald, Wesley Lau, Lee Miller, Erle Stanley Gardner, William Talman, William Hopper  See more",
      "Language": "Unqualified, English (Dolby Digital 2.0 Mono)",
      "Number Of Discs": "5",
      "Aspect Ratio": "1.33:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "Unrated (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 9.1 Ounces",
      "Item model number": "97368506541",
      "Media Format": "Multiple Formats, Box set, Black & White, NTSC, Closed-captioned",
      "Run time": "1 hour",
      "Release date": "November 21, 2006",
      "Actors": "Raymond Burr, William Hopper, Barbara Hale, William Talman, Ray Collins",
      "Studio": "Paramount",
      "Writers": "Erle Stanley Gardner",
      "Number of discs": "5"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}