{
  "user_id": "AEB2MZFZEQ4TVI4I2VZ4B2VTMMBQ",
  "summary": "=== Purchase Information ===\nProduct Title: East Side Kids: 10 Bowery Classics\nReview Date: 2008/05/05\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nAverage Rating: 4.1\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.4 Pounds', 'Media Format': 'NTSC', 'Release date': 'April 12, 2005', 'Studio': 'Alpha Video'}\nReview Text: This is a great DVD, and higher quality than most of the others.<br /><br />A thoughtful reviewer added the following but mistakenly added it as a comment on the first review (thus it doesn't show up for others to see unless they look at comments on the first review ;)  This way, all who look at reviews will see it:<br /><br />\"Packaged in a hardbound, cloth-covered case, this set includes the DVDs 'Neath Brooklyn Bridge (1941), Bowery Blitzkrieg (1941), Boys Of The City (1940), Clancy Street Boys (1943), Kid Dynamite (1943), Million Dollar Kid (1944), Mr. Wise Guy (1942), Smart Aleck (1942), Spooks Run Wild (1940) and That Gang Of Mine (1942).\"<br /><br />Cheers.\nReview Title: Titles (from comment upon first review) in this collection\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scrubs: The Complete Ninth and Final Season\nReview Date: 2011/08/09\nStore: Zach Braff  (Actor),     Donald Faison  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['See how the story ends for J.D., Elliot, Turk and the rest of your favorite characters in ABC’s Scrubs: The Complete Ninth And Final Season. The heroes of Sacred Heart may have finished their rounds, but the laughs never stop as they mentor a brand new class of med students!J.D. returns to teach at Sacred Heart’s medical school with the old gang and is surprised to find an impressionable young student has picked up where he left off. Meet Lucy and her classmates, Drew and Cole, as they try to fit in while they do their best to stand out.Relive every clever and quirky moment of Scrubs’ outrageous final season, complete with never-before-seen bloopers, deleted scenes and interviews with the show’s cast. Complete your Scrubs collection with the Ninth And Final Season on DVD. It’s the best house call you’ll ever get!']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '13505', 'Media Format': 'Multiple Formats, AC-3, Color, Closed-captioned, Dolby, Full Screen, Subtitled, NTSC', 'Run time': '6 hours and 30 minutes', 'Release date': 'September 28, 2010', 'Actors': 'Zach Braff, Donald Faison, Sarah Chalke, Judy Reyes, John C. McGinley', 'Subtitles': 'Spanish, French', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'ABC Studios', 'Number of discs': '2'}\nReview Text: Rather, this should have been Season 1 of \"Scrubs: Med School\" as far as I am concerned.  And, as I recall, the show was billed as \"Scrubs: Medical School\" when it aired.  Season 8 of Scrubs was clearly the final season - with JD's two-part \"goodbye\" episode (which was really sad for me, in all honesty) being the real Series Finale of the final season of Scrubs.  I admit that this spinoff (yes - let's be honest, that's what it was - with some cast members from the original, just like any spinoff) didn't quite do it for me the way the original show did - but it was the first season, and I think it deserved more of a chance (like more episodes, and a chance at a second season, etc..).  I know I was disappointed when they axed it, regardless of it's \"holding up\" to the original.<br /><br />ANYONE WHO WAS A TRUE FAN OF THE ORIGINAL WILL FIND PLENTY TO ENJOY FROM THIS SHOW.  re-hashed plots?  Recurring themes?  Blah blah blah...  Every sitcom over the past few decades are using much of \"the same old\" story-lines, themes, plot mechanisms.  The half-hour sitcom \"Grand Story\" has never been done better than Bill Lawrence and crew do it. I just shake my head at some of the whining, complaining folks.  YOU try doing a great, consistently funny, and actually often-meaningful show.  Then, try doing like a COUPLE DOZEN of them, EVERY YEAR, for NEARLY A DECADE.  (Head shaking some more).  Sheesh.  These are the brilliant storytellers of our time, imho.  Yes, of a genre, to be sure; but - stuff's just brilliant.  Season One, Two, Three - these may always be my favorites, but.. I love all of 'em, pretty much.<br /><br />If you own Scrubs 1 through 8, it'd be a mistake not sporting the mere 17-ish bucks for this, to complete your Scrubs collection.  (Yes, I said it was a spinoff.  It's also the final piece of the Scrubs legacy, and Ken Jenkins and John C. alone make it more-than worth it).\nReview Title: \"Scrubs\" or \"Scrubs: Medical School\"?  If you REALLY like Scrubs, you'll like this - regardless\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cougar Town: Season 2\nReview Date: 2011/09/01\nStore: Courtney Cox  (Actor),     Dan Byrd  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: ['Amazon.com', 'After a successful first season,', 'Cougar Town', \"could've rested on its laurels. Instead, a few changes are in store for the cul-de-sac crew, starting with Travis's departure for college, a development that leaves Jules (Courteney Cox) with a bad case of Empty Nest Syndrome--even though he only moves 20 minutes away (Dan Byrd remains a regular cast member). Formerly single, she's also now seeing Grayson (Josh Hopkins), which helps to explain the ever-changing title card: a series of riffs on the term\", 'cougar', '.', 'That said, things remain much the same for Andy (Ian Gomez) and Ellie (Christa Miller), though Bobby (Brian Van Holt) makes more of an effort to get his life in order, culminating in a patent for Penny Can (a scheme that involves Barry Bostwick and Lou Diamond Phillips). With Travis in college, the show also adds LaMarcus Tinker as his mumbly roommate and Collette Wolfe as his new girlfriend, who bring a little youthful vigor to the formula (of the adult cast, only the effervescent Busy Philipps clocks in under 40).', 'If', 'Cougar Town', \"isn't as loopy as creator Bill Lawrence's\", 'Scrubs', ', there are still plenty of offbeat bits, like the way characters slip into Japanese or the references to', 'Freaks', 'and', 'The Usual Suspects', '(a few', 'Scrubs', 'vets also put in appearances). Not everything works--the crew can be pretty mean to awkward neighbor Tom (Robert Clendenin)--but at least there\\'s some real creativity at play. And just as Lisa Kudrow showed up the year before, Jennifer Aniston guests this time around, while extras include a featurette, deleted scenes, and \"Andy\\'s Dreams,\" a web series in which Mr. Torres imagines he\\'s a teacher, a private eye, and a \"Cuban Fred Astaire.\"', '--Kathleen C. Fennessy']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Busy Philipps, Courtney Cox, Dan Byrd', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.45 x 0.55 inches; 4.8 Ounces', 'Media Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '7 hours and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Courtney Cox, Dan Byrd, Busy Philipps', 'Subtitles': 'French, Portuguese, Spanish', 'Studio': 'ABC Studios', 'Number of discs': '3'}\nReview Text: Some might argue that the review should be for the show - in this case it is not.  It is for the product, DVDs of Season 2 of Cougar Town.  My first shipment arrived and disk 1 and 2 were unreadable by 3 computer and 2 commercial dvd players.  Disks were just plain bad, and not qc'd.  So, I went through the return/replace process, which is very streamlined, especially for getting replacement products.  So -- I received the SECOND shipment, and first off I notice the same hazy-looking marks around the outside of the disks.  So far, the first two disks are also corrupt, although they were at least _recognized_ as DVD disks, unlike the first shipment's.  The failures come when, yes, trying to play them.  Hangs, stutters, freezes.  Happens in all drives.  And yes, I checked my hardware with a few of my several hundred DVDs.  So --- two shipments and each had corrupt, unreadable disks.  Not pleased here. Still pondering weather I'll try for a third replacement, or just get a refund.<br /><br />******** Addendum, some years later (yipes - how time flies)<br />I saw that 7 of 12 people rated my review as \"Unhelpful\".  That's unfortunate.  I was just trying to convey my experience when I made this purchase - and I do believe that the quality of the medium, in this case DVDs, is a valid and pertinent subject for review.  Apologies to those that for some reason felt that my relating of a bad (two times) experience with a purchase was somehow \"unhelpful\".<br /><br />So - I figure I should mention that the SHOW - Cougar Town, is F***ING AWESOME.  I _LOVE_ the show.. Courtney, Christa, Busy, Brian, Ian -- an amazing cast that feels like a real family... Bill Lawrence is by far my favorite showmaker/writer/creator/producer, etc...  Scrubs?  Best show ever... until Cougar Town anyway.  FIVE STARS FOR COUGAR TOWN, TEN if they'd let me.\nReview Title: Great show --- but the disks (first run?) are bad.  Two shipments with defective disks!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/16\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Bridge', \"Paul O'Connor\", 'Peter Chinn', 'Louise Say', 'Lorne Townend', 'Shaun Trevisick', 'Kate Dart', 'George Harris', 'Alex Hearle', 'Adam Warner'], 'Starring': ['Michio Kaku', 'Phil Plait', 'Michelle Thaller'], 'Studio': ['Science']}\nReview Text: Classic BAIT-AND-SWITCH  -  Mike Rowe's voice has been replaced by another, lesser voice...<br /><br />No offense to the other narrator - but Mike Rowe has a unique ability, which - coupled with the production of these epsiodes, including the soundtrack music - raises the bar substantially.  I assure you - I've done the homework.<br />People are complaining about this on the iTunes website right now.  A lowdown trick most likely devised by a Jr. Exec at Sci<br /><br />I have purchased these, and verified - it is DEFINITELY NOT MIKE ROWE'S VOICE - and I have a couple of them on a DVR recorded from Science channel this month.  On those broadcast versions - it IS Mike Rowe.  The difference is enormous.<br />I am seriously considering demanding a refund.  This is NOT what I paid for.  Mike's narratives of science, and especially cosmology, is as musical as the soundtrack - filled with an emotion and wonderment that makes the whole production far more compelling.  I simply would NEVER have purchased these had I known that Science Channel had replaced Mike Rowe's voice - NO DOUBT due to not wanting to share the $ with Mike and his representation.  And frankly - THAT STINKS.  To me - it's NO DIFFERENT than if I bought a car in which the dealer replaced the deluxe, hi-power, hi-efficiency 8-cylinder engine with a basic stripped down six-cylinder -- WITHOUT TELLING ME.  And that would be illegal.<br /><br />THIS SHOULD BE ILLEGAL TOO.  It is simply not what I paid for.\nReview Title: Classic BAIT-AND-SWITCH  -  Mike Rowe's voice on cable broadcast, but NOT ON THESE VERSIONS.. should be illegal...\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Complete Beatrix Potter Collection, Vol. 1 [DVD]\nReview Date: 2015/02/23\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Quick Shipping !!! New And Sealed !!! This Disc WILL NOT play on standard US DVD player. A multi-region PAL/NTSC DVD player is request to view it in USA/Canada. Please Review Description.']\nAverage Rating: 4.5\nProduct Details: {'Format': 'Color, DVD, NTSC', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'Color, DVD, NTSC', 'Run time': '2 hours and 11 minutes', 'Release date': 'February 24, 2004', 'Studio': 'Good Times Video', 'Number of discs': '1'}\nReview Text: This review applies to both volume 1 and volume 2 - all nine stories.  Few children will fail to enjoy these charming stories.  The expertly done animation brings the original Beatrix Potter illustrations to life. Truly it's almost as though she'd somehow done the animation herself.  This BBC production team has worked magic here.  Each of the nine stories is framed with beautifully done live-acted, dramatic scenes, depicting Miss Potter at her home and in the countryside surrounding her farmhouse in the Lake District (I'm quite sure it was filmed at the location, but not certain).  Her warmth and very spirited demeanor are readily conveyed by  the actress's relaxed and natural performance; the period decor and the furnishings, along with the early 20th century Lake District countryside settings, seem just to \"take one there\" - all of it, as convincing as the BBC always seems to be at \"period England\": you are _there_.<br /><br />These scenes are extremely effective, as \"bookends\" to the animated stories, at \"guiding the viewer\" in to the world and mind of Beatrix Potter.  As the various stories' origins are dramatically depicted, with Miss Potter writing the stories in the form of letters to various children in her life; as she prepares, and occasionally mid-story, she talks aloud about precipitating events and the various characters within.  As the stories unfold, it is her voice, as Beatrix, doing the narratives, no doubt as written.  And of course each of the stories within the letters' pages include various of her brilliant illustrations (which are, again, clearly the templates for the animated characters on the DVD).<br /><br />The animated stories themselves - I've already described how true to the original books' artwork the animation is.  Add to that what is perhaps the most compelling aspect of this collection, the voice-over actors' performances.  I certainly recognize the names, and have been told it's a veritable \"who's-who\" of British acting, but regardless - they do it very well.  It's hard to point one out that stands apart from the rest - each is extremely well done..  Of course, many folks will recognize the voice of Dr. House - that is Hugh Laurie - as the friendly and gregarious \"Johnny Town-mouse\";  so expressive and present (and no cutting remark or blatant put-downs, though I was almost expecting it ;-)  Mr. Laurie was in professional form that day.  ;-)<br /><br />Before I wrap up, I've got to mention the soundtrack.  The accompanying music is phenomenal, simply ... yeah, phenomenal.  It is never too loud or overbearing as it sets the mood for each scene, each moment.  It is, in fact, almost soothing; relaxing.  That's not to say that it's lacking energy or \"sleepy\" - in fact it is vibrant and filled with energy; only it is a calm and assertive energy (to shamelessly borrow a phrase from Caesar, the Dog Whisperer ;-).  It seems to fit the story content perfectly, while producing a sort-of relaxed, enamored or captivated feeling - the kids will enjoy this greatly, and will not likely keep bouncing off the walls (if that's what they were doing - just a guess) but rather will likely settle down and really enjoy each of these stories.  At the same time, that relaxed feel will likely have the adults sitting down to enjoy them with the kids.<br /><br />The marriage of this collection's incredible animation and overall production quality with such professionally voice-acted performances has resulted in a true children's classic (of a classic).  This collection, these videos, is the \"one of these.. not like the other ones\"...  And that's a really GOOD thing, actually.\nReview Title: Exceptional production.  True-to-original in both look and feel.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/09/09\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Peter Atencio'], 'Producers': ['Dave Callaham (Executive Producer)', 'David W. Zucker (Executive Producer)', 'Clayton Krueger (Co-Executive Producer)', 'Peter Atencio (Executive Producer)', 'Ridley Scott (Executive Producer)', 'Jean-Claude Van Damme (Executive Producer)', 'Diane Sabatini (Producer)'], 'Starring': ['Moises Arias', 'Jean-Claude Van Damme', 'Kat Foster']}\nReview Text: This kills..<br /><br />Love it.  WANT MORE OF IT.  lmao.  Very clever.  Excellent production quality.  Self-effacing to the perfect degree, and - it's got heart.  Love it.\nReview Title: This surpasses all that JCVD has ever done.  Superb.  Gotta have more of this one!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/10/23\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Violence', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Douglass Traver'], 'Producers': ['Britney Ray'], 'Starring': ['Alexander Knulls']}\nReview Text: Very interesting collection of scientific and archaeological studies, many unresolved or with controversial findings, unanswered questions, etc..  The unmistakable and evocative voice of John Rhys Davies sets the mood - literally, the tone - of each segment, and raises the level of interest and wonder considerably (for me anyway).<br /><br />It almost seems that the individual segments were intended to air as a series comprised of five or six \"episodes\"; regardless, these were ultimately edited in to a single presentation, with only the briefest pause or segue from one to the next.<br /><br />The subtitles:  From what I can tell, the subtitles rely upon a very poor implementation of voice-recognition software - such that the spoken words \"flightless bird\" become \"ficus bird\" in the subtitles, etc...  It is hilariously bad.  I'm pretty sure these are a product of the streaming system and not a part of the original production.<br /><br />Worthwhile show\nReview Title: Interesting collection of archaeological and scientific studies and controversies\nRating: 5.0\n--------------------------------------------------",
  "reference": "East Side Kids: 10 Bowery Classics\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.4 Pounds', 'Media Format': 'NTSC', 'Release date': 'April 12, 2005', 'Studio': 'Alpha Video'}\nThis is a great DVD, and higher quality than most of the others.<br /><br />A thoughtful reviewer added the following but mistakenly added it as a comment on the first review (thus it doesn't show up for others to see unless they look at comments on the first review ;)  This way, all who look at reviews will see it:<br /><br />\"Packaged in a hardbound, cloth-covered case, this set includes the DVDs 'Neath Brooklyn Bridge (1941), Bowery Blitzkrieg (1941), Boys Of The City (1940), Clancy Street Boys (1943), Kid Dynamite (1943), Million Dollar Kid (1944), Mr. Wise Guy (1942), Smart Aleck (1942), Spooks Run Wild (1940) and That Gang Of Mine (1942).\"<br /><br />Cheers.\nTitles (from comment upon first review) in this collection\nScrubs: The Complete Ninth and Final Season\nZach Braff  (Actor),     Donald Faison  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['See how the story ends for J.D., Elliot, Turk and the rest of your favorite characters in ABC’s Scrubs: The Complete Ninth And Final Season. The heroes of Sacred Heart may have finished their rounds, but the laughs never stop as they mentor a brand new class of med students!J.D. returns to teach at Sacred Heart’s medical school with the old gang and is surprised to find an impressionable young student has picked up where he left off. Meet Lucy and her classmates, Drew and Cole, as they try to fit in while they do their best to stand out.Relive every clever and quirky moment of Scrubs’ outrageous final season, complete with never-before-seen bloopers, deleted scenes and interviews with the show’s cast. Complete your Scrubs collection with the Ninth And Final Season on DVD. It’s the best house call you’ll ever get!']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '13505', 'Media Format': 'Multiple Formats, AC-3, Color, Closed-captioned, Dolby, Full Screen, Subtitled, NTSC', 'Run time': '6 hours and 30 minutes', 'Release date': 'September 28, 2010', 'Actors': 'Zach Braff, Donald Faison, Sarah Chalke, Judy Reyes, John C. McGinley', 'Subtitles': 'Spanish, French', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'ABC Studios', 'Number of discs': '2'}\nRather, this should have been Season 1 of \"Scrubs: Med School\" as far as I am concerned.  And, as I recall, the show was billed as \"Scrubs: Medical School\" when it aired.  Season 8 of Scrubs was clearly the final season - with JD's two-part \"goodbye\" episode (which was really sad for me, in all honesty) being the real Series Finale of the final season of Scrubs.  I admit that this spinoff (yes - let's be honest, that's what it was - with some cast members from the original, just like any spinoff) didn't quite do it for me the way the original show did - but it was the first season, and I think it deserved more of a chance (like more episodes, and a chance at a second season, etc..).  I know I was disappointed when they axed it, regardless of it's \"holding up\" to the original.<br /><br />ANYONE WHO WAS A TRUE FAN OF THE ORIGINAL WILL FIND PLENTY TO ENJOY FROM THIS SHOW.  re-hashed plots?  Recurring themes?  Blah blah blah...  Every sitcom over the past few decades are using much of \"the same old\" story-lines, themes, plot mechanisms.  The half-hour sitcom \"Grand Story\" has never been done better than Bill Lawrence and crew do it. I just shake my head at some of the whining, complaining folks.  YOU try doing a great, consistently funny, and actually often-meaningful show.  Then, try doing like a COUPLE DOZEN of them, EVERY YEAR, for NEARLY A DECADE.  (Head shaking some more).  Sheesh.  These are the brilliant storytellers of our time, imho.  Yes, of a genre, to be sure; but - stuff's just brilliant.  Season One, Two, Three - these may always be my favorites, but.. I love all of 'em, pretty much.<br /><br />If you own Scrubs 1 through 8, it'd be a mistake not sporting the mere 17-ish bucks for this, to complete your Scrubs collection.  (Yes, I said it was a spinoff.  It's also the final piece of the Scrubs legacy, and Ken Jenkins and John C. alone make it more-than worth it).\n\"Scrubs\" or \"Scrubs: Medical School\"?  If you REALLY like Scrubs, you'll like this - regardless\nCougar Town: Season 2\nCourtney Cox  (Actor),     Dan Byrd  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Amazon.com', 'After a successful first season,', 'Cougar Town', \"could've rested on its laurels. Instead, a few changes are in store for the cul-de-sac crew, starting with Travis's departure for college, a development that leaves Jules (Courteney Cox) with a bad case of Empty Nest Syndrome--even though he only moves 20 minutes away (Dan Byrd remains a regular cast member). Formerly single, she's also now seeing Grayson (Josh Hopkins), which helps to explain the ever-changing title card: a series of riffs on the term\", 'cougar', '.', 'That said, things remain much the same for Andy (Ian Gomez) and Ellie (Christa Miller), though Bobby (Brian Van Holt) makes more of an effort to get his life in order, culminating in a patent for Penny Can (a scheme that involves Barry Bostwick and Lou Diamond Phillips). With Travis in college, the show also adds LaMarcus Tinker as his mumbly roommate and Collette Wolfe as his new girlfriend, who bring a little youthful vigor to the formula (of the adult cast, only the effervescent Busy Philipps clocks in under 40).', 'If', 'Cougar Town', \"isn't as loopy as creator Bill Lawrence's\", 'Scrubs', ', there are still plenty of offbeat bits, like the way characters slip into Japanese or the references to', 'Freaks', 'and', 'The Usual Suspects', '(a few', 'Scrubs', 'vets also put in appearances). Not everything works--the crew can be pretty mean to awkward neighbor Tom (Robert Clendenin)--but at least there\\'s some real creativity at play. And just as Lisa Kudrow showed up the year before, Jennifer Aniston guests this time around, while extras include a featurette, deleted scenes, and \"Andy\\'s Dreams,\" a web series in which Mr. Torres imagines he\\'s a teacher, a private eye, and a \"Cuban Fred Astaire.\"', '--Kathleen C. Fennessy']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Busy Philipps, Courtney Cox, Dan Byrd', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.45 x 0.55 inches; 4.8 Ounces', 'Media Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '7 hours and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Courtney Cox, Dan Byrd, Busy Philipps', 'Subtitles': 'French, Portuguese, Spanish', 'Studio': 'ABC Studios', 'Number of discs': '3'}\nSome might argue that the review should be for the show - in this case it is not.  It is for the product, DVDs of Season 2 of Cougar Town.  My first shipment arrived and disk 1 and 2 were unreadable by 3 computer and 2 commercial dvd players.  Disks were just plain bad, and not qc'd.  So, I went through the return/replace process, which is very streamlined, especially for getting replacement products.  So -- I received the SECOND shipment, and first off I notice the same hazy-looking marks around the outside of the disks.  So far, the first two disks are also corrupt, although they were at least _recognized_ as DVD disks, unlike the first shipment's.  The failures come when, yes, trying to play them.  Hangs, stutters, freezes.  Happens in all drives.  And yes, I checked my hardware with a few of my several hundred DVDs.  So --- two shipments and each had corrupt, unreadable disks.  Not pleased here. Still pondering weather I'll try for a third replacement, or just get a refund.<br /><br />******** Addendum, some years later (yipes - how time flies)<br />I saw that 7 of 12 people rated my review as \"Unhelpful\".  That's unfortunate.  I was just trying to convey my experience when I made this purchase - and I do believe that the quality of the medium, in this case DVDs, is a valid and pertinent subject for review.  Apologies to those that for some reason felt that my relating of a bad (two times) experience with a purchase was somehow \"unhelpful\".<br /><br />So - I figure I should mention that the SHOW - Cougar Town, is F***ING AWESOME.  I _LOVE_ the show.. Courtney, Christa, Busy, Brian, Ian -- an amazing cast that feels like a real family... Bill Lawrence is by far my favorite showmaker/writer/creator/producer, etc...  Scrubs?  Best show ever... until Cougar Town anyway.  FIVE STARS FOR COUGAR TOWN, TEN if they'd let me.\nGreat show --- but the disks (first run?) are bad.  Two shipments with defective disks!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Bridge', \"Paul O'Connor\", 'Peter Chinn', 'Louise Say', 'Lorne Townend', 'Shaun Trevisick', 'Kate Dart', 'George Harris', 'Alex Hearle', 'Adam Warner'], 'Starring': ['Michio Kaku', 'Phil Plait', 'Michelle Thaller'], 'Studio': ['Science']}\nClassic BAIT-AND-SWITCH  -  Mike Rowe's voice has been replaced by another, lesser voice...<br /><br />No offense to the other narrator - but Mike Rowe has a unique ability, which - coupled with the production of these epsiodes, including the soundtrack music - raises the bar substantially.  I assure you - I've done the homework.<br />People are complaining about this on the iTunes website right now.  A lowdown trick most likely devised by a Jr. Exec at Sci<br /><br />I have purchased these, and verified - it is DEFINITELY NOT MIKE ROWE'S VOICE - and I have a couple of them on a DVR recorded from Science channel this month.  On those broadcast versions - it IS Mike Rowe.  The difference is enormous.<br />I am seriously considering demanding a refund.  This is NOT what I paid for.  Mike's narratives of science, and especially cosmology, is as musical as the soundtrack - filled with an emotion and wonderment that makes the whole production far more compelling.  I simply would NEVER have purchased these had I known that Science Channel had replaced Mike Rowe's voice - NO DOUBT due to not wanting to share the $ with Mike and his representation.  And frankly - THAT STINKS.  To me - it's NO DIFFERENT than if I bought a car in which the dealer replaced the deluxe, hi-power, hi-efficiency 8-cylinder engine with a basic stripped down six-cylinder -- WITHOUT TELLING ME.  And that would be illegal.<br /><br />THIS SHOULD BE ILLEGAL TOO.  It is simply not what I paid for.\nClassic BAIT-AND-SWITCH  -  Mike Rowe's voice on cable broadcast, but NOT ON THESE VERSIONS.. should be illegal...\nThe Complete Beatrix Potter Collection, Vol. 1 [DVD]\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Quick Shipping !!! New And Sealed !!! This Disc WILL NOT play on standard US DVD player. A multi-region PAL/NTSC DVD player is request to view it in USA/Canada. Please Review Description.']\n{'Format': 'Color, DVD, NTSC', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'Color, DVD, NTSC', 'Run time': '2 hours and 11 minutes', 'Release date': 'February 24, 2004', 'Studio': 'Good Times Video', 'Number of discs': '1'}\nThis review applies to both volume 1 and volume 2 - all nine stories.  Few children will fail to enjoy these charming stories.  The expertly done animation brings the original Beatrix Potter illustrations to life. Truly it's almost as though she'd somehow done the animation herself.  This BBC production team has worked magic here.  Each of the nine stories is framed with beautifully done live-acted, dramatic scenes, depicting Miss Potter at her home and in the countryside surrounding her farmhouse in the Lake District (I'm quite sure it was filmed at the location, but not certain).  Her warmth and very spirited demeanor are readily conveyed by  the actress's relaxed and natural performance; the period decor and the furnishings, along with the early 20th century Lake District countryside settings, seem just to \"take one there\" - all of it, as convincing as the BBC always seems to be at \"period England\": you are _there_.<br /><br />These scenes are extremely effective, as \"bookends\" to the animated stories, at \"guiding the viewer\" in to the world and mind of Beatrix Potter.  As the various stories' origins are dramatically depicted, with Miss Potter writing the stories in the form of letters to various children in her life; as she prepares, and occasionally mid-story, she talks aloud about precipitating events and the various characters within.  As the stories unfold, it is her voice, as Beatrix, doing the narratives, no doubt as written.  And of course each of the stories within the letters' pages include various of her brilliant illustrations (which are, again, clearly the templates for the animated characters on the DVD).<br /><br />The animated stories themselves - I've already described how true to the original books' artwork the animation is.  Add to that what is perhaps the most compelling aspect of this collection, the voice-over actors' performances.  I certainly recognize the names, and have been told it's a veritable \"who's-who\" of British acting, but regardless - they do it very well.  It's hard to point one out that stands apart from the rest - each is extremely well done..  Of course, many folks will recognize the voice of Dr. House - that is Hugh Laurie - as the friendly and gregarious \"Johnny Town-mouse\";  so expressive and present (and no cutting remark or blatant put-downs, though I was almost expecting it ;-)  Mr. Laurie was in professional form that day.  ;-)<br /><br />Before I wrap up, I've got to mention the soundtrack.  The accompanying music is phenomenal, simply ... yeah, phenomenal.  It is never too loud or overbearing as it sets the mood for each scene, each moment.  It is, in fact, almost soothing; relaxing.  That's not to say that it's lacking energy or \"sleepy\" - in fact it is vibrant and filled with energy; only it is a calm and assertive energy (to shamelessly borrow a phrase from Caesar, the Dog Whisperer ;-).  It seems to fit the story content perfectly, while producing a sort-of relaxed, enamored or captivated feeling - the kids will enjoy this greatly, and will not likely keep bouncing off the walls (if that's what they were doing - just a guess) but rather will likely settle down and really enjoy each of these stories.  At the same time, that relaxed feel will likely have the adults sitting down to enjoy them with the kids.<br /><br />The marriage of this collection's incredible animation and overall production quality with such professionally voice-acted performances has resulted in a true children's classic (of a classic).  This collection, these videos, is the \"one of these.. not like the other ones\"...  And that's a really GOOD thing, actually.\nExceptional production.  True-to-original in both look and feel.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Peter Atencio'], 'Producers': ['Dave Callaham (Executive Producer)', 'David W. Zucker (Executive Producer)', 'Clayton Krueger (Co-Executive Producer)', 'Peter Atencio (Executive Producer)', 'Ridley Scott (Executive Producer)', 'Jean-Claude Van Damme (Executive Producer)', 'Diane Sabatini (Producer)'], 'Starring': ['Moises Arias', 'Jean-Claude Van Damme', 'Kat Foster']}\nThis kills..<br /><br />Love it.  WANT MORE OF IT.  lmao.  Very clever.  Excellent production quality.  Self-effacing to the perfect degree, and - it's got heart.  Love it.\nThis surpasses all that JCVD has ever done.  Superb.  Gotta have more of this one!\n{'Content advisory': ['Violence', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Douglass Traver'], 'Producers': ['Britney Ray'], 'Starring': ['Alexander Knulls']}\nVery interesting collection of scientific and archaeological studies, many unresolved or with controversial findings, unanswered questions, etc..  The unmistakable and evocative voice of John Rhys Davies sets the mood - literally, the tone - of each segment, and raises the level of interest and wonder considerably (for me anyway).<br /><br />It almost seems that the individual segments were intended to air as a series comprised of five or six \"episodes\"; regardless, these were ultimately edited in to a single presentation, with only the briefest pause or segue from one to the next.<br /><br />The subtitles:  From what I can tell, the subtitles rely upon a very poor implementation of voice-recognition software - such that the spoken words \"flightless bird\" become \"ficus bird\" in the subtitles, etc...  It is hilariously bad.  I'm pretty sure these are a product of the streaming system and not a part of the original production.<br /><br />Worthwhile show\nInteresting collection of archaeological and scientific studies and controversies",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: East Side Kids: 10 Bowery Classics\nReview Date: 2008/05/05\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nAverage Rating: 4.1\nProduct Details: {'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.4 Pounds', 'Media Format': 'NTSC', 'Release date': 'April 12, 2005', 'Studio': 'Alpha Video'}\nReview Text: This is a great DVD, and higher quality than most of the others.<br /><br />A thoughtful reviewer added the following but mistakenly added it as a comment on the first review (thus it doesn't show up for others to see unless they look at comments on the first review ;)  This way, all who look at reviews will see it:<br /><br />\"Packaged in a hardbound, cloth-covered case, this set includes the DVDs 'Neath Brooklyn Bridge (1941), Bowery Blitzkrieg (1941), Boys Of The City (1940), Clancy Street Boys (1943), Kid Dynamite (1943), Million Dollar Kid (1944), Mr. Wise Guy (1942), Smart Aleck (1942), Spooks Run Wild (1940) and That Gang Of Mine (1942).\"<br /><br />Cheers.\nReview Title: Titles (from comment upon first review) in this collection\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scrubs: The Complete Ninth and Final Season\nReview Date: 2011/08/09\nStore: Zach Braff  (Actor),     Donald Faison  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['See how the story ends for J.D., Elliot, Turk and the rest of your favorite characters in ABC’s Scrubs: The Complete Ninth And Final Season. The heroes of Sacred Heart may have finished their rounds, but the laughs never stop as they mentor a brand new class of med students!J.D. returns to teach at Sacred Heart’s medical school with the old gang and is surprised to find an impressionable young student has picked up where he left off. Meet Lucy and her classmates, Drew and Cole, as they try to fit in while they do their best to stand out.Relive every clever and quirky moment of Scrubs’ outrageous final season, complete with never-before-seen bloopers, deleted scenes and interviews with the show’s cast. Complete your Scrubs collection with the Ninth And Final Season on DVD. It’s the best house call you’ll ever get!']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '13505', 'Media Format': 'Multiple Formats, AC-3, Color, Closed-captioned, Dolby, Full Screen, Subtitled, NTSC', 'Run time': '6 hours and 30 minutes', 'Release date': 'September 28, 2010', 'Actors': 'Zach Braff, Donald Faison, Sarah Chalke, Judy Reyes, John C. McGinley', 'Subtitles': 'Spanish, French', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'ABC Studios', 'Number of discs': '2'}\nReview Text: Rather, this should have been Season 1 of \"Scrubs: Med School\" as far as I am concerned.  And, as I recall, the show was billed as \"Scrubs: Medical School\" when it aired.  Season 8 of Scrubs was clearly the final season - with JD's two-part \"goodbye\" episode (which was really sad for me, in all honesty) being the real Series Finale of the final season of Scrubs.  I admit that this spinoff (yes - let's be honest, that's what it was - with some cast members from the original, just like any spinoff) didn't quite do it for me the way the original show did - but it was the first season, and I think it deserved more of a chance (like more episodes, and a chance at a second season, etc..).  I know I was disappointed when they axed it, regardless of it's \"holding up\" to the original.<br /><br />ANYONE WHO WAS A TRUE FAN OF THE ORIGINAL WILL FIND PLENTY TO ENJOY FROM THIS SHOW.  re-hashed plots?  Recurring themes?  Blah blah blah...  Every sitcom over the past few decades are using much of \"the same old\" story-lines, themes, plot mechanisms.  The half-hour sitcom \"Grand Story\" has never been done better than Bill Lawrence and crew do it. I just shake my head at some of the whining, complaining folks.  YOU try doing a great, consistently funny, and actually often-meaningful show.  Then, try doing like a COUPLE DOZEN of them, EVERY YEAR, for NEARLY A DECADE.  (Head shaking some more).  Sheesh.  These are the brilliant storytellers of our time, imho.  Yes, of a genre, to be sure; but - stuff's just brilliant.  Season One, Two, Three - these may always be my favorites, but.. I love all of 'em, pretty much.<br /><br />If you own Scrubs 1 through 8, it'd be a mistake not sporting the mere 17-ish bucks for this, to complete your Scrubs collection.  (Yes, I said it was a spinoff.  It's also the final piece of the Scrubs legacy, and Ken Jenkins and John C. alone make it more-than worth it).\nReview Title: \"Scrubs\" or \"Scrubs: Medical School\"?  If you REALLY like Scrubs, you'll like this - regardless\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cougar Town: Season 2\nReview Date: 2011/09/01\nStore: Courtney Cox  (Actor),     Dan Byrd  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: ['Amazon.com', 'After a successful first season,', 'Cougar Town', \"could've rested on its laurels. Instead, a few changes are in store for the cul-de-sac crew, starting with Travis's departure for college, a development that leaves Jules (Courteney Cox) with a bad case of Empty Nest Syndrome--even though he only moves 20 minutes away (Dan Byrd remains a regular cast member). Formerly single, she's also now seeing Grayson (Josh Hopkins), which helps to explain the ever-changing title card: a series of riffs on the term\", 'cougar', '.', 'That said, things remain much the same for Andy (Ian Gomez) and Ellie (Christa Miller), though Bobby (Brian Van Holt) makes more of an effort to get his life in order, culminating in a patent for Penny Can (a scheme that involves Barry Bostwick and Lou Diamond Phillips). With Travis in college, the show also adds LaMarcus Tinker as his mumbly roommate and Collette Wolfe as his new girlfriend, who bring a little youthful vigor to the formula (of the adult cast, only the effervescent Busy Philipps clocks in under 40).', 'If', 'Cougar Town', \"isn't as loopy as creator Bill Lawrence's\", 'Scrubs', ', there are still plenty of offbeat bits, like the way characters slip into Japanese or the references to', 'Freaks', 'and', 'The Usual Suspects', '(a few', 'Scrubs', 'vets also put in appearances). Not everything works--the crew can be pretty mean to awkward neighbor Tom (Robert Clendenin)--but at least there\\'s some real creativity at play. And just as Lisa Kudrow showed up the year before, Jennifer Aniston guests this time around, while extras include a featurette, deleted scenes, and \"Andy\\'s Dreams,\" a web series in which Mr. Torres imagines he\\'s a teacher, a private eye, and a \"Cuban Fred Astaire.\"', '--Kathleen C. Fennessy']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Busy Philipps, Courtney Cox, Dan Byrd', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.45 x 0.55 inches; 4.8 Ounces', 'Media Format': 'Multiple Formats, Box set, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '7 hours and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Courtney Cox, Dan Byrd, Busy Philipps', 'Subtitles': 'French, Portuguese, Spanish', 'Studio': 'ABC Studios', 'Number of discs': '3'}\nReview Text: Some might argue that the review should be for the show - in this case it is not.  It is for the product, DVDs of Season 2 of Cougar Town.  My first shipment arrived and disk 1 and 2 were unreadable by 3 computer and 2 commercial dvd players.  Disks were just plain bad, and not qc'd.  So, I went through the return/replace process, which is very streamlined, especially for getting replacement products.  So -- I received the SECOND shipment, and first off I notice the same hazy-looking marks around the outside of the disks.  So far, the first two disks are also corrupt, although they were at least _recognized_ as DVD disks, unlike the first shipment's.  The failures come when, yes, trying to play them.  Hangs, stutters, freezes.  Happens in all drives.  And yes, I checked my hardware with a few of my several hundred DVDs.  So --- two shipments and each had corrupt, unreadable disks.  Not pleased here. Still pondering weather I'll try for a third replacement, or just get a refund.<br /><br />******** Addendum, some years later (yipes - how time flies)<br />I saw that 7 of 12 people rated my review as \"Unhelpful\".  That's unfortunate.  I was just trying to convey my experience when I made this purchase - and I do believe that the quality of the medium, in this case DVDs, is a valid and pertinent subject for review.  Apologies to those that for some reason felt that my relating of a bad (two times) experience with a purchase was somehow \"unhelpful\".<br /><br />So - I figure I should mention that the SHOW - Cougar Town, is F***ING AWESOME.  I _LOVE_ the show.. Courtney, Christa, Busy, Brian, Ian -- an amazing cast that feels like a real family... Bill Lawrence is by far my favorite showmaker/writer/creator/producer, etc...  Scrubs?  Best show ever... until Cougar Town anyway.  FIVE STARS FOR COUGAR TOWN, TEN if they'd let me.\nReview Title: Great show --- but the disks (first run?) are bad.  Two shipments with defective disks!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/16\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Bridge', \"Paul O'Connor\", 'Peter Chinn', 'Louise Say', 'Lorne Townend', 'Shaun Trevisick', 'Kate Dart', 'George Harris', 'Alex Hearle', 'Adam Warner'], 'Starring': ['Michio Kaku', 'Phil Plait', 'Michelle Thaller'], 'Studio': ['Science']}\nReview Text: Classic BAIT-AND-SWITCH  -  Mike Rowe's voice has been replaced by another, lesser voice...<br /><br />No offense to the other narrator - but Mike Rowe has a unique ability, which - coupled with the production of these epsiodes, including the soundtrack music - raises the bar substantially.  I assure you - I've done the homework.<br />People are complaining about this on the iTunes website right now.  A lowdown trick most likely devised by a Jr. Exec at Sci<br /><br />I have purchased these, and verified - it is DEFINITELY NOT MIKE ROWE'S VOICE - and I have a couple of them on a DVR recorded from Science channel this month.  On those broadcast versions - it IS Mike Rowe.  The difference is enormous.<br />I am seriously considering demanding a refund.  This is NOT what I paid for.  Mike's narratives of science, and especially cosmology, is as musical as the soundtrack - filled with an emotion and wonderment that makes the whole production far more compelling.  I simply would NEVER have purchased these had I known that Science Channel had replaced Mike Rowe's voice - NO DOUBT due to not wanting to share the $ with Mike and his representation.  And frankly - THAT STINKS.  To me - it's NO DIFFERENT than if I bought a car in which the dealer replaced the deluxe, hi-power, hi-efficiency 8-cylinder engine with a basic stripped down six-cylinder -- WITHOUT TELLING ME.  And that would be illegal.<br /><br />THIS SHOULD BE ILLEGAL TOO.  It is simply not what I paid for.\nReview Title: Classic BAIT-AND-SWITCH  -  Mike Rowe's voice on cable broadcast, but NOT ON THESE VERSIONS.. should be illegal...\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Complete Beatrix Potter Collection, Vol. 1 [DVD]\nReview Date: 2015/02/23\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Quick Shipping !!! New And Sealed !!! This Disc WILL NOT play on standard US DVD player. A multi-region PAL/NTSC DVD player is request to view it in USA/Canada. Please Review Description.']\nAverage Rating: 4.5\nProduct Details: {'Format': 'Color, DVD, NTSC', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'Color, DVD, NTSC', 'Run time': '2 hours and 11 minutes', 'Release date': 'February 24, 2004', 'Studio': 'Good Times Video', 'Number of discs': '1'}\nReview Text: This review applies to both volume 1 and volume 2 - all nine stories.  Few children will fail to enjoy these charming stories.  The expertly done animation brings the original Beatrix Potter illustrations to life. Truly it's almost as though she'd somehow done the animation herself.  This BBC production team has worked magic here.  Each of the nine stories is framed with beautifully done live-acted, dramatic scenes, depicting Miss Potter at her home and in the countryside surrounding her farmhouse in the Lake District (I'm quite sure it was filmed at the location, but not certain).  Her warmth and very spirited demeanor are readily conveyed by  the actress's relaxed and natural performance; the period decor and the furnishings, along with the early 20th century Lake District countryside settings, seem just to \"take one there\" - all of it, as convincing as the BBC always seems to be at \"period England\": you are _there_.<br /><br />These scenes are extremely effective, as \"bookends\" to the animated stories, at \"guiding the viewer\" in to the world and mind of Beatrix Potter.  As the various stories' origins are dramatically depicted, with Miss Potter writing the stories in the form of letters to various children in her life; as she prepares, and occasionally mid-story, she talks aloud about precipitating events and the various characters within.  As the stories unfold, it is her voice, as Beatrix, doing the narratives, no doubt as written.  And of course each of the stories within the letters' pages include various of her brilliant illustrations (which are, again, clearly the templates for the animated characters on the DVD).<br /><br />The animated stories themselves - I've already described how true to the original books' artwork the animation is.  Add to that what is perhaps the most compelling aspect of this collection, the voice-over actors' performances.  I certainly recognize the names, and have been told it's a veritable \"who's-who\" of British acting, but regardless - they do it very well.  It's hard to point one out that stands apart from the rest - each is extremely well done..  Of course, many folks will recognize the voice of Dr. House - that is Hugh Laurie - as the friendly and gregarious \"Johnny Town-mouse\";  so expressive and present (and no cutting remark or blatant put-downs, though I was almost expecting it ;-)  Mr. Laurie was in professional form that day.  ;-)<br /><br />Before I wrap up, I've got to mention the soundtrack.  The accompanying music is phenomenal, simply ... yeah, phenomenal.  It is never too loud or overbearing as it sets the mood for each scene, each moment.  It is, in fact, almost soothing; relaxing.  That's not to say that it's lacking energy or \"sleepy\" - in fact it is vibrant and filled with energy; only it is a calm and assertive energy (to shamelessly borrow a phrase from Caesar, the Dog Whisperer ;-).  It seems to fit the story content perfectly, while producing a sort-of relaxed, enamored or captivated feeling - the kids will enjoy this greatly, and will not likely keep bouncing off the walls (if that's what they were doing - just a guess) but rather will likely settle down and really enjoy each of these stories.  At the same time, that relaxed feel will likely have the adults sitting down to enjoy them with the kids.<br /><br />The marriage of this collection's incredible animation and overall production quality with such professionally voice-acted performances has resulted in a true children's classic (of a classic).  This collection, these videos, is the \"one of these.. not like the other ones\"...  And that's a really GOOD thing, actually.\nReview Title: Exceptional production.  True-to-original in both look and feel.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/09/09\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Peter Atencio'], 'Producers': ['Dave Callaham (Executive Producer)', 'David W. Zucker (Executive Producer)', 'Clayton Krueger (Co-Executive Producer)', 'Peter Atencio (Executive Producer)', 'Ridley Scott (Executive Producer)', 'Jean-Claude Van Damme (Executive Producer)', 'Diane Sabatini (Producer)'], 'Starring': ['Moises Arias', 'Jean-Claude Van Damme', 'Kat Foster']}\nReview Text: This kills..<br /><br />Love it.  WANT MORE OF IT.  lmao.  Very clever.  Excellent production quality.  Self-effacing to the perfect degree, and - it's got heart.  Love it.\nReview Title: This surpasses all that JCVD has ever done.  Superb.  Gotta have more of this one!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/10/23\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Violence', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Douglass Traver'], 'Producers': ['Britney Ray'], 'Starring': ['Alexander Knulls']}\nReview Text: Very interesting collection of scientific and archaeological studies, many unresolved or with controversial findings, unanswered questions, etc..  The unmistakable and evocative voice of John Rhys Davies sets the mood - literally, the tone - of each segment, and raises the level of interest and wonder considerably (for me anyway).<br /><br />It almost seems that the individual segments were intended to air as a series comprised of five or six \"episodes\"; regardless, these were ultimately edited in to a single presentation, with only the briefest pause or segue from one to the next.<br /><br />The subtitles:  From what I can tell, the subtitles rely upon a very poor implementation of voice-recognition software - such that the spoken words \"flightless bird\" become \"ficus bird\" in the subtitles, etc...  It is hilariously bad.  I'm pretty sure these are a product of the streaming system and not a part of the original production.<br /><br />Worthwhile show\nReview Title: Interesting collection of archaeological and scientific studies and controversies\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "**SUMMARY:**\nThis individual exhibits a strong preference for comedy genres, particularly sitcoms and classic family entertainment. They consistently rate products highly, often averaging over 4.5, suggesting a keen appreciation for quality storytelling and character development. Common themes in their purchases include a nostalgic affinity for iconic shows, as evidenced by their engagement with series like “Scrubs” and “Cougar Town,” highlighting a preference for character-driven narratives and humor.\n\nTheir reviews reveal a dual focus on content quality and production values. They express dissatisfaction with product quality when it fails to meet expectations, notably in instances of defective media. Their sentiments indicate moderate price sensitivity, suggesting that they are willing to invest in completing a collection if the perceived value is high. Furthermore, they display a solid appreciation for well-executed adaptations, particularly in children's programming, valuing fidelity to original artistic expressions.\n\nOverall, this person favors comedic content that combines strong narratives, memorable characters, and high production quality, while also being vigilant about product integrity. This trend signals a discerning consumer who prioritizes meaningful entertainment experiences and is likely to engage passionately with content that resonates emotionally and highlights clever storytelling.",
  "target_interaction": {
    "rating": 1.0,
    "title": "Ridiculous over-simplifications; questionable theoretical interpretation of historical events. Meh.",
    "text": "What I managed to stomach was full of highly debatable theory asserted as irrefutable truth; pseudo-science at it's worst.<br /><br />I especially recommend the review from John P. Jones III - an intelligent and quite fair assessment across all four episodes; also Charles Dawson's review gives a good sense of this absurdly simplistic presentation,<br /><br />Concluding that this was well-researched - with the highly opinionated, narrowly-focused  conclusions having _zero_ supporting evidence; coupled with lack of any basis or application of scientific method upon which to predicate them?  Put simply, there _was_ no proper research - it is all conjecture with a very clear end-goal.  Make a quite contrary assertion and then backpedal your way to a purely pseudo-science based (fetid) collection of misinformation as your premise.  Unquestioning acceptance is a disquieting indictment of our educational system.<br /><br />Logic, the scientific method, well-founded anthropological and archaeological discipline and procedure - these are completely missing from this production, and from a number of naively biased testimonials as well.  It makes one sad.... claiming conflict and war as the pillars supporting the evolution and growth toward modern culture, toward \"civilized\" society is a twisted, misguided and warped _misinterpretation_ of humanity's pivotal moments in time.  It goes well beyond over-simplified.",
    "images": [],
    "asin": "B07CLBJ97R",
    "parent_asin": "B07CLBJ97R",
    "user_id": "AEB2MZFZEQ4TVI4I2VZ4B2VTMMBQ",
    "timestamp": "2019-10-23 17:07:11.511000",
    "helpful_vote": 2,
    "verified_purchase": false,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.3,
    "rating_number": 92,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cc869b99d65e894eb1808f15550366768a495e9834bd5ce043bbaeb6871f2fd5._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cc869b99d65e894eb1808f15550366768a495e9834bd5ce043bbaeb6871f2fd5._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cc869b99d65e894eb1808f15550366768a495e9834bd5ce043bbaeb6871f2fd5._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cc869b99d65e894eb1808f15550366768a495e9834bd5ce043bbaeb6871f2fd5._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cc869b99d65e894eb1808f15550366768a495e9834bd5ce043bbaeb6871f2fd5._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cc869b99d65e894eb1808f15550366768a495e9834bd5ce043bbaeb6871f2fd5._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence"
      ],
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}