{
  "user_id": "AFA5B5IBMHM5XZKSSA5MP3PBEGPA",
  "summary": "=== Purchase Information ===\nProduct Title: Caillous Holiday Movie\nReview Date: 2015/03/22\nStore: Caillou  (Actor),     NCircle Entertainment  (Director)    Format: DVD\nCategories: Movies & TV, 3-6 Years\nProduct Description: [\"CAILLOU TM is an award-winning television series about an inquisitive four year old whose world is filled with learning, fun and imagination and inspires generations of pre-school children to grow emotionally as they explore the world around them. When winter comes to Caillou's house, this curious 4-year-old tackles all kinds of big boy activities like helping Daddy shovel snow, making holiday presents for his family and even discovering how other little boys and girls around the world celebrate the season! Filled with magical moments seen through a small child's eyes, this delightful story will enchant your entire family.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Caillou, NCircle Entertainment', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '100195', 'Director': 'NCircle Entertainment', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'November 11, 2014', 'Actors': 'Caillou', 'Subtitles': 'English', 'Studio': 'Ncircle', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great kids movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wild Kratts: Jungle Animals\nReview Date: 2015/03/22\nStore: n/a  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Anime\nProduct Description: ['Creature teachers Chris and Martin Kratt will take families along on extraordinary animal-powered adventures. The show transforms the Kratt Brothers into animated versions of themselves, allowing the real-life zoologists to visit wild animals in their little-seen habitats and showcase key science concepts.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'N/a', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26219763', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'January 2, 2012', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: great kids show\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou - Caillou's Train Trip & Other Adventures\nReview Date: 2015/03/22\nStore: Ellen David, Annie Bovaird  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: [\"Travel with Caillou on his very first train trip and airplane ride! There are more adventures in store for Caillou as he explores his very own neighborhood. From a trip to Grandma's house to the neighborhood rummage sale, a whole world waits fro Caillou to explore and discover. Every day with Caillou is a new day filled with adventure, fun and laughter! This DVD includes 2 full-length videos: Caillou the Explorer and Caillou at His Best.\"]\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.35 x 7.51 inches; 2.72 Ounces', 'Item model number': '705110', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Ellen David, Annie Bovaird', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: great kids show\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wild Kratts: Rainforest Rescue\nReview Date: 2015/04/08\nStore: .  (Actor, Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: ['Creature teachers Chris and Martin Kratt will take families along on extraordinary animal-powered adventures. The show transforms the Kratt Brothers into animated versions of themselves, allowing the real-life zoologists to visit wild animals in their little-seen habitats and showcase key science concepts. Episodes include: Rainforest Stew, and Shadow: The Black Jaguar.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '26519404', 'Media Format': 'NTSC, Color, Multiple Formats, Animated', 'Run time': '50 minutes', 'Release date': 'April 9, 2013', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: great educational dvd\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Free Willy: Escape from Pirate's Cove\nReview Date: 2015/04/08\nStore: Bindi Irwin  (Actor),     Beau Bridges  (Actor),     Will Geiger  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', \"Free Willy: Escape from Pirate's Cove (DVD)\", \"When eleven-year-old Kirra's widowed father is injured, she must leave Australia against her desires in order to live with her estranged grandfather at his run-down seaside theme park in South Africa. However, after a storm traps a baby orca in the park's lagoon, the park not only gets more visitors, but Kirra and the whale she names Willy develop an amazing friendship. Knowing that Willy will soon outgrow the lagoon and that her grandfather will be forced to sell the whale to his competitor, Kirra must not only locate Willy's pod, but also find a way to teach the young whale to survive and be free in the open sea.\", ']]>', 'Amazon.com', 'More a retelling of the original 1993', 'Free Willy', 'film than a third sequel in the series,', \"Free Willy: Escape from Pirate's Cove\", \"is the story of a young whale who's separated from his pod, used in a moneymaking scheme, and befriended by a young girl who ultimately makes a huge difference in the young whale's life. The film stars Bindi Irwin (daughter of the late Crocodile Hunter Steve Irwin and host of the TV nature documentary series\", 'Bindi the Jungle Girl', \") in her first film, and she is surprisingly believable and passionate in her role as Kirra, if not entirely polished. Beau Bridges plays Kirra's grandfather, Gus, a down-on-his-luck gambler and owner of a dilapidated amusement park who's obsessed with making money. When Kirra's father is injured, Gus is unexpectedly saddled with caring for his granddaughter over the summer. Bongo Mbutuma, Siyabulela Ramba, and Stephen Jennings round out the cast. When a young orca becomes trapped in the lagoon at Gus's ocean-side amusement park in South Africa, Kirra and her grandfather clash over the whale's future. Kirra quickly dubs the whale Willy and pleads with her grandfather to set him free, but Gus wants to use Willy to boost profits. When a mammal rescue group determines that Willy's underdeveloped echolocation makes him unfit to survive alone in the wild, Kirra bristles at their suggestion to put Willy down, and she vows to rehabilitate the orca. Meanwhile, Kirra's grandfather contemplates selling Willy to a neighboring park owner at a handsome profit, in hopes that he will have the necessary funds to properly house and care for Willy. More than just a story about right versus wrong,\", \"Free Willy: Escape from Pirate's Cove\", 'is an exploration of a much more complicated ethical dilemma in which the best course of action is unclear. As the characters each struggle to choose the right path, what becomes crystal clear is the power of perseverance and the personal growth that results from love, adversity, and challenge. While the CGI graphic scenes of the orca pods swimming are admittedly poor and some other aspects of this film could have been improved,', \"Escape from Pirate's Cove\", \"is still a good family film with a heartfelt message. Bonus features include a fairly interesting featurette about filming on location in South Africa, Bindi's first movie diary, a quick look at the film's animal costars, two deleted scenes, and one outtake. The Blu-ray also features a pop-up trivia option that runs the length of the film.\", '--Tami Horiuchi']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Kids & Family, Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Beau Bridges, Mike Falkow, Will Geiger, Bindi Irwin', 'Initial release date': '2010-03-23', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000099825DVD', 'Director': 'Will Geiger', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 42 minutes', 'Release date': 'March 23, 2010', 'Actors': 'Bindi Irwin, Beau Bridges, Mike Falkow', 'Subtitles': 'English, French, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: grand son liked\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wild Kratts: Bugging Out\nReview Date: 2015/04/08\nStore: .  (Actor)    Format: DVD\nCategories: Movies & TV, PBS, All\nProduct Description: ['Join the adventures of Martin and Chris as they meet up with cool creatures from around the world and witness many never-before-seen wildlife moments. With their creature smarts plus their newly invented Creature Power Suits, the brothers Kratt are using amazing animal abilities to rescue their animal friends when they get into trouble. Episodes include: Secrets of the Spiders Web; and Attack of the Tree Eating Aliens.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '55 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '28937277', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '55 minutes', 'Release date': 'February 25, 2014', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nReview Text: good educational dvd\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou's Winter Wonders\nReview Date: 2015/04/08\nStore: Caillou's Winter Wonders  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Join Caillou in four fun adventures! In Caillou The Snowman, Caillou explores all the fun activities of winter, including playing hockey and making paper snowflakes! In Caillous Christmas, Caillou learns about holiday traditions, from caroling to different cultural festivities in playschool. In Its Cold Outside, Caillou has fun playing in the snow, making snow angels and even tobogganing! In Winter!, Caillou discovers the joys of winter sports.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Feature', 'Format': 'NTSC, Color, Closed-captioned, Dubbed, Full Screen, Multiple Formats, Animated', 'Contributor': \"Caillou's Winter Wonders\", 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.34 x 7.46 inches; 2.72 Ounces', 'Media Format': 'NTSC, Color, Closed-captioned, Dubbed, Full Screen, Multiple Formats, Animated', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 23, 2008', 'Actors': \"Caillou's Winter Wonders\", 'Dubbed': 'Spanish', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: grandspn really like the movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nim's Island\nReview Date: 2015/04/08\nStore: Jodie Foster  (Actor),     Gerard Butler  (Actor),     Jennifer Flackett  (Director, Writer),     Mark Levin  (Director, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', \"Anything can happen on Nim's Island, a magical place ruled by a young girl's imagination. It is an existence that mirrors that of her favorite literary character, Alex Rover- the world's greatest adventurer. But Alexandra, the author of the Rover books, leads a reclusive life in the big city. When Nim's father goes missing from their island, a twist of fate brings her together with Alexandra. Now, they must draw courage from their fictional hero, Alex Rover, and find strength in one another to conquer Nim's Island.\", 'Amazon.com', \"Adventure doesn't always begin with pirates on the high seas or explorers deep in the desert; sometimes it starts with an idyllic life on a private island in the middle of the South Asiatic Sea. For 11-year old Nim (Abigail Breslin) and her father and microbiologist Jack Russo (Gerard Butler), life is perfect thanks to their love of nature, Jack's mechanical ingenuity, and regular deliveries via supply ship. Loneliness is never an issue for Nim because of her special friendships with Selkie the sea lion, Galileo the pelican, and Freddie the iguana and her education is intensive, if rather unique. Adventure and imagination are ways of life for Nim whether she's heading out to sea to help her father collect plankton specimens, playing soccer on the beach with Selkie, or delving into the latest Alex Rover adventure novel, but everything changes when Jack departs on the boat for a two-night expedition to collect plankton specimens and gets caught in an unexpected storm. Alone on the island, Nim begins to worry about her father's safety as well as her own and, through a chance email, connects with Alex Rover (Jodie Foster) whom she begs to come help find her father. Problem is, author Alexandra Rover is an unbalanced big city shut-in who's afraid to leave her townhouse, not the fearless adventure hero portrayed in her books. Nim, Alexandra, and Jack embark upon the adventures of a lifetime in which each must overcome his or her own fears and perceived powerlessness and limitations in order to grow and help one another. The question is; can each prevail against his or her own insecurities and the fury of nature? Based on the novel\", \"Nim's Island\", \"by Wendy Orr, Nim's Island is first and foremost a captivating adventure full of suspense and peril which also offers a touching look at the love between a father and daughter. (Ages 7 and older)\", '--Tami Horiuchi', 'Beyond', 'Nim\\x92s Island', 'on DVD', 'Mr. Magorium\\x92s Wonder Emporium', 'on DVD', 'Horton Hears a Who!', 'on DVD', 'Alvin and the Chipmunks', 'on DVD', 'Stills from', 'Nim\\x92s Island', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2252764DVD', 'Director': 'Jennifer Flackett, Mark Levin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Full Screen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 5, 2008', 'Actors': 'Jodie Foster, Gerard Butler, Abigail Breslin, Michael Carman, Mark Brady', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Jennifer Flackett, Joseph Kwong, Mark Levin, Paula Mazur, Wendy Orr', 'Number of discs': '1'}\nReview Text: good kids movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr. Seuss' The Lorax [DVD]\nReview Date: 2015/07/31\nStore: Danny DeVito  (Actor),     Ed Helms  (Actor),     Chris Renaud  (Director),     Kyle Balda  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', \"The imaginative world of Dr. Seuss comes to life like never before in this visually spectacular adventure from the creators of Despicable Me! Twelve-year-old Ted will do anything to find a real live Truffula Tree in order to impress the girl of his dreams. As he embarks on his journey, Ted discovers the incredible story of the Lorax, a grumpy but charming creature who speaks for the trees. Featuring the voice talents of Danny DeVito, Ed Helms, Zac Efron, Taylor Swift, Rob Riggle, Jenny Slate, and Betty White, Dr. Seuss' The Lorax is filled with hilarious fun for everyone!\", 'Bonus Content:', 'Seuss to Screen', 'Seuss to Screen', 'Seuss It Up!', 'Seuss It Up!', \"Once-ler's Wagon\", \"Once-ler's Wagon\", 'Feature Commentary with Director Chris Renaud & Co-Director Kyle Balda', 'Feature Commentary with Director Chris Renaud & Co-Director Kyle Balda', ']]>', 'Amazon.com', \"An animated rendition of Dr. Seuss's classic book about the threat of industrialization to nature,\", 'The Lorax', 'opens in Thneedville--a town never depicted in the original book. Thneedville is an artificial place, made primarily from plastic. It sports inflatable trees, fast cars, and air quality so poor that the residents are forced to purchase bottled fresh air. In another new twist to the story, 12-year-old Ted (Zac Efron) discovers that his crush Audrey (Taylor Swift) wants nothing more than to see a long-extinct Truffula Tree, so he sets out to impress her by finding one. Since there are no real trees in Thneedville, Ted acts on the crazy stories of his grandmother (Betty White), venturing beyond the city\\'s walls into the desolate wasteland to locate a mysterious creature called the Once-ler (Ed Helms). Here the story and animation begin to more closely follow the book. Ted discovers the grumpy recluse, who reluctantly begins to tell him a tale about a once-perfect landscape filled with beautiful Truffula Trees and cute frolicking animals--a landscape now decimated by one greedy young man\\'s insatiable appetite for profit. The beauty and wonder of the Truffula forest and its creatures are right out of Dr. Seuss\\'s illustrations. While the forest creatures may not be directly referred to as Brown Bar-ba-loots, Swomee-Swans, and Humming-Fish, the cute little bears, funny-looking ducks, and especially charming trio of singing fish are instantly recognizable. They serve, as they do in Dr. Seuss\\'s book, to add just the right amount of humor and levity to what would otherwise be a pretty heavy-handed message from the Lorax (Danny DeVito) about environmental preservation. Ted\\'s hormonal instincts to impress Audrey slowly begin to take a back seat to the plight of the lost trees and animals, and the Once-ler\\'s assertion that \"Unless someone like you cares a whole awful lot, nothing is going to get better\" rings true by the end of the film. The abundance of original music is a nice and unexpected addition to the story, though why neither Efron nor Swift actually gets to sing is perplexing. (Ages 5 and older)', 'Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation, Comedy', 'Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Taylor Swift, Ed Helms, Chris Renaud, Danny DeVito, Kyle Balda, Zac Efron, Betty White', 'Initial release date': '2012-08-07', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': '274280', 'Director': 'Chris Renaud, Kyle Balda', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'August 7, 2012', 'Actors': 'Danny DeVito, Ed Helms, Zac Efron, Taylor Swift, Betty White', 'Subtitles': 'English, French, Spanish', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great kids movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alvin Chipmunks Triple Feature (Alvin and the Chipmunks / Alvin and the chipmunks: The squeakquel / Alvin and the chipmunks: Chipwrecked)\nReview Date: 2015/11/11\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Contains Alvin & the Chipmunks, Alvin & the Chipmunks the Squeakquel, and Alvin & the Chipmunks Chipwrecked']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Childrens', 'Format': 'NTSC', 'Contributor': 'ALVIN & THE CHIPMUNKS 1/2/3', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': '379683', 'Media Format': 'NTSC', 'Release date': 'October 8, 2013', 'Studio': '20th Century Fox', 'Number of discs': '3'}\nReview Text: fun little movies for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hotel Transylvania 2\nReview Date: 2016/03/01\nStore: Genndy Tartakovsky  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['In this all-new monster comedy adventure, everything seems to be changing for the better at Hotel Transylvania! However, Drac is worried that his adorable half-human, half-vampire grandson, Dennis, isn’t showing signs of being a vampire. So while Mavis is on vacation, things get batty as Drac enlists his monster friends Frank, Murray, Wayne, and Griffin to put Dennis through a “monster-in-training” boot camp! In theaters September 25.', 'Contact Sony customer service and receive a free digital code.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family, Animation', 'Format': 'NTSC, Ultraviolet, Ultraviolet', 'Contributor': 'Michelle Murdocca, Genndy Tartakovsky, Sony Pictures Animation Inc.', 'Language': 'English', 'Runtime': '1 hour and 29 minutes', 'Digital Copy Expiration Date': 'December 31, 2019', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Audio Description': 'English', 'Item model number': '35219993', 'Director': 'Genndy Tartakovsky', 'Media Format': 'NTSC, Ultraviolet, Ultraviolet', 'Run time': '1 hour and 29 minutes', 'Release date': 'January 12, 2016', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Michelle Murdocca', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: good kids movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hotel Transylvania (Blu-ray / DVD)\nReview Date: 2016/03/01\nStore: Adam Sandler  (Actor),     Kevin James  (Actor),     Genndy Tartakovsky  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Welcome to Hotel Transylvania, Dracula’s lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula (Adam Sandler) has invited all his best friends – Frankenstein and his wife, the Mummy, the Invisible Man, the Werewolf family, and more – to celebrate his beloved daughter Mavis’s (Selena Gomez) 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!', 'Amazon.com']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family, Animation, Comedy', 'Format': 'Blu-ray, AC-3, Animated, Color, Dolby, Subtitled, Widescreen, Dubbed', 'Contributor': 'Adam Sandler, Kevin James, Selena Gomez, Andy Samberg, Genndy Tartakovsky', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Audio Description': 'Portuguese', 'Item model number': 'CTR41370BR', 'Director': 'Genndy Tartakovsky', 'Media Format': 'Blu-ray, AC-3, Animated, Color, Dolby, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Adam Sandler, Kevin James, Andy Samberg, Selena Gomez', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: good kids movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Home [Blu-ray]\nReview Date: 2016/03/01\nStore: Steve Martin  (Actor),     Jennifer Lopez  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['From the creators of How to Train Your Dragon and Shrek comes the hit comedy of the year featuring the superstar voice talents of Jim Parsons, Rihanna, Steve Martin and Jennifer Lopez. When Oh, a lovable misfit from another planet, lands on Earth and meets a teenage girl named Tip, the two unlikely friends embark on the greatest journey of all time...the journey Home.Bonus Content:', 'Best Party Ever!', 'Best Party Ever!', \"Oh's Party Place\", \"Oh's Party Place\", \"Oh's Party Planning Tips\", \"Oh's Party Planning Tips\", \"Oh's Costume Party\", \"Oh's Costume Party\", 'Short Boovies', 'Short Boovies', 'Deleted Scenes', 'Deleted Scenes', 'Be An Artist!', 'Be An Artist!', \"Oh's Other Extras\", \"Oh's Other Extras\", 'Gallery', 'Gallery', 'Theatrical Trailer', 'Theatrical Trailer', 'The World of DreamWorks Animation', 'The World of DreamWorks Animation']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, DVD Movie, Animation, Blu-ray Movie, Comedy, Action & Adventure', 'Format': 'Blu-ray, Animated, Color, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Jennifer Lopez, Rihanna, Steve Martin, Jim Parsons, Matt Jones', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), Italian (DTS 5.1), Dutch (DTS 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1), French Canadian (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Flemish (DTS 5.1)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 2.4 Ounces', 'Item model number': 'BRD100472', 'Media Format': 'Blu-ray, Animated, Color, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 28, 2015', 'Actors': 'Steve Martin, Jennifer Lopez, Matt Jones, Jim Parsons, Rihanna', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: wonderful movie about friends and family\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alpha And Omega [DVD]\nReview Date: 2016/06/14\nStore: Hayden Panettiere  (Actor),     Justin Long  (Actor),     Anthony Bell  (Director),     Ben Gluck  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Product Description', 'Come along on the ultimate road-trip adventure that will leave the whole family howling with laughter! When Kate, a take-charge “Alpha” wolf, and Humphrey, a laid-back “Omega” wolf, get snatched by park rangers and relocated halfway across the country, the two must set off on an incredible journey home! With the help of a goofy golfing goose and his quacky duck caddy, Kate and Humphrey won’t let anything stop them – prickly porcupines, grumpy bears, even a speeding locomotive – from getting back to Jasper Park in time to help save their pack from rival wolves! And along the way, Kate and Humphrey learn that even though they are complete opposites, they make a pretty good team! It’s a thousand miles of fun in this wildly entertaining journey the whole pack can enjoy together!', 'Amazon.com', 'Love is blind to the rules of tradition, opposites attract, and both clichés apply quite nicely to the wolves in', 'Alpha and Omega', \". In the wolf world, the pack values the omega wolves' skill of defusing tense situations with humor just as much as they value the keen leadership skills of the alpha wolves, but tradition dictates that alpha wolves don't mate with omega wolves. So, when the all-business alpha wolf Kate (Hayden Panettiere) and the fun-seeking omega wolf Humphrey (Justin Long) find themselves attracted to one another, the pair resign themselves to a life apart, and Kate agrees to a match with alpha male Garth (Chris Carmack) from a rival pack in order to peacefully merge the two packs into one. But when Humphrey and Kate are tranquilized in their home in Jasper National Forest, Canada, and relocated to Sawtooth Forest far away in Idaho, the two discover that not only can opposites work very well together, but that neither of them can continue to ignore their attraction for the other. The question is, will working together, combined with a little help from a golf-playing goose and his duck caddy, be enough to get the pair all the way back to Jasper National Park before the rival wolf packs tear one another apart at the next full moon? And what will become of their relationship if they do return in time? This animated film is amusing and entertaining, if not particularly outstanding. A lot of the humor is pretty corny and the plot has been done many times before (think\", 'Open Season 2', '), but the characters are likable, the action is pretty good, and who can resist chuckling at images like a retired, golf-playing French-Canadian goose or the distractive powers of a good cupcake? (Ages 5 and older)', '--Tami Horiuchi']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 0.71 Ounces', 'Item model number': 'LGT29334DVD', 'Director': 'Anthony Bell, Ben Gluck', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 18 minutes', 'Release date': 'January 11, 2011', 'Actors': 'Hayden Panettiere, Justin Long', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alpha & Omega 2: A Howl-iday Adventure [DVD + Digital]\nReview Date: 2016/06/14\nStore: Dominique Monfery  (Director),     Richard Rich  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Kate & Humphrey and their three wolf cubs (Smokey, Claudette and Runt) are happily preparing to celebrate their first winter holidays together when their smallest cub, Runt, mysteriously disappears. They must now go on a new journey across the wilderness to find Runt before the winter festivities begin at home.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Family', 'Format': 'NTSC, Ultraviolet', 'Contributor': 'Richard Rich, Dominique Monfery, Crest Animation Productions', 'Language': 'English', 'Runtime': '1 hour and 18 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'LGT44116DVD', 'Director': 'Dominique Monfery, Richard Rich', 'Media Format': 'NTSC, Ultraviolet', 'Run time': '1 hour and 18 minutes', 'Release date': 'October 7, 2014', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alpha And Omega 3: The Great Wolf Games [DVD + Digital]\nReview Date: 2016/06/14\nStore: Richard Rich  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Join the pack in this wild, warmhearted and totally pawsome adventure starring everyone\\'s favorite alphas and omegas! It\\'s time for \"The Great Wolf Games,\" when all the alphas in the packs set aside their differences for some friendly competition. When an unexpected accident puts many of our pack\\'s star alpha wolves out of commission, a new team is assembled that includes forest friends not in the pack. Can Coach Humphrey lead his ragtag group of \"underdogs\" to victory? Find out in this thrilling movie that will leave you howling for more!']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Family', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Richard Rich, Crest Animation Productions', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': '32974681', 'Director': 'Richard Rich', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '45 minutes', 'Release date': 'March 10, 2015', 'Subtitles': 'English', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rio\nReview Date: 2016/06/14\nStore: Jesse Eisenberg  (Actor),     Anne Hathaway  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'This comedy adventure centers on Blu, a flightless macaw who acts more human than bird. When Blu, the last of his kind, discovers there’s another – and that she’s a she – he embarks on an adventure to magical Rio. There, he meets Jewel and a menagerie of vivid characters who help Blu fulfill his dream and learn to fly.', 'Amazon.com', 'A classic tale of self-discovery, romance, and adventure,', 'Rio', \"is the story of Blu, a flightless macaw who was taken from the forests of Rio de Janeiro as a young bird and raised by a kind girl in a small Minnesota town. When an ornithologist comes to town and informs Blu's now-grown owner Linda that Blu is the last male of his species, Blu and Linda return to Rio so that Blu can mate with a feisty female named Jewel. Thus begins an adventure in which Blu encounters everything from the complexities of courtship and love, to thugs involved in an exotic animal theft ring, strange new friendships--including one with an overly friendly slobbering bulldog--and a crazy ride through a Carnaval parade. Blu and Linda both mature as a result of their journey in Rio, and love ensures that life will never be quite the same for either ever again. The animation in\", 'Rio', \"is quite impressive, the characters are endearing, the Brazilian music is very appealing, and the star-studded voice cast includes Anne Hathaway, Jesse Eisenberg, Will i Am, Wanda Sykes, Jane Lynch, George Lopez, and Jamie Foxx. While the story doesn't really offer anything new--instead playing much like a rehashing of some of the major plot points from movies like\", 'Madagascar', ',', 'Finding Nemo', ', and', 'Babe', \"--that doesn't mean the film isn't perfectly entertaining for both kids and adults. (Ages 6 and older)\", '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 4 Ounces', 'Item model number': '6504984190', 'Media Format': 'Multiple Formats, Animated, Color, Dubbed, Dolby, Subtitled, Widescreen, NTSC, AC-3', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 2, 2011', 'Actors': 'Jesse Eisenberg, Anne Hathaway', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference": "Caillous Holiday Movie\nCaillou  (Actor),     NCircle Entertainment  (Director)    Format: DVD\nMovies & TV, 3-6 Years\n[\"CAILLOU TM is an award-winning television series about an inquisitive four year old whose world is filled with learning, fun and imagination and inspires generations of pre-school children to grow emotionally as they explore the world around them. When winter comes to Caillou's house, this curious 4-year-old tackles all kinds of big boy activities like helping Daddy shovel snow, making holiday presents for his family and even discovering how other little boys and girls around the world celebrate the season! Filled with magical moments seen through a small child's eyes, this delightful story will enchant your entire family.\"]\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Caillou, NCircle Entertainment', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '100195', 'Director': 'NCircle Entertainment', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'November 11, 2014', 'Actors': 'Caillou', 'Subtitles': 'English', 'Studio': 'Ncircle', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat kids movie\nFive Stars\nWild Kratts: Jungle Animals\nn/a  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Anime\n['Creature teachers Chris and Martin Kratt will take families along on extraordinary animal-powered adventures. The show transforms the Kratt Brothers into animated versions of themselves, allowing the real-life zoologists to visit wild animals in their little-seen habitats and showcase key science concepts.']\n{'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'N/a', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26219763', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'January 2, 2012', 'Studio': 'PBS', 'Number of discs': '1'}\ngreat kids show\nFive Stars\nCaillou - Caillou's Train Trip & Other Adventures\nEllen David, Annie Bovaird  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Travel with Caillou on his very first train trip and airplane ride! There are more adventures in store for Caillou as he explores his very own neighborhood. From a trip to Grandma's house to the neighborhood rummage sale, a whole world waits fro Caillou to explore and discover. Every day with Caillou is a new day filled with adventure, fun and laughter! This DVD includes 2 full-length videos: Caillou the Explorer and Caillou at His Best.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.35 x 7.51 inches; 2.72 Ounces', 'Item model number': '705110', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Ellen David, Annie Bovaird', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\ngreat kids show\nFive Stars\nWild Kratts: Rainforest Rescue\n.  (Actor, Director)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Creature teachers Chris and Martin Kratt will take families along on extraordinary animal-powered adventures. The show transforms the Kratt Brothers into animated versions of themselves, allowing the real-life zoologists to visit wild animals in their little-seen habitats and showcase key science concepts. Episodes include: Rainforest Stew, and Shadow: The Black Jaguar.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '26519404', 'Media Format': 'NTSC, Color, Multiple Formats, Animated', 'Run time': '50 minutes', 'Release date': 'April 9, 2013', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\ngreat educational dvd\nFive Stars\nFree Willy: Escape from Pirate's Cove\nBindi Irwin  (Actor),     Beau Bridges  (Actor),     Will Geiger  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', \"Free Willy: Escape from Pirate's Cove (DVD)\", \"When eleven-year-old Kirra's widowed father is injured, she must leave Australia against her desires in order to live with her estranged grandfather at his run-down seaside theme park in South Africa. However, after a storm traps a baby orca in the park's lagoon, the park not only gets more visitors, but Kirra and the whale she names Willy develop an amazing friendship. Knowing that Willy will soon outgrow the lagoon and that her grandfather will be forced to sell the whale to his competitor, Kirra must not only locate Willy's pod, but also find a way to teach the young whale to survive and be free in the open sea.\", ']]>', 'Amazon.com', 'More a retelling of the original 1993', 'Free Willy', 'film than a third sequel in the series,', \"Free Willy: Escape from Pirate's Cove\", \"is the story of a young whale who's separated from his pod, used in a moneymaking scheme, and befriended by a young girl who ultimately makes a huge difference in the young whale's life. The film stars Bindi Irwin (daughter of the late Crocodile Hunter Steve Irwin and host of the TV nature documentary series\", 'Bindi the Jungle Girl', \") in her first film, and she is surprisingly believable and passionate in her role as Kirra, if not entirely polished. Beau Bridges plays Kirra's grandfather, Gus, a down-on-his-luck gambler and owner of a dilapidated amusement park who's obsessed with making money. When Kirra's father is injured, Gus is unexpectedly saddled with caring for his granddaughter over the summer. Bongo Mbutuma, Siyabulela Ramba, and Stephen Jennings round out the cast. When a young orca becomes trapped in the lagoon at Gus's ocean-side amusement park in South Africa, Kirra and her grandfather clash over the whale's future. Kirra quickly dubs the whale Willy and pleads with her grandfather to set him free, but Gus wants to use Willy to boost profits. When a mammal rescue group determines that Willy's underdeveloped echolocation makes him unfit to survive alone in the wild, Kirra bristles at their suggestion to put Willy down, and she vows to rehabilitate the orca. Meanwhile, Kirra's grandfather contemplates selling Willy to a neighboring park owner at a handsome profit, in hopes that he will have the necessary funds to properly house and care for Willy. More than just a story about right versus wrong,\", \"Free Willy: Escape from Pirate's Cove\", 'is an exploration of a much more complicated ethical dilemma in which the best course of action is unclear. As the characters each struggle to choose the right path, what becomes crystal clear is the power of perseverance and the personal growth that results from love, adversity, and challenge. While the CGI graphic scenes of the orca pods swimming are admittedly poor and some other aspects of this film could have been improved,', \"Escape from Pirate's Cove\", \"is still a good family film with a heartfelt message. Bonus features include a fairly interesting featurette about filming on location in South Africa, Bindi's first movie diary, a quick look at the film's animal costars, two deleted scenes, and one outtake. The Blu-ray also features a pop-up trivia option that runs the length of the film.\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family, Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Beau Bridges, Mike Falkow, Will Geiger, Bindi Irwin', 'Initial release date': '2010-03-23', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000099825DVD', 'Director': 'Will Geiger', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 42 minutes', 'Release date': 'March 23, 2010', 'Actors': 'Bindi Irwin, Beau Bridges, Mike Falkow', 'Subtitles': 'English, French, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\ngrand son liked\nFour Stars\nWild Kratts: Bugging Out\n.  (Actor)    Format: DVD\nMovies & TV, PBS, All\n['Join the adventures of Martin and Chris as they meet up with cool creatures from around the world and witness many never-before-seen wildlife moments. With their creature smarts plus their newly invented Creature Power Suits, the brothers Kratt are using amazing animal abilities to rescue their animal friends when they get into trouble. Episodes include: Secrets of the Spiders Web; and Attack of the Tree Eating Aliens.']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '55 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '28937277', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '55 minutes', 'Release date': 'February 25, 2014', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\ngood educational dvd\nFour Stars\nCaillou's Winter Wonders\nCaillou's Winter Wonders  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Join Caillou in four fun adventures! In Caillou The Snowman, Caillou explores all the fun activities of winter, including playing hockey and making paper snowflakes! In Caillous Christmas, Caillou learns about holiday traditions, from caroling to different cultural festivities in playschool. In Its Cold Outside, Caillou has fun playing in the snow, making snow angels and even tobogganing! In Winter!, Caillou discovers the joys of winter sports.']\n{'Genre': 'Feature', 'Format': 'NTSC, Color, Closed-captioned, Dubbed, Full Screen, Multiple Formats, Animated', 'Contributor': \"Caillou's Winter Wonders\", 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.34 x 7.46 inches; 2.72 Ounces', 'Media Format': 'NTSC, Color, Closed-captioned, Dubbed, Full Screen, Multiple Formats, Animated', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 23, 2008', 'Actors': \"Caillou's Winter Wonders\", 'Dubbed': 'Spanish', 'Studio': 'PBS', 'Number of discs': '1'}\ngrandspn really like the movie\nFour Stars\nNim's Island\nJodie Foster  (Actor),     Gerard Butler  (Actor),     Jennifer Flackett  (Director, Writer),     Mark Levin  (Director, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', \"Anything can happen on Nim's Island, a magical place ruled by a young girl's imagination. It is an existence that mirrors that of her favorite literary character, Alex Rover- the world's greatest adventurer. But Alexandra, the author of the Rover books, leads a reclusive life in the big city. When Nim's father goes missing from their island, a twist of fate brings her together with Alexandra. Now, they must draw courage from their fictional hero, Alex Rover, and find strength in one another to conquer Nim's Island.\", 'Amazon.com', \"Adventure doesn't always begin with pirates on the high seas or explorers deep in the desert; sometimes it starts with an idyllic life on a private island in the middle of the South Asiatic Sea. For 11-year old Nim (Abigail Breslin) and her father and microbiologist Jack Russo (Gerard Butler), life is perfect thanks to their love of nature, Jack's mechanical ingenuity, and regular deliveries via supply ship. Loneliness is never an issue for Nim because of her special friendships with Selkie the sea lion, Galileo the pelican, and Freddie the iguana and her education is intensive, if rather unique. Adventure and imagination are ways of life for Nim whether she's heading out to sea to help her father collect plankton specimens, playing soccer on the beach with Selkie, or delving into the latest Alex Rover adventure novel, but everything changes when Jack departs on the boat for a two-night expedition to collect plankton specimens and gets caught in an unexpected storm. Alone on the island, Nim begins to worry about her father's safety as well as her own and, through a chance email, connects with Alex Rover (Jodie Foster) whom she begs to come help find her father. Problem is, author Alexandra Rover is an unbalanced big city shut-in who's afraid to leave her townhouse, not the fearless adventure hero portrayed in her books. Nim, Alexandra, and Jack embark upon the adventures of a lifetime in which each must overcome his or her own fears and perceived powerlessness and limitations in order to grow and help one another. The question is; can each prevail against his or her own insecurities and the fury of nature? Based on the novel\", \"Nim's Island\", \"by Wendy Orr, Nim's Island is first and foremost a captivating adventure full of suspense and peril which also offers a touching look at the love between a father and daughter. (Ages 7 and older)\", '--Tami Horiuchi', 'Beyond', 'Nim\\x92s Island', 'on DVD', 'Mr. Magorium\\x92s Wonder Emporium', 'on DVD', 'Horton Hears a Who!', 'on DVD', 'Alvin and the Chipmunks', 'on DVD', 'Stills from', 'Nim\\x92s Island', '(Click for larger image)']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2252764DVD', 'Director': 'Jennifer Flackett, Mark Levin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Full Screen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 5, 2008', 'Actors': 'Jodie Foster, Gerard Butler, Abigail Breslin, Michael Carman, Mark Brady', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Jennifer Flackett, Joseph Kwong, Mark Levin, Paula Mazur, Wendy Orr', 'Number of discs': '1'}\ngood kids movie\nFour Stars\nDr. Seuss' The Lorax [DVD]\nDanny DeVito  (Actor),     Ed Helms  (Actor),     Chris Renaud  (Director),     Kyle Balda  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', \"The imaginative world of Dr. Seuss comes to life like never before in this visually spectacular adventure from the creators of Despicable Me! Twelve-year-old Ted will do anything to find a real live Truffula Tree in order to impress the girl of his dreams. As he embarks on his journey, Ted discovers the incredible story of the Lorax, a grumpy but charming creature who speaks for the trees. Featuring the voice talents of Danny DeVito, Ed Helms, Zac Efron, Taylor Swift, Rob Riggle, Jenny Slate, and Betty White, Dr. Seuss' The Lorax is filled with hilarious fun for everyone!\", 'Bonus Content:', 'Seuss to Screen', 'Seuss to Screen', 'Seuss It Up!', 'Seuss It Up!', \"Once-ler's Wagon\", \"Once-ler's Wagon\", 'Feature Commentary with Director Chris Renaud & Co-Director Kyle Balda', 'Feature Commentary with Director Chris Renaud & Co-Director Kyle Balda', ']]>', 'Amazon.com', \"An animated rendition of Dr. Seuss's classic book about the threat of industrialization to nature,\", 'The Lorax', 'opens in Thneedville--a town never depicted in the original book. Thneedville is an artificial place, made primarily from plastic. It sports inflatable trees, fast cars, and air quality so poor that the residents are forced to purchase bottled fresh air. In another new twist to the story, 12-year-old Ted (Zac Efron) discovers that his crush Audrey (Taylor Swift) wants nothing more than to see a long-extinct Truffula Tree, so he sets out to impress her by finding one. Since there are no real trees in Thneedville, Ted acts on the crazy stories of his grandmother (Betty White), venturing beyond the city\\'s walls into the desolate wasteland to locate a mysterious creature called the Once-ler (Ed Helms). Here the story and animation begin to more closely follow the book. Ted discovers the grumpy recluse, who reluctantly begins to tell him a tale about a once-perfect landscape filled with beautiful Truffula Trees and cute frolicking animals--a landscape now decimated by one greedy young man\\'s insatiable appetite for profit. The beauty and wonder of the Truffula forest and its creatures are right out of Dr. Seuss\\'s illustrations. While the forest creatures may not be directly referred to as Brown Bar-ba-loots, Swomee-Swans, and Humming-Fish, the cute little bears, funny-looking ducks, and especially charming trio of singing fish are instantly recognizable. They serve, as they do in Dr. Seuss\\'s book, to add just the right amount of humor and levity to what would otherwise be a pretty heavy-handed message from the Lorax (Danny DeVito) about environmental preservation. Ted\\'s hormonal instincts to impress Audrey slowly begin to take a back seat to the plight of the lost trees and animals, and the Once-ler\\'s assertion that \"Unless someone like you cares a whole awful lot, nothing is going to get better\" rings true by the end of the film. The abundance of original music is a nice and unexpected addition to the story, though why neither Efron nor Swift actually gets to sing is perplexing. (Ages 5 and older)', 'Tami Horiuchi']\n{'Genre': 'Kids & Family, Animation, Comedy', 'Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Taylor Swift, Ed Helms, Chris Renaud, Danny DeVito, Kyle Balda, Zac Efron, Betty White', 'Initial release date': '2012-08-07', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': '274280', 'Director': 'Chris Renaud, Kyle Balda', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'August 7, 2012', 'Actors': 'Danny DeVito, Ed Helms, Zac Efron, Taylor Swift, Betty White', 'Subtitles': 'English, French, Spanish', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat kids movie\nFive Stars\nAlvin Chipmunks Triple Feature (Alvin and the Chipmunks / Alvin and the chipmunks: The squeakquel / Alvin and the chipmunks: Chipwrecked)\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Contains Alvin & the Chipmunks, Alvin & the Chipmunks the Squeakquel, and Alvin & the Chipmunks Chipwrecked']\n{'Genre': 'Childrens', 'Format': 'NTSC', 'Contributor': 'ALVIN & THE CHIPMUNKS 1/2/3', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': '379683', 'Media Format': 'NTSC', 'Release date': 'October 8, 2013', 'Studio': '20th Century Fox', 'Number of discs': '3'}\nfun little movies for kids\nFive Stars\nHotel Transylvania 2\nGenndy Tartakovsky  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['In this all-new monster comedy adventure, everything seems to be changing for the better at Hotel Transylvania! However, Drac is worried that his adorable half-human, half-vampire grandson, Dennis, isn’t showing signs of being a vampire. So while Mavis is on vacation, things get batty as Drac enlists his monster friends Frank, Murray, Wayne, and Griffin to put Dennis through a “monster-in-training” boot camp! In theaters September 25.', 'Contact Sony customer service and receive a free digital code.']\n{'Genre': 'Family, Animation', 'Format': 'NTSC, Ultraviolet, Ultraviolet', 'Contributor': 'Michelle Murdocca, Genndy Tartakovsky, Sony Pictures Animation Inc.', 'Language': 'English', 'Runtime': '1 hour and 29 minutes', 'Digital Copy Expiration Date': 'December 31, 2019', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Audio Description': 'English', 'Item model number': '35219993', 'Director': 'Genndy Tartakovsky', 'Media Format': 'NTSC, Ultraviolet, Ultraviolet', 'Run time': '1 hour and 29 minutes', 'Release date': 'January 12, 2016', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Michelle Murdocca', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngood kids movie\nFour Stars\nHotel Transylvania (Blu-ray / DVD)\nAdam Sandler  (Actor),     Kevin James  (Actor),     Genndy Tartakovsky  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Welcome to Hotel Transylvania, Dracula’s lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula (Adam Sandler) has invited all his best friends – Frankenstein and his wife, the Mummy, the Invisible Man, the Werewolf family, and more – to celebrate his beloved daughter Mavis’s (Selena Gomez) 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!', 'Amazon.com']\n{'Genre': 'Family, Animation, Comedy', 'Format': 'Blu-ray, AC-3, Animated, Color, Dolby, Subtitled, Widescreen, Dubbed', 'Contributor': 'Adam Sandler, Kevin James, Selena Gomez, Andy Samberg, Genndy Tartakovsky', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Audio Description': 'Portuguese', 'Item model number': 'CTR41370BR', 'Director': 'Genndy Tartakovsky', 'Media Format': 'Blu-ray, AC-3, Animated, Color, Dolby, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Adam Sandler, Kevin James, Andy Samberg, Selena Gomez', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\ngood kids movie\nFour Stars\nHome [Blu-ray]\nSteve Martin  (Actor),     Jennifer Lopez  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['From the creators of How to Train Your Dragon and Shrek comes the hit comedy of the year featuring the superstar voice talents of Jim Parsons, Rihanna, Steve Martin and Jennifer Lopez. When Oh, a lovable misfit from another planet, lands on Earth and meets a teenage girl named Tip, the two unlikely friends embark on the greatest journey of all time...the journey Home.Bonus Content:', 'Best Party Ever!', 'Best Party Ever!', \"Oh's Party Place\", \"Oh's Party Place\", \"Oh's Party Planning Tips\", \"Oh's Party Planning Tips\", \"Oh's Costume Party\", \"Oh's Costume Party\", 'Short Boovies', 'Short Boovies', 'Deleted Scenes', 'Deleted Scenes', 'Be An Artist!', 'Be An Artist!', \"Oh's Other Extras\", \"Oh's Other Extras\", 'Gallery', 'Gallery', 'Theatrical Trailer', 'Theatrical Trailer', 'The World of DreamWorks Animation', 'The World of DreamWorks Animation']\n{'Genre': 'Kids & Family, DVD Movie, Animation, Blu-ray Movie, Comedy, Action & Adventure', 'Format': 'Blu-ray, Animated, Color, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Jennifer Lopez, Rihanna, Steve Martin, Jim Parsons, Matt Jones', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), Italian (DTS 5.1), Dutch (DTS 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1), French Canadian (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Flemish (DTS 5.1)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 2.4 Ounces', 'Item model number': 'BRD100472', 'Media Format': 'Blu-ray, Animated, Color, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 28, 2015', 'Actors': 'Steve Martin, Jennifer Lopez, Matt Jones, Jim Parsons, Rihanna', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nwonderful movie about friends and family\nFive Stars\nAlpha And Omega [DVD]\nHayden Panettiere  (Actor),     Justin Long  (Actor),     Anthony Bell  (Director),     Ben Gluck  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Product Description', 'Come along on the ultimate road-trip adventure that will leave the whole family howling with laughter! When Kate, a take-charge “Alpha” wolf, and Humphrey, a laid-back “Omega” wolf, get snatched by park rangers and relocated halfway across the country, the two must set off on an incredible journey home! With the help of a goofy golfing goose and his quacky duck caddy, Kate and Humphrey won’t let anything stop them – prickly porcupines, grumpy bears, even a speeding locomotive – from getting back to Jasper Park in time to help save their pack from rival wolves! And along the way, Kate and Humphrey learn that even though they are complete opposites, they make a pretty good team! It’s a thousand miles of fun in this wildly entertaining journey the whole pack can enjoy together!', 'Amazon.com', 'Love is blind to the rules of tradition, opposites attract, and both clichés apply quite nicely to the wolves in', 'Alpha and Omega', \". In the wolf world, the pack values the omega wolves' skill of defusing tense situations with humor just as much as they value the keen leadership skills of the alpha wolves, but tradition dictates that alpha wolves don't mate with omega wolves. So, when the all-business alpha wolf Kate (Hayden Panettiere) and the fun-seeking omega wolf Humphrey (Justin Long) find themselves attracted to one another, the pair resign themselves to a life apart, and Kate agrees to a match with alpha male Garth (Chris Carmack) from a rival pack in order to peacefully merge the two packs into one. But when Humphrey and Kate are tranquilized in their home in Jasper National Forest, Canada, and relocated to Sawtooth Forest far away in Idaho, the two discover that not only can opposites work very well together, but that neither of them can continue to ignore their attraction for the other. The question is, will working together, combined with a little help from a golf-playing goose and his duck caddy, be enough to get the pair all the way back to Jasper National Park before the rival wolf packs tear one another apart at the next full moon? And what will become of their relationship if they do return in time? This animated film is amusing and entertaining, if not particularly outstanding. A lot of the humor is pretty corny and the plot has been done many times before (think\", 'Open Season 2', '), but the characters are likable, the action is pretty good, and who can resist chuckling at images like a retired, golf-playing French-Canadian goose or the distractive powers of a good cupcake? (Ages 5 and older)', '--Tami Horiuchi']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 0.71 Ounces', 'Item model number': 'LGT29334DVD', 'Director': 'Anthony Bell, Ben Gluck', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 18 minutes', 'Release date': 'January 11, 2011', 'Actors': 'Hayden Panettiere, Justin Long', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngood movie for kids\nFive Stars\nAlpha & Omega 2: A Howl-iday Adventure [DVD + Digital]\nDominique Monfery  (Director),     Richard Rich  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Kate & Humphrey and their three wolf cubs (Smokey, Claudette and Runt) are happily preparing to celebrate their first winter holidays together when their smallest cub, Runt, mysteriously disappears. They must now go on a new journey across the wilderness to find Runt before the winter festivities begin at home.']\n{'Genre': 'Family', 'Format': 'NTSC, Ultraviolet', 'Contributor': 'Richard Rich, Dominique Monfery, Crest Animation Productions', 'Language': 'English', 'Runtime': '1 hour and 18 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'LGT44116DVD', 'Director': 'Dominique Monfery, Richard Rich', 'Media Format': 'NTSC, Ultraviolet', 'Run time': '1 hour and 18 minutes', 'Release date': 'October 7, 2014', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngood movie for kids\nFive Stars\nAlpha And Omega 3: The Great Wolf Games [DVD + Digital]\nRichard Rich  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Join the pack in this wild, warmhearted and totally pawsome adventure starring everyone\\'s favorite alphas and omegas! It\\'s time for \"The Great Wolf Games,\" when all the alphas in the packs set aside their differences for some friendly competition. When an unexpected accident puts many of our pack\\'s star alpha wolves out of commission, a new team is assembled that includes forest friends not in the pack. Can Coach Humphrey lead his ragtag group of \"underdogs\" to victory? Find out in this thrilling movie that will leave you howling for more!']\n{'Genre': 'Family', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Richard Rich, Crest Animation Productions', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': '32974681', 'Director': 'Richard Rich', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '45 minutes', 'Release date': 'March 10, 2015', 'Subtitles': 'English', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '1'}\ngood movie for kids\nFive Stars\nRio\nJesse Eisenberg  (Actor),     Anne Hathaway  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'This comedy adventure centers on Blu, a flightless macaw who acts more human than bird. When Blu, the last of his kind, discovers there’s another – and that she’s a she – he embarks on an adventure to magical Rio. There, he meets Jewel and a menagerie of vivid characters who help Blu fulfill his dream and learn to fly.', 'Amazon.com', 'A classic tale of self-discovery, romance, and adventure,', 'Rio', \"is the story of Blu, a flightless macaw who was taken from the forests of Rio de Janeiro as a young bird and raised by a kind girl in a small Minnesota town. When an ornithologist comes to town and informs Blu's now-grown owner Linda that Blu is the last male of his species, Blu and Linda return to Rio so that Blu can mate with a feisty female named Jewel. Thus begins an adventure in which Blu encounters everything from the complexities of courtship and love, to thugs involved in an exotic animal theft ring, strange new friendships--including one with an overly friendly slobbering bulldog--and a crazy ride through a Carnaval parade. Blu and Linda both mature as a result of their journey in Rio, and love ensures that life will never be quite the same for either ever again. The animation in\", 'Rio', \"is quite impressive, the characters are endearing, the Brazilian music is very appealing, and the star-studded voice cast includes Anne Hathaway, Jesse Eisenberg, Will i Am, Wanda Sykes, Jane Lynch, George Lopez, and Jamie Foxx. While the story doesn't really offer anything new--instead playing much like a rehashing of some of the major plot points from movies like\", 'Madagascar', ',', 'Finding Nemo', ', and', 'Babe', \"--that doesn't mean the film isn't perfectly entertaining for both kids and adults. (Ages 6 and older)\", '--Tami Horiuchi']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 4 Ounces', 'Item model number': '6504984190', 'Media Format': 'Multiple Formats, Animated, Color, Dubbed, Dolby, Subtitled, Widescreen, NTSC, AC-3', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 2, 2011', 'Actors': 'Jesse Eisenberg, Anne Hathaway', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '1'}\ngood movie for kids\nFive Stars",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Caillous Holiday Movie\nReview Date: 2015/03/22\nStore: Caillou  (Actor),     NCircle Entertainment  (Director)    Format: DVD\nCategories: Movies & TV, 3-6 Years\nProduct Description: [\"CAILLOU TM is an award-winning television series about an inquisitive four year old whose world is filled with learning, fun and imagination and inspires generations of pre-school children to grow emotionally as they explore the world around them. When winter comes to Caillou's house, this curious 4-year-old tackles all kinds of big boy activities like helping Daddy shovel snow, making holiday presents for his family and even discovering how other little boys and girls around the world celebrate the season! Filled with magical moments seen through a small child's eyes, this delightful story will enchant your entire family.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Caillou, NCircle Entertainment', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '100195', 'Director': 'NCircle Entertainment', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'November 11, 2014', 'Actors': 'Caillou', 'Subtitles': 'English', 'Studio': 'Ncircle', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great kids movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wild Kratts: Jungle Animals\nReview Date: 2015/03/22\nStore: n/a  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Anime\nProduct Description: ['Creature teachers Chris and Martin Kratt will take families along on extraordinary animal-powered adventures. The show transforms the Kratt Brothers into animated versions of themselves, allowing the real-life zoologists to visit wild animals in their little-seen habitats and showcase key science concepts.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'N/a', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26219763', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'January 2, 2012', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: great kids show\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou - Caillou's Train Trip & Other Adventures\nReview Date: 2015/03/22\nStore: Ellen David, Annie Bovaird  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: [\"Travel with Caillou on his very first train trip and airplane ride! There are more adventures in store for Caillou as he explores his very own neighborhood. From a trip to Grandma's house to the neighborhood rummage sale, a whole world waits fro Caillou to explore and discover. Every day with Caillou is a new day filled with adventure, fun and laughter! This DVD includes 2 full-length videos: Caillou the Explorer and Caillou at His Best.\"]\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.35 x 7.51 inches; 2.72 Ounces', 'Item model number': '705110', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Ellen David, Annie Bovaird', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: great kids show\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wild Kratts: Rainforest Rescue\nReview Date: 2015/04/08\nStore: .  (Actor, Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: ['Creature teachers Chris and Martin Kratt will take families along on extraordinary animal-powered adventures. The show transforms the Kratt Brothers into animated versions of themselves, allowing the real-life zoologists to visit wild animals in their little-seen habitats and showcase key science concepts. Episodes include: Rainforest Stew, and Shadow: The Black Jaguar.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '26519404', 'Media Format': 'NTSC, Color, Multiple Formats, Animated', 'Run time': '50 minutes', 'Release date': 'April 9, 2013', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: great educational dvd\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Free Willy: Escape from Pirate's Cove\nReview Date: 2015/04/08\nStore: Bindi Irwin  (Actor),     Beau Bridges  (Actor),     Will Geiger  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', \"Free Willy: Escape from Pirate's Cove (DVD)\", \"When eleven-year-old Kirra's widowed father is injured, she must leave Australia against her desires in order to live with her estranged grandfather at his run-down seaside theme park in South Africa. However, after a storm traps a baby orca in the park's lagoon, the park not only gets more visitors, but Kirra and the whale she names Willy develop an amazing friendship. Knowing that Willy will soon outgrow the lagoon and that her grandfather will be forced to sell the whale to his competitor, Kirra must not only locate Willy's pod, but also find a way to teach the young whale to survive and be free in the open sea.\", ']]>', 'Amazon.com', 'More a retelling of the original 1993', 'Free Willy', 'film than a third sequel in the series,', \"Free Willy: Escape from Pirate's Cove\", \"is the story of a young whale who's separated from his pod, used in a moneymaking scheme, and befriended by a young girl who ultimately makes a huge difference in the young whale's life. The film stars Bindi Irwin (daughter of the late Crocodile Hunter Steve Irwin and host of the TV nature documentary series\", 'Bindi the Jungle Girl', \") in her first film, and she is surprisingly believable and passionate in her role as Kirra, if not entirely polished. Beau Bridges plays Kirra's grandfather, Gus, a down-on-his-luck gambler and owner of a dilapidated amusement park who's obsessed with making money. When Kirra's father is injured, Gus is unexpectedly saddled with caring for his granddaughter over the summer. Bongo Mbutuma, Siyabulela Ramba, and Stephen Jennings round out the cast. When a young orca becomes trapped in the lagoon at Gus's ocean-side amusement park in South Africa, Kirra and her grandfather clash over the whale's future. Kirra quickly dubs the whale Willy and pleads with her grandfather to set him free, but Gus wants to use Willy to boost profits. When a mammal rescue group determines that Willy's underdeveloped echolocation makes him unfit to survive alone in the wild, Kirra bristles at their suggestion to put Willy down, and she vows to rehabilitate the orca. Meanwhile, Kirra's grandfather contemplates selling Willy to a neighboring park owner at a handsome profit, in hopes that he will have the necessary funds to properly house and care for Willy. More than just a story about right versus wrong,\", \"Free Willy: Escape from Pirate's Cove\", 'is an exploration of a much more complicated ethical dilemma in which the best course of action is unclear. As the characters each struggle to choose the right path, what becomes crystal clear is the power of perseverance and the personal growth that results from love, adversity, and challenge. While the CGI graphic scenes of the orca pods swimming are admittedly poor and some other aspects of this film could have been improved,', \"Escape from Pirate's Cove\", \"is still a good family film with a heartfelt message. Bonus features include a fairly interesting featurette about filming on location in South Africa, Bindi's first movie diary, a quick look at the film's animal costars, two deleted scenes, and one outtake. The Blu-ray also features a pop-up trivia option that runs the length of the film.\", '--Tami Horiuchi']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Kids & Family, Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Beau Bridges, Mike Falkow, Will Geiger, Bindi Irwin', 'Initial release date': '2010-03-23', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000099825DVD', 'Director': 'Will Geiger', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 42 minutes', 'Release date': 'March 23, 2010', 'Actors': 'Bindi Irwin, Beau Bridges, Mike Falkow', 'Subtitles': 'English, French, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: grand son liked\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wild Kratts: Bugging Out\nReview Date: 2015/04/08\nStore: .  (Actor)    Format: DVD\nCategories: Movies & TV, PBS, All\nProduct Description: ['Join the adventures of Martin and Chris as they meet up with cool creatures from around the world and witness many never-before-seen wildlife moments. With their creature smarts plus their newly invented Creature Power Suits, the brothers Kratt are using amazing animal abilities to rescue their animal friends when they get into trouble. Episodes include: Secrets of the Spiders Web; and Attack of the Tree Eating Aliens.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '55 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '28937277', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '55 minutes', 'Release date': 'February 25, 2014', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nReview Text: good educational dvd\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou's Winter Wonders\nReview Date: 2015/04/08\nStore: Caillou's Winter Wonders  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Join Caillou in four fun adventures! In Caillou The Snowman, Caillou explores all the fun activities of winter, including playing hockey and making paper snowflakes! In Caillous Christmas, Caillou learns about holiday traditions, from caroling to different cultural festivities in playschool. In Its Cold Outside, Caillou has fun playing in the snow, making snow angels and even tobogganing! In Winter!, Caillou discovers the joys of winter sports.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Feature', 'Format': 'NTSC, Color, Closed-captioned, Dubbed, Full Screen, Multiple Formats, Animated', 'Contributor': \"Caillou's Winter Wonders\", 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.34 x 7.46 inches; 2.72 Ounces', 'Media Format': 'NTSC, Color, Closed-captioned, Dubbed, Full Screen, Multiple Formats, Animated', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 23, 2008', 'Actors': \"Caillou's Winter Wonders\", 'Dubbed': 'Spanish', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: grandspn really like the movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nim's Island\nReview Date: 2015/04/08\nStore: Jodie Foster  (Actor),     Gerard Butler  (Actor),     Jennifer Flackett  (Director, Writer),     Mark Levin  (Director, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', \"Anything can happen on Nim's Island, a magical place ruled by a young girl's imagination. It is an existence that mirrors that of her favorite literary character, Alex Rover- the world's greatest adventurer. But Alexandra, the author of the Rover books, leads a reclusive life in the big city. When Nim's father goes missing from their island, a twist of fate brings her together with Alexandra. Now, they must draw courage from their fictional hero, Alex Rover, and find strength in one another to conquer Nim's Island.\", 'Amazon.com', \"Adventure doesn't always begin with pirates on the high seas or explorers deep in the desert; sometimes it starts with an idyllic life on a private island in the middle of the South Asiatic Sea. For 11-year old Nim (Abigail Breslin) and her father and microbiologist Jack Russo (Gerard Butler), life is perfect thanks to their love of nature, Jack's mechanical ingenuity, and regular deliveries via supply ship. Loneliness is never an issue for Nim because of her special friendships with Selkie the sea lion, Galileo the pelican, and Freddie the iguana and her education is intensive, if rather unique. Adventure and imagination are ways of life for Nim whether she's heading out to sea to help her father collect plankton specimens, playing soccer on the beach with Selkie, or delving into the latest Alex Rover adventure novel, but everything changes when Jack departs on the boat for a two-night expedition to collect plankton specimens and gets caught in an unexpected storm. Alone on the island, Nim begins to worry about her father's safety as well as her own and, through a chance email, connects with Alex Rover (Jodie Foster) whom she begs to come help find her father. Problem is, author Alexandra Rover is an unbalanced big city shut-in who's afraid to leave her townhouse, not the fearless adventure hero portrayed in her books. Nim, Alexandra, and Jack embark upon the adventures of a lifetime in which each must overcome his or her own fears and perceived powerlessness and limitations in order to grow and help one another. The question is; can each prevail against his or her own insecurities and the fury of nature? Based on the novel\", \"Nim's Island\", \"by Wendy Orr, Nim's Island is first and foremost a captivating adventure full of suspense and peril which also offers a touching look at the love between a father and daughter. (Ages 7 and older)\", '--Tami Horiuchi', 'Beyond', 'Nim\\x92s Island', 'on DVD', 'Mr. Magorium\\x92s Wonder Emporium', 'on DVD', 'Horton Hears a Who!', 'on DVD', 'Alvin and the Chipmunks', 'on DVD', 'Stills from', 'Nim\\x92s Island', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2252764DVD', 'Director': 'Jennifer Flackett, Mark Levin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Full Screen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 5, 2008', 'Actors': 'Jodie Foster, Gerard Butler, Abigail Breslin, Michael Carman, Mark Brady', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Jennifer Flackett, Joseph Kwong, Mark Levin, Paula Mazur, Wendy Orr', 'Number of discs': '1'}\nReview Text: good kids movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr. Seuss' The Lorax [DVD]\nReview Date: 2015/07/31\nStore: Danny DeVito  (Actor),     Ed Helms  (Actor),     Chris Renaud  (Director),     Kyle Balda  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', \"The imaginative world of Dr. Seuss comes to life like never before in this visually spectacular adventure from the creators of Despicable Me! Twelve-year-old Ted will do anything to find a real live Truffula Tree in order to impress the girl of his dreams. As he embarks on his journey, Ted discovers the incredible story of the Lorax, a grumpy but charming creature who speaks for the trees. Featuring the voice talents of Danny DeVito, Ed Helms, Zac Efron, Taylor Swift, Rob Riggle, Jenny Slate, and Betty White, Dr. Seuss' The Lorax is filled with hilarious fun for everyone!\", 'Bonus Content:', 'Seuss to Screen', 'Seuss to Screen', 'Seuss It Up!', 'Seuss It Up!', \"Once-ler's Wagon\", \"Once-ler's Wagon\", 'Feature Commentary with Director Chris Renaud & Co-Director Kyle Balda', 'Feature Commentary with Director Chris Renaud & Co-Director Kyle Balda', ']]>', 'Amazon.com', \"An animated rendition of Dr. Seuss's classic book about the threat of industrialization to nature,\", 'The Lorax', 'opens in Thneedville--a town never depicted in the original book. Thneedville is an artificial place, made primarily from plastic. It sports inflatable trees, fast cars, and air quality so poor that the residents are forced to purchase bottled fresh air. In another new twist to the story, 12-year-old Ted (Zac Efron) discovers that his crush Audrey (Taylor Swift) wants nothing more than to see a long-extinct Truffula Tree, so he sets out to impress her by finding one. Since there are no real trees in Thneedville, Ted acts on the crazy stories of his grandmother (Betty White), venturing beyond the city\\'s walls into the desolate wasteland to locate a mysterious creature called the Once-ler (Ed Helms). Here the story and animation begin to more closely follow the book. Ted discovers the grumpy recluse, who reluctantly begins to tell him a tale about a once-perfect landscape filled with beautiful Truffula Trees and cute frolicking animals--a landscape now decimated by one greedy young man\\'s insatiable appetite for profit. The beauty and wonder of the Truffula forest and its creatures are right out of Dr. Seuss\\'s illustrations. While the forest creatures may not be directly referred to as Brown Bar-ba-loots, Swomee-Swans, and Humming-Fish, the cute little bears, funny-looking ducks, and especially charming trio of singing fish are instantly recognizable. They serve, as they do in Dr. Seuss\\'s book, to add just the right amount of humor and levity to what would otherwise be a pretty heavy-handed message from the Lorax (Danny DeVito) about environmental preservation. Ted\\'s hormonal instincts to impress Audrey slowly begin to take a back seat to the plight of the lost trees and animals, and the Once-ler\\'s assertion that \"Unless someone like you cares a whole awful lot, nothing is going to get better\" rings true by the end of the film. The abundance of original music is a nice and unexpected addition to the story, though why neither Efron nor Swift actually gets to sing is perplexing. (Ages 5 and older)', 'Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation, Comedy', 'Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Taylor Swift, Ed Helms, Chris Renaud, Danny DeVito, Kyle Balda, Zac Efron, Betty White', 'Initial release date': '2012-08-07', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': '274280', 'Director': 'Chris Renaud, Kyle Balda', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'August 7, 2012', 'Actors': 'Danny DeVito, Ed Helms, Zac Efron, Taylor Swift, Betty White', 'Subtitles': 'English, French, Spanish', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: great kids movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alvin Chipmunks Triple Feature (Alvin and the Chipmunks / Alvin and the chipmunks: The squeakquel / Alvin and the chipmunks: Chipwrecked)\nReview Date: 2015/11/11\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Contains Alvin & the Chipmunks, Alvin & the Chipmunks the Squeakquel, and Alvin & the Chipmunks Chipwrecked']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Childrens', 'Format': 'NTSC', 'Contributor': 'ALVIN & THE CHIPMUNKS 1/2/3', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': '379683', 'Media Format': 'NTSC', 'Release date': 'October 8, 2013', 'Studio': '20th Century Fox', 'Number of discs': '3'}\nReview Text: fun little movies for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hotel Transylvania 2\nReview Date: 2016/03/01\nStore: Genndy Tartakovsky  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['In this all-new monster comedy adventure, everything seems to be changing for the better at Hotel Transylvania! However, Drac is worried that his adorable half-human, half-vampire grandson, Dennis, isn’t showing signs of being a vampire. So while Mavis is on vacation, things get batty as Drac enlists his monster friends Frank, Murray, Wayne, and Griffin to put Dennis through a “monster-in-training” boot camp! In theaters September 25.', 'Contact Sony customer service and receive a free digital code.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family, Animation', 'Format': 'NTSC, Ultraviolet, Ultraviolet', 'Contributor': 'Michelle Murdocca, Genndy Tartakovsky, Sony Pictures Animation Inc.', 'Language': 'English', 'Runtime': '1 hour and 29 minutes', 'Digital Copy Expiration Date': 'December 31, 2019', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Audio Description': 'English', 'Item model number': '35219993', 'Director': 'Genndy Tartakovsky', 'Media Format': 'NTSC, Ultraviolet, Ultraviolet', 'Run time': '1 hour and 29 minutes', 'Release date': 'January 12, 2016', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Michelle Murdocca', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: good kids movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hotel Transylvania (Blu-ray / DVD)\nReview Date: 2016/03/01\nStore: Adam Sandler  (Actor),     Kevin James  (Actor),     Genndy Tartakovsky  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Welcome to Hotel Transylvania, Dracula’s lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula (Adam Sandler) has invited all his best friends – Frankenstein and his wife, the Mummy, the Invisible Man, the Werewolf family, and more – to celebrate his beloved daughter Mavis’s (Selena Gomez) 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!', 'Amazon.com']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family, Animation, Comedy', 'Format': 'Blu-ray, AC-3, Animated, Color, Dolby, Subtitled, Widescreen, Dubbed', 'Contributor': 'Adam Sandler, Kevin James, Selena Gomez, Andy Samberg, Genndy Tartakovsky', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Audio Description': 'Portuguese', 'Item model number': 'CTR41370BR', 'Director': 'Genndy Tartakovsky', 'Media Format': 'Blu-ray, AC-3, Animated, Color, Dolby, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Adam Sandler, Kevin James, Andy Samberg, Selena Gomez', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: good kids movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Home [Blu-ray]\nReview Date: 2016/03/01\nStore: Steve Martin  (Actor),     Jennifer Lopez  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['From the creators of How to Train Your Dragon and Shrek comes the hit comedy of the year featuring the superstar voice talents of Jim Parsons, Rihanna, Steve Martin and Jennifer Lopez. When Oh, a lovable misfit from another planet, lands on Earth and meets a teenage girl named Tip, the two unlikely friends embark on the greatest journey of all time...the journey Home.Bonus Content:', 'Best Party Ever!', 'Best Party Ever!', \"Oh's Party Place\", \"Oh's Party Place\", \"Oh's Party Planning Tips\", \"Oh's Party Planning Tips\", \"Oh's Costume Party\", \"Oh's Costume Party\", 'Short Boovies', 'Short Boovies', 'Deleted Scenes', 'Deleted Scenes', 'Be An Artist!', 'Be An Artist!', \"Oh's Other Extras\", \"Oh's Other Extras\", 'Gallery', 'Gallery', 'Theatrical Trailer', 'Theatrical Trailer', 'The World of DreamWorks Animation', 'The World of DreamWorks Animation']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, DVD Movie, Animation, Blu-ray Movie, Comedy, Action & Adventure', 'Format': 'Blu-ray, Animated, Color, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Jennifer Lopez, Rihanna, Steve Martin, Jim Parsons, Matt Jones', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), Italian (DTS 5.1), Dutch (DTS 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1), French Canadian (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Flemish (DTS 5.1)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 2.4 Ounces', 'Item model number': 'BRD100472', 'Media Format': 'Blu-ray, Animated, Color, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 28, 2015', 'Actors': 'Steve Martin, Jennifer Lopez, Matt Jones, Jim Parsons, Rihanna', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: wonderful movie about friends and family\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alpha And Omega [DVD]\nReview Date: 2016/06/14\nStore: Hayden Panettiere  (Actor),     Justin Long  (Actor),     Anthony Bell  (Director),     Ben Gluck  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Product Description', 'Come along on the ultimate road-trip adventure that will leave the whole family howling with laughter! When Kate, a take-charge “Alpha” wolf, and Humphrey, a laid-back “Omega” wolf, get snatched by park rangers and relocated halfway across the country, the two must set off on an incredible journey home! With the help of a goofy golfing goose and his quacky duck caddy, Kate and Humphrey won’t let anything stop them – prickly porcupines, grumpy bears, even a speeding locomotive – from getting back to Jasper Park in time to help save their pack from rival wolves! And along the way, Kate and Humphrey learn that even though they are complete opposites, they make a pretty good team! It’s a thousand miles of fun in this wildly entertaining journey the whole pack can enjoy together!', 'Amazon.com', 'Love is blind to the rules of tradition, opposites attract, and both clichés apply quite nicely to the wolves in', 'Alpha and Omega', \". In the wolf world, the pack values the omega wolves' skill of defusing tense situations with humor just as much as they value the keen leadership skills of the alpha wolves, but tradition dictates that alpha wolves don't mate with omega wolves. So, when the all-business alpha wolf Kate (Hayden Panettiere) and the fun-seeking omega wolf Humphrey (Justin Long) find themselves attracted to one another, the pair resign themselves to a life apart, and Kate agrees to a match with alpha male Garth (Chris Carmack) from a rival pack in order to peacefully merge the two packs into one. But when Humphrey and Kate are tranquilized in their home in Jasper National Forest, Canada, and relocated to Sawtooth Forest far away in Idaho, the two discover that not only can opposites work very well together, but that neither of them can continue to ignore their attraction for the other. The question is, will working together, combined with a little help from a golf-playing goose and his duck caddy, be enough to get the pair all the way back to Jasper National Park before the rival wolf packs tear one another apart at the next full moon? And what will become of their relationship if they do return in time? This animated film is amusing and entertaining, if not particularly outstanding. A lot of the humor is pretty corny and the plot has been done many times before (think\", 'Open Season 2', '), but the characters are likable, the action is pretty good, and who can resist chuckling at images like a retired, golf-playing French-Canadian goose or the distractive powers of a good cupcake? (Ages 5 and older)', '--Tami Horiuchi']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 0.71 Ounces', 'Item model number': 'LGT29334DVD', 'Director': 'Anthony Bell, Ben Gluck', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 18 minutes', 'Release date': 'January 11, 2011', 'Actors': 'Hayden Panettiere, Justin Long', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alpha & Omega 2: A Howl-iday Adventure [DVD + Digital]\nReview Date: 2016/06/14\nStore: Dominique Monfery  (Director),     Richard Rich  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Kate & Humphrey and their three wolf cubs (Smokey, Claudette and Runt) are happily preparing to celebrate their first winter holidays together when their smallest cub, Runt, mysteriously disappears. They must now go on a new journey across the wilderness to find Runt before the winter festivities begin at home.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Family', 'Format': 'NTSC, Ultraviolet', 'Contributor': 'Richard Rich, Dominique Monfery, Crest Animation Productions', 'Language': 'English', 'Runtime': '1 hour and 18 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'LGT44116DVD', 'Director': 'Dominique Monfery, Richard Rich', 'Media Format': 'NTSC, Ultraviolet', 'Run time': '1 hour and 18 minutes', 'Release date': 'October 7, 2014', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alpha And Omega 3: The Great Wolf Games [DVD + Digital]\nReview Date: 2016/06/14\nStore: Richard Rich  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Join the pack in this wild, warmhearted and totally pawsome adventure starring everyone\\'s favorite alphas and omegas! It\\'s time for \"The Great Wolf Games,\" when all the alphas in the packs set aside their differences for some friendly competition. When an unexpected accident puts many of our pack\\'s star alpha wolves out of commission, a new team is assembled that includes forest friends not in the pack. Can Coach Humphrey lead his ragtag group of \"underdogs\" to victory? Find out in this thrilling movie that will leave you howling for more!']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Family', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Richard Rich, Crest Animation Productions', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': '32974681', 'Director': 'Richard Rich', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '45 minutes', 'Release date': 'March 10, 2015', 'Subtitles': 'English', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rio\nReview Date: 2016/06/14\nStore: Jesse Eisenberg  (Actor),     Anne Hathaway  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'This comedy adventure centers on Blu, a flightless macaw who acts more human than bird. When Blu, the last of his kind, discovers there’s another – and that she’s a she – he embarks on an adventure to magical Rio. There, he meets Jewel and a menagerie of vivid characters who help Blu fulfill his dream and learn to fly.', 'Amazon.com', 'A classic tale of self-discovery, romance, and adventure,', 'Rio', \"is the story of Blu, a flightless macaw who was taken from the forests of Rio de Janeiro as a young bird and raised by a kind girl in a small Minnesota town. When an ornithologist comes to town and informs Blu's now-grown owner Linda that Blu is the last male of his species, Blu and Linda return to Rio so that Blu can mate with a feisty female named Jewel. Thus begins an adventure in which Blu encounters everything from the complexities of courtship and love, to thugs involved in an exotic animal theft ring, strange new friendships--including one with an overly friendly slobbering bulldog--and a crazy ride through a Carnaval parade. Blu and Linda both mature as a result of their journey in Rio, and love ensures that life will never be quite the same for either ever again. The animation in\", 'Rio', \"is quite impressive, the characters are endearing, the Brazilian music is very appealing, and the star-studded voice cast includes Anne Hathaway, Jesse Eisenberg, Will i Am, Wanda Sykes, Jane Lynch, George Lopez, and Jamie Foxx. While the story doesn't really offer anything new--instead playing much like a rehashing of some of the major plot points from movies like\", 'Madagascar', ',', 'Finding Nemo', ', and', 'Babe', \"--that doesn't mean the film isn't perfectly entertaining for both kids and adults. (Ages 6 and older)\", '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 4 Ounces', 'Item model number': '6504984190', 'Media Format': 'Multiple Formats, Animated, Color, Dubbed, Dolby, Subtitled, Widescreen, NTSC, AC-3', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 2, 2011', 'Actors': 'Jesse Eisenberg, Anne Hathaway', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: good movie for kids\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe purchase history reveals a strong preference for children's movies, particularly those that are animated and educational. Consistently high ratings (mostly 4.5 and above) demonstrate a positive sentiment towards engaging, family-friendly content. Common themes include adventurous narratives featuring curious characters, often set in educational contexts (e.g., nature, holidays). \n\nThe buyer exhibits a clear affinity for popular series and characters, favoring characteristics like imaginative storytelling and fun learning experiences. Quality is prioritized, as reflected in consistently high ratings across products from trusted educational content creators, suggesting sensitivity to brand reputation. Furthermore, pricing appears moderate; the selections indicate a willingness to invest in quality films rather than seeking the lowest-priced options. \n\nOverall, the core preferences revolve around captivating, educational animations for children, emphasizing adventure, emotional growth, and relatable experiences that resonate with family values. The customer demonstrates a desire for content that combines entertainment with life lessons, indicative of both parental engagement and an appreciation for high-quality children's media.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Five Stars",
    "text": "good movies fpr kids",
    "images": [],
    "asin": "B00JK531ES",
    "parent_asin": "B00JK531ES",
    "user_id": "AFA5B5IBMHM5XZKSSA5MP3PBEGPA",
    "timestamp": "2016-06-14 14:14:23",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Rio 2",
    "average_rating": 4.7,
    "rating_number": 21136,
    "features": [],
    "description": [
      "Welcome to the jungle of fun! The cast of the animated hit comedy Rio returns - along with a new flock of all-star voice talent, including Bruno Mars, Kristin Chenoweth and more - in this high-flying sequel for the whole family. The party continues when Blu (Jesse Eisenberg), Jewel (Anne Hathaway) and their three kids take a walk on the wild side and embark on a colorful, comical, music-filled journey through the Amazon. As Blu tries to fit into his new surroundings, he goes beak-to-beak with the villainous Nigel, and meets the most fearsome adversary of all: his father-in-law!"
    ],
    "price": 6.28,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51NZSgYPzSL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51NZSgYPzSL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91850GqE2+L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61QPGjL4FwL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61QPGjL4FwL.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/815RivQPfbL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Jesse Eisenberg  (Actor),     Anne Hathaway  (Actor),     Carlos Saldanha  (Director)    &                   0                  more   Rated:    G    Format: DVD",
    "categories": [
      "Movies & TV",
      "Studio Specials",
      "20th Century Fox Home Entertainment",
      "All Fox Titles"
    ],
    "details": {
      "Genre": "Animation",
      "Format": "Multiple Formats, Color, Widescreen, NTSC, Animated",
      "Contributor": "Jesse Eisenberg, Anne Hathaway, Jemaine Clement, Carlos Saldanha",
      "Language": "English",
      "Runtime": "1 hour and 41 minutes",
      "Aspect Ratio": "2.40:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "G (General Audience)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.4 Ounces",
      "Item model number": "2285390",
      "Director": "Carlos Saldanha",
      "Media Format": "Multiple Formats, Color, Widescreen, NTSC, Animated",
      "Run time": "1 hour and 41 minutes",
      "Release date": "July 15, 2014",
      "Actors": "Jesse Eisenberg, Anne Hathaway, Jemaine Clement",
      "Dubbed": "Spanish, French",
      "Subtitles": "English, Spanish, French",
      "Studio": "20th Century Fox",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}