{
  "user_id": "AGYYE36OIMMHOBP4DK4YPEYWZHJA",
  "summary": "=== Purchase Information ===\nProduct Title: Dancing With The Stars: Dance Off The Pounds\nReview Date: 2010/08/29\nStore: Kym Johnson  (Actor),     Lacey Schwimmer  (Actor),     Cal Pozo  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Each season, audiences watch in amazement as stars shrink down and shape up on ABC’s DANCING WITH THE STARS. Now you can share their weight-loss success and dance off the pounds with three different cardio dance routines—Swing, Jive and Quickstep—led by pro dancers Kym, Lacey and Dmitry. Each routine gets your body warmed-up with the signature moves of the featured dances before progressively adding on to create complete, calorie-blasting workouts – so you can learn with ease and get dancer-fit all at once. Join the fat-burning fun and dance your way to a superstar body!']\nAverage Rating: 4.2\nProduct Details: {'Aspect Ratio': '1.78:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '69808452008', 'Director': 'Cal Pozo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '54 minutes', 'Release date': 'December 1, 2009', 'Actors': 'Kym Johnson, Lacey Schwimmer, Dmitry Chaplin', 'Language': 'Unqualified', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nReview Text: Granted, I am new to this dance workout stuff - but this vid made me feel as clumsy as an elephant in toe shoes.  I also have no interest in Dancing with the Stars, so I wasn't caught up in the, \"OMG! Dmitry is teaching me how to dance!\" thing.<br /><br />Pros:  The dances might be fun, if you can figure out how to do them.<br /><br />Cons: There is little in the way of instruction, and the *instructors* seem to assume you can catch on after one quick demonstration - which is generally badly explained and poorly filmed. I am sorry, but saying, \"Okay? Got it? Let's do it to tempo...\" each time a step is shown does not count as *teaching* a step...<br /><br />A dancer may know the moves merely by name, but I doubt a dancer has need of a video like this.<br /><br />The instructors seem to have a limited repertoire of comments - I quickly tired of hearing, \"Excellent... Excellent.  That's great!  Excellent!\"<br /><br />There is NO warm-up - which could result in injury to someone who does not understand the importance of limbering up your muscles before launching into a workout routine.<br /><br />The cool down is limited and rather boring.  It felt tacked on and rather useless.<br /><br />All in all, I much prefer my other dance workout vids over this one.<br /><br />And I have to say, these female dancers have some of the most well endowed chests I've seen on slender dancer types.\nReview Title: Too Little Instruction\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 10 Minute Solution: Hip Hop Dance Mix\nReview Date: 2011/04/19\nStore: Kristin Jacobs  (Actor),     Andrea Ambandos  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['Ten minutes is all it takes to dance your way to a slimmer, more sculpted body using the latest hip-hop moves. This exercise program features five dance workouts that are easy to fit into any busy schedule and, more importantly, fun to do!']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Kristin Jacobs, Andrea Ambandos', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5457526', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '56 minutes', 'Release date': 'August 1, 2009', 'Actors': 'Kristin Jacobs', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: Although I generally enjoy the \"10 Minute\" series, this one just wasn't for me.  I  have bad knees, and there are too many twisting moves in these routines that could cause me injury.  I noted that the days after doing this workout, my knees would ache. I finally put two and two together and started substituting for those moves, but that kind of defeats the purpose.<br /><br />I also found I never worked up much of a sweat with this one and did not hit my target heart rate.  This is likely due to the fact I could never quite pull off the moves, what with my knees, my carpeted floor, and the fact that I am not coordinated enough to get the upper and lower body moves to mesh well.<br /><br />Not only was this workout a disappointment physically, I didn't seem to have as much fun doing these moves as I do some of my other workouts.  The dances just didn't flow for me.  I seem to do much better with my other 10 Minute mixes.  There is nothing wrong with the instructor. She is enthusiastic and fresh (if a bit fast paced), but this was just not the right DVD for me.  If you recognize yourself in my description, you might want to steer clear.\nReview Title: Not for me\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leslie Sansone: 5 Boosted Miles\nReview Date: 2015/12/29\nStore: Leslie Sansone  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Are you ready to BOOST the results of your walk? It’s EASY and FUN! We recommend that you start with the Bonus SESSION . This is where Leslie shows you the Top 10 Walk Moves and teaches you how to BOOST each one. After that, you can dive right into the 5 miles—in any way that you like. You can walk a gentle mile and then a boosted mile. You can walk two miles without boosting anything and then boost the next two. Or you can even opt to boost only some of the moves within each mile. You have the freedom to do whatever is right for you! Walkers that range from beginners all the way to advanced can all get a great workout! AND with the five different 1-mile sessions, you can also customize your workout time. If you have 30 minutes for your Monday walk, you can do two miles. If Tuesday is busy, sneak in a single 15-minute mile to keep yourself on track. Then for the days when you do have the time and the energy, you can walk all 5 miles and BOOST AWAY! Customize your workout time AND your workout intensity. This is YOUR walk!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Leslie Sansone', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35219365', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 29 minutes', 'Release date': 'November 10, 2015', 'Actors': 'Leslie Sansone', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: Another great Leslie DVD.  It has some of my favorite elements.  I like the mile by mile structure, so I can play one mile, or combine them.  I appreciate the high energy of the walkers, the fact that Leslie has someone show a modified lower impact version, the ability to play it with or without the instruction/verbal track, and the music... I think this is some of the best music on her DVDs if, like me, you enjoy electronica and dance techno style. But my favorite element is likely the color changes in the outfits.  I like that each mile, the costumes change to follow a shared color scheme - I love details like that and I LOVE color and design... (Even the lighting on the Walk At Home sign changes every mile!) My favorite Leslie DVDs tend to be the ones with color embellishments, like the HIIT Dance Party walks and the color miles on the Ultimate 5 day Walk Plan. The moves are traditional Leslie, so nothing much new here, except the use of short high energy boosts of various types - but I find that if you've done one Leslie workout, you have a pretty good idea of the types of moves you will need to be able to accomplish.  She does keep switching things up, so I never get bored, but everything is pretty easy to master. On the downside, the warmup and cool down are both inserted into the first and last miles respectively, so if you just choose something like mile 3, there is not warm up or cool down.  I prefer when the warm up and the cool down are separate so I can use them with any combination of miles.  Also, Leslie seems to do more chatting in this one, moving around and talking to everyone while in the middle of the workout rather than leading the steps.  That's okay with me on some level as I always enjoy getting to know the other walkers a bit - it is amazing how much personality can come through just by watching someone walk! - but it seems a bit heavy handed this time.  Michael was the other distraction. He is a new backup walker, and seems a bit of a class clown, wanting to be the focus of attention.  It is obvious he and his wife are a high energy couple and were having a great time.  I admire their sense of fun and energy, but I also found his antics a bit wearisome after a while.  Still, I will probably just learn to ignore them more as I watch the workout more often.  Maybe this different approach is a marketing strategy, trying to appeal to a younger audience or something.  I certainly have noticed a that Leslie's videos have changed through out the years, become more colorful and playful, with a better musical soundtrack (in my opinion)  and with younger walkers - so maybe this is more of the same.\nReview Title: Another winner!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DANCE That WALK – 5000 Steps in One Easy Low Impact Walking Workout DVD\nReview Date: 2016/07/11\nStore: Gina Buber  (Actor, Director),     Ella Charles  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Walking is the ultimate form of low-impact exercise for people of all ages and fitness levels.', 'But, walking can be boring, as well as weather and busy schedules can make it hard to get outside or fit a cardio workout into your day. So, we created', 'DANCE That WALK!', \"This 45 minute DVD from SMILE combines our favourite LATIN & BALLROOM dance moves with easy low impact walking, turning it into a fun new WALKOUT, that will get you burning those calories, boosting your daily step count, and most importantly it’s easy to follow! We want to you to think less and move more! With only 4 dance moves per track, and walking as a base, you won't spend your time learning, you’ll spend your time sweating!  Aussie creator Gina B uses her flare and pro ballroom dancing background, to bring you a fun DVD where you’ll be rocking to the jive, cha cha, samba and many more all in this 45min WALKOUT. With an Easy to use DVD menu, you can play all our tracks at once or choose your favourites!  DANCE That WALK is\", 'suitable for all ages, shapes, sizes and fitness levels.', 'Ideal for active older adults, you will be walking and dancing your way to a fitter, more fabulous YOU!  Need more convincing why you should DANCE That WALK?', 'Here are just a few benefits you can enjoy from our LOW IMPACT WORKOUT:', '- Dancing can stimulate your mind and make you feel energised; keep your reflexes, memory and coordination sharp! - Walking can Improve Circulation, Improve Your Fitness And Increase Cardiovascular Health! - Burn Calories & Boost your daily step count: with over 5000 steps, it’s a great way to control your weight or lose those extra pounds - Walking is LOW IMPACT And Easy On Your Joints - Allows everyone to workout from the comfort of your home anytime!  So if you want to feel fitter, improve your coordination and burn those calories by boosting your daily step count, then this workout is for you!']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 0.35 inches; 3.2 Ounces', 'Director': 'Gina Buber, Ella Charles', 'Media Format': 'NTSC', 'Run time': '45 minutes', 'Actors': 'Gina Buber', 'Studio': 'Third Tree Creatives', 'Country of Origin': 'Australia', 'Number of discs': '1'}\nReview Text: I want to make it clear that this is a fun little workout with a GREAT mix of musical selections, but I wish I had realized that it is as low impact as it is.  I am in my mid 50's and used to low to intermediate workouts but this one did not challenge me at all.  For example, I love a good Leslie Sansone workout but steer away from overly strenuous or high impact routines.  I think with this one, I probably would have gotten more of a workout sweeping my porch.  However, it makes a great workout for someone new to exercising, someone with limited mobility or an elderly person who wants a basic workout without the risk of injury.  I gave it to my mother and I think she will enjoy it - some of the music will bring back memories for her!\nReview Title: Great for certain exercisers, but not going to burn many calories.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Build Balance and Inner Strength, 3 Low Impact, Core Cardio Workouts, Walk Strong 2.0 with Jessica Smith\nReview Date: 2016/08/24\nStore: Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Lose your shoes to gain balance, postural alignment, core strength, range of motion -- even foot and ankle strength and mobility with these low impact, fusion-style routines. Feel free to mix and match these sessions into your weekly workout schedule (we recommend alternating them with your favorite cardio, strength and flexibility training routines 2-4 days a week). Check out our other titles in this series, our “Walk STRONG: Boost Metabolism and Muscle” and “Walk STRONG: Burn Fat and Have Fun” for some great options! You can also use these workouts in conjunction with our “Walk STRONG: Total Transformation 6 Week System\" (also available on Amazon).WORKOUT #1: CORE CONTROL - Fusing together elements of Pilates, dance and yoga, this flowing, low impact cardio session incorporates standing only abs work for a stronger center and a surprising amount of sweat.WORKOUT #2: POISE AND GRACE - Using a single set of light dumbbells, this total body sculpting session builds better posture, body awareness and functional strength.WORKOUT #3: BALANCE AND AGILITY - Better your balance and improve your coordination with this total body strength and cardio flow that incorporates the use of a flat resistance band for added challenge.Our modifier Debbie, age 60, offers options throughout each workout.About Your Instructor: Jessica Smith has over 15 years of experience as a certified trainer, instructor and wellness coach.']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.35 x 0.63 inches; 1.08 Pounds', 'Media Format': 'DVD', 'Studio': 'In Wellness Systems LLC'}\nReview Text: This one is deceptive.  It starts off so gently, I made the mistake of thinking it would be a cake walk... was I wrong!  Each of these workouts really did stretch me, and I ended up winded and sweaty!  Granted, I am not a heavy duty exercise queen, but I work out daily, even if for a short time and I am in pretty good shape.  This was a nice alternative to my usual cardio walk.  I like that each session was different and had a different focus as I tend to get &#34;bored&#34; with my workout DVDs fairly quickly and when I get bored, I end up making excuses not to exercise... This one has enough variety to keep me interested for a while.  I especially liked the second session that almost had a &#34;mindfulness&#34; feel to it - a Yoga, pilates, Thai chi kind of thing going on - relaxing, yet invigorating and challenging. Jessica and her mom work well together and are fun to watch - Jessica is encouraging while still being &#34;genuine&#34; and I don't get the forced &#34;cheerful cheerleader&#34; vibe I do from some other instructors. It can't be easy to encourage folks to do something many of us do not necessarily enjoy, so kudos to her for managing to do so and to do it without repeating the same platitudes like &#34;excellent&#34;, &#34;great&#34;, or &#34;good&#34; over and over ad nausea.  I purchased this one as a test, to see if I might like the whole series - now I definitely will have to check out the other DVDs!\nReview Title: Two thumbs up!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Walk On: 3-DVD Set: 6, 30 Minute Walking Workouts\nReview Date: 2018/05/30\nStore: Jessica Smith  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Get our classic \"Walk On: 3 DVD Super Set\" 2014 collection! Whatever the weather is in your neck of the woods you can count on sunshine and blue skies in our videos. These workouts were all filmed on location in sunny Florida with a beautiful view of the bay so you can feel like you are striding right outside with us. This 3-DVD Set Includes 6, 30-Minute Walks, or 3 hours of outdoor walking fun:', 'DVD #1: Walk On: Strength and Balance', 'STRIDE & STRENGTH [30 Minutes]: Burn fat and build metabolism boosting lean muscle mass with this two-in-one session! Burn more calories in less time with this maximum results routine that couples HIIT (high intensity interval) cardio training with circuits of strength exercises to make every second of your workout count. FUSION WALK [30 Minutes]: Balance your body with this flowing, feel-good endurance walk is done barefoot (shoes may be worn if preferred) in order to fully engage and strengthen the muscles of the feet and ankles.', 'DVD #2: Walk On: Dance Walk', 'LATIN DANCE WALK [30 Minutes]: Salsa, shimmy and shake off the pounds with this spicy walking workout that uses simple steps to keep your heart rate elevated (and your mind at ease). DANCE WALK [30 Minutes]: Twist, shout and disco dance away the calories with this upbeat walk that mixes together different styles from various decades for a walk that feels more like a party than a work out!', 'DVD #3: Walk On: Tone Your Trouble Zones', 'BUNS AND THIGHS WALK [30 Minutes]: Blast off fat to slim your hips, buns and thighs with this multi-tasking walk that incorporates lower body toning for better, more targeted results. FLAT ABS WALK [30 Minutes]: Walk off weight and shrink your waist by burning calories and developing strong, pulled-in flat abs at the same time with this tummy-targeting walk.']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5 x 0.5 inches; 6.07 Ounces', 'Media Format': 'Full Screen', 'Run time': '180 minutes', 'Actors': 'Jessica Smith', 'Studio': 'In Wellness Systems LLC', 'Number of discs': '3'}\nReview Text: Love Jessica's workout routines.  Perfect for someone who wants to keep in shape, but is not an exercise guru... at my age (mid 50s) I just need to keep moving and keep my metabolism hyped. I don't want an exercise regime that will wear me out or run me down. These work great.\nReview Title: Love Jessica's workout routines\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leslie Sansone: Miracle Miles 5 DVD Set featuring Free Super-Sculpting Chain Link Band in Assorted Color\nReview Date: 2019/07/07\nStore: Leslie Sansone  (Actor),     -  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: [\"The Walk at Home program from Leslie Sansone that millions love now offers a super charged system to get results faster and easier than ever: MIRACLE MILES featuring the NEW Chain Link Band! It's the all new faster way to walk off weight at home! For over 25 years, our mission has been to spread the good news that just minutes a day of brisk walking is the cure for so many of our health issues...and it's one of the most effective tools in weight loss! Walk at home workouts are multi muscle, calorie torching, posture perfecting, range of motion improving, health club quality workouts and you just can't beat this way to walk for health for weight loss! The MIRACLE MILES set includes 5 DVD workouts; each Mile includes an ''all-in-one'' sequence using cardio, strength training and flexibility! The secret is in our included brand NEW Chain Link Band...and now there's more: Belly Slimming while you WALK; Thigh and Backend Slimming while you WALK; Tone and Trim the Arms while you WALK; Choose a 1 Mile, 2 Mile, 3 Mile, 4 Mile or 5 Mile Workout! That's 15 BIG Miles of Fitness that you can mix and match anyway that suits your schedule! PLUS 3 bonus toning sessions to target Abs, Legs, Arms, and Total Body! The most effective fitness walking system ever from Leslie Sansone's Walk at Home program! This 15 mile system is easier than ever, the variety makes it more fun than ''boring'' walks and more effective than a stroll around the neighborhood. You'll love our all in one system that gives you every essential of fitness: cardio... strength...flexibility... all in one! CHAIN LINK BAND COMES IN ASSORTED COLORS.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Dolby, NTSC, Widescreen, Anamorphic', 'Contributor': 'Leslie Sansone, -', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Qsweet', 'Media Format': 'Dolby, NTSC, Widescreen, Anamorphic', 'Run time': '4 hours and 5 minutes', 'Release date': 'November 20, 2018', 'Actors': 'Leslie Sansone', 'Studio': 'Bayview Films', 'Number of discs': '5'}\nReview Text: I own several of Leslie's workout DVDs and although they all have fairly similar steps and styles, they are also varied enough I do not get bored.  I also have other workout DVDs which require more concentration to keep up with the numerous steps - but I always know that if I am just not in the mood to fuss with steps, I can pull out one of my Leslie DVDs and get a good workout without the need to learn new moves.  I was a little hesitant to buy this new collection because I thought it would just be one mile on the first DVD, then that same mile with a new one for the second DVD, then the first two and a new third mile, etc.  But it turns out that each DVD has completely NEW miles and you can play them individually or in a sequence.  So in essence, you are getting a wide selection of miles with this set - and they all follow a similar sequence (slower pace - boosted fast pace - miracle mile toning session) so you get variation as well as familiarity. This is great for someone like me, because my time to work out varies a great deal and it is nice to be able to pick and choose what I need for the day.  The music is good, if somewhat repetitive and the use of the \"Miracle Miles band\" adds some basic toning work to the walk... all in all I was very pleased with this set and will get a lot of use out of it.  Thanks Leslie and team!\nReview Title: Lots of variety!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Feel Good Fusion with Jessica Smith: Barefoot Cardio, Strength, Pilates, Barre and Yoga Mix DVD, Fat Burning, Sculpting, Toning Low Impact Exercise (No Floor Work)\nReview Date: 2019/07/07\nStore: Jessica Smith  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Surrounded by blue skies and sunshine with the ocean as our backdrop, these two barefoot routines develop balance, coordination, strength, endurance, but overall, a sense of well-being, enjoyment, and energy! The true key to long-lasting results and benefits of exercise lies with consistency and including workouts like these into your regular plan can help you achieve and maintain your goals over the long term.This floor-work free program contains two complete sessions:Session #1: Fusion Strength (47 Minutes) - Sculpt and build functional strength and stamina while staying in the aerobic zone with the freeing range of motion of light weights and high reps. A set of hand weights (between 2 - 8 lbs, depending on level) is recommended for this routine.Session #2: Flow Cardio (35 Minutes) - Let go of the idea that every workout has to be all-out effort, all the time — this flowing LISS (lower intensity, steady state) cardio session helps build cardiovascular endurance, improve circulation, burn fat and balance out the stress of high-intensity training on the body.Approx. Total Run Time: 82 Minutes']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5 x 0.5 inches; 3 Ounces', 'Media Format': 'DVD', 'Run time': '1 hour and 22 minutes', 'Actors': 'Jessica Smith'}\nReview Text: Love the two workouts Jessica presents in this DVD.  Her fusion routines are a perfect blend of cardio and yoga like moves that give me a good workout while keeping the illusion that I am just \"moving to the music\".  Very sneaky, these workouts, but make no mistake - you will sweat!\nReview Title: Great for those days I need to center myself.\nRating: 5.0\n--------------------------------------------------",
  "reference": "Dancing With The Stars: Dance Off The Pounds\nKym Johnson  (Actor),     Lacey Schwimmer  (Actor),     Cal Pozo  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Each season, audiences watch in amazement as stars shrink down and shape up on ABC’s DANCING WITH THE STARS. Now you can share their weight-loss success and dance off the pounds with three different cardio dance routines—Swing, Jive and Quickstep—led by pro dancers Kym, Lacey and Dmitry. Each routine gets your body warmed-up with the signature moves of the featured dances before progressively adding on to create complete, calorie-blasting workouts – so you can learn with ease and get dancer-fit all at once. Join the fat-burning fun and dance your way to a superstar body!']\n{'Aspect Ratio': '1.78:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '69808452008', 'Director': 'Cal Pozo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '54 minutes', 'Release date': 'December 1, 2009', 'Actors': 'Kym Johnson, Lacey Schwimmer, Dmitry Chaplin', 'Language': 'Unqualified', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nGranted, I am new to this dance workout stuff - but this vid made me feel as clumsy as an elephant in toe shoes.  I also have no interest in Dancing with the Stars, so I wasn't caught up in the, \"OMG! Dmitry is teaching me how to dance!\" thing.<br /><br />Pros:  The dances might be fun, if you can figure out how to do them.<br /><br />Cons: There is little in the way of instruction, and the *instructors* seem to assume you can catch on after one quick demonstration - which is generally badly explained and poorly filmed. I am sorry, but saying, \"Okay? Got it? Let's do it to tempo...\" each time a step is shown does not count as *teaching* a step...<br /><br />A dancer may know the moves merely by name, but I doubt a dancer has need of a video like this.<br /><br />The instructors seem to have a limited repertoire of comments - I quickly tired of hearing, \"Excellent... Excellent.  That's great!  Excellent!\"<br /><br />There is NO warm-up - which could result in injury to someone who does not understand the importance of limbering up your muscles before launching into a workout routine.<br /><br />The cool down is limited and rather boring.  It felt tacked on and rather useless.<br /><br />All in all, I much prefer my other dance workout vids over this one.<br /><br />And I have to say, these female dancers have some of the most well endowed chests I've seen on slender dancer types.\nToo Little Instruction\n10 Minute Solution: Hip Hop Dance Mix\nKristin Jacobs  (Actor),     Andrea Ambandos  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['Ten minutes is all it takes to dance your way to a slimmer, more sculpted body using the latest hip-hop moves. This exercise program features five dance workouts that are easy to fit into any busy schedule and, more importantly, fun to do!']\n{'Genre': 'Exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Kristin Jacobs, Andrea Ambandos', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5457526', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '56 minutes', 'Release date': 'August 1, 2009', 'Actors': 'Kristin Jacobs', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nAlthough I generally enjoy the \"10 Minute\" series, this one just wasn't for me.  I  have bad knees, and there are too many twisting moves in these routines that could cause me injury.  I noted that the days after doing this workout, my knees would ache. I finally put two and two together and started substituting for those moves, but that kind of defeats the purpose.<br /><br />I also found I never worked up much of a sweat with this one and did not hit my target heart rate.  This is likely due to the fact I could never quite pull off the moves, what with my knees, my carpeted floor, and the fact that I am not coordinated enough to get the upper and lower body moves to mesh well.<br /><br />Not only was this workout a disappointment physically, I didn't seem to have as much fun doing these moves as I do some of my other workouts.  The dances just didn't flow for me.  I seem to do much better with my other 10 Minute mixes.  There is nothing wrong with the instructor. She is enthusiastic and fresh (if a bit fast paced), but this was just not the right DVD for me.  If you recognize yourself in my description, you might want to steer clear.\nNot for me\nLeslie Sansone: 5 Boosted Miles\nLeslie Sansone  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Are you ready to BOOST the results of your walk? It’s EASY and FUN! We recommend that you start with the Bonus SESSION . This is where Leslie shows you the Top 10 Walk Moves and teaches you how to BOOST each one. After that, you can dive right into the 5 miles—in any way that you like. You can walk a gentle mile and then a boosted mile. You can walk two miles without boosting anything and then boost the next two. Or you can even opt to boost only some of the moves within each mile. You have the freedom to do whatever is right for you! Walkers that range from beginners all the way to advanced can all get a great workout! AND with the five different 1-mile sessions, you can also customize your workout time. If you have 30 minutes for your Monday walk, you can do two miles. If Tuesday is busy, sneak in a single 15-minute mile to keep yourself on track. Then for the days when you do have the time and the energy, you can walk all 5 miles and BOOST AWAY! Customize your workout time AND your workout intensity. This is YOUR walk!']\n{'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Leslie Sansone', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35219365', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 29 minutes', 'Release date': 'November 10, 2015', 'Actors': 'Leslie Sansone', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nAnother great Leslie DVD.  It has some of my favorite elements.  I like the mile by mile structure, so I can play one mile, or combine them.  I appreciate the high energy of the walkers, the fact that Leslie has someone show a modified lower impact version, the ability to play it with or without the instruction/verbal track, and the music... I think this is some of the best music on her DVDs if, like me, you enjoy electronica and dance techno style. But my favorite element is likely the color changes in the outfits.  I like that each mile, the costumes change to follow a shared color scheme - I love details like that and I LOVE color and design... (Even the lighting on the Walk At Home sign changes every mile!) My favorite Leslie DVDs tend to be the ones with color embellishments, like the HIIT Dance Party walks and the color miles on the Ultimate 5 day Walk Plan. The moves are traditional Leslie, so nothing much new here, except the use of short high energy boosts of various types - but I find that if you've done one Leslie workout, you have a pretty good idea of the types of moves you will need to be able to accomplish.  She does keep switching things up, so I never get bored, but everything is pretty easy to master. On the downside, the warmup and cool down are both inserted into the first and last miles respectively, so if you just choose something like mile 3, there is not warm up or cool down.  I prefer when the warm up and the cool down are separate so I can use them with any combination of miles.  Also, Leslie seems to do more chatting in this one, moving around and talking to everyone while in the middle of the workout rather than leading the steps.  That's okay with me on some level as I always enjoy getting to know the other walkers a bit - it is amazing how much personality can come through just by watching someone walk! - but it seems a bit heavy handed this time.  Michael was the other distraction. He is a new backup walker, and seems a bit of a class clown, wanting to be the focus of attention.  It is obvious he and his wife are a high energy couple and were having a great time.  I admire their sense of fun and energy, but I also found his antics a bit wearisome after a while.  Still, I will probably just learn to ignore them more as I watch the workout more often.  Maybe this different approach is a marketing strategy, trying to appeal to a younger audience or something.  I certainly have noticed a that Leslie's videos have changed through out the years, become more colorful and playful, with a better musical soundtrack (in my opinion)  and with younger walkers - so maybe this is more of the same.\nAnother winner!\nDANCE That WALK – 5000 Steps in One Easy Low Impact Walking Workout DVD\nGina Buber  (Actor, Director),     Ella Charles  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Walking is the ultimate form of low-impact exercise for people of all ages and fitness levels.', 'But, walking can be boring, as well as weather and busy schedules can make it hard to get outside or fit a cardio workout into your day. So, we created', 'DANCE That WALK!', \"This 45 minute DVD from SMILE combines our favourite LATIN & BALLROOM dance moves with easy low impact walking, turning it into a fun new WALKOUT, that will get you burning those calories, boosting your daily step count, and most importantly it’s easy to follow! We want to you to think less and move more! With only 4 dance moves per track, and walking as a base, you won't spend your time learning, you’ll spend your time sweating!  Aussie creator Gina B uses her flare and pro ballroom dancing background, to bring you a fun DVD where you’ll be rocking to the jive, cha cha, samba and many more all in this 45min WALKOUT. With an Easy to use DVD menu, you can play all our tracks at once or choose your favourites!  DANCE That WALK is\", 'suitable for all ages, shapes, sizes and fitness levels.', 'Ideal for active older adults, you will be walking and dancing your way to a fitter, more fabulous YOU!  Need more convincing why you should DANCE That WALK?', 'Here are just a few benefits you can enjoy from our LOW IMPACT WORKOUT:', '- Dancing can stimulate your mind and make you feel energised; keep your reflexes, memory and coordination sharp! - Walking can Improve Circulation, Improve Your Fitness And Increase Cardiovascular Health! - Burn Calories & Boost your daily step count: with over 5000 steps, it’s a great way to control your weight or lose those extra pounds - Walking is LOW IMPACT And Easy On Your Joints - Allows everyone to workout from the comfort of your home anytime!  So if you want to feel fitter, improve your coordination and burn those calories by boosting your daily step count, then this workout is for you!']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 0.35 inches; 3.2 Ounces', 'Director': 'Gina Buber, Ella Charles', 'Media Format': 'NTSC', 'Run time': '45 minutes', 'Actors': 'Gina Buber', 'Studio': 'Third Tree Creatives', 'Country of Origin': 'Australia', 'Number of discs': '1'}\nI want to make it clear that this is a fun little workout with a GREAT mix of musical selections, but I wish I had realized that it is as low impact as it is.  I am in my mid 50's and used to low to intermediate workouts but this one did not challenge me at all.  For example, I love a good Leslie Sansone workout but steer away from overly strenuous or high impact routines.  I think with this one, I probably would have gotten more of a workout sweeping my porch.  However, it makes a great workout for someone new to exercising, someone with limited mobility or an elderly person who wants a basic workout without the risk of injury.  I gave it to my mother and I think she will enjoy it - some of the music will bring back memories for her!\nGreat for certain exercisers, but not going to burn many calories.\nBuild Balance and Inner Strength, 3 Low Impact, Core Cardio Workouts, Walk Strong 2.0 with Jessica Smith\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Lose your shoes to gain balance, postural alignment, core strength, range of motion -- even foot and ankle strength and mobility with these low impact, fusion-style routines. Feel free to mix and match these sessions into your weekly workout schedule (we recommend alternating them with your favorite cardio, strength and flexibility training routines 2-4 days a week). Check out our other titles in this series, our “Walk STRONG: Boost Metabolism and Muscle” and “Walk STRONG: Burn Fat and Have Fun” for some great options! You can also use these workouts in conjunction with our “Walk STRONG: Total Transformation 6 Week System\" (also available on Amazon).WORKOUT #1: CORE CONTROL - Fusing together elements of Pilates, dance and yoga, this flowing, low impact cardio session incorporates standing only abs work for a stronger center and a surprising amount of sweat.WORKOUT #2: POISE AND GRACE - Using a single set of light dumbbells, this total body sculpting session builds better posture, body awareness and functional strength.WORKOUT #3: BALANCE AND AGILITY - Better your balance and improve your coordination with this total body strength and cardio flow that incorporates the use of a flat resistance band for added challenge.Our modifier Debbie, age 60, offers options throughout each workout.About Your Instructor: Jessica Smith has over 15 years of experience as a certified trainer, instructor and wellness coach.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.35 x 0.63 inches; 1.08 Pounds', 'Media Format': 'DVD', 'Studio': 'In Wellness Systems LLC'}\nThis one is deceptive.  It starts off so gently, I made the mistake of thinking it would be a cake walk... was I wrong!  Each of these workouts really did stretch me, and I ended up winded and sweaty!  Granted, I am not a heavy duty exercise queen, but I work out daily, even if for a short time and I am in pretty good shape.  This was a nice alternative to my usual cardio walk.  I like that each session was different and had a different focus as I tend to get &#34;bored&#34; with my workout DVDs fairly quickly and when I get bored, I end up making excuses not to exercise... This one has enough variety to keep me interested for a while.  I especially liked the second session that almost had a &#34;mindfulness&#34; feel to it - a Yoga, pilates, Thai chi kind of thing going on - relaxing, yet invigorating and challenging. Jessica and her mom work well together and are fun to watch - Jessica is encouraging while still being &#34;genuine&#34; and I don't get the forced &#34;cheerful cheerleader&#34; vibe I do from some other instructors. It can't be easy to encourage folks to do something many of us do not necessarily enjoy, so kudos to her for managing to do so and to do it without repeating the same platitudes like &#34;excellent&#34;, &#34;great&#34;, or &#34;good&#34; over and over ad nausea.  I purchased this one as a test, to see if I might like the whole series - now I definitely will have to check out the other DVDs!\nTwo thumbs up!\nWalk On: 3-DVD Set: 6, 30 Minute Walking Workouts\nJessica Smith  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Get our classic \"Walk On: 3 DVD Super Set\" 2014 collection! Whatever the weather is in your neck of the woods you can count on sunshine and blue skies in our videos. These workouts were all filmed on location in sunny Florida with a beautiful view of the bay so you can feel like you are striding right outside with us. This 3-DVD Set Includes 6, 30-Minute Walks, or 3 hours of outdoor walking fun:', 'DVD #1: Walk On: Strength and Balance', 'STRIDE & STRENGTH [30 Minutes]: Burn fat and build metabolism boosting lean muscle mass with this two-in-one session! Burn more calories in less time with this maximum results routine that couples HIIT (high intensity interval) cardio training with circuits of strength exercises to make every second of your workout count. FUSION WALK [30 Minutes]: Balance your body with this flowing, feel-good endurance walk is done barefoot (shoes may be worn if preferred) in order to fully engage and strengthen the muscles of the feet and ankles.', 'DVD #2: Walk On: Dance Walk', 'LATIN DANCE WALK [30 Minutes]: Salsa, shimmy and shake off the pounds with this spicy walking workout that uses simple steps to keep your heart rate elevated (and your mind at ease). DANCE WALK [30 Minutes]: Twist, shout and disco dance away the calories with this upbeat walk that mixes together different styles from various decades for a walk that feels more like a party than a work out!', 'DVD #3: Walk On: Tone Your Trouble Zones', 'BUNS AND THIGHS WALK [30 Minutes]: Blast off fat to slim your hips, buns and thighs with this multi-tasking walk that incorporates lower body toning for better, more targeted results. FLAT ABS WALK [30 Minutes]: Walk off weight and shrink your waist by burning calories and developing strong, pulled-in flat abs at the same time with this tummy-targeting walk.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5 x 0.5 inches; 6.07 Ounces', 'Media Format': 'Full Screen', 'Run time': '180 minutes', 'Actors': 'Jessica Smith', 'Studio': 'In Wellness Systems LLC', 'Number of discs': '3'}\nLove Jessica's workout routines.  Perfect for someone who wants to keep in shape, but is not an exercise guru... at my age (mid 50s) I just need to keep moving and keep my metabolism hyped. I don't want an exercise regime that will wear me out or run me down. These work great.\nLove Jessica's workout routines\nLeslie Sansone: Miracle Miles 5 DVD Set featuring Free Super-Sculpting Chain Link Band in Assorted Color\nLeslie Sansone  (Actor),     -  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n[\"The Walk at Home program from Leslie Sansone that millions love now offers a super charged system to get results faster and easier than ever: MIRACLE MILES featuring the NEW Chain Link Band! It's the all new faster way to walk off weight at home! For over 25 years, our mission has been to spread the good news that just minutes a day of brisk walking is the cure for so many of our health issues...and it's one of the most effective tools in weight loss! Walk at home workouts are multi muscle, calorie torching, posture perfecting, range of motion improving, health club quality workouts and you just can't beat this way to walk for health for weight loss! The MIRACLE MILES set includes 5 DVD workouts; each Mile includes an ''all-in-one'' sequence using cardio, strength training and flexibility! The secret is in our included brand NEW Chain Link Band...and now there's more: Belly Slimming while you WALK; Thigh and Backend Slimming while you WALK; Tone and Trim the Arms while you WALK; Choose a 1 Mile, 2 Mile, 3 Mile, 4 Mile or 5 Mile Workout! That's 15 BIG Miles of Fitness that you can mix and match anyway that suits your schedule! PLUS 3 bonus toning sessions to target Abs, Legs, Arms, and Total Body! The most effective fitness walking system ever from Leslie Sansone's Walk at Home program! This 15 mile system is easier than ever, the variety makes it more fun than ''boring'' walks and more effective than a stroll around the neighborhood. You'll love our all in one system that gives you every essential of fitness: cardio... strength...flexibility... all in one! CHAIN LINK BAND COMES IN ASSORTED COLORS.\"]\n{'Genre': 'Exercise & Fitness', 'Format': 'Dolby, NTSC, Widescreen, Anamorphic', 'Contributor': 'Leslie Sansone, -', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Qsweet', 'Media Format': 'Dolby, NTSC, Widescreen, Anamorphic', 'Run time': '4 hours and 5 minutes', 'Release date': 'November 20, 2018', 'Actors': 'Leslie Sansone', 'Studio': 'Bayview Films', 'Number of discs': '5'}\nI own several of Leslie's workout DVDs and although they all have fairly similar steps and styles, they are also varied enough I do not get bored.  I also have other workout DVDs which require more concentration to keep up with the numerous steps - but I always know that if I am just not in the mood to fuss with steps, I can pull out one of my Leslie DVDs and get a good workout without the need to learn new moves.  I was a little hesitant to buy this new collection because I thought it would just be one mile on the first DVD, then that same mile with a new one for the second DVD, then the first two and a new third mile, etc.  But it turns out that each DVD has completely NEW miles and you can play them individually or in a sequence.  So in essence, you are getting a wide selection of miles with this set - and they all follow a similar sequence (slower pace - boosted fast pace - miracle mile toning session) so you get variation as well as familiarity. This is great for someone like me, because my time to work out varies a great deal and it is nice to be able to pick and choose what I need for the day.  The music is good, if somewhat repetitive and the use of the \"Miracle Miles band\" adds some basic toning work to the walk... all in all I was very pleased with this set and will get a lot of use out of it.  Thanks Leslie and team!\nLots of variety!\nFeel Good Fusion with Jessica Smith: Barefoot Cardio, Strength, Pilates, Barre and Yoga Mix DVD, Fat Burning, Sculpting, Toning Low Impact Exercise (No Floor Work)\nJessica Smith  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Surrounded by blue skies and sunshine with the ocean as our backdrop, these two barefoot routines develop balance, coordination, strength, endurance, but overall, a sense of well-being, enjoyment, and energy! The true key to long-lasting results and benefits of exercise lies with consistency and including workouts like these into your regular plan can help you achieve and maintain your goals over the long term.This floor-work free program contains two complete sessions:Session #1: Fusion Strength (47 Minutes) - Sculpt and build functional strength and stamina while staying in the aerobic zone with the freeing range of motion of light weights and high reps. A set of hand weights (between 2 - 8 lbs, depending on level) is recommended for this routine.Session #2: Flow Cardio (35 Minutes) - Let go of the idea that every workout has to be all-out effort, all the time — this flowing LISS (lower intensity, steady state) cardio session helps build cardiovascular endurance, improve circulation, burn fat and balance out the stress of high-intensity training on the body.Approx. Total Run Time: 82 Minutes']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5 x 0.5 inches; 3 Ounces', 'Media Format': 'DVD', 'Run time': '1 hour and 22 minutes', 'Actors': 'Jessica Smith'}\nLove the two workouts Jessica presents in this DVD.  Her fusion routines are a perfect blend of cardio and yoga like moves that give me a good workout while keeping the illusion that I am just \"moving to the music\".  Very sneaky, these workouts, but make no mistake - you will sweat!\nGreat for those days I need to center myself.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Dancing With The Stars: Dance Off The Pounds\nReview Date: 2010/08/29\nStore: Kym Johnson  (Actor),     Lacey Schwimmer  (Actor),     Cal Pozo  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Each season, audiences watch in amazement as stars shrink down and shape up on ABC’s DANCING WITH THE STARS. Now you can share their weight-loss success and dance off the pounds with three different cardio dance routines—Swing, Jive and Quickstep—led by pro dancers Kym, Lacey and Dmitry. Each routine gets your body warmed-up with the signature moves of the featured dances before progressively adding on to create complete, calorie-blasting workouts – so you can learn with ease and get dancer-fit all at once. Join the fat-burning fun and dance your way to a superstar body!']\nAverage Rating: 4.2\nProduct Details: {'Aspect Ratio': '1.78:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '69808452008', 'Director': 'Cal Pozo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '54 minutes', 'Release date': 'December 1, 2009', 'Actors': 'Kym Johnson, Lacey Schwimmer, Dmitry Chaplin', 'Language': 'Unqualified', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nReview Text: Granted, I am new to this dance workout stuff - but this vid made me feel as clumsy as an elephant in toe shoes.  I also have no interest in Dancing with the Stars, so I wasn't caught up in the, \"OMG! Dmitry is teaching me how to dance!\" thing.<br /><br />Pros:  The dances might be fun, if you can figure out how to do them.<br /><br />Cons: There is little in the way of instruction, and the *instructors* seem to assume you can catch on after one quick demonstration - which is generally badly explained and poorly filmed. I am sorry, but saying, \"Okay? Got it? Let's do it to tempo...\" each time a step is shown does not count as *teaching* a step...<br /><br />A dancer may know the moves merely by name, but I doubt a dancer has need of a video like this.<br /><br />The instructors seem to have a limited repertoire of comments - I quickly tired of hearing, \"Excellent... Excellent.  That's great!  Excellent!\"<br /><br />There is NO warm-up - which could result in injury to someone who does not understand the importance of limbering up your muscles before launching into a workout routine.<br /><br />The cool down is limited and rather boring.  It felt tacked on and rather useless.<br /><br />All in all, I much prefer my other dance workout vids over this one.<br /><br />And I have to say, these female dancers have some of the most well endowed chests I've seen on slender dancer types.\nReview Title: Too Little Instruction\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 10 Minute Solution: Hip Hop Dance Mix\nReview Date: 2011/04/19\nStore: Kristin Jacobs  (Actor),     Andrea Ambandos  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: ['Ten minutes is all it takes to dance your way to a slimmer, more sculpted body using the latest hip-hop moves. This exercise program features five dance workouts that are easy to fit into any busy schedule and, more importantly, fun to do!']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Kristin Jacobs, Andrea Ambandos', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5457526', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '56 minutes', 'Release date': 'August 1, 2009', 'Actors': 'Kristin Jacobs', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: Although I generally enjoy the \"10 Minute\" series, this one just wasn't for me.  I  have bad knees, and there are too many twisting moves in these routines that could cause me injury.  I noted that the days after doing this workout, my knees would ache. I finally put two and two together and started substituting for those moves, but that kind of defeats the purpose.<br /><br />I also found I never worked up much of a sweat with this one and did not hit my target heart rate.  This is likely due to the fact I could never quite pull off the moves, what with my knees, my carpeted floor, and the fact that I am not coordinated enough to get the upper and lower body moves to mesh well.<br /><br />Not only was this workout a disappointment physically, I didn't seem to have as much fun doing these moves as I do some of my other workouts.  The dances just didn't flow for me.  I seem to do much better with my other 10 Minute mixes.  There is nothing wrong with the instructor. She is enthusiastic and fresh (if a bit fast paced), but this was just not the right DVD for me.  If you recognize yourself in my description, you might want to steer clear.\nReview Title: Not for me\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leslie Sansone: 5 Boosted Miles\nReview Date: 2015/12/29\nStore: Leslie Sansone  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Are you ready to BOOST the results of your walk? It’s EASY and FUN! We recommend that you start with the Bonus SESSION . This is where Leslie shows you the Top 10 Walk Moves and teaches you how to BOOST each one. After that, you can dive right into the 5 miles—in any way that you like. You can walk a gentle mile and then a boosted mile. You can walk two miles without boosting anything and then boost the next two. Or you can even opt to boost only some of the moves within each mile. You have the freedom to do whatever is right for you! Walkers that range from beginners all the way to advanced can all get a great workout! AND with the five different 1-mile sessions, you can also customize your workout time. If you have 30 minutes for your Monday walk, you can do two miles. If Tuesday is busy, sneak in a single 15-minute mile to keep yourself on track. Then for the days when you do have the time and the energy, you can walk all 5 miles and BOOST AWAY! Customize your workout time AND your workout intensity. This is YOUR walk!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Leslie Sansone', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35219365', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 29 minutes', 'Release date': 'November 10, 2015', 'Actors': 'Leslie Sansone', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: Another great Leslie DVD.  It has some of my favorite elements.  I like the mile by mile structure, so I can play one mile, or combine them.  I appreciate the high energy of the walkers, the fact that Leslie has someone show a modified lower impact version, the ability to play it with or without the instruction/verbal track, and the music... I think this is some of the best music on her DVDs if, like me, you enjoy electronica and dance techno style. But my favorite element is likely the color changes in the outfits.  I like that each mile, the costumes change to follow a shared color scheme - I love details like that and I LOVE color and design... (Even the lighting on the Walk At Home sign changes every mile!) My favorite Leslie DVDs tend to be the ones with color embellishments, like the HIIT Dance Party walks and the color miles on the Ultimate 5 day Walk Plan. The moves are traditional Leslie, so nothing much new here, except the use of short high energy boosts of various types - but I find that if you've done one Leslie workout, you have a pretty good idea of the types of moves you will need to be able to accomplish.  She does keep switching things up, so I never get bored, but everything is pretty easy to master. On the downside, the warmup and cool down are both inserted into the first and last miles respectively, so if you just choose something like mile 3, there is not warm up or cool down.  I prefer when the warm up and the cool down are separate so I can use them with any combination of miles.  Also, Leslie seems to do more chatting in this one, moving around and talking to everyone while in the middle of the workout rather than leading the steps.  That's okay with me on some level as I always enjoy getting to know the other walkers a bit - it is amazing how much personality can come through just by watching someone walk! - but it seems a bit heavy handed this time.  Michael was the other distraction. He is a new backup walker, and seems a bit of a class clown, wanting to be the focus of attention.  It is obvious he and his wife are a high energy couple and were having a great time.  I admire their sense of fun and energy, but I also found his antics a bit wearisome after a while.  Still, I will probably just learn to ignore them more as I watch the workout more often.  Maybe this different approach is a marketing strategy, trying to appeal to a younger audience or something.  I certainly have noticed a that Leslie's videos have changed through out the years, become more colorful and playful, with a better musical soundtrack (in my opinion)  and with younger walkers - so maybe this is more of the same.\nReview Title: Another winner!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DANCE That WALK – 5000 Steps in One Easy Low Impact Walking Workout DVD\nReview Date: 2016/07/11\nStore: Gina Buber  (Actor, Director),     Ella Charles  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Walking is the ultimate form of low-impact exercise for people of all ages and fitness levels.', 'But, walking can be boring, as well as weather and busy schedules can make it hard to get outside or fit a cardio workout into your day. So, we created', 'DANCE That WALK!', \"This 45 minute DVD from SMILE combines our favourite LATIN & BALLROOM dance moves with easy low impact walking, turning it into a fun new WALKOUT, that will get you burning those calories, boosting your daily step count, and most importantly it’s easy to follow! We want to you to think less and move more! With only 4 dance moves per track, and walking as a base, you won't spend your time learning, you’ll spend your time sweating!  Aussie creator Gina B uses her flare and pro ballroom dancing background, to bring you a fun DVD where you’ll be rocking to the jive, cha cha, samba and many more all in this 45min WALKOUT. With an Easy to use DVD menu, you can play all our tracks at once or choose your favourites!  DANCE That WALK is\", 'suitable for all ages, shapes, sizes and fitness levels.', 'Ideal for active older adults, you will be walking and dancing your way to a fitter, more fabulous YOU!  Need more convincing why you should DANCE That WALK?', 'Here are just a few benefits you can enjoy from our LOW IMPACT WORKOUT:', '- Dancing can stimulate your mind and make you feel energised; keep your reflexes, memory and coordination sharp! - Walking can Improve Circulation, Improve Your Fitness And Increase Cardiovascular Health! - Burn Calories & Boost your daily step count: with over 5000 steps, it’s a great way to control your weight or lose those extra pounds - Walking is LOW IMPACT And Easy On Your Joints - Allows everyone to workout from the comfort of your home anytime!  So if you want to feel fitter, improve your coordination and burn those calories by boosting your daily step count, then this workout is for you!']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 0.35 inches; 3.2 Ounces', 'Director': 'Gina Buber, Ella Charles', 'Media Format': 'NTSC', 'Run time': '45 minutes', 'Actors': 'Gina Buber', 'Studio': 'Third Tree Creatives', 'Country of Origin': 'Australia', 'Number of discs': '1'}\nReview Text: I want to make it clear that this is a fun little workout with a GREAT mix of musical selections, but I wish I had realized that it is as low impact as it is.  I am in my mid 50's and used to low to intermediate workouts but this one did not challenge me at all.  For example, I love a good Leslie Sansone workout but steer away from overly strenuous or high impact routines.  I think with this one, I probably would have gotten more of a workout sweeping my porch.  However, it makes a great workout for someone new to exercising, someone with limited mobility or an elderly person who wants a basic workout without the risk of injury.  I gave it to my mother and I think she will enjoy it - some of the music will bring back memories for her!\nReview Title: Great for certain exercisers, but not going to burn many calories.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Build Balance and Inner Strength, 3 Low Impact, Core Cardio Workouts, Walk Strong 2.0 with Jessica Smith\nReview Date: 2016/08/24\nStore: Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Lose your shoes to gain balance, postural alignment, core strength, range of motion -- even foot and ankle strength and mobility with these low impact, fusion-style routines. Feel free to mix and match these sessions into your weekly workout schedule (we recommend alternating them with your favorite cardio, strength and flexibility training routines 2-4 days a week). Check out our other titles in this series, our “Walk STRONG: Boost Metabolism and Muscle” and “Walk STRONG: Burn Fat and Have Fun” for some great options! You can also use these workouts in conjunction with our “Walk STRONG: Total Transformation 6 Week System\" (also available on Amazon).WORKOUT #1: CORE CONTROL - Fusing together elements of Pilates, dance and yoga, this flowing, low impact cardio session incorporates standing only abs work for a stronger center and a surprising amount of sweat.WORKOUT #2: POISE AND GRACE - Using a single set of light dumbbells, this total body sculpting session builds better posture, body awareness and functional strength.WORKOUT #3: BALANCE AND AGILITY - Better your balance and improve your coordination with this total body strength and cardio flow that incorporates the use of a flat resistance band for added challenge.Our modifier Debbie, age 60, offers options throughout each workout.About Your Instructor: Jessica Smith has over 15 years of experience as a certified trainer, instructor and wellness coach.']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.6 x 5.35 x 0.63 inches; 1.08 Pounds', 'Media Format': 'DVD', 'Studio': 'In Wellness Systems LLC'}\nReview Text: This one is deceptive.  It starts off so gently, I made the mistake of thinking it would be a cake walk... was I wrong!  Each of these workouts really did stretch me, and I ended up winded and sweaty!  Granted, I am not a heavy duty exercise queen, but I work out daily, even if for a short time and I am in pretty good shape.  This was a nice alternative to my usual cardio walk.  I like that each session was different and had a different focus as I tend to get &#34;bored&#34; with my workout DVDs fairly quickly and when I get bored, I end up making excuses not to exercise... This one has enough variety to keep me interested for a while.  I especially liked the second session that almost had a &#34;mindfulness&#34; feel to it - a Yoga, pilates, Thai chi kind of thing going on - relaxing, yet invigorating and challenging. Jessica and her mom work well together and are fun to watch - Jessica is encouraging while still being &#34;genuine&#34; and I don't get the forced &#34;cheerful cheerleader&#34; vibe I do from some other instructors. It can't be easy to encourage folks to do something many of us do not necessarily enjoy, so kudos to her for managing to do so and to do it without repeating the same platitudes like &#34;excellent&#34;, &#34;great&#34;, or &#34;good&#34; over and over ad nausea.  I purchased this one as a test, to see if I might like the whole series - now I definitely will have to check out the other DVDs!\nReview Title: Two thumbs up!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Walk On: 3-DVD Set: 6, 30 Minute Walking Workouts\nReview Date: 2018/05/30\nStore: Jessica Smith  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Get our classic \"Walk On: 3 DVD Super Set\" 2014 collection! Whatever the weather is in your neck of the woods you can count on sunshine and blue skies in our videos. These workouts were all filmed on location in sunny Florida with a beautiful view of the bay so you can feel like you are striding right outside with us. This 3-DVD Set Includes 6, 30-Minute Walks, or 3 hours of outdoor walking fun:', 'DVD #1: Walk On: Strength and Balance', 'STRIDE & STRENGTH [30 Minutes]: Burn fat and build metabolism boosting lean muscle mass with this two-in-one session! Burn more calories in less time with this maximum results routine that couples HIIT (high intensity interval) cardio training with circuits of strength exercises to make every second of your workout count. FUSION WALK [30 Minutes]: Balance your body with this flowing, feel-good endurance walk is done barefoot (shoes may be worn if preferred) in order to fully engage and strengthen the muscles of the feet and ankles.', 'DVD #2: Walk On: Dance Walk', 'LATIN DANCE WALK [30 Minutes]: Salsa, shimmy and shake off the pounds with this spicy walking workout that uses simple steps to keep your heart rate elevated (and your mind at ease). DANCE WALK [30 Minutes]: Twist, shout and disco dance away the calories with this upbeat walk that mixes together different styles from various decades for a walk that feels more like a party than a work out!', 'DVD #3: Walk On: Tone Your Trouble Zones', 'BUNS AND THIGHS WALK [30 Minutes]: Blast off fat to slim your hips, buns and thighs with this multi-tasking walk that incorporates lower body toning for better, more targeted results. FLAT ABS WALK [30 Minutes]: Walk off weight and shrink your waist by burning calories and developing strong, pulled-in flat abs at the same time with this tummy-targeting walk.']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5 x 0.5 inches; 6.07 Ounces', 'Media Format': 'Full Screen', 'Run time': '180 minutes', 'Actors': 'Jessica Smith', 'Studio': 'In Wellness Systems LLC', 'Number of discs': '3'}\nReview Text: Love Jessica's workout routines.  Perfect for someone who wants to keep in shape, but is not an exercise guru... at my age (mid 50s) I just need to keep moving and keep my metabolism hyped. I don't want an exercise regime that will wear me out or run me down. These work great.\nReview Title: Love Jessica's workout routines\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leslie Sansone: Miracle Miles 5 DVD Set featuring Free Super-Sculpting Chain Link Band in Assorted Color\nReview Date: 2019/07/07\nStore: Leslie Sansone  (Actor),     -  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: [\"The Walk at Home program from Leslie Sansone that millions love now offers a super charged system to get results faster and easier than ever: MIRACLE MILES featuring the NEW Chain Link Band! It's the all new faster way to walk off weight at home! For over 25 years, our mission has been to spread the good news that just minutes a day of brisk walking is the cure for so many of our health issues...and it's one of the most effective tools in weight loss! Walk at home workouts are multi muscle, calorie torching, posture perfecting, range of motion improving, health club quality workouts and you just can't beat this way to walk for health for weight loss! The MIRACLE MILES set includes 5 DVD workouts; each Mile includes an ''all-in-one'' sequence using cardio, strength training and flexibility! The secret is in our included brand NEW Chain Link Band...and now there's more: Belly Slimming while you WALK; Thigh and Backend Slimming while you WALK; Tone and Trim the Arms while you WALK; Choose a 1 Mile, 2 Mile, 3 Mile, 4 Mile or 5 Mile Workout! That's 15 BIG Miles of Fitness that you can mix and match anyway that suits your schedule! PLUS 3 bonus toning sessions to target Abs, Legs, Arms, and Total Body! The most effective fitness walking system ever from Leslie Sansone's Walk at Home program! This 15 mile system is easier than ever, the variety makes it more fun than ''boring'' walks and more effective than a stroll around the neighborhood. You'll love our all in one system that gives you every essential of fitness: cardio... strength...flexibility... all in one! CHAIN LINK BAND COMES IN ASSORTED COLORS.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Exercise & Fitness', 'Format': 'Dolby, NTSC, Widescreen, Anamorphic', 'Contributor': 'Leslie Sansone, -', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Qsweet', 'Media Format': 'Dolby, NTSC, Widescreen, Anamorphic', 'Run time': '4 hours and 5 minutes', 'Release date': 'November 20, 2018', 'Actors': 'Leslie Sansone', 'Studio': 'Bayview Films', 'Number of discs': '5'}\nReview Text: I own several of Leslie's workout DVDs and although they all have fairly similar steps and styles, they are also varied enough I do not get bored.  I also have other workout DVDs which require more concentration to keep up with the numerous steps - but I always know that if I am just not in the mood to fuss with steps, I can pull out one of my Leslie DVDs and get a good workout without the need to learn new moves.  I was a little hesitant to buy this new collection because I thought it would just be one mile on the first DVD, then that same mile with a new one for the second DVD, then the first two and a new third mile, etc.  But it turns out that each DVD has completely NEW miles and you can play them individually or in a sequence.  So in essence, you are getting a wide selection of miles with this set - and they all follow a similar sequence (slower pace - boosted fast pace - miracle mile toning session) so you get variation as well as familiarity. This is great for someone like me, because my time to work out varies a great deal and it is nice to be able to pick and choose what I need for the day.  The music is good, if somewhat repetitive and the use of the \"Miracle Miles band\" adds some basic toning work to the walk... all in all I was very pleased with this set and will get a lot of use out of it.  Thanks Leslie and team!\nReview Title: Lots of variety!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Feel Good Fusion with Jessica Smith: Barefoot Cardio, Strength, Pilates, Barre and Yoga Mix DVD, Fat Burning, Sculpting, Toning Low Impact Exercise (No Floor Work)\nReview Date: 2019/07/07\nStore: Jessica Smith  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Surrounded by blue skies and sunshine with the ocean as our backdrop, these two barefoot routines develop balance, coordination, strength, endurance, but overall, a sense of well-being, enjoyment, and energy! The true key to long-lasting results and benefits of exercise lies with consistency and including workouts like these into your regular plan can help you achieve and maintain your goals over the long term.This floor-work free program contains two complete sessions:Session #1: Fusion Strength (47 Minutes) - Sculpt and build functional strength and stamina while staying in the aerobic zone with the freeing range of motion of light weights and high reps. A set of hand weights (between 2 - 8 lbs, depending on level) is recommended for this routine.Session #2: Flow Cardio (35 Minutes) - Let go of the idea that every workout has to be all-out effort, all the time — this flowing LISS (lower intensity, steady state) cardio session helps build cardiovascular endurance, improve circulation, burn fat and balance out the stress of high-intensity training on the body.Approx. Total Run Time: 82 Minutes']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5 x 0.5 inches; 3 Ounces', 'Media Format': 'DVD', 'Run time': '1 hour and 22 minutes', 'Actors': 'Jessica Smith'}\nReview Text: Love the two workouts Jessica presents in this DVD.  Her fusion routines are a perfect blend of cardio and yoga like moves that give me a good workout while keeping the illusion that I am just \"moving to the music\".  Very sneaky, these workouts, but make no mistake - you will sweat!\nReview Title: Great for those days I need to center myself.\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual analyzed consistently prefers low to moderate intensity dance and walking workouts, highly valuing accessibility and adaptability in their exercise routines. Patterns in ratings indicate a slight preference for more structured workouts with clear instructions, as evidenced by lower ratings for poorly explained routines.\n\nKey themes reveal a strong inclination towards fun, engaging formats that incorporate dance elements, suggesting a desire for enjoyable physical activity rather than traditional workouts. The individual favors variety within workout programs, allowing for customization of intensity and duration to accommodate their lifestyle and potential mobility limitations.\n\nQuality preferences lean towards DVDs with comprehensive guidance, high production values, and diversified content, as seen in their favorable reception of multi-part series and workouts that incorporate various exercise styles. Price sensitivity appears less pronounced, with an evident willingness to invest in quality workout material.\n\nOverall, this person's core preferences center around accessible and enjoyable low-impact exercises that promote fitness in a fun, colorful manner while providing flexibility in meeting their unique fitness needs.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Not the usual Gina workout!",
    "text": "I have been watching videos from Gina for a couple years now, and usually I use her videos when I am in a mood for a fun, upbeat workout but one that is not too challenging.  However, this is a different ball-game!  Gina has definitely upped her game with this one!  Still fun, but much more strenuous.  Closer to HITT style with fast pace and faster pace!  Nothing wrong with that... I personally love having a Gina workout which really pushes me (and the music is great fun!) Just beware that this workout is a step up from her usual and purchase with that in mind!",
    "images": [],
    "asin": "B0895F5QK1",
    "parent_asin": "B0895F5QK1",
    "user_id": "AGYYE36OIMMHOBP4DK4YPEYWZHJA",
    "timestamp": "2021-06-03 16:24:38.429000",
    "helpful_vote": 3,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Power Walk Through The Decades 5 DVD Set: Walk, Dance And Sweat With Hits From The 60’s To The 00’s",
    "average_rating": 4.6,
    "rating_number": 213,
    "features": [],
    "description": [
      "Are you ready to power walk off those pounds through the decades?",
      "Join Gina B through 5 decades of high-energy cardio blasting power walking workouts. Get ready to twist through the 60’s, disco through the 70’s, pump it to the 80’s, rock out the 90’s and party it up to the 00’s. Each mix is choreographed to the BEat using our signature Dance That Walk method so that you can sweat it out to everyone’s favorite all time hits.",
      "What you’ll get in this pack:#",
      "Each decade DVD includes a 55minute workout",
      "#",
      "3 x 15minute power walks in each decade#",
      "Warm up and cool down with each decade#",
      "No equipment needed#",
      "Close to 5 HOURS in total workouts!",
      "With",
      "6000 steps",
      "in each decade DVD, you’ll",
      "Walk, Dance and Sweat",
      "your way to the greatest hits from the 60’s to the 00’s!"
    ],
    "price": 49.95,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51wYw+wFJPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51wYw+wFJPL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71rquJvVuZL._SL1080_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/513B7Vew6eL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/513B7Vew6eL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/91mvjN1WljL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Power Walk Through The Decades 5 DVD Set: 60s to 00s Hits!",
        "url": "https://www.amazon.com/vdp/043ff1b182024700ada49098c0fbbea3?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Gina Buber  (Actor)    Rated:    Unrated    Format: DVD",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "DVD",
      "Exercise & Fitness"
    ],
    "details": {
      "MPAA rating": "Unrated (Not Rated)",
      "Package Dimensions": "7.52 x 5.35 x 0.55 inches; 6.07 Ounces",
      "Media Format": "DVD",
      "Run time": "275 minutes",
      "Actors": "Gina Buber",
      "Country of Origin": "Australia",
      "Number of discs": "5"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}