{
  "user_id": "AGRCMTNBBLDAQWAQ4UCZJAR52IMQ",
  "summary": "=== Purchase Information ===\nProduct Title: Sleepy Hollow\nReview Date: 2012/12/14\nStore: Johnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Master storyteller Tim Burton (', 'Batman', ',', 'Edward Scissorhands', ') weaves an eerie, enchanting version of this classic tale of horror. Johnny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderous Headless Horseman. Christina Ricci is Katrina Van Tassel, the beautiful and mysterious girl with secret ties to the supernatural terror.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': 'MFR097363296249#VG', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Closed-captioned, Color, Dolby, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Studio': 'Paramount', 'Writers': 'Andrew Kevin Walker, Kevin Yagher, Washington Irving', 'Number of discs': '1'}\nReview Text: everyone should own this dvd and watch every Thanksgiving, as we have for years. Johnny Depp is marvelous and quirky\nReview Title: A Classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Home Alone\nReview Date: 2012/12/14\nStore: Macaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Accidentally left by his Paris-bound family, an 8-year-old makes mincemeat of two burglars in the house.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': \"Kieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts Blossom, Larry Hankin, Gerry Bamman, Chris ColumbusKieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts…  See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.52 x 5.29 x 7.43 inches; 1.6 Ounces', 'Item model number': '24543027188', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Roberts Blossom', 'Studio': '20TH CENTURY STUDIOS', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Christmas means a viewing of &#34;Home Alone&#34; for my family every year and we always enjoy it as much as the 1st time. This purchase was a gift.\nReview Title: Classic Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: White Christmas\nReview Date: 2012/12/14\nStore: Bing Crosby  (Actor),     Danny Kaye  (Actor),     Michael Curtiz  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Two talented son-and-dance men (Bing Crosby and Danny Kaye) team up after the war to become one of the hottest acts in show business.']\nAverage Rating: 4.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.39 x 7.65 inches; 4.48 Ounces', 'Director': 'Michael Curtiz', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Original recording remastered, Subtitled, Widescreen, Restored', 'Run time': '2 hours', 'Release date': 'November 3, 2009', 'Actors': 'Bing Crosby, Danny Kaye, Rosemary Clooney, Vera Ellen, Dean Jagger', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Language': 'Unqualified', 'Studio': 'Paramount', 'Writers': 'Norman Krasna, Norman Panama, Melvin Frank', 'Number of discs': '2'}\nReview Text: Classic doesn't even begin to describe this perennial favorite. Who could ever get tired of Bing Crosby, Danny Kaye and Rosemary Clooney-singing and Dancing? wonderful escapism\nReview Title: Have ALways Loved It\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/01/24\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nReview Text: I always buy my videos and cds from AMazon-top quality-quick ship. Best source for the best products you can buy\nReview Title: quick ship/great quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Triplets of Belleville\nReview Date: 2013/02/15\nStore: Sylvain Chomet  (Director)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Comedy\nProduct Description: [\"You've never seen anything like\", 'The Triplets of Belleville', ', a wildly inventive and highly original animated feature crowded with colorful characters and fantastic imagery. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas. The motley sleuths follow the clues to an Underground betting parlor and now the chase is on! Richly imagined, wildly inventive and acclaimed as one of the best films of the year, \"', 'Triplets', 'is terrific!\" - Richard Corliss, TIME MAGAZINE.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Contributor': 'Didier Brunner, Les Armateurs, Viviane Vanfleteren, Sylvain Chomet', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 8 Ounces', 'Item model number': '03231', 'Director': 'Sylvain Chomet', 'Media Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'May 4, 2004', 'Dubbed': 'English, Spanish', 'Producers': 'Didier Brunner, Viviane Vanfleteren', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This dvd is enchanting and hysterically funny while at the same time being charming and a great deal of entertainment\nReview Title: funny dvd\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Bridge: Mackinac Island's Hidden Season\nReview Date: 2013/02/15\nStore: Jenifer Silvernale (Actor),  Mark Rensel (Writer)\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nAverage Rating: 4.6\nProduct Details: {'Publisher': 'Icebridgemovie (January 1, 2008)', 'Item Weight': '2.93 ounces'}\nReview Text: this dvd brings back the wonders of Mackinac Island and shows how beautiful and unique it is even in the dead of winter\nReview Title: enjoyed\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pussycat Dolls: Dancer's Body Workout\nReview Date: 2013/02/15\nStore: Robin Antin  (Actor),     Andrea Ambandos  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: [\"Pussycat Dolls creator Robin Antin specially designed this workout to bring out your sexy side while working your whole body. You'll learn to move with confidence as you dance your way to into show-stopping shape. With a soundtrack of hit Pussycat Dolls songs that are guaranteed to keep you energized, this fun and fierce workout uses signature PCD moves to help burn fat, build muscle, and create the lean, toned body of a dancer. Inside every woman is a pussycat doll just waiting to come out. Unleash Yours!Feature Dance Segments:-When I Grow Up-Wait A Minute-Burlesque-Style Chair DanceBONUS! The Purrfect 4-Minute Workout:A quick but effective routine that fits into any schedule.\"]\nAverage Rating: 3.9\nProduct Details: {'Genre': 'exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Robin Antin, Andrea Ambandos', 'Language': 'English', 'Runtime': '57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '0454899059', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '57 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Robin Antin', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nReview Text: I thought that this was a workout I could do and if the Pussycat Dolls could look this good and this workout maintained that look, I wanted it!\nReview Title: good stuff\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Deadwood: The Complete Series\nReview Date: 2013/02/15\nStore: Ian McShane  (Actor),     Timothy Olyphant  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Deadwood: The Complete Series (DVD)', 'The Black Hills of South Dakota. Witness the birth of an American frontier town - and the ruthless power struggle between its just and unjust pioneers.', ']]>', 'Amazon.com', 'Deadwood', 'represents one of those periodic, wholesale reinventions of the Western that is as different from, say,', 'Lonesome Dove', \"as that miniseries is from Howard Hawks's\", 'Rio Bravo', \"or the latter is from Anthony Mann's\", 'The Naked Spur', \". In many ways, HBO's\", 'Deadwood', \"embraces the Western's unambiguous morality during the cinema's silent era through the 1930s while also blazing trails through a post-\", 'NYPD Blue', ', post-', 'The West Wing', 'television age exalting dense and customized dialogue. On top of that,', 'Deadwood', \"has managed an original look and texture for a familiar genre: gritty, chaotic, and surging with both dark and hopeful energy. Yet the show's creator, erstwhile\", 'NYPD Blue', 'head writer David Milch, never ridicules or condescends to his more grasping, futile characters or overstates the virtues of his heroic ones.', 'Set in an ungoverned stretch of South Dakota soon after the 1876 Custer massacre,', 'Deadwood', \"concerns a lawless, evolving town attracting fortune-seekers, drifters, tyrants, and burned-out adventurers searching for a card game and a place to die. Others, particularly women trapped in prostitution, sundry do-gooders, and hangers-on have nowhere else to go. Into this pool of aspiration and nightmare arrive former Montana lawman Seth Bullock (Timothy Olyphant) and his friend Sol Starr (John Hawkes), determined to open a lucrative hardware business. Over time, their paths cross with a weary but still formidable Wild Bill Hickok (Keith Carradine) and his doting companion, the coarse angel Calamity Jane (Robin Weigert); an aristocratic, drug-addicted widow (Molly Parker) trying to salvage a gold mining claim; and a despondent hooker (Paula Malcomson) who cares, briefly, for an orphaned girl. Casting a giant shadow over all is a blood-soaked king, Gem Saloon owner Al Swearengen (Ian McShane), possibly the best, most complex, and mesmerizing villain seen on TV in years. Each of these characters, and many others, will forge alliances and feuds, cope with disasters (such as smallpox), and move--almost invisibly but inexorably--toward some semblance of order and common cause. Making it all worthwhile is Milch's masterful dialogue--often profane, sometimes courtly and civilized, never perfunctory--and the brilliant acting of the aforementioned performers plus others.\", '--Tom Keogh']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Box set, Widescreen, Subtitled, Closed-captioned, Color, NTSC', 'Contributor': 'Ian McShane, Timothy Olyphant', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '19', 'Runtime': '33 hours and 26 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 2 inches; 2 Pounds', 'Media Format': 'Multiple Formats, Box set, Widescreen, Subtitled, Closed-captioned, Color, NTSC', 'Run time': '33 hours and 26 minutes', 'Release date': 'December 9, 2008', 'Actors': 'Ian McShane, Timothy Olyphant', 'Subtitles': 'English', 'Studio': 'HBO Studios', 'Number of discs': '19'}\nReview Text: The Deadwood tv serial was a tremendous hit and we loved every episode so much that we jumped on the opportunity to own the entire series\nReview Title: love this\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Great Outdoors [DVD]\nReview Date: 2013/06/10\nStore: Dan Aykroyd  (Actor),     John Candy  (Actor),     Howard Deutch  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['When an unannounced, uninvited and unwelcome family of fun-loving misfits converge upon a lakeside resort to join their relatives for a summer of relaxation, the result is anything but restful in this raucous comedy starring Dan Aykroyd and John Candy.It\\'s a vacationer\\'s worst nightmare, as wheeler-dealer Aykroyd, his sexually repressed wife and eerie twin daughters \"join\" the easygoing Candy and his straight-laced clan for a season of \"fun\" in the sun. Unfortunately, the only thing these two in-laws have in common is their intense dislike for each other. Soon, it\\'s brother-in-law against brother-in-law in an uproarious and hilarious fight to the finish to see which one really knows how to enjoy The Great Outdoors.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert ProskyAnnette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert Prosky  See more', 'Initial release date': '2006-02-14', 'Language': 'Unqualified, Spanish (Dolby Surround), French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.54 Ounces', 'Item model number': 'MFR025192022821#N', 'Director': 'Howard Deutch', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 31 minutes', 'Release date': 'February 14, 2006', 'Actors': 'Dan Aykroyd, John Candy, Annette Bening, Chris Young, Stephanie Faracy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Arne Schmidt, John Hughes', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: one of beloved John Candy's best movies-he will be sorely missed yet can live on in this sweet and funny movie\nReview Title: a classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Woodstock: Three Days of Peace & Music (Two-Disc 40th Anniversary Director's Cut)\nReview Date: 2013/10/18\nStore: Joan Baez  (Actor),     Joe Cocker  (Actor),     Michael Wadleigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"Woodstock 3 Days of Peace and Music Director's Cut 40th Anniversary Special Edition (DVD)\", '1969 was a year unlike any other. Man first set foot on the moon. The New York Mets won the World Series against all odds. And for three days in the rural town of Bethel, New York, half a million people experienced the single most defining moment of their generation; a concert unprecedented in scope and influence, a coming together of people from all walks of life with a single common goal: Peace and music. They called it Woodstock. One year later, a landmark Oscar®-winning documentary captured the essence of the music, the electricity of the performances, and the experience of those who lived it. Newly remastered, the film features legendary performances by 17 best selling artists.', ']]>', 'Amazon.com', 'The three-day Woodstock music festival in 1969 was the pivotal event of the 1960s peace movement, and this landmark concert film is the definitive record of that milestone of rock & roll history. It\\'s more than a chronicle of the hippie movement, however; this is a film of genuine historical and social importance, capturing the spirit of America in transition, when the Vietnam War was at its peak and antiwar protest was fully expressed through the liberating music of the time. With a brilliant crew at his disposal (including a young editor named Martin Scorsese), director Michael Wadleigh worked with over 300 hours of footage to create his original 225-minute director\\'s cut, which was cut by 40 minutes for the film\\'s release in 1970. Eight previously edited segments were restored in 1994, and the original director\\'s cut of Woodstock is now the version most commonly available on videotape and DVD. The film deservedly won the Academy Award for Best Documentary, and it\\'s still a stunning achievement. Abundant footage taken among the massive crowd (\"half a million strong\") expresses the human heart of the event, from skinny-dipping hippies to accidental overdoses, to unpredictable weather, midconcert childbirth, and the thoughtful (or just plain rambling) reflections of the festive participants. Then, of course, there is the music--a nonstop parade of rock & roll from the greatest performers of the period, including Crosby, Stills, and Nash, Canned Heat, The Who, Richie Havens, Joan Baez, Ten Years After, Sly & The Family Stone, Santana, and many more. Watching this ambitious film, as the saying goes, is the next best thing to being there--it\\'s a time-travel journey to that once-in-a-lifetime event. --', 'Jeff Shannon', 'Product Description', '1969 was a year unlike any other. Man first set foot on the moon. The New York Mets won the World Series against all odds. And for three days in the rural town of Bethel, New York, half a million people experienced the single most defining moment of their generation; a concert unprecedented in scope and influence, a coming together of people from all walks of life with a single common goal: Peace and music. They called it Woodstock. One year later, a landmark Oscar®-winning documentary captured the essence of the music, the electricity of the performances, and the experience of those who lived it. Newly remastered, the film features legendary performances by 17 best selling artists. Bonus content includes: • NEW retrospective The Museum at Bethel Woods: The Story of the Sixties & Woodstock.', 'Stills from', \"Woodstock: 3 Days of Peace & Music Director's Cut\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Musicals', 'Format': \"Multiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, RestoredMultiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, Restored   See more\", 'Contributor': 'Sly & the Family Stone, Crosby, Stills, Nash & Young, Janis Joplin, Richie Havens, Joe Cocker, The Jefferson Airplane, Michael Wadleigh, John Sebastian, The Who, Country Joe and the Fish, Santana, Dale Bell, Ten Years After, Arlo Guthrie, Joan Baez, Bob MauriceSly & the Family Stone, Crosby, Stills, Nash & Young, Janis Joplin, Richie Havens, Joe Cocker, The Jefferson Airplane, Michael Wadleigh, John Sebastian, The Who, Country Joe and the Fish, Santana, Dale Bell, Ten Years After, Arlo Guthrie, Joan Baez, Bob Maurice   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': '40-1000026403', 'Director': 'Michael Wadleigh', 'Media Format': \"Multiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, Restored\", 'Run time': '3 hours and 44 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Joan Baez, Joe Cocker, Country Joe and the Fish, Crosby, Stills, Nash & Young, Arlo Guthrie', 'Subtitles': 'English, French, Spanish', 'Producers': 'Bob Maurice, Dale Bell', 'Studio': 'Warner Home Video', 'Number of discs': '2'}\nReview Text: I can't wait to surprise some of my friends with this superb anniversary edition of the Woodstock music festival of 1969\nReview Title: great gift for your ex-hippie friends\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dances With Wolves\nReview Date: 2013/10/20\nStore: Mary McDonnell  (Actor),     Graham Greene  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Dances Wolves 25 Anniversary (RPKG/DVD)', 'Set in 1863, a solitary U.S. cavalryman outposted in the remote frontier learns the ways of the Sioux. Though his misconceptions about them are quickly dispelled, he must protect them from the ravages of his fellow cavalrymen, come to \"civilize\" the far frontier.', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 5 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant, Floyd Red Crow Westerman', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Jake Eberts, Kevin Costner, Jim Wilson', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Blake', 'Number of discs': '1'}\nReview Text: LOVED this beautiful movie. Kevin Costner is amazing and the scenery is gorgeous. I can see why he bought land and property in South Dakota after making this movie.\nReview Title: classic costner\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: JOANNA LUMLEY'S GREEK ODYSSEY\nReview Date: 2014/02/02\nStore: Joanna Lumley  (Actor),     Rob Farquhar  (Director),     Dominic Ozanne  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Joanna Lumleys Greek']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'unknown', 'Director': 'Rob Farquhar, Dominic Ozanne', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 3 minutes', 'Release date': 'January 14, 2014', 'Actors': 'Joanna Lumley', 'Subtitles': 'English', 'Studio': 'Athena', 'Number of discs': '1'}\nReview Text: Joanna Lumley from &#34;AbFab&#34; is the most wonderful tour guide.I would love to accompany her on her big adventures. She is fearless, plucky and up for anything the &#34;Locals&#34; present to her. She will eat anything, go anywhere by any means, and is delightful and compassionate..\nReview Title: Joanna Lumley has another travel hit\nRating: 5.0\n--------------------------------------------------",
  "reference": "Sleepy Hollow\nJohnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Master storyteller Tim Burton (', 'Batman', ',', 'Edward Scissorhands', ') weaves an eerie, enchanting version of this classic tale of horror. Johnny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderous Headless Horseman. Christina Ricci is Katrina Van Tassel, the beautiful and mysterious girl with secret ties to the supernatural terror.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': 'MFR097363296249#VG', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Closed-captioned, Color, Dolby, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Studio': 'Paramount', 'Writers': 'Andrew Kevin Walker, Kevin Yagher, Washington Irving', 'Number of discs': '1'}\neveryone should own this dvd and watch every Thanksgiving, as we have for years. Johnny Depp is marvelous and quirky\nA Classic\nHome Alone\nMacaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Accidentally left by his Paris-bound family, an 8-year-old makes mincemeat of two burglars in the house.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': \"Kieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts Blossom, Larry Hankin, Gerry Bamman, Chris ColumbusKieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts…  See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.52 x 5.29 x 7.43 inches; 1.6 Ounces', 'Item model number': '24543027188', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Roberts Blossom', 'Studio': '20TH CENTURY STUDIOS', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nChristmas means a viewing of &#34;Home Alone&#34; for my family every year and we always enjoy it as much as the 1st time. This purchase was a gift.\nClassic Movie\nWhite Christmas\nBing Crosby  (Actor),     Danny Kaye  (Actor),     Michael Curtiz  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Two talented son-and-dance men (Bing Crosby and Danny Kaye) team up after the war to become one of the hottest acts in show business.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.39 x 7.65 inches; 4.48 Ounces', 'Director': 'Michael Curtiz', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Original recording remastered, Subtitled, Widescreen, Restored', 'Run time': '2 hours', 'Release date': 'November 3, 2009', 'Actors': 'Bing Crosby, Danny Kaye, Rosemary Clooney, Vera Ellen, Dean Jagger', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Language': 'Unqualified', 'Studio': 'Paramount', 'Writers': 'Norman Krasna, Norman Panama, Melvin Frank', 'Number of discs': '2'}\nClassic doesn't even begin to describe this perennial favorite. Who could ever get tired of Bing Crosby, Danny Kaye and Rosemary Clooney-singing and Dancing? wonderful escapism\nHave ALways Loved It\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nI always buy my videos and cds from AMazon-top quality-quick ship. Best source for the best products you can buy\nquick ship/great quality\nThe Triplets of Belleville\nSylvain Chomet  (Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Comedy\n[\"You've never seen anything like\", 'The Triplets of Belleville', ', a wildly inventive and highly original animated feature crowded with colorful characters and fantastic imagery. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas. The motley sleuths follow the clues to an Underground betting parlor and now the chase is on! Richly imagined, wildly inventive and acclaimed as one of the best films of the year, \"', 'Triplets', 'is terrific!\" - Richard Corliss, TIME MAGAZINE.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Contributor': 'Didier Brunner, Les Armateurs, Viviane Vanfleteren, Sylvain Chomet', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 8 Ounces', 'Item model number': '03231', 'Director': 'Sylvain Chomet', 'Media Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'May 4, 2004', 'Dubbed': 'English, Spanish', 'Producers': 'Didier Brunner, Viviane Vanfleteren', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis dvd is enchanting and hysterically funny while at the same time being charming and a great deal of entertainment\nfunny dvd\nIce Bridge: Mackinac Island's Hidden Season\nJenifer Silvernale (Actor),  Mark Rensel (Writer)\nMovies & TV, Genre for Featured Categories, Documentary\n{'Publisher': 'Icebridgemovie (January 1, 2008)', 'Item Weight': '2.93 ounces'}\nthis dvd brings back the wonders of Mackinac Island and shows how beautiful and unique it is even in the dead of winter\nenjoyed\nPussycat Dolls: Dancer's Body Workout\nRobin Antin  (Actor),     Andrea Ambandos  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n[\"Pussycat Dolls creator Robin Antin specially designed this workout to bring out your sexy side while working your whole body. You'll learn to move with confidence as you dance your way to into show-stopping shape. With a soundtrack of hit Pussycat Dolls songs that are guaranteed to keep you energized, this fun and fierce workout uses signature PCD moves to help burn fat, build muscle, and create the lean, toned body of a dancer. Inside every woman is a pussycat doll just waiting to come out. Unleash Yours!Feature Dance Segments:-When I Grow Up-Wait A Minute-Burlesque-Style Chair DanceBONUS! The Purrfect 4-Minute Workout:A quick but effective routine that fits into any schedule.\"]\n{'Genre': 'exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Robin Antin, Andrea Ambandos', 'Language': 'English', 'Runtime': '57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '0454899059', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '57 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Robin Antin', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nI thought that this was a workout I could do and if the Pussycat Dolls could look this good and this workout maintained that look, I wanted it!\ngood stuff\nDeadwood: The Complete Series\nIan McShane  (Actor),     Timothy Olyphant  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Deadwood: The Complete Series (DVD)', 'The Black Hills of South Dakota. Witness the birth of an American frontier town - and the ruthless power struggle between its just and unjust pioneers.', ']]>', 'Amazon.com', 'Deadwood', 'represents one of those periodic, wholesale reinventions of the Western that is as different from, say,', 'Lonesome Dove', \"as that miniseries is from Howard Hawks's\", 'Rio Bravo', \"or the latter is from Anthony Mann's\", 'The Naked Spur', \". In many ways, HBO's\", 'Deadwood', \"embraces the Western's unambiguous morality during the cinema's silent era through the 1930s while also blazing trails through a post-\", 'NYPD Blue', ', post-', 'The West Wing', 'television age exalting dense and customized dialogue. On top of that,', 'Deadwood', \"has managed an original look and texture for a familiar genre: gritty, chaotic, and surging with both dark and hopeful energy. Yet the show's creator, erstwhile\", 'NYPD Blue', 'head writer David Milch, never ridicules or condescends to his more grasping, futile characters or overstates the virtues of his heroic ones.', 'Set in an ungoverned stretch of South Dakota soon after the 1876 Custer massacre,', 'Deadwood', \"concerns a lawless, evolving town attracting fortune-seekers, drifters, tyrants, and burned-out adventurers searching for a card game and a place to die. Others, particularly women trapped in prostitution, sundry do-gooders, and hangers-on have nowhere else to go. Into this pool of aspiration and nightmare arrive former Montana lawman Seth Bullock (Timothy Olyphant) and his friend Sol Starr (John Hawkes), determined to open a lucrative hardware business. Over time, their paths cross with a weary but still formidable Wild Bill Hickok (Keith Carradine) and his doting companion, the coarse angel Calamity Jane (Robin Weigert); an aristocratic, drug-addicted widow (Molly Parker) trying to salvage a gold mining claim; and a despondent hooker (Paula Malcomson) who cares, briefly, for an orphaned girl. Casting a giant shadow over all is a blood-soaked king, Gem Saloon owner Al Swearengen (Ian McShane), possibly the best, most complex, and mesmerizing villain seen on TV in years. Each of these characters, and many others, will forge alliances and feuds, cope with disasters (such as smallpox), and move--almost invisibly but inexorably--toward some semblance of order and common cause. Making it all worthwhile is Milch's masterful dialogue--often profane, sometimes courtly and civilized, never perfunctory--and the brilliant acting of the aforementioned performers plus others.\", '--Tom Keogh']\n{'Format': 'Multiple Formats, Box set, Widescreen, Subtitled, Closed-captioned, Color, NTSC', 'Contributor': 'Ian McShane, Timothy Olyphant', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '19', 'Runtime': '33 hours and 26 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 2 inches; 2 Pounds', 'Media Format': 'Multiple Formats, Box set, Widescreen, Subtitled, Closed-captioned, Color, NTSC', 'Run time': '33 hours and 26 minutes', 'Release date': 'December 9, 2008', 'Actors': 'Ian McShane, Timothy Olyphant', 'Subtitles': 'English', 'Studio': 'HBO Studios', 'Number of discs': '19'}\nThe Deadwood tv serial was a tremendous hit and we loved every episode so much that we jumped on the opportunity to own the entire series\nlove this\nThe Great Outdoors [DVD]\nDan Aykroyd  (Actor),     John Candy  (Actor),     Howard Deutch  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['When an unannounced, uninvited and unwelcome family of fun-loving misfits converge upon a lakeside resort to join their relatives for a summer of relaxation, the result is anything but restful in this raucous comedy starring Dan Aykroyd and John Candy.It\\'s a vacationer\\'s worst nightmare, as wheeler-dealer Aykroyd, his sexually repressed wife and eerie twin daughters \"join\" the easygoing Candy and his straight-laced clan for a season of \"fun\" in the sun. Unfortunately, the only thing these two in-laws have in common is their intense dislike for each other. Soon, it\\'s brother-in-law against brother-in-law in an uproarious and hilarious fight to the finish to see which one really knows how to enjoy The Great Outdoors.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert ProskyAnnette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert Prosky  See more', 'Initial release date': '2006-02-14', 'Language': 'Unqualified, Spanish (Dolby Surround), French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.54 Ounces', 'Item model number': 'MFR025192022821#N', 'Director': 'Howard Deutch', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 31 minutes', 'Release date': 'February 14, 2006', 'Actors': 'Dan Aykroyd, John Candy, Annette Bening, Chris Young, Stephanie Faracy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Arne Schmidt, John Hughes', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\none of beloved John Candy's best movies-he will be sorely missed yet can live on in this sweet and funny movie\na classic\nWoodstock: Three Days of Peace & Music (Two-Disc 40th Anniversary Director's Cut)\nJoan Baez  (Actor),     Joe Cocker  (Actor),     Michael Wadleigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Woodstock 3 Days of Peace and Music Director's Cut 40th Anniversary Special Edition (DVD)\", '1969 was a year unlike any other. Man first set foot on the moon. The New York Mets won the World Series against all odds. And for three days in the rural town of Bethel, New York, half a million people experienced the single most defining moment of their generation; a concert unprecedented in scope and influence, a coming together of people from all walks of life with a single common goal: Peace and music. They called it Woodstock. One year later, a landmark Oscar®-winning documentary captured the essence of the music, the electricity of the performances, and the experience of those who lived it. Newly remastered, the film features legendary performances by 17 best selling artists.', ']]>', 'Amazon.com', 'The three-day Woodstock music festival in 1969 was the pivotal event of the 1960s peace movement, and this landmark concert film is the definitive record of that milestone of rock & roll history. It\\'s more than a chronicle of the hippie movement, however; this is a film of genuine historical and social importance, capturing the spirit of America in transition, when the Vietnam War was at its peak and antiwar protest was fully expressed through the liberating music of the time. With a brilliant crew at his disposal (including a young editor named Martin Scorsese), director Michael Wadleigh worked with over 300 hours of footage to create his original 225-minute director\\'s cut, which was cut by 40 minutes for the film\\'s release in 1970. Eight previously edited segments were restored in 1994, and the original director\\'s cut of Woodstock is now the version most commonly available on videotape and DVD. The film deservedly won the Academy Award for Best Documentary, and it\\'s still a stunning achievement. Abundant footage taken among the massive crowd (\"half a million strong\") expresses the human heart of the event, from skinny-dipping hippies to accidental overdoses, to unpredictable weather, midconcert childbirth, and the thoughtful (or just plain rambling) reflections of the festive participants. Then, of course, there is the music--a nonstop parade of rock & roll from the greatest performers of the period, including Crosby, Stills, and Nash, Canned Heat, The Who, Richie Havens, Joan Baez, Ten Years After, Sly & The Family Stone, Santana, and many more. Watching this ambitious film, as the saying goes, is the next best thing to being there--it\\'s a time-travel journey to that once-in-a-lifetime event. --', 'Jeff Shannon', 'Product Description', '1969 was a year unlike any other. Man first set foot on the moon. The New York Mets won the World Series against all odds. And for three days in the rural town of Bethel, New York, half a million people experienced the single most defining moment of their generation; a concert unprecedented in scope and influence, a coming together of people from all walks of life with a single common goal: Peace and music. They called it Woodstock. One year later, a landmark Oscar®-winning documentary captured the essence of the music, the electricity of the performances, and the experience of those who lived it. Newly remastered, the film features legendary performances by 17 best selling artists. Bonus content includes: • NEW retrospective The Museum at Bethel Woods: The Story of the Sixties & Woodstock.', 'Stills from', \"Woodstock: 3 Days of Peace & Music Director's Cut\"]\n{'Genre': 'Musicals', 'Format': \"Multiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, RestoredMultiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, Restored   See more\", 'Contributor': 'Sly & the Family Stone, Crosby, Stills, Nash & Young, Janis Joplin, Richie Havens, Joe Cocker, The Jefferson Airplane, Michael Wadleigh, John Sebastian, The Who, Country Joe and the Fish, Santana, Dale Bell, Ten Years After, Arlo Guthrie, Joan Baez, Bob MauriceSly & the Family Stone, Crosby, Stills, Nash & Young, Janis Joplin, Richie Havens, Joe Cocker, The Jefferson Airplane, Michael Wadleigh, John Sebastian, The Who, Country Joe and the Fish, Santana, Dale Bell, Ten Years After, Arlo Guthrie, Joan Baez, Bob Maurice   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': '40-1000026403', 'Director': 'Michael Wadleigh', 'Media Format': \"Multiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, Restored\", 'Run time': '3 hours and 44 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Joan Baez, Joe Cocker, Country Joe and the Fish, Crosby, Stills, Nash & Young, Arlo Guthrie', 'Subtitles': 'English, French, Spanish', 'Producers': 'Bob Maurice, Dale Bell', 'Studio': 'Warner Home Video', 'Number of discs': '2'}\nI can't wait to surprise some of my friends with this superb anniversary edition of the Woodstock music festival of 1969\ngreat gift for your ex-hippie friends\nDances With Wolves\nMary McDonnell  (Actor),     Graham Greene  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Dances Wolves 25 Anniversary (RPKG/DVD)', 'Set in 1863, a solitary U.S. cavalryman outposted in the remote frontier learns the ways of the Sioux. Though his misconceptions about them are quickly dispelled, he must protect them from the ravages of his fellow cavalrymen, come to \"civilize\" the far frontier.', ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 5 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant, Floyd Red Crow Westerman', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Jake Eberts, Kevin Costner, Jim Wilson', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Blake', 'Number of discs': '1'}\nLOVED this beautiful movie. Kevin Costner is amazing and the scenery is gorgeous. I can see why he bought land and property in South Dakota after making this movie.\nclassic costner\nJOANNA LUMLEY'S GREEK ODYSSEY\nJoanna Lumley  (Actor),     Rob Farquhar  (Director),     Dominic Ozanne  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Joanna Lumleys Greek']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'unknown', 'Director': 'Rob Farquhar, Dominic Ozanne', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 3 minutes', 'Release date': 'January 14, 2014', 'Actors': 'Joanna Lumley', 'Subtitles': 'English', 'Studio': 'Athena', 'Number of discs': '1'}\nJoanna Lumley from &#34;AbFab&#34; is the most wonderful tour guide.I would love to accompany her on her big adventures. She is fearless, plucky and up for anything the &#34;Locals&#34; present to her. She will eat anything, go anywhere by any means, and is delightful and compassionate..\nJoanna Lumley has another travel hit",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Sleepy Hollow\nReview Date: 2012/12/14\nStore: Johnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Master storyteller Tim Burton (', 'Batman', ',', 'Edward Scissorhands', ') weaves an eerie, enchanting version of this classic tale of horror. Johnny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderous Headless Horseman. Christina Ricci is Katrina Van Tassel, the beautiful and mysterious girl with secret ties to the supernatural terror.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': 'MFR097363296249#VG', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Closed-captioned, Color, Dolby, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Studio': 'Paramount', 'Writers': 'Andrew Kevin Walker, Kevin Yagher, Washington Irving', 'Number of discs': '1'}\nReview Text: everyone should own this dvd and watch every Thanksgiving, as we have for years. Johnny Depp is marvelous and quirky\nReview Title: A Classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Home Alone\nReview Date: 2012/12/14\nStore: Macaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Accidentally left by his Paris-bound family, an 8-year-old makes mincemeat of two burglars in the house.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': \"Kieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts Blossom, Larry Hankin, Gerry Bamman, Chris ColumbusKieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts…  See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.52 x 5.29 x 7.43 inches; 1.6 Ounces', 'Item model number': '24543027188', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Roberts Blossom', 'Studio': '20TH CENTURY STUDIOS', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Christmas means a viewing of &#34;Home Alone&#34; for my family every year and we always enjoy it as much as the 1st time. This purchase was a gift.\nReview Title: Classic Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: White Christmas\nReview Date: 2012/12/14\nStore: Bing Crosby  (Actor),     Danny Kaye  (Actor),     Michael Curtiz  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Two talented son-and-dance men (Bing Crosby and Danny Kaye) team up after the war to become one of the hottest acts in show business.']\nAverage Rating: 4.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.39 x 7.65 inches; 4.48 Ounces', 'Director': 'Michael Curtiz', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Original recording remastered, Subtitled, Widescreen, Restored', 'Run time': '2 hours', 'Release date': 'November 3, 2009', 'Actors': 'Bing Crosby, Danny Kaye, Rosemary Clooney, Vera Ellen, Dean Jagger', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Language': 'Unqualified', 'Studio': 'Paramount', 'Writers': 'Norman Krasna, Norman Panama, Melvin Frank', 'Number of discs': '2'}\nReview Text: Classic doesn't even begin to describe this perennial favorite. Who could ever get tired of Bing Crosby, Danny Kaye and Rosemary Clooney-singing and Dancing? wonderful escapism\nReview Title: Have ALways Loved It\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/01/24\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nReview Text: I always buy my videos and cds from AMazon-top quality-quick ship. Best source for the best products you can buy\nReview Title: quick ship/great quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Triplets of Belleville\nReview Date: 2013/02/15\nStore: Sylvain Chomet  (Director)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Comedy\nProduct Description: [\"You've never seen anything like\", 'The Triplets of Belleville', ', a wildly inventive and highly original animated feature crowded with colorful characters and fantastic imagery. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas. The motley sleuths follow the clues to an Underground betting parlor and now the chase is on! Richly imagined, wildly inventive and acclaimed as one of the best films of the year, \"', 'Triplets', 'is terrific!\" - Richard Corliss, TIME MAGAZINE.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Contributor': 'Didier Brunner, Les Armateurs, Viviane Vanfleteren, Sylvain Chomet', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 8 Ounces', 'Item model number': '03231', 'Director': 'Sylvain Chomet', 'Media Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'May 4, 2004', 'Dubbed': 'English, Spanish', 'Producers': 'Didier Brunner, Viviane Vanfleteren', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This dvd is enchanting and hysterically funny while at the same time being charming and a great deal of entertainment\nReview Title: funny dvd\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Bridge: Mackinac Island's Hidden Season\nReview Date: 2013/02/15\nStore: Jenifer Silvernale (Actor),  Mark Rensel (Writer)\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nAverage Rating: 4.6\nProduct Details: {'Publisher': 'Icebridgemovie (January 1, 2008)', 'Item Weight': '2.93 ounces'}\nReview Text: this dvd brings back the wonders of Mackinac Island and shows how beautiful and unique it is even in the dead of winter\nReview Title: enjoyed\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pussycat Dolls: Dancer's Body Workout\nReview Date: 2013/02/15\nStore: Robin Antin  (Actor),     Andrea Ambandos  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: [\"Pussycat Dolls creator Robin Antin specially designed this workout to bring out your sexy side while working your whole body. You'll learn to move with confidence as you dance your way to into show-stopping shape. With a soundtrack of hit Pussycat Dolls songs that are guaranteed to keep you energized, this fun and fierce workout uses signature PCD moves to help burn fat, build muscle, and create the lean, toned body of a dancer. Inside every woman is a pussycat doll just waiting to come out. Unleash Yours!Feature Dance Segments:-When I Grow Up-Wait A Minute-Burlesque-Style Chair DanceBONUS! The Purrfect 4-Minute Workout:A quick but effective routine that fits into any schedule.\"]\nAverage Rating: 3.9\nProduct Details: {'Genre': 'exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Robin Antin, Andrea Ambandos', 'Language': 'English', 'Runtime': '57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '0454899059', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '57 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Robin Antin', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nReview Text: I thought that this was a workout I could do and if the Pussycat Dolls could look this good and this workout maintained that look, I wanted it!\nReview Title: good stuff\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Deadwood: The Complete Series\nReview Date: 2013/02/15\nStore: Ian McShane  (Actor),     Timothy Olyphant  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Deadwood: The Complete Series (DVD)', 'The Black Hills of South Dakota. Witness the birth of an American frontier town - and the ruthless power struggle between its just and unjust pioneers.', ']]>', 'Amazon.com', 'Deadwood', 'represents one of those periodic, wholesale reinventions of the Western that is as different from, say,', 'Lonesome Dove', \"as that miniseries is from Howard Hawks's\", 'Rio Bravo', \"or the latter is from Anthony Mann's\", 'The Naked Spur', \". In many ways, HBO's\", 'Deadwood', \"embraces the Western's unambiguous morality during the cinema's silent era through the 1930s while also blazing trails through a post-\", 'NYPD Blue', ', post-', 'The West Wing', 'television age exalting dense and customized dialogue. On top of that,', 'Deadwood', \"has managed an original look and texture for a familiar genre: gritty, chaotic, and surging with both dark and hopeful energy. Yet the show's creator, erstwhile\", 'NYPD Blue', 'head writer David Milch, never ridicules or condescends to his more grasping, futile characters or overstates the virtues of his heroic ones.', 'Set in an ungoverned stretch of South Dakota soon after the 1876 Custer massacre,', 'Deadwood', \"concerns a lawless, evolving town attracting fortune-seekers, drifters, tyrants, and burned-out adventurers searching for a card game and a place to die. Others, particularly women trapped in prostitution, sundry do-gooders, and hangers-on have nowhere else to go. Into this pool of aspiration and nightmare arrive former Montana lawman Seth Bullock (Timothy Olyphant) and his friend Sol Starr (John Hawkes), determined to open a lucrative hardware business. Over time, their paths cross with a weary but still formidable Wild Bill Hickok (Keith Carradine) and his doting companion, the coarse angel Calamity Jane (Robin Weigert); an aristocratic, drug-addicted widow (Molly Parker) trying to salvage a gold mining claim; and a despondent hooker (Paula Malcomson) who cares, briefly, for an orphaned girl. Casting a giant shadow over all is a blood-soaked king, Gem Saloon owner Al Swearengen (Ian McShane), possibly the best, most complex, and mesmerizing villain seen on TV in years. Each of these characters, and many others, will forge alliances and feuds, cope with disasters (such as smallpox), and move--almost invisibly but inexorably--toward some semblance of order and common cause. Making it all worthwhile is Milch's masterful dialogue--often profane, sometimes courtly and civilized, never perfunctory--and the brilliant acting of the aforementioned performers plus others.\", '--Tom Keogh']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, Box set, Widescreen, Subtitled, Closed-captioned, Color, NTSC', 'Contributor': 'Ian McShane, Timothy Olyphant', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '19', 'Runtime': '33 hours and 26 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 2 inches; 2 Pounds', 'Media Format': 'Multiple Formats, Box set, Widescreen, Subtitled, Closed-captioned, Color, NTSC', 'Run time': '33 hours and 26 minutes', 'Release date': 'December 9, 2008', 'Actors': 'Ian McShane, Timothy Olyphant', 'Subtitles': 'English', 'Studio': 'HBO Studios', 'Number of discs': '19'}\nReview Text: The Deadwood tv serial was a tremendous hit and we loved every episode so much that we jumped on the opportunity to own the entire series\nReview Title: love this\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Great Outdoors [DVD]\nReview Date: 2013/06/10\nStore: Dan Aykroyd  (Actor),     John Candy  (Actor),     Howard Deutch  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['When an unannounced, uninvited and unwelcome family of fun-loving misfits converge upon a lakeside resort to join their relatives for a summer of relaxation, the result is anything but restful in this raucous comedy starring Dan Aykroyd and John Candy.It\\'s a vacationer\\'s worst nightmare, as wheeler-dealer Aykroyd, his sexually repressed wife and eerie twin daughters \"join\" the easygoing Candy and his straight-laced clan for a season of \"fun\" in the sun. Unfortunately, the only thing these two in-laws have in common is their intense dislike for each other. Soon, it\\'s brother-in-law against brother-in-law in an uproarious and hilarious fight to the finish to see which one really knows how to enjoy The Great Outdoors.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert ProskyAnnette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert Prosky  See more', 'Initial release date': '2006-02-14', 'Language': 'Unqualified, Spanish (Dolby Surround), French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.54 Ounces', 'Item model number': 'MFR025192022821#N', 'Director': 'Howard Deutch', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 31 minutes', 'Release date': 'February 14, 2006', 'Actors': 'Dan Aykroyd, John Candy, Annette Bening, Chris Young, Stephanie Faracy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Arne Schmidt, John Hughes', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: one of beloved John Candy's best movies-he will be sorely missed yet can live on in this sweet and funny movie\nReview Title: a classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Woodstock: Three Days of Peace & Music (Two-Disc 40th Anniversary Director's Cut)\nReview Date: 2013/10/18\nStore: Joan Baez  (Actor),     Joe Cocker  (Actor),     Michael Wadleigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"Woodstock 3 Days of Peace and Music Director's Cut 40th Anniversary Special Edition (DVD)\", '1969 was a year unlike any other. Man first set foot on the moon. The New York Mets won the World Series against all odds. And for three days in the rural town of Bethel, New York, half a million people experienced the single most defining moment of their generation; a concert unprecedented in scope and influence, a coming together of people from all walks of life with a single common goal: Peace and music. They called it Woodstock. One year later, a landmark Oscar®-winning documentary captured the essence of the music, the electricity of the performances, and the experience of those who lived it. Newly remastered, the film features legendary performances by 17 best selling artists.', ']]>', 'Amazon.com', 'The three-day Woodstock music festival in 1969 was the pivotal event of the 1960s peace movement, and this landmark concert film is the definitive record of that milestone of rock & roll history. It\\'s more than a chronicle of the hippie movement, however; this is a film of genuine historical and social importance, capturing the spirit of America in transition, when the Vietnam War was at its peak and antiwar protest was fully expressed through the liberating music of the time. With a brilliant crew at his disposal (including a young editor named Martin Scorsese), director Michael Wadleigh worked with over 300 hours of footage to create his original 225-minute director\\'s cut, which was cut by 40 minutes for the film\\'s release in 1970. Eight previously edited segments were restored in 1994, and the original director\\'s cut of Woodstock is now the version most commonly available on videotape and DVD. The film deservedly won the Academy Award for Best Documentary, and it\\'s still a stunning achievement. Abundant footage taken among the massive crowd (\"half a million strong\") expresses the human heart of the event, from skinny-dipping hippies to accidental overdoses, to unpredictable weather, midconcert childbirth, and the thoughtful (or just plain rambling) reflections of the festive participants. Then, of course, there is the music--a nonstop parade of rock & roll from the greatest performers of the period, including Crosby, Stills, and Nash, Canned Heat, The Who, Richie Havens, Joan Baez, Ten Years After, Sly & The Family Stone, Santana, and many more. Watching this ambitious film, as the saying goes, is the next best thing to being there--it\\'s a time-travel journey to that once-in-a-lifetime event. --', 'Jeff Shannon', 'Product Description', '1969 was a year unlike any other. Man first set foot on the moon. The New York Mets won the World Series against all odds. And for three days in the rural town of Bethel, New York, half a million people experienced the single most defining moment of their generation; a concert unprecedented in scope and influence, a coming together of people from all walks of life with a single common goal: Peace and music. They called it Woodstock. One year later, a landmark Oscar®-winning documentary captured the essence of the music, the electricity of the performances, and the experience of those who lived it. Newly remastered, the film features legendary performances by 17 best selling artists. Bonus content includes: • NEW retrospective The Museum at Bethel Woods: The Story of the Sixties & Woodstock.', 'Stills from', \"Woodstock: 3 Days of Peace & Music Director's Cut\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Musicals', 'Format': \"Multiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, RestoredMultiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, Restored   See more\", 'Contributor': 'Sly & the Family Stone, Crosby, Stills, Nash & Young, Janis Joplin, Richie Havens, Joe Cocker, The Jefferson Airplane, Michael Wadleigh, John Sebastian, The Who, Country Joe and the Fish, Santana, Dale Bell, Ten Years After, Arlo Guthrie, Joan Baez, Bob MauriceSly & the Family Stone, Crosby, Stills, Nash & Young, Janis Joplin, Richie Havens, Joe Cocker, The Jefferson Airplane, Michael Wadleigh, John Sebastian, The Who, Country Joe and the Fish, Santana, Dale Bell, Ten Years After, Arlo Guthrie, Joan Baez, Bob Maurice   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': '40-1000026403', 'Director': 'Michael Wadleigh', 'Media Format': \"Multiple Formats, AC-3, Color, Dolby, NTSC, Original recording remastered, Special Edition, Subtitled, Director's Cut, Widescreen, Restored\", 'Run time': '3 hours and 44 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Joan Baez, Joe Cocker, Country Joe and the Fish, Crosby, Stills, Nash & Young, Arlo Guthrie', 'Subtitles': 'English, French, Spanish', 'Producers': 'Bob Maurice, Dale Bell', 'Studio': 'Warner Home Video', 'Number of discs': '2'}\nReview Text: I can't wait to surprise some of my friends with this superb anniversary edition of the Woodstock music festival of 1969\nReview Title: great gift for your ex-hippie friends\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dances With Wolves\nReview Date: 2013/10/20\nStore: Mary McDonnell  (Actor),     Graham Greene  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Dances Wolves 25 Anniversary (RPKG/DVD)', 'Set in 1863, a solitary U.S. cavalryman outposted in the remote frontier learns the ways of the Sioux. Though his misconceptions about them are quickly dispelled, he must protect them from the ravages of his fellow cavalrymen, come to \"civilize\" the far frontier.', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 5 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant, Floyd Red Crow Westerman', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Jake Eberts, Kevin Costner, Jim Wilson', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Blake', 'Number of discs': '1'}\nReview Text: LOVED this beautiful movie. Kevin Costner is amazing and the scenery is gorgeous. I can see why he bought land and property in South Dakota after making this movie.\nReview Title: classic costner\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: JOANNA LUMLEY'S GREEK ODYSSEY\nReview Date: 2014/02/02\nStore: Joanna Lumley  (Actor),     Rob Farquhar  (Director),     Dominic Ozanne  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Joanna Lumleys Greek']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'unknown', 'Director': 'Rob Farquhar, Dominic Ozanne', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 3 minutes', 'Release date': 'January 14, 2014', 'Actors': 'Joanna Lumley', 'Subtitles': 'English', 'Studio': 'Athena', 'Number of discs': '1'}\nReview Text: Joanna Lumley from &#34;AbFab&#34; is the most wonderful tour guide.I would love to accompany her on her big adventures. She is fearless, plucky and up for anything the &#34;Locals&#34; present to her. She will eat anything, go anywhere by any means, and is delightful and compassionate..\nReview Title: Joanna Lumley has another travel hit\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual's purchase history reflects a strong preference for classic films, particularly those with a nostalgic or comedic theme, often enjoyed during specific seasons or holidays. Consistently high ratings indicate a sentiment of appreciation for memorable performances, especially from actors like Johnny Depp and John Candy, which enhances their viewing experience.\n\nThemes of family and tradition emerge, as indicated by multiple references to holiday favorites shared with family, pointing to products serving as comforting, repeated rituals. Quality appears paramount, with high ratings frequently granted; however, there is some price sensitivity as seen with a mix of mainstream and niche selections, suggesting a balanced approach to spending.\n\nThis buyer demonstrates an affinity for diverse genres, enjoying both animation and serious dramas, indicating an openness to varied storytelling styles. Additionally, there is an acknowledgment of non-traditional formats, such as documentaries, that explore cultural phenomena, highlighting a preference for enriching content. Overall, this customer enjoys high-quality entertainment that encapsulates nostalgia, familial connections, and unique storytelling experiences, valuing both critically acclaimed and classic works.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Love Steve and John",
    "text": "Not as funny as some of their other movies(independently of each other), but still a good time and several laughs to be had.",
    "images": [],
    "asin": "B00AEFYVMO",
    "parent_asin": "B00AEFYVMO",
    "user_id": "AGRCMTNBBLDAQWAQ4UCZJAR52IMQ",
    "timestamp": "2014-02-02 03:51:55",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Planes, Trains And Automobiles",
    "average_rating": 4.8,
    "rating_number": 23345,
    "features": [],
    "description": [
      "Planes, Trains And Automobiles (DVD)",
      "Steve Martin and John Candy star in John Hughes’ classic tale of holiday travel gone awry. Neal Page (Martin) is an uptight adverti sing execut ive trying to get home to Chicago for Thanksgiving. When his flight is r erouted to Wichita, he reluctantly partners with Del Griffith (Candy), a n obnoxious yet loveable salesman. Together, they embark on a cross-coun try adventure that includes various m odes of transportation, hilarious mishaps, and unforgettable rental car shenanigans. Planes, Trains an d Automobiles is “a screwb all comedy with a heart” (Roger Ebert, Chicag o Sun-Times). Now with all-new bonus features, the “Those Aren’t Pillows !” Edition is a perfect holiday treat that lasts all year.",
      "]]>"
    ],
    "price": 11.43,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51eqy0yOqWL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51eqy0yOqWL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91zrIDcx9zL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Various  (Actor, Director)    Rated:    R    Format: DVD",
    "categories": [
      "Movies & TV",
      "Studio Specials",
      "Warner Home Video",
      "All Titles"
    ],
    "details": {
      "Genre": "Drama, Comedy, Action & Adventure",
      "Format": "Multiple Formats, Color, Dolby, NTSC",
      "Contributor": "Various",
      "Language": "English (Dolby Digital 5.1), Spanish (Mono)",
      "Runtime": "1 hour and 32 minutes",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.08 Ounces",
      "Item model number": "8.83929E+11",
      "Director": "Various",
      "Media Format": "Multiple Formats, Color, Dolby, NTSC",
      "Run time": "1 hour and 32 minutes",
      "Release date": "October 20, 2009",
      "Actors": "Various",
      "Studio": "Warner Bros.",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}