{
  "user_id": "AGXLOYCUY4XPBMRRDRT64HCI472Q",
  "summary": "=== Purchase Information ===\nProduct Title: G.\nReview Date: 2012/07/20\nStore: Richard Jones  (Actor),     Blair Underwood  (Actor),     Christopher Scott Cherot  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Richard T. Jones (Guess Who, TV\\'s \"The Wire\"), Blair Underwood (Madea\\'s Family Reunion, TV\\'s \"Fatherhood\"), Chenoa Maxwell (Doing Hard Time, Hav Plenty), Andre Royo (Shaft, TV\\'s \"The Wire\"), Andrew Lauren (Conspiracy Theory), Laz Alonzo (Jarhead, The Tenants) star in G, a tragedy-filled story of a young Great Gatsby-ish Hip-Hopper named Summer G who falls for a middle- to upper-class sistah while in college. After she rejects him for a fellow social climber, Summer G spends ten years building a Hip-Hop empire, and then moves to the Hamptons where he finds the object of his affections. Cinematic urban tastemaker movie which highlights an African-American aristocratic lifestyle.', 'Amazon.com', 'G.', 'is an engrossing update of', 'The Great Gatsby', \", set in the Hamptons and starring Richard T. Jones as Summer G., a self-made, millionaire head of a hip-hop label. Having risen from obscurity to make his fortune, Summer pines for just one thing: Sky (Chenoa Maxwell), the woman who dumped him back in college to marry the brutal, philandering Chip (Blair Underwood). Sky's feckless cousin, Tre (Andre Royer), a pop journalist, sets her up in an assignation with Summer, leading to predictable conflicts but with unexpected consequences. Co-written and directed by Christopher Scott Cherot,\", 'G.', 'is also an interesting portrait of American wealth, particularly the collision of old and new money in the form of a biracial aristocracy coming to terms with a hip-hop elite. Strong performances alone are enough to recommend this feature.', '--Tom Keogh']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Contributor': 'Judd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard JonesJudd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard Jones   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 4.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396143951', 'Director': 'Christopher Scott Cherot', 'Media Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'March 28, 2006', 'Actors': 'Richard Jones, Blair Underwood, Chenoa Maxwell', 'Subtitles': 'English, French', 'Producers': 'Andrew Lauren, Judd Landon', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This is a movie to watch when you want to see a bunch of beautiful actors, in an even more beautiful setting, entertaining the audience with a very engaging love story. It is sexy, it is hip, and it is addicting.<br /><br />My only and biggest complaint is that there is no place to find the music soundtrack.  In fact, it is the main reason why I bought this DVD.  Haunting and gorgous, I just wish it was available somewhere.\nReview Title: Guilty Pleasure\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spirited Away\nReview Date: 2012/10/08\nStore: Hayao Miyazaki  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', 'From one of the most celebrated filmmakers in the history of animated cinema comes the most acclaimed film of 2002. Hayao Miyazaki\\'s latest triumph, filled with astonishing animation and epic adventure, is a dazzling masterpiece for the ages. It\\'s a \"wonderfully welcoming work of art that\\'s as funny and entertaining as it is brilliant, beautiful, and deep\" (Joe Morgenstern, Wall Street Journal). SPIRITED AWAY is a wondrous fantasy about a young girl, Chihiro, trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free herself and return her family to the outside world. An unforgettable story brimming with creativity, SPIRITED AWAY will take you on a journey beyond your imagination. \"To enter the world of Hayao Miyazaki is to experience a kind of lighthearted enchantment that is unique to the world of animation\" (Roger Ebert, Chicago Sun-Times). It\\'s a fantastic tale the whole family will want to experience over and over again.~~(c) 2001 Nibariki -- GNDDTM', 'Set Contains:', 'The most interesting extra feature on the two-disc set is the Nippon Television Special on the making of', 'Spirited Away', ', not because it\\'s significantly different from American making-of programs, but because the camera crew was allowed to film Miyazaki at work. It\\'s fascinating to watch the visionary director explaining how individual movements should be animated, and even performing the little dance the frog-master does to welcome the No-Face to Yubaba\\'s bath house. (Old animators describe Walt Disney giving similar performances, but no comparable footage exists.) It\\'s also striking to see how intimate Studio Ghibli is, unencumbered by the tiers of management that burden American studios. The scene comparisons enable the viewer to study the storyboards for the film, which Miyazaki draws himself. These simple yet wonderfully vivid images capture the essence of a mood, a movement, an expression. \"Behind the Microphone\" offers a fairly standard behind-the-scenes look at the creation of the excellent English version of', 'Spirited Away', '.', '--Charles Solomon']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Fantasy', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Hayao Miyazaki', 'Language': 'French (Dolby Digital 2.0 Surround), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.3 x 7.52 inches; 4.32 Ounces', 'Item model number': 'UPC# 7869 3621 3843', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 15, 2003', 'Studio': 'Walt Disney Home Entertainment Presents A Studio Ghibli Film', 'Number of discs': '1'}\nReview Text: To try and describe this movie is kind of crazy.  I mean there's this little girl in a world inhabited by strange and curious spirits who must rescue her parents from a frightening and terrible fate. But the journey is so much more than a simple description.<br /><br />The animation is just gorgeous, the story is captivating and unique, and the musical score is so haunting and beautiful, you will find yourself remembering the themes long after the movie is over. Please give it a chance and allow yourself to be swept away by this special little film.\nReview Title: A beautiful, thoughtful experience\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Code Name: Dancer [DVD]\nReview Date: 2012/10/26\nStore: Kate Capshaw  (Actor),     Jeroen Krabb  (Actor),     Buzz Kulik  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nAverage Rating: 4.3\nProduct Details: {'Format': 'Color, DVD, Full Screen, NTSC', 'Contributor': 'Tracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robin Hudis, Andaluz Russell, Francisco Cuevas, Hilary Perez, Guillermo Ros, Valerie Mahaffey, Gregory SierraTracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robi…  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.16 Ounces', 'Director': 'Buzz Kulik', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'May 4, 2004', 'Actors': 'Kate Capshaw, Jeroen Krabb, Gregory Sierra, Valerie Mahaffey, James Sloyan', 'Studio': 'Trinity Home Ent', 'Number of discs': '1'}\nReview Text: I, like others have written, only saw this movie once many years back - but it stuck with me. It's never been re- broadcast that I could tell and I just figured for the price why not buy it.<br /><br />There was nothing on tv worth watching so we popped the film in and had a really enjoyable time watching it. In fact it is eons better than some of the garbage currently on.<br /><br />Great love story, top notch actors and a pretty decent story. For a couple of hours I escaped into a very pleasant movie.<br /><br />If anyone out there has any influence, please get some network to give this film some air time. If even if its just on the Lifetime channel.  I'm certain the viewers would love it.\nReview Title: Fun movie - even if a tad bit dated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: HOME ALONE 2: LOST IN NEW YORK\nReview Date: 2013/01/25\nStore: Macaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\nProduct Description: ['Macaulay Culkin, Joe Pesci, Daniel Stern. The bad guys get it, and the little kid gives it to them-only this time in the colorful setting of New York City. 1992/color/102 min/PG/widescreen.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': \"Maureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie Bracken, Gerry Bamman, Chris ColumbusMaureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie B…  See more\", 'Language': 'Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.3 x 7.53 inches; 2.4 Ounces', 'Item model number': 'FOXS2289224DVD', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Devin Ratray', 'Studio': 'TWENTIETH CENTURY FOX', 'Number of discs': '1'}\nReview Text: The real reason why I wanted this film has everything to do with the ending. I know that seems weird but as a native New Yorker, I just love the scenes between a mom and her son in front of the most spectacular Christmas Tree in the world.  So, there it is.<br /><br />The movie isn't particularly bad or good.  Pretty much the same formula as the first movie with just a few more predictable changes.  But I don't mind sitting through it and going along for the ride.  I could do far worse.\nReview Title: Guilty Pleasure - okay movie\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jane Fonda: AM/PM Yoga For Beginners [DVD]\nReview Date: 2013/01/25\nStore: Jane Fonda  (Actor),     Cal Pozo  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Jane Fonda is back again with yoga designed for baby boomers! Build strength, improve flexibility and relax the body with AM/PM YOGA FOR BEGINNERS.']\nAverage Rating: 4.4\nProduct Details: {'Color': 'Multicoloured', 'Brand': 'LIONSGATE', 'Product Care Instructions': 'Hand Wash Only', 'Item Weight': '0.14 Pounds', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Audio Description': 'English', 'Item model number': '10309110', 'Director': 'Cal Pozo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 11 minutes', 'Release date': 'December 4, 2012', 'Actors': 'Jane Fonda', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: I bought this for a good friend as a New Year's resolution kind of gift. She was interested in yoga but didn't want to make a huge investment until she knew what it was all about.  Apparently she is very happy with the program and the instructions. She says that you don't feel a lot of pressure and the pace is perfect for a person who hasn't exercised a lot in their life and wants to gradually get into it. Makes sense to me and if she's happy - then I'm happy for her.\nReview Title: Seems to be okay\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/05/25\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Singleton'], 'Producers': ['Jane Bartelme', 'Jeremy Bell', 'Patrick Crowley', 'Doug Davison', 'Ellen Goldsmith-Vein', 'Wolfgang Hammer', 'Anthony Katagas', 'Dan Lautner', 'Roy Lee'], 'Starring': ['Taylor Lautner', 'Lily Collins', 'Alfred Molina'], 'Studio': ['IMDB Freedive']}\nReview Text: Even though I found this movie to be somewhat predictable, sometimes it's just fun to let go and enjoy the ride.<br /><br />The acting is very good, the action and conflict are intense and the film moves along at a quick pace.  The story is basically an updated version of the whole \"boy on the milk carton\" scenario, revised as the \"boy on the website\".  Clever and plausible.<br /><br />Need something to watch when you're out of options - this film is a good choice for some fueled up energy and an entertaining night at the movies.\nReview Title: Keeps your attention - entertaining\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/08/10\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robson', 'Mark'], 'Producers': ['David Weisbart'], 'Starring': ['Barbara Parkins', 'Patty Duke', 'Paul Burke'], 'Studio': ['Crowd Pleasers']}\nReview Text: Every now & then I just feel like watching something totally mindless and brain dead (not me, the movie!) and this perfectly fits the bill.<br /><br />The story, the setting, the horrific attempts at acting and the complete unavailability of some type of cohesive editing make this film the ideal candidate for those rainy days when Lifetime Channel is showing something you've seen one too many times.  In fact, it's more like horrific success at over-acting that leaves me mesmerized.<br /><br />Don't worry too much about the story of three young women of the 60's trying to succeed in modeling, film, broadway and love.  Just sit back with a chilled bottle of wine, some crackers & cheese, and a couple of hours to give yourself a break and have a totally entertaining afternoon at \"camp\".\nReview Title: Total camp, terrible acting - love it!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/09/07\nAverage Rating: 3.9\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joseph Sargent'], 'Producers': ['Synergy Ent'], 'Starring': ['Sally Field', 'Eleanor Parker', 'Lane Bradbury'], 'Studio': ['The Film Detective']}\nReview Text: I hadn't seen this movie since the 70's when it was an \"ABC Movie of the Week\", but it always stayed in my mind.<br /><br />The story of youth wanting to run away from the constraints of misguided adults is as old as time.  And although the clothes, characters, music and some of the dialogue is a little dated, the feelings are the same. Generational breakdown in communication pure & simple. Everyone has wanted to run away & join the circus at some point in their life.<br /><br />The acting is what actually sets this film apart from many of that period.  A very young Sally Fields, Jackie Cooper, Eleanor Parker, and a sadly under-used David Carradine (pre \"Kung Fu\") elevate this film.<br /><br />I think its worth watching & especially since Amazon offers it for free with your Prime membership. A whole lot better than most of the garbage out there right now.\nReview Title: Worth the trip down Memory Lane\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/05/24\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['William Castle'], 'Producers': ['William Castle', 'Robb White'], 'Starring': ['Vincent Price', 'Richard Long', 'Carolyn Craid'], 'Studio': ['More to Explore']}\nReview Text: A teriffic old time scary haunted house story complete with clueless guests, skanky wife, possible infidelity, things that go bump in the night and the Master himself - Vincent Price. This is just classic, black & white, shivering in the dark perfection.<br /><br />Guests invited to spend the night in a possibly haunted house for money are then terrorized throughout their experience.  But by whom.., or what?<br /><br />It may not be as nasty or clever or gory as movies that have come since then, but sit back and just enjoy a little creepy, old-time fun in the dark.\nReview Title: Scary good fun\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/09/05\nAverage Rating: 3.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Whit Stillman'], 'Producers': ['Whit Stillman'], 'Starring': ['Adam Brody', 'Chloe Sevigny', 'Carrie Maclemore'], 'Studio': ['Amazon Studios']}\nReview Text: Quirky, clever, well- acted and thoroughly enjoyable. I hope there 'll be more episodes to come. So far I 've watched this one twice and have been telling everyone I know about it.<br /><br />This show is too good for tv!  Don't miss it!\nReview Title: Another great reason to get Amazon Prime\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/12/26\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Joss Whedon'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr. Chris Evans'], 'Studio': ['Hit Movies']}\nReview Text: Plenty of action, terrific performances, often hilarious, and quite simply the gold standard of its genre. The bar has been set - good luck everyone else!\nReview Title: Without question - outstanding\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/02/20\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nReview Text: Outstanding production.<br /><br />As one if millions of dedicated readers, I am so happy to be able to enjoy this transition from book to film.  Of course we all have our own theory about how a character should look or be portrayed, but I must say I have no problem accepting this version.<br /><br />When you have great source material, the rest is gravy.\nReview Title: Excellent program honors the character\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/02/23\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English', 'English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['David Semel', 'Daniel Percival', 'Ken Olin', 'Michael Rymer', 'Bryan Spicer', 'Nelson Mccormick', 'Brad Anderson', 'Karyn Kusama', 'Michael Slovis'], 'Producers': ['Ridley Scott', 'David W. Zucker', 'Frank Spotnitz', 'Isa Dick Hackett', 'Christopher Tricarico', 'Stewart Mackinnon', 'Chrtistian Baute', 'Jace Richdale', 'Richard Heus', 'Dan Percival', 'Jordan Sheehan', 'Kalen Egan', 'Erin Smith'], 'Starring': ['Alexa Davalos', 'Rupert Evans', 'Luke Kleintank'], 'Studio': ['Amazon Studios']}\nReview Text: An extraordinary premise that has been presented in exceptional detail.<br /><br />I have been fascinated from the beginning but keep hoping that the producers will introduce more information about other country's and their position in this new world.<br /><br />All in all, I am impressed with the production, the performances and the writing.\nReview Title: An extraordinary premise that has been presented in exceptional detail ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/03/14\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Pieter Jan Brugge'], 'Starring': ['タイタス・ウェリバー', 'ジェイミー・へクター', 'エイミー・アキノ']}\nReview Text: I have read every book by this author (hoping there's a place in the future for a Lincoln Lawyer) and am still totally enthralled with this production.  It's never exactly as your imagination conjures it up, but I am totally onboard and relishing every episode.<br /><br />The thing I admire the most about this program is what an outstanding job they've done at meshing different books into overlapping storylines.  It is seamless and terrific.<br /><br />Bosch is the quality result of allowing and supporting the author to be directly involved with the process.  Obviously he knows the material but more unique to this situation is that he also knows and understands &#34;the industry&#34;. He knows how to turn a great book into great television.<br /><br />And that my friends is what is known as a slam dunk.\nReview Title: An exceptional second season\nRating: 5.0\n--------------------------------------------------",
  "reference": "G.\nRichard Jones  (Actor),     Blair Underwood  (Actor),     Christopher Scott Cherot  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Richard T. Jones (Guess Who, TV\\'s \"The Wire\"), Blair Underwood (Madea\\'s Family Reunion, TV\\'s \"Fatherhood\"), Chenoa Maxwell (Doing Hard Time, Hav Plenty), Andre Royo (Shaft, TV\\'s \"The Wire\"), Andrew Lauren (Conspiracy Theory), Laz Alonzo (Jarhead, The Tenants) star in G, a tragedy-filled story of a young Great Gatsby-ish Hip-Hopper named Summer G who falls for a middle- to upper-class sistah while in college. After she rejects him for a fellow social climber, Summer G spends ten years building a Hip-Hop empire, and then moves to the Hamptons where he finds the object of his affections. Cinematic urban tastemaker movie which highlights an African-American aristocratic lifestyle.', 'Amazon.com', 'G.', 'is an engrossing update of', 'The Great Gatsby', \", set in the Hamptons and starring Richard T. Jones as Summer G., a self-made, millionaire head of a hip-hop label. Having risen from obscurity to make his fortune, Summer pines for just one thing: Sky (Chenoa Maxwell), the woman who dumped him back in college to marry the brutal, philandering Chip (Blair Underwood). Sky's feckless cousin, Tre (Andre Royer), a pop journalist, sets her up in an assignation with Summer, leading to predictable conflicts but with unexpected consequences. Co-written and directed by Christopher Scott Cherot,\", 'G.', 'is also an interesting portrait of American wealth, particularly the collision of old and new money in the form of a biracial aristocracy coming to terms with a hip-hop elite. Strong performances alone are enough to recommend this feature.', '--Tom Keogh']\n{'Genre': 'Drama', 'Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Contributor': 'Judd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard JonesJudd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard Jones   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 4.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396143951', 'Director': 'Christopher Scott Cherot', 'Media Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'March 28, 2006', 'Actors': 'Richard Jones, Blair Underwood, Chenoa Maxwell', 'Subtitles': 'English, French', 'Producers': 'Andrew Lauren, Judd Landon', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis is a movie to watch when you want to see a bunch of beautiful actors, in an even more beautiful setting, entertaining the audience with a very engaging love story. It is sexy, it is hip, and it is addicting.<br /><br />My only and biggest complaint is that there is no place to find the music soundtrack.  In fact, it is the main reason why I bought this DVD.  Haunting and gorgous, I just wish it was available somewhere.\nGuilty Pleasure\nSpirited Away\nHayao Miyazaki  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Product Description', 'From one of the most celebrated filmmakers in the history of animated cinema comes the most acclaimed film of 2002. Hayao Miyazaki\\'s latest triumph, filled with astonishing animation and epic adventure, is a dazzling masterpiece for the ages. It\\'s a \"wonderfully welcoming work of art that\\'s as funny and entertaining as it is brilliant, beautiful, and deep\" (Joe Morgenstern, Wall Street Journal). SPIRITED AWAY is a wondrous fantasy about a young girl, Chihiro, trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free herself and return her family to the outside world. An unforgettable story brimming with creativity, SPIRITED AWAY will take you on a journey beyond your imagination. \"To enter the world of Hayao Miyazaki is to experience a kind of lighthearted enchantment that is unique to the world of animation\" (Roger Ebert, Chicago Sun-Times). It\\'s a fantastic tale the whole family will want to experience over and over again.~~(c) 2001 Nibariki -- GNDDTM', 'Set Contains:', 'The most interesting extra feature on the two-disc set is the Nippon Television Special on the making of', 'Spirited Away', ', not because it\\'s significantly different from American making-of programs, but because the camera crew was allowed to film Miyazaki at work. It\\'s fascinating to watch the visionary director explaining how individual movements should be animated, and even performing the little dance the frog-master does to welcome the No-Face to Yubaba\\'s bath house. (Old animators describe Walt Disney giving similar performances, but no comparable footage exists.) It\\'s also striking to see how intimate Studio Ghibli is, unencumbered by the tiers of management that burden American studios. The scene comparisons enable the viewer to study the storyboards for the film, which Miyazaki draws himself. These simple yet wonderfully vivid images capture the essence of a mood, a movement, an expression. \"Behind the Microphone\" offers a fairly standard behind-the-scenes look at the creation of the excellent English version of', 'Spirited Away', '.', '--Charles Solomon']\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Hayao Miyazaki', 'Language': 'French (Dolby Digital 2.0 Surround), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.3 x 7.52 inches; 4.32 Ounces', 'Item model number': 'UPC# 7869 3621 3843', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 15, 2003', 'Studio': 'Walt Disney Home Entertainment Presents A Studio Ghibli Film', 'Number of discs': '1'}\nTo try and describe this movie is kind of crazy.  I mean there's this little girl in a world inhabited by strange and curious spirits who must rescue her parents from a frightening and terrible fate. But the journey is so much more than a simple description.<br /><br />The animation is just gorgeous, the story is captivating and unique, and the musical score is so haunting and beautiful, you will find yourself remembering the themes long after the movie is over. Please give it a chance and allow yourself to be swept away by this special little film.\nA beautiful, thoughtful experience\nCode Name: Dancer [DVD]\nKate Capshaw  (Actor),     Jeroen Krabb  (Actor),     Buzz Kulik  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n{'Format': 'Color, DVD, Full Screen, NTSC', 'Contributor': 'Tracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robin Hudis, Andaluz Russell, Francisco Cuevas, Hilary Perez, Guillermo Ros, Valerie Mahaffey, Gregory SierraTracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robi…  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.16 Ounces', 'Director': 'Buzz Kulik', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'May 4, 2004', 'Actors': 'Kate Capshaw, Jeroen Krabb, Gregory Sierra, Valerie Mahaffey, James Sloyan', 'Studio': 'Trinity Home Ent', 'Number of discs': '1'}\nI, like others have written, only saw this movie once many years back - but it stuck with me. It's never been re- broadcast that I could tell and I just figured for the price why not buy it.<br /><br />There was nothing on tv worth watching so we popped the film in and had a really enjoyable time watching it. In fact it is eons better than some of the garbage currently on.<br /><br />Great love story, top notch actors and a pretty decent story. For a couple of hours I escaped into a very pleasant movie.<br /><br />If anyone out there has any influence, please get some network to give this film some air time. If even if its just on the Lifetime channel.  I'm certain the viewers would love it.\nFun movie - even if a tad bit dated\nHOME ALONE 2: LOST IN NEW YORK\nMacaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\n['Macaulay Culkin, Joe Pesci, Daniel Stern. The bad guys get it, and the little kid gives it to them-only this time in the colorful setting of New York City. 1992/color/102 min/PG/widescreen.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': \"Maureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie Bracken, Gerry Bamman, Chris ColumbusMaureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie B…  See more\", 'Language': 'Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.3 x 7.53 inches; 2.4 Ounces', 'Item model number': 'FOXS2289224DVD', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Devin Ratray', 'Studio': 'TWENTIETH CENTURY FOX', 'Number of discs': '1'}\nThe real reason why I wanted this film has everything to do with the ending. I know that seems weird but as a native New Yorker, I just love the scenes between a mom and her son in front of the most spectacular Christmas Tree in the world.  So, there it is.<br /><br />The movie isn't particularly bad or good.  Pretty much the same formula as the first movie with just a few more predictable changes.  But I don't mind sitting through it and going along for the ride.  I could do far worse.\nGuilty Pleasure - okay movie\nJane Fonda: AM/PM Yoga For Beginners [DVD]\nJane Fonda  (Actor),     Cal Pozo  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Jane Fonda is back again with yoga designed for baby boomers! Build strength, improve flexibility and relax the body with AM/PM YOGA FOR BEGINNERS.']\n{'Color': 'Multicoloured', 'Brand': 'LIONSGATE', 'Product Care Instructions': 'Hand Wash Only', 'Item Weight': '0.14 Pounds', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Audio Description': 'English', 'Item model number': '10309110', 'Director': 'Cal Pozo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 11 minutes', 'Release date': 'December 4, 2012', 'Actors': 'Jane Fonda', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nI bought this for a good friend as a New Year's resolution kind of gift. She was interested in yoga but didn't want to make a huge investment until she knew what it was all about.  Apparently she is very happy with the program and the instructions. She says that you don't feel a lot of pressure and the pace is perfect for a person who hasn't exercised a lot in their life and wants to gradually get into it. Makes sense to me and if she's happy - then I'm happy for her.\nSeems to be okay\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Singleton'], 'Producers': ['Jane Bartelme', 'Jeremy Bell', 'Patrick Crowley', 'Doug Davison', 'Ellen Goldsmith-Vein', 'Wolfgang Hammer', 'Anthony Katagas', 'Dan Lautner', 'Roy Lee'], 'Starring': ['Taylor Lautner', 'Lily Collins', 'Alfred Molina'], 'Studio': ['IMDB Freedive']}\nEven though I found this movie to be somewhat predictable, sometimes it's just fun to let go and enjoy the ride.<br /><br />The acting is very good, the action and conflict are intense and the film moves along at a quick pace.  The story is basically an updated version of the whole \"boy on the milk carton\" scenario, revised as the \"boy on the website\".  Clever and plausible.<br /><br />Need something to watch when you're out of options - this film is a good choice for some fueled up energy and an entertaining night at the movies.\nKeeps your attention - entertaining\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robson', 'Mark'], 'Producers': ['David Weisbart'], 'Starring': ['Barbara Parkins', 'Patty Duke', 'Paul Burke'], 'Studio': ['Crowd Pleasers']}\nEvery now & then I just feel like watching something totally mindless and brain dead (not me, the movie!) and this perfectly fits the bill.<br /><br />The story, the setting, the horrific attempts at acting and the complete unavailability of some type of cohesive editing make this film the ideal candidate for those rainy days when Lifetime Channel is showing something you've seen one too many times.  In fact, it's more like horrific success at over-acting that leaves me mesmerized.<br /><br />Don't worry too much about the story of three young women of the 60's trying to succeed in modeling, film, broadway and love.  Just sit back with a chilled bottle of wine, some crackers & cheese, and a couple of hours to give yourself a break and have a totally entertaining afternoon at \"camp\".\nTotal camp, terrible acting - love it!\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joseph Sargent'], 'Producers': ['Synergy Ent'], 'Starring': ['Sally Field', 'Eleanor Parker', 'Lane Bradbury'], 'Studio': ['The Film Detective']}\nI hadn't seen this movie since the 70's when it was an \"ABC Movie of the Week\", but it always stayed in my mind.<br /><br />The story of youth wanting to run away from the constraints of misguided adults is as old as time.  And although the clothes, characters, music and some of the dialogue is a little dated, the feelings are the same. Generational breakdown in communication pure & simple. Everyone has wanted to run away & join the circus at some point in their life.<br /><br />The acting is what actually sets this film apart from many of that period.  A very young Sally Fields, Jackie Cooper, Eleanor Parker, and a sadly under-used David Carradine (pre \"Kung Fu\") elevate this film.<br /><br />I think its worth watching & especially since Amazon offers it for free with your Prime membership. A whole lot better than most of the garbage out there right now.\nWorth the trip down Memory Lane\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['William Castle'], 'Producers': ['William Castle', 'Robb White'], 'Starring': ['Vincent Price', 'Richard Long', 'Carolyn Craid'], 'Studio': ['More to Explore']}\nA teriffic old time scary haunted house story complete with clueless guests, skanky wife, possible infidelity, things that go bump in the night and the Master himself - Vincent Price. This is just classic, black & white, shivering in the dark perfection.<br /><br />Guests invited to spend the night in a possibly haunted house for money are then terrorized throughout their experience.  But by whom.., or what?<br /><br />It may not be as nasty or clever or gory as movies that have come since then, but sit back and just enjoy a little creepy, old-time fun in the dark.\nScary good fun\n{'Subtitles': ['None available'], 'Directors': ['Whit Stillman'], 'Producers': ['Whit Stillman'], 'Starring': ['Adam Brody', 'Chloe Sevigny', 'Carrie Maclemore'], 'Studio': ['Amazon Studios']}\nQuirky, clever, well- acted and thoroughly enjoyable. I hope there 'll be more episodes to come. So far I 've watched this one twice and have been telling everyone I know about it.<br /><br />This show is too good for tv!  Don't miss it!\nAnother great reason to get Amazon Prime\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Joss Whedon'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr. Chris Evans'], 'Studio': ['Hit Movies']}\nPlenty of action, terrific performances, often hilarious, and quite simply the gold standard of its genre. The bar has been set - good luck everyone else!\nWithout question - outstanding\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nOutstanding production.<br /><br />As one if millions of dedicated readers, I am so happy to be able to enjoy this transition from book to film.  Of course we all have our own theory about how a character should look or be portrayed, but I must say I have no problem accepting this version.<br /><br />When you have great source material, the rest is gravy.\nExcellent program honors the character\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English', 'English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['David Semel', 'Daniel Percival', 'Ken Olin', 'Michael Rymer', 'Bryan Spicer', 'Nelson Mccormick', 'Brad Anderson', 'Karyn Kusama', 'Michael Slovis'], 'Producers': ['Ridley Scott', 'David W. Zucker', 'Frank Spotnitz', 'Isa Dick Hackett', 'Christopher Tricarico', 'Stewart Mackinnon', 'Chrtistian Baute', 'Jace Richdale', 'Richard Heus', 'Dan Percival', 'Jordan Sheehan', 'Kalen Egan', 'Erin Smith'], 'Starring': ['Alexa Davalos', 'Rupert Evans', 'Luke Kleintank'], 'Studio': ['Amazon Studios']}\nAn extraordinary premise that has been presented in exceptional detail.<br /><br />I have been fascinated from the beginning but keep hoping that the producers will introduce more information about other country's and their position in this new world.<br /><br />All in all, I am impressed with the production, the performances and the writing.\nAn extraordinary premise that has been presented in exceptional detail ...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Pieter Jan Brugge'], 'Starring': ['タイタス・ウェリバー', 'ジェイミー・へクター', 'エイミー・アキノ']}\nI have read every book by this author (hoping there's a place in the future for a Lincoln Lawyer) and am still totally enthralled with this production.  It's never exactly as your imagination conjures it up, but I am totally onboard and relishing every episode.<br /><br />The thing I admire the most about this program is what an outstanding job they've done at meshing different books into overlapping storylines.  It is seamless and terrific.<br /><br />Bosch is the quality result of allowing and supporting the author to be directly involved with the process.  Obviously he knows the material but more unique to this situation is that he also knows and understands &#34;the industry&#34;. He knows how to turn a great book into great television.<br /><br />And that my friends is what is known as a slam dunk.\nAn exceptional second season",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: G.\nReview Date: 2012/07/20\nStore: Richard Jones  (Actor),     Blair Underwood  (Actor),     Christopher Scott Cherot  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Richard T. Jones (Guess Who, TV\\'s \"The Wire\"), Blair Underwood (Madea\\'s Family Reunion, TV\\'s \"Fatherhood\"), Chenoa Maxwell (Doing Hard Time, Hav Plenty), Andre Royo (Shaft, TV\\'s \"The Wire\"), Andrew Lauren (Conspiracy Theory), Laz Alonzo (Jarhead, The Tenants) star in G, a tragedy-filled story of a young Great Gatsby-ish Hip-Hopper named Summer G who falls for a middle- to upper-class sistah while in college. After she rejects him for a fellow social climber, Summer G spends ten years building a Hip-Hop empire, and then moves to the Hamptons where he finds the object of his affections. Cinematic urban tastemaker movie which highlights an African-American aristocratic lifestyle.', 'Amazon.com', 'G.', 'is an engrossing update of', 'The Great Gatsby', \", set in the Hamptons and starring Richard T. Jones as Summer G., a self-made, millionaire head of a hip-hop label. Having risen from obscurity to make his fortune, Summer pines for just one thing: Sky (Chenoa Maxwell), the woman who dumped him back in college to marry the brutal, philandering Chip (Blair Underwood). Sky's feckless cousin, Tre (Andre Royer), a pop journalist, sets her up in an assignation with Summer, leading to predictable conflicts but with unexpected consequences. Co-written and directed by Christopher Scott Cherot,\", 'G.', 'is also an interesting portrait of American wealth, particularly the collision of old and new money in the form of a biracial aristocracy coming to terms with a hip-hop elite. Strong performances alone are enough to recommend this feature.', '--Tom Keogh']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Contributor': 'Judd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard JonesJudd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard Jones   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 4.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396143951', 'Director': 'Christopher Scott Cherot', 'Media Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'March 28, 2006', 'Actors': 'Richard Jones, Blair Underwood, Chenoa Maxwell', 'Subtitles': 'English, French', 'Producers': 'Andrew Lauren, Judd Landon', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: This is a movie to watch when you want to see a bunch of beautiful actors, in an even more beautiful setting, entertaining the audience with a very engaging love story. It is sexy, it is hip, and it is addicting.<br /><br />My only and biggest complaint is that there is no place to find the music soundtrack.  In fact, it is the main reason why I bought this DVD.  Haunting and gorgous, I just wish it was available somewhere.\nReview Title: Guilty Pleasure\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spirited Away\nReview Date: 2012/10/08\nStore: Hayao Miyazaki  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', 'From one of the most celebrated filmmakers in the history of animated cinema comes the most acclaimed film of 2002. Hayao Miyazaki\\'s latest triumph, filled with astonishing animation and epic adventure, is a dazzling masterpiece for the ages. It\\'s a \"wonderfully welcoming work of art that\\'s as funny and entertaining as it is brilliant, beautiful, and deep\" (Joe Morgenstern, Wall Street Journal). SPIRITED AWAY is a wondrous fantasy about a young girl, Chihiro, trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free herself and return her family to the outside world. An unforgettable story brimming with creativity, SPIRITED AWAY will take you on a journey beyond your imagination. \"To enter the world of Hayao Miyazaki is to experience a kind of lighthearted enchantment that is unique to the world of animation\" (Roger Ebert, Chicago Sun-Times). It\\'s a fantastic tale the whole family will want to experience over and over again.~~(c) 2001 Nibariki -- GNDDTM', 'Set Contains:', 'The most interesting extra feature on the two-disc set is the Nippon Television Special on the making of', 'Spirited Away', ', not because it\\'s significantly different from American making-of programs, but because the camera crew was allowed to film Miyazaki at work. It\\'s fascinating to watch the visionary director explaining how individual movements should be animated, and even performing the little dance the frog-master does to welcome the No-Face to Yubaba\\'s bath house. (Old animators describe Walt Disney giving similar performances, but no comparable footage exists.) It\\'s also striking to see how intimate Studio Ghibli is, unencumbered by the tiers of management that burden American studios. The scene comparisons enable the viewer to study the storyboards for the film, which Miyazaki draws himself. These simple yet wonderfully vivid images capture the essence of a mood, a movement, an expression. \"Behind the Microphone\" offers a fairly standard behind-the-scenes look at the creation of the excellent English version of', 'Spirited Away', '.', '--Charles Solomon']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Fantasy', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Hayao Miyazaki', 'Language': 'French (Dolby Digital 2.0 Surround), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.3 x 7.52 inches; 4.32 Ounces', 'Item model number': 'UPC# 7869 3621 3843', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 15, 2003', 'Studio': 'Walt Disney Home Entertainment Presents A Studio Ghibli Film', 'Number of discs': '1'}\nReview Text: To try and describe this movie is kind of crazy.  I mean there's this little girl in a world inhabited by strange and curious spirits who must rescue her parents from a frightening and terrible fate. But the journey is so much more than a simple description.<br /><br />The animation is just gorgeous, the story is captivating and unique, and the musical score is so haunting and beautiful, you will find yourself remembering the themes long after the movie is over. Please give it a chance and allow yourself to be swept away by this special little film.\nReview Title: A beautiful, thoughtful experience\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Code Name: Dancer [DVD]\nReview Date: 2012/10/26\nStore: Kate Capshaw  (Actor),     Jeroen Krabb  (Actor),     Buzz Kulik  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nAverage Rating: 4.3\nProduct Details: {'Format': 'Color, DVD, Full Screen, NTSC', 'Contributor': 'Tracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robin Hudis, Andaluz Russell, Francisco Cuevas, Hilary Perez, Guillermo Ros, Valerie Mahaffey, Gregory SierraTracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robi…  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.16 Ounces', 'Director': 'Buzz Kulik', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'May 4, 2004', 'Actors': 'Kate Capshaw, Jeroen Krabb, Gregory Sierra, Valerie Mahaffey, James Sloyan', 'Studio': 'Trinity Home Ent', 'Number of discs': '1'}\nReview Text: I, like others have written, only saw this movie once many years back - but it stuck with me. It's never been re- broadcast that I could tell and I just figured for the price why not buy it.<br /><br />There was nothing on tv worth watching so we popped the film in and had a really enjoyable time watching it. In fact it is eons better than some of the garbage currently on.<br /><br />Great love story, top notch actors and a pretty decent story. For a couple of hours I escaped into a very pleasant movie.<br /><br />If anyone out there has any influence, please get some network to give this film some air time. If even if its just on the Lifetime channel.  I'm certain the viewers would love it.\nReview Title: Fun movie - even if a tad bit dated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: HOME ALONE 2: LOST IN NEW YORK\nReview Date: 2013/01/25\nStore: Macaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\nProduct Description: ['Macaulay Culkin, Joe Pesci, Daniel Stern. The bad guys get it, and the little kid gives it to them-only this time in the colorful setting of New York City. 1992/color/102 min/PG/widescreen.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': \"Maureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie Bracken, Gerry Bamman, Chris ColumbusMaureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie B…  See more\", 'Language': 'Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.3 x 7.53 inches; 2.4 Ounces', 'Item model number': 'FOXS2289224DVD', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Devin Ratray', 'Studio': 'TWENTIETH CENTURY FOX', 'Number of discs': '1'}\nReview Text: The real reason why I wanted this film has everything to do with the ending. I know that seems weird but as a native New Yorker, I just love the scenes between a mom and her son in front of the most spectacular Christmas Tree in the world.  So, there it is.<br /><br />The movie isn't particularly bad or good.  Pretty much the same formula as the first movie with just a few more predictable changes.  But I don't mind sitting through it and going along for the ride.  I could do far worse.\nReview Title: Guilty Pleasure - okay movie\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jane Fonda: AM/PM Yoga For Beginners [DVD]\nReview Date: 2013/01/25\nStore: Jane Fonda  (Actor),     Cal Pozo  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Jane Fonda is back again with yoga designed for baby boomers! Build strength, improve flexibility and relax the body with AM/PM YOGA FOR BEGINNERS.']\nAverage Rating: 4.4\nProduct Details: {'Color': 'Multicoloured', 'Brand': 'LIONSGATE', 'Product Care Instructions': 'Hand Wash Only', 'Item Weight': '0.14 Pounds', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Audio Description': 'English', 'Item model number': '10309110', 'Director': 'Cal Pozo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 11 minutes', 'Release date': 'December 4, 2012', 'Actors': 'Jane Fonda', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: I bought this for a good friend as a New Year's resolution kind of gift. She was interested in yoga but didn't want to make a huge investment until she knew what it was all about.  Apparently she is very happy with the program and the instructions. She says that you don't feel a lot of pressure and the pace is perfect for a person who hasn't exercised a lot in their life and wants to gradually get into it. Makes sense to me and if she's happy - then I'm happy for her.\nReview Title: Seems to be okay\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/05/25\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Singleton'], 'Producers': ['Jane Bartelme', 'Jeremy Bell', 'Patrick Crowley', 'Doug Davison', 'Ellen Goldsmith-Vein', 'Wolfgang Hammer', 'Anthony Katagas', 'Dan Lautner', 'Roy Lee'], 'Starring': ['Taylor Lautner', 'Lily Collins', 'Alfred Molina'], 'Studio': ['IMDB Freedive']}\nReview Text: Even though I found this movie to be somewhat predictable, sometimes it's just fun to let go and enjoy the ride.<br /><br />The acting is very good, the action and conflict are intense and the film moves along at a quick pace.  The story is basically an updated version of the whole \"boy on the milk carton\" scenario, revised as the \"boy on the website\".  Clever and plausible.<br /><br />Need something to watch when you're out of options - this film is a good choice for some fueled up energy and an entertaining night at the movies.\nReview Title: Keeps your attention - entertaining\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/08/10\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robson', 'Mark'], 'Producers': ['David Weisbart'], 'Starring': ['Barbara Parkins', 'Patty Duke', 'Paul Burke'], 'Studio': ['Crowd Pleasers']}\nReview Text: Every now & then I just feel like watching something totally mindless and brain dead (not me, the movie!) and this perfectly fits the bill.<br /><br />The story, the setting, the horrific attempts at acting and the complete unavailability of some type of cohesive editing make this film the ideal candidate for those rainy days when Lifetime Channel is showing something you've seen one too many times.  In fact, it's more like horrific success at over-acting that leaves me mesmerized.<br /><br />Don't worry too much about the story of three young women of the 60's trying to succeed in modeling, film, broadway and love.  Just sit back with a chilled bottle of wine, some crackers & cheese, and a couple of hours to give yourself a break and have a totally entertaining afternoon at \"camp\".\nReview Title: Total camp, terrible acting - love it!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/09/07\nAverage Rating: 3.9\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joseph Sargent'], 'Producers': ['Synergy Ent'], 'Starring': ['Sally Field', 'Eleanor Parker', 'Lane Bradbury'], 'Studio': ['The Film Detective']}\nReview Text: I hadn't seen this movie since the 70's when it was an \"ABC Movie of the Week\", but it always stayed in my mind.<br /><br />The story of youth wanting to run away from the constraints of misguided adults is as old as time.  And although the clothes, characters, music and some of the dialogue is a little dated, the feelings are the same. Generational breakdown in communication pure & simple. Everyone has wanted to run away & join the circus at some point in their life.<br /><br />The acting is what actually sets this film apart from many of that period.  A very young Sally Fields, Jackie Cooper, Eleanor Parker, and a sadly under-used David Carradine (pre \"Kung Fu\") elevate this film.<br /><br />I think its worth watching & especially since Amazon offers it for free with your Prime membership. A whole lot better than most of the garbage out there right now.\nReview Title: Worth the trip down Memory Lane\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/05/24\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['William Castle'], 'Producers': ['William Castle', 'Robb White'], 'Starring': ['Vincent Price', 'Richard Long', 'Carolyn Craid'], 'Studio': ['More to Explore']}\nReview Text: A teriffic old time scary haunted house story complete with clueless guests, skanky wife, possible infidelity, things that go bump in the night and the Master himself - Vincent Price. This is just classic, black & white, shivering in the dark perfection.<br /><br />Guests invited to spend the night in a possibly haunted house for money are then terrorized throughout their experience.  But by whom.., or what?<br /><br />It may not be as nasty or clever or gory as movies that have come since then, but sit back and just enjoy a little creepy, old-time fun in the dark.\nReview Title: Scary good fun\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/09/05\nAverage Rating: 3.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Whit Stillman'], 'Producers': ['Whit Stillman'], 'Starring': ['Adam Brody', 'Chloe Sevigny', 'Carrie Maclemore'], 'Studio': ['Amazon Studios']}\nReview Text: Quirky, clever, well- acted and thoroughly enjoyable. I hope there 'll be more episodes to come. So far I 've watched this one twice and have been telling everyone I know about it.<br /><br />This show is too good for tv!  Don't miss it!\nReview Title: Another great reason to get Amazon Prime\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/12/26\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Joss Whedon'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr. Chris Evans'], 'Studio': ['Hit Movies']}\nReview Text: Plenty of action, terrific performances, often hilarious, and quite simply the gold standard of its genre. The bar has been set - good luck everyone else!\nReview Title: Without question - outstanding\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/02/20\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nReview Text: Outstanding production.<br /><br />As one if millions of dedicated readers, I am so happy to be able to enjoy this transition from book to film.  Of course we all have our own theory about how a character should look or be portrayed, but I must say I have no problem accepting this version.<br /><br />When you have great source material, the rest is gravy.\nReview Title: Excellent program honors the character\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/02/23\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English', 'English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['David Semel', 'Daniel Percival', 'Ken Olin', 'Michael Rymer', 'Bryan Spicer', 'Nelson Mccormick', 'Brad Anderson', 'Karyn Kusama', 'Michael Slovis'], 'Producers': ['Ridley Scott', 'David W. Zucker', 'Frank Spotnitz', 'Isa Dick Hackett', 'Christopher Tricarico', 'Stewart Mackinnon', 'Chrtistian Baute', 'Jace Richdale', 'Richard Heus', 'Dan Percival', 'Jordan Sheehan', 'Kalen Egan', 'Erin Smith'], 'Starring': ['Alexa Davalos', 'Rupert Evans', 'Luke Kleintank'], 'Studio': ['Amazon Studios']}\nReview Text: An extraordinary premise that has been presented in exceptional detail.<br /><br />I have been fascinated from the beginning but keep hoping that the producers will introduce more information about other country's and their position in this new world.<br /><br />All in all, I am impressed with the production, the performances and the writing.\nReview Title: An extraordinary premise that has been presented in exceptional detail ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/03/14\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Pieter Jan Brugge'], 'Starring': ['タイタス・ウェリバー', 'ジェイミー・へクター', 'エイミー・アキノ']}\nReview Text: I have read every book by this author (hoping there's a place in the future for a Lincoln Lawyer) and am still totally enthralled with this production.  It's never exactly as your imagination conjures it up, but I am totally onboard and relishing every episode.<br /><br />The thing I admire the most about this program is what an outstanding job they've done at meshing different books into overlapping storylines.  It is seamless and terrific.<br /><br />Bosch is the quality result of allowing and supporting the author to be directly involved with the process.  Obviously he knows the material but more unique to this situation is that he also knows and understands &#34;the industry&#34;. He knows how to turn a great book into great television.<br /><br />And that my friends is what is known as a slam dunk.\nReview Title: An exceptional second season\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual demonstrates a strong preference for high-quality cinematic experiences, heavily favoring drama, fantasy, and nostalgic family films, revealing a tendency towards both engaging storytelling and attractive visuals. Ratings indicate a consistent inclination toward作品 with an average rating of 4.5 or higher, showcasing a preference for well-crafted narratives and characters.\n\nThemes in their selections gravitate towards insightful explorations of emotions, relationships, and imaginative landscapes, particularly valuing films that present unique visual aesthetics and engaging soundtracks. They exhibit a love for both classic cult favorites and contemporary films, often reflecting on personal nostalgia and emotional resonance.\n\nQuality is paramount, with a clear aversion to lower-rated or poor-quality productions. Price sensitivity is suggested by comments about enjoying films for their escapist potential and engagement, with occasional remarks on purchasing for friends, indicating thoughtfulness in gift-giving without overspending.\n\nOverall, the core preferences showcase a balance between deep storytelling, quality production values, and emotional connection, coupled with considerations for engaging entertainment during leisure time. The individual is likely seeking movies that provide both artistic merit and enjoyable viewing experiences, reflecting their sophisticated tastes and nostalgia for cinema.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Lighten up - it’s a goofy, fun little movie",
    "text": "This movie is quirky, clever & even touching. Never heard of it before I caught it on cable one night and found myself really enjoying the journey.<br /><br />The acting is wonderful & the creatures are a perfect mix of hilarious and annoying. But more fun than anything else.  Sometimes it’s a little uneven but the cast has great chemistry and there is a universal message about family & love.<br /><br />Look - this movie isn’t trying to be anything but a great way to spend a couple of hours away from all the crap in the world.  It is trippy, it is sweet .  Maybe not for everyone, but definitely worth a look.",
    "images": [],
    "asin": "B08KQBYSDV",
    "parent_asin": "B08KQBYSDV",
    "user_id": "AGXLOYCUY4XPBMRRDRT64HCI472Q",
    "timestamp": "2021-08-17 17:57:18.419000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Love and Monsters",
    "average_rating": 4.5,
    "rating_number": 45280,
    "features": [],
    "description": [
      "When he was a teen-and the planet was being ravaged by an apocalyptic event that caused animals to mutate into giant creatures-orphaned Joel (Dylan O'Brien) promised his girlfriend Aimee (Jessica Henwick) that he'd find her again some day. Tipped to her cross-country whereabouts seven years later, he leaves his survivors' colony to find her-tackling uncanny perils along the way. Engaging doomsday actioner-meets-John Hughes flick co-stars Michael Rooker, Dan Ewing, Ellen Hollman. 109 min. Widescreen; Soundtrack: English."
    ],
    "price": 7.79,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51YrFWNHe7L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51YrFWNHe7L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91GzSGtBKnL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51YAgQ0jS+L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51YAgQ0jS+L.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/91fRujbzAjL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Love And Monsters 4K UHD Unboxing",
        "url": "https://www.amazon.com/vdp/143a12ba99914998a639d585d3d2b1ba?ref=dp_vse_rvc_0",
        "user_id": "/shop/bobbobson682"
      }
    ],
    "store": "Jessica Henwick  (Actor),     Ariana Greenblatt  (Actor)    Rated:    PG-13    Format: DVD",
    "categories": [
      "Movies & TV",
      "Paramount Home Entertainment",
      "Action & Adventure"
    ],
    "details": {
      "Genre": "Horror, Comedy",
      "Format": "Subtitled, Widescreen, NTSC",
      "Contributor": "Jessica Henwick, Ariana Greenblatt, Michael Rooker, Dylan O'Brien, Dan Ewing",
      "Language": "English",
      "Runtime": "1 hour and 48 minutes",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 1.76 Ounces",
      "Item model number": "D59214067D",
      "Media Format": "Subtitled, Widescreen, NTSC",
      "Run time": "1 hour and 48 minutes",
      "Release date": "June 8, 2021",
      "Actors": "Jessica Henwick, Ariana Greenblatt, Michael Rooker, Dylan O'Brien, Dan Ewing",
      "Studio": "Paramount Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}