{
  "user_id": "AHY3TOE6KKKYUO62CPOALPJJPUAA",
  "summary": "=== Purchase Information ===\nReview Date: 2013/01/14\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Standeven'], 'Producers': ['Gub Neal'], 'Starring': ['Robbie Coltrane', 'Ricky Tomlinson', 'Dennis Philby'], 'Studio': ['Acorn Media']}\nReview Text: Right in line with others in this series.  Great writing and great acting.  A vintage retrospective look at British Hong Kong at the time of the handover to China also.\nReview Title: Crime in Hong Kong\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/01/14\nAverage Rating: 3.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Antonia Bird'], 'Producers': ['ITV'], 'Starring': ['Robbie Coltrane', 'Barbara Flynn', 'Geraldine Somerville'], 'Studio': ['Acorn TV']}\nReview Text: This story is that of a British vet with 3 tours in Ulster under its belt.  He has lost mates and is suffering from PTSD.  The anti-American comments and moments are from his point of view.  As Fitz says, understandable but not justified.  I find the other reviewers a bit thin skinned.  If they had complained about the believability of the vet going off the rails, that would have been more valid in my opinion.\nReview Title: Not that bloody awful if you watch the whole thing\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/02/18\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Carson', 'Michael Grossman', 'Michael Robison', 'Jim Contner'], 'Producers': ['David Simkins', 'Robert Hewitt Wolfe', 'Nicolas Cage'], 'Starring': ['Paul Blackthorne', 'Valerie Cruz', 'Terrence Mann'], 'Studio': ['Lionsgate']}\nReview Text: If you read and loved the books, you are likely to be disappointed.  But if you view this series with fresh eyes and without preconceptions, it's quite good.  Settle back and enjoy!\nReview Title: Take it as a fresh look\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/05/30\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Reed', 'Marc Jobst', 'Sarah Harding'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Kate McKerrell', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nReview Text: If you liked Morse and Lewis, you will like Lewis and Hathaway.  Lewis has grown since his time with Morse and following the death of his wife.  Hathaway as the erstwhile Cambridge theologian is a wonderful foil to Lewis.  Enjoy!\nReview Title: Murders in Oxford---or Shades of Morse\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr.Who Xmas Specials (Giftset/BD)\nReview Date: 2015/12/22\nStore: Various  (Actor, Director)    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['AMAZON EXCLUSIVE GIFTSET WITH BLUETOOTH SPEAKER:', 'Doctor Who: Christmas Specials Giftset with TARDIS Speakers [Blu-ray]', 'For the first time on one complete set, own every Christmas special from the new generation of Doctor Who. David Tennant, Matt Smith and Peter Capaldi all take starring turns in eleven exhilarating Christmas specials that set the Doctor rushing to save the world from an array of dastardly foes including the Master, the Cybermen and even Santa Clause himself.', 'Set includes the following:', '11 Doctor Who Christmas Specials', '(3 discs):', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE CHRISTMAS INVASION', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE RUNAWAY BRIDE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 VOYAGE OF THE DAMNED', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE NEXT DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART ONE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART TWO', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 A CHRISTMAS CAROL', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE DOCTOR, THE WIDOW, AND THE WARDROBE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE SNOWMEN', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE TIME OF THE DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 LAST CHRISTMAS', 'TARDIS Bluetooth Speaker', \"This Doctor Who TARDIS Wireless Bluetooth Speaker will seamlessly pair with most any Bluetooth device. It features meticulous craftsmanship and incredible sound quality, making it highly desirable to collectors and audiophiles alike. The easy-to-use interface allows for an array of control options, while LED indicators let you know when you power the device on and when you're connected.\", 'Features:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Sound clips include Materialize, Dematerialize, Cloister Bell, Flight, and Turbulence!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Top LED flashes and the Police Box sign illuminates! Perfect for Doctor Who collectors and audiophiles alike. Wireless Doctor Who speakers!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Made of super-rigid ABS', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 The Police Box sign illuminates when connected to a device.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Auxiliary In/Out for linking multiple models together for surround sound', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Built-in omnidirectional microphone for phone calls with noise cancellation', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Multifunction interface for Volume / Play / Pause / >> /', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery indicator display / voice battery low indicator', 'Specifications:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 3 1/2-foot 3.5 mm auxiliary cable and 3-foot micro USB charging cable included', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Connectivity: wireless Bluetooth or 3.5 mm auxiliary', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Wireless range: 33 feet / 10 meters', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery: 10-hour life via rechargeable lithium-ion', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Speakers: 2-inch high-power and 2 1/2-inch passive bass radiator', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 USB-rechargeable lithium-ion battery', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 TARDIS measures about 8 1/2-inches tall x 4 2/5-inches wide x 4 2/5-inches long.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 For ages 6 and up.']\nAverage Rating: 4.8\nProduct Details: {'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.1 Pounds', 'Item model number': '43382038', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Run time': '9 hours', 'Release date': 'November 24, 2015', 'Actors': 'Various', 'Studio': 'BBC', 'Number of discs': '3'}\nReview Text: I love the Tardis speaker.  It charges quickly with the USB cable.  The instructions say it should be able to hook up with your computer if attached by the USB cable, but I have only been able to get it to connect to my aging 2008 MacBook Pro by using the Bluetooth connection.  It pairs excellently with my iPhone and iPad also.  A total treat for this Whovian.<br /><br />In a comment to another post I listed all the episodes included in the three disk set, and I am repeating this info below as it is not included in the item information by Amazon.  I am giving this only 4 stars because the DVD set arrived with the middle piece to one of the DVD holders half broken, making it impossible to securely stow one of them when not in use.  All three DVD's were loose in the case on arrival but fortunately not scratched and all played well.<br /><br />Tenth Doctor David Tennant specials---<br />The Christmas Invasion<br />The Runaway Bride<br />Voyage of the Damned<br />The Next Doctor<br />The End Of Time, Part One<br />The End Of Time, Part Two<br /><br />Eleventh Doctor Matt Smith specials--<br />A Christmas Carol<br />The Doctor, the Widow and the Wardrobe<br />The Snowmen<br />The Time of the Doctor<br /><br />Twelfth Doctor Peter Capaldi special--<br />Last Christmas<br /><br />There is also a bonus feature called Ten Christmases:  &#34;in this exclusive new feature Rufus Hound is on a mission to discover what makes a Doctor Who Christmas Special so special!&#34;\nReview Title: Super gift for your favorite Whovian\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Dish\nReview Date: 2015/12/22\nStore: Rob Sitch  (Director),     Sam Neill  (Actor),     Kevin Harrington  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['It\\'s the biggest event since sheep invented wool! Apollo 11\\'s astronauts will walk on the moon -- and the 1,000-ton satellite dish in tiny, sheep-farming Parkes, Australia, will beam that historic first step around the globe. But as giddy citizens prepare for the moment when the entire world will depend on them, the dish flatlines. And its unconventional Aussie crew and its by-the-book NASA supervisor from the U.S. have very different ideas about how to fix it. A culture clash of cosmic proportions erupts in this fact-based tale of how the biggest televised event in history was almost not televised. The Dish, with Sam Neill (Jurassic Park), Patrick Warburton (Seinfeld) and others in a skilled ensemble portraying a spirited array of techies and townies, \"will send you to the moon and back laughing\" (Bruce Kirkland, Toronto Sun).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Patrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John McmartinPatrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John Mcmartin  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': 'WARA667702DVD', 'Director': 'Rob Sitch', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 6, 2012', 'Actors': 'Sam Neill, Kevin Harrington, Tom Long, Patrick Warburton, Genevieve Mooy', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have loved this movie since my first viewing in a theater.  Based on the true story of how the television signal made it from the moon to all those TV sets worldwide back in July 1969 -- thanks to a wonderful facility in Parkes, Australia.  Get ready to enjoy a story where the geeks are also the heroes!\nReview Title: Excellent Apollo 11 story from a different viewpoint\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eureka Gesamtbox [Blu-ray]\nReview Date: 2016/02/12\nStore: Salli Richardson-Whitfield  (Actor),     Colin Ferguson  (Actor)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: [\"Eureka is a seemingly ordinary place whose residents lead ordinary lives...at least to the naked eye. Shrouded in secrecy, the picturesque town is actually a community of scientific geniuses secretly relocated by the government to conduct top-secret research. This hit series smartly roots itself in reality, as the drama of the townsfolk stems from life's myriad of everyday challenges. But with the population's unique talents, troubled psyches and limitless resources, these small-town concerns have a way of becoming big-time problems. It is at that intersection, where human frailty and super-science collide - that Eureka begins. Let this Complete Series Collection take you to another place as you watch every episode from each of the five seasons, back-to-back and uninterrupted!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Blu-ray, DVD', 'Contributor': 'Colin Ferguson, Salli Richardson-Whitfield', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.47 x 2.8 x 6.89 inches; 1.47 Pounds', 'Item model number': '5053083001292', 'Media Format': 'Blu-ray, DVD', 'Release date': 'October 16, 2014', 'Actors': 'Salli Richardson-Whitfield, Colin Ferguson', 'Subtitles': 'English, French, German', 'Studio': 'Universal Pictures', 'Number of discs': '18'}\nReview Text: I loved this series and missed the release of the DVD version, so I was really happy to find this region free BluRay edition. It is from Germany and comes with a choice not only audio tracks in your choice of English, French, and German, but also visual subtitles that can be selected separately from the audio, that is you can watch with English audio but have subtitles in German or French or English (or none at all). And it plays great on my Sony US BluRay DVD player.<br /><br />Comes as a set of 18 disks with bonus materials.  If you would like a great series packaged in a great set, buy this one!<br /><br />Note that this takes a long while for delivery (made it two days after its latest predicted arrival) as it is sold by a third party and is shipped from Germany.\nReview Title: EUREKA!!!!  Great set of DVD's!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tin Man (Two-Disc Collector's Edition) [Blu-ray]\nReview Date: 2017/08/21\nStore: Alan Cumming  (Actor),     Nick Willing  (Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Widescreen', 'Contributor': 'Nick Willing, Zoey Deschanel, Alan Cumming', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'July 20, 2010', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Item model number': 'MCMBRRH2763', 'Director': 'Nick Willing', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Widescreen', 'Release date': 'July 20, 2010', 'Actors': 'Alan Cumming', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nReview Text: Wonderful movie I have enjoyed for years.  And this one has subtitles!\nReview Title: Off to the O.Z.!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Day After [DVD]\nReview Date: 2018/04/25\nStore: Jason Robards  (Actor),     JoBeth Williams  (Actor),     Nicholas Meyer  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['The countdown has begun! Against the real-life backdrop of the U.S. deployment of WMDs in Europe during the escalating Cold War, this \"dramatically involving [and] agonizingly graphic film\" (The Hollywood Reporter) about nuclear holocaust detonated a direct hit into the heartland of America.Starring Jason Robards, JoBeth Williams, Steven Guttenberg, John Cullum and John Lithgow, this \"controversial, potent drama\" (Leonard Maltin) remains \"one of the most talked-about programs in history\"(Newsweek)! When Cold War tensions reach the ultimate boiling point, the inhabitants of a small town in Kansas learn along with the rest of America that they have fewer than 30 minutes before 300 Soviet warheads begin to appear overhead! Can anyone survive this ultimate nightmare...or the nuclear winter that is sure to follow?']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Color, DVD, Full Screen, NTSC', 'Contributor': 'Steve Guttenberg, Amy Madigan, JoBeth Williams, Georgann Johnson, John Lithgow, Jason Robards, Edward Hume, Bibi Besch, Jeff East, Calvin Jung, Lori Lethin, Nicholas Meyer, William Allen Young, John CullumSteve Guttenberg, Amy Madigan, JoBeth Williams, Georgann Johnson, John Lithgow, Jason Robards, Edward Hume, Bibi Besch, Jeff East, Calvin Jung, Lori Lethin, Nicholas Meyer, William Allen Young, John Cullum   See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Nicholas Meyer', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '2 hours and 7 minutes', 'Release date': 'May 18, 2004', 'Actors': 'Jason Robards, JoBeth Williams, Steve Guttenberg, John Cullum, John Lithgow', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Edward Hume', 'Number of discs': '1'}\nReview Text: Might not be a great movie but truly an excellent public service message about the horrors of nuclear war. I was on active duty in the Navy in the midst of the Cold War, which always seemed to leave us on the knife’s edge between peace and war. Everyone should see this, especially the politicians, most of whom seem totally ignorant of the effects of playing chicken with nuclear weapons. This will scare the beejeezus out of you. As well it should.\nReview Title: By the time the missiles fly, it is too late....\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Princess Bride (The Criterion Collection) [Blu-ray]\nReview Date: 2018/11/01\nStore: Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright  (Actor),     Rob Reiner  (Director)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['From celebrated director Rob Reiner ( When Harry Met Sally ) and Oscar (r) winning* screenwriter William Goldman ( Chaplin ) comes \"an enchanting fantasy\" ( Time ) filled with adventure, romance and plenty of \"good hearted fun\" (Roger Ebert)! Featuring a spectacular cast thatincludes Robin Wright ( Forrest Gump ), Cary Elwes ( Liar, Liar ), Mandy Patinkin ( Dick Tracy ) and Billy Crystal ( City Slickers ), this wonderful fairy tale about a Princess named Buttercup and her beloved is \"a real dream of a movie\" ( People )! *1969: OriginalScreenplay, Butch Cassidy and the Sundance Kid 1976: Adapted Screenplay, All the President\\'s Men']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Action & Adventure', 'Format': 'Subtitled, Widescreen', 'Contributor': 'Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright, Rob Reiner', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Audio Description': 'English', 'Director': 'Rob Reiner', 'Media Format': 'Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'October 30, 2018', 'Actors': 'Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Number of discs': '1'}\nReview Text: Best movie ever and this is a great version. The sound is especially fabulous. I found the picture quaility superior to my DVD Version but I am watching on an older Panasonic plasma 720p HDTV and am totally impressed. As for the packaging, I agree it was poor planning to put the info sheet onto the back of the book, but it peeled off easily and I then placed it on the last page of the book facing the Blu Ray. Easy fix. And the text was lovely, with essays written by both Sloan’s Crosley and William Goldman. Any fan will love this!\nReview Title: Criterion—-A truly worthwhile addition to your collection!\nRating: 5.0\n--------------------------------------------------",
  "reference": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Standeven'], 'Producers': ['Gub Neal'], 'Starring': ['Robbie Coltrane', 'Ricky Tomlinson', 'Dennis Philby'], 'Studio': ['Acorn Media']}\nRight in line with others in this series.  Great writing and great acting.  A vintage retrospective look at British Hong Kong at the time of the handover to China also.\nCrime in Hong Kong\n{'Subtitles': ['None available'], 'Directors': ['Antonia Bird'], 'Producers': ['ITV'], 'Starring': ['Robbie Coltrane', 'Barbara Flynn', 'Geraldine Somerville'], 'Studio': ['Acorn TV']}\nThis story is that of a British vet with 3 tours in Ulster under its belt.  He has lost mates and is suffering from PTSD.  The anti-American comments and moments are from his point of view.  As Fitz says, understandable but not justified.  I find the other reviewers a bit thin skinned.  If they had complained about the believability of the vet going off the rails, that would have been more valid in my opinion.\nNot that bloody awful if you watch the whole thing\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Carson', 'Michael Grossman', 'Michael Robison', 'Jim Contner'], 'Producers': ['David Simkins', 'Robert Hewitt Wolfe', 'Nicolas Cage'], 'Starring': ['Paul Blackthorne', 'Valerie Cruz', 'Terrence Mann'], 'Studio': ['Lionsgate']}\nIf you read and loved the books, you are likely to be disappointed.  But if you view this series with fresh eyes and without preconceptions, it's quite good.  Settle back and enjoy!\nTake it as a fresh look\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Reed', 'Marc Jobst', 'Sarah Harding'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Kate McKerrell', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nIf you liked Morse and Lewis, you will like Lewis and Hathaway.  Lewis has grown since his time with Morse and following the death of his wife.  Hathaway as the erstwhile Cambridge theologian is a wonderful foil to Lewis.  Enjoy!\nMurders in Oxford---or Shades of Morse\nDr.Who Xmas Specials (Giftset/BD)\nVarious  (Actor, Director)    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['AMAZON EXCLUSIVE GIFTSET WITH BLUETOOTH SPEAKER:', 'Doctor Who: Christmas Specials Giftset with TARDIS Speakers [Blu-ray]', 'For the first time on one complete set, own every Christmas special from the new generation of Doctor Who. David Tennant, Matt Smith and Peter Capaldi all take starring turns in eleven exhilarating Christmas specials that set the Doctor rushing to save the world from an array of dastardly foes including the Master, the Cybermen and even Santa Clause himself.', 'Set includes the following:', '11 Doctor Who Christmas Specials', '(3 discs):', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE CHRISTMAS INVASION', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE RUNAWAY BRIDE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 VOYAGE OF THE DAMNED', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE NEXT DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART ONE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART TWO', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 A CHRISTMAS CAROL', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE DOCTOR, THE WIDOW, AND THE WARDROBE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE SNOWMEN', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE TIME OF THE DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 LAST CHRISTMAS', 'TARDIS Bluetooth Speaker', \"This Doctor Who TARDIS Wireless Bluetooth Speaker will seamlessly pair with most any Bluetooth device. It features meticulous craftsmanship and incredible sound quality, making it highly desirable to collectors and audiophiles alike. The easy-to-use interface allows for an array of control options, while LED indicators let you know when you power the device on and when you're connected.\", 'Features:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Sound clips include Materialize, Dematerialize, Cloister Bell, Flight, and Turbulence!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Top LED flashes and the Police Box sign illuminates! Perfect for Doctor Who collectors and audiophiles alike. Wireless Doctor Who speakers!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Made of super-rigid ABS', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 The Police Box sign illuminates when connected to a device.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Auxiliary In/Out for linking multiple models together for surround sound', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Built-in omnidirectional microphone for phone calls with noise cancellation', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Multifunction interface for Volume / Play / Pause / >> /', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery indicator display / voice battery low indicator', 'Specifications:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 3 1/2-foot 3.5 mm auxiliary cable and 3-foot micro USB charging cable included', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Connectivity: wireless Bluetooth or 3.5 mm auxiliary', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Wireless range: 33 feet / 10 meters', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery: 10-hour life via rechargeable lithium-ion', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Speakers: 2-inch high-power and 2 1/2-inch passive bass radiator', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 USB-rechargeable lithium-ion battery', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 TARDIS measures about 8 1/2-inches tall x 4 2/5-inches wide x 4 2/5-inches long.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 For ages 6 and up.']\n{'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.1 Pounds', 'Item model number': '43382038', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Run time': '9 hours', 'Release date': 'November 24, 2015', 'Actors': 'Various', 'Studio': 'BBC', 'Number of discs': '3'}\nI love the Tardis speaker.  It charges quickly with the USB cable.  The instructions say it should be able to hook up with your computer if attached by the USB cable, but I have only been able to get it to connect to my aging 2008 MacBook Pro by using the Bluetooth connection.  It pairs excellently with my iPhone and iPad also.  A total treat for this Whovian.<br /><br />In a comment to another post I listed all the episodes included in the three disk set, and I am repeating this info below as it is not included in the item information by Amazon.  I am giving this only 4 stars because the DVD set arrived with the middle piece to one of the DVD holders half broken, making it impossible to securely stow one of them when not in use.  All three DVD's were loose in the case on arrival but fortunately not scratched and all played well.<br /><br />Tenth Doctor David Tennant specials---<br />The Christmas Invasion<br />The Runaway Bride<br />Voyage of the Damned<br />The Next Doctor<br />The End Of Time, Part One<br />The End Of Time, Part Two<br /><br />Eleventh Doctor Matt Smith specials--<br />A Christmas Carol<br />The Doctor, the Widow and the Wardrobe<br />The Snowmen<br />The Time of the Doctor<br /><br />Twelfth Doctor Peter Capaldi special--<br />Last Christmas<br /><br />There is also a bonus feature called Ten Christmases:  &#34;in this exclusive new feature Rufus Hound is on a mission to discover what makes a Doctor Who Christmas Special so special!&#34;\nSuper gift for your favorite Whovian\nThe Dish\nRob Sitch  (Director),     Sam Neill  (Actor),     Kevin Harrington  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['It\\'s the biggest event since sheep invented wool! Apollo 11\\'s astronauts will walk on the moon -- and the 1,000-ton satellite dish in tiny, sheep-farming Parkes, Australia, will beam that historic first step around the globe. But as giddy citizens prepare for the moment when the entire world will depend on them, the dish flatlines. And its unconventional Aussie crew and its by-the-book NASA supervisor from the U.S. have very different ideas about how to fix it. A culture clash of cosmic proportions erupts in this fact-based tale of how the biggest televised event in history was almost not televised. The Dish, with Sam Neill (Jurassic Park), Patrick Warburton (Seinfeld) and others in a skilled ensemble portraying a spirited array of techies and townies, \"will send you to the moon and back laughing\" (Bruce Kirkland, Toronto Sun).']\n{'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Patrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John McmartinPatrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John Mcmartin  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': 'WARA667702DVD', 'Director': 'Rob Sitch', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 6, 2012', 'Actors': 'Sam Neill, Kevin Harrington, Tom Long, Patrick Warburton, Genevieve Mooy', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have loved this movie since my first viewing in a theater.  Based on the true story of how the television signal made it from the moon to all those TV sets worldwide back in July 1969 -- thanks to a wonderful facility in Parkes, Australia.  Get ready to enjoy a story where the geeks are also the heroes!\nExcellent Apollo 11 story from a different viewpoint\nEureka Gesamtbox [Blu-ray]\nSalli Richardson-Whitfield  (Actor),     Colin Ferguson  (Actor)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n[\"Eureka is a seemingly ordinary place whose residents lead ordinary lives...at least to the naked eye. Shrouded in secrecy, the picturesque town is actually a community of scientific geniuses secretly relocated by the government to conduct top-secret research. This hit series smartly roots itself in reality, as the drama of the townsfolk stems from life's myriad of everyday challenges. But with the population's unique talents, troubled psyches and limitless resources, these small-town concerns have a way of becoming big-time problems. It is at that intersection, where human frailty and super-science collide - that Eureka begins. Let this Complete Series Collection take you to another place as you watch every episode from each of the five seasons, back-to-back and uninterrupted!\"]\n{'Genre': 'Drama', 'Format': 'Blu-ray, DVD', 'Contributor': 'Colin Ferguson, Salli Richardson-Whitfield', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.47 x 2.8 x 6.89 inches; 1.47 Pounds', 'Item model number': '5053083001292', 'Media Format': 'Blu-ray, DVD', 'Release date': 'October 16, 2014', 'Actors': 'Salli Richardson-Whitfield, Colin Ferguson', 'Subtitles': 'English, French, German', 'Studio': 'Universal Pictures', 'Number of discs': '18'}\nI loved this series and missed the release of the DVD version, so I was really happy to find this region free BluRay edition. It is from Germany and comes with a choice not only audio tracks in your choice of English, French, and German, but also visual subtitles that can be selected separately from the audio, that is you can watch with English audio but have subtitles in German or French or English (or none at all). And it plays great on my Sony US BluRay DVD player.<br /><br />Comes as a set of 18 disks with bonus materials.  If you would like a great series packaged in a great set, buy this one!<br /><br />Note that this takes a long while for delivery (made it two days after its latest predicted arrival) as it is sold by a third party and is shipped from Germany.\nEUREKA!!!!  Great set of DVD's!\nTin Man (Two-Disc Collector's Edition) [Blu-ray]\nAlan Cumming  (Actor),     Nick Willing  (Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n{'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Widescreen', 'Contributor': 'Nick Willing, Zoey Deschanel, Alan Cumming', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'July 20, 2010', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Item model number': 'MCMBRRH2763', 'Director': 'Nick Willing', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Widescreen', 'Release date': 'July 20, 2010', 'Actors': 'Alan Cumming', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nWonderful movie I have enjoyed for years.  And this one has subtitles!\nOff to the O.Z.!\nThe Day After [DVD]\nJason Robards  (Actor),     JoBeth Williams  (Actor),     Nicholas Meyer  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['The countdown has begun! Against the real-life backdrop of the U.S. deployment of WMDs in Europe during the escalating Cold War, this \"dramatically involving [and] agonizingly graphic film\" (The Hollywood Reporter) about nuclear holocaust detonated a direct hit into the heartland of America.Starring Jason Robards, JoBeth Williams, Steven Guttenberg, John Cullum and John Lithgow, this \"controversial, potent drama\" (Leonard Maltin) remains \"one of the most talked-about programs in history\"(Newsweek)! When Cold War tensions reach the ultimate boiling point, the inhabitants of a small town in Kansas learn along with the rest of America that they have fewer than 30 minutes before 300 Soviet warheads begin to appear overhead! Can anyone survive this ultimate nightmare...or the nuclear winter that is sure to follow?']\n{'Genre': 'Drama', 'Format': 'Color, DVD, Full Screen, NTSC', 'Contributor': 'Steve Guttenberg, Amy Madigan, JoBeth Williams, Georgann Johnson, John Lithgow, Jason Robards, Edward Hume, Bibi Besch, Jeff East, Calvin Jung, Lori Lethin, Nicholas Meyer, William Allen Young, John CullumSteve Guttenberg, Amy Madigan, JoBeth Williams, Georgann Johnson, John Lithgow, Jason Robards, Edward Hume, Bibi Besch, Jeff East, Calvin Jung, Lori Lethin, Nicholas Meyer, William Allen Young, John Cullum   See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Nicholas Meyer', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '2 hours and 7 minutes', 'Release date': 'May 18, 2004', 'Actors': 'Jason Robards, JoBeth Williams, Steve Guttenberg, John Cullum, John Lithgow', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Edward Hume', 'Number of discs': '1'}\nMight not be a great movie but truly an excellent public service message about the horrors of nuclear war. I was on active duty in the Navy in the midst of the Cold War, which always seemed to leave us on the knife’s edge between peace and war. Everyone should see this, especially the politicians, most of whom seem totally ignorant of the effects of playing chicken with nuclear weapons. This will scare the beejeezus out of you. As well it should.\nBy the time the missiles fly, it is too late....\nThe Princess Bride (The Criterion Collection) [Blu-ray]\nCary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright  (Actor),     Rob Reiner  (Director)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['From celebrated director Rob Reiner ( When Harry Met Sally ) and Oscar (r) winning* screenwriter William Goldman ( Chaplin ) comes \"an enchanting fantasy\" ( Time ) filled with adventure, romance and plenty of \"good hearted fun\" (Roger Ebert)! Featuring a spectacular cast thatincludes Robin Wright ( Forrest Gump ), Cary Elwes ( Liar, Liar ), Mandy Patinkin ( Dick Tracy ) and Billy Crystal ( City Slickers ), this wonderful fairy tale about a Princess named Buttercup and her beloved is \"a real dream of a movie\" ( People )! *1969: OriginalScreenplay, Butch Cassidy and the Sundance Kid 1976: Adapted Screenplay, All the President\\'s Men']\n{'Genre': 'Kids & Family, Action & Adventure', 'Format': 'Subtitled, Widescreen', 'Contributor': 'Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright, Rob Reiner', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Audio Description': 'English', 'Director': 'Rob Reiner', 'Media Format': 'Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'October 30, 2018', 'Actors': 'Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Number of discs': '1'}\nBest movie ever and this is a great version. The sound is especially fabulous. I found the picture quaility superior to my DVD Version but I am watching on an older Panasonic plasma 720p HDTV and am totally impressed. As for the packaging, I agree it was poor planning to put the info sheet onto the back of the book, but it peeled off easily and I then placed it on the last page of the book facing the Blu Ray. Easy fix. And the text was lovely, with essays written by both Sloan’s Crosley and William Goldman. Any fan will love this!\nCriterion—-A truly worthwhile addition to your collection!",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nReview Date: 2013/01/14\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Standeven'], 'Producers': ['Gub Neal'], 'Starring': ['Robbie Coltrane', 'Ricky Tomlinson', 'Dennis Philby'], 'Studio': ['Acorn Media']}\nReview Text: Right in line with others in this series.  Great writing and great acting.  A vintage retrospective look at British Hong Kong at the time of the handover to China also.\nReview Title: Crime in Hong Kong\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/01/14\nAverage Rating: 3.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Antonia Bird'], 'Producers': ['ITV'], 'Starring': ['Robbie Coltrane', 'Barbara Flynn', 'Geraldine Somerville'], 'Studio': ['Acorn TV']}\nReview Text: This story is that of a British vet with 3 tours in Ulster under its belt.  He has lost mates and is suffering from PTSD.  The anti-American comments and moments are from his point of view.  As Fitz says, understandable but not justified.  I find the other reviewers a bit thin skinned.  If they had complained about the believability of the vet going off the rails, that would have been more valid in my opinion.\nReview Title: Not that bloody awful if you watch the whole thing\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/02/18\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Carson', 'Michael Grossman', 'Michael Robison', 'Jim Contner'], 'Producers': ['David Simkins', 'Robert Hewitt Wolfe', 'Nicolas Cage'], 'Starring': ['Paul Blackthorne', 'Valerie Cruz', 'Terrence Mann'], 'Studio': ['Lionsgate']}\nReview Text: If you read and loved the books, you are likely to be disappointed.  But if you view this series with fresh eyes and without preconceptions, it's quite good.  Settle back and enjoy!\nReview Title: Take it as a fresh look\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/05/30\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Reed', 'Marc Jobst', 'Sarah Harding'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Kate McKerrell', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nReview Text: If you liked Morse and Lewis, you will like Lewis and Hathaway.  Lewis has grown since his time with Morse and following the death of his wife.  Hathaway as the erstwhile Cambridge theologian is a wonderful foil to Lewis.  Enjoy!\nReview Title: Murders in Oxford---or Shades of Morse\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr.Who Xmas Specials (Giftset/BD)\nReview Date: 2015/12/22\nStore: Various  (Actor, Director)    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['AMAZON EXCLUSIVE GIFTSET WITH BLUETOOTH SPEAKER:', 'Doctor Who: Christmas Specials Giftset with TARDIS Speakers [Blu-ray]', 'For the first time on one complete set, own every Christmas special from the new generation of Doctor Who. David Tennant, Matt Smith and Peter Capaldi all take starring turns in eleven exhilarating Christmas specials that set the Doctor rushing to save the world from an array of dastardly foes including the Master, the Cybermen and even Santa Clause himself.', 'Set includes the following:', '11 Doctor Who Christmas Specials', '(3 discs):', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE CHRISTMAS INVASION', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE RUNAWAY BRIDE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 VOYAGE OF THE DAMNED', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE NEXT DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART ONE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART TWO', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 A CHRISTMAS CAROL', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE DOCTOR, THE WIDOW, AND THE WARDROBE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE SNOWMEN', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE TIME OF THE DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 LAST CHRISTMAS', 'TARDIS Bluetooth Speaker', \"This Doctor Who TARDIS Wireless Bluetooth Speaker will seamlessly pair with most any Bluetooth device. It features meticulous craftsmanship and incredible sound quality, making it highly desirable to collectors and audiophiles alike. The easy-to-use interface allows for an array of control options, while LED indicators let you know when you power the device on and when you're connected.\", 'Features:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Sound clips include Materialize, Dematerialize, Cloister Bell, Flight, and Turbulence!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Top LED flashes and the Police Box sign illuminates! Perfect for Doctor Who collectors and audiophiles alike. Wireless Doctor Who speakers!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Made of super-rigid ABS', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 The Police Box sign illuminates when connected to a device.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Auxiliary In/Out for linking multiple models together for surround sound', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Built-in omnidirectional microphone for phone calls with noise cancellation', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Multifunction interface for Volume / Play / Pause / >> /', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery indicator display / voice battery low indicator', 'Specifications:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 3 1/2-foot 3.5 mm auxiliary cable and 3-foot micro USB charging cable included', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Connectivity: wireless Bluetooth or 3.5 mm auxiliary', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Wireless range: 33 feet / 10 meters', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery: 10-hour life via rechargeable lithium-ion', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Speakers: 2-inch high-power and 2 1/2-inch passive bass radiator', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 USB-rechargeable lithium-ion battery', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 TARDIS measures about 8 1/2-inches tall x 4 2/5-inches wide x 4 2/5-inches long.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 For ages 6 and up.']\nAverage Rating: 4.8\nProduct Details: {'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.1 Pounds', 'Item model number': '43382038', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Run time': '9 hours', 'Release date': 'November 24, 2015', 'Actors': 'Various', 'Studio': 'BBC', 'Number of discs': '3'}\nReview Text: I love the Tardis speaker.  It charges quickly with the USB cable.  The instructions say it should be able to hook up with your computer if attached by the USB cable, but I have only been able to get it to connect to my aging 2008 MacBook Pro by using the Bluetooth connection.  It pairs excellently with my iPhone and iPad also.  A total treat for this Whovian.<br /><br />In a comment to another post I listed all the episodes included in the three disk set, and I am repeating this info below as it is not included in the item information by Amazon.  I am giving this only 4 stars because the DVD set arrived with the middle piece to one of the DVD holders half broken, making it impossible to securely stow one of them when not in use.  All three DVD's were loose in the case on arrival but fortunately not scratched and all played well.<br /><br />Tenth Doctor David Tennant specials---<br />The Christmas Invasion<br />The Runaway Bride<br />Voyage of the Damned<br />The Next Doctor<br />The End Of Time, Part One<br />The End Of Time, Part Two<br /><br />Eleventh Doctor Matt Smith specials--<br />A Christmas Carol<br />The Doctor, the Widow and the Wardrobe<br />The Snowmen<br />The Time of the Doctor<br /><br />Twelfth Doctor Peter Capaldi special--<br />Last Christmas<br /><br />There is also a bonus feature called Ten Christmases:  &#34;in this exclusive new feature Rufus Hound is on a mission to discover what makes a Doctor Who Christmas Special so special!&#34;\nReview Title: Super gift for your favorite Whovian\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Dish\nReview Date: 2015/12/22\nStore: Rob Sitch  (Director),     Sam Neill  (Actor),     Kevin Harrington  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['It\\'s the biggest event since sheep invented wool! Apollo 11\\'s astronauts will walk on the moon -- and the 1,000-ton satellite dish in tiny, sheep-farming Parkes, Australia, will beam that historic first step around the globe. But as giddy citizens prepare for the moment when the entire world will depend on them, the dish flatlines. And its unconventional Aussie crew and its by-the-book NASA supervisor from the U.S. have very different ideas about how to fix it. A culture clash of cosmic proportions erupts in this fact-based tale of how the biggest televised event in history was almost not televised. The Dish, with Sam Neill (Jurassic Park), Patrick Warburton (Seinfeld) and others in a skilled ensemble portraying a spirited array of techies and townies, \"will send you to the moon and back laughing\" (Bruce Kirkland, Toronto Sun).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Patrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John McmartinPatrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John Mcmartin  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': 'WARA667702DVD', 'Director': 'Rob Sitch', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 6, 2012', 'Actors': 'Sam Neill, Kevin Harrington, Tom Long, Patrick Warburton, Genevieve Mooy', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have loved this movie since my first viewing in a theater.  Based on the true story of how the television signal made it from the moon to all those TV sets worldwide back in July 1969 -- thanks to a wonderful facility in Parkes, Australia.  Get ready to enjoy a story where the geeks are also the heroes!\nReview Title: Excellent Apollo 11 story from a different viewpoint\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eureka Gesamtbox [Blu-ray]\nReview Date: 2016/02/12\nStore: Salli Richardson-Whitfield  (Actor),     Colin Ferguson  (Actor)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: [\"Eureka is a seemingly ordinary place whose residents lead ordinary lives...at least to the naked eye. Shrouded in secrecy, the picturesque town is actually a community of scientific geniuses secretly relocated by the government to conduct top-secret research. This hit series smartly roots itself in reality, as the drama of the townsfolk stems from life's myriad of everyday challenges. But with the population's unique talents, troubled psyches and limitless resources, these small-town concerns have a way of becoming big-time problems. It is at that intersection, where human frailty and super-science collide - that Eureka begins. Let this Complete Series Collection take you to another place as you watch every episode from each of the five seasons, back-to-back and uninterrupted!\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Blu-ray, DVD', 'Contributor': 'Colin Ferguson, Salli Richardson-Whitfield', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.47 x 2.8 x 6.89 inches; 1.47 Pounds', 'Item model number': '5053083001292', 'Media Format': 'Blu-ray, DVD', 'Release date': 'October 16, 2014', 'Actors': 'Salli Richardson-Whitfield, Colin Ferguson', 'Subtitles': 'English, French, German', 'Studio': 'Universal Pictures', 'Number of discs': '18'}\nReview Text: I loved this series and missed the release of the DVD version, so I was really happy to find this region free BluRay edition. It is from Germany and comes with a choice not only audio tracks in your choice of English, French, and German, but also visual subtitles that can be selected separately from the audio, that is you can watch with English audio but have subtitles in German or French or English (or none at all). And it plays great on my Sony US BluRay DVD player.<br /><br />Comes as a set of 18 disks with bonus materials.  If you would like a great series packaged in a great set, buy this one!<br /><br />Note that this takes a long while for delivery (made it two days after its latest predicted arrival) as it is sold by a third party and is shipped from Germany.\nReview Title: EUREKA!!!!  Great set of DVD's!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tin Man (Two-Disc Collector's Edition) [Blu-ray]\nReview Date: 2017/08/21\nStore: Alan Cumming  (Actor),     Nick Willing  (Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Widescreen', 'Contributor': 'Nick Willing, Zoey Deschanel, Alan Cumming', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'July 20, 2010', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Item model number': 'MCMBRRH2763', 'Director': 'Nick Willing', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Widescreen', 'Release date': 'July 20, 2010', 'Actors': 'Alan Cumming', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nReview Text: Wonderful movie I have enjoyed for years.  And this one has subtitles!\nReview Title: Off to the O.Z.!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Day After [DVD]\nReview Date: 2018/04/25\nStore: Jason Robards  (Actor),     JoBeth Williams  (Actor),     Nicholas Meyer  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['The countdown has begun! Against the real-life backdrop of the U.S. deployment of WMDs in Europe during the escalating Cold War, this \"dramatically involving [and] agonizingly graphic film\" (The Hollywood Reporter) about nuclear holocaust detonated a direct hit into the heartland of America.Starring Jason Robards, JoBeth Williams, Steven Guttenberg, John Cullum and John Lithgow, this \"controversial, potent drama\" (Leonard Maltin) remains \"one of the most talked-about programs in history\"(Newsweek)! When Cold War tensions reach the ultimate boiling point, the inhabitants of a small town in Kansas learn along with the rest of America that they have fewer than 30 minutes before 300 Soviet warheads begin to appear overhead! Can anyone survive this ultimate nightmare...or the nuclear winter that is sure to follow?']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Color, DVD, Full Screen, NTSC', 'Contributor': 'Steve Guttenberg, Amy Madigan, JoBeth Williams, Georgann Johnson, John Lithgow, Jason Robards, Edward Hume, Bibi Besch, Jeff East, Calvin Jung, Lori Lethin, Nicholas Meyer, William Allen Young, John CullumSteve Guttenberg, Amy Madigan, JoBeth Williams, Georgann Johnson, John Lithgow, Jason Robards, Edward Hume, Bibi Besch, Jeff East, Calvin Jung, Lori Lethin, Nicholas Meyer, William Allen Young, John Cullum   See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Nicholas Meyer', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '2 hours and 7 minutes', 'Release date': 'May 18, 2004', 'Actors': 'Jason Robards, JoBeth Williams, Steve Guttenberg, John Cullum, John Lithgow', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Edward Hume', 'Number of discs': '1'}\nReview Text: Might not be a great movie but truly an excellent public service message about the horrors of nuclear war. I was on active duty in the Navy in the midst of the Cold War, which always seemed to leave us on the knife’s edge between peace and war. Everyone should see this, especially the politicians, most of whom seem totally ignorant of the effects of playing chicken with nuclear weapons. This will scare the beejeezus out of you. As well it should.\nReview Title: By the time the missiles fly, it is too late....\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Princess Bride (The Criterion Collection) [Blu-ray]\nReview Date: 2018/11/01\nStore: Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright  (Actor),     Rob Reiner  (Director)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['From celebrated director Rob Reiner ( When Harry Met Sally ) and Oscar (r) winning* screenwriter William Goldman ( Chaplin ) comes \"an enchanting fantasy\" ( Time ) filled with adventure, romance and plenty of \"good hearted fun\" (Roger Ebert)! Featuring a spectacular cast thatincludes Robin Wright ( Forrest Gump ), Cary Elwes ( Liar, Liar ), Mandy Patinkin ( Dick Tracy ) and Billy Crystal ( City Slickers ), this wonderful fairy tale about a Princess named Buttercup and her beloved is \"a real dream of a movie\" ( People )! *1969: OriginalScreenplay, Butch Cassidy and the Sundance Kid 1976: Adapted Screenplay, All the President\\'s Men']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family, Action & Adventure', 'Format': 'Subtitled, Widescreen', 'Contributor': 'Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright, Rob Reiner', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Audio Description': 'English', 'Director': 'Rob Reiner', 'Media Format': 'Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'October 30, 2018', 'Actors': 'Cary Elwes;Peter Falk;Chris Sarandon;Fred Savage;Robin Wright', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Number of discs': '1'}\nReview Text: Best movie ever and this is a great version. The sound is especially fabulous. I found the picture quaility superior to my DVD Version but I am watching on an older Panasonic plasma 720p HDTV and am totally impressed. As for the packaging, I agree it was poor planning to put the info sheet onto the back of the book, but it peeled off easily and I then placed it on the last page of the book facing the Blu Ray. Easy fix. And the text was lovely, with essays written by both Sloan’s Crosley and William Goldman. Any fan will love this!\nReview Title: Criterion—-A truly worthwhile addition to your collection!\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe individual demonstrates a strong preference for high-quality storytelling, particularly in drama and science fiction genres, reflected in consistently high ratings (averaging above 4.5). A notable affinity for British and American productions with intricate plots, character development, and historical context is evident. The subject shows a discerning taste for pivotal narratives, especially those showcasing unique cultural perspectives or significant historical events. \n\nTechnically, they are drawn to media formats that enhance viewing experiences, as indicated by appreciation for Blu-ray and special editions featuring superior audio-visual quality. They are less sensitive to high costs when investing in well-reviewed or collectible items, as demonstrated by purchases of special gift sets and series collections. Moreover, there is a trend toward purchasing products with engaging, nostalgic appeal, particularly series connected to beloved franchises. \n\nOverall, the core preferences highlight a passion for well-crafted series and films, with a desire for quality content, enhanced media experiences, and nostalgia-driven items, coupled with a willingness to invest in high-quality collections that resonate personally.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Needs Region Free player— this will not play on a regular North American Region One Player!!!!",
    "text": "Mary Chapin Carpenter in Concert at Wolf Trap on two sided DVD. Short interviews with Mary and others interspersed. Copyrighted 1995 by Sony.<br /><br />If you are a fan especially from earlier years and have a Region Free Player you will really enjoy this!!!<br /><br />See photos for content info.",
    "images": [
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/513+emZQFHL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/513+emZQFHL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/513+emZQFHL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/51RbaSBUtXL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/51RbaSBUtXL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/51RbaSBUtXL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B000160YYA",
    "parent_asin": "B000160YYA",
    "user_id": "AHY3TOE6KKKYUO62CPOALPJJPUAA",
    "timestamp": "2019-11-09 22:16:38.098000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Jubliee: Live at Wolf Trap",
    "average_rating": 4.1,
    "rating_number": 36,
    "features": [],
    "description": [],
    "price": 63.82,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51L4rR+tMeL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51L4rR+tMeL.jpg",
        "variant": "MAIN",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51aE2+H4PZL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51aE2+H4PZL.jpg",
        "variant": "BACK",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Rated:    Unrated    Format: DVD",
    "categories": [
      "Movies & TV",
      "Studio Specials",
      "Sony Pictures Home Entertainment",
      "All Sony Pictures Titles"
    ],
    "details": {
      "Format": "Multiple Formats, Import, NTSC",
      "Contributor": "Carpenter, Mary-Chapin",
      "Language": "Unqualified (Dolby Digital 5.1)",
      "Aspect Ratio": "1.33:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "Unrated (Not Rated)",
      "Product Dimensions": "0.59 x 7.56 x 5.31 inches; 2.93 Ounces",
      "Media Format": "Multiple Formats, Import, NTSC",
      "Release date": "February 23, 2004",
      "Actors": "Carpenter, Mary-Chapin",
      "Dubbed": "English",
      "Studio": "Sony UK",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}