{
  "user_id": "AGLAXKW6OG6XNTBWBYQYMFT53BYQ",
  "summary": "=== Purchase Information ===\nProduct Title: The Karate Kid\nReview Date: 2014/01/24\nStore: Jaden Smith  (Actor),     Jackie Chan  (Actor),     Harald Zwart  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'When Dre Parker (Jaden Smith) and his mother (Taraji P. Henson) move from Detroit to China, Dre feels lost in a world very different from what he knows. Bullied and beaten up by some fellow students in his school, Dre is rescued by his apartment building’s handyman, Mr. Han (Jackie Chan), a man who is mourning a devastating loss. Mr. Han takes pity on Dre and agrees to teach him kung fu to defend himself. Training together, teacher and student learn to trust each other, and ultimately form a friendship that heals them both.', 'Amazon.com', 'A remake of the 1984 film of the same name,', 'The Karate Kid', \"well exceeds expectations, delivering a powerful viewing experience filled with action-packed martial arts scenes, great footage of China and its many wonders, and an absorbing story of a preadolescent boy's struggle to find his own inner strength. The title\", 'Karate Kid', \"is really a misnomer as it is the art of kung fu that is practiced in this remake, not karate, and other details, including the film's setting in China, also differ from the original film. What remains the same, and just as powerful, is the underlying story: a young boy moves to a new place where he feels isolated and is bullied by his peers. Through an unlikely relationship with an adult, the boy not only learns to protect himself through martial arts, but develops the much more important qualities of respect and the mastery of one's own mind and body. Relative newcomer Jaden Smith (son of actors and producers Will Smith and Jada Pinkett Smith) is excellent as the main character Drek Parker; Jackie Chan gives a restrained and highly effective performance as his mentor Mr. Han; and Zhenwei Wang is eerily believable as the bully Chen. This is an intense and often violent film that fully engulfs its viewers--be prepared to gasp and cheer out loud, and know that you may never look at the act of putting on and taking off a jacket in the same way again. (Ages 8 and older with parental guidance)\", '--Tami Horiuchi']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Martial Arts, Action, Drama, Family, Sports', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, AC-3', 'Contributor': 'Harald Zwart, Jaden Smith, Jackie Chan', 'Language': 'Unqualified, French (Dolby Surround)', 'Runtime': '2 hours and 20 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.54 x 5.36 x 7.48 inches; 2.4 Ounces', 'Item model number': 'CTR35913DVD', 'Director': 'Harald Zwart', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, AC-3', 'Run time': '2 hours and 20 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Jaden Smith, Jackie Chan', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Perhaps the best movie ever.<br />My grandson and I have watched - 10? times.<br />The scenery (of China, city and country scenes, Great Wall and monastery fortress) is priceless and extremely well done. Acting superb. Just not a renter - a purchase for sure.<br />BOth kids now in karate classes, and it has worked wonders. Great!\nReview Title: A-#1\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gasland\nReview Date: 2014/02/01\nStore: Josh Fox  (Actor, Director, Writer),     Dick Cheney  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'In 2009, filmmaker Josh Fox learned his home in the Delaware River Basin was on top of the Marcellus Shale, a rock formation containing natural gas that stretches across New York, Pennsylvania and huge stretches of the Northeast. He was offered $100,000 to lease his land for a new method of drilling developed by Halliburton and soon discovered this was only a part of a 34-state drilling campaign, the largest domestic natural gas drilling boom in history. Part mystery, part travelogue, and part banjo showdown,', 'Gasland', \"documents Josh's cross-country odyssey to find out if the controversial process of hydraulic fracturing - or fracking - is actually safe. As he interviews people who live on or around current fracking sites, Josh learns of things gone horribly wrong, from illness to hair loss to flammable water, and his inquiries lead him ever deeper into a web of secrets, lies, conspiracy, and contamination - a web that potentially stretches to threaten the New York Watershed. Unearthing a shocking story about a practice that is understudied and inadequately regulated, Gasland races to find answer about fracking before it's far too late.\", 'Amazon.com', \"Little did director Josh Fox know that he'd find himself trailing the history and future of natural gas mining for this documentary,\", 'Gasland', ', or so he claims in this moving and evocative political exposé. Thankfully unpretentious and lacking in the didacticism that plagues many political documentaries,', 'Gasland', \"is edifying in the most entertaining and palatable way. Fox's open-ended questions presented during his narration are answered by interviewees found as he travels cross-country to source out water pollution happening as a result of hydraulic fracturing. The tension begins when Fox researches a letter he receives in the mail at his rural Pennsylvania farmhouse, inviting him to sell his land for $100,000 and permission to mine natural gas. He comes to discover how the Delaware River watershed's imminently endangered status will threaten New York City's main water source, and towards the end of the film focuses on New York City, as respected politicians like John Gennaro and Congressman Maurice Hinchey speak on behalf of this issue. But before filming congressional hearings, Fox charts his personal dilemma and how it quickly spirals outward, as first his neighbors tell him horror stories about water contamination due to this process. And as he tours Colorado, Wyoming, and Texas, where hydraulic fracturing has already contaminated myriad underground wells, Fox actually films many families' water faucets catching fire as people hold a match to their running tap water. Fox's continuing investigation ties this unchecked chemical process to Dick Cheney's Halliburton activity and bills covertly passed during the Bush administration.\", 'Gasland', 'does not have a conspiratorial feel; it takes an honest, even-keeled investigative approach and relies on information relayed to Fox from renowned activists like Dr. Theo Colborn and Environmental Protection Agency staffer Weston Wilson. This documentary sheds light on what has been a practice that many American citizens have assumed mysterious and possibly benign. It is easy to understand why', 'Gasland', 'has garnered so many film festival awards, since it presents vital information that will necessitate action once it reaches enough of the population. This is grassroots documentary filmmaking at its finest. --', 'Trinie Dalton']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Ron Carter, Debbie May, Pat Fernelli, Richard Nixon, Norma Fiorentino, Josh Fox, Jean Carter, Pete Seeger, Aubrey K. McClendon, Dick CheneyRon Carter, Debbie May, Pat Fernelli, Richard Nixon, Norma Fiorentino, Josh Fox, Jean Carter, Pete Seeger, Aubrey K. McClendon, Dick Cheney  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 47 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.56 x 5.06 x 7.73 inches; 1.6 Ounces', 'Item model number': '84-0900', 'Director': 'Josh Fox', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'December 14, 2010', 'Actors': 'Josh Fox, Dick Cheney, Pete Seeger, Richard Nixon, Aubrey K. McClendon', 'Studio': 'Docurama', 'Writers': 'Josh Fox', 'Number of discs': '1'}\nReview Text: There is no option for a zero rating, or this would be so rated.<br />Such media hype (I cannot in good conscience use the word \"journalist\") masquerading (ever so thinly) as truth - makes no pretense to be research-based or true journalism. It is purely sensationalistic hype, which some would argue is a constitutional right - to speak one's \"opinion\" (aren't we getting tired of this?). But when that speech harms the lives and livelihoods of many, then it deserves to be exposed for what it is.<br />Frack Nation builds an excellent and unbiased, unsensationalized case for exposing the lies perpetrated in this (Gasland) video, and it is unfortunate that such a counter (FrackNation) is not available in Amazon's inventory.<br />Hmmm . . WHY????\nReview Title: ZERO\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Raise the Red Lantern\nReview Date: 2014/02/19\nStore: Li Gong  (Actor),     Jingwu Ma  (Actor),     Yimou Zhang  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Songlian, an educated nineteen-year-old girl, is forced to leave college to become the fourth wife of a powerful, feudal nobleman and becomes involved in the intrigues and rivalries between his other wives.', 'Genre:', 'Foreign Film - Chinese', 'Rating:', 'PG', 'Release Date:', '24-JUL-2007', 'Media Type:', 'DVD']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Director': 'Yimou Zhang', 'Media Format': 'Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 5 minutes', 'Release date': 'July 24, 2007', 'Actors': 'Li Gong, Jingwu Ma, Saifei He, Cuifen Cao, Qi Zhao', 'Subtitles': 'English, French, Spanish', 'Language': 'Unqualified', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Ni Zhen, Su Tong', 'Number of discs': '1'}\nReview Text: Left feeling at the bottom of a bottomless pit,\" wrote one reviewer, with whom I concur. If I want consciousness-raisiing I will seek it.<br /><br />Ebert's review ([...]) is a Must-Read before investing time in this drama. It is about curelty, slavery and female interpersonal drama (much of it just plain meanand spiteful). There is very little positive content anywhere to be found. If that is OK way to invest your time, then go for it - true, there is some gorgeous cinematography - but not sufficient to redeem this two hours.<br /><br />I can' believe I didn't vet this more carefully (also seconding the comment \"waiting for it to get better\") . .\nReview Title: \"At the bottom of a bottomless pit\"\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: Animal Antics\nReview Date: 2015/03/28\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Get ready for farm-fresh fun and laughter with Shaun the Sheep™ and his barnyard buddies, as they set the scene for more mayhem on the farm. Laugh out loud as Shaun tries to outfox a fox, Bitzer discovers his jazzy side, and the sheep try to sell everything on the farm to the highest bidder. Shaun and his friends deliver 7 hilarious adventures full of animal antics that will make the whole family cock-a-doodle doo!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Children', 'Format': 'Multiple Formats, Closed-captioned, Color, Animated, Dolby, NTSC, Widescreen', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Animated, Dolby, NTSC, Widescreen', 'Run time': '44 minutes', 'Release date': 'July 26, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolute best EVER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: The Big Chase\nReview Date: 2015/03/28\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Start your engines for fun and laughter with Shaun the Sheep™ and his barnyard buddies as they speed off to stir up some mayhem in the meadow. The Oscar®-winning creators of Wallace and Gromit™ accelerate the laughter with revved-up adventures, from big races and chases to bikes and boats and everything in between. So buckle up for a wild ride with Shaun, Bitzer, Shirley, Timmy, and those Naughty Pigs next door as fun on the farm shifts into high gear!']\nAverage Rating: 4.6\nProduct Details: {'Format': 'Animated, Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Dolby', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Publication Date': 'April 19, 2011', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 1.6 Ounces', 'Item model number': 'HITD181539D', 'Media Format': 'Animated, Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Dolby', 'Release date': 'April 19, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolutely best EVER.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun The Sheep: A Woolly Good Time\nReview Date: 2015/03/28\nStore: Shaun the Sheep  (Actor),     tbd  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['A little pinch of zaniness and a big dash of fun is the perfect recipe for laughter as Shaun the Sheep™ and his barnyard buddies Bitzer, Shirley, and Timmy get into more wacky shenanigans along with those fun-loving Naughty Pigs next door. The laughs keep rising, as the creators of the Academy Award®-winning Wallace & Gromit™ are on a roll, dough-ling out more sheep-herding mayhem by the baker’s dozen.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Shaun the Sheep, Tbd', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.35 x 0.55 inches; 3.2 Ounces', 'Item model number': 'HITD181087D', 'Director': 'tbd', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '39 minutes', 'Release date': 'February 16, 2010', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolute Best EVER.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: Off the Baa!\nReview Date: 2015/03/28\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Shuan The Sheep ~ Off The Baa']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Shaun the Sheep', 'Language': 'Unqualified', 'Runtime': '51 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 0.01 Ounces', 'Item model number': 'HITD180065D', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '51 minutes', 'Release date': 'November 11, 2008', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolute. BEST EVER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: Spring Shena-a-anigans\nReview Date: 2015/03/28\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Spring with excitement and jump with joy because Shaun the Sheep is back for more wild adventures from the Oscar®-winning creators of Wallace & Gromit™. Fun on the farm springs to life with Shaun and his barnyard buddies – from bouncing sheep and a supersized Timmy to bagpipe buddies and a shortsighted farmer, there’s no limit to the wild things these animals will do. So hop along with Shaun, Bitzer, Shirley, Timmy, and those Naughty Pigs next door in some sheepherding mayhem that’s sure to give you a lift!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Animation, Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Publication Date': 'January 25, 2011', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': 'HITD181471D', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Release date': 'January 25, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: BEST EVER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Everybody Wins\nReview Date: 2015/09/12\nStore: Debra Winger  (Actor),     Nick Nolte  (Actor),     Karel Reisz  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"If there's one thing private eye Tom O'Toole (Nick Nolte, Mulholland Falls) knows, he's falling for Angela Crispini (Debra Winger, Black Widow), his seductive young client. But what he doesn't know could get him killed. Angela has hired O'Toole to prove a local teenager was wrongly convicted of murder. Following her leads, O'Toole soon suspects the town may be involved in some kind of cover-up. But what bothers him most of all is Angela herself. The more time he spends with her, the more O'Toole begins to realize she's either lying, insane or both.\"]\nAverage Rating: 3.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.54 x 0.75 x 0.07 inches; 3.2 Ounces', 'Director': 'Karel Reisz', 'Media Format': 'Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'December 13, 2005', 'Actors': 'Debra Winger, Nick Nolte, Will Patton, Judith Ivey, Kathleen Wilhoite', 'Subtitles': 'English, French', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Arthur Miller', 'Number of discs': '1'}\nReview Text: Hubby teaches American Drama - bought for him to use in class, as written by Arthur Miller.\nReview Title: Fine purchase.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rams\nReview Date: 2016/11/23\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"In a secluded valley in Iceland, Gummi and Kiddi live side by side, tending to their sheep. Their ancestral sheep-stock is considered one of the country's best and the two brothers are repeatedly awarded for their prized rams who carry an ancient lineage. Although they share the land and a way of life, Gummi and Kiddi have not spoken to each other in four decades. When a lethal disease suddenly infects Kiddi's sheep, the entire valley comes under threat. The authorities decide to cull all the animals in the area to contain the outbreak. This is a near death sentence for the farmers, whose sheep are their main source of income, and many abandon their land. But Gummi and Kiddi don't give up so easily – and each brother tries to stave off the disaster in his own fashion: Kiddi by using his rifle and Gummi by using his wits. As the authorities close in, the brothers will need to come together to save the special breed passed down for generations, and themselves, from extinction.\"]\nAverage Rating: 4.4\nProduct Details: {'Aspect Ratio': '2.35:1', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35382868', 'Director': 'Various', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Various', 'Subtitles': 'English', 'Language': 'Icelandic (Dolby Digital 5.1)', 'Studio': 'Cohen Media Group', 'Number of discs': '1'}\nReview Text: OHmygosh - just delightful. No sensationalism, not a lot of verbiage - lots of ice scenic shots and pensive opportunity. Delightful interactions, honest drama.\nReview Title: Delightful use of time\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Karate Kid\nJaden Smith  (Actor),     Jackie Chan  (Actor),     Harald Zwart  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'When Dre Parker (Jaden Smith) and his mother (Taraji P. Henson) move from Detroit to China, Dre feels lost in a world very different from what he knows. Bullied and beaten up by some fellow students in his school, Dre is rescued by his apartment building’s handyman, Mr. Han (Jackie Chan), a man who is mourning a devastating loss. Mr. Han takes pity on Dre and agrees to teach him kung fu to defend himself. Training together, teacher and student learn to trust each other, and ultimately form a friendship that heals them both.', 'Amazon.com', 'A remake of the 1984 film of the same name,', 'The Karate Kid', \"well exceeds expectations, delivering a powerful viewing experience filled with action-packed martial arts scenes, great footage of China and its many wonders, and an absorbing story of a preadolescent boy's struggle to find his own inner strength. The title\", 'Karate Kid', \"is really a misnomer as it is the art of kung fu that is practiced in this remake, not karate, and other details, including the film's setting in China, also differ from the original film. What remains the same, and just as powerful, is the underlying story: a young boy moves to a new place where he feels isolated and is bullied by his peers. Through an unlikely relationship with an adult, the boy not only learns to protect himself through martial arts, but develops the much more important qualities of respect and the mastery of one's own mind and body. Relative newcomer Jaden Smith (son of actors and producers Will Smith and Jada Pinkett Smith) is excellent as the main character Drek Parker; Jackie Chan gives a restrained and highly effective performance as his mentor Mr. Han; and Zhenwei Wang is eerily believable as the bully Chen. This is an intense and often violent film that fully engulfs its viewers--be prepared to gasp and cheer out loud, and know that you may never look at the act of putting on and taking off a jacket in the same way again. (Ages 8 and older with parental guidance)\", '--Tami Horiuchi']\n{'Genre': 'Martial Arts, Action, Drama, Family, Sports', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, AC-3', 'Contributor': 'Harald Zwart, Jaden Smith, Jackie Chan', 'Language': 'Unqualified, French (Dolby Surround)', 'Runtime': '2 hours and 20 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.54 x 5.36 x 7.48 inches; 2.4 Ounces', 'Item model number': 'CTR35913DVD', 'Director': 'Harald Zwart', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, AC-3', 'Run time': '2 hours and 20 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Jaden Smith, Jackie Chan', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPerhaps the best movie ever.<br />My grandson and I have watched - 10? times.<br />The scenery (of China, city and country scenes, Great Wall and monastery fortress) is priceless and extremely well done. Acting superb. Just not a renter - a purchase for sure.<br />BOth kids now in karate classes, and it has worked wonders. Great!\nA-#1\nGasland\nJosh Fox  (Actor, Director, Writer),     Dick Cheney  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Product Description', 'In 2009, filmmaker Josh Fox learned his home in the Delaware River Basin was on top of the Marcellus Shale, a rock formation containing natural gas that stretches across New York, Pennsylvania and huge stretches of the Northeast. He was offered $100,000 to lease his land for a new method of drilling developed by Halliburton and soon discovered this was only a part of a 34-state drilling campaign, the largest domestic natural gas drilling boom in history. Part mystery, part travelogue, and part banjo showdown,', 'Gasland', \"documents Josh's cross-country odyssey to find out if the controversial process of hydraulic fracturing - or fracking - is actually safe. As he interviews people who live on or around current fracking sites, Josh learns of things gone horribly wrong, from illness to hair loss to flammable water, and his inquiries lead him ever deeper into a web of secrets, lies, conspiracy, and contamination - a web that potentially stretches to threaten the New York Watershed. Unearthing a shocking story about a practice that is understudied and inadequately regulated, Gasland races to find answer about fracking before it's far too late.\", 'Amazon.com', \"Little did director Josh Fox know that he'd find himself trailing the history and future of natural gas mining for this documentary,\", 'Gasland', ', or so he claims in this moving and evocative political exposé. Thankfully unpretentious and lacking in the didacticism that plagues many political documentaries,', 'Gasland', \"is edifying in the most entertaining and palatable way. Fox's open-ended questions presented during his narration are answered by interviewees found as he travels cross-country to source out water pollution happening as a result of hydraulic fracturing. The tension begins when Fox researches a letter he receives in the mail at his rural Pennsylvania farmhouse, inviting him to sell his land for $100,000 and permission to mine natural gas. He comes to discover how the Delaware River watershed's imminently endangered status will threaten New York City's main water source, and towards the end of the film focuses on New York City, as respected politicians like John Gennaro and Congressman Maurice Hinchey speak on behalf of this issue. But before filming congressional hearings, Fox charts his personal dilemma and how it quickly spirals outward, as first his neighbors tell him horror stories about water contamination due to this process. And as he tours Colorado, Wyoming, and Texas, where hydraulic fracturing has already contaminated myriad underground wells, Fox actually films many families' water faucets catching fire as people hold a match to their running tap water. Fox's continuing investigation ties this unchecked chemical process to Dick Cheney's Halliburton activity and bills covertly passed during the Bush administration.\", 'Gasland', 'does not have a conspiratorial feel; it takes an honest, even-keeled investigative approach and relies on information relayed to Fox from renowned activists like Dr. Theo Colborn and Environmental Protection Agency staffer Weston Wilson. This documentary sheds light on what has been a practice that many American citizens have assumed mysterious and possibly benign. It is easy to understand why', 'Gasland', 'has garnered so many film festival awards, since it presents vital information that will necessitate action once it reaches enough of the population. This is grassroots documentary filmmaking at its finest. --', 'Trinie Dalton']\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Ron Carter, Debbie May, Pat Fernelli, Richard Nixon, Norma Fiorentino, Josh Fox, Jean Carter, Pete Seeger, Aubrey K. McClendon, Dick CheneyRon Carter, Debbie May, Pat Fernelli, Richard Nixon, Norma Fiorentino, Josh Fox, Jean Carter, Pete Seeger, Aubrey K. McClendon, Dick Cheney  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 47 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.56 x 5.06 x 7.73 inches; 1.6 Ounces', 'Item model number': '84-0900', 'Director': 'Josh Fox', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'December 14, 2010', 'Actors': 'Josh Fox, Dick Cheney, Pete Seeger, Richard Nixon, Aubrey K. McClendon', 'Studio': 'Docurama', 'Writers': 'Josh Fox', 'Number of discs': '1'}\nThere is no option for a zero rating, or this would be so rated.<br />Such media hype (I cannot in good conscience use the word \"journalist\") masquerading (ever so thinly) as truth - makes no pretense to be research-based or true journalism. It is purely sensationalistic hype, which some would argue is a constitutional right - to speak one's \"opinion\" (aren't we getting tired of this?). But when that speech harms the lives and livelihoods of many, then it deserves to be exposed for what it is.<br />Frack Nation builds an excellent and unbiased, unsensationalized case for exposing the lies perpetrated in this (Gasland) video, and it is unfortunate that such a counter (FrackNation) is not available in Amazon's inventory.<br />Hmmm . . WHY????\nZERO\nRaise the Red Lantern\nLi Gong  (Actor),     Jingwu Ma  (Actor),     Yimou Zhang  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Songlian, an educated nineteen-year-old girl, is forced to leave college to become the fourth wife of a powerful, feudal nobleman and becomes involved in the intrigues and rivalries between his other wives.', 'Genre:', 'Foreign Film - Chinese', 'Rating:', 'PG', 'Release Date:', '24-JUL-2007', 'Media Type:', 'DVD']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Director': 'Yimou Zhang', 'Media Format': 'Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 5 minutes', 'Release date': 'July 24, 2007', 'Actors': 'Li Gong, Jingwu Ma, Saifei He, Cuifen Cao, Qi Zhao', 'Subtitles': 'English, French, Spanish', 'Language': 'Unqualified', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Ni Zhen, Su Tong', 'Number of discs': '1'}\nLeft feeling at the bottom of a bottomless pit,\" wrote one reviewer, with whom I concur. If I want consciousness-raisiing I will seek it.<br /><br />Ebert's review ([...]) is a Must-Read before investing time in this drama. It is about curelty, slavery and female interpersonal drama (much of it just plain meanand spiteful). There is very little positive content anywhere to be found. If that is OK way to invest your time, then go for it - true, there is some gorgeous cinematography - but not sufficient to redeem this two hours.<br /><br />I can' believe I didn't vet this more carefully (also seconding the comment \"waiting for it to get better\") . .\n\"At the bottom of a bottomless pit\"\nShaun the Sheep: Animal Antics\nRated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Get ready for farm-fresh fun and laughter with Shaun the Sheep™ and his barnyard buddies, as they set the scene for more mayhem on the farm. Laugh out loud as Shaun tries to outfox a fox, Bitzer discovers his jazzy side, and the sheep try to sell everything on the farm to the highest bidder. Shaun and his friends deliver 7 hilarious adventures full of animal antics that will make the whole family cock-a-doodle doo!']\n{'Genre': 'Children', 'Format': 'Multiple Formats, Closed-captioned, Color, Animated, Dolby, NTSC, Widescreen', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Animated, Dolby, NTSC, Widescreen', 'Run time': '44 minutes', 'Release date': 'July 26, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nOH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nAbsolute best EVER\nShaun the Sheep: The Big Chase\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Start your engines for fun and laughter with Shaun the Sheep™ and his barnyard buddies as they speed off to stir up some mayhem in the meadow. The Oscar®-winning creators of Wallace and Gromit™ accelerate the laughter with revved-up adventures, from big races and chases to bikes and boats and everything in between. So buckle up for a wild ride with Shaun, Bitzer, Shirley, Timmy, and those Naughty Pigs next door as fun on the farm shifts into high gear!']\n{'Format': 'Animated, Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Dolby', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Publication Date': 'April 19, 2011', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 1.6 Ounces', 'Item model number': 'HITD181539D', 'Media Format': 'Animated, Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Dolby', 'Release date': 'April 19, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment'}\nOH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nAbsolutely best EVER.\nShaun The Sheep: A Woolly Good Time\nShaun the Sheep  (Actor),     tbd  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['A little pinch of zaniness and a big dash of fun is the perfect recipe for laughter as Shaun the Sheep™ and his barnyard buddies Bitzer, Shirley, and Timmy get into more wacky shenanigans along with those fun-loving Naughty Pigs next door. The laughs keep rising, as the creators of the Academy Award®-winning Wallace & Gromit™ are on a roll, dough-ling out more sheep-herding mayhem by the baker’s dozen.']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Shaun the Sheep, Tbd', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.35 x 0.55 inches; 3.2 Ounces', 'Item model number': 'HITD181087D', 'Director': 'tbd', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '39 minutes', 'Release date': 'February 16, 2010', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nOH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nAbsolute Best EVER.\nShaun the Sheep: Off the Baa!\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Shuan The Sheep ~ Off The Baa']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Shaun the Sheep', 'Language': 'Unqualified', 'Runtime': '51 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 0.01 Ounces', 'Item model number': 'HITD180065D', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '51 minutes', 'Release date': 'November 11, 2008', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nOH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nAbsolute. BEST EVER\nShaun the Sheep: Spring Shena-a-anigans\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Spring with excitement and jump with joy because Shaun the Sheep is back for more wild adventures from the Oscar®-winning creators of Wallace & Gromit™. Fun on the farm springs to life with Shaun and his barnyard buddies – from bouncing sheep and a supersized Timmy to bagpipe buddies and a shortsighted farmer, there’s no limit to the wild things these animals will do. So hop along with Shaun, Bitzer, Shirley, Timmy, and those Naughty Pigs next door in some sheepherding mayhem that’s sure to give you a lift!']\n{'Genre': 'Animation, Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Publication Date': 'January 25, 2011', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': 'HITD181471D', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Release date': 'January 25, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment'}\nOH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nBEST EVER\nEverybody Wins\nDebra Winger  (Actor),     Nick Nolte  (Actor),     Karel Reisz  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n[\"If there's one thing private eye Tom O'Toole (Nick Nolte, Mulholland Falls) knows, he's falling for Angela Crispini (Debra Winger, Black Widow), his seductive young client. But what he doesn't know could get him killed. Angela has hired O'Toole to prove a local teenager was wrongly convicted of murder. Following her leads, O'Toole soon suspects the town may be involved in some kind of cover-up. But what bothers him most of all is Angela herself. The more time he spends with her, the more O'Toole begins to realize she's either lying, insane or both.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.54 x 0.75 x 0.07 inches; 3.2 Ounces', 'Director': 'Karel Reisz', 'Media Format': 'Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'December 13, 2005', 'Actors': 'Debra Winger, Nick Nolte, Will Patton, Judith Ivey, Kathleen Wilhoite', 'Subtitles': 'English, French', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Arthur Miller', 'Number of discs': '1'}\nHubby teaches American Drama - bought for him to use in class, as written by Arthur Miller.\nFine purchase.\nRams\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"In a secluded valley in Iceland, Gummi and Kiddi live side by side, tending to their sheep. Their ancestral sheep-stock is considered one of the country's best and the two brothers are repeatedly awarded for their prized rams who carry an ancient lineage. Although they share the land and a way of life, Gummi and Kiddi have not spoken to each other in four decades. When a lethal disease suddenly infects Kiddi's sheep, the entire valley comes under threat. The authorities decide to cull all the animals in the area to contain the outbreak. This is a near death sentence for the farmers, whose sheep are their main source of income, and many abandon their land. But Gummi and Kiddi don't give up so easily – and each brother tries to stave off the disaster in his own fashion: Kiddi by using his rifle and Gummi by using his wits. As the authorities close in, the brothers will need to come together to save the special breed passed down for generations, and themselves, from extinction.\"]\n{'Aspect Ratio': '2.35:1', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35382868', 'Director': 'Various', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Various', 'Subtitles': 'English', 'Language': 'Icelandic (Dolby Digital 5.1)', 'Studio': 'Cohen Media Group', 'Number of discs': '1'}\nOHmygosh - just delightful. No sensationalism, not a lot of verbiage - lots of ice scenic shots and pensive opportunity. Delightful interactions, honest drama.\nDelightful use of time",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: The Karate Kid\nReview Date: 2014/01/24\nStore: Jaden Smith  (Actor),     Jackie Chan  (Actor),     Harald Zwart  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'When Dre Parker (Jaden Smith) and his mother (Taraji P. Henson) move from Detroit to China, Dre feels lost in a world very different from what he knows. Bullied and beaten up by some fellow students in his school, Dre is rescued by his apartment building’s handyman, Mr. Han (Jackie Chan), a man who is mourning a devastating loss. Mr. Han takes pity on Dre and agrees to teach him kung fu to defend himself. Training together, teacher and student learn to trust each other, and ultimately form a friendship that heals them both.', 'Amazon.com', 'A remake of the 1984 film of the same name,', 'The Karate Kid', \"well exceeds expectations, delivering a powerful viewing experience filled with action-packed martial arts scenes, great footage of China and its many wonders, and an absorbing story of a preadolescent boy's struggle to find his own inner strength. The title\", 'Karate Kid', \"is really a misnomer as it is the art of kung fu that is practiced in this remake, not karate, and other details, including the film's setting in China, also differ from the original film. What remains the same, and just as powerful, is the underlying story: a young boy moves to a new place where he feels isolated and is bullied by his peers. Through an unlikely relationship with an adult, the boy not only learns to protect himself through martial arts, but develops the much more important qualities of respect and the mastery of one's own mind and body. Relative newcomer Jaden Smith (son of actors and producers Will Smith and Jada Pinkett Smith) is excellent as the main character Drek Parker; Jackie Chan gives a restrained and highly effective performance as his mentor Mr. Han; and Zhenwei Wang is eerily believable as the bully Chen. This is an intense and often violent film that fully engulfs its viewers--be prepared to gasp and cheer out loud, and know that you may never look at the act of putting on and taking off a jacket in the same way again. (Ages 8 and older with parental guidance)\", '--Tami Horiuchi']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Martial Arts, Action, Drama, Family, Sports', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, AC-3', 'Contributor': 'Harald Zwart, Jaden Smith, Jackie Chan', 'Language': 'Unqualified, French (Dolby Surround)', 'Runtime': '2 hours and 20 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.54 x 5.36 x 7.48 inches; 2.4 Ounces', 'Item model number': 'CTR35913DVD', 'Director': 'Harald Zwart', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, AC-3', 'Run time': '2 hours and 20 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Jaden Smith, Jackie Chan', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Perhaps the best movie ever.<br />My grandson and I have watched - 10? times.<br />The scenery (of China, city and country scenes, Great Wall and monastery fortress) is priceless and extremely well done. Acting superb. Just not a renter - a purchase for sure.<br />BOth kids now in karate classes, and it has worked wonders. Great!\nReview Title: A-#1\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gasland\nReview Date: 2014/02/01\nStore: Josh Fox  (Actor, Director, Writer),     Dick Cheney  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'In 2009, filmmaker Josh Fox learned his home in the Delaware River Basin was on top of the Marcellus Shale, a rock formation containing natural gas that stretches across New York, Pennsylvania and huge stretches of the Northeast. He was offered $100,000 to lease his land for a new method of drilling developed by Halliburton and soon discovered this was only a part of a 34-state drilling campaign, the largest domestic natural gas drilling boom in history. Part mystery, part travelogue, and part banjo showdown,', 'Gasland', \"documents Josh's cross-country odyssey to find out if the controversial process of hydraulic fracturing - or fracking - is actually safe. As he interviews people who live on or around current fracking sites, Josh learns of things gone horribly wrong, from illness to hair loss to flammable water, and his inquiries lead him ever deeper into a web of secrets, lies, conspiracy, and contamination - a web that potentially stretches to threaten the New York Watershed. Unearthing a shocking story about a practice that is understudied and inadequately regulated, Gasland races to find answer about fracking before it's far too late.\", 'Amazon.com', \"Little did director Josh Fox know that he'd find himself trailing the history and future of natural gas mining for this documentary,\", 'Gasland', ', or so he claims in this moving and evocative political exposé. Thankfully unpretentious and lacking in the didacticism that plagues many political documentaries,', 'Gasland', \"is edifying in the most entertaining and palatable way. Fox's open-ended questions presented during his narration are answered by interviewees found as he travels cross-country to source out water pollution happening as a result of hydraulic fracturing. The tension begins when Fox researches a letter he receives in the mail at his rural Pennsylvania farmhouse, inviting him to sell his land for $100,000 and permission to mine natural gas. He comes to discover how the Delaware River watershed's imminently endangered status will threaten New York City's main water source, and towards the end of the film focuses on New York City, as respected politicians like John Gennaro and Congressman Maurice Hinchey speak on behalf of this issue. But before filming congressional hearings, Fox charts his personal dilemma and how it quickly spirals outward, as first his neighbors tell him horror stories about water contamination due to this process. And as he tours Colorado, Wyoming, and Texas, where hydraulic fracturing has already contaminated myriad underground wells, Fox actually films many families' water faucets catching fire as people hold a match to their running tap water. Fox's continuing investigation ties this unchecked chemical process to Dick Cheney's Halliburton activity and bills covertly passed during the Bush administration.\", 'Gasland', 'does not have a conspiratorial feel; it takes an honest, even-keeled investigative approach and relies on information relayed to Fox from renowned activists like Dr. Theo Colborn and Environmental Protection Agency staffer Weston Wilson. This documentary sheds light on what has been a practice that many American citizens have assumed mysterious and possibly benign. It is easy to understand why', 'Gasland', 'has garnered so many film festival awards, since it presents vital information that will necessitate action once it reaches enough of the population. This is grassroots documentary filmmaking at its finest. --', 'Trinie Dalton']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Ron Carter, Debbie May, Pat Fernelli, Richard Nixon, Norma Fiorentino, Josh Fox, Jean Carter, Pete Seeger, Aubrey K. McClendon, Dick CheneyRon Carter, Debbie May, Pat Fernelli, Richard Nixon, Norma Fiorentino, Josh Fox, Jean Carter, Pete Seeger, Aubrey K. McClendon, Dick Cheney  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 47 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.56 x 5.06 x 7.73 inches; 1.6 Ounces', 'Item model number': '84-0900', 'Director': 'Josh Fox', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'December 14, 2010', 'Actors': 'Josh Fox, Dick Cheney, Pete Seeger, Richard Nixon, Aubrey K. McClendon', 'Studio': 'Docurama', 'Writers': 'Josh Fox', 'Number of discs': '1'}\nReview Text: There is no option for a zero rating, or this would be so rated.<br />Such media hype (I cannot in good conscience use the word \"journalist\") masquerading (ever so thinly) as truth - makes no pretense to be research-based or true journalism. It is purely sensationalistic hype, which some would argue is a constitutional right - to speak one's \"opinion\" (aren't we getting tired of this?). But when that speech harms the lives and livelihoods of many, then it deserves to be exposed for what it is.<br />Frack Nation builds an excellent and unbiased, unsensationalized case for exposing the lies perpetrated in this (Gasland) video, and it is unfortunate that such a counter (FrackNation) is not available in Amazon's inventory.<br />Hmmm . . WHY????\nReview Title: ZERO\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Raise the Red Lantern\nReview Date: 2014/02/19\nStore: Li Gong  (Actor),     Jingwu Ma  (Actor),     Yimou Zhang  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Songlian, an educated nineteen-year-old girl, is forced to leave college to become the fourth wife of a powerful, feudal nobleman and becomes involved in the intrigues and rivalries between his other wives.', 'Genre:', 'Foreign Film - Chinese', 'Rating:', 'PG', 'Release Date:', '24-JUL-2007', 'Media Type:', 'DVD']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Director': 'Yimou Zhang', 'Media Format': 'Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 5 minutes', 'Release date': 'July 24, 2007', 'Actors': 'Li Gong, Jingwu Ma, Saifei He, Cuifen Cao, Qi Zhao', 'Subtitles': 'English, French, Spanish', 'Language': 'Unqualified', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Ni Zhen, Su Tong', 'Number of discs': '1'}\nReview Text: Left feeling at the bottom of a bottomless pit,\" wrote one reviewer, with whom I concur. If I want consciousness-raisiing I will seek it.<br /><br />Ebert's review ([...]) is a Must-Read before investing time in this drama. It is about curelty, slavery and female interpersonal drama (much of it just plain meanand spiteful). There is very little positive content anywhere to be found. If that is OK way to invest your time, then go for it - true, there is some gorgeous cinematography - but not sufficient to redeem this two hours.<br /><br />I can' believe I didn't vet this more carefully (also seconding the comment \"waiting for it to get better\") . .\nReview Title: \"At the bottom of a bottomless pit\"\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: Animal Antics\nReview Date: 2015/03/28\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Get ready for farm-fresh fun and laughter with Shaun the Sheep™ and his barnyard buddies, as they set the scene for more mayhem on the farm. Laugh out loud as Shaun tries to outfox a fox, Bitzer discovers his jazzy side, and the sheep try to sell everything on the farm to the highest bidder. Shaun and his friends deliver 7 hilarious adventures full of animal antics that will make the whole family cock-a-doodle doo!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Children', 'Format': 'Multiple Formats, Closed-captioned, Color, Animated, Dolby, NTSC, Widescreen', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Animated, Dolby, NTSC, Widescreen', 'Run time': '44 minutes', 'Release date': 'July 26, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolute best EVER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: The Big Chase\nReview Date: 2015/03/28\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Start your engines for fun and laughter with Shaun the Sheep™ and his barnyard buddies as they speed off to stir up some mayhem in the meadow. The Oscar®-winning creators of Wallace and Gromit™ accelerate the laughter with revved-up adventures, from big races and chases to bikes and boats and everything in between. So buckle up for a wild ride with Shaun, Bitzer, Shirley, Timmy, and those Naughty Pigs next door as fun on the farm shifts into high gear!']\nAverage Rating: 4.6\nProduct Details: {'Format': 'Animated, Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Dolby', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Publication Date': 'April 19, 2011', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 1.6 Ounces', 'Item model number': 'HITD181539D', 'Media Format': 'Animated, Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Dolby', 'Release date': 'April 19, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolutely best EVER.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun The Sheep: A Woolly Good Time\nReview Date: 2015/03/28\nStore: Shaun the Sheep  (Actor),     tbd  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['A little pinch of zaniness and a big dash of fun is the perfect recipe for laughter as Shaun the Sheep™ and his barnyard buddies Bitzer, Shirley, and Timmy get into more wacky shenanigans along with those fun-loving Naughty Pigs next door. The laughs keep rising, as the creators of the Academy Award®-winning Wallace & Gromit™ are on a roll, dough-ling out more sheep-herding mayhem by the baker’s dozen.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Shaun the Sheep, Tbd', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.35 x 0.55 inches; 3.2 Ounces', 'Item model number': 'HITD181087D', 'Director': 'tbd', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '39 minutes', 'Release date': 'February 16, 2010', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolute Best EVER.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: Off the Baa!\nReview Date: 2015/03/28\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Shuan The Sheep ~ Off The Baa']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Shaun the Sheep', 'Language': 'Unqualified', 'Runtime': '51 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 0.01 Ounces', 'Item model number': 'HITD180065D', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '51 minutes', 'Release date': 'November 11, 2008', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: Absolute. BEST EVER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaun the Sheep: Spring Shena-a-anigans\nReview Date: 2015/03/28\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Spring with excitement and jump with joy because Shaun the Sheep is back for more wild adventures from the Oscar®-winning creators of Wallace & Gromit™. Fun on the farm springs to life with Shaun and his barnyard buddies – from bouncing sheep and a supersized Timmy to bagpipe buddies and a shortsighted farmer, there’s no limit to the wild things these animals will do. So hop along with Shaun, Bitzer, Shirley, Timmy, and those Naughty Pigs next door in some sheepherding mayhem that’s sure to give you a lift!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Animation, Anime & Manga', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Shaun the Sheep', 'Language': 'English', 'Publication Date': 'January 25, 2011', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': 'HITD181471D', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Release date': 'January 25, 2011', 'Actors': 'Shaun the Sheep', 'Studio': 'Universal Studios Home Entertainment'}\nReview Text: OH.My.Gosh - these are an absolute hoot. You hear about &#34;good for all ages&#34; - well these REALLY are - from toddlers (nonverbal) to the oldest of the old - really a hoot. Claymation, from the Aran sweater designs to the sheep who drop poop when scared - just a riot. Better for kids than the punch-em-shoot-em-up or dainty-girly pablum offered for kids these days. Just an absolute delight.\nReview Title: BEST EVER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Everybody Wins\nReview Date: 2015/09/12\nStore: Debra Winger  (Actor),     Nick Nolte  (Actor),     Karel Reisz  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"If there's one thing private eye Tom O'Toole (Nick Nolte, Mulholland Falls) knows, he's falling for Angela Crispini (Debra Winger, Black Widow), his seductive young client. But what he doesn't know could get him killed. Angela has hired O'Toole to prove a local teenager was wrongly convicted of murder. Following her leads, O'Toole soon suspects the town may be involved in some kind of cover-up. But what bothers him most of all is Angela herself. The more time he spends with her, the more O'Toole begins to realize she's either lying, insane or both.\"]\nAverage Rating: 3.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.54 x 0.75 x 0.07 inches; 3.2 Ounces', 'Director': 'Karel Reisz', 'Media Format': 'Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'December 13, 2005', 'Actors': 'Debra Winger, Nick Nolte, Will Patton, Judith Ivey, Kathleen Wilhoite', 'Subtitles': 'English, French', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Arthur Miller', 'Number of discs': '1'}\nReview Text: Hubby teaches American Drama - bought for him to use in class, as written by Arthur Miller.\nReview Title: Fine purchase.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rams\nReview Date: 2016/11/23\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"In a secluded valley in Iceland, Gummi and Kiddi live side by side, tending to their sheep. Their ancestral sheep-stock is considered one of the country's best and the two brothers are repeatedly awarded for their prized rams who carry an ancient lineage. Although they share the land and a way of life, Gummi and Kiddi have not spoken to each other in four decades. When a lethal disease suddenly infects Kiddi's sheep, the entire valley comes under threat. The authorities decide to cull all the animals in the area to contain the outbreak. This is a near death sentence for the farmers, whose sheep are their main source of income, and many abandon their land. But Gummi and Kiddi don't give up so easily – and each brother tries to stave off the disaster in his own fashion: Kiddi by using his rifle and Gummi by using his wits. As the authorities close in, the brothers will need to come together to save the special breed passed down for generations, and themselves, from extinction.\"]\nAverage Rating: 4.4\nProduct Details: {'Aspect Ratio': '2.35:1', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35382868', 'Director': 'Various', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Various', 'Subtitles': 'English', 'Language': 'Icelandic (Dolby Digital 5.1)', 'Studio': 'Cohen Media Group', 'Number of discs': '1'}\nReview Text: OHmygosh - just delightful. No sensationalism, not a lot of verbiage - lots of ice scenic shots and pensive opportunity. Delightful interactions, honest drama.\nReview Title: Delightful use of time\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe analysis of the purchase history reveals a strong preference for family-oriented and meaningful narratives, emphasizing emotional depth, cultural exploration, and humor. High ratings (4.5+) signify a consistent enjoyment of quality storytelling across various genres, particularly in family/kids content, martial arts (with significant thematic undercurrents of resilience and personal growth), and lighthearted animation. Recurring positive sentiments about animation suggest a leaning towards accessibility and wholesome entertainment, favoring content suitable for all ages.\n\nThe individual demonstrates a discernible disdain for sensationalism and poorly researched documentaries, as seen in the negative rating of a politically charged documentary, highlighting a preference for authentic storytelling. Furthermore, the purchase of diverse formats indicates no strong price sensitivity, suggesting a willingness to invest in media that aligns with their interests and values rather than seeking the most affordable options. Overall, this individual values quality and meaningful engagement in their entertainment choices, exhibiting a blend of cultural curiosity and a desire for uplifting narratives.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Good story.",
    "text": "We love this classic flick.<br />Memories for some!",
    "images": [],
    "asin": "B002SHT464",
    "parent_asin": "B002SHT464",
    "user_id": "AGLAXKW6OG6XNTBWBYQYMFT53BYQ",
    "timestamp": "2017-02-14 22:26:55",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.8,
    "rating_number": 71952,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/39211f1f7d1a48cf8fd9eae82a8fc25f45f19e2b03dbfc23e1c4b32da349ae80._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/39211f1f7d1a48cf8fd9eae82a8fc25f45f19e2b03dbfc23e1c4b32da349ae80._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/39211f1f7d1a48cf8fd9eae82a8fc25f45f19e2b03dbfc23e1c4b32da349ae80._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/39211f1f7d1a48cf8fd9eae82a8fc25f45f19e2b03dbfc23e1c4b32da349ae80._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/39211f1f7d1a48cf8fd9eae82a8fc25f45f19e2b03dbfc23e1c4b32da349ae80._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/39211f1f7d1a48cf8fd9eae82a8fc25f45f19e2b03dbfc23e1c4b32da349ae80._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English",
        "English [Audio Description]"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Bob Clark"
      ],
      "Producers": [
        "Rene Dupont",
        "Bob Clark"
      ],
      "Starring": [
        "Peter Billingsley",
        "Melinda Dillon",
        "Darren Mcgavin"
      ],
      "Studio": [
        "Warner Bros."
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}