{
  "user_id": "AF3GABC7Q7TJGKBDFP3XIAKQNGQA",
  "summary": "=== Purchase Information ===\nProduct Title: Moonraker [Blu-ray]\nReview Date: 2016/01/15\nStore: Roger Moore  (Actor),     Lois Chiles  (Actor),     Lewis Gilbert  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Agent 007 meets Hugo Drax, a tycoon out to nerve-gas Earth to make room for his space-bred master race. The 11th James Bond movie.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Michael Lonsdale, Corinne Clery, Lewis Gilbert, Lois Chiles, Richard Kiel, Roger Moore', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Lewis Gilbert', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'March 24, 2009', 'Actors': 'Roger Moore, Lois Chiles, Michael Lonsdale, Richard Kiel, Corinne Clery', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'MGM', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Casino Royale\nReview Date: 2016/01/15\nStore: Daniel Craig  (Actor),     Jesper Christensen  (Actor),     Martin Campbell  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'CASINO ROYALE introduces JAMES BOND before he holds his license to kill. But Bond is no less dangerous, and with two professional assassinations in quick succession, he is elevated to \"00\" status. \"M\" (Judi Dench), head of the British Secret Service, sends the newly-promoted 007 on his first mission that takes him to Madagascar, the Bahamas and eventually leads him to Montenegro to face Le Chiffre, a ruthless financier under threat from his terrorist clientele, who is attempting to restore his funds in a high-stakes poker game at the Casino Royale. \"M\" places Bond under the watchful eye of the Treasury official Vesper Lynd. At first skeptical of what value Vesper can provide, Bond\\'s interest in her deepens as they brave danger together. Le Chiffre\\'s cunning and cruelty come to bear on them both in a way Bond could never imagine, and he learns his most important lesson: Trust no one.', 'Amazon.com', 'The most successful invigoration of a cinematic franchise since', 'Batman Begins, Casino Royale', 'offers a new Bond identity. Based on the Ian Fleming novel that introduced Agent 007 into a Cold War world,', 'Casino Royale', 'is the most brutal and viscerally exciting James Bond film since Sean Connery left Her Majesty\\'s Secret Service. Meet the new Bond; not the same as the old Bond. Daniel Craig gives a galvanizing performance as the freshly minted double-0 agent. Suave, yes, but also a \"blunt instrument,\" reckless, and possessed with an ego that compromises his judgment during his first mission to root out the mastermind behind an operation that funds international terrorists. In classic Bond film tradition, his global itinerary takes him to far-flung locales, including Uganda, Madagascar, the Bahamas (that\\'s more like it), and Montenegro, where he is pitted against his nemesis in a poker game, with hundreds of millions in the pot. The stakes get even higher when Bond lets down his \"armor\" and falls in love with Vesper (Eva Green), the ravishing banker\\'s representative fronting him the money.', 'For longtime fans of the franchise,', 'Casino Royale', 'offers some retro kicks. Bond wins his iconic Astin-Martin at the gaming table, and when a bartender asks if he wants his martini \"shaken or stirred,\" he disdainfully replies, \"Do I look like I give a damn?\" There\\'s no Moneypenny or \"Q,\" but Dame Judi Dench is back as the exasperated M, who one senses, admires Bond\\'s \"bloody cheek.\" A Bond film is only as good as its villain, and Mads Mikkelsen as Le Chiffre, who weeps blood, is a sinister dandy. From its punishing violence and virtuoso action sequences to its romance,', 'Casino Royale', 'is a Bond film that, in the words of one character, makes you feel it, particularly during an excruciating torture sequence. Double-0s, Bond observes early on, \"have a short life expectancy.\" But with Craig, there is new life in the old franchise yet, as well as genuine anticipation for the next one when, at last, the signature James Bond theme kicks in following the best last line ever in any Bond film. To quote Goldie Hawn in', 'Private Benjamin', \", now I know what I've been faking all these years.\", '--Donald Liebenson', 'Stills from', 'Casino Royale', '(click for larger image)', '-- end6pak -->', 'Beyond', 'Casino Royale', 'on Amazon.com', 'On Blu-ray', 'CD Soundtrack', 'Why We Love Daniel Craig', 'The Amazon.com James Bond Store', 'Where Have I Seen Daniel Craig?', 'Bond on Set: Filming Casino Royale', 'Book']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Action/Adventure', 'Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Contributor': 'Sebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, Tobias Menzies, Daniel CraigSebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, To…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 24 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Martin Campbell', 'Media Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'March 13, 2007', 'Actors': 'Daniel Craig, Jesper Christensen, Isaach de Bankolé, Judi Dench, Jeffrey Wright', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish, Chinese, Korean, Portuguese, Thai', 'Studio': 'Columbia Pictures', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Up [Blu-ray]\nReview Date: 2016/01/15\nStore: Ed Asner  (Actor),     Christopher Plummer  (Actor),     Directed By Pete Docter  (Director),     Co-Directed By Bob Peterson  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Kids & Family\nProduct Description: ['Product Description', 'From the revolutionary minds of Pixar Animation Studios and the acclaimed director of MONSTERS, INC. comes a hilariously uplifting adventure where the sky is no longer the limit. Carl Fredricksen, a retired balloon salesman, is part rascal, part dreamer who is ready for his last chance at high-flying excitement. Tying thousands of balloons to his house, Carl sets off to the lost world of his childhood dreams. Unbeknownst to Carl, Russell, an overeager 8-year-old Wilderness Explorer who has never ventured beyond his backyard, is in the wrong place at the wrong time -- Carl\\'s front porch! The world\\'s most unlikely duo reach new heights and meet fantastic friends like Dug, a dog with a special collar that allows him to speak, and Kevin, a rare 13-foot tall flightless bird. Stuck together in the wilds of the jungle, Carl realizes that sometimes life\\'s biggest adventures aren\\'t the ones you set out looking for. Including the hilarious short film \"Dug\\'s Special Mission,\" UP reaches new heights on Blu-ray(TM) and DVD. \"You will want to see it again and again,\" raves Christopher Kelly of the Fort Worth Star-Telegram. It\\'s adventure that will send your spirits soaring!', 'Amazon.com', 'At a time when too many animated films consist of anthropomorphized animals cracking sitcom one-liners and flatulence jokes, the warmth, originality, humor, and unflagging imagination of', 'Up', \"feel as welcome as rain in a desert. Carl Fredericksen (voice by Ed Asner) ranks among the most unlikely heroes in recent animation history. A 78- year-old curmudgeon, he enjoyed his modest life as a balloon seller because he shared it with his adventurous wife Ellie (Ellie Docter). But she died, leaving him with memories and the awareness that they never made their dream journey to Paradise Falls in South America. When well-meaning officials consign Carl to Shady Oaks Retirement Home, he rigs thousands of helium balloons to his house and floats to South America. The journey's scarcely begun when he discovers a stowaway: Russell (Jordan Nagai), a chubby, maladroit Wilderness Explorer Scout who's out to earn his Elderly Assistance Badge. In the tropical jungle, Carl and Russell find more than they bargained for: Charles Muntz (Christopher Plummer), a crazed explorer whose newsreels once inspired Carl and Ellie; Kevin, an exotic bird with a weakness for chocolate; and Dug (Bob Peterson), an endearingly dim golden retriever fitted with a voice box. More importantly, the travelers discover they need each other: Russell needs a (grand)father figure; Carl needs someone to enliven his life without Ellie. Together, they learn that sharing ice-cream cones and counting the passing cars can be more meaningful than feats of daring-do and distant horizons. Pete Docter (\", 'Monsters, Inc', \". ) and Bob Peterson direct the film with consummate skill and taste, allowing the poignant moments to unfold without dialogue to Michael Giacchnio's vibrant score. Building on their work in\", 'The Incredibles', 'and', 'Ratatouille', \", the Pixar crew offers nuanced animation of the stylized characters. Even by Pixar's elevated standards,\", 'Up', 'is an exceptional film that will appeal of audiences of all ages. Rated PG for some peril and action. --', 'Charles Solomon', 'Stills from', 'Up', '(Click for larger image)', 'Set Contains:', \"The eagerly awaited Blu-ray of Pixar's hit\", 'Up', 'comes loaded with extras, including two animated shorts: Peter Sohn\\'s \"Partly Cloudy,\" which screened with the feature in its theatrical release, and a new film, \"Dug\\'s Special Mission.\" Directed by Ronnie Del Carmen, \"Special Mission\" reveals how Dug, the dim but lovable golden retriever, met Carl and Russell. \"Adventure Is Out There\" documents the research trip a key group of artists took to the Tapuis in South America and includes not only footage of the precipitous ascent of the mountain, but watercolor sketches the artists did there. Alternate versions of key moments in the film show how these scenes changed during preproduction and why. An early storyboard of the wordless \"Married Life\" sequence that reduced many viewers to tears could have worked, but it\\'s far less satisfying than the final iteration. Discussions of the characters Carl and Russell include preliminary art and footage of director Pete Docter working with child actor Jordan Nagai. In a thoughtful interview, composer Michael Giacchino explains his use of musical motifs for the individual characters, and how shifts from major to minor chords suggest different moods. The Global Guardian Badge Game narrated by Nagai is an interesting geography quiz that would be more fun if the controls were better calibrated--it\\'s hard to land a cursor on Delaware or Belgium when it keeps drifting away. The bonus materials suggest that if Pixar consistently makes the best animated films in America, it\\'s because such talented artists work so hard on them.', '--Charles Solomon', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation, Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Don Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bob Peterson, David Kaye, Mickie T. McGowan, Josh Cooley, Co-Directed By Bob Peterson, Jeremy Leary, Jess HarnellDon Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bo…   See more', 'Language': 'English (DTS 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 6.4 Ounces', 'Item model number': '786936791068', 'Director': 'Directed By Pete Docter, Co-Directed By Bob Peterson', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Ed Asner, Christopher Plummer, Jordan Nagai, Bob Peterson, Delroy Lindo', 'Subtitles': 'French, Spanish', 'Studio': 'Disney*Pixar', 'Writers': 'Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter', 'Number of discs': '4'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Qualty Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cutthroat Island [Blu-ray]\nReview Date: 2016/01/15\nStore: Geena Davis  (Actor),     Matthew Modine  (Actor),     Renny Harlin  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Geena Davis, Matthew Modine. A swashbuckling female pirate sails the seven seas in search of fortune and glory. But with only a piece of a treasure map to go on and talk of mutiny in the ranks, will her crew of scallywags make her walk the plank before she can dig up the booty? 1995/color/118 min/PG-13.', 'Amazon.com', 'Geena Davis (THELMA & LOUISE, BEETLEJUICE) and Matthew Modine (MARRIED TO THE MOB, FULL METAL JACKET) deliver a tidal wave of nonstop action and adventure in this swashbuckling saga of ruthless pirates, buried treasure and bloodthirsty betrayal.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Frank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew ModineFrank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew Modine  See more', 'Language': 'English, French', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 84min', 'Director': 'Renny Harlin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'August 11, 2009', 'Actors': 'Geena Davis, Matthew Modine, Frank Langella, Chris Masterson, Maury Chaykin', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2001: A Space Odyssey [Blu-ray]\nReview Date: 2016/01/15\nStore: Keir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Transformers: Revenge of the Fallen (Two-Disc Special Edition) [Blu-ray]\nReview Date: 2016/01/15\nStore: Shia LaBeouf  (Actor),     Megan Fox  (Actor),     Michael Bay  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', 'Blu-ray pressing. The battle for Earth continues in this action-packed blockbuster from director Michael Bay and executive producer Steven Spielberg. When college-bound Sam Witwicky (Shia LaBeouf) learns the truth about the ancient origins of the Transformers, he must accept his destiny and join Optimus Prime and Bumblebee in their epic battle against the Decepticons, who have returned stronger than ever with a plan to destroy our world.', 'Amazon.com', \"Pure. Popcorn. Entertainment. That's an exact classification of director Michael Bay's\", 'Transformers: Revenge of the Fallen', '. Think of', 'Transformers 1', \"on crack. In other words, this sequel took all of the extreme elements that made fans love the first movie and increased them exponentially. The action is nonstop, with battles and explosions from start to finish. The camera (without any subtlety) exploits Megan Fox's hotness to the max. As if she weren't enough, a new sex kitten (Isabel Lucas) is thrown into the equation. Shia LaBeouf is as charismatic as ever, and fills the starring role with ease. And then there's the humor. Sam's parents (Kevin Dunn and Julie White)provided some semi-raunchy laugh-out-loud moments in the first movie, but now they take it to the next level. Sometimes it seems like they are trying a little too hard, but it is still hilarious.\", \"As far as the “plot” goes, the writers didn't waste much time--it's really just a context for the giant-robot death matches and dramatic slow-mo sequences. The movie kicks off two years later where the Autobots have formed an alliance with the U.S. government, creating an elite team led by Major Lennox (Josh Duhamel), in an effort to snuff out any remaining Decepticons that show up. The bad guys keep coming, and it turns out that a much more menacing force than Megatron is out there--and it is looking for something on Earth that is tied to the very origin of the Transformers race. Fans of the franchise will be delighted by the addition of many new robot characters (there are well over 40 in the sequel, versus only 13 in the first). The second\", 'Transformers', \"has shaped up to be one of the worst reviewed and most successful movies of all time. This strange pairing is really just an indication that this movie has one purpose: to entertain. The creators didn't want to waste time bogging down the action and drama with substance--which was arguably a good decision.\", '--Jordan Thompson', 'Stills from', 'Transformers: Revenge of the Fallen', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Shia LaBeouf, Michael Bay, Tyrese Gibson, Megan Fox, John Turturro, Josh Duhamel', 'Language': 'English', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.54 x 5.37 x 6.91 inches; 4 Ounces', 'Item model number': 'DMWV072414BR', 'Director': 'Michael Bay', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 30 minutes', 'Release date': 'October 20, 2009', 'Actors': 'Shia LaBeouf, Megan Fox, Josh Duhamel, Tyrese Gibson, John Turturro', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter and the Half-Blood Prince [Blu-ray]\nReview Date: 2016/01/15\nStore: Daniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['Harry Potter and the Half Blood Prince (Dbl BD)', 'Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort’s defenses and, to this end, Dumbledore recruits his old friend and colleague, Professor Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Drama/Love & Romance, Mystery & Suspense', 'Format': 'Blu-ray, Special Edition, Color, Dubbed, Subtitled, Widescreen', 'Contributor': 'Rupert Grint, Bonnie Wright, Emma Watson, David Barron, Jim Broadbent, J.K. Rowling, Lionel Wigram, Oliver Phelps, Maggie Smith, David Heyman, Tim Lewis, Daniel Radcliffe, Elarica Gallacher, Bruno Delbonnel, David Yates, Robbie Coltrane, Alan Rickman, Michael Gambon, Steve Kloves, James PhelpsRupert Grint, Bonnie Wright, Emma Watson, David Barron, Jim Broadbent, J.K. Rowling, Lionel Wigram, Oliver Phelps, Maggie Smith, David Heyman, Tim Lewis, Daniel Radcliffe, Elarica Gallacher, Bruno Delbonnel, David Yates, Robbie Coltrane, Alan Rickman, Michael Gambon,…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '1000027459', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Special Edition, Color, Dubbed, Subtitled, Widescreen', 'Run time': '2 hours and 15 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Jim Broadbent, Elarica Gallacher', 'Subtitles': 'English, French, Spanish', 'Producers': 'David Barron, David Heyman, Lionel Wigram, Tim Lewis', 'Studio': 'WarnerBrothers', 'Writers': 'J.K. Rowling, Steve Kloves', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night at the Museum: Battle of the Smithsonian\nReview Date: 2016/01/15\nStore: Ben Stiller  (Actor),     Amy Adams  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Kids & Family\nProduct Description: ['Product Description', \"Night has fallen upon the Smithsonian Institution in Washington, DC. The guides have gone home, the lights are out, the school kids are tucked in their beds... yet something incredible is stirring as former night guard Larry Daley (Ben Stiller) finds himself lured into his biggest, most imagination-boggling adventure yet in which history truly comes alive. In this second installment of the Night at the Museum saga, Larry faces a battle so epic it could only unfold in the corridors of the world's largest museum. Now, Larry must try to save his formerly inanimate friends from what could be their last stand amid the wonders of the Smithsonian, all of which, from the famous paintings on the walls to the rocket ships in the halls, suddenly have a mind of their own.\", 'Amazon.com', 'Ben Stiller wrestles with extinct beasts, historical figures, and meddling monkeys in', 'Night at the Museum: Battle of the Smithsonian', \", the sequel to the popular 2006 special-effects extravaganza. This time, the ancient Egyptian tablet (the one that brings all the exhibits at New York's Museum of Natural History to life at night) is being shipped off to the Smithsonian in Washington, D.C.--which, as the movie diligently tells us, is the largest museum in the world. Naturally, former museum guard Larry Daley (Ben Stiller) heads down to rescue it (and, by extension, keep his magical museum friends alive). He ends up fighting with a nasty pharaoh who talks like Boris Karloff (Hank Azaria,\", 'The Simpsons', ') and falling in love with Amelia Earhart (Amy Adams,', 'Enchanted', \"). All the old gang are along for the ride, including Dexter the monkey; much face-slapping and special effects ensue. There aren't many surprises, but\", 'Battle of the Smithsonian', 'is cheerful enough to entertain everyone who enjoyed the first movie. Extras include commentaries by the director and the writers, the usual self-congratulatory making-of featurette, deleted scenes that are actually as good as the rest of the movie, an alternate ending, and an entirely pointless second disc about Crystal, the capuchin monkey who plays Dexter (the monkey disc has less than a half-hour of material, including two mediocre games). The great supporting cast from the first movie returns, including Owen Wilson, Steve Coogan, and Robin Williams.', '--Bret Fetzer', 'Stills from', 'Night at the Museum: Battle of the Smithsonian', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': 'FOXS2289274BR', 'Director': 'Shawn Levy', 'Media Format': 'Blu-ray, Digital_copy', 'Run time': '1 hour and 45 minutes', 'Release date': 'December 1, 2009', 'Actors': 'Ben Stiller, Amy Adams, Owen Wilson, Hank Azaria, Christopher Guest', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '3'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Angels & Demons [Blu-ray]\nReview Date: 2016/01/15\nStore: Tom Hanks  (Actor),     Ewan McGregor  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', \"In Ron Howard's thrilling follow-up to The Da Vinci Code, expert symbologist Robert Langdon (Tom Hanks) pursues ancient clues on a heart-racing hunt through Rome to find the four Cardinals kidnapped by a deadly secret society, the Illuminati. With the Cardinals' lives on the line, and the Camerlengo (Ewan McGregor) desperate for help, Langdon embarks on a nonstop, action-packed race through sealed crypts, dangerous catacombs, and the most secret vault on Earth!\", 'Amazon.com', \"If the devil is in the details, there's a lot of wicked fun in\", 'Angels & Demons', ', the sequel (originally a prequel) to', 'The Da Vinci Code', \". Director Ron Howard delivers edge-of-your-pew thrills all over the Vatican, the City of Rome, and the deepest, dankest catacombs. Tom Hanks is dependably watchable in his reprised role as Professor Robert Langdon, summoned urgently to Rome on a matter of utmost urgency--which happens to coincide with the death of the Pope, meaning the Vatican is teeming with cardinals and Rome is teeming with the faithful. A religious offshoot group, calling themselves the Illuminati, which protested the Catholic Church's prosecution of scientists 400 years ago, has resurfaced and is making extreme, and gruesome, terrorist demands. The film zooms around the city, as Langdon follows clues embedded in art, architecture, and the very bone structure of the Vatican. The cast is terrific, including Ewan McGregor, who is memorable as a young protégé of the late pontiff, and who seems to challenge the common wisdom of the Conclave just by being 40 years younger than his fellows when he lectures for church reform. Stellan Skarsgard is excellent as a gruff commander of the Swiss Guard, who may or may not have thrown in with the Illuminati. But the real star of the film is Rome, and its High Church gorgeousness, with lush cinematography by Salvatore Totino, who renders the real sky above the Vatican, in a cataclysmic event, with the detail and majesty of the ceiling of the Sistine Chapel. --\", 'A.T. Hurley', 'Stills from', 'Angels & Demons', '(click for larger image)']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Blu-ray, Dolby, NTSC, Dubbed, Widescreen, Subtitled', 'Contributor': 'John Calley, Columbia Pictures, David Pasquesi, Ayelet Zurer, Ewan McGregor, Thure Lindhardt, Pierfrancesco Favino, Tom Hanks, Ron Howard, Stellan Skarsgård, Armin Mueller-Stahl, Nikolaj Kaas, Brian GrazerJohn Calley, Columbia Pictures, David Pasquesi, Ayelet Zurer, Ewan McGregor, Thure Lindhardt, Pierfrancesco Favino, Tom Hanks, Ron Howard, Stellan Skarsgård, Armin Mueller-Stahl, Nikolaj Kaas, Brian Grazer   See more', 'Language': 'English, French', 'Runtime': '4 hours and 44 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.55 inches; 4 Ounces', 'Item model number': 'COLBR29217', 'Director': 'Ron Howard', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Dubbed, Widescreen, Subtitled', 'Run time': '4 hours and 44 minutes', 'Release date': 'November 24, 2009', 'Actors': 'Tom Hanks, Ewan McGregor, Ayelet Zurer, Stellan Skarsgård, Pierfrancesco Favino', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'John Calley, Ron Howard, Brian Grazer', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Quantum of Solace [Blu-ray]\nReview Date: 2016/01/15\nStore: Daniel Craig  (Actor),     Olga Kurylenko  (Actor),     Marc Forster  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Daniel Craig returns as James Bond in this thrilling, action-packed adventure that picks up where Casino Royale left off. Betrayed by the woman he loved, 007 fights the urge to make his latest mission personal. On a nonstop quest for justice that crisscrosses the globe, Bond meets the beautiful but feisty Camille (Olga Kurylenko), who leads him to Dominic Greene (Mathieu Amalric), a ruthless businessman and major force within the mysterious Quantum organization. When Bond uncovers a conspiracy to take control of one of the world’s most important natural resources, he must navigate a minefield of treachery, deception and murder to neutralize Greene before it’s too late!']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5 x 5.5 x 0.25 inches; 1.6 Ounces', 'Director': 'Marc Forster', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Dubbed, Blu-ray, Subtitled, Widescreen, AC-3, DTS Surround Sound', 'Run time': '1 hour and 47 minutes', 'Release date': 'March 24, 2009', 'Actors': 'Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini', 'Dubbed': 'Spanish, French, Portuguese', 'Subtitles': 'French, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------",
  "reference": "Moonraker [Blu-ray]\nRoger Moore  (Actor),     Lois Chiles  (Actor),     Lewis Gilbert  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Agent 007 meets Hugo Drax, a tycoon out to nerve-gas Earth to make room for his space-bred master race. The 11th James Bond movie.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Michael Lonsdale, Corinne Clery, Lewis Gilbert, Lois Chiles, Richard Kiel, Roger Moore', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Lewis Gilbert', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'March 24, 2009', 'Actors': 'Roger Moore, Lois Chiles, Michael Lonsdale, Richard Kiel, Corinne Clery', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'MGM', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality product\nCasino Royale\nDaniel Craig  (Actor),     Jesper Christensen  (Actor),     Martin Campbell  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'CASINO ROYALE introduces JAMES BOND before he holds his license to kill. But Bond is no less dangerous, and with two professional assassinations in quick succession, he is elevated to \"00\" status. \"M\" (Judi Dench), head of the British Secret Service, sends the newly-promoted 007 on his first mission that takes him to Madagascar, the Bahamas and eventually leads him to Montenegro to face Le Chiffre, a ruthless financier under threat from his terrorist clientele, who is attempting to restore his funds in a high-stakes poker game at the Casino Royale. \"M\" places Bond under the watchful eye of the Treasury official Vesper Lynd. At first skeptical of what value Vesper can provide, Bond\\'s interest in her deepens as they brave danger together. Le Chiffre\\'s cunning and cruelty come to bear on them both in a way Bond could never imagine, and he learns his most important lesson: Trust no one.', 'Amazon.com', 'The most successful invigoration of a cinematic franchise since', 'Batman Begins, Casino Royale', 'offers a new Bond identity. Based on the Ian Fleming novel that introduced Agent 007 into a Cold War world,', 'Casino Royale', 'is the most brutal and viscerally exciting James Bond film since Sean Connery left Her Majesty\\'s Secret Service. Meet the new Bond; not the same as the old Bond. Daniel Craig gives a galvanizing performance as the freshly minted double-0 agent. Suave, yes, but also a \"blunt instrument,\" reckless, and possessed with an ego that compromises his judgment during his first mission to root out the mastermind behind an operation that funds international terrorists. In classic Bond film tradition, his global itinerary takes him to far-flung locales, including Uganda, Madagascar, the Bahamas (that\\'s more like it), and Montenegro, where he is pitted against his nemesis in a poker game, with hundreds of millions in the pot. The stakes get even higher when Bond lets down his \"armor\" and falls in love with Vesper (Eva Green), the ravishing banker\\'s representative fronting him the money.', 'For longtime fans of the franchise,', 'Casino Royale', 'offers some retro kicks. Bond wins his iconic Astin-Martin at the gaming table, and when a bartender asks if he wants his martini \"shaken or stirred,\" he disdainfully replies, \"Do I look like I give a damn?\" There\\'s no Moneypenny or \"Q,\" but Dame Judi Dench is back as the exasperated M, who one senses, admires Bond\\'s \"bloody cheek.\" A Bond film is only as good as its villain, and Mads Mikkelsen as Le Chiffre, who weeps blood, is a sinister dandy. From its punishing violence and virtuoso action sequences to its romance,', 'Casino Royale', 'is a Bond film that, in the words of one character, makes you feel it, particularly during an excruciating torture sequence. Double-0s, Bond observes early on, \"have a short life expectancy.\" But with Craig, there is new life in the old franchise yet, as well as genuine anticipation for the next one when, at last, the signature James Bond theme kicks in following the best last line ever in any Bond film. To quote Goldie Hawn in', 'Private Benjamin', \", now I know what I've been faking all these years.\", '--Donald Liebenson', 'Stills from', 'Casino Royale', '(click for larger image)', '-- end6pak -->', 'Beyond', 'Casino Royale', 'on Amazon.com', 'On Blu-ray', 'CD Soundtrack', 'Why We Love Daniel Craig', 'The Amazon.com James Bond Store', 'Where Have I Seen Daniel Craig?', 'Bond on Set: Filming Casino Royale', 'Book']\n{'Genre': 'Drama, Action/Adventure', 'Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Contributor': 'Sebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, Tobias Menzies, Daniel CraigSebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, To…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 24 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Martin Campbell', 'Media Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'March 13, 2007', 'Actors': 'Daniel Craig, Jesper Christensen, Isaach de Bankolé, Judi Dench, Jeffrey Wright', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish, Chinese, Korean, Portuguese, Thai', 'Studio': 'Columbia Pictures', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality product\nUp [Blu-ray]\nEd Asner  (Actor),     Christopher Plummer  (Actor),     Directed By Pete Docter  (Director),     Co-Directed By Bob Peterson  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Kids & Family\n['Product Description', 'From the revolutionary minds of Pixar Animation Studios and the acclaimed director of MONSTERS, INC. comes a hilariously uplifting adventure where the sky is no longer the limit. Carl Fredricksen, a retired balloon salesman, is part rascal, part dreamer who is ready for his last chance at high-flying excitement. Tying thousands of balloons to his house, Carl sets off to the lost world of his childhood dreams. Unbeknownst to Carl, Russell, an overeager 8-year-old Wilderness Explorer who has never ventured beyond his backyard, is in the wrong place at the wrong time -- Carl\\'s front porch! The world\\'s most unlikely duo reach new heights and meet fantastic friends like Dug, a dog with a special collar that allows him to speak, and Kevin, a rare 13-foot tall flightless bird. Stuck together in the wilds of the jungle, Carl realizes that sometimes life\\'s biggest adventures aren\\'t the ones you set out looking for. Including the hilarious short film \"Dug\\'s Special Mission,\" UP reaches new heights on Blu-ray(TM) and DVD. \"You will want to see it again and again,\" raves Christopher Kelly of the Fort Worth Star-Telegram. It\\'s adventure that will send your spirits soaring!', 'Amazon.com', 'At a time when too many animated films consist of anthropomorphized animals cracking sitcom one-liners and flatulence jokes, the warmth, originality, humor, and unflagging imagination of', 'Up', \"feel as welcome as rain in a desert. Carl Fredericksen (voice by Ed Asner) ranks among the most unlikely heroes in recent animation history. A 78- year-old curmudgeon, he enjoyed his modest life as a balloon seller because he shared it with his adventurous wife Ellie (Ellie Docter). But she died, leaving him with memories and the awareness that they never made their dream journey to Paradise Falls in South America. When well-meaning officials consign Carl to Shady Oaks Retirement Home, he rigs thousands of helium balloons to his house and floats to South America. The journey's scarcely begun when he discovers a stowaway: Russell (Jordan Nagai), a chubby, maladroit Wilderness Explorer Scout who's out to earn his Elderly Assistance Badge. In the tropical jungle, Carl and Russell find more than they bargained for: Charles Muntz (Christopher Plummer), a crazed explorer whose newsreels once inspired Carl and Ellie; Kevin, an exotic bird with a weakness for chocolate; and Dug (Bob Peterson), an endearingly dim golden retriever fitted with a voice box. More importantly, the travelers discover they need each other: Russell needs a (grand)father figure; Carl needs someone to enliven his life without Ellie. Together, they learn that sharing ice-cream cones and counting the passing cars can be more meaningful than feats of daring-do and distant horizons. Pete Docter (\", 'Monsters, Inc', \". ) and Bob Peterson direct the film with consummate skill and taste, allowing the poignant moments to unfold without dialogue to Michael Giacchnio's vibrant score. Building on their work in\", 'The Incredibles', 'and', 'Ratatouille', \", the Pixar crew offers nuanced animation of the stylized characters. Even by Pixar's elevated standards,\", 'Up', 'is an exceptional film that will appeal of audiences of all ages. Rated PG for some peril and action. --', 'Charles Solomon', 'Stills from', 'Up', '(Click for larger image)', 'Set Contains:', \"The eagerly awaited Blu-ray of Pixar's hit\", 'Up', 'comes loaded with extras, including two animated shorts: Peter Sohn\\'s \"Partly Cloudy,\" which screened with the feature in its theatrical release, and a new film, \"Dug\\'s Special Mission.\" Directed by Ronnie Del Carmen, \"Special Mission\" reveals how Dug, the dim but lovable golden retriever, met Carl and Russell. \"Adventure Is Out There\" documents the research trip a key group of artists took to the Tapuis in South America and includes not only footage of the precipitous ascent of the mountain, but watercolor sketches the artists did there. Alternate versions of key moments in the film show how these scenes changed during preproduction and why. An early storyboard of the wordless \"Married Life\" sequence that reduced many viewers to tears could have worked, but it\\'s far less satisfying than the final iteration. Discussions of the characters Carl and Russell include preliminary art and footage of director Pete Docter working with child actor Jordan Nagai. In a thoughtful interview, composer Michael Giacchino explains his use of musical motifs for the individual characters, and how shifts from major to minor chords suggest different moods. The Global Guardian Badge Game narrated by Nagai is an interesting geography quiz that would be more fun if the controls were better calibrated--it\\'s hard to land a cursor on Delaware or Belgium when it keeps drifting away. The bonus materials suggest that if Pixar consistently makes the best animated films in America, it\\'s because such talented artists work so hard on them.', '--Charles Solomon', 'See more']\n{'Genre': 'Kids & Family, Animation, Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Don Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bob Peterson, David Kaye, Mickie T. McGowan, Josh Cooley, Co-Directed By Bob Peterson, Jeremy Leary, Jess HarnellDon Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bo…   See more', 'Language': 'English (DTS 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 6.4 Ounces', 'Item model number': '786936791068', 'Director': 'Directed By Pete Docter, Co-Directed By Bob Peterson', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Ed Asner, Christopher Plummer, Jordan Nagai, Bob Peterson, Delroy Lindo', 'Subtitles': 'French, Spanish', 'Studio': 'Disney*Pixar', 'Writers': 'Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter', 'Number of discs': '4'}\nEither you like the movie or you don't!!!\nQualty Product\nCutthroat Island [Blu-ray]\nGeena Davis  (Actor),     Matthew Modine  (Actor),     Renny Harlin  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Geena Davis, Matthew Modine. A swashbuckling female pirate sails the seven seas in search of fortune and glory. But with only a piece of a treasure map to go on and talk of mutiny in the ranks, will her crew of scallywags make her walk the plank before she can dig up the booty? 1995/color/118 min/PG-13.', 'Amazon.com', 'Geena Davis (THELMA & LOUISE, BEETLEJUICE) and Matthew Modine (MARRIED TO THE MOB, FULL METAL JACKET) deliver a tidal wave of nonstop action and adventure in this swashbuckling saga of ruthless pirates, buried treasure and bloodthirsty betrayal.']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Frank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew ModineFrank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew Modine  See more', 'Language': 'English, French', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 84min', 'Director': 'Renny Harlin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'August 11, 2009', 'Actors': 'Geena Davis, Matthew Modine, Frank Langella, Chris Masterson, Maury Chaykin', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality Product\n2001: A Space Odyssey [Blu-ray]\nKeir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality Product\nTransformers: Revenge of the Fallen (Two-Disc Special Edition) [Blu-ray]\nShia LaBeouf  (Actor),     Megan Fox  (Actor),     Michael Bay  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', 'Blu-ray pressing. The battle for Earth continues in this action-packed blockbuster from director Michael Bay and executive producer Steven Spielberg. When college-bound Sam Witwicky (Shia LaBeouf) learns the truth about the ancient origins of the Transformers, he must accept his destiny and join Optimus Prime and Bumblebee in their epic battle against the Decepticons, who have returned stronger than ever with a plan to destroy our world.', 'Amazon.com', \"Pure. Popcorn. Entertainment. That's an exact classification of director Michael Bay's\", 'Transformers: Revenge of the Fallen', '. Think of', 'Transformers 1', \"on crack. In other words, this sequel took all of the extreme elements that made fans love the first movie and increased them exponentially. The action is nonstop, with battles and explosions from start to finish. The camera (without any subtlety) exploits Megan Fox's hotness to the max. As if she weren't enough, a new sex kitten (Isabel Lucas) is thrown into the equation. Shia LaBeouf is as charismatic as ever, and fills the starring role with ease. And then there's the humor. Sam's parents (Kevin Dunn and Julie White)provided some semi-raunchy laugh-out-loud moments in the first movie, but now they take it to the next level. Sometimes it seems like they are trying a little too hard, but it is still hilarious.\", \"As far as the “plot” goes, the writers didn't waste much time--it's really just a context for the giant-robot death matches and dramatic slow-mo sequences. The movie kicks off two years later where the Autobots have formed an alliance with the U.S. government, creating an elite team led by Major Lennox (Josh Duhamel), in an effort to snuff out any remaining Decepticons that show up. The bad guys keep coming, and it turns out that a much more menacing force than Megatron is out there--and it is looking for something on Earth that is tied to the very origin of the Transformers race. Fans of the franchise will be delighted by the addition of many new robot characters (there are well over 40 in the sequel, versus only 13 in the first). The second\", 'Transformers', \"has shaped up to be one of the worst reviewed and most successful movies of all time. This strange pairing is really just an indication that this movie has one purpose: to entertain. The creators didn't want to waste time bogging down the action and drama with substance--which was arguably a good decision.\", '--Jordan Thompson', 'Stills from', 'Transformers: Revenge of the Fallen', '(Click for larger image)']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Shia LaBeouf, Michael Bay, Tyrese Gibson, Megan Fox, John Turturro, Josh Duhamel', 'Language': 'English', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.54 x 5.37 x 6.91 inches; 4 Ounces', 'Item model number': 'DMWV072414BR', 'Director': 'Michael Bay', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 30 minutes', 'Release date': 'October 20, 2009', 'Actors': 'Shia LaBeouf, Megan Fox, Josh Duhamel, Tyrese Gibson, John Turturro', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '2'}\nEither you like the movie or you don't!!!\nQuality Product\nHarry Potter and the Half-Blood Prince [Blu-ray]\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Harry Potter and the Half Blood Prince (Dbl BD)', 'Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort’s defenses and, to this end, Dumbledore recruits his old friend and colleague, Professor Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same.', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Drama, Drama/Love & Romance, Mystery & Suspense', 'Format': 'Blu-ray, Special Edition, Color, Dubbed, Subtitled, Widescreen', 'Contributor': 'Rupert Grint, Bonnie Wright, Emma Watson, David Barron, Jim Broadbent, J.K. Rowling, Lionel Wigram, Oliver Phelps, Maggie Smith, David Heyman, Tim Lewis, Daniel Radcliffe, Elarica Gallacher, Bruno Delbonnel, David Yates, Robbie Coltrane, Alan Rickman, Michael Gambon, Steve Kloves, James PhelpsRupert Grint, Bonnie Wright, Emma Watson, David Barron, Jim Broadbent, J.K. Rowling, Lionel Wigram, Oliver Phelps, Maggie Smith, David Heyman, Tim Lewis, Daniel Radcliffe, Elarica Gallacher, Bruno Delbonnel, David Yates, Robbie Coltrane, Alan Rickman, Michael Gambon,…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '1000027459', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Special Edition, Color, Dubbed, Subtitled, Widescreen', 'Run time': '2 hours and 15 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Jim Broadbent, Elarica Gallacher', 'Subtitles': 'English, French, Spanish', 'Producers': 'David Barron, David Heyman, Lionel Wigram, Tim Lewis', 'Studio': 'WarnerBrothers', 'Writers': 'J.K. Rowling, Steve Kloves', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality product\nNight at the Museum: Battle of the Smithsonian\nBen Stiller  (Actor),     Amy Adams  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Today's Deals, Spotlight Deals, Kids & Family\n['Product Description', \"Night has fallen upon the Smithsonian Institution in Washington, DC. The guides have gone home, the lights are out, the school kids are tucked in their beds... yet something incredible is stirring as former night guard Larry Daley (Ben Stiller) finds himself lured into his biggest, most imagination-boggling adventure yet in which history truly comes alive. In this second installment of the Night at the Museum saga, Larry faces a battle so epic it could only unfold in the corridors of the world's largest museum. Now, Larry must try to save his formerly inanimate friends from what could be their last stand amid the wonders of the Smithsonian, all of which, from the famous paintings on the walls to the rocket ships in the halls, suddenly have a mind of their own.\", 'Amazon.com', 'Ben Stiller wrestles with extinct beasts, historical figures, and meddling monkeys in', 'Night at the Museum: Battle of the Smithsonian', \", the sequel to the popular 2006 special-effects extravaganza. This time, the ancient Egyptian tablet (the one that brings all the exhibits at New York's Museum of Natural History to life at night) is being shipped off to the Smithsonian in Washington, D.C.--which, as the movie diligently tells us, is the largest museum in the world. Naturally, former museum guard Larry Daley (Ben Stiller) heads down to rescue it (and, by extension, keep his magical museum friends alive). He ends up fighting with a nasty pharaoh who talks like Boris Karloff (Hank Azaria,\", 'The Simpsons', ') and falling in love with Amelia Earhart (Amy Adams,', 'Enchanted', \"). All the old gang are along for the ride, including Dexter the monkey; much face-slapping and special effects ensue. There aren't many surprises, but\", 'Battle of the Smithsonian', 'is cheerful enough to entertain everyone who enjoyed the first movie. Extras include commentaries by the director and the writers, the usual self-congratulatory making-of featurette, deleted scenes that are actually as good as the rest of the movie, an alternate ending, and an entirely pointless second disc about Crystal, the capuchin monkey who plays Dexter (the monkey disc has less than a half-hour of material, including two mediocre games). The great supporting cast from the first movie returns, including Owen Wilson, Steve Coogan, and Robin Williams.', '--Bret Fetzer', 'Stills from', 'Night at the Museum: Battle of the Smithsonian', '(Click for larger image)']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': 'FOXS2289274BR', 'Director': 'Shawn Levy', 'Media Format': 'Blu-ray, Digital_copy', 'Run time': '1 hour and 45 minutes', 'Release date': 'December 1, 2009', 'Actors': 'Ben Stiller, Amy Adams, Owen Wilson, Hank Azaria, Christopher Guest', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '3'}\nEither you like the movie or you don't!!!\nQuality product\nAngels & Demons [Blu-ray]\nTom Hanks  (Actor),     Ewan McGregor  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', \"In Ron Howard's thrilling follow-up to The Da Vinci Code, expert symbologist Robert Langdon (Tom Hanks) pursues ancient clues on a heart-racing hunt through Rome to find the four Cardinals kidnapped by a deadly secret society, the Illuminati. With the Cardinals' lives on the line, and the Camerlengo (Ewan McGregor) desperate for help, Langdon embarks on a nonstop, action-packed race through sealed crypts, dangerous catacombs, and the most secret vault on Earth!\", 'Amazon.com', \"If the devil is in the details, there's a lot of wicked fun in\", 'Angels & Demons', ', the sequel (originally a prequel) to', 'The Da Vinci Code', \". Director Ron Howard delivers edge-of-your-pew thrills all over the Vatican, the City of Rome, and the deepest, dankest catacombs. Tom Hanks is dependably watchable in his reprised role as Professor Robert Langdon, summoned urgently to Rome on a matter of utmost urgency--which happens to coincide with the death of the Pope, meaning the Vatican is teeming with cardinals and Rome is teeming with the faithful. A religious offshoot group, calling themselves the Illuminati, which protested the Catholic Church's prosecution of scientists 400 years ago, has resurfaced and is making extreme, and gruesome, terrorist demands. The film zooms around the city, as Langdon follows clues embedded in art, architecture, and the very bone structure of the Vatican. The cast is terrific, including Ewan McGregor, who is memorable as a young protégé of the late pontiff, and who seems to challenge the common wisdom of the Conclave just by being 40 years younger than his fellows when he lectures for church reform. Stellan Skarsgard is excellent as a gruff commander of the Swiss Guard, who may or may not have thrown in with the Illuminati. But the real star of the film is Rome, and its High Church gorgeousness, with lush cinematography by Salvatore Totino, who renders the real sky above the Vatican, in a cataclysmic event, with the detail and majesty of the ceiling of the Sistine Chapel. --\", 'A.T. Hurley', 'Stills from', 'Angels & Demons', '(click for larger image)']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Blu-ray, Dolby, NTSC, Dubbed, Widescreen, Subtitled', 'Contributor': 'John Calley, Columbia Pictures, David Pasquesi, Ayelet Zurer, Ewan McGregor, Thure Lindhardt, Pierfrancesco Favino, Tom Hanks, Ron Howard, Stellan Skarsgård, Armin Mueller-Stahl, Nikolaj Kaas, Brian GrazerJohn Calley, Columbia Pictures, David Pasquesi, Ayelet Zurer, Ewan McGregor, Thure Lindhardt, Pierfrancesco Favino, Tom Hanks, Ron Howard, Stellan Skarsgård, Armin Mueller-Stahl, Nikolaj Kaas, Brian Grazer   See more', 'Language': 'English, French', 'Runtime': '4 hours and 44 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.55 inches; 4 Ounces', 'Item model number': 'COLBR29217', 'Director': 'Ron Howard', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Dubbed, Widescreen, Subtitled', 'Run time': '4 hours and 44 minutes', 'Release date': 'November 24, 2009', 'Actors': 'Tom Hanks, Ewan McGregor, Ayelet Zurer, Stellan Skarsgård, Pierfrancesco Favino', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'John Calley, Ron Howard, Brian Grazer', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nEither you like the movie or you don't!!!\nQuality product\nQuantum of Solace [Blu-ray]\nDaniel Craig  (Actor),     Olga Kurylenko  (Actor),     Marc Forster  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Daniel Craig returns as James Bond in this thrilling, action-packed adventure that picks up where Casino Royale left off. Betrayed by the woman he loved, 007 fights the urge to make his latest mission personal. On a nonstop quest for justice that crisscrosses the globe, Bond meets the beautiful but feisty Camille (Olga Kurylenko), who leads him to Dominic Greene (Mathieu Amalric), a ruthless businessman and major force within the mysterious Quantum organization. When Bond uncovers a conspiracy to take control of one of the world’s most important natural resources, he must navigate a minefield of treachery, deception and murder to neutralize Greene before it’s too late!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5 x 5.5 x 0.25 inches; 1.6 Ounces', 'Director': 'Marc Forster', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Dubbed, Blu-ray, Subtitled, Widescreen, AC-3, DTS Surround Sound', 'Run time': '1 hour and 47 minutes', 'Release date': 'March 24, 2009', 'Actors': 'Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini', 'Dubbed': 'Spanish, French, Portuguese', 'Subtitles': 'French, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nEither you like the movie or you don't!!!\nQuality product",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Moonraker [Blu-ray]\nReview Date: 2016/01/15\nStore: Roger Moore  (Actor),     Lois Chiles  (Actor),     Lewis Gilbert  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Agent 007 meets Hugo Drax, a tycoon out to nerve-gas Earth to make room for his space-bred master race. The 11th James Bond movie.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Michael Lonsdale, Corinne Clery, Lewis Gilbert, Lois Chiles, Richard Kiel, Roger Moore', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Director': 'Lewis Gilbert', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'March 24, 2009', 'Actors': 'Roger Moore, Lois Chiles, Michael Lonsdale, Richard Kiel, Corinne Clery', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'MGM', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Casino Royale\nReview Date: 2016/01/15\nStore: Daniel Craig  (Actor),     Jesper Christensen  (Actor),     Martin Campbell  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'CASINO ROYALE introduces JAMES BOND before he holds his license to kill. But Bond is no less dangerous, and with two professional assassinations in quick succession, he is elevated to \"00\" status. \"M\" (Judi Dench), head of the British Secret Service, sends the newly-promoted 007 on his first mission that takes him to Madagascar, the Bahamas and eventually leads him to Montenegro to face Le Chiffre, a ruthless financier under threat from his terrorist clientele, who is attempting to restore his funds in a high-stakes poker game at the Casino Royale. \"M\" places Bond under the watchful eye of the Treasury official Vesper Lynd. At first skeptical of what value Vesper can provide, Bond\\'s interest in her deepens as they brave danger together. Le Chiffre\\'s cunning and cruelty come to bear on them both in a way Bond could never imagine, and he learns his most important lesson: Trust no one.', 'Amazon.com', 'The most successful invigoration of a cinematic franchise since', 'Batman Begins, Casino Royale', 'offers a new Bond identity. Based on the Ian Fleming novel that introduced Agent 007 into a Cold War world,', 'Casino Royale', 'is the most brutal and viscerally exciting James Bond film since Sean Connery left Her Majesty\\'s Secret Service. Meet the new Bond; not the same as the old Bond. Daniel Craig gives a galvanizing performance as the freshly minted double-0 agent. Suave, yes, but also a \"blunt instrument,\" reckless, and possessed with an ego that compromises his judgment during his first mission to root out the mastermind behind an operation that funds international terrorists. In classic Bond film tradition, his global itinerary takes him to far-flung locales, including Uganda, Madagascar, the Bahamas (that\\'s more like it), and Montenegro, where he is pitted against his nemesis in a poker game, with hundreds of millions in the pot. The stakes get even higher when Bond lets down his \"armor\" and falls in love with Vesper (Eva Green), the ravishing banker\\'s representative fronting him the money.', 'For longtime fans of the franchise,', 'Casino Royale', 'offers some retro kicks. Bond wins his iconic Astin-Martin at the gaming table, and when a bartender asks if he wants his martini \"shaken or stirred,\" he disdainfully replies, \"Do I look like I give a damn?\" There\\'s no Moneypenny or \"Q,\" but Dame Judi Dench is back as the exasperated M, who one senses, admires Bond\\'s \"bloody cheek.\" A Bond film is only as good as its villain, and Mads Mikkelsen as Le Chiffre, who weeps blood, is a sinister dandy. From its punishing violence and virtuoso action sequences to its romance,', 'Casino Royale', 'is a Bond film that, in the words of one character, makes you feel it, particularly during an excruciating torture sequence. Double-0s, Bond observes early on, \"have a short life expectancy.\" But with Craig, there is new life in the old franchise yet, as well as genuine anticipation for the next one when, at last, the signature James Bond theme kicks in following the best last line ever in any Bond film. To quote Goldie Hawn in', 'Private Benjamin', \", now I know what I've been faking all these years.\", '--Donald Liebenson', 'Stills from', 'Casino Royale', '(click for larger image)', '-- end6pak -->', 'Beyond', 'Casino Royale', 'on Amazon.com', 'On Blu-ray', 'CD Soundtrack', 'Why We Love Daniel Craig', 'The Amazon.com James Bond Store', 'Where Have I Seen Daniel Craig?', 'Bond on Set: Filming Casino Royale', 'Book']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Action/Adventure', 'Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Contributor': 'Sebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, Tobias Menzies, Daniel CraigSebastien Foucan, Eva Green, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Caterina Murino, Isaach de Bankolé, Judi Dench, Jesper Christensen, Mads Mikkelsen, David Arnold, Jeffrey Wright, Phil Meheux, Stuart Baird, Claudio Santamaria, To…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 24 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Martin Campbell', 'Media Format': 'Color, Dolby, Anamorphic, Subtitled, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'March 13, 2007', 'Actors': 'Daniel Craig, Jesper Christensen, Isaach de Bankolé, Judi Dench, Jeffrey Wright', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish, Chinese, Korean, Portuguese, Thai', 'Studio': 'Columbia Pictures', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Up [Blu-ray]\nReview Date: 2016/01/15\nStore: Ed Asner  (Actor),     Christopher Plummer  (Actor),     Directed By Pete Docter  (Director),     Co-Directed By Bob Peterson  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Kids & Family\nProduct Description: ['Product Description', 'From the revolutionary minds of Pixar Animation Studios and the acclaimed director of MONSTERS, INC. comes a hilariously uplifting adventure where the sky is no longer the limit. Carl Fredricksen, a retired balloon salesman, is part rascal, part dreamer who is ready for his last chance at high-flying excitement. Tying thousands of balloons to his house, Carl sets off to the lost world of his childhood dreams. Unbeknownst to Carl, Russell, an overeager 8-year-old Wilderness Explorer who has never ventured beyond his backyard, is in the wrong place at the wrong time -- Carl\\'s front porch! The world\\'s most unlikely duo reach new heights and meet fantastic friends like Dug, a dog with a special collar that allows him to speak, and Kevin, a rare 13-foot tall flightless bird. Stuck together in the wilds of the jungle, Carl realizes that sometimes life\\'s biggest adventures aren\\'t the ones you set out looking for. Including the hilarious short film \"Dug\\'s Special Mission,\" UP reaches new heights on Blu-ray(TM) and DVD. \"You will want to see it again and again,\" raves Christopher Kelly of the Fort Worth Star-Telegram. It\\'s adventure that will send your spirits soaring!', 'Amazon.com', 'At a time when too many animated films consist of anthropomorphized animals cracking sitcom one-liners and flatulence jokes, the warmth, originality, humor, and unflagging imagination of', 'Up', \"feel as welcome as rain in a desert. Carl Fredericksen (voice by Ed Asner) ranks among the most unlikely heroes in recent animation history. A 78- year-old curmudgeon, he enjoyed his modest life as a balloon seller because he shared it with his adventurous wife Ellie (Ellie Docter). But she died, leaving him with memories and the awareness that they never made their dream journey to Paradise Falls in South America. When well-meaning officials consign Carl to Shady Oaks Retirement Home, he rigs thousands of helium balloons to his house and floats to South America. The journey's scarcely begun when he discovers a stowaway: Russell (Jordan Nagai), a chubby, maladroit Wilderness Explorer Scout who's out to earn his Elderly Assistance Badge. In the tropical jungle, Carl and Russell find more than they bargained for: Charles Muntz (Christopher Plummer), a crazed explorer whose newsreels once inspired Carl and Ellie; Kevin, an exotic bird with a weakness for chocolate; and Dug (Bob Peterson), an endearingly dim golden retriever fitted with a voice box. More importantly, the travelers discover they need each other: Russell needs a (grand)father figure; Carl needs someone to enliven his life without Ellie. Together, they learn that sharing ice-cream cones and counting the passing cars can be more meaningful than feats of daring-do and distant horizons. Pete Docter (\", 'Monsters, Inc', \". ) and Bob Peterson direct the film with consummate skill and taste, allowing the poignant moments to unfold without dialogue to Michael Giacchnio's vibrant score. Building on their work in\", 'The Incredibles', 'and', 'Ratatouille', \", the Pixar crew offers nuanced animation of the stylized characters. Even by Pixar's elevated standards,\", 'Up', 'is an exceptional film that will appeal of audiences of all ages. Rated PG for some peril and action. --', 'Charles Solomon', 'Stills from', 'Up', '(Click for larger image)', 'Set Contains:', \"The eagerly awaited Blu-ray of Pixar's hit\", 'Up', 'comes loaded with extras, including two animated shorts: Peter Sohn\\'s \"Partly Cloudy,\" which screened with the feature in its theatrical release, and a new film, \"Dug\\'s Special Mission.\" Directed by Ronnie Del Carmen, \"Special Mission\" reveals how Dug, the dim but lovable golden retriever, met Carl and Russell. \"Adventure Is Out There\" documents the research trip a key group of artists took to the Tapuis in South America and includes not only footage of the precipitous ascent of the mountain, but watercolor sketches the artists did there. Alternate versions of key moments in the film show how these scenes changed during preproduction and why. An early storyboard of the wordless \"Married Life\" sequence that reduced many viewers to tears could have worked, but it\\'s far less satisfying than the final iteration. Discussions of the characters Carl and Russell include preliminary art and footage of director Pete Docter working with child actor Jordan Nagai. In a thoughtful interview, composer Michael Giacchino explains his use of musical motifs for the individual characters, and how shifts from major to minor chords suggest different moods. The Global Guardian Badge Game narrated by Nagai is an interesting geography quiz that would be more fun if the controls were better calibrated--it\\'s hard to land a cursor on Delaware or Belgium when it keeps drifting away. The bonus materials suggest that if Pixar consistently makes the best animated films in America, it\\'s because such talented artists work so hard on them.', '--Charles Solomon', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Animation, Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Don Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bob Peterson, David Kaye, Mickie T. McGowan, Josh Cooley, Co-Directed By Bob Peterson, Jeremy Leary, Jess HarnellDon Fullilove, Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter, Jerome Ranft, Ed Asner, Directed By Pete Docter, Christopher Plummer, John Ratzenberger, Danny Mann, Bo…   See more', 'Language': 'English (DTS 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 6.4 Ounces', 'Item model number': '786936791068', 'Director': 'Directed By Pete Docter, Co-Directed By Bob Peterson', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Ed Asner, Christopher Plummer, Jordan Nagai, Bob Peterson, Delroy Lindo', 'Subtitles': 'French, Spanish', 'Studio': 'Disney*Pixar', 'Writers': 'Story By Pete Docter, Bob Peterson And Tom McCarth, Screenplay By Bob Peterson And Pete Docter', 'Number of discs': '4'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Qualty Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cutthroat Island [Blu-ray]\nReview Date: 2016/01/15\nStore: Geena Davis  (Actor),     Matthew Modine  (Actor),     Renny Harlin  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Geena Davis, Matthew Modine. A swashbuckling female pirate sails the seven seas in search of fortune and glory. But with only a piece of a treasure map to go on and talk of mutiny in the ranks, will her crew of scallywags make her walk the plank before she can dig up the booty? 1995/color/118 min/PG-13.', 'Amazon.com', 'Geena Davis (THELMA & LOUISE, BEETLEJUICE) and Matthew Modine (MARRIED TO THE MOB, FULL METAL JACKET) deliver a tidal wave of nonstop action and adventure in this swashbuckling saga of ruthless pirates, buried treasure and bloodthirsty betrayal.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Frank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew ModineFrank Langella, Patrick Malahide, Maury Chaykin, Renny Harlin, Geena Davis, Chris Masterson, Stan Shaw, Matthew Modine  See more', 'Language': 'English, French', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay time: 84min', 'Director': 'Renny Harlin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Blu-ray, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'August 11, 2009', 'Actors': 'Geena Davis, Matthew Modine, Frank Langella, Chris Masterson, Maury Chaykin', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2001: A Space Odyssey [Blu-ray]\nReview Date: 2016/01/15\nStore: Keir Dullea  (Actor),     Gary Lockwood  (Actor),     Stanley Kubrick  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', '2001: A Space Odyssey (BD)', ']]>', 'Amazon.com', 'When Stanley Kubrick recruited Arthur C. Clarke to collaborate on \"the proverbial intelligent science fiction film,\" it\\'s a safe bet neither the maverick auteur nor the great science fiction writer knew they would virtually redefine the parameters of the cinema experience. A daring experiment in unconventional narrative inspired by Clarke\\'s short story \"The Sentinel,\"', '2001', \"is a visual tone poem (barely 40 minutes of dialogue in a 139-minute film) that charts a phenomenal history of human evolution. From the dawn-of-man discovery of crude but deadly tools in the film's opening sequence to the journey of the spaceship\", 'Discovery', 'and metaphysical birth of the \"star child\" at film\\'s end, Kubrick\\'s vision is meticulous and precise. In keeping with the director\\'s underlying theme of dehumanization by technology, the notorious, seemingly omniscient computer HAL 9000 has more warmth and personality than the human astronauts it supposedly is serving. (The director also leaves the meaning of the black, rectangular alien monoliths open for discussion.) This theme, in part, is what makes', '2001', \"a film like no other, though dated now that its postmillennial space exploration has proven optimistic compared to reality. Still, the film is timelessly provocative in its pioneering exploration of inner- and outer-space consciousness. With spectacular, painstakingly authentic special effects that have stood the test of time, Kubrick's film is nothing less than a cinematic milestone--puzzling, provocative, and perfect.\", '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, DolbyMultiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby   See more', 'Contributor': 'Sean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richter, Alan Gifford, Frank MillerSean Sullivan, David Hines, John Ashley, Douglas Rain, Simon Davis, Penny Brahms, Leonard Rossiter, Edwina Carroll, William Sylvester, Stanley Kubrick, Gary Lockwood, Vivian Kubrick, Keir Dullea, Robert Beatty, Ed Bishop, Ann Gillis, Glenn Beck, Margaret Tyzack, Daniel Richt…   See more', 'Language': 'English (PCM), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 29 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '5.12 x 0.59 x 6.69 inches; 0.32 Ounces', 'Item model number': '3350293', 'Director': 'Stanley Kubrick', 'Media Format': 'Multiple Formats, Blu-ray, Color, AC-3, Closed-captioned, Dubbed, Original recording remastered, Special Edition, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 29 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Keir Dullea, Gary Lockwood, Ed Bishop, Penny Brahms, Edwina Carroll', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Transformers: Revenge of the Fallen (Two-Disc Special Edition) [Blu-ray]\nReview Date: 2016/01/15\nStore: Shia LaBeouf  (Actor),     Megan Fox  (Actor),     Michael Bay  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', 'Blu-ray pressing. The battle for Earth continues in this action-packed blockbuster from director Michael Bay and executive producer Steven Spielberg. When college-bound Sam Witwicky (Shia LaBeouf) learns the truth about the ancient origins of the Transformers, he must accept his destiny and join Optimus Prime and Bumblebee in their epic battle against the Decepticons, who have returned stronger than ever with a plan to destroy our world.', 'Amazon.com', \"Pure. Popcorn. Entertainment. That's an exact classification of director Michael Bay's\", 'Transformers: Revenge of the Fallen', '. Think of', 'Transformers 1', \"on crack. In other words, this sequel took all of the extreme elements that made fans love the first movie and increased them exponentially. The action is nonstop, with battles and explosions from start to finish. The camera (without any subtlety) exploits Megan Fox's hotness to the max. As if she weren't enough, a new sex kitten (Isabel Lucas) is thrown into the equation. Shia LaBeouf is as charismatic as ever, and fills the starring role with ease. And then there's the humor. Sam's parents (Kevin Dunn and Julie White)provided some semi-raunchy laugh-out-loud moments in the first movie, but now they take it to the next level. Sometimes it seems like they are trying a little too hard, but it is still hilarious.\", \"As far as the “plot” goes, the writers didn't waste much time--it's really just a context for the giant-robot death matches and dramatic slow-mo sequences. The movie kicks off two years later where the Autobots have formed an alliance with the U.S. government, creating an elite team led by Major Lennox (Josh Duhamel), in an effort to snuff out any remaining Decepticons that show up. The bad guys keep coming, and it turns out that a much more menacing force than Megatron is out there--and it is looking for something on Earth that is tied to the very origin of the Transformers race. Fans of the franchise will be delighted by the addition of many new robot characters (there are well over 40 in the sequel, versus only 13 in the first). The second\", 'Transformers', \"has shaped up to be one of the worst reviewed and most successful movies of all time. This strange pairing is really just an indication that this movie has one purpose: to entertain. The creators didn't want to waste time bogging down the action and drama with substance--which was arguably a good decision.\", '--Jordan Thompson', 'Stills from', 'Transformers: Revenge of the Fallen', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Shia LaBeouf, Michael Bay, Tyrese Gibson, Megan Fox, John Turturro, Josh Duhamel', 'Language': 'English', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.54 x 5.37 x 6.91 inches; 4 Ounces', 'Item model number': 'DMWV072414BR', 'Director': 'Michael Bay', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 30 minutes', 'Release date': 'October 20, 2009', 'Actors': 'Shia LaBeouf, Megan Fox, Josh Duhamel, Tyrese Gibson, John Turturro', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter and the Half-Blood Prince [Blu-ray]\nReview Date: 2016/01/15\nStore: Daniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['Harry Potter and the Half Blood Prince (Dbl BD)', 'Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort’s defenses and, to this end, Dumbledore recruits his old friend and colleague, Professor Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Drama/Love & Romance, Mystery & Suspense', 'Format': 'Blu-ray, Special Edition, Color, Dubbed, Subtitled, Widescreen', 'Contributor': 'Rupert Grint, Bonnie Wright, Emma Watson, David Barron, Jim Broadbent, J.K. Rowling, Lionel Wigram, Oliver Phelps, Maggie Smith, David Heyman, Tim Lewis, Daniel Radcliffe, Elarica Gallacher, Bruno Delbonnel, David Yates, Robbie Coltrane, Alan Rickman, Michael Gambon, Steve Kloves, James PhelpsRupert Grint, Bonnie Wright, Emma Watson, David Barron, Jim Broadbent, J.K. Rowling, Lionel Wigram, Oliver Phelps, Maggie Smith, David Heyman, Tim Lewis, Daniel Radcliffe, Elarica Gallacher, Bruno Delbonnel, David Yates, Robbie Coltrane, Alan Rickman, Michael Gambon,…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '1000027459', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Special Edition, Color, Dubbed, Subtitled, Widescreen', 'Run time': '2 hours and 15 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Jim Broadbent, Elarica Gallacher', 'Subtitles': 'English, French, Spanish', 'Producers': 'David Barron, David Heyman, Lionel Wigram, Tim Lewis', 'Studio': 'WarnerBrothers', 'Writers': 'J.K. Rowling, Steve Kloves', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night at the Museum: Battle of the Smithsonian\nReview Date: 2016/01/15\nStore: Ben Stiller  (Actor),     Amy Adams  (Actor),     Shawn Levy  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Kids & Family\nProduct Description: ['Product Description', \"Night has fallen upon the Smithsonian Institution in Washington, DC. The guides have gone home, the lights are out, the school kids are tucked in their beds... yet something incredible is stirring as former night guard Larry Daley (Ben Stiller) finds himself lured into his biggest, most imagination-boggling adventure yet in which history truly comes alive. In this second installment of the Night at the Museum saga, Larry faces a battle so epic it could only unfold in the corridors of the world's largest museum. Now, Larry must try to save his formerly inanimate friends from what could be their last stand amid the wonders of the Smithsonian, all of which, from the famous paintings on the walls to the rocket ships in the halls, suddenly have a mind of their own.\", 'Amazon.com', 'Ben Stiller wrestles with extinct beasts, historical figures, and meddling monkeys in', 'Night at the Museum: Battle of the Smithsonian', \", the sequel to the popular 2006 special-effects extravaganza. This time, the ancient Egyptian tablet (the one that brings all the exhibits at New York's Museum of Natural History to life at night) is being shipped off to the Smithsonian in Washington, D.C.--which, as the movie diligently tells us, is the largest museum in the world. Naturally, former museum guard Larry Daley (Ben Stiller) heads down to rescue it (and, by extension, keep his magical museum friends alive). He ends up fighting with a nasty pharaoh who talks like Boris Karloff (Hank Azaria,\", 'The Simpsons', ') and falling in love with Amelia Earhart (Amy Adams,', 'Enchanted', \"). All the old gang are along for the ride, including Dexter the monkey; much face-slapping and special effects ensue. There aren't many surprises, but\", 'Battle of the Smithsonian', 'is cheerful enough to entertain everyone who enjoyed the first movie. Extras include commentaries by the director and the writers, the usual self-congratulatory making-of featurette, deleted scenes that are actually as good as the rest of the movie, an alternate ending, and an entirely pointless second disc about Crystal, the capuchin monkey who plays Dexter (the monkey disc has less than a half-hour of material, including two mediocre games). The great supporting cast from the first movie returns, including Owen Wilson, Steve Coogan, and Robin Williams.', '--Bret Fetzer', 'Stills from', 'Night at the Museum: Battle of the Smithsonian', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': 'FOXS2289274BR', 'Director': 'Shawn Levy', 'Media Format': 'Blu-ray, Digital_copy', 'Run time': '1 hour and 45 minutes', 'Release date': 'December 1, 2009', 'Actors': 'Ben Stiller, Amy Adams, Owen Wilson, Hank Azaria, Christopher Guest', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '3'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Angels & Demons [Blu-ray]\nReview Date: 2016/01/15\nStore: Tom Hanks  (Actor),     Ewan McGregor  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', \"In Ron Howard's thrilling follow-up to The Da Vinci Code, expert symbologist Robert Langdon (Tom Hanks) pursues ancient clues on a heart-racing hunt through Rome to find the four Cardinals kidnapped by a deadly secret society, the Illuminati. With the Cardinals' lives on the line, and the Camerlengo (Ewan McGregor) desperate for help, Langdon embarks on a nonstop, action-packed race through sealed crypts, dangerous catacombs, and the most secret vault on Earth!\", 'Amazon.com', \"If the devil is in the details, there's a lot of wicked fun in\", 'Angels & Demons', ', the sequel (originally a prequel) to', 'The Da Vinci Code', \". Director Ron Howard delivers edge-of-your-pew thrills all over the Vatican, the City of Rome, and the deepest, dankest catacombs. Tom Hanks is dependably watchable in his reprised role as Professor Robert Langdon, summoned urgently to Rome on a matter of utmost urgency--which happens to coincide with the death of the Pope, meaning the Vatican is teeming with cardinals and Rome is teeming with the faithful. A religious offshoot group, calling themselves the Illuminati, which protested the Catholic Church's prosecution of scientists 400 years ago, has resurfaced and is making extreme, and gruesome, terrorist demands. The film zooms around the city, as Langdon follows clues embedded in art, architecture, and the very bone structure of the Vatican. The cast is terrific, including Ewan McGregor, who is memorable as a young protégé of the late pontiff, and who seems to challenge the common wisdom of the Conclave just by being 40 years younger than his fellows when he lectures for church reform. Stellan Skarsgard is excellent as a gruff commander of the Swiss Guard, who may or may not have thrown in with the Illuminati. But the real star of the film is Rome, and its High Church gorgeousness, with lush cinematography by Salvatore Totino, who renders the real sky above the Vatican, in a cataclysmic event, with the detail and majesty of the ceiling of the Sistine Chapel. --\", 'A.T. Hurley', 'Stills from', 'Angels & Demons', '(click for larger image)']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Blu-ray, Dolby, NTSC, Dubbed, Widescreen, Subtitled', 'Contributor': 'John Calley, Columbia Pictures, David Pasquesi, Ayelet Zurer, Ewan McGregor, Thure Lindhardt, Pierfrancesco Favino, Tom Hanks, Ron Howard, Stellan Skarsgård, Armin Mueller-Stahl, Nikolaj Kaas, Brian GrazerJohn Calley, Columbia Pictures, David Pasquesi, Ayelet Zurer, Ewan McGregor, Thure Lindhardt, Pierfrancesco Favino, Tom Hanks, Ron Howard, Stellan Skarsgård, Armin Mueller-Stahl, Nikolaj Kaas, Brian Grazer   See more', 'Language': 'English, French', 'Runtime': '4 hours and 44 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.55 inches; 4 Ounces', 'Item model number': 'COLBR29217', 'Director': 'Ron Howard', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Dubbed, Widescreen, Subtitled', 'Run time': '4 hours and 44 minutes', 'Release date': 'November 24, 2009', 'Actors': 'Tom Hanks, Ewan McGregor, Ayelet Zurer, Stellan Skarsgård, Pierfrancesco Favino', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'John Calley, Ron Howard, Brian Grazer', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Quantum of Solace [Blu-ray]\nReview Date: 2016/01/15\nStore: Daniel Craig  (Actor),     Olga Kurylenko  (Actor),     Marc Forster  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Daniel Craig returns as James Bond in this thrilling, action-packed adventure that picks up where Casino Royale left off. Betrayed by the woman he loved, 007 fights the urge to make his latest mission personal. On a nonstop quest for justice that crisscrosses the globe, Bond meets the beautiful but feisty Camille (Olga Kurylenko), who leads him to Dominic Greene (Mathieu Amalric), a ruthless businessman and major force within the mysterious Quantum organization. When Bond uncovers a conspiracy to take control of one of the world’s most important natural resources, he must navigate a minefield of treachery, deception and murder to neutralize Greene before it’s too late!']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5 x 5.5 x 0.25 inches; 1.6 Ounces', 'Director': 'Marc Forster', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Dubbed, Blu-ray, Subtitled, Widescreen, AC-3, DTS Surround Sound', 'Run time': '1 hour and 47 minutes', 'Release date': 'March 24, 2009', 'Actors': 'Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini', 'Dubbed': 'Spanish, French, Portuguese', 'Subtitles': 'French, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nReview Text: Either you like the movie or you don't!!!\nReview Title: Quality product\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "**SUMMARY:**  \nThe individual displays a strong preference for high-quality movies across diverse genres, primarily within action-adventure and family themes. They consistently rate titles around 4.5 to 5.0, indicating a taste for quality cinema that includes both critically acclaimed and popular films. The sentiment expressed in their reviews suggests a decisive preference for engaging narratives ranging from classic action (like espionage thrillers) to animated family films, all appreciated for their joyous storytelling and compelling character arcs.\n\nA recurring theme is the enjoyment of cinematic franchises, especially popular series featuring well-known characters and familiar actors. This suggests a tendency to gravitate towards established franchises and films that promise a blend of nostalgia and excitement. \n\nMoreover, the individual appears less sensitive to price, as indicated by their selection of collectable formats like Blu-ray, often rated for their superior audio-visual quality. Overall, their purchasing and reviewing behavior indicates a clear inclination toward high-quality, emotionally engaging films that offer both entertainment and nostalgia, reflecting a discerning taste in cinema.\n",
  "target_interaction": {
    "rating": 5.0,
    "title": "Quality Fit",
    "text": "Either you like the movie or you don't!!!",
    "images": [],
    "asin": "B001AVCFK6",
    "parent_asin": "B001AVCFK6",
    "user_id": "AF3GABC7Q7TJGKBDFP3XIAKQNGQA",
    "timestamp": "2016-01-15 21:28:34",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Star Trek (Three-Disc Special Edition) [Blu-ray]",
    "average_rating": 4.8,
    "rating_number": 28452,
    "features": [],
    "description": [
      "Product Description",
      "The greatest adventure of all time begins with",
      "Star Trek",
      ", the incredible story of a young crew’s maiden voyage onboard the most advanced starship ever created: the U.S.S. Enterprise. On a journey filled with action, comedy and cosmic peril, the new recruits must find a way to stop an evil being whose mission of vengeance threatens all of mankind. The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk (Chris Pine), is a delinquent, thrill-seeking Iowa farm boy. The other, Spock (Zachary Quinto), was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before.   &amp;amp;amp;lt;!-- /* Font Definitions */ @font-face {font-family:\"Cambria Math\"; panose-1:2 4 5 3 5 4 6 3 2 4; mso-font-charset:0; mso-generic-font-family:roman; mso-font-pitch:variable; mso-font-signature:-1610611985 1107304683 0 0 159 0;} @font-face {font-family:Cambria; panose-1:2 4 5 3 5 4 6 3 2 4; mso-font-charset:0; mso-generic-font-family:roman; mso-font-pitch:variable; mso-font-signature:-1610611985 1073741899 0 0 159 0;} @font-face {font-family:Calibri; panose-1:2 15 5 2 2 2 4 3 2 4; mso-font-charset:0; mso-generic-font-family:swiss; mso-font-pitch:variable; mso-font-signature:-1610611985 1073750139 0 0 159 0;} @font-face {font-family:\"Book Antiqua\"; panose-1:2 4 6 2 5 3 5 3 3 4; mso-font-charset:0; mso-generic-font-family:roman; mso-font-pitch:variable; mso-font-signature:647 0 0 0 159 0;} @font-face {font-family:Times; panose-1:2 2 6 3 5 4 5 2 3 4; mso-font-charset:0; mso-generic-font-family:roman; mso-font-pitch:variable; mso-font-signature:536881799 -2147483648 8 0 511 0;} /* Style Definitions */ p.MsoNormal, li.MsoNormal, div.MsoNormal {mso-style-unhide:no; mso-style-qformat:yes; mso-style-parent:\"\"; margin:0in; margin-bottom:.0001pt; mso-pagination:widow-orphan; font-size:12.0pt; font-family:\"Arial\",\"sans-serif\"; mso-fareast-font-family:\"Times New Roman\"; mso-bidi-font-family:\"Times New Roman\";} p.MsoFooter, li.MsoFooter, div.MsoFooter {mso-style-unhide:no; mso-style-link:\"Footer Char\"; margin:0in; margin-bottom:.0001pt; mso-pagination:widow-orphan; tab-stops:center 3.0in right 6.0in; font-size:12.0pt; font-family:\"Arial\",\"sans-serif\"; mso-fareast-font-family:\"Times New Roman\"; mso-bidi-font-family:\"Times New Roman\";} span.FooterChar {mso-style-name:\"Footer Char\"; mso-style-unhide:no; mso-style-locked:yes; mso-style-link:Footer; mso-ansi-font-size:12.0pt; mso-bidi-font-size:12.0pt; font-family:\"Arial\",\"sans-serif\"; mso-ascii-font-family:Arial; mso-hansi-font-family:Arial;} .MsoChpDefault {mso-style-type:export-only; mso-default-props:yes; font-size:10.0pt; mso-ansi-font-size:10.0pt; mso-bidi-font-size:10.0pt;} @page Section1 {size:8.5in 11.0in; margin:45.35pt .75in .5in .75in; mso-header-margin:.5in; mso-footer-margin:.5in; mso-paper-source:0;} div.Section1 {page:Section1;} --&amp;amp;amp;gt;",
      "Amazon.com",
      "J.J. Abrams' 2009 feature film was billed as \"not your father's",
      "Star Trek",
      ",\" but your father will probably love it anyway. And what's not to love? It has enough action, emotional impact, humor, and sheer fun for any moviegoer, and Trekkers will enjoy plenty of insider references and a cast that seems ideally suited to portray the characters we know they'll become later. Both a prequel and a reboot,",
      "Star Trek",
      "introduces us to James T. Kirk (Chris Pine of",
      "The Princess Diaries 2",
      "), a sharp but aimless young man who's prodded by a Starfleet captain, Christopher Pike (Bruce Greenwood), to enlist and make a difference. At the Academy, Kirk runs afoul of a Vulcan commander named Spock (Zachary Quinto of",
      "Heroes",
      "), but their conflict has to take a back seat when Starfleet, including its new ship, the",
      "Enterprise",
      ", has to answer an emergency call from Vulcan. What follows is a stirring tale of genocide and revenge launched by a Romulan (Eric Bana) with a particular interest in Spock, and we get to see the familiar crew come together, including McCoy (Karl Urban), Uhura (Zoe Saldana), Sulu (John Cho), Chekhov (Anton Yelchin), and Scottie (Simon Pegg).",
      "The action and visuals make for a spectacular Big-Screen Movie, though the plot by Abrams and his writers, Roberto Orci and Alex Kurtzman (who worked together on",
      "Transformers",
      "and with Abrams on",
      "Alias",
      "and",
      "Mission Impossible III",
      "), and his producers (fellow",
      "Lost",
      "ies Damon Lindeloff and Bryan Burk) can be a bit of a mind-bender (no surprise there for",
      "Lost",
      "fans). Hardcore fans with a bone to pick may find faults, but resistance is futile when you can watch Kirk take on the",
      "Kobayashi Maru",
      "scenario or hear McCoy bark, \"Damnit, man, I'm a doctor, not a physicist!\" An appearance by Leonard Nimoy and hearing the late Majel Barrett Roddenberry as the voice of the computer simply sweeten the pot. Now comes the hard part: waiting for some sequels to this terrific prequel.",
      "--David Horiuchi",
      "Stills from",
      "Star Trek",
      "(Click for larger image)"
    ],
    "price": 13.8,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51RfGsmoLVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51RfGsmoLVL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71U5O1qvW4L._SL1270_.jpg"
      }
    ],
    "videos": [
      {
        "title": "JJ I salute You, Good Job. Extraordinary Blu-Ray",
        "url": "https://www.amazon.com/vdp/b57e1873347e482e81d792b50a12ea00?ref=dp_vse_rvc_0",
        "user_id": "AECOY4BQUZTYEA3TJOBCHHA2C6BQ"
      },
      {
        "title": "Star Trek -  Clip",
        "url": "https://www.amazon.com/vdp/8f28fdc5606749258d7a9fddb7fdc59e?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "Star Trek Video",
        "url": "https://www.amazon.com/vdp/247bc69588b74e51b2fa29117ecc25c8?ref=dp_vse_rvc_2",
        "user_id": ""
      }
    ],
    "store": "Chris Pine  (Actor),     Zachary Quinto  (Actor),     J.J. Abrams  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Genre": "Comedy, Action & Adventure",
      "Format": "AC-3, Dolby, Dubbed, Special Edition, Subtitled, Widescreen",
      "Contributor": "Ben Cross, Zoë Saldana, Winona Ryder, Simon Pegg, Eric Bana, Anton Yelchin, John Cho, Karl Urban, J.J. Abrams, Leonard Nimoy, Chris Pine, Zachary Quinto, Bruce GreenwoodBen Cross, Zoë Saldana, Winona Ryder, Simon Pegg, Eric Bana, Anton Yelchin, John Cho, Karl Urban, J.J. Abrams, Leonard Nimoy, Chris Pine, Zachary Quinto, Bruce Greenwood  See more",
      "Language": "French (Dolby Digital 5.1), English (Dolby Digital 5.1 ES Matrix)",
      "Runtime": "2 hours and 6 minutes",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "6.75 x 5.3 x 0.45 inches; 5.44 Ounces",
      "Item model number": "5823070",
      "Director": "J.J. Abrams",
      "Media Format": "AC-3, Dolby, Dubbed, Special Edition, Subtitled, Widescreen",
      "Run time": "2 hours and 6 minutes",
      "Release date": "November 17, 2009",
      "Actors": "Chris Pine, Zachary Quinto, John Cho, Ben Cross, Bruce Greenwood",
      "Dubbed": "French, Spanish",
      "Subtitles": "English, French, Spanish, Portuguese",
      "Studio": "Paramount",
      "Number of discs": "3"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}