{
  "user_id": "AEJ7RCG7E2R6D6NBYLCO3REWGSGA",
  "summary": "=== Purchase Information ===\nProduct Title: Cowboys & Outlaws\nReview Date: 2011/12/09\nStore: Cowboys & Outlaws  (Actor),     History  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['They were the quintessential American heroes: the embodiment of rugged individualism and independence. For a century and half, cowboys ruled the frontier, settling the American West and carving their way into American mythology forever.A powder keg of history, the American Frontier was a period of conquest, war and money. In this short era, men and women endured the Buffalo Hunters Wars, range wars, Indian Wars, and the Spanish-American War. For most, it was a time of incredible stress and hardship. But for a few extraordinary men, it was a time of unbelievable opportunity. Cowboys brought six million steers from the southernmost tip of Texas along cattle trails to railroad heads, and settled the West, solidifying their stature as heroes whose strength and individuality made them the ultimate icons of their time.Discover the legendary qualities of these amazing men in this visually stunning series from HISTORYTM. Using recovered letters, journals and books, as well as archaeological and forensic evidence, COWBOYS & OUTLAWS focuses on the true tales and heroes of the American West.']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Audio Description': 'English', 'Item model number': '1775', 'Director': 'History', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 42 minutes', 'Release date': 'January 26, 2010', 'Actors': 'Cowboys & Outlaws', 'Language': 'Unqualified', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Purchased this as a gift for my Dad who is a great cowboy movie fan.  He was thrilled and enjoyed it greatly.  It arrived quickly and was nicely boxed.\nReview Title: Wonderful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Boardwalk Empire: Season 2\nReview Date: 2012/11/26\nStore: Steve Buscemi  (Actor),     Michael Pitt  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Atlantic City, 1921. In a city whose fortunes have soared in the wake of Prohibition, Nucky Thompson is paying a steep price for wielding ultimate power in “the world’s playground.” Though the 1920 election is over, Nucky finds himself the target of a federal investigation for vote tampering – and an insurrection by those he counted among his closest allies. Steve Buscemi stars in the hit drama series that charts the continued rise of organized crime at the dawn of the Prohibition.', 'Amazon.com', \"With every character on HBO's\", 'Boardwalk Empire', 'leading a double life, season two is about making changes or facing the consequences. The stylish series also digs deeper into the futility of Prohibition, much as', 'The Wire', \"tackled the War on Drugs. The central figure, Atlantic City treasurer Nucky Thompson (Steve Buscemi), aims to please all of his constituents, but loses several powerful supporters after bootlegger Chalky White (Michael Kenneth Williams) kills a Klansman. Estranged from his brother, Eli (Shea Whigham), and former assistant, Jimmy (Michael Pitt), Nucky and his common-law wife (Kelly Macdonald) become more of a team. If domesticity suits Nucky, FBI agent Van Alden (Michael Shannon) looks askance at drinkers and nonbelievers, even as he holes up with Nucky's pregnant ex-girlfriend (Paz de la Huerta, the weakest link in an otherwise strong cast), while his wife remains in the Midwest. With enemies like the Commodore (Dabney Coleman) trying to remove him from office, Nucky hires Irish Lothario Slater (Charlie Cox), who helps to keep the booze flowing, meting out the occasional head-butt as necessary. Other new arrivals include a brutal butcher (William Forsythe) and a persistent federal prosecutor (Julianne Nicholson), who wields more power than the other wives and girlfriends combined, though Jimmy's mother (Gretchen Mol) becomes more Machiavellian by the minute. Nucky also joins forces with Arnold Rothstein (Michael Stuhlbarg), while Jimmy aligns with Al Capone (Stephen Graham) and Lucky Luciano (Vincent Piazza). Of course, it wouldn't be a gangster epic without casualties, and several men give in to their darker impulses, resulting in some spectacularly bloody business--including the murder of a major character. Also, heroin enters the picture towards the end of the 12-episode arc and seems likely to play a bigger, more destructive role in the next season.\", '--Kathleen C. Fennessy']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Drama', 'Format': 'Multiple Formats, Color, AC-3, Box set, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Contributor': 'Steve Buscemi, Michael Pitt, William Hill', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.32 Ounces', 'Item model number': '133593', 'Media Format': 'Multiple Formats, Color, AC-3, Box set, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Run time': '12 hours', 'Release date': 'August 28, 2012', 'Actors': 'Steve Buscemi, Michael Pitt, William Hill', 'Subtitles': 'English, French, Spanish', 'Studio': 'HBO Studios', 'Number of discs': '5'}\nReview Text: Was not sure about this boxed set then I ordered it, but gave it a try anyway.  It was interesting from the get-go and pulled you in and kept you watching till the last disc!  Gets you going with some love/hate/pity characters and overall is a great break from the lack luster offerings currently on the television.  Great entertainment on a cold winter night when nothing else is happening...make some popcorn and settle in, I think you will be hooked!\nReview Title: Entertaining\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sharpe's Rifles Collection Set [DVD]\nReview Date: 2013/03/21\nStore: Sean Bean  (Actor),     Assumpta Serna  (Actor),     Tom Clegg  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['\"Compelling viewing for adventure lovers.\" - The Daily Mail', 'Acclaimed actor', 'Sean Bean', '(', 'The Island, The Lord of the Rings', ') stars in this action-packed series set in the midst of the desperate missions and battles of the Napoleonic Wars. Adapted from', \"Bernard Cornwell's\", \"bestselling novels, Bean portrays maverick British officer Richard Sharpe who rises through the ranks of Wellington's army by his own daring deeds and ambition. Fast-moving, hard-hitting adventure,\", 'Sharpe', 'brings to the screen all the danger, romance and sheer spectacle of one of the bloodiest periods in English warfare.', 'Includes:', \"Sharpe's Rifles\", '/', \"Sharpe's Eagle\", '/', \"Sharpe's Company\", '/', \"Sharpe's Enemy\", '/', \"Sharpe's Honour\", 'approx. 8 hrs. col.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Romance, Action & Adventure', 'Format': 'Box set, Color, NTSC, DVD', 'Contributor': \"Assumpta Serna, Lyndon Davies, Jason Salkey, Julian Fellowes, Sean Bean, David Troughton, Michael Mears, Simn Andreu, Paul Trussell, Brian Cox, Bernard Cornwell, Daragh O'Malley, Tom Clegg, John Tams, Eoghan HarrisAssumpta Serna, Lyndon Davies, Jason Salkey, Julian Fellowes, Sean Bean, David Troughton, Michael Mears, Simn Andreu, Paul Trussell, Brian Cox, Bernard Cornwell, Daragh O'Malley, Tom Clegg, John Tams, Eoghan Harris  See more\", 'Language': 'Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.56 x 5.35 x 0.98 inches; 7.72 Ounces', 'Director': 'Tom Clegg', 'Media Format': 'Box set, Color, NTSC, DVD', 'Run time': '8 hours and 20 minutes', 'Release date': 'November 1, 2005', 'Actors': \"Sean Bean, Assumpta Serna, Brian Cox, Daragh O'Malley, David Troughton\", 'Studio': 'BFS Entertainment', 'Writers': 'Bernard Cornwell, Eoghan Harris', 'Number of discs': '5'}\nReview Text: Yes, I bought into the Sharpes craze and ordered several seasons of this series.  Having read the other reviews I thought it might be interesting and fun to watch.  I don't understand the 'Sharpes Fever' that seems to be going around.  The series is, unfortunately, quite hokey in my humble opinion.  The acting left something to be desired, and if your desire is to simply watch some attractive folks on the tv screen and you are not concerned with the hokey plots or poor acting this should suffice nicely.  Yes, I know it is an older series and the standards were different then from now, but hokey is hokey there is no getting around it.  I do enjoy the more vintage series shows, but this is simply not one of them.  Still have not finished the set and probably won't, just uninspired all around.\nReview Title: So So\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lark Rise to Candleford: Season 1\nReview Date: 2013/03/26\nStore: Hallinan, Olivia  (Actor),     Sawalha, Julia  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, Drama\nProduct Description: ['Product Description', 'The BBC drama series adapted from Mary Gaskells classic novels of small town gossip, secrets and romance. 1842. Cranford, a market town in the North West of England, is a place governed by etiquette, custom and above all, an intricate network of ladies. It seems that life has always been conducted according to their social rules, but Cranford is on the cusp of change…', ']]>', 'Amazon.com', \"The BBC's costume drama juggernaut struck gold once more when it decided to tackle the work of Flora Thompson. And in adapting her books in the form of the television production\", 'Lark Rise to Candleford', ', it has brought another compelling piece of drama to the screen.', 'Lark Rise to Candleford', \"is set at the end of the 19th century, and it follows the story of two communities in the midst of a developing Oxfordshire. One is a fast-growing market town, the other a sleepier, quieter place that's holding more onto the past. Centered on Laura, the eldest daughter in the Timmins house, as she leaves the quieter life for work in the market town, the stage is then set for a quality drama series.\", \"There's a lot to enjoy in the 10 episodes. The cast, for instance, is simply terrific, with Julia Sawalha, Dawn French, and Olivia Hallinan rightly taking plaudits. And the journey of their characters, along with those of the strong supporting cast, is simply wonderful television. Mixing in humor, drama and the production values we seem to take for granted from the BBC,\", 'Lark Rise to Candleford', \"is really quite a treat. And what's more, it's proof positive that when it comes to television period drama, there really isn't anyone doing it better. Super stuff.\", '--Jon Foster']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Smith, Liz, Sawalha, Julia, French, Dawn, Coyle, Brendan, Hallinan, Olivia', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 49 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Hallinan, Olivia, Sawalha, Julia, Smith, Liz, French, Dawn, Coyle, Brendan', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '4'}\nReview Text: I ordered Season One of Lark Rise to fill some time while I waited for the fourth season of Downton Abby.  I did notice that Mr. Bates from Downton Abby plays the father in Lark Rise, so I gave it a try.  It is certainly not Downton, but it never claimed to be.  Personally I found it to be something near to the British version of \"Little House on the Prairie\" and I can't say I was impressed at all.  The story line is sweet, but I was expecting something a bit more complex and Lark Rise just does not have it.  Glad I just ordered season one, and not the entire series, as I likely will not even finish season one, but give it to my grandkids to watch.  Cute and sweet, but just not the captivating story line I was hoping to find.\nReview Title: Rather Lacking\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LINCOLN\nReview Date: 2013/04/01\nStore: Daniel Day-Lewis  (Actor),     Sally Field  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', \"From DreamWorks, Steven Spielberg directs two-time Academy Award(R) winner Daniel Day-Lewis (Best Actor, THERE WILL BE BLOOD, 2007, and MY LEFT FOOT, 1989) in LINCOLN -- with an all-star ensemble cast including Sally Field, Tommy Lee Jones and Joseph Gordon-Levitt. This inspiring and revealing drama focuses on the 16th President's tumultuous final four months in office as this visionary leader pursues a course of action to end the Civil War, unite the country and abolish slavery. Complete with never-before-seen footage featuring Steven Spielberg and the cast, who take you deep inside the making of the movie, LINCOLN sheds light on a man of moral courage and fierce determination.\", 'Amazon.com', 'View larger', 'View larger', 'View larger', 'View larger As with the great John Ford (', 'Young Mr. Lincoln', \") before him, it would be out of character for Steven Spielberg to construct a conventional, cradle-to-grave portrait of a historical figure. In drawing from Doris Kearns Goodwin's\", 'Team of Rivals', \", the director instead depicts a career-defining moment in the career of Abraham Lincoln (an uncharacteristically restrained Daniel Day-Lewis). With the Civil War raging, and the death toll rising, the president focuses his energies on passage of the 13th Amendment. Even those sympathetic to the cause question his timing, but Lincoln doesn't see the two issues as separate, and the situation turns personal when his son, Robert (Joseph Gordon-Levitt), chooses to enlist rather than to study law. While still mourning the loss of one son, Mary (Sally Field) can't bear to lose another. Playwright Tony Kushner, who adapted the screenplay, takes a page from the procedural handbook in tracing Lincoln's steps to win over enough representatives to abolish slavery, while simultaneously bringing a larger-than-life leader down to a more manageable size. In his stooped-shoulder slouch and Columbo-like speech, Day-Lewis succeeds so admirably that the more outspoken characters, like congressman Thaddeus Stevens (Tommy Lee Jones) and lobbyist W.N. Bilbo (James Spader), threaten to steal the spotlight whenever they enter the scene, but the levity of their performances provides respite from the complicated strategizing and carnage-strewn battlefields. If\", 'Lincoln', \"doesn't thrill like the Kushner-penned\", 'Munich', \", there's never a dull moment--though it would take a second viewing to catch all the political nuances.\", '--Kathleen C. Fennessy', 'Related Products', 'Team of Rivals', 'Lincoln', 'Soundtrack', 'A Steven Spielberg Film: Lincoln: A Cinematic and Historical Companion']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Daniel Day-Lewis, Sally Field, Hal Holbrook, James Spader, David Strathairn, Steven Spielberg, Joseph Gordon-Levitt, Tommy Lee JonesDaniel Day-Lewis, Sally Field, Hal Holbrook, James Spader, David Strathairn, Steven Spielberg, Joseph Gordon-Levitt, Tommy Lee Jones  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'MFR786936830330#VG', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'March 26, 2013', 'Actors': 'Daniel Day-Lewis, Sally Field, David Strathairn, Joseph Gordon-Levitt, James Spader', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Boy, this movie was a huge disappointment.  I can't say for sure what I was expecting, but this was not it.  The movie consisted of long and sometimes painfully drawn out dialogue and little action.  The movie revolved entirely around the passage of the 13th Amendment as a means to end the war, or at least bring the South to the bargaining table.  What it did, for me, was cast Washington in a light not much different than that of today with the bribes, deals and rangling going on for the advancement of one side's agenda.  If they thought to portray Lincoln as a hero, they instead cast him as no better than the dishonest congress he dealt with to gain passage of the bill.  I should have expected no more from Hollywood, but for some odd reason I did.  Overall a huge disappointment and a movie I would not recommend unless you go into it knowing in advance that Washington is crooked as all get out and Honest Abe was not so honest and entirely void ethics.  If that is what you want to see for entertainment, then I would recommend you simply watch the nightly news.\nReview Title: Not So Impressed\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Upstairs, Downstairs Season 2 (2012)\nReview Date: 2013/04/06\nStore: Keeley Hawes  (Actor),     Ed Stoppard  (Actor),     Anthony Byrne  (Director),     Marc Jobst  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', 'Upstairs, Downstairs Season 2 (2012)', 'The sumptuous new production Upstairs Downstairs, one of the most beloved television series of all time returns for a second season! Now a well established and thriving household in the heart of London, life in Eaton Place has moved on; Lady Agnes and Sir Hallam’s family is complete with the addition of two small children and London has settled into an uneasy peace with the apparent aversion of war. Yet below the surface of a well-run household, both upstairs and downstairs are harboring life-changing secrets. As romance, heartbreak and revelations engulf the household; its inhabitants discover that the real threat to 165 Eaton Place is much closer to home.', ']]>', 'Amazon.com', 'Decades before ITV launched', 'Downton Abbey', ', the BBC created a sensation with', 'Upstairs Downstairs', ', which revived interest in the British manor house. In 2010, the series came back to life with a new cast--plus holdover Miss Buck (co-creator Jean Marsh)--centering on Sir Hallam Holland (Ed Stoppard), a foreign-service diplomat, and his wife, Lady Agnes (', 'MI-5', \"'s Keeley Hawes). In season two, which takes place in 1938, World War II darkens their doorstep as they welcome three new arrivals to 165 Eaton Place: Beryl (Laura Haddock), a nursery maid with ambition; Hallam's aunt, Blanche (Alex Kingston), an archeologist with a secret; and Caspar Landry (Michael Landes), an American entrepreneur with an eye for Agnes, who finds the attention flattering--and it isn't as if Hallam doesn't have an admirer of his own. Chauffeur Spargo (Neil Jackson), a former boxer who once tangled with Agnes's bad-girl sister, Persephone (Claire Foy), also takes an interest in Beryl, but she proves harder to win over.\", \"War proceeds to affect them all differently: Persie, a Nazi sympathizer, returns from Germany with a new dilemma, while servants Mr. Amanjit (Art Malick) and Mrs. Thackeray (Anne Reid) condemn the pacifist beliefs of Pritchard (Adrian Scarborough), which will cause him further repercussions later (Ami Metcalf and Nico Mirallegro are also good value as the youngest staffers). In an ill-advised move into docudrama territory, the Hollands entertain Ambassador Joseph Kennedy and his son John, but such missteps are rare. As the season unwinds, the prim and proper Pritchard becomes more sympathetic in contrast with Sir Hallam, whose lack of empathy for his wife and employees makes him one of the year's more hissable villains. Sadly, the BBC did not renew this promising series, so audiences may never find out how the Holland household weathered the war.\", '--Kathleen C. Fennessy']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Brendan Maher, Marc Jobst, Keeley Hawes, Anne Reid, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anthony ByrneBrendan Maher, Marc Jobst, Keeley Hawes, Anne Reid, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anthony Byrne  See more', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'unknown', 'Director': 'Anthony Byrne, Marc Jobst, Brendan Maher', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours', 'Release date': 'October 23, 2012', 'Actors': 'Keeley Hawes, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anne Reid', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReview Text: Purchased both seasons of this continuing story of '165' while I am waiting for the next season of Downton Abby.  I have never seen the original series so I was not certain if jumping in now would be confusing, but it is not, the story does a nice job of looping back to explain any references to the original series making it easy on viewers like me.  I cannot compare this series to the original, but that might be a good thing, allowing this series to stand on its own merits.  The characters are easy to warm up to, and the story line moves along at a nice pace.  This is proving to be a nice filler and I am going to be sorry to see it end so quickly.  If you are looking for some enjoyable viewing similar to Downton then you will most likely find this series fits the bill nicely.\nReview Title: Quite Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Upstairs, Downstairs\nReview Date: 2013/04/06\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', \"One of the most loved television series of all time is brought back to life with a fresh cast and sumptuous production values. It's 1936, and six years since parlormaid Rose left 165 Eaton Place, fate brings her back, as housekeeper to its new owners: Sir Hallam and his wife Lady Agnes, and Maud, Lady Holland, his mother. Rose soon finds she has her work cut out as she recruits a new 'downstairs' family to help run the elegance and finery of the 'upstairs' world. Both upstairs and downstairs, it soon becomes apparent there lies a labyrinth of secrets, lies and scandal. Set against the historical backdrop of a Britain with a new King, with sexual, social and political tensions, this new series provides an evolving take on the master-servant relationship.\", 'Amazon.com', 'Remade from the hit 1970s serial, this new version of', 'Upstairs, Downstairs', ', condensed into three hour-long episodes, creates for a modern eye a vision of what 1936 in England must have looked like. That is, if you were royalty, and ran a fantastic mansion at 165 Eaton Place, in one of London\\'s poshest neighborhoods. This show, as indicated in its title, revels in its overall ability to convey life as it unfolds upstairs, among the elite, and downstairs, among those who work tirelessly to keep the palace running. From the first episode, \"The Fledgling,\" the plot is placed politically, socially, and romantically as newlyweds Sir Hallam Holland (Ed Stoppard) and Lady Agnes (Keeley Hawes) decide to sweep the cobwebs out of the old family haunt in favor of modernization. While mundane house dramas unfurl, increasing tenfold once Sir Hallam\\'s nosy, old-fashioned mother, Maud (Eileen Atkins), decides that she and her pet monkey will be moving in, larger political dramas pepper the personal landscape. For example, in \"The Fledgling,\" as well as the next episodes, \"The Ladybird\" and \"The Cuckoo,\" Agnes\\'s sister, Lady Persephone (Claire Foy), is increasingly misled by the newly formed fascist party, and mounting tensions between Jewish household members and Persie\\'s ilk, including German official Ribbentrop (Edward Baker-Duly), loom large. As would be expected in this royal tale, much of the plot comprises Agnes\\'s ability to bear children and the political expectations Sir Hallam must meet even when morally conflicted.', \"The most winning aspect of this miniseries is in its display of what the servants attend throughout; their challenges seem equally as difficult as the challenges presented in tandem upstairs. When Agnes promotes ex-housekeeper Rose Buck (Jean Marsh) to hire and manage the house crew, Rose rises to the occasion and commands many interesting scenes in which she hires, fires, and coaches team members like the butler, Pritchard (Adrian Scarborough), head chef Mrs. Thackeray (Anne Reid), young footman Johnny (Nico Mirallegro), and maid Ivy (Ellie Kendrick). Lavish scenes showing preparation for parties, plus those in which the servants simply keep up with daily tasks, may shock those who are not familiar with formal etiquette from the past. Amanjit (Art Malik), Maud's secretary who lives upstairs separate from the rest of the servants, serves as a character who straddles both worlds, offering us glimpses into a man who can relate to both classes. While ultimately modern change is afoot in the Holland household, it is slow moving, and viewers will enjoy watching it come incrementally, through refined displays. --\", 'Trinie Dalton']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DE177642D', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '3 hours', 'Release date': 'April 26, 2011', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReview Text: Purchased both seasons of this continuing story of '165' while I am waiting for the next season of Downton Abby.  I have never seen the original series so I was not certain if jumping in now would be confusing, but it is not, the story does a nice job of looping back to explain any references to the original series making it easy on viewers like me.  I cannot compare this series to the original, but that might be a good thing, allowing this series to stand on its own merits.  The characters are easy to warm up to, and the story line moves along at a nice pace.  This is proving to be a nice filler and I am going to be sorry to see it end so quickly.  If you are looking for some enjoyable viewing similar to Downton then you will most likely find this series fits the bill nicely.\nReview Title: Quite Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: North and South (Dbl DVD) (BBC)\nReview Date: 2013/04/06\nStore: Daniela Denby-ashe  (Actor),     Richard Armitage  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'North and South (Dbl DVD) (BBC)', 'As the daughter of a middle-class parson, Margaret Hale has enjoyed a privileged upbringing in rural southern England. When her father uproots the family to take work in the northern mill town of Milton, Margaret is shocked by the dirt, the noise and the gruffness of the people, but she reserves her highest contempt for the charismatic mill-owner John Thornton.', ']]>', 'Amazon.com', 'North & South', \"is a splendid, four-hour adaptation of Elizabeth Gaskell's 19th century novel about an unlikely, and somewhat star-crossed, love between a middle-class young woman from England's cultivated south and an intemperate if misunderstood industrialist in a hardscrabble, northern city. Daniela Denby-Ashe plays Margaret Hale, forthright and strong-willed daughter of a former vicar (Tim Pigott-Smith) who relocates his family from a pastoral village outside London to unforgiving, largely illiterate Milton, a factory town where John Thornton (Richard Armitage) and his mother (Sinead Cusack), survivors of poverty, rule their cotton mill with an iron hand. Thornton befriends Margaret's father but incurs her wrath for his severity with his workers. What she doesn't notice is Thornton's core sense of responsibility for his employees' welfare. On the other hand, he misinterprets some of Margaret's own actions and intentions. Equally stubborn, the two drag out their obvious attraction over many painful months and events.\", 'North & South', \"'s two leads are both very good, though Armitage's brooding, penetrating performance may very well be considered a classic one day. There are other wonders in the cast: Cusack and Pigott-Smith are superb, and Brendan Coyle is memorable as a firebrand union organizer who ultimately becomes an ally to a softening Thornton. The miniseries script by Sandy Welch is a persuasive mix of historical context and character study. Brian Percival's direction is full of moments that linger in the imagination, such as the winter-dream look of a busy cotton mill, with thousands of snowy fibers floating in the air.\", '--Tom Keogh']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Sinead Cusack, Elizabeth Gaskell, Daniela Denby-ashe, Richard Armitage, Tim Pigott-smith', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '794051245328', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '3 hours and 53 minutes', 'Release date': 'May 16, 2006', 'Actors': 'Daniela Denby-ashe, Richard Armitage, Sinead Cusack, Tim Pigott-smith', 'Subtitles': 'English', 'Studio': 'BBC Video', 'Writers': 'Elizabeth Gaskell', 'Number of discs': '2'}\nReview Text: Once again, I purchased this DVD while waiting for my next Downton Abby fix.  It is only a short series but well worth viewing.  The story line moved along nicely, the characters were well done and I found it engaging.  Not a complicated or involved drama, but still it managed to keep me captivated.  Sorry that it was not longer.  I had also purchased the &#34;Lark Rise&#34; series and did not finish that as it was too much like watching the British version of Little House on the Prairie, but North & South had a more adult story line that I found entertaining.  If you are looking for some light, but enjoyable summer viewing while you wait for the Downton saga to continue, give North & South a try, I believe you will be pleased.\nReview Title: Good Viewing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Upstairs Downstairs: Series One, 40th Anniversary Edition\nReview Date: 2013/04/25\nStore: Jackson, Gordon  (Actor),     Langton, David  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: ['\"Charmingly seductive\" --The New York Times', '6+ hours of new bonus material', 'Iconic British series seen on Masterpiece Theatre and A&E', 'Upstairs: the wealthy, aristocratic Bellamys. Downstairs: their loyal and lively servants. For nearly 30 years, they share a fashionable townhouse at 165 Eaton Place in London’s posh Belgravia neighborhood, surviving social change, political upheaval, scandals, and the horrors of the First World War.', 'Set between 1903 and 1909, Series One introduces Sir Richard Bellamy and his elegant wife, Marjorie, who reside upstairs with their dissolute son, James, and headstrong daughter, Elizabeth. Living and working downstairs are Hudson, the proper butler; Mrs. Bridges, the garrulous cook; the calm and watchful maid Rose; and many more. In this Emmy® winner for outstanding drama series, love blooms, tragedy strikes, scandals are avoided, and wedding bells sound.', 'Starring Jean Marsh (Agatha Christie’s The Pale Horse), David Langton (The Spoils of War), Simon Williams (Sword of Honour), Nicola Pagett (A Bit of a Do), Gordon Jackson (The Professionals), Angela Baddeley (Martin Chuzzlewit), Christopher Beeny (Last of the Summer Wine), and Pauline Collins (Shirley Valentine).', 'color/b&w (episodes 2–5 & 7)']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Black & White, Color, NTSC', 'Contributor': 'Jackson, Gordon, Thomasin, Jenny, Baddeley, Angela, Marsh, Jean, Beeny, Christopher, Langton, David', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': 'AMP8630', 'Media Format': 'Multiple Formats, Box set, Black & White, Color, NTSC', 'Release date': 'March 29, 2011', 'Actors': 'Jackson, Gordon, Langton, David, Marsh, Jean, Baddeley, Angela, Beeny, Christopher', 'Studio': 'ACORN MEDIA', 'Number of discs': '4'}\nReview Text: Okay, I am a Downton Abby fan - admitted.  I have also enjoyed the modern remake of Upstairs Downstairs and enjoyed it very much.  So, I thought I would venture back in time and watch the original inspiration for the remake.  Oh it was painful to say the least!  Yes, it is an older creation, but I was not quite expecting the poor acting that I encountered.  I tried to give this every chance to redeem itself, but each episode just seemed to get longer and the acting worse.  If you can suffer the flat acting it might be possible to appreciate this series for the vintage piece that it is - I was not able to do that and I returned it to Amazon on their Buy-Back program because I knew that I would never finish watching it.\nReview Title: Not that Wonderful\nRating: 2.0\n--------------------------------------------------",
  "reference": "Cowboys & Outlaws\nCowboys & Outlaws  (Actor),     History  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['They were the quintessential American heroes: the embodiment of rugged individualism and independence. For a century and half, cowboys ruled the frontier, settling the American West and carving their way into American mythology forever.A powder keg of history, the American Frontier was a period of conquest, war and money. In this short era, men and women endured the Buffalo Hunters Wars, range wars, Indian Wars, and the Spanish-American War. For most, it was a time of incredible stress and hardship. But for a few extraordinary men, it was a time of unbelievable opportunity. Cowboys brought six million steers from the southernmost tip of Texas along cattle trails to railroad heads, and settled the West, solidifying their stature as heroes whose strength and individuality made them the ultimate icons of their time.Discover the legendary qualities of these amazing men in this visually stunning series from HISTORYTM. Using recovered letters, journals and books, as well as archaeological and forensic evidence, COWBOYS & OUTLAWS focuses on the true tales and heroes of the American West.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Audio Description': 'English', 'Item model number': '1775', 'Director': 'History', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 42 minutes', 'Release date': 'January 26, 2010', 'Actors': 'Cowboys & Outlaws', 'Language': 'Unqualified', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\nPurchased this as a gift for my Dad who is a great cowboy movie fan.  He was thrilled and enjoyed it greatly.  It arrived quickly and was nicely boxed.\nWonderful!\nBoardwalk Empire: Season 2\nSteve Buscemi  (Actor),     Michael Pitt  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Atlantic City, 1921. In a city whose fortunes have soared in the wake of Prohibition, Nucky Thompson is paying a steep price for wielding ultimate power in “the world’s playground.” Though the 1920 election is over, Nucky finds himself the target of a federal investigation for vote tampering – and an insurrection by those he counted among his closest allies. Steve Buscemi stars in the hit drama series that charts the continued rise of organized crime at the dawn of the Prohibition.', 'Amazon.com', \"With every character on HBO's\", 'Boardwalk Empire', 'leading a double life, season two is about making changes or facing the consequences. The stylish series also digs deeper into the futility of Prohibition, much as', 'The Wire', \"tackled the War on Drugs. The central figure, Atlantic City treasurer Nucky Thompson (Steve Buscemi), aims to please all of his constituents, but loses several powerful supporters after bootlegger Chalky White (Michael Kenneth Williams) kills a Klansman. Estranged from his brother, Eli (Shea Whigham), and former assistant, Jimmy (Michael Pitt), Nucky and his common-law wife (Kelly Macdonald) become more of a team. If domesticity suits Nucky, FBI agent Van Alden (Michael Shannon) looks askance at drinkers and nonbelievers, even as he holes up with Nucky's pregnant ex-girlfriend (Paz de la Huerta, the weakest link in an otherwise strong cast), while his wife remains in the Midwest. With enemies like the Commodore (Dabney Coleman) trying to remove him from office, Nucky hires Irish Lothario Slater (Charlie Cox), who helps to keep the booze flowing, meting out the occasional head-butt as necessary. Other new arrivals include a brutal butcher (William Forsythe) and a persistent federal prosecutor (Julianne Nicholson), who wields more power than the other wives and girlfriends combined, though Jimmy's mother (Gretchen Mol) becomes more Machiavellian by the minute. Nucky also joins forces with Arnold Rothstein (Michael Stuhlbarg), while Jimmy aligns with Al Capone (Stephen Graham) and Lucky Luciano (Vincent Piazza). Of course, it wouldn't be a gangster epic without casualties, and several men give in to their darker impulses, resulting in some spectacularly bloody business--including the murder of a major character. Also, heroin enters the picture towards the end of the 12-episode arc and seems likely to play a bigger, more destructive role in the next season.\", '--Kathleen C. Fennessy']\n{'Genre': 'Drama/Television, Drama', 'Format': 'Multiple Formats, Color, AC-3, Box set, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Contributor': 'Steve Buscemi, Michael Pitt, William Hill', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.32 Ounces', 'Item model number': '133593', 'Media Format': 'Multiple Formats, Color, AC-3, Box set, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Run time': '12 hours', 'Release date': 'August 28, 2012', 'Actors': 'Steve Buscemi, Michael Pitt, William Hill', 'Subtitles': 'English, French, Spanish', 'Studio': 'HBO Studios', 'Number of discs': '5'}\nWas not sure about this boxed set then I ordered it, but gave it a try anyway.  It was interesting from the get-go and pulled you in and kept you watching till the last disc!  Gets you going with some love/hate/pity characters and overall is a great break from the lack luster offerings currently on the television.  Great entertainment on a cold winter night when nothing else is happening...make some popcorn and settle in, I think you will be hooked!\nEntertaining\nSharpe's Rifles Collection Set [DVD]\nSean Bean  (Actor),     Assumpta Serna  (Actor),     Tom Clegg  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['\"Compelling viewing for adventure lovers.\" - The Daily Mail', 'Acclaimed actor', 'Sean Bean', '(', 'The Island, The Lord of the Rings', ') stars in this action-packed series set in the midst of the desperate missions and battles of the Napoleonic Wars. Adapted from', \"Bernard Cornwell's\", \"bestselling novels, Bean portrays maverick British officer Richard Sharpe who rises through the ranks of Wellington's army by his own daring deeds and ambition. Fast-moving, hard-hitting adventure,\", 'Sharpe', 'brings to the screen all the danger, romance and sheer spectacle of one of the bloodiest periods in English warfare.', 'Includes:', \"Sharpe's Rifles\", '/', \"Sharpe's Eagle\", '/', \"Sharpe's Company\", '/', \"Sharpe's Enemy\", '/', \"Sharpe's Honour\", 'approx. 8 hrs. col.']\n{'Genre': 'Romance, Action & Adventure', 'Format': 'Box set, Color, NTSC, DVD', 'Contributor': \"Assumpta Serna, Lyndon Davies, Jason Salkey, Julian Fellowes, Sean Bean, David Troughton, Michael Mears, Simn Andreu, Paul Trussell, Brian Cox, Bernard Cornwell, Daragh O'Malley, Tom Clegg, John Tams, Eoghan HarrisAssumpta Serna, Lyndon Davies, Jason Salkey, Julian Fellowes, Sean Bean, David Troughton, Michael Mears, Simn Andreu, Paul Trussell, Brian Cox, Bernard Cornwell, Daragh O'Malley, Tom Clegg, John Tams, Eoghan Harris  See more\", 'Language': 'Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.56 x 5.35 x 0.98 inches; 7.72 Ounces', 'Director': 'Tom Clegg', 'Media Format': 'Box set, Color, NTSC, DVD', 'Run time': '8 hours and 20 minutes', 'Release date': 'November 1, 2005', 'Actors': \"Sean Bean, Assumpta Serna, Brian Cox, Daragh O'Malley, David Troughton\", 'Studio': 'BFS Entertainment', 'Writers': 'Bernard Cornwell, Eoghan Harris', 'Number of discs': '5'}\nYes, I bought into the Sharpes craze and ordered several seasons of this series.  Having read the other reviews I thought it might be interesting and fun to watch.  I don't understand the 'Sharpes Fever' that seems to be going around.  The series is, unfortunately, quite hokey in my humble opinion.  The acting left something to be desired, and if your desire is to simply watch some attractive folks on the tv screen and you are not concerned with the hokey plots or poor acting this should suffice nicely.  Yes, I know it is an older series and the standards were different then from now, but hokey is hokey there is no getting around it.  I do enjoy the more vintage series shows, but this is simply not one of them.  Still have not finished the set and probably won't, just uninspired all around.\nSo So\nLark Rise to Candleford: Season 1\nHallinan, Olivia  (Actor),     Sawalha, Julia  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, Drama\n['Product Description', 'The BBC drama series adapted from Mary Gaskells classic novels of small town gossip, secrets and romance. 1842. Cranford, a market town in the North West of England, is a place governed by etiquette, custom and above all, an intricate network of ladies. It seems that life has always been conducted according to their social rules, but Cranford is on the cusp of change…', ']]>', 'Amazon.com', \"The BBC's costume drama juggernaut struck gold once more when it decided to tackle the work of Flora Thompson. And in adapting her books in the form of the television production\", 'Lark Rise to Candleford', ', it has brought another compelling piece of drama to the screen.', 'Lark Rise to Candleford', \"is set at the end of the 19th century, and it follows the story of two communities in the midst of a developing Oxfordshire. One is a fast-growing market town, the other a sleepier, quieter place that's holding more onto the past. Centered on Laura, the eldest daughter in the Timmins house, as she leaves the quieter life for work in the market town, the stage is then set for a quality drama series.\", \"There's a lot to enjoy in the 10 episodes. The cast, for instance, is simply terrific, with Julia Sawalha, Dawn French, and Olivia Hallinan rightly taking plaudits. And the journey of their characters, along with those of the strong supporting cast, is simply wonderful television. Mixing in humor, drama and the production values we seem to take for granted from the BBC,\", 'Lark Rise to Candleford', \"is really quite a treat. And what's more, it's proof positive that when it comes to television period drama, there really isn't anyone doing it better. Super stuff.\", '--Jon Foster']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Smith, Liz, Sawalha, Julia, French, Dawn, Coyle, Brendan, Hallinan, Olivia', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 49 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Hallinan, Olivia, Sawalha, Julia, Smith, Liz, French, Dawn, Coyle, Brendan', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '4'}\nI ordered Season One of Lark Rise to fill some time while I waited for the fourth season of Downton Abby.  I did notice that Mr. Bates from Downton Abby plays the father in Lark Rise, so I gave it a try.  It is certainly not Downton, but it never claimed to be.  Personally I found it to be something near to the British version of \"Little House on the Prairie\" and I can't say I was impressed at all.  The story line is sweet, but I was expecting something a bit more complex and Lark Rise just does not have it.  Glad I just ordered season one, and not the entire series, as I likely will not even finish season one, but give it to my grandkids to watch.  Cute and sweet, but just not the captivating story line I was hoping to find.\nRather Lacking\nLINCOLN\nDaniel Day-Lewis  (Actor),     Sally Field  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', \"From DreamWorks, Steven Spielberg directs two-time Academy Award(R) winner Daniel Day-Lewis (Best Actor, THERE WILL BE BLOOD, 2007, and MY LEFT FOOT, 1989) in LINCOLN -- with an all-star ensemble cast including Sally Field, Tommy Lee Jones and Joseph Gordon-Levitt. This inspiring and revealing drama focuses on the 16th President's tumultuous final four months in office as this visionary leader pursues a course of action to end the Civil War, unite the country and abolish slavery. Complete with never-before-seen footage featuring Steven Spielberg and the cast, who take you deep inside the making of the movie, LINCOLN sheds light on a man of moral courage and fierce determination.\", 'Amazon.com', 'View larger', 'View larger', 'View larger', 'View larger As with the great John Ford (', 'Young Mr. Lincoln', \") before him, it would be out of character for Steven Spielberg to construct a conventional, cradle-to-grave portrait of a historical figure. In drawing from Doris Kearns Goodwin's\", 'Team of Rivals', \", the director instead depicts a career-defining moment in the career of Abraham Lincoln (an uncharacteristically restrained Daniel Day-Lewis). With the Civil War raging, and the death toll rising, the president focuses his energies on passage of the 13th Amendment. Even those sympathetic to the cause question his timing, but Lincoln doesn't see the two issues as separate, and the situation turns personal when his son, Robert (Joseph Gordon-Levitt), chooses to enlist rather than to study law. While still mourning the loss of one son, Mary (Sally Field) can't bear to lose another. Playwright Tony Kushner, who adapted the screenplay, takes a page from the procedural handbook in tracing Lincoln's steps to win over enough representatives to abolish slavery, while simultaneously bringing a larger-than-life leader down to a more manageable size. In his stooped-shoulder slouch and Columbo-like speech, Day-Lewis succeeds so admirably that the more outspoken characters, like congressman Thaddeus Stevens (Tommy Lee Jones) and lobbyist W.N. Bilbo (James Spader), threaten to steal the spotlight whenever they enter the scene, but the levity of their performances provides respite from the complicated strategizing and carnage-strewn battlefields. If\", 'Lincoln', \"doesn't thrill like the Kushner-penned\", 'Munich', \", there's never a dull moment--though it would take a second viewing to catch all the political nuances.\", '--Kathleen C. Fennessy', 'Related Products', 'Team of Rivals', 'Lincoln', 'Soundtrack', 'A Steven Spielberg Film: Lincoln: A Cinematic and Historical Companion']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Daniel Day-Lewis, Sally Field, Hal Holbrook, James Spader, David Strathairn, Steven Spielberg, Joseph Gordon-Levitt, Tommy Lee JonesDaniel Day-Lewis, Sally Field, Hal Holbrook, James Spader, David Strathairn, Steven Spielberg, Joseph Gordon-Levitt, Tommy Lee Jones  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'MFR786936830330#VG', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'March 26, 2013', 'Actors': 'Daniel Day-Lewis, Sally Field, David Strathairn, Joseph Gordon-Levitt, James Spader', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nBoy, this movie was a huge disappointment.  I can't say for sure what I was expecting, but this was not it.  The movie consisted of long and sometimes painfully drawn out dialogue and little action.  The movie revolved entirely around the passage of the 13th Amendment as a means to end the war, or at least bring the South to the bargaining table.  What it did, for me, was cast Washington in a light not much different than that of today with the bribes, deals and rangling going on for the advancement of one side's agenda.  If they thought to portray Lincoln as a hero, they instead cast him as no better than the dishonest congress he dealt with to gain passage of the bill.  I should have expected no more from Hollywood, but for some odd reason I did.  Overall a huge disappointment and a movie I would not recommend unless you go into it knowing in advance that Washington is crooked as all get out and Honest Abe was not so honest and entirely void ethics.  If that is what you want to see for entertainment, then I would recommend you simply watch the nightly news.\nNot So Impressed\nUpstairs, Downstairs Season 2 (2012)\nKeeley Hawes  (Actor),     Ed Stoppard  (Actor),     Anthony Byrne  (Director),     Marc Jobst  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'Upstairs, Downstairs Season 2 (2012)', 'The sumptuous new production Upstairs Downstairs, one of the most beloved television series of all time returns for a second season! Now a well established and thriving household in the heart of London, life in Eaton Place has moved on; Lady Agnes and Sir Hallam’s family is complete with the addition of two small children and London has settled into an uneasy peace with the apparent aversion of war. Yet below the surface of a well-run household, both upstairs and downstairs are harboring life-changing secrets. As romance, heartbreak and revelations engulf the household; its inhabitants discover that the real threat to 165 Eaton Place is much closer to home.', ']]>', 'Amazon.com', 'Decades before ITV launched', 'Downton Abbey', ', the BBC created a sensation with', 'Upstairs Downstairs', ', which revived interest in the British manor house. In 2010, the series came back to life with a new cast--plus holdover Miss Buck (co-creator Jean Marsh)--centering on Sir Hallam Holland (Ed Stoppard), a foreign-service diplomat, and his wife, Lady Agnes (', 'MI-5', \"'s Keeley Hawes). In season two, which takes place in 1938, World War II darkens their doorstep as they welcome three new arrivals to 165 Eaton Place: Beryl (Laura Haddock), a nursery maid with ambition; Hallam's aunt, Blanche (Alex Kingston), an archeologist with a secret; and Caspar Landry (Michael Landes), an American entrepreneur with an eye for Agnes, who finds the attention flattering--and it isn't as if Hallam doesn't have an admirer of his own. Chauffeur Spargo (Neil Jackson), a former boxer who once tangled with Agnes's bad-girl sister, Persephone (Claire Foy), also takes an interest in Beryl, but she proves harder to win over.\", \"War proceeds to affect them all differently: Persie, a Nazi sympathizer, returns from Germany with a new dilemma, while servants Mr. Amanjit (Art Malick) and Mrs. Thackeray (Anne Reid) condemn the pacifist beliefs of Pritchard (Adrian Scarborough), which will cause him further repercussions later (Ami Metcalf and Nico Mirallegro are also good value as the youngest staffers). In an ill-advised move into docudrama territory, the Hollands entertain Ambassador Joseph Kennedy and his son John, but such missteps are rare. As the season unwinds, the prim and proper Pritchard becomes more sympathetic in contrast with Sir Hallam, whose lack of empathy for his wife and employees makes him one of the year's more hissable villains. Sadly, the BBC did not renew this promising series, so audiences may never find out how the Holland household weathered the war.\", '--Kathleen C. Fennessy']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Brendan Maher, Marc Jobst, Keeley Hawes, Anne Reid, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anthony ByrneBrendan Maher, Marc Jobst, Keeley Hawes, Anne Reid, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anthony Byrne  See more', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'unknown', 'Director': 'Anthony Byrne, Marc Jobst, Brendan Maher', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours', 'Release date': 'October 23, 2012', 'Actors': 'Keeley Hawes, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anne Reid', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nPurchased both seasons of this continuing story of '165' while I am waiting for the next season of Downton Abby.  I have never seen the original series so I was not certain if jumping in now would be confusing, but it is not, the story does a nice job of looping back to explain any references to the original series making it easy on viewers like me.  I cannot compare this series to the original, but that might be a good thing, allowing this series to stand on its own merits.  The characters are easy to warm up to, and the story line moves along at a nice pace.  This is proving to be a nice filler and I am going to be sorry to see it end so quickly.  If you are looking for some enjoyable viewing similar to Downton then you will most likely find this series fits the bill nicely.\nQuite Good\nUpstairs, Downstairs\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', \"One of the most loved television series of all time is brought back to life with a fresh cast and sumptuous production values. It's 1936, and six years since parlormaid Rose left 165 Eaton Place, fate brings her back, as housekeeper to its new owners: Sir Hallam and his wife Lady Agnes, and Maud, Lady Holland, his mother. Rose soon finds she has her work cut out as she recruits a new 'downstairs' family to help run the elegance and finery of the 'upstairs' world. Both upstairs and downstairs, it soon becomes apparent there lies a labyrinth of secrets, lies and scandal. Set against the historical backdrop of a Britain with a new King, with sexual, social and political tensions, this new series provides an evolving take on the master-servant relationship.\", 'Amazon.com', 'Remade from the hit 1970s serial, this new version of', 'Upstairs, Downstairs', ', condensed into three hour-long episodes, creates for a modern eye a vision of what 1936 in England must have looked like. That is, if you were royalty, and ran a fantastic mansion at 165 Eaton Place, in one of London\\'s poshest neighborhoods. This show, as indicated in its title, revels in its overall ability to convey life as it unfolds upstairs, among the elite, and downstairs, among those who work tirelessly to keep the palace running. From the first episode, \"The Fledgling,\" the plot is placed politically, socially, and romantically as newlyweds Sir Hallam Holland (Ed Stoppard) and Lady Agnes (Keeley Hawes) decide to sweep the cobwebs out of the old family haunt in favor of modernization. While mundane house dramas unfurl, increasing tenfold once Sir Hallam\\'s nosy, old-fashioned mother, Maud (Eileen Atkins), decides that she and her pet monkey will be moving in, larger political dramas pepper the personal landscape. For example, in \"The Fledgling,\" as well as the next episodes, \"The Ladybird\" and \"The Cuckoo,\" Agnes\\'s sister, Lady Persephone (Claire Foy), is increasingly misled by the newly formed fascist party, and mounting tensions between Jewish household members and Persie\\'s ilk, including German official Ribbentrop (Edward Baker-Duly), loom large. As would be expected in this royal tale, much of the plot comprises Agnes\\'s ability to bear children and the political expectations Sir Hallam must meet even when morally conflicted.', \"The most winning aspect of this miniseries is in its display of what the servants attend throughout; their challenges seem equally as difficult as the challenges presented in tandem upstairs. When Agnes promotes ex-housekeeper Rose Buck (Jean Marsh) to hire and manage the house crew, Rose rises to the occasion and commands many interesting scenes in which she hires, fires, and coaches team members like the butler, Pritchard (Adrian Scarborough), head chef Mrs. Thackeray (Anne Reid), young footman Johnny (Nico Mirallegro), and maid Ivy (Ellie Kendrick). Lavish scenes showing preparation for parties, plus those in which the servants simply keep up with daily tasks, may shock those who are not familiar with formal etiquette from the past. Amanjit (Art Malik), Maud's secretary who lives upstairs separate from the rest of the servants, serves as a character who straddles both worlds, offering us glimpses into a man who can relate to both classes. While ultimately modern change is afoot in the Holland household, it is slow moving, and viewers will enjoy watching it come incrementally, through refined displays. --\", 'Trinie Dalton']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DE177642D', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '3 hours', 'Release date': 'April 26, 2011', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nPurchased both seasons of this continuing story of '165' while I am waiting for the next season of Downton Abby.  I have never seen the original series so I was not certain if jumping in now would be confusing, but it is not, the story does a nice job of looping back to explain any references to the original series making it easy on viewers like me.  I cannot compare this series to the original, but that might be a good thing, allowing this series to stand on its own merits.  The characters are easy to warm up to, and the story line moves along at a nice pace.  This is proving to be a nice filler and I am going to be sorry to see it end so quickly.  If you are looking for some enjoyable viewing similar to Downton then you will most likely find this series fits the bill nicely.\nQuite Good\nNorth and South (Dbl DVD) (BBC)\nDaniela Denby-ashe  (Actor),     Richard Armitage  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'North and South (Dbl DVD) (BBC)', 'As the daughter of a middle-class parson, Margaret Hale has enjoyed a privileged upbringing in rural southern England. When her father uproots the family to take work in the northern mill town of Milton, Margaret is shocked by the dirt, the noise and the gruffness of the people, but she reserves her highest contempt for the charismatic mill-owner John Thornton.', ']]>', 'Amazon.com', 'North & South', \"is a splendid, four-hour adaptation of Elizabeth Gaskell's 19th century novel about an unlikely, and somewhat star-crossed, love between a middle-class young woman from England's cultivated south and an intemperate if misunderstood industrialist in a hardscrabble, northern city. Daniela Denby-Ashe plays Margaret Hale, forthright and strong-willed daughter of a former vicar (Tim Pigott-Smith) who relocates his family from a pastoral village outside London to unforgiving, largely illiterate Milton, a factory town where John Thornton (Richard Armitage) and his mother (Sinead Cusack), survivors of poverty, rule their cotton mill with an iron hand. Thornton befriends Margaret's father but incurs her wrath for his severity with his workers. What she doesn't notice is Thornton's core sense of responsibility for his employees' welfare. On the other hand, he misinterprets some of Margaret's own actions and intentions. Equally stubborn, the two drag out their obvious attraction over many painful months and events.\", 'North & South', \"'s two leads are both very good, though Armitage's brooding, penetrating performance may very well be considered a classic one day. There are other wonders in the cast: Cusack and Pigott-Smith are superb, and Brendan Coyle is memorable as a firebrand union organizer who ultimately becomes an ally to a softening Thornton. The miniseries script by Sandy Welch is a persuasive mix of historical context and character study. Brian Percival's direction is full of moments that linger in the imagination, such as the winter-dream look of a busy cotton mill, with thousands of snowy fibers floating in the air.\", '--Tom Keogh']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Sinead Cusack, Elizabeth Gaskell, Daniela Denby-ashe, Richard Armitage, Tim Pigott-smith', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '794051245328', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '3 hours and 53 minutes', 'Release date': 'May 16, 2006', 'Actors': 'Daniela Denby-ashe, Richard Armitage, Sinead Cusack, Tim Pigott-smith', 'Subtitles': 'English', 'Studio': 'BBC Video', 'Writers': 'Elizabeth Gaskell', 'Number of discs': '2'}\nOnce again, I purchased this DVD while waiting for my next Downton Abby fix.  It is only a short series but well worth viewing.  The story line moved along nicely, the characters were well done and I found it engaging.  Not a complicated or involved drama, but still it managed to keep me captivated.  Sorry that it was not longer.  I had also purchased the &#34;Lark Rise&#34; series and did not finish that as it was too much like watching the British version of Little House on the Prairie, but North & South had a more adult story line that I found entertaining.  If you are looking for some light, but enjoyable summer viewing while you wait for the Downton saga to continue, give North & South a try, I believe you will be pleased.\nGood Viewing\nUpstairs Downstairs: Series One, 40th Anniversary Edition\nJackson, Gordon  (Actor),     Langton, David  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['\"Charmingly seductive\" --The New York Times', '6+ hours of new bonus material', 'Iconic British series seen on Masterpiece Theatre and A&E', 'Upstairs: the wealthy, aristocratic Bellamys. Downstairs: their loyal and lively servants. For nearly 30 years, they share a fashionable townhouse at 165 Eaton Place in London’s posh Belgravia neighborhood, surviving social change, political upheaval, scandals, and the horrors of the First World War.', 'Set between 1903 and 1909, Series One introduces Sir Richard Bellamy and his elegant wife, Marjorie, who reside upstairs with their dissolute son, James, and headstrong daughter, Elizabeth. Living and working downstairs are Hudson, the proper butler; Mrs. Bridges, the garrulous cook; the calm and watchful maid Rose; and many more. In this Emmy® winner for outstanding drama series, love blooms, tragedy strikes, scandals are avoided, and wedding bells sound.', 'Starring Jean Marsh (Agatha Christie’s The Pale Horse), David Langton (The Spoils of War), Simon Williams (Sword of Honour), Nicola Pagett (A Bit of a Do), Gordon Jackson (The Professionals), Angela Baddeley (Martin Chuzzlewit), Christopher Beeny (Last of the Summer Wine), and Pauline Collins (Shirley Valentine).', 'color/b&w (episodes 2–5 & 7)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Black & White, Color, NTSC', 'Contributor': 'Jackson, Gordon, Thomasin, Jenny, Baddeley, Angela, Marsh, Jean, Beeny, Christopher, Langton, David', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': 'AMP8630', 'Media Format': 'Multiple Formats, Box set, Black & White, Color, NTSC', 'Release date': 'March 29, 2011', 'Actors': 'Jackson, Gordon, Langton, David, Marsh, Jean, Baddeley, Angela, Beeny, Christopher', 'Studio': 'ACORN MEDIA', 'Number of discs': '4'}\nOkay, I am a Downton Abby fan - admitted.  I have also enjoyed the modern remake of Upstairs Downstairs and enjoyed it very much.  So, I thought I would venture back in time and watch the original inspiration for the remake.  Oh it was painful to say the least!  Yes, it is an older creation, but I was not quite expecting the poor acting that I encountered.  I tried to give this every chance to redeem itself, but each episode just seemed to get longer and the acting worse.  If you can suffer the flat acting it might be possible to appreciate this series for the vintage piece that it is - I was not able to do that and I returned it to Amazon on their Buy-Back program because I knew that I would never finish watching it.\nNot that Wonderful",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Cowboys & Outlaws\nReview Date: 2011/12/09\nStore: Cowboys & Outlaws  (Actor),     History  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['They were the quintessential American heroes: the embodiment of rugged individualism and independence. For a century and half, cowboys ruled the frontier, settling the American West and carving their way into American mythology forever.A powder keg of history, the American Frontier was a period of conquest, war and money. In this short era, men and women endured the Buffalo Hunters Wars, range wars, Indian Wars, and the Spanish-American War. For most, it was a time of incredible stress and hardship. But for a few extraordinary men, it was a time of unbelievable opportunity. Cowboys brought six million steers from the southernmost tip of Texas along cattle trails to railroad heads, and settled the West, solidifying their stature as heroes whose strength and individuality made them the ultimate icons of their time.Discover the legendary qualities of these amazing men in this visually stunning series from HISTORYTM. Using recovered letters, journals and books, as well as archaeological and forensic evidence, COWBOYS & OUTLAWS focuses on the true tales and heroes of the American West.']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Audio Description': 'English', 'Item model number': '1775', 'Director': 'History', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 42 minutes', 'Release date': 'January 26, 2010', 'Actors': 'Cowboys & Outlaws', 'Language': 'Unqualified', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Purchased this as a gift for my Dad who is a great cowboy movie fan.  He was thrilled and enjoyed it greatly.  It arrived quickly and was nicely boxed.\nReview Title: Wonderful!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Boardwalk Empire: Season 2\nReview Date: 2012/11/26\nStore: Steve Buscemi  (Actor),     Michael Pitt  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Atlantic City, 1921. In a city whose fortunes have soared in the wake of Prohibition, Nucky Thompson is paying a steep price for wielding ultimate power in “the world’s playground.” Though the 1920 election is over, Nucky finds himself the target of a federal investigation for vote tampering – and an insurrection by those he counted among his closest allies. Steve Buscemi stars in the hit drama series that charts the continued rise of organized crime at the dawn of the Prohibition.', 'Amazon.com', \"With every character on HBO's\", 'Boardwalk Empire', 'leading a double life, season two is about making changes or facing the consequences. The stylish series also digs deeper into the futility of Prohibition, much as', 'The Wire', \"tackled the War on Drugs. The central figure, Atlantic City treasurer Nucky Thompson (Steve Buscemi), aims to please all of his constituents, but loses several powerful supporters after bootlegger Chalky White (Michael Kenneth Williams) kills a Klansman. Estranged from his brother, Eli (Shea Whigham), and former assistant, Jimmy (Michael Pitt), Nucky and his common-law wife (Kelly Macdonald) become more of a team. If domesticity suits Nucky, FBI agent Van Alden (Michael Shannon) looks askance at drinkers and nonbelievers, even as he holes up with Nucky's pregnant ex-girlfriend (Paz de la Huerta, the weakest link in an otherwise strong cast), while his wife remains in the Midwest. With enemies like the Commodore (Dabney Coleman) trying to remove him from office, Nucky hires Irish Lothario Slater (Charlie Cox), who helps to keep the booze flowing, meting out the occasional head-butt as necessary. Other new arrivals include a brutal butcher (William Forsythe) and a persistent federal prosecutor (Julianne Nicholson), who wields more power than the other wives and girlfriends combined, though Jimmy's mother (Gretchen Mol) becomes more Machiavellian by the minute. Nucky also joins forces with Arnold Rothstein (Michael Stuhlbarg), while Jimmy aligns with Al Capone (Stephen Graham) and Lucky Luciano (Vincent Piazza). Of course, it wouldn't be a gangster epic without casualties, and several men give in to their darker impulses, resulting in some spectacularly bloody business--including the murder of a major character. Also, heroin enters the picture towards the end of the 12-episode arc and seems likely to play a bigger, more destructive role in the next season.\", '--Kathleen C. Fennessy']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Drama', 'Format': 'Multiple Formats, Color, AC-3, Box set, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Contributor': 'Steve Buscemi, Michael Pitt, William Hill', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.32 Ounces', 'Item model number': '133593', 'Media Format': 'Multiple Formats, Color, AC-3, Box set, NTSC, Subtitled, DTS Surround Sound, Widescreen', 'Run time': '12 hours', 'Release date': 'August 28, 2012', 'Actors': 'Steve Buscemi, Michael Pitt, William Hill', 'Subtitles': 'English, French, Spanish', 'Studio': 'HBO Studios', 'Number of discs': '5'}\nReview Text: Was not sure about this boxed set then I ordered it, but gave it a try anyway.  It was interesting from the get-go and pulled you in and kept you watching till the last disc!  Gets you going with some love/hate/pity characters and overall is a great break from the lack luster offerings currently on the television.  Great entertainment on a cold winter night when nothing else is happening...make some popcorn and settle in, I think you will be hooked!\nReview Title: Entertaining\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sharpe's Rifles Collection Set [DVD]\nReview Date: 2013/03/21\nStore: Sean Bean  (Actor),     Assumpta Serna  (Actor),     Tom Clegg  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['\"Compelling viewing for adventure lovers.\" - The Daily Mail', 'Acclaimed actor', 'Sean Bean', '(', 'The Island, The Lord of the Rings', ') stars in this action-packed series set in the midst of the desperate missions and battles of the Napoleonic Wars. Adapted from', \"Bernard Cornwell's\", \"bestselling novels, Bean portrays maverick British officer Richard Sharpe who rises through the ranks of Wellington's army by his own daring deeds and ambition. Fast-moving, hard-hitting adventure,\", 'Sharpe', 'brings to the screen all the danger, romance and sheer spectacle of one of the bloodiest periods in English warfare.', 'Includes:', \"Sharpe's Rifles\", '/', \"Sharpe's Eagle\", '/', \"Sharpe's Company\", '/', \"Sharpe's Enemy\", '/', \"Sharpe's Honour\", 'approx. 8 hrs. col.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Romance, Action & Adventure', 'Format': 'Box set, Color, NTSC, DVD', 'Contributor': \"Assumpta Serna, Lyndon Davies, Jason Salkey, Julian Fellowes, Sean Bean, David Troughton, Michael Mears, Simn Andreu, Paul Trussell, Brian Cox, Bernard Cornwell, Daragh O'Malley, Tom Clegg, John Tams, Eoghan HarrisAssumpta Serna, Lyndon Davies, Jason Salkey, Julian Fellowes, Sean Bean, David Troughton, Michael Mears, Simn Andreu, Paul Trussell, Brian Cox, Bernard Cornwell, Daragh O'Malley, Tom Clegg, John Tams, Eoghan Harris  See more\", 'Language': 'Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.56 x 5.35 x 0.98 inches; 7.72 Ounces', 'Director': 'Tom Clegg', 'Media Format': 'Box set, Color, NTSC, DVD', 'Run time': '8 hours and 20 minutes', 'Release date': 'November 1, 2005', 'Actors': \"Sean Bean, Assumpta Serna, Brian Cox, Daragh O'Malley, David Troughton\", 'Studio': 'BFS Entertainment', 'Writers': 'Bernard Cornwell, Eoghan Harris', 'Number of discs': '5'}\nReview Text: Yes, I bought into the Sharpes craze and ordered several seasons of this series.  Having read the other reviews I thought it might be interesting and fun to watch.  I don't understand the 'Sharpes Fever' that seems to be going around.  The series is, unfortunately, quite hokey in my humble opinion.  The acting left something to be desired, and if your desire is to simply watch some attractive folks on the tv screen and you are not concerned with the hokey plots or poor acting this should suffice nicely.  Yes, I know it is an older series and the standards were different then from now, but hokey is hokey there is no getting around it.  I do enjoy the more vintage series shows, but this is simply not one of them.  Still have not finished the set and probably won't, just uninspired all around.\nReview Title: So So\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lark Rise to Candleford: Season 1\nReview Date: 2013/03/26\nStore: Hallinan, Olivia  (Actor),     Sawalha, Julia  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, Drama\nProduct Description: ['Product Description', 'The BBC drama series adapted from Mary Gaskells classic novels of small town gossip, secrets and romance. 1842. Cranford, a market town in the North West of England, is a place governed by etiquette, custom and above all, an intricate network of ladies. It seems that life has always been conducted according to their social rules, but Cranford is on the cusp of change…', ']]>', 'Amazon.com', \"The BBC's costume drama juggernaut struck gold once more when it decided to tackle the work of Flora Thompson. And in adapting her books in the form of the television production\", 'Lark Rise to Candleford', ', it has brought another compelling piece of drama to the screen.', 'Lark Rise to Candleford', \"is set at the end of the 19th century, and it follows the story of two communities in the midst of a developing Oxfordshire. One is a fast-growing market town, the other a sleepier, quieter place that's holding more onto the past. Centered on Laura, the eldest daughter in the Timmins house, as she leaves the quieter life for work in the market town, the stage is then set for a quality drama series.\", \"There's a lot to enjoy in the 10 episodes. The cast, for instance, is simply terrific, with Julia Sawalha, Dawn French, and Olivia Hallinan rightly taking plaudits. And the journey of their characters, along with those of the strong supporting cast, is simply wonderful television. Mixing in humor, drama and the production values we seem to take for granted from the BBC,\", 'Lark Rise to Candleford', \"is really quite a treat. And what's more, it's proof positive that when it comes to television period drama, there really isn't anyone doing it better. Super stuff.\", '--Jon Foster']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Smith, Liz, Sawalha, Julia, French, Dawn, Coyle, Brendan, Hallinan, Olivia', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 49 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Hallinan, Olivia, Sawalha, Julia, Smith, Liz, French, Dawn, Coyle, Brendan', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '4'}\nReview Text: I ordered Season One of Lark Rise to fill some time while I waited for the fourth season of Downton Abby.  I did notice that Mr. Bates from Downton Abby plays the father in Lark Rise, so I gave it a try.  It is certainly not Downton, but it never claimed to be.  Personally I found it to be something near to the British version of \"Little House on the Prairie\" and I can't say I was impressed at all.  The story line is sweet, but I was expecting something a bit more complex and Lark Rise just does not have it.  Glad I just ordered season one, and not the entire series, as I likely will not even finish season one, but give it to my grandkids to watch.  Cute and sweet, but just not the captivating story line I was hoping to find.\nReview Title: Rather Lacking\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LINCOLN\nReview Date: 2013/04/01\nStore: Daniel Day-Lewis  (Actor),     Sally Field  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', \"From DreamWorks, Steven Spielberg directs two-time Academy Award(R) winner Daniel Day-Lewis (Best Actor, THERE WILL BE BLOOD, 2007, and MY LEFT FOOT, 1989) in LINCOLN -- with an all-star ensemble cast including Sally Field, Tommy Lee Jones and Joseph Gordon-Levitt. This inspiring and revealing drama focuses on the 16th President's tumultuous final four months in office as this visionary leader pursues a course of action to end the Civil War, unite the country and abolish slavery. Complete with never-before-seen footage featuring Steven Spielberg and the cast, who take you deep inside the making of the movie, LINCOLN sheds light on a man of moral courage and fierce determination.\", 'Amazon.com', 'View larger', 'View larger', 'View larger', 'View larger As with the great John Ford (', 'Young Mr. Lincoln', \") before him, it would be out of character for Steven Spielberg to construct a conventional, cradle-to-grave portrait of a historical figure. In drawing from Doris Kearns Goodwin's\", 'Team of Rivals', \", the director instead depicts a career-defining moment in the career of Abraham Lincoln (an uncharacteristically restrained Daniel Day-Lewis). With the Civil War raging, and the death toll rising, the president focuses his energies on passage of the 13th Amendment. Even those sympathetic to the cause question his timing, but Lincoln doesn't see the two issues as separate, and the situation turns personal when his son, Robert (Joseph Gordon-Levitt), chooses to enlist rather than to study law. While still mourning the loss of one son, Mary (Sally Field) can't bear to lose another. Playwright Tony Kushner, who adapted the screenplay, takes a page from the procedural handbook in tracing Lincoln's steps to win over enough representatives to abolish slavery, while simultaneously bringing a larger-than-life leader down to a more manageable size. In his stooped-shoulder slouch and Columbo-like speech, Day-Lewis succeeds so admirably that the more outspoken characters, like congressman Thaddeus Stevens (Tommy Lee Jones) and lobbyist W.N. Bilbo (James Spader), threaten to steal the spotlight whenever they enter the scene, but the levity of their performances provides respite from the complicated strategizing and carnage-strewn battlefields. If\", 'Lincoln', \"doesn't thrill like the Kushner-penned\", 'Munich', \", there's never a dull moment--though it would take a second viewing to catch all the political nuances.\", '--Kathleen C. Fennessy', 'Related Products', 'Team of Rivals', 'Lincoln', 'Soundtrack', 'A Steven Spielberg Film: Lincoln: A Cinematic and Historical Companion']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Daniel Day-Lewis, Sally Field, Hal Holbrook, James Spader, David Strathairn, Steven Spielberg, Joseph Gordon-Levitt, Tommy Lee JonesDaniel Day-Lewis, Sally Field, Hal Holbrook, James Spader, David Strathairn, Steven Spielberg, Joseph Gordon-Levitt, Tommy Lee Jones  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'MFR786936830330#VG', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'March 26, 2013', 'Actors': 'Daniel Day-Lewis, Sally Field, David Strathairn, Joseph Gordon-Levitt, James Spader', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Boy, this movie was a huge disappointment.  I can't say for sure what I was expecting, but this was not it.  The movie consisted of long and sometimes painfully drawn out dialogue and little action.  The movie revolved entirely around the passage of the 13th Amendment as a means to end the war, or at least bring the South to the bargaining table.  What it did, for me, was cast Washington in a light not much different than that of today with the bribes, deals and rangling going on for the advancement of one side's agenda.  If they thought to portray Lincoln as a hero, they instead cast him as no better than the dishonest congress he dealt with to gain passage of the bill.  I should have expected no more from Hollywood, but for some odd reason I did.  Overall a huge disappointment and a movie I would not recommend unless you go into it knowing in advance that Washington is crooked as all get out and Honest Abe was not so honest and entirely void ethics.  If that is what you want to see for entertainment, then I would recommend you simply watch the nightly news.\nReview Title: Not So Impressed\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Upstairs, Downstairs Season 2 (2012)\nReview Date: 2013/04/06\nStore: Keeley Hawes  (Actor),     Ed Stoppard  (Actor),     Anthony Byrne  (Director),     Marc Jobst  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', 'Upstairs, Downstairs Season 2 (2012)', 'The sumptuous new production Upstairs Downstairs, one of the most beloved television series of all time returns for a second season! Now a well established and thriving household in the heart of London, life in Eaton Place has moved on; Lady Agnes and Sir Hallam’s family is complete with the addition of two small children and London has settled into an uneasy peace with the apparent aversion of war. Yet below the surface of a well-run household, both upstairs and downstairs are harboring life-changing secrets. As romance, heartbreak and revelations engulf the household; its inhabitants discover that the real threat to 165 Eaton Place is much closer to home.', ']]>', 'Amazon.com', 'Decades before ITV launched', 'Downton Abbey', ', the BBC created a sensation with', 'Upstairs Downstairs', ', which revived interest in the British manor house. In 2010, the series came back to life with a new cast--plus holdover Miss Buck (co-creator Jean Marsh)--centering on Sir Hallam Holland (Ed Stoppard), a foreign-service diplomat, and his wife, Lady Agnes (', 'MI-5', \"'s Keeley Hawes). In season two, which takes place in 1938, World War II darkens their doorstep as they welcome three new arrivals to 165 Eaton Place: Beryl (Laura Haddock), a nursery maid with ambition; Hallam's aunt, Blanche (Alex Kingston), an archeologist with a secret; and Caspar Landry (Michael Landes), an American entrepreneur with an eye for Agnes, who finds the attention flattering--and it isn't as if Hallam doesn't have an admirer of his own. Chauffeur Spargo (Neil Jackson), a former boxer who once tangled with Agnes's bad-girl sister, Persephone (Claire Foy), also takes an interest in Beryl, but she proves harder to win over.\", \"War proceeds to affect them all differently: Persie, a Nazi sympathizer, returns from Germany with a new dilemma, while servants Mr. Amanjit (Art Malick) and Mrs. Thackeray (Anne Reid) condemn the pacifist beliefs of Pritchard (Adrian Scarborough), which will cause him further repercussions later (Ami Metcalf and Nico Mirallegro are also good value as the youngest staffers). In an ill-advised move into docudrama territory, the Hollands entertain Ambassador Joseph Kennedy and his son John, but such missteps are rare. As the season unwinds, the prim and proper Pritchard becomes more sympathetic in contrast with Sir Hallam, whose lack of empathy for his wife and employees makes him one of the year's more hissable villains. Sadly, the BBC did not renew this promising series, so audiences may never find out how the Holland household weathered the war.\", '--Kathleen C. Fennessy']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Brendan Maher, Marc Jobst, Keeley Hawes, Anne Reid, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anthony ByrneBrendan Maher, Marc Jobst, Keeley Hawes, Anne Reid, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anthony Byrne  See more', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'unknown', 'Director': 'Anthony Byrne, Marc Jobst, Brendan Maher', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours', 'Release date': 'October 23, 2012', 'Actors': 'Keeley Hawes, Ed Stoppard, Adrian Scarborough, Neil Jackson, Anne Reid', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReview Text: Purchased both seasons of this continuing story of '165' while I am waiting for the next season of Downton Abby.  I have never seen the original series so I was not certain if jumping in now would be confusing, but it is not, the story does a nice job of looping back to explain any references to the original series making it easy on viewers like me.  I cannot compare this series to the original, but that might be a good thing, allowing this series to stand on its own merits.  The characters are easy to warm up to, and the story line moves along at a nice pace.  This is proving to be a nice filler and I am going to be sorry to see it end so quickly.  If you are looking for some enjoyable viewing similar to Downton then you will most likely find this series fits the bill nicely.\nReview Title: Quite Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Upstairs, Downstairs\nReview Date: 2013/04/06\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', \"One of the most loved television series of all time is brought back to life with a fresh cast and sumptuous production values. It's 1936, and six years since parlormaid Rose left 165 Eaton Place, fate brings her back, as housekeeper to its new owners: Sir Hallam and his wife Lady Agnes, and Maud, Lady Holland, his mother. Rose soon finds she has her work cut out as she recruits a new 'downstairs' family to help run the elegance and finery of the 'upstairs' world. Both upstairs and downstairs, it soon becomes apparent there lies a labyrinth of secrets, lies and scandal. Set against the historical backdrop of a Britain with a new King, with sexual, social and political tensions, this new series provides an evolving take on the master-servant relationship.\", 'Amazon.com', 'Remade from the hit 1970s serial, this new version of', 'Upstairs, Downstairs', ', condensed into three hour-long episodes, creates for a modern eye a vision of what 1936 in England must have looked like. That is, if you were royalty, and ran a fantastic mansion at 165 Eaton Place, in one of London\\'s poshest neighborhoods. This show, as indicated in its title, revels in its overall ability to convey life as it unfolds upstairs, among the elite, and downstairs, among those who work tirelessly to keep the palace running. From the first episode, \"The Fledgling,\" the plot is placed politically, socially, and romantically as newlyweds Sir Hallam Holland (Ed Stoppard) and Lady Agnes (Keeley Hawes) decide to sweep the cobwebs out of the old family haunt in favor of modernization. While mundane house dramas unfurl, increasing tenfold once Sir Hallam\\'s nosy, old-fashioned mother, Maud (Eileen Atkins), decides that she and her pet monkey will be moving in, larger political dramas pepper the personal landscape. For example, in \"The Fledgling,\" as well as the next episodes, \"The Ladybird\" and \"The Cuckoo,\" Agnes\\'s sister, Lady Persephone (Claire Foy), is increasingly misled by the newly formed fascist party, and mounting tensions between Jewish household members and Persie\\'s ilk, including German official Ribbentrop (Edward Baker-Duly), loom large. As would be expected in this royal tale, much of the plot comprises Agnes\\'s ability to bear children and the political expectations Sir Hallam must meet even when morally conflicted.', \"The most winning aspect of this miniseries is in its display of what the servants attend throughout; their challenges seem equally as difficult as the challenges presented in tandem upstairs. When Agnes promotes ex-housekeeper Rose Buck (Jean Marsh) to hire and manage the house crew, Rose rises to the occasion and commands many interesting scenes in which she hires, fires, and coaches team members like the butler, Pritchard (Adrian Scarborough), head chef Mrs. Thackeray (Anne Reid), young footman Johnny (Nico Mirallegro), and maid Ivy (Ellie Kendrick). Lavish scenes showing preparation for parties, plus those in which the servants simply keep up with daily tasks, may shock those who are not familiar with formal etiquette from the past. Amanjit (Art Malik), Maud's secretary who lives upstairs separate from the rest of the servants, serves as a character who straddles both worlds, offering us glimpses into a man who can relate to both classes. While ultimately modern change is afoot in the Holland household, it is slow moving, and viewers will enjoy watching it come incrementally, through refined displays. --\", 'Trinie Dalton']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DE177642D', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '3 hours', 'Release date': 'April 26, 2011', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReview Text: Purchased both seasons of this continuing story of '165' while I am waiting for the next season of Downton Abby.  I have never seen the original series so I was not certain if jumping in now would be confusing, but it is not, the story does a nice job of looping back to explain any references to the original series making it easy on viewers like me.  I cannot compare this series to the original, but that might be a good thing, allowing this series to stand on its own merits.  The characters are easy to warm up to, and the story line moves along at a nice pace.  This is proving to be a nice filler and I am going to be sorry to see it end so quickly.  If you are looking for some enjoyable viewing similar to Downton then you will most likely find this series fits the bill nicely.\nReview Title: Quite Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: North and South (Dbl DVD) (BBC)\nReview Date: 2013/04/06\nStore: Daniela Denby-ashe  (Actor),     Richard Armitage  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'North and South (Dbl DVD) (BBC)', 'As the daughter of a middle-class parson, Margaret Hale has enjoyed a privileged upbringing in rural southern England. When her father uproots the family to take work in the northern mill town of Milton, Margaret is shocked by the dirt, the noise and the gruffness of the people, but she reserves her highest contempt for the charismatic mill-owner John Thornton.', ']]>', 'Amazon.com', 'North & South', \"is a splendid, four-hour adaptation of Elizabeth Gaskell's 19th century novel about an unlikely, and somewhat star-crossed, love between a middle-class young woman from England's cultivated south and an intemperate if misunderstood industrialist in a hardscrabble, northern city. Daniela Denby-Ashe plays Margaret Hale, forthright and strong-willed daughter of a former vicar (Tim Pigott-Smith) who relocates his family from a pastoral village outside London to unforgiving, largely illiterate Milton, a factory town where John Thornton (Richard Armitage) and his mother (Sinead Cusack), survivors of poverty, rule their cotton mill with an iron hand. Thornton befriends Margaret's father but incurs her wrath for his severity with his workers. What she doesn't notice is Thornton's core sense of responsibility for his employees' welfare. On the other hand, he misinterprets some of Margaret's own actions and intentions. Equally stubborn, the two drag out their obvious attraction over many painful months and events.\", 'North & South', \"'s two leads are both very good, though Armitage's brooding, penetrating performance may very well be considered a classic one day. There are other wonders in the cast: Cusack and Pigott-Smith are superb, and Brendan Coyle is memorable as a firebrand union organizer who ultimately becomes an ally to a softening Thornton. The miniseries script by Sandy Welch is a persuasive mix of historical context and character study. Brian Percival's direction is full of moments that linger in the imagination, such as the winter-dream look of a busy cotton mill, with thousands of snowy fibers floating in the air.\", '--Tom Keogh']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Sinead Cusack, Elizabeth Gaskell, Daniela Denby-ashe, Richard Armitage, Tim Pigott-smith', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '794051245328', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '3 hours and 53 minutes', 'Release date': 'May 16, 2006', 'Actors': 'Daniela Denby-ashe, Richard Armitage, Sinead Cusack, Tim Pigott-smith', 'Subtitles': 'English', 'Studio': 'BBC Video', 'Writers': 'Elizabeth Gaskell', 'Number of discs': '2'}\nReview Text: Once again, I purchased this DVD while waiting for my next Downton Abby fix.  It is only a short series but well worth viewing.  The story line moved along nicely, the characters were well done and I found it engaging.  Not a complicated or involved drama, but still it managed to keep me captivated.  Sorry that it was not longer.  I had also purchased the &#34;Lark Rise&#34; series and did not finish that as it was too much like watching the British version of Little House on the Prairie, but North & South had a more adult story line that I found entertaining.  If you are looking for some light, but enjoyable summer viewing while you wait for the Downton saga to continue, give North & South a try, I believe you will be pleased.\nReview Title: Good Viewing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Upstairs Downstairs: Series One, 40th Anniversary Edition\nReview Date: 2013/04/25\nStore: Jackson, Gordon  (Actor),     Langton, David  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: ['\"Charmingly seductive\" --The New York Times', '6+ hours of new bonus material', 'Iconic British series seen on Masterpiece Theatre and A&E', 'Upstairs: the wealthy, aristocratic Bellamys. Downstairs: their loyal and lively servants. For nearly 30 years, they share a fashionable townhouse at 165 Eaton Place in London’s posh Belgravia neighborhood, surviving social change, political upheaval, scandals, and the horrors of the First World War.', 'Set between 1903 and 1909, Series One introduces Sir Richard Bellamy and his elegant wife, Marjorie, who reside upstairs with their dissolute son, James, and headstrong daughter, Elizabeth. Living and working downstairs are Hudson, the proper butler; Mrs. Bridges, the garrulous cook; the calm and watchful maid Rose; and many more. In this Emmy® winner for outstanding drama series, love blooms, tragedy strikes, scandals are avoided, and wedding bells sound.', 'Starring Jean Marsh (Agatha Christie’s The Pale Horse), David Langton (The Spoils of War), Simon Williams (Sword of Honour), Nicola Pagett (A Bit of a Do), Gordon Jackson (The Professionals), Angela Baddeley (Martin Chuzzlewit), Christopher Beeny (Last of the Summer Wine), and Pauline Collins (Shirley Valentine).', 'color/b&w (episodes 2–5 & 7)']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Black & White, Color, NTSC', 'Contributor': 'Jackson, Gordon, Thomasin, Jenny, Baddeley, Angela, Marsh, Jean, Beeny, Christopher, Langton, David', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': 'AMP8630', 'Media Format': 'Multiple Formats, Box set, Black & White, Color, NTSC', 'Release date': 'March 29, 2011', 'Actors': 'Jackson, Gordon, Langton, David, Marsh, Jean, Baddeley, Angela, Beeny, Christopher', 'Studio': 'ACORN MEDIA', 'Number of discs': '4'}\nReview Text: Okay, I am a Downton Abby fan - admitted.  I have also enjoyed the modern remake of Upstairs Downstairs and enjoyed it very much.  So, I thought I would venture back in time and watch the original inspiration for the remake.  Oh it was painful to say the least!  Yes, it is an older creation, but I was not quite expecting the poor acting that I encountered.  I tried to give this every chance to redeem itself, but each episode just seemed to get longer and the acting worse.  If you can suffer the flat acting it might be possible to appreciate this series for the vintage piece that it is - I was not able to do that and I returned it to Amazon on their Buy-Back program because I knew that I would never finish watching it.\nReview Title: Not that Wonderful\nRating: 2.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual exhibits a strong preference for historical, dramatic narratives depicted in both film and television, particularly favoring the themes of rugged individualism, societal struggles, and moral dilemmas. Their ratings suggest a consistent appreciation for high-quality productions, with most purchases receiving scores of 4.5 or higher, indicating a preference for well-crafted storytelling. \n\nRepeated themes reveal a marked interest in American historical narratives (e.g., the cowboy era) and period dramas, particularly from the UK, showcasing a tendency towards character-driven plots that explore complex social dynamics (e.g., class relations and personal conflicts). A significant number of purchases are related to well-known BBC dramas and adaptations of classic literature, such as \"North and South\" and \"Lark Rise to Candleford,\" suggesting a proclivity for period pieces and romantic narratives set against a historical backdrop.\n\nQuality is prioritized over quantity, evidenced by mixed sentiments towards older productions perceived as \"hokey\" or poorly acted, suggesting a sensitivity to production values and character depth. Price sensitivity appears moderate, as the bought items range in formats and collections, hinting at a willingness to invest in comprehensive sets that promise extended viewing pleasure.\n\nOverall, the individual's shopping behavior points towards a deep appreciation for quality dramatic entertainment, particularly that which combines historical context with intricate storytelling and character development.",
  "target_interaction": {
    "rating": 2.0,
    "title": "Not So Wonderful",
    "text": "Okay, I am a Downton Abby fan - admitted.  I have also enjoyed the modern remake of Upstairs Downstairs and enjoyed it very much.  So, I thought I would venture back in time and watch the original inspiration for the remake.  Oh it was painful to say the least!  Yes, it is an older creation, but I was not quite expecting the poor acting that I encountered.  I tried to give this every chance to redeem itself, but each episode just seemed to get longer and the acting worse.  If you can suffer the flat acting it might be possible to appreciate this series for the vintage piece that it is - I was not able to do that and I returned it to Amazon on their Buy-Back program because I knew that I would never finish watching it.",
    "images": [],
    "asin": "B004H0ZHCU",
    "parent_asin": "B004H0ZHCU",
    "user_id": "AEJ7RCG7E2R6D6NBYLCO3REWGSGA",
    "timestamp": "2013-04-25 12:36:58",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Upstairs, Downstairs: Series Two",
    "average_rating": 4.4,
    "rating_number": 234,
    "features": [],
    "description": [
      "\"Great fun and marvelous television\" --The New York Times",
      "4+ hours of new bonus material",
      "Iconic British series seen on Masterpiece Theatre and A&E",
      "Upstairs: the wealthy, aristocratic Bellamys. Downstairs: their loyal and lively servants. For nearly 30 years, they share a fashionable townhouse at 165 Eaton Place in London’s posh Belgravia neighborhood, surviving social change, political upheaval, scandals, and the horrors of the First World War.",
      "Series Two follows the years 1908 to 1910. New bride Elizabeth is far from blissful, and James learns that he’s about to become a father. Appalled by their children’s antics, Lord and Lady Bellamy fight to save the family name. Downstairs, Sarah the maid causes trouble, and Thomas the chauffeur works his own devious angles. Finally, a royal visit marks the most famous episode of this Emmy®-winning season.",
      "Starring Jean Marsh (Agatha Christie’s The Pale Horse), David Langton (The Spoils of War), Rachel Gurney (The Portrait of a Lady), Simon Williams (Sword of Honour), Nicola Pagett (A Bit of a Do), Gordon Jackson (The Professionals), Angela Baddeley (Martin Chuzzlewit), John Alderton (Little Dorrit), Ian Ogilvy (Return of the Saint), and Pauline Collins (Shirley Valentine)."
    ],
    "price": 13.03,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51ZKirZfvwL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ZKirZfvwL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81Jm9asu51L._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Jackson, Gordon  (Actor),     Langton, David  (Actor)    Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "DVD",
      "Military & War"
    ],
    "details": {
      "Genre": "Military & War",
      "Format": "Box set, Color, NTSC, Multiple Formats",
      "Contributor": "Jackson, Gordon, Thomasin, Jenny, Baddeley, Angela, Marsh, Jean, Beeny, Christopher, Langton, David",
      "Language": "English (Dolby Digital 2.0 Mono)",
      "Number Of Discs": "4",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 0.01 Ounces",
      "Item model number": "UDFA420",
      "Media Format": "Box set, Color, NTSC, Multiple Formats",
      "Release date": "March 29, 2011",
      "Actors": "Jackson, Gordon, Langton, David, Marsh, Jean, Baddeley, Angela, Beeny, Christopher",
      "Studio": "ACORN MEDIA",
      "Number of discs": "4"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}