{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Creamily Short Blonde Wigs for White Women With Bangs Pixie Cut Blonde Short Wig Halloween Costume Wig…\nReview Date: 2022/11/12\nStore: Creamily\nAverage Rating: 2.3\nProduct Details: {'Item Dimensions LxWxH': '12 x 4 x 1 inches', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Creamily', 'Cartoon Character': 'Cartoon', 'Product Dimensions': '12 x 4 x 1 inches; 3.84 Ounces', 'Item model number': 'CRUSP13304'}\nReview Text: The only good thing I can say about the wig is the cap fit perfectly. The hair color is much darker than the photo. The hair is much shorter and not wispy. The texture is course like barbie doll hair.\nReview Title: Looks NOTHING like the photo\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Beauty HAO Eyebrow Tattoo Pen, Waterproof Natural Convenient Long-Lasting Eyebrow Pencil\nBeauty HAO\n{'Brand': 'Beauty HAO', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Skin Type': 'All', 'Package Information': 'Tube', 'Package Dimensions': '5.1 x 1 x 0.4 inches; 0.49 Ounces'}\nit arrived on time and I read the directions. simple. barely any product came out. I ended up washing it off and using my pencil.\nBEWARE\n613 lace front wig human hair 14inch Silky Straight 613 Frontal lace Wigs Glueless Pre Plucked 13x6 Lace Net 150% Density Bleached Knots 14In for black and white woman blonde human hair wigs\nHUAYI\n{'Material': 'Human Hair', 'Item Dimensions LxWxH': '27 x 7 x 0.5 inches', 'Hair Type': 'Straight', 'Brand': 'HUAYI', 'Product Dimensions': '27 x 7 x 0.5 inches; 12.03 Ounces'}\nIt arrived on time. The cap is very big. You can adjust the elastic straps but the cap has bumps from being so big.  The hair is brassy but toner would fix this. The hair gets very thin the longer it gets. I’m not thrilled.\nNot impressed\nBHF 30inch Long Drawstring Ponytail Extension Heat Resistant Synthetic Clip in Natural Wave Ponytail Hair Pieces For Women（MT27/613#）\nBHF\n{'Brand': 'BHF', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Installation Type': 'Clip-In', 'Package Dimensions': '8.2 x 5.3 x 1.3 inches; 5.29 Ounces'}\nI wore it twice and the curl had turned to frizz. Was soft and now feels like plastic once it frizzed.\nBeware\nHuman Hair Bun Blonde S\nHairro\n{'Package Dimensions': '8.03 x 5.35 x 0.55 inches; 2.82 Ounces'}\nRidiculously small. No hair. Just not big enough to look great. I returned.\nVery small\nDown Ponytail Extensions Binding 20\" Blonde\nHairro\n{'Package Dimensions': '12 x 8 x 0.5 inches; 4.8 Ounces', 'UPC': '792057030566'}\nThe ponytail arrived right on time. The color was brassy yellow but toned easily. The hair itself is soft but thin. I’m going to need to order a second one to make it full.\nSparse\nCreamily Short Blonde Wigs for White Women With Bangs Pixie Cut Blonde Short Wig Halloween Costume Wig…\nCreamily\n{'Item Dimensions LxWxH': '12 x 4 x 1 inches', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Creamily', 'Cartoon Character': 'Cartoon', 'Product Dimensions': '12 x 4 x 1 inches; 3.84 Ounces', 'Item model number': 'CRUSP13304'}\nThe only good thing I can say about the wig is the cap fit perfectly. The hair color is much darker than the photo. The hair is much shorter and not wispy. The texture is course like barbie doll hair.\nLooks NOTHING like the photo",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** The user continues to prioritize beauty and makeup products, with an ongoing focus on eyebrow cosmetics and hair items, specifically wigs and extensions.\n- **Preference for Performance:** A strong emphasis remains on long-lasting and effective products, yet recent experiences have heightened frustration with hair-related items that consistently fail to meet durability and quality expectations. The user's latest experience with a wig reinforced this pattern of disappointment, particularly regarding product appearance and texture.\n- **Skepticism towards Effectiveness:** The user's critical perspective has been further solidified after a recent purchase that did not resemble the advertised product in terms of color and quality, prompting a significant downgrade in rating.\n- **Value for Convenience:** Continues to seek products that offer clear usage instructions and reliable delivery, desiring a straightforward and hassle-free shopping experience.\n- **Critical Reviewer:** The user regularly provides detailed feedback reflecting personal experiences, emphasizing shortcomings such as misrepresented product attributes while also recognizing positive aspects like fit and timely delivery.\n\nThe prevailing theme of performance dissatisfaction, especially concerning hair products, persists, as the user looks for solutions that promise reliability and efficacy. Their critical approach demonstrates a clear demand for beauty items that uphold quality and convenience without compromise.",
  "metrics": {
    "rouge1_f": 0.16796267496111975,
    "rouge2_f": 0.0062402496099844,
    "rougeL_f": 0.08398133748055987,
    "meteor": 0.07465472191116088,
    "bleu1": 0.06691380727464942,
    "bleu2": 0.012450017850466922,
    "bleu3": 0.0026218979562240546,
    "bleu4": 0.0012043942836512402,
    "bertscore_precision": 0.3344208896160126,
    "bertscore_recall": 0.38983580470085144,
    "bertscore_f1": 0.3600083589553833
  }
}