{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: BHF 30inch Long Drawstring Ponytail Extension Heat Resistant Synthetic Clip in Natural Wave Ponytail Hair Pieces For Women（MT27/613#）\nReview Date: 2020/08/07\nStore: BHF\nAverage Rating: 3.0\nProduct Details: {'Brand': 'BHF', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Installation Type': 'Clip-In', 'Package Dimensions': '8.2 x 5.3 x 1.3 inches; 5.29 Ounces'}\nReview Text: I wore it twice and the curl had turned to frizz. Was soft and now feels like plastic once it frizzed.\nReview Title: Beware\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Beauty HAO Eyebrow Tattoo Pen, Waterproof Natural Convenient Long-Lasting Eyebrow Pencil\nBeauty HAO\n{'Brand': 'Beauty HAO', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Skin Type': 'All', 'Package Information': 'Tube', 'Package Dimensions': '5.1 x 1 x 0.4 inches; 0.49 Ounces'}\nit arrived on time and I read the directions. simple. barely any product came out. I ended up washing it off and using my pencil.\nBEWARE\n613 lace front wig human hair 14inch Silky Straight 613 Frontal lace Wigs Glueless Pre Plucked 13x6 Lace Net 150% Density Bleached Knots 14In for black and white woman blonde human hair wigs\nHUAYI\n{'Material': 'Human Hair', 'Item Dimensions LxWxH': '27 x 7 x 0.5 inches', 'Hair Type': 'Straight', 'Brand': 'HUAYI', 'Product Dimensions': '27 x 7 x 0.5 inches; 12.03 Ounces'}\nIt arrived on time. The cap is very big. You can adjust the elastic straps but the cap has bumps from being so big.  The hair is brassy but toner would fix this. The hair gets very thin the longer it gets. I’m not thrilled.\nNot impressed\nBHF 30inch Long Drawstring Ponytail Extension Heat Resistant Synthetic Clip in Natural Wave Ponytail Hair Pieces For Women（MT27/613#）\nBHF\n{'Brand': 'BHF', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Installation Type': 'Clip-In', 'Package Dimensions': '8.2 x 5.3 x 1.3 inches; 5.29 Ounces'}\nI wore it twice and the curl had turned to frizz. Was soft and now feels like plastic once it frizzed.\nBeware",
  "profile": "**User Profile Summary:**\n\n- **Product Interest:** Primarily engages with beauty and makeup products, particularly eyebrow cosmetics and hair-related items like wigs and hair extensions.\n- **Preference for Performance:** Continues to seek long-lasting and effective products, yet recent experiences reveal ongoing issues with product durability, particularly evident in hair extensions that frizz and lose quality after minimal use.\n- **Skepticism towards Effectiveness:** Maintains a critical view of product effectiveness, as indicated by mixed ratings and dissatisfaction with past purchases. This skepticism is reinforced by recent purchases, which have shown disappointing performance.\n- **Value for Convenience:** Appreciates straightforward usage instructions and timely delivery, highlighting a preference for user-friendly products that require minimal effort.\n- **Critical Reviewer:** Actively provides feedback based on personal experiences, focusing on both positive aspects (like prompt shipping) and significant flaws in quality, such as texture and durability issues.\n\nThe user demonstrates an ongoing exploration of hair products, alongside their primary interest in eyebrow cosmetics. However, consistent themes of performance dissatisfaction underscore their desire for reliable beauty products that meet expectations without unnecessary complexity or degradation in quality over time.",
  "metrics": {
    "rouge1_f": 0.17289719626168223,
    "rouge2_f": 0.004694835680751174,
    "rougeL_f": 0.08411214953271028,
    "meteor": 0.09850651414045121,
    "bleu1": 0.12734880270623125,
    "bleu2": 0.027209815546924573,
    "bleu3": 0.006001456016546714,
    "bleu4": 0.002821612049891835,
    "bertscore_precision": 0.36101940274238586,
    "bertscore_recall": 0.3949407637119293,
    "bertscore_f1": 0.3772190511226654
  }
}