{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Trophy Wife Cosmetics Lipstick - Semi Matte - Natural, Vegan & Cruelty Free Anna\nReview Date: 2019/09/13\nStore: Trophy Wife\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Trophy Wife', 'Skin Type': 'All', 'Item Form': 'Stick', 'Finish Type': 'Semi-Matte, Glossy', 'Product Benefits': 'Long Lasting,Shine,Moisturizing,Clean,Long-lasting,Makeup', 'Package Dimensions': '3.1 x 1 x 1 inches; 1.59 Ounces', 'UPC': '670924966586'}\nReview Text: I am in love with this lipstick! The packaging looks luxurious to me and really stands out from my collection. I went with this shade which is a bright red with orange tones. It just goes with everything I wear and surprisingly my hair color at the moment. I also like how versatile this is so I can dress up or down with this color. It is 100% vegan, made with plant based wax and other natural ingredients like candelilla wax, castor seed oil, shea butter, almond oil, grape seed oil, jojoba, and coconut oil. The lipstick feels very smooth when applying and it I didn’t need a liner. And I think I reapplied when I remembered to after 3 hours and held up fine without any chapping or colorless patches. This is cruelty-free too!\nReview Title: Favorite new lipstick\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Trophy Wife Cosmetics Lipstick - Semi Matte - Natural, Vegan & Cruelty Free Anna\nTrophy Wife\n{'Brand': 'Trophy Wife', 'Skin Type': 'All', 'Item Form': 'Stick', 'Finish Type': 'Semi-Matte, Glossy', 'Product Benefits': 'Long Lasting,Shine,Moisturizing,Clean,Long-lasting,Makeup', 'Package Dimensions': '3.1 x 1 x 1 inches; 1.59 Ounces', 'UPC': '670924966586'}\nI am in love with this lipstick! The packaging looks luxurious to me and really stands out from my collection. I went with this shade which is a bright red with orange tones. It just goes with everything I wear and surprisingly my hair color at the moment. I also like how versatile this is so I can dress up or down with this color. It is 100% vegan, made with plant based wax and other natural ingredients like candelilla wax, castor seed oil, shea butter, almond oil, grape seed oil, jojoba, and coconut oil. The lipstick feels very smooth when applying and it I didn’t need a liner. And I think I reapplied when I remembered to after 3 hours and held up fine without any chapping or colorless patches. This is cruelty-free too!\nFavorite new lipstick",
  "profile": "**User Profile Summary:**\n\n- **Product Preferences:** Enjoys cosmetics, particularly lip products that are semi-matte and versatile in shade.\n- **Values:** Strongly favors vegan and cruelty-free products, highlighting a preference for ethical and clean beauty brands.\n- **Aesthetic Preferences:** Appreciates luxurious packaging and vibrant colors, specifically enjoys bright red shades with orange tones.\n- **Application Experience:** Prefers lipsticks that are smooth to apply and do not require additional products like lip liners. Values long-lasting wear, comfort, and moisturizing benefits in lip products.\n- **Use Cases:** Looks for versatility in makeup that can complement various outfits and occasions, suitable for both casual and formal settings.\n- **Overall Satisfaction:** Demonstrates a high level of satisfaction with products that align with these ethical and performance-related values. \n\nThis profile indicates a trend towards conscious cosmetic choices, prioritizing quality and ethical standards while maintaining a love for bold and engaging colors.",
  "metrics": {
    "rouge1_f": 0.2874251497005988,
    "rouge2_f": 0.04216867469879518,
    "rougeL_f": 0.14970059880239522,
    "meteor": 0.1637912414965986,
    "bleu1": 0.20635318326032978,
    "bleu2": 0.07027511531226821,
    "bleu3": 0.034085742096573536,
    "bleu4": 0.019987794155488302,
    "bertscore_precision": 0.43162834644317627,
    "bertscore_recall": 0.4670652747154236,
    "bertscore_f1": 0.4486481547355652
  }
}