{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 21AE Silky Straight Lace Front Wigs with Baby Hair Pre plucked Frontal 22 Inch Synthetic Wigs for Black Women Heat Resistant Fiber Wigs Middle Parting Natural Color Wig\nReview Date: 2021/06/12\nStore: 21AE\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '10.39 x 7.28 x 2.8 inches; 11.82 Ounces'}\nReview Text: The quality of this hair really nice for it be synthetic. It's not super shiny & it does look really good! I'm impressed with how it doesn't tangle a lot also! The lace looks realistic and it comes pre-plucked! Great for a beginner!\nReview Title: Good quality hair!!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "VOOADA Electric for Face, Arm, Waist, Belly, Leg, Hip\nVOOADA\n{'Package Dimensions': '9.69 x 7.87 x 2.05 inches; 1.37 Pounds', 'UPC': '699936288523'}\nLove this drill! It works great and it’s super easy to use for beginners.\nBeginner friendly, and easy to use.\nSYbeauty Pre Stretched Braiding Hair Extensions 26 Inch 10 Packs/Lot Synthetic Kanekalon Ombre Braiding Hair Professional Soft Yaki Texture Natural Easy Braid Crochet Hair (26\", 1B)\nSYbeauty\n{'Brand': 'SYbeauty', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Style': 'Braiding Hair Pre Stretched', 'Hair Type': 'All', 'Package Dimensions': '15.2 x 10.91 x 2.56 inches; 1.47 Pounds', 'UPC': '190372769442'}\n[[VIDEOID:c0aae0fa87abeb3d72ce48235a63c3ac]] I am amazed with the quality of this hair. the fibers is premium quality; it doesn’t tangle (unless you’re like me and keep restarting a braid.) and it’s super silky and smooth whilst braiding. Doesn’t burn your fingers! Nice quality product! The hair also super flowly, it has a lot of movement before dipping.\nHighly recommend!\nJARGOD 1pcs 100% Kolinsky Sable Acrylic Nails Round Nail Art Brush (size 4)\nJARGOD\n{'Brand': 'JARGOD', 'Handle Material': 'Acrylic', 'Head Material': 'Kolinsky', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.7 x 0.3 x 0.3 inches; 0.63 Ounces'}\nThis brush is perfect. I did a full overlay Acrylic set and they were perfect. Although I prefer this particular brush for nail due the smaller size. It still works great for doing artificial nail sets.\nGreat brush! It’s a small size.\nC'est Moi Gentle Cleansing Water | Gentle, Fragrance-Free Cleanser Removes Makeup and Refreshes Skin, Made with Cornflower Water, Aloe Vera, and Strawberry, Kiwi, and Apple Extracts | 5.9 fl oz.\nC'est Moi\n{'Item Form': 'Liquid', 'Skin Type': 'Acne Prone,Sensitive', 'Brand': \"C'est Moi\", 'Scent': 'Kiwi, Strawberry, Unscented, Aloe Vera', 'Age Range (Description)': 'Adult', 'Product Dimensions': '1.84 x 1.84 x 6.06 inches; 7.69 Ounces', 'UPC': '039897626055'}\nSuper nice! Easy to use and removes makeup efficiently. Just put a little on a cotton ball and wipes right off. I used this for my eyeshadow, liner and mascara. Does the job! And I have sensitive skin and this has not caused any problems!\nGets the job done!\n6 Pack Spray Bottles,Empty Plastic Clear Small Transparent Travel Bottles Pump Bottle Lotion Dispenser Bottle Set,Refillable Liquid Containers 3oz and 2 oz\nCehomi\n{'Package Dimensions': '8.98 x 6.14 x 1.1 inches; 0.81 Ounces'}\nNice travel size spray bottles and pumps! Perfect for hand sanitizers or just water spray bottles. The pumps and spray bottles work as expected and it’s a value kit, so 3 of each!\n6 pieces, works as expected and travel size.\nAltaba Long Wavy Wigs Ombre Red Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Glueless', 'Brand': 'Altaba'}\nThis is a cute wig for a quick style change! It doesn’t look super realistic, but I wore it with a hat which made it perfect for my outfit! I wouldn’t recommend it for daily wear, but definitely for cosplay, a photoshoot, or a outfit with a stylish hat!\nCute for a style change! Not a realistic wig.\n3 Packs Wig Stand Holder,Portable Wig Hanger for All Wigs Long and Short Hair and Hats,Durable Collapsible Travel Wig Stands Display Tool Dryer Holder(3 Pack, Pink)\nMarchQueen\n{'Package Dimensions': '12.64 x 7.87 x 2.6 inches; 12.31 Ounces', 'UPC': '779303841565'}\nthe idea of these are really nice. it’s just a little flimsy and the directions are all in mandarin or something, so putting them together was really a chore. once they are put together properly it does hold up wigs and creates more space, just the durability of them is a concern.\nnice concept, a little flimsy\nEEWIGS Ombre Green Synthetic 13×4 Lace Front Wigs short Bob Straight wig Heat Resistant cosplay wigs with pre plucked for women\nEEWIGS\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'EEWIGS', 'Package Dimensions': '10.08 x 8.94 x 3.54 inches; 9.59 Ounces'}\nThis wig is super cute! i love the full lace front versatility and it doesn’t tangle for it be synthetic. super easy to style!! doesn’t look cheap! highly recommend for a quick change.\nso many compliments! vibrant color!\nLong Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nHNYBEE\n{'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nbeautifully packaged, it’s super soft and doesn’t look cheap! perfect for quick style change!\nlong, soft, & nice quality!\nArgan Magic Color Protection Hair Mask – Nourishes, Hydrates & Helps to Protect Color Treated Hair | Enriched with Moringa Oil & Botanical Extracts | Made in USA | Paraben Free | Cruelty Free (8 oz)\nArgan Magic\n{'Brand': 'Argan Magic', 'Item Form': 'Cream', 'Material Feature': 'Natural, Cruelty Free, Paraben Free', 'Hair Type': 'Color Treated', 'Product Benefits': 'Hydrating', 'Package Dimensions': '4.45 x 4.09 x 3.43 inches; 8 Ounces', 'UPC': '605923470710'}\nmy hair feels soft and moistures after using this. if recommend allowing it to condition for approximately 30 mins then rinsing with cool water to get maximum results! my color didn’t fade! still vibrant!\nsmells good and makes hair feel great!\n21AE Silky Straight Lace Front Wigs with Baby Hair Pre plucked Frontal 22 Inch Synthetic Wigs for Black Women Heat Resistant Fiber Wigs Middle Parting Natural Color Wig\n21AE\n{'Package Dimensions': '10.39 x 7.28 x 2.8 inches; 11.82 Ounces'}\nThe quality of this hair really nice for it be synthetic. It's not super shiny & it does look really good! I'm impressed with how it doesn't tangle a lot also! The lace looks realistic and it comes pre-plucked! Great for a beginner!\nGood quality hair!!",
  "profile": "**Updated User Summary:**\n\n- **Product Preference:** The user continues to prioritize beginner-friendly personal care products, now extending their interest to synthetic wigs that offer versatility and ease of use. Their recent purchase underlines a focus on quality and aesthetic appeal, especially in items that successfully mimic natural hair characteristics.\n\n- **User Experience Focus:** Practicality, hydration, and quality remain central to their preferences, with recent experiences highlighting satisfaction in products that deliver effective results. They appreciate solutions that are user-friendly, allowing for effortless styling.\n\n- **Rating Trends:** While the user typically provides positive feedback, they are becoming increasingly discerning regarding quality and performance. Their recent review indicates a commendation for products that balance visual appeal with practicality, reflecting a sharpening of expectations.\n\n- **Interest Areas:** The user’s interests have expanded beyond hair care to include styling tools that promote overall hair health and self-expression. They seek reliable solutions that not only enhance their appearance but also provide ease of use and comfort.\n\n- **Consistency:** Engagement trends emphasize convenience, quality, and functionality. They continue to seek beauty products that integrate into their grooming routine while maintaining a focus on durability and dependable performance.\n\nOverall, the profile illustrates the user's evolving search for effective and stylish beauty solutions, marked by a growing emphasis on quality, ease of use, and overall hair wellness.",
  "metrics": {
    "rouge1_f": 0.13064516129032258,
    "rouge2_f": 0.008077544426494346,
    "rougeL_f": 0.06129032258064516,
    "meteor": 0.05003631668146235,
    "bleu1": 0.007383464516410791,
    "bleu2": 0.0021242452800209538,
    "bleu3": 0.00032584791941701896,
    "bleu4": 0.00012773668176878017,
    "bertscore_precision": 0.35471272468566895,
    "bertscore_recall": 0.44522175192832947,
    "bertscore_f1": 0.3948468565940857
  }
}