{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Long Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nReview Date: 2021/03/08\nStore: HNYBEE\nAverage Rating: 2.9\nProduct Details: {'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nReview Text: beautifully packaged, it’s super soft and doesn’t look cheap! perfect for quick style change!\nReview Title: long, soft, & nice quality!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "VOOADA Electric for Face, Arm, Waist, Belly, Leg, Hip\nVOOADA\n{'Package Dimensions': '9.69 x 7.87 x 2.05 inches; 1.37 Pounds', 'UPC': '699936288523'}\nLove this drill! It works great and it’s super easy to use for beginners.\nBeginner friendly, and easy to use.\nSYbeauty Pre Stretched Braiding Hair Extensions 26 Inch 10 Packs/Lot Synthetic Kanekalon Ombre Braiding Hair Professional Soft Yaki Texture Natural Easy Braid Crochet Hair (26\", 1B)\nSYbeauty\n{'Brand': 'SYbeauty', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Style': 'Braiding Hair Pre Stretched', 'Hair Type': 'All', 'Package Dimensions': '15.2 x 10.91 x 2.56 inches; 1.47 Pounds', 'UPC': '190372769442'}\n[[VIDEOID:c0aae0fa87abeb3d72ce48235a63c3ac]] I am amazed with the quality of this hair. the fibers is premium quality; it doesn’t tangle (unless you’re like me and keep restarting a braid.) and it’s super silky and smooth whilst braiding. Doesn’t burn your fingers! Nice quality product! The hair also super flowly, it has a lot of movement before dipping.\nHighly recommend!\nJARGOD 1pcs 100% Kolinsky Sable Acrylic Nails Round Nail Art Brush (size 4)\nJARGOD\n{'Brand': 'JARGOD', 'Handle Material': 'Acrylic', 'Head Material': 'Kolinsky', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.7 x 0.3 x 0.3 inches; 0.63 Ounces'}\nThis brush is perfect. I did a full overlay Acrylic set and they were perfect. Although I prefer this particular brush for nail due the smaller size. It still works great for doing artificial nail sets.\nGreat brush! It’s a small size.\nC'est Moi Gentle Cleansing Water | Gentle, Fragrance-Free Cleanser Removes Makeup and Refreshes Skin, Made with Cornflower Water, Aloe Vera, and Strawberry, Kiwi, and Apple Extracts | 5.9 fl oz.\nC'est Moi\n{'Item Form': 'Liquid', 'Skin Type': 'Acne Prone,Sensitive', 'Brand': \"C'est Moi\", 'Scent': 'Kiwi, Strawberry, Unscented, Aloe Vera', 'Age Range (Description)': 'Adult', 'Product Dimensions': '1.84 x 1.84 x 6.06 inches; 7.69 Ounces', 'UPC': '039897626055'}\nSuper nice! Easy to use and removes makeup efficiently. Just put a little on a cotton ball and wipes right off. I used this for my eyeshadow, liner and mascara. Does the job! And I have sensitive skin and this has not caused any problems!\nGets the job done!\n6 Pack Spray Bottles,Empty Plastic Clear Small Transparent Travel Bottles Pump Bottle Lotion Dispenser Bottle Set,Refillable Liquid Containers 3oz and 2 oz\nCehomi\n{'Package Dimensions': '8.98 x 6.14 x 1.1 inches; 0.81 Ounces'}\nNice travel size spray bottles and pumps! Perfect for hand sanitizers or just water spray bottles. The pumps and spray bottles work as expected and it’s a value kit, so 3 of each!\n6 pieces, works as expected and travel size.\nAltaba Long Wavy Wigs Ombre Red Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Glueless', 'Brand': 'Altaba'}\nThis is a cute wig for a quick style change! It doesn’t look super realistic, but I wore it with a hat which made it perfect for my outfit! I wouldn’t recommend it for daily wear, but definitely for cosplay, a photoshoot, or a outfit with a stylish hat!\nCute for a style change! Not a realistic wig.\n3 Packs Wig Stand Holder,Portable Wig Hanger for All Wigs Long and Short Hair and Hats,Durable Collapsible Travel Wig Stands Display Tool Dryer Holder(3 Pack, Pink)\nMarchQueen\n{'Package Dimensions': '12.64 x 7.87 x 2.6 inches; 12.31 Ounces', 'UPC': '779303841565'}\nthe idea of these are really nice. it’s just a little flimsy and the directions are all in mandarin or something, so putting them together was really a chore. once they are put together properly it does hold up wigs and creates more space, just the durability of them is a concern.\nnice concept, a little flimsy\nEEWIGS Ombre Green Synthetic 13×4 Lace Front Wigs short Bob Straight wig Heat Resistant cosplay wigs with pre plucked for women\nEEWIGS\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'EEWIGS', 'Package Dimensions': '10.08 x 8.94 x 3.54 inches; 9.59 Ounces'}\nThis wig is super cute! i love the full lace front versatility and it doesn’t tangle for it be synthetic. super easy to style!! doesn’t look cheap! highly recommend for a quick change.\nso many compliments! vibrant color!\nLong Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nHNYBEE\n{'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nbeautifully packaged, it’s super soft and doesn’t look cheap! perfect for quick style change!\nlong, soft, & nice quality!",
  "profile": "**Updated User Summary:**\n\n- **Product Preference:** The user continues to express a strong interest in easy-to-use, beginner-friendly personal care products, particularly those that facilitate versatile styling options. Recent interactions, including a recent purchase, highlight their appreciation for high-quality items that allow for quick style transformations while maintaining an aesthetic appeal.\n\n- **User Experience Focus:** The emphasis on practicality and quality remains pivotal, with recent feedback showcasing satisfaction with products that deliver both functionality and style. They consistently seek durable designs that meet specific needs rather than everyday use, valuing items that are visually appealing yet reliable.\n\n- **Rating Trends:** The user generally provides positive feedback, but their evaluations are becoming more critical, particularly concerning durability and assembly ease. Their latest interaction reflects a strong endorsement for a product that excelled in craftsmanship and presentation, indicative of their refined expectations for product quality.\n\n- **Interest Areas:** Their interest has evolved to include stylish, portable accessories that promote organization and self-expression. Recent experiences emphasize a consistent desire for robust solutions that combine beauty and practicality.\n\n- **Consistency:** Engagement patterns consistently revolve around convenience, quality, and versatility. The user remains committed to beauty products that enhance their grooming routine through effective use, paired with a growing focus on dependability and user-friendly features.\n\nOverall, this profile underscores the user's ongoing pursuit of stylish and reliable solutions to elevate their grooming experience, marked by an increasing emphasis on quality and functionality.",
  "metrics": {
    "rouge1_f": 0.141643059490085,
    "rouge2_f": 0.013245033112582783,
    "rougeL_f": 0.06798866855524079,
    "meteor": 0.0568631329113924,
    "bleu1": 0.01926674356304899,
    "bleu2": 0.005506181157091115,
    "bleu3": 0.0018981411146314277,
    "bleu4": 0.0006272508294649638,
    "bertscore_precision": 0.3564848005771637,
    "bertscore_recall": 0.4434773623943329,
    "bertscore_f1": 0.39525106549263
  }
}