{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Transparent Flexible Silicon Wig Grip Headband, 2Pcs Wig Bands for Making Wigs, Soft Drop-Shaped Wig Hair Bands Scarf, Elastic Grip Band For Wigs Running Sport Headband (Light Brown+Transparent)\nReview Date: 2020/11/09\nStore: YMSGIRL\nAverage Rating: 3.3\nProduct Details: {'Age Range (Description)': 'Adult', 'Material': 'Silicone', 'Fabric Type': 'Elastic,Silicon', 'Number of Items': '1', 'Brand': 'YMSGIRL', 'Package Dimensions': '4.84 x 3.46 x 1.1 inches; 1.76 Ounces'}\nReview Text: Hi, it's Glamorous Gem,<br />Hope you all are having a wonderful day.<br /><br />Anyway, I have never been a major fan of wig glue. It can take off your edges and make a mess on your head when you sweat. I try to avoid it less and less due to this.<br /><br />I am a fan of wearing my wig naked because of those issues, but I am glad that there is a more natural alternative now. I never knew these existed or I would have tried them much sooner.<br /><br />This set came with a transparent clear wig band and a tan one. I mostly wear the tan one because it blends better with my lace. But, putting it on is very easy and it has a decent tightness. It grips well, but not enough to be super tight.<br /><br />The band is very stretchy and easy to maneuver. Yet, it has a decent thickness as well. The bubble like grips really help it do its job well. Very durable and strong plastic bands overall.<br /><br />The band, plus the combs in my wig makes my wig very secure and tight. I haven't had any issue with it slipping or sliding back without me having to move it no matter what I'm doing. When I'm sweating it doesn't move and it fits my head very well overall.<br /><br /> So, I am super glad to have found this. This was a great investment for those that don't prefer glue all the time<br /><br />PS: No matter the nature, I only write honest and unbiased reviews. Thanks for reading:)\nReview Title: Makes Wig Very Secure & Tight With No Glue Needed\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Jaja Hair Short Bob Wig Brazilian Virgin Hair Straight Bob Wig Human Hair Lace Frontal Wigs For Black Women Remy Hair Wigs 8 Inches\n{'Package Dimensions': '9.45 x 6.57 x 2.36 inches; 9.42 Ounces', 'UPC': '611550536507'}\nHi, it's Glamorous Gem with all your latest review info. I hope you all reading are having a nice day and will continue to do so, like I am :)<br /><br />Anyway,  let me start by saying. I have been wanting to do this review for a while just to give my honest thoughts on it. I have been having to make a couple of life changes. Including for my own hair and the hair I use do to career changes as well as just life changes.<br /><br />Lately, I haven't been able to really enjoy my 'inches' like I want to,  because of the many things I do that disables me from using them. They merely get in the way of the work I have to do, so I decided to go shorter for the meantime.<br /><br />Now let me start by saying, I usually don't purchase wigs, but considering the maintence is a lot less than doing bundles, I thought it was the best option for now. So after actively searching I stumbled across this hair and I thought it would be an okay buy so I purchased.<br /><br />Now, it came in a cute little box and as far as I saw, there was no damage. They sent me a perfectly, full wig.<br /><br />Though, there are a couple things i should mention about it.  From first impressions, the hair was very soft, basically like silk through my fingers. It felt softer than any other hair I have bought, so I considered that an overall major plus. As for the length, The ends are evenly curled and blunt cut in the back, but the front isn't so it can fall longer in the front. Though, you might have to curl it again or  even straighten it if you dont like two different styles all the way around for it to look right.<br /><br />As for the density and movement, it's very bouncy and weightless. It looks and feels like very healthy, shiny hair with no foul smells. As for the thickness, it feels very thick and very full. It seems like it's density is very thick all over. No wedges in-between just very wonderful hair.<br /><br />As for the wig accessories itself, The frontal piece goes very long from the front to the back, which is very great for a wig unlike standard ones. It was clear that they used a 13x4 unlike smaller 4x4's which can make the wig not only more fuller, but to give it a more realistic look.<br /><br />Though, they didn't pluck it much so you would have to lay your baby hairs for it to look right or pluck it a bit more. Though, the 13x4 looked like it was colored correctly so it should blend it very nicely with all hair types.<br /><br />It also came with clips and it fit nicely to the head. It wasn't too tight or too loose which is pretty good, considering I have a medium head size, so i think it should fit most average heads.<br /><br />Overall, I really love this hair. The texture is beautiful and amazingly soft, the size is very fitting, it looks very realistic, and the wig was very well put together. So, of course I would give it a 5/5. It's definitely worth my rating and if you decided to buy, it would be a very valuable purchase.<br /><br />PS: This is not promotional content and I was not endorsed nor paid by this review. This is my unbiased, unfiltered review and all words remain my own only. Thanks for reading. :)<br /><br />Edit:  I am afraid that it was a bit too short for my head size, so i made a return for a 10' instead and they were very courteous and helpful.  Thanks, JaJa Hair :)\nVery Beautiful and Full Hair!!!\nTransparent Flexible Silicon Wig Grip Headband, 2Pcs Wig Bands for Making Wigs, Soft Drop-Shaped Wig Hair Bands Scarf, Elastic Grip Band For Wigs Running Sport Headband (Light Brown+Transparent)\nYMSGIRL\n{'Age Range (Description)': 'Adult', 'Material': 'Silicone', 'Fabric Type': 'Elastic,Silicon', 'Number of Items': '1', 'Brand': 'YMSGIRL', 'Package Dimensions': '4.84 x 3.46 x 1.1 inches; 1.76 Ounces'}\nHi, it's Glamorous Gem,<br />Hope you all are having a wonderful day.<br /><br />Anyway, I have never been a major fan of wig glue. It can take off your edges and make a mess on your head when you sweat. I try to avoid it less and less due to this.<br /><br />I am a fan of wearing my wig naked because of those issues, but I am glad that there is a more natural alternative now. I never knew these existed or I would have tried them much sooner.<br /><br />This set came with a transparent clear wig band and a tan one. I mostly wear the tan one because it blends better with my lace. But, putting it on is very easy and it has a decent tightness. It grips well, but not enough to be super tight.<br /><br />The band is very stretchy and easy to maneuver. Yet, it has a decent thickness as well. The bubble like grips really help it do its job well. Very durable and strong plastic bands overall.<br /><br />The band, plus the combs in my wig makes my wig very secure and tight. I haven't had any issue with it slipping or sliding back without me having to move it no matter what I'm doing. When I'm sweating it doesn't move and it fits my head very well overall.<br /><br /> So, I am super glad to have found this. This was a great investment for those that don't prefer glue all the time<br /><br />PS: No matter the nature, I only write honest and unbiased reviews. Thanks for reading:)\nMakes Wig Very Secure & Tight With No Glue Needed",
  "profile": "**User Profile Summary:**\n\n- **Hair Preferences:** User prefers wigs over traditional hair bundles for lower maintenance and emphasizes shorter styles for practicality. They prioritize softness, silk-like texture, movement, and a realistic appearance.\n\n- **Material Choice:** Strong preference for high-quality human hair and virgin hair.\n\n- **Quality Indicators:** The user seeks thorough product details, including density, thickness, and application ease, such as frontal piece size and fit mechanisms.\n\n- **Experience Orientation:** Values excellent customer service and effortless shopping experiences, often sharing feedback on positive interactions and effective problem resolution.\n\n- **Review Behavior:** Enthusiastic about providing honest, unbiased reviews, reflecting their genuine experiences with products.\n\n- **Life Changes Impact:** Current lifestyle changes drive a preference for manageable hair solutions.\n\n- **Aesthetic Trends:** Appreciates fullness, bounce, and realistic styles that enhance their look while being functional for daily activities.\n\n- **Wig Application Techniques:** The user actively seeks alternatives to traditional wig application methods (like glue) for convenience and head comfort. Recent interactions show a commitment to innovative products that improve wig security without the need for adhesives, highlighting their focus on practicality and comfort in hair management.\n\nOverall, this user is dedicated to finding high-quality, easy-to-manage hair products that offer a stylish yet practical solution tailored to their evolving lifestyle.",
  "metrics": {
    "rouge1_f": 0.1537242472266244,
    "rouge2_f": 0.014285714285714287,
    "rougeL_f": 0.0792393026941363,
    "meteor": 0.0627479991605987,
    "bleu1": 0.010174437120253671,
    "bleu2": 0.0030188037477423316,
    "bleu3": 0.00043430634982027943,
    "bleu4": 0.00016488004035097536,
    "bertscore_precision": 0.3910607695579529,
    "bertscore_recall": 0.4870440661907196,
    "bertscore_f1": 0.4338065981864929
  }
}