{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Jaja Hair Short Bob Wig Brazilian Virgin Hair Straight Bob Wig Human Hair Lace Frontal Wigs For Black Women Remy Hair Wigs 8 Inches\nReview Date: 2019/03/05\nAverage Rating: 5.0\nProduct Details: {'Package Dimensions': '9.45 x 6.57 x 2.36 inches; 9.42 Ounces', 'UPC': '611550536507'}\nReview Text: Hi, it's Glamorous Gem with all your latest review info. I hope you all reading are having a nice day and will continue to do so, like I am :)<br /><br />Anyway,  let me start by saying. I have been wanting to do this review for a while just to give my honest thoughts on it. I have been having to make a couple of life changes. Including for my own hair and the hair I use do to career changes as well as just life changes.<br /><br />Lately, I haven't been able to really enjoy my 'inches' like I want to,  because of the many things I do that disables me from using them. They merely get in the way of the work I have to do, so I decided to go shorter for the meantime.<br /><br />Now let me start by saying, I usually don't purchase wigs, but considering the maintence is a lot less than doing bundles, I thought it was the best option for now. So after actively searching I stumbled across this hair and I thought it would be an okay buy so I purchased.<br /><br />Now, it came in a cute little box and as far as I saw, there was no damage. They sent me a perfectly, full wig.<br /><br />Though, there are a couple things i should mention about it.  From first impressions, the hair was very soft, basically like silk through my fingers. It felt softer than any other hair I have bought, so I considered that an overall major plus. As for the length, The ends are evenly curled and blunt cut in the back, but the front isn't so it can fall longer in the front. Though, you might have to curl it again or  even straighten it if you dont like two different styles all the way around for it to look right.<br /><br />As for the density and movement, it's very bouncy and weightless. It looks and feels like very healthy, shiny hair with no foul smells. As for the thickness, it feels very thick and very full. It seems like it's density is very thick all over. No wedges in-between just very wonderful hair.<br /><br />As for the wig accessories itself, The frontal piece goes very long from the front to the back, which is very great for a wig unlike standard ones. It was clear that they used a 13x4 unlike smaller 4x4's which can make the wig not only more fuller, but to give it a more realistic look.<br /><br />Though, they didn't pluck it much so you would have to lay your baby hairs for it to look right or pluck it a bit more. Though, the 13x4 looked like it was colored correctly so it should blend it very nicely with all hair types.<br /><br />It also came with clips and it fit nicely to the head. It wasn't too tight or too loose which is pretty good, considering I have a medium head size, so i think it should fit most average heads.<br /><br />Overall, I really love this hair. The texture is beautiful and amazingly soft, the size is very fitting, it looks very realistic, and the wig was very well put together. So, of course I would give it a 5/5. It's definitely worth my rating and if you decided to buy, it would be a very valuable purchase.<br /><br />PS: This is not promotional content and I was not endorsed nor paid by this review. This is my unbiased, unfiltered review and all words remain my own only. Thanks for reading. :)<br /><br />Edit:  I am afraid that it was a bit too short for my head size, so i made a return for a 10' instead and they were very courteous and helpful.  Thanks, JaJa Hair :)\nReview Title: Very Beautiful and Full Hair!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Jaja Hair Short Bob Wig Brazilian Virgin Hair Straight Bob Wig Human Hair Lace Frontal Wigs For Black Women Remy Hair Wigs 8 Inches\n{'Package Dimensions': '9.45 x 6.57 x 2.36 inches; 9.42 Ounces', 'UPC': '611550536507'}\nHi, it's Glamorous Gem with all your latest review info. I hope you all reading are having a nice day and will continue to do so, like I am :)<br /><br />Anyway,  let me start by saying. I have been wanting to do this review for a while just to give my honest thoughts on it. I have been having to make a couple of life changes. Including for my own hair and the hair I use do to career changes as well as just life changes.<br /><br />Lately, I haven't been able to really enjoy my 'inches' like I want to,  because of the many things I do that disables me from using them. They merely get in the way of the work I have to do, so I decided to go shorter for the meantime.<br /><br />Now let me start by saying, I usually don't purchase wigs, but considering the maintence is a lot less than doing bundles, I thought it was the best option for now. So after actively searching I stumbled across this hair and I thought it would be an okay buy so I purchased.<br /><br />Now, it came in a cute little box and as far as I saw, there was no damage. They sent me a perfectly, full wig.<br /><br />Though, there are a couple things i should mention about it.  From first impressions, the hair was very soft, basically like silk through my fingers. It felt softer than any other hair I have bought, so I considered that an overall major plus. As for the length, The ends are evenly curled and blunt cut in the back, but the front isn't so it can fall longer in the front. Though, you might have to curl it again or  even straighten it if you dont like two different styles all the way around for it to look right.<br /><br />As for the density and movement, it's very bouncy and weightless. It looks and feels like very healthy, shiny hair with no foul smells. As for the thickness, it feels very thick and very full. It seems like it's density is very thick all over. No wedges in-between just very wonderful hair.<br /><br />As for the wig accessories itself, The frontal piece goes very long from the front to the back, which is very great for a wig unlike standard ones. It was clear that they used a 13x4 unlike smaller 4x4's which can make the wig not only more fuller, but to give it a more realistic look.<br /><br />Though, they didn't pluck it much so you would have to lay your baby hairs for it to look right or pluck it a bit more. Though, the 13x4 looked like it was colored correctly so it should blend it very nicely with all hair types.<br /><br />It also came with clips and it fit nicely to the head. It wasn't too tight or too loose which is pretty good, considering I have a medium head size, so i think it should fit most average heads.<br /><br />Overall, I really love this hair. The texture is beautiful and amazingly soft, the size is very fitting, it looks very realistic, and the wig was very well put together. So, of course I would give it a 5/5. It's definitely worth my rating and if you decided to buy, it would be a very valuable purchase.<br /><br />PS: This is not promotional content and I was not endorsed nor paid by this review. This is my unbiased, unfiltered review and all words remain my own only. Thanks for reading. :)<br /><br />Edit:  I am afraid that it was a bit too short for my head size, so i made a return for a 10' instead and they were very courteous and helpful.  Thanks, JaJa Hair :)\nVery Beautiful and Full Hair!!!",
  "profile": "**User Profile Summary:**\n\n- **Hair Preferences:** User prefers wigs over traditional hair bundles due to lower maintenance. They value shorter styles for practicality but appreciate the overall quality and aesthetics of the wig. Softness, silk-like texture, movement, and realistic appearance are essential qualities in their hair products. \n\n- **Material Choice:** Strong preference for human hair and high-quality virgin hair.\n\n- **Quality Indicators:** The user looks for thorough details in products, such as density, thickness, and ease of application (e.g., frontal piece size and clips for fitting).\n\n- **Experience Orientation:** They highlight the importance of customer service and a seamless shopping experience, noting positive interactions and problem resolution.\n\n- **Review Behavior:** The user expresses genuine enthusiasm for sharing honest reviews, emphasizing that their feedback is unbiased and unendorsed.\n\n- **Life Changes Impact:** Current life changes influence their hair choices, leading to a desire for more manageable options.\n\n- **Aesthetic Trends:** They appreciate fullness, bounce, and realistic styles that can enhance their overall look while remaining functional for daily activities.\n\nOverall, this user seeks high-quality, easy-to-manage hair products that provide a stylish yet practical solution for their changing lifestyle.",
  "metrics": {
    "rouge1_f": 0.20852017937219733,
    "rouge2_f": 0.020224719101123594,
    "rougeL_f": 0.09192825112107623,
    "meteor": 0.08629278567952563,
    "bleu1": 0.039269838478808584,
    "bleu2": 0.012499775090424894,
    "bleu3": 0.0017835882587826394,
    "bleu4": 0.0006744103644154325,
    "bertscore_precision": 0.3686104118824005,
    "bertscore_recall": 0.44330713152885437,
    "bertscore_f1": 0.4025227129459381
  }
}