{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Cfalaicos Women Short Curly Bob Wavy Wig for Cosplay Party Halloween Heat Resistant Wigs Full Head Wig with Free Wig Cap (Rainbow)\nReview Date: 2022/04/23\nStore: Cfalaicos\nAverage Rating: 3.8\nProduct Details: {'Item Dimensions LxWxH': '14 x 10 x 10 inches', 'Hair Type': 'Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'Cfalaicos', 'Age Range (Description)': 'Adult', 'Product Dimensions': '14 x 10 x 10 inches; 7.05 Ounces'}\nReview Text: I have a hard time committing to different hair color changes so wigs help fulfill my color obsessions without the commitment. This wig is soo much fun! It has an adjustable strap on the bottom of the wig easily making it able to fit myself as well as my daughters. The colors are exactly as pictured and quality is great for the $17 pricing. This wig also comes with a wig cap. I have extremely long hair and this wig does a great job holding and hiding it. Love it. Would recommend\nReview Title: So Much Fun!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Aubss 20Pcs Colors Gel Nail Polish Kit with Glossy & Matte Top Coat and 2Pcs Base Coat, Rainbow Colors Skin Tones Yellow Red Gel Polish for All Reason, Gel Nail Kit for Women Girls Christmas Gift\nAUBSS\n{'Brand': 'AUBSS', 'Item Form': 'Gel', 'Color': '003', 'Type': 'Gel', 'Finish Type': 'Matte,Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Count', 'Number of Items': '25', 'Item Dimensions LxWxH': '7.87 x 5.51 x 2.76 inches', 'Product Dimensions': '7.87 x 5.51 x 2.76 inches; 2.08 Ounces', 'Manufacturer': 'AUBSS'}\nI love the variety of this set. I have 2 daughters but also many nieces and they love having nail salon parties. This set gives me not only the base and top coats but also a HUGE variety of colors to choose from. Polish goes on great and looks perfect!\nGorgeous colors!\nEthique Quench Lightweight Solid Face Moisturizer Tube for Oily to Balanced Skin - Plastic-Free, Vegan, Cruelty-Free, Eco-Friendly, 2.29 oz (Pack of 1)\nEthique\n{'Brand': 'Ethique', 'Scent': 'Coconut', 'Item Form': 'Bar', 'Unit Count': '2.29 Ounce', 'Number of Items': '1', 'Product Dimensions': '3.54 x 1.57 x 1.57 inches; 2.47 Ounces', 'Item model number': 'Quench Bar Solid Face Moisturiser', 'UPC': '810003557681'}\nAbsolutely love the concept of this product. A balm that you can easily apply to your face without having to get your hands dirty AND biodegradable packaging. A sure yes please, or so you’d think. Upon opening, I found the packaging to be great. The push up concept was great as well. Innovative and a great selling point. It had no real smell to it when I opened it but about an hour after applying it to my face, you could start to smell what smelt like an old lotion that’s sat around since my mother’s childhood. It was almost dusty of a smell. It also felt a bit greasy/oily. My face does feel smoother though after whipping it off though. Really wish I could love this product.\nLove the concept but not the product\nAOA Studio Collection Makeup Sponge Set Makeup Blender Latex Free and High-definition Set of 5 Makeup Blender For Powder Cream and Liquid, Super Soft Wonder Blender Beauty Cosmetic Beveled\nAOA STUDIO\n{'Brand': 'AOA STUDIO', 'Color': 'Ivory', 'Material': 'Rubber', 'Skin Type': 'Dry', 'Recommended Uses For Product': 'Makeup', 'Package Dimensions': '6.85 x 5.39 x 1.97 inches; 1.45 Ounces', 'UPC': '850022931338'}\nDurable and flexible enough for your makeup needs. Applied make up smoothly and blots great. Enough absorption to hold foundation but not make it soggy. Individually wrapped. Works great\nFlexible\nMakeup Headband - 3PCS Spa Headband For Washing Face Skincare Towel Headbands Shower Hair Band\nTinpin\n{'Color': 'Pink,Silver', 'Material': 'Foam', 'Number of Items': '3', 'Brand': 'Tinpin', 'Size': '3 piece Set', 'Package Dimensions': '8.35 x 7.17 x 2.13 inches; 3.99 Ounces'}\nI got this 3 pack for my daughters and I in hopes it’d fit all of us and IT DOES! My daughters are 4 and 8 so I was reaching for it to be able to fit so I’m very impressed it does. Perfect to hold our hair back when doing face masks or facials. Looks great and really comfortable.\nStretchy and comfy!\nCfalaicos Women Short Curly Bob Wavy Wig for Cosplay Party Halloween Heat Resistant Wigs Full Head Wig with Free Wig Cap (Rainbow)\nCfalaicos\n{'Item Dimensions LxWxH': '14 x 10 x 10 inches', 'Hair Type': 'Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'Cfalaicos', 'Age Range (Description)': 'Adult', 'Product Dimensions': '14 x 10 x 10 inches; 7.05 Ounces'}\nI have a hard time committing to different hair color changes so wigs help fulfill my color obsessions without the commitment. This wig is soo much fun! It has an adjustable strap on the bottom of the wig easily making it able to fit myself as well as my daughters. The colors are exactly as pictured and quality is great for the $17 pricing. This wig also comes with a wig cap. I have extremely long hair and this wig does a great job holding and hiding it. Love it. Would recommend\nSo Much Fun!",
  "profile": "User Summary:\n\n- **Family-Oriented**: The user prioritizes products that can be enjoyed with family, particularly her daughters and nieces. Recent engagements emphasize her commitment to fostering bonding experiences through beauty and self-care activities.\n\n- **Variety Preference**: She continues to showcase a strong appreciation for diverse color options, reflecting a love for creativity and choice in product selections.\n\n- **Quality and Performance**: The user emphasizes high-quality items with excellent performance. Her recent review indicates discernment in product efficacy, especially regarding comfort and fit for all family members.\n\n- **Nail Art Enthusiast**: Her passion for beauty is evident through ongoing involvement in creative self-care activities, such as hosting nail salon parties.\n\n- **Gift Consideration**: The user is thoughtful about selections for family and friends, often favoring products that are suitable for gifting.\n\n- **Eco-Consciousness**: A growing interest in eco-friendly and innovative products reflects her commitment to sustainability in beauty choices.\n\n- **Makeup Tools Appreciation**: She values effective makeup tools that enhance her beauty routine, prioritizing functionality and comfort.\n\n- **Color Experimentation with Hair**: The user enjoys experimenting with hair color through wigs, allowing her to fulfill her color obsessions without permanent changes. Her focus on fun, adjustable options shows her consideration for shared experiences with her daughters.\n\nOverall, the user embodies a creative, family-oriented individual who values quality, variety, and social experiences in beauty and self-care, increasingly with an eye towards sustainability.",
  "metrics": {
    "rouge1_f": 0.1913978494623656,
    "rouge2_f": 0.019396551724137928,
    "rougeL_f": 0.0881720430107527,
    "meteor": 0.09092612177775378,
    "bleu1": 0.04646578526337827,
    "bleu2": 0.012667801349139252,
    "bleu3": 0.005930061761182038,
    "bleu4": 0.003085516097112384,
    "bertscore_precision": 0.37014877796173096,
    "bertscore_recall": 0.46266791224479675,
    "bertscore_f1": 0.41126927733421326
  }
}