{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Maforsoon Messy Hair Bun Hair Scrunchies Extension 1PCS Curly Wavy Messy Synthetic Chignon for women Updo (Strawberry Blonde)\nReview Date: 2022/01/14\nStore: Maforsoon\nAverage Rating: 3.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Brand': 'Maforsoon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '7.56 x 6.65 x 1.42 inches; 2.08 Ounces'}\nReview Text: When ordering go by the pictures, not the actual written description. I figured dark brown would be dark brown, but if you click on dark brown you get a picture of a light red. That is what you will get. These are cute, but they aren’t worth the $10. You can see the wrapping of the ponytail. I wanted to order one that was the right color, but the price is too high for the quality.\nReview Title: Disappointing…dark brown is reddish color.\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Qiray Hair Ties For Women Coil Hair Ties,Large Lace Phnom Penh,5 Colors 10 Pieces.\nQiray\n{'Material': 'Rubber', 'Item Form': 'elastic', 'Brand': 'Qiray', 'Item Dimensions LxWxH': '3.15 x 3.15 x 2.36 inches', 'Number of Pieces': '10', 'Product Dimensions': '3.15 x 3.15 x 2.36 inches; 2.82 Ounces', 'UPC': '655160582486'}\nI really enjoyed having something this pretty to put in my hair. You get two of each color, and they are very pretty. I don’t have a lot of hair so they were a bit lose on me. With the pearls on them, they really don’t wrap around too many times and look the same. My daughter put them around her bun in her hair. This accentuated the beauty of the hairpiece, and it worked really well-just an idea for these beautiful hair accessories. They are prettier than the pictures. I’ll be interested to see how long they stay together so I’ll put an update later on how well they last. Very pleased with this product so far, but they are not for people with thin hair.\nReally beautifully made\nQTMY Fashion Rhinestone Flower Headband,Wide Hair Hoop for Women,Hair Accessories Head Band Headwear,White\nQTMY\n['QTMY Fashion Rhinestone Flower Headband,Wide Hair Hoop for Women,Hair Accessories Head Band Headwear,White']\n{'Color': 'White', 'Age Range (Description)': 'Adult', 'Occasion': 'Wedding', 'Material': 'Pearl', 'Fabric Type': 'Velvet', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.79 x 5.51 x 1.69 inches; 4.59 Ounces'}\nI love this very much. The colors and the beads are amazing ! It did lose one bead when I first got it so that wasn’t nice but I can put it back on sometime. It is very heavy so it slides a lot and is heavy on the head. I get headaches from heavy things so I just have to wear it for special things. I love it very much.\nVery  beautiful.\nPolish Due nails | Stretchable Real Nail Polish Strips| Gloss Solid Color, Ombre , French, Pattern, Glitter Finish 16Pcs | Incudes Nail Wipe, Nail File, Instructional Brochure (Pink Petals)\nPOLISHDUE\n{'Brand': 'POLISHDUE', 'Item Form': 'Strip', 'Color': 'Clear,Pink', 'Finish Type': 'Shimmery', 'Material Feature': 'Formaldehyde free, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.12 x 3.2 x 1.2 inches; 15.84 Ounces'}\nThese are very pretty but very thin. The glue on the back of them is super sticky and a mess to clean off your fingers. I don’t recommend these. I use a different brand that can last up to a week, but these peeked of within about two days. Not all the great to cut and file, either. I was not happy with them, I do not recommend. The color was beautiful though.\nVery thin.\nBBG Headbands for Women, DQCUTE 4 Pack Elastic Headbands for Women Girls Fashion Tie Dye Workout Hair Bands Headwraps for Yoga Running Sports1\nBBG\n{'Age Range (Description)': 'Adult', 'Material': 'Polyester', 'Fabric Type': 'Polyester,Cotton', 'Number of Items': '1', 'Item Weight': '77 Grams', 'Package Dimensions': '8.31 x 6.06 x 0.55 inches; 2.72 Ounces'}\nThey have bands are pretty. Are very soft,have very nice length.They have very colorful fabric a very stretchy and straight all the way around. I like them all in all.\nNice headbands.\nRhinestone Crystal Pearl Flower Hair Clip- Cute Butterfly Duckbill Hair Pin- Wedding Alligator Barrette Hair Piece Hair Accessories For Woman (Butterfly)\nJERTOCLE\n{'Brand': 'JERTOCLE', 'Hair Type': 'All', 'Color': 'Golden', 'Age Range (Description)': 'Adult', 'Material': 'Crystal', 'Package Dimensions': '5.59 x 3.94 x 1.18 inches; 2.89 Ounces', 'UPC': '764915591229'}\nThese are cute…it will depend on your hair type as always as to whether they stay in your hair. My daughter has great success with most hair clips. If you are looking for something cute for a young girl, I definitely recommend these.\nAdorable\nBig Claw Hair Clips Super Strong Hold Hair Claw Clips for Women Girls Thick Hair, 4 Rows of Claws Nonslip Hair Clips for Thin Hair, French Plastic Jaw Clips Octopus Clip for All Hair Types , 6 Packs\nMevnccola\n{'Brand': 'Mevnccola', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal', 'Unit Count': '6.00 Count', 'Product Dimensions': '2.3 x 1.2 x 2.3 inches; 5.29 Ounces', 'UPC': '733557234627'}\nThese are really cute, and they are a great size for a variety of looks. I really like hair clips…some are far too big to use for anything but all of ones hair and you must have a lot. These are a nice medium size, great colors, and really adorable.\nAdorable…good size.\nTousled Updo Messy Bun Hair Piece Hair Extension with Elastic Rubber Band Scrunchies Extensions Hair Pieces and Ponytails Hair Extensions Synthetic Hair for Women (1B, Tousled Updo Bun)\nMEDO\n{'Brand': 'MEDO', 'Material': 'Rubber', 'Hair Type': 'All', 'Material Feature': 'Natural', 'Package Dimensions': '5.75 x 5.67 x 1.65 inches; 1.45 Ounces', 'UPC': '779880422164'}\nNot as much hair as some or as nice as some. The colors were pretty standard for the description. I love these types of extensions,these were not my favorite ones out there. However, not bad for the price!\nFairly nice\nMaforsoon Messy Hair Bun Hair Scrunchies Extension 1PCS Curly Wavy Messy Synthetic Chignon for women Updo (Strawberry Blonde)\nMaforsoon\n{'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Style': 'Modern', 'Brand': 'Maforsoon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '7.56 x 6.65 x 1.42 inches; 2.08 Ounces'}\nWhen ordering go by the pictures, not the actual written description. I figured dark brown would be dark brown, but if you click on dark brown you get a picture of a light red. That is what you will get. These are cute, but they aren’t worth the $10. You can see the wrapping of the ponytail. I wanted to order one that was the right color, but the price is too high for the quality.\nDisappointing…dark brown is reddish color.",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preferences:** The user remains drawn to unique and aesthetically pleasing hair accessories, particularly highlighting her recent exploration of hair extensions. However, a recent purchase has made her more discerning regarding quality, as she encountered discrepancies in color and quality that did not meet her expectations.\n\n- **User Engagement:** While she continues to value durability, performance, and comfort in hair accessories, her latest experience has prompted a more critical approach to product descriptions and color accuracy, reinforcing her proactive engagement in providing feedback on usability.\n\n- **Performance Consideration:** The user prioritizes products with a secure fit, especially for thin hair, focusing on comfort and lightweight options. She now places further emphasis on quality, as her recent interactions indicate a desire for reliable solutions that don’t compromise on these aspects.\n\n- **Hair Type Consideration:** Her search for versatile items continues, as she seeks products that cater effectively to both her and her daughter's thin hair, maintaining a focus on functionality.\n\n- **Color Variety:** The user’s appreciation for vibrant colors is evident, but the importance of accurate color representation has become more prominent in her evaluations.\n\n- **Family Orientation:** The user’s interest in multifunctional beauty products for her and her daughter remains strong, emphasizing practicality alongside aesthetics.\n\nOverall, the user is balancing her passion for beauty and self-expression with a newfound vigilance regarding product quality and representation, ensuring her purchases align with her high standards.",
  "metrics": {
    "rouge1_f": 0.1568,
    "rouge2_f": 0.01923076923076923,
    "rougeL_f": 0.0752,
    "meteor": 0.06110391712528326,
    "bleu1": 0.01337075840041658,
    "bleu2": 0.0040380605496825,
    "bleu3": 0.0017588613141466696,
    "bleu4": 0.0004964089345360116,
    "bertscore_precision": 0.36632710695266724,
    "bertscore_recall": 0.4771653413772583,
    "bertscore_f1": 0.41446390748023987
  }
}