{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 6 Pcs Pink Baby Girl Hair Bow Clips Set, Alligator Clip Hair Accessories with Gift Box, Back to School Dress\nReview Date: 2021/02/03\nStore: Amacle\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Amacle', 'Hair Type': 'All', 'Age Range (Description)': 'Child', 'Unit Count': '6.00 Count', 'Number of Pieces': '6', 'Package Dimensions': '6 x 6 x 2 inches; 4.8 Ounces', 'UPC': '743811744526'}\nReview Text: My five-year-old absolutely adores these big, beautiful bows for the hair. The alligator clips are easy for her to use even by herself, and not only does she likes to wear them, but she also loves to put them on her 18 inch American girl style dolls..<br /><br />There is a beautiful array of child pleasing colors and patterns, and these were a big hit at our house.\nReview Title: Super fancy big bows for little girls\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Savanaahs Organic Argan Oil 4 Oz / 120 ML 100% Pure & Cold Pressed - Premium Grade - USDA Certified Organic - Large 4 Oz Glass Bottle - Excellent Natural Multi-Purpose Moisturizer for Skin, Hair & Nails - Non-Greasy and Fast Absorbing - Good Source of Vitamin E & Omegas - Rejuvenates Dry Skin - 100% Satisfaction Guarantee - 90 Days Full Refund/ Return Policy (No Questions Asked) - New Design & Packaging - Promotional Price for Limited Time Only\nLPVLUX\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.2 x 4.8 x 2.3 inches; 8.8 Ounces', 'Item model number': '4 OZ / 120 ML', 'UPC': '661799831734 885133330916', 'Manufacturer': 'Divine Organics'}\nI’ve tried other brands of argan oil, and have been surprised that some of the brands almost seem more like canola oil or a neutral oil, to where I almost wondered if some of them are counterfeit. Not so with this brand. This brand has the natural scent of the real deal, and is effective to boot. I have a baby, so have been washing my hands about 10 times a day, every time I change his diaper. Between that and all of the diaper wipes I use, my hands have been starting to peel and crack, so I knew I needed a solution.<br /><br />This argan oil came with a regular lid, an eyedropper, and a pump dispenser. I used the pump dispenser and set it right next to my faucet so I could get a quick pump of oil every time I wash my hands. Well, it only took a couple of days to experience really great results. My hands feel normal again, and I am so relieved. From hard skin that was rough and crackled, to soft, happy hands again.<br /><br />I have also used the product on my split ends, and here, I’d like to caution you that only a few drops are needed. It is very effective and soaks and well, so you only need a very small amount.<br /><br />Overall, this argan oil is one of the best I have found. It comes packaged beautifully and looks like a gift, has multiple options for how you dispense it, and is pure, organic, and has the mild scent of real argan oil, unlike some competitors.\nA fantastic product at a fantastic price\nOZNaturals Facial Mask - This Moisturizing Face Mask Contains Rosehip Oil, Pro Vitamin B5 & Amino Acids - This Anti Aging Mask Deeply Hydrates Dry Skin For A Healthy Youthful Glow!\nAuperwel\n[\"POWERHOUSE FORMULATION includes Rosehip Oil Pro-Vitamin B5 Amino Acid Complex and an Herbal Blend that deeply nourishes and refreshes aging skin like no other face mask on the market;MOISTURIZING FACE MASK gives effective hydration to dry dull skin Ã‚Â\\xa0Natural and active ingredients including hyaluronic acid and Vitamin E leave skin hydrated radiant and more youthful looking;USING THE HIGHEST concentration of natural and active ingredients possible Never compromising on quality and performance Our goal is to give you beautiful skin in eco-friendly ways Fragrance-free;DEEPLY HYDRATING facial mask delivers moisture directly to the skin and helps calm dry skin irritation Ã‚Â\\xa0Gentle enough for use every day it will become your favorite weapon against dry skin;Satisfaction Guaranteed Unconditional 30-Day Return And Refund Policy Ensures You'll Be Delighted Or Your Money Back Developed By Renowned Aesthetician Angela Irish - For All Skin Types\"]\n{'Brand': 'Auperwel', 'Product Benefits': 'Hydrating', 'Scent': 'Unscented', 'Skin Type': 'Dry', 'Special Feature': 'Not Tested On Animals', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 1 inches; 4 Ounces', 'Item model number': 'GN-15Q6-JVWK', 'UPC': '616806598469', 'Manufacturer': 'Oz Naturals'}\nI had previously been using Lush's Mask of Magnaminty and had really been enjoying it, however I think I was ready for a little bit more of a &#34;grown-up&#34; facial mask to help reduce the appearance of some of the fine lines I have developed in the year since having my son.<br /><br />I have gotten to use this facemask twice and have been super impressed with the results. I am also using the retinol facial moisturizer as well as an ocean mineral toner and cleanser from this brand, and while I was seeing great results from the other products, this mask really supercharged the results. I look like I have had a full nights sleep, which I can assure you I have not! It plumped up some of my wrinkles and just gave my face that dewy fresh appearance that I remember having in my 20s.<br /><br />I received samples of these products to test, but I can't argue with the results. I will certainly be purchasing more from this line.\nGreat when used with the retinol face moisturizer from this brand\nMoYo Natural Labs 8 oz Spray Bottles Fine Mist Empty Travel Containers, BPA Free PET Plastic for Essential Oils and Liquids/Cosmetics (Pack of 2, Blue)\nMoYo Natural Labs\n['MoYo Natural Labs SPRAY BOTTLE 8 OZ HDPE plastic designated by a recyclable does not contain BPA. This leak proof plastic spray bottle BPA free set and made in the USA.', 'MoYo Natural Labs plastic spray bottle 8 oz, reusable, refillable, washable plastic spray plastic bottle is a durable spray oil bottle. Industrial strength plastic spray bottle BPA free for liquids can be used for many of your house cleaning, traveling accessories, essential oil, hairspray and skin care needs including perfume and cologne; a safe plastic water bottle.', 'Designed to last, MoYo Natural Labs 8 oz water bottles that spray mist will save you money and hassle.', 'MoYo Natural Labs spray bottle 8 ounce is ideal as a hair dressing spray bottle and a plastic spray bottle for essential oils, essential skin and body care products.', \"OUR PROMISE! If these mist bottles from MoYo Natural Labs become compromised or leak in the first year, we'll replace your hand spray bottle, even if it is your fault. We're that confident that you'll love your new 8 ounce body spray bottle and will continue to use MoYo Natural Labs 8 oz containers in the future.\", 'CLICK the \"Add to Cart\" button to order the MoYo Natural Labs spray bottle 8 oz Travel Bottle Set and travel bottle containers. today!']\n{'Brand': 'MoYo Natural Labs', 'Color': 'Blue', 'Capacity': '8 Ounces', 'Number of Items': '2', 'Item Dimensions LxWxH': '4 x 1.75 x 4 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4 x 1.75 x 4 inches; 2.4 Ounces', 'Item model number': '8OZBLUEFM2PACK', 'UPC': '641938711219', 'Manufacturer': 'MoYo Natural Labs'}\nThis set of fine misters is absolutely perfect for making room sprays, scented toners, and other things with my favorite essential oils. After giving birth, I made a witch hazel spray for healing, I made a tea tree toner to soothe skin during breakouts, and I made a room spray with lavender and eucalyptus to keep in the room with the diaper changers. It's great that this comes in a set of three and that the sprayers put out a fine mist rather than a thick set of droplets. I also really like the cobalt blue color. Though I received a sample for review, the positive opinion is my own.\nWhat you see is what you get, a great set for essential oil fans\n[Old Version] QuickBooks Desktop Pro 2019 with Enhanced Payroll [PC Disc]\nIntuit\n[\"Get your finances in order with the QuickBooks Desktop Pro 2019 with Enhanced Payroll (PC Disc). This two pack lets you organize your finances and structure your payroll all in the same software. This easy to operate software is used by business professionals all over the world and in all professions. It is as versatile as it is powerful. strong What can QuickBooks Desktop Pro Do?strongThe most powerful feature of QuickBooks Pro is how incredibly easy it is to use. You need absolutely no accounting experience QuickBooks. Every feature and program within QuickBooks Pro has a step by step tutorial to show you how to use it. You can import any existing data you already have from a spreadsheet so you won't have to start from scratch as well as improve your cash flow by easily monitoring and tracking invoices from creation to payment. strong What Can I Use QuickBooks Enhanced Payroll For?strongQuickBooks Enhanced Payroll makes the often difficult job of tracking payroll easier than ever. Now you can keep track of your company's payroll quickly and hassle free. QuickBooks Enhanced Payroll lets you quickly pay your employees, get an instant W 2 at the end of the year and even helps you file taxes at the end of the year. strong What System Is QuickBooks Desktop For?strongThis particular version of QuickBooks Pro is for PC. It is compatible with the following versions of Windows: Windows 7 SP1, 8.1 Update 1, or Windows 10. It also seamlessly integrates with other Windows programs like Microsoft Word and Microsoft Excel. strong60 Day Money Back GuaranteestrongQuickBooks is so confident you are going to love their enhanced payroll system, they are offering a 60 day money back guarantee. If for any reason whatsoever, QuickBooks Pro doesn't meet your expectations, they will completely refund your money. Take advantage of the return policy, all you have to do is return your product to Intuit with a dated receipt for a total refund.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '11 x 0.75 x 7.75 inches; 3.68 Ounces', 'Item model number': '606011', 'UPC': '028287553989 028287553484', 'Manufacturer': 'Intuit'}\nDesktop Pro 2019 upgraded smoothly and easily with absolutely no issues. I began by backing up my QuickBooks desktop Pro 2018, and then began the installation process. It went smoothly and quickly and didn't take very long. I used the express installation which was recommended, and the whole thing was very easily done, retaining all of my previous settings and information.<br /><br />The part that was awful was that I have an existing payroll subscription and had to call into tech-support to upgrade that portion of things. Luckily I was aware of this so when simply entering the information into QuickBooks didn't work, I knew that I was in for a phone call. About 45 minutes later of being on hold and trying to be up sold on QuickBooks online by an Indian tech-support person (hey guys, I just got desktop Pro 2019 upgraded, please don't sell me on QuickBooks online), I was good to go.<br /><br />I think it's absolutely offensive that after you've purchased a software product like this they make you call in as a matter of course to activate. Anybody using this product is either being paid by the hour or runs a business and does not have that kind of spare time to sit around wasting on a process that should be 30 seconds of data entry.<br /><br />I have multiple employees and so end up paying an additional 4 to 8 dollars per month for the subscription to add additional employees. It's another two dollars a month per employee after the first one. Also, be aware that the setting is set to subscribe you to an annual payroll subscription, which if done through QuickBooks will cost you about $420. Purchasing the new upgrade of desktop Pro 2019 with the payroll for a year costs less than that, so being automatically billed such a high amount for just the payroll is offensive and ridiculous.<br /><br />I would really like QuickBooks as a company to reconsider how they deal with their payroll subscriptions and activation of payroll that has already been purchased, because this is a huge problem that is been garnering them poor reviews and lots of bad press for some time. I personally have considered many times changing to a more congenial company just to avoid this particular dance every single year. Do I pay $420 to avoid being on the phone for 45 minutes with somebody from India who act like I've done something terribly wrong by purchasing my payroll upgrade on Amazon along with the software upgrade? Or do I do as I have done most years and purchase the yearly upgrade that comes with the enhanced payroll.<br /><br />As an FYI, the enhanced payroll really does make it very easy to run your quarterly reports and do your e-filing. I did it myself for many years, but now hand the file back and forth to my bookkeeper via email as a portable file.\nDesktop Pro 2019 works great; upgrading an existing payroll subscription is awful\nC.O. Bigelow No. 007 Dr Hiosous Quince Hand Lotion, 4 Ounces\nC. O. Bigelow\n{'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion', 'Unit Count': '4 Ounce', 'Number of Items': '1', 'Use for': 'Hands', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 2 x 0.7 inches; 5.61 Ounces', 'Item model number': '20002240'}\nI wasn't sure what to expect from this, since most of the products from this line have had some level of fragrance are essential oil to them, but this is a very simple, unscented hand lotion, or rather a thick cream, which applies easily from the fliptop lid in small enough quantities that it is easy to control, and sinks into my skin almost immediately for a very fast effect.<br /><br />As a landscaper, I have a few fingers that remain cracked and peeling for a good portion of the winter, and I've tried a number of different brands of hand cream to fix this. I was really impressed that after only a few days of use, my sides of my fingers of already healed. I didn't expect anything like that, and while I usually prefer to use hand lotions that are scented in some exciting fashion, I am partial to smelling of cupcakes or essential oils, I'm happy to have this simple work horse of a hand cream if it's going to do such a great job.\nSuper moisturizing unscented hand cream\nSHANGPREE Eye Mask (30 pair｜60 masks), under eye patches, Premium Korean Skin Care (Coral Calming)\nSHANGPREE SPA CARE SYSTEM\n{'Brand': 'SHANGPREE SPA CARE SYSTEM', 'Product Benefits': 'Moisture,Smooth', 'Scent': 'Liquorice', 'Special Feature': 'Non Toxic', 'Unit Count': '60.00 Count', 'Product Dimensions': '3.31 x 3.31 x 1.61 inches; 2.96 Ounces'}\nI shouldn't be surprised, since this brand has an incredibly good reputation for providing a high-end and effective experience, but I was indeed surprised by just how much I love these effective and cooling little gel eye masks. I have tried a number of gel eye masks in the past and found them reasonably pleasant, but this one actually left my skin around my eyes notably moisturized and looking younger for the rest of the day after use.<br /><br />I just put these on in the morning right after my shower and did the rest of my facial and hair care routine, got dressed and by the time I was ready to greet my day, I took off the eye masks and moisturized, and the moisture that the eye masks held in actually seemed to take hold and reduce the fine lines that I usually have around my eyes from lack of sleep and having small children and a business to manage.<br /><br />The fragrance is very light and unobtrusive, and the experience of using these is very luxurious. I have tried other eye masks that did not fit very well around my eye area, but these were shaped very nicely.\nBlows away the other I masks I've tried\nSenvenski Color Changing Gel Nail Polish Purple Blue Glitter Fall Autumn Halloween Christmas Kit Chameleon Soak Off UV LED Temperature Art Manicure Kit Varnish (WB020)\nsenvenski\n{'Brand': 'Senvenski', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Natural, Cruelty Free, Non-Tox', 'Age Range (Description)': 'Adult', 'Number of Pieces': '4', 'Liquid Volume': '7.3 Milliliters', 'Item Dimensions LxWxH': '5.51 x 3.94 x 0.59 inches', 'Item Weight': '0.05 Kilograms', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.51 x 3.94 x 0.59 inches; 1.76 Ounces', 'UPC': '613635848659'}\nThe color change works well. The colors themselves though are very translucent. The sparkles are large and sparse, but good quality that somehow doesn't feel rough.<br /><br />It cured up well and had decent durability. Overall I'm happy with the quality. I do wish the bottles made the colors inside a little more obvious.\nGood durability and a nice look, even the bigger sparkles do not feel rough\n24 Colors Butterfly Glitter Nail Sequins,3D Holographic Nail Art Flakes Colorful Confetti Glitter Sticker Decals Laser Acrylic Paillettes for Nail Art Decoration & DIY Crafting (style 2+5)\nFekey&JF\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.94 x 0.79 x 0.39 inches; 1.59 Ounces'}\nMy kids and I have been doing a lot of crafting which involves placing tiny sequins and gems on to small painted wooden or clay items, and so while we are not using these for the intended purpose of going on nails, we have been going through these quickly using tweezers to get them out and apply to our craft projects.<br /><br />I've been really impressed with the variety of the sequins, the quality level of them with the thickness and color reflectivity being great, and the quantity given. We all really love these beautiful butterflies and how vivid and fun they are.\nSo much fun!\nC.O. Bigelow Shampoo, Lavender Peppermint Shampoo Cleanses & Soothes Hair & Scalp, Luxury Shampoo for Men & Women, 10.4 Fl Oz.\nC. O. Bigelow\n{'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion,Liquid,Gel', 'Scent': 'Fresh,Lavender,Peppermint', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Package Dimensions': '5.91 x 2.32 x 2.24 inches; 10.4 Ounces', 'UPC': '815691009023'}\nI love the zingy, fragrant scent of the shampoo. It feels relatively unisex, and doesn't leave a lot of fragrance lingering behind after you rinse it out. I followed up with a peppermint conditioner from the natural food store, and really enjoyed the lovely cooling summer pick me up for my hair.<br /><br />The shampoo is not overly stripping, but definitely leans more towards really getting things clean rather than being overly moisturizing. I found that I could use it about three times a week on my long hair, and then needed to do co-washing or something more moisturizing in between. I really like the shampoo and appreciate having something more herbal like this in my regimen.\nInvigorating and fragrant\nCremorlab Mineral Treatment Essence 9.1 Fl. Oz. 270ml Water Essence, Serum for Face, Face Moisturizer\nCREMORLAB\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.76 x 2.13 x 6.69 inches; 11.29 Ounces', 'Item model number': '8.80934E+12'}\nThis is kind of like a cross between a toner and a serum. I have been using it kind of like klairs moisturizing toner, even though it is a little thinner than that. It slaps on and seems to spread over my face nicely, sinks in very quickly, and provides a nice boost of moisture prior to putting on a thicker serum and then moisturizer.<br /><br />I had been reading about this product for really long time before trying it and it's kind of a cult favorite in the K beauty world. I can see why. It's not flashy, but as a first thing to splash on your face and hold in some of that moisture, it works well and doesn't clash with other products.\nLovely first essence\n6 Pcs Pink Baby Girl Hair Bow Clips Set, Alligator Clip Hair Accessories with Gift Box, Back to School Dress\nAmacle\n{'Brand': 'Amacle', 'Hair Type': 'All', 'Age Range (Description)': 'Child', 'Unit Count': '6.00 Count', 'Number of Pieces': '6', 'Package Dimensions': '6 x 6 x 2 inches; 4.8 Ounces', 'UPC': '743811744526'}\nMy five-year-old absolutely adores these big, beautiful bows for the hair. The alligator clips are easy for her to use even by herself, and not only does she likes to wear them, but she also loves to put them on her 18 inch American girl style dolls..<br /><br />There is a beautiful array of child pleasing colors and patterns, and these were a big hit at our house.\nSuper fancy big bows for little girls",
  "profile": "The user continues to prioritize high-quality, organic skincare and hair care products that emphasize repair, moisture retention, and natural ingredients, particularly favoring eco-friendly options suitable for their household with a baby. They prefer mild, herbal, and invigorating scents that blend personal indulgence with practicality, as demonstrated by their use of unscented hand cream.\n\nTheir recent interest has expanded to user-friendly financial management tools, reflecting a quest for efficiency in their busy lifestyle. Aesthetic appeal plays a significant role in their choices, highlighted by their investment in colorful craft materials for creative family activities, showcasing a commitment to family engagement and creativity.\n\nIn addition, they actively seek out products that enhance their family's enjoyment, such as vibrant accessories for their child, ensuring that their daily routines are both functional and fun. Their skincare regimen remains focused on moisture retention and anti-aging benefits, incorporating essential oils and homemade solutions. They recently embraced refreshing products that add variety to their routines, signaling an openness to invigorating experiences that align with their values of quality and convenience.\n\nOverall, the user is dedicated to enhancing their beauty and care regimens with effective, enjoyable, and eco-conscious products that support their family-centric lifestyle, while also encouraging their child's creativity and self-expression through playful accessories.",
  "metrics": {
    "rouge1_f": 0.0730367929708951,
    "rouge2_f": 0.008791208791208791,
    "rougeL_f": 0.0400878638110928,
    "meteor": 0.02252418814871391,
    "bleu1": 3.466800766748746e-08,
    "bleu2": 1.3599311203562213e-08,
    "bleu3": 4.70712489269488e-09,
    "bleu4": 1.3109393848793878e-09,
    "bertscore_precision": 0.3437102735042572,
    "bertscore_recall": 0.5258767604827881,
    "bertscore_f1": 0.415712833404541
  }
}