{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Halloween Mouth Tattoos Temporary for Clown Cosplay(10pcs)Tattoos Face stickers Prank Props for Cosplay Party Halloween Decorations Favor Supplies\nReview Date: 2022/09/25\nStore: HCNOCNB\nAverage Rating: 3.4\nProduct Details: {'Brand': 'HCNOCNB', 'Water Resistance Level': 'Waterproof', 'Number of Pieces': '10', 'Package Dimensions': '5.16 x 2.8 x 0.16 inches; 0.74 Ounces', 'UPC': '647349476174'}\nReview Text: I havent tried these before, but I have used temporary tattoos. I was really excited to try them out because they look so cool when I've seen them on social media. I would say they are sized like regular mouths, so perfect for older kids and even adults but they wont be super large. They apply easily with water, I would just wait a minute or two before opening your mouth so its dry, You want to make sure to create the opening slowly and that its adhered to your lips or it will tear and ruin the effect. I was able to take it all of with make up remover without too much scrubbing.\nReview Title: fun for kids\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "UPHUNAL Handmade Short Coffin False Nails Set Long Press on Nails Fake Nails 24Pcs for Any Occasions Reusable Acrylic Matte Artificial Nails with Nail File Gifts for Women and Girls (Cute Pink)\nUPHUNAL\n{'Material': 'Acrylic', 'Brand': 'UPHUNAL', 'Coverage': 'Half Well Tips', 'Number of Pieces': '24', 'Shape': 'Ballerina', 'UPC': '735626573330'}\nThese nails are adorable, not your average designs and pretty charming because they look handmade. I am disappointed this set doesnt come with glue (just the little sticker pads) but I have some on hand so no big deal. Also there are so few of the cute design nails, mostly just the black ones.\nEdgy designs cute style\n(YOUMIDI) Brush and Cat Brush-Smooth combing brush for short and long hair-Pet shedding combing brush, which can remove loose hair, mats, tangles (Gray)\nyoumidi\n{'Brand': 'Youmidi', 'Color': 'Gray', 'Shape': 'Oblong', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Package Dimensions': '10.31 x 5.04 x 2.28 inches; 3.53 Ounces', 'Item model number': '021', 'UPC': '768647685706'}\nWe ordered this brush to help train our puppy to enjoy being brushed because the bristles are small and it wont pull on him too much. He enjoys us running it over his coat, but we're working on building up his tolerance to it so we haven't gotten to brush him with it fully. He is a husky mix with a short length coat. The brush is really easy to clean when needed,  just press the button.\ngreat for training puppy\nBy Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nBy Terry\n{'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nThis powder is awesome because of the color it will always match with my foundation. It goes on a little white, but after letting it set for a few minutes it dusts off to be completely clear. I love the compact and think this powder holds up well with setting spray.\ngreat matte powder\nMAEPEOR Body Luminizer 5 Colors Waterproof Shimmer Face Body Glow Illuminator Non-sticky Liquid Body Highlight Illuminator (Pearl White, 30 ML)\nMAEPEOR\n{'Item Form': 'Liquid', 'Finish Type': 'Shimmery', 'Coverage': 'Light', 'Brand': 'MAEPEOR', 'Unit Count': '1.00 Fl Oz', 'Product Dimensions': '1.18 x 0.79 x 0.39 inches; 3.53 Ounces'}\n[[VIDEOID:23fcf2a166170d46e6854b0d5be13433]] This body luminizer is so pretty once applied! It has amazing coverage and is really waterproof.\neasy to apply\nMRTREUP Elastic Bands For Wig 3Pcs Lace Band Edge Band For Melting Lace Front Wig, Hair Edge Wrap To Lay Edges , Edge Brush For Baby Hair Adjustable Wig Band Rail Tail Comb For Braided\nMRTREUP\n{'Age Range (Description)': 'Baby', 'Material': 'Latex', 'Number of Items': '3', 'Brand': 'MRTREUP', 'Size': 'One Size', 'Package Dimensions': '9.06 x 2.87 x 1.3 inches; 2.08 Ounces'}\nThis set comes with nice high quality tools, I love the comb and the little edge brush. The bands are nice too, easy to use and adjustable so you can get a good fit.\nwork okay and come with nice tools\nHalloween Mouth Tattoos Temporary for Clown Cosplay(10pcs)Tattoos Face stickers Prank Props for Cosplay Party Halloween Decorations Favor Supplies\nHCNOCNB\n{'Brand': 'HCNOCNB', 'Water Resistance Level': 'Waterproof', 'Number of Pieces': '10', 'Package Dimensions': '5.16 x 2.8 x 0.16 inches; 0.74 Ounces', 'UPC': '647349476174'}\nI havent tried these before, but I have used temporary tattoos. I was really excited to try them out because they look so cool when I've seen them on social media. I would say they are sized like regular mouths, so perfect for older kids and even adults but they wont be super large. They apply easily with water, I would just wait a minute or two before opening your mouth so its dry, You want to make sure to create the opening slowly and that its adhered to your lips or it will tear and ruin the effect. I was able to take it all of with make up remover without too much scrubbing.\nfun for kids",
  "profile": "**User Summary:**\n\n- **Style Preference**: Enjoys unique and handmade designs with a strong attraction to edgy and cute aesthetics, demonstrating an interest in playful and creative items.\n- **Product Types**: Has a keen interest in false nails and cosmetic products that enhance longevity and appearance, recently expanding to tools for wig application and edge styling, as well as temporary tattoos for themed events.\n- **Material Preference**: Prefers high-quality, durable materials; favors acrylics for nails, non-sticky formulations in cosmetics, and reliable materials in beauty tools to ensure optimal user experience.\n- **Design Focus**: Seeks visually striking patterns, finishes, and effective coverage in beauty items, appreciating functional yet stylish tools that contribute to an overall aesthetic.\n- **Functionality and Usability**: Values reusability and practical applications, prioritizing multifunctional grooming tools that enhance beauty routines.\n- **Price Sensitivity**: Evaluates products based on features and design rather than cost alone, seeking high-quality beauty items with excellent performance.\n- **Review Behavior**: Provides constructive feedback, often emphasizing effectiveness and ease of use, typically rating products between 4.0 to 5.0, which reflects satisfaction with those meeting aesthetic and functional expectations.\n- **Overall Rating**: Generally favors products that merge creativity and practicality, ensuring a harmonious blend of style and function across various categories, including fun, themed accessories for special occasions.\n\nThe user's evolving interests underscore a playful engagement with beauty and grooming, consistently prioritizing distinctive and multifunctional items that enhance their aesthetic expression.",
  "metrics": {
    "rouge1_f": 0.1724137931034483,
    "rouge2_f": 0.012958963282937365,
    "rougeL_f": 0.07758620689655173,
    "meteor": 0.07992910005268089,
    "bleu1": 0.042689551869762095,
    "bleu2": 0.010134860265089092,
    "bleu3": 0.001705292190643299,
    "bleu4": 0.0007000752416868262,
    "bertscore_precision": 0.37210530042648315,
    "bertscore_recall": 0.4481520652770996,
    "bertscore_f1": 0.40660351514816284
  }
}