{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 100% PURE Coconut Body Scrub Exfoliating Deep Cleanse with Sea Salts & Nourishing Oils - Natural Deeply Moisturizing Skincare - Vibrant Radiant Skin Restore & Pore Cleanser - Vegan - 10oz\nReview Date: 2022/03/21\nStore: 100% PURE\nProduct Description: ['Crystalline sea salt scrub smoothes while softening skin with rich, supple moisture. Suspended in a base of silky sunflower and apricot oils, this emollient sea salt scrub buffs away bumps and flakes to reveal glowing, rejuvenated skin.']\nAverage Rating: 3.8\nProduct Details: {'Brand': '100% PURE', 'Material Feature': 'Natural', 'Number of Items': '1', 'Scent': 'Coconut', 'Recommended Uses For Product': 'Exfoliating', 'Package Dimensions': '3.66 x 3.62 x 1.93 inches; 11.99 Ounces', 'UPC': '843585107999', 'Manufacturer': '100% PURE'}\nReview Text: This scrub works great it’s very moisturizing.The granules are on the bigger side.It has a coconut scent that dries down to a very light hint of a fragrance after awhile.The hydrating effect last long.\nReview Title: Very moisturizing\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "JIMIRE Extra Powerful Gel Remover with Brush Applicator for Professional Eyelash Extensions | Quick & Gentle Remove Adhesive in 60s with No Fume | Easy & Convenient to Use | 10 ml\nJIMIRE\n{'Package Dimensions': '5.12 x 1.42 x 0.67 inches; 1.41 Ounces', 'UPC': '732376371056'}\nIt removes the lashes very quickly and gently!The gel pen is easy to control the amount and the brush is so soft.A must buy!!\nVery effective\nMERISIHAIR Short Pink Bob Wig for Women,Pink Short Straight Wig ,Shoulder Length Bob Wigs for Women Colorful Fashion Bob Wigs\nMERISIHAIR\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'MERISIHAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.24 x 6.93 x 2.91 inches; 10.55 Ounces', 'UPC': '780744482941'}\nNice cute wig.The color is very pretty.\nNice wig\nHair Tinsel Strands Sparkling Shiny Glitter Dazzle Bling 100CM 17 Color 2500 Strands Heat Resistant Hair Extensions Christmas Gift For Kid Party Party Highlights (40 Inch, 17 Colors Hair Tinsel)\nIthadnam\n{'Brand': 'Ithadnam', 'Hair Type': 'Color', 'Material Feature': 'Natural', 'Package Dimensions': '12.48 x 9.53 x 1.06 inches; 5.93 Ounces', 'UPC': '781509670498'}\nI was expecting these to be hard for some reason but they are incredibly soft. I love the variety of colors.\nSoft\nNERISSA HAIR\nNERISSA\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'NERISSA', 'Package Dimensions': '9.84 x 7.56 x 1.18 inches; 2.93 Ounces'}\nI was impressed as this wig is better than expected.It’s a cute pixie look with a great deep brown color.The hair is smooth.\nBetter\nwest kiss 613 Honey Blonde Short Bob Wigs Human Hair 2x6 Deep Parting Hairline Straight Lace Bob Wig Pre Plucked with Baby Hair for Black Women 12 inches\nwest kiss\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'west kiss', 'Package Dimensions': '11.22 x 8.39 x 2.6 inches; 8.47 Ounces'}\nI never thought I would like a 2x6 but…This wig is an absolute yes!I love it so much.The lace is great as well as the part.The hair is amazing and it comes pretoned wow.The hair is soft and full and bouncy.\nAbsolutely yes\nJanier Coffin Nail Tips Nail Glue Kit,2 In 1 Nail Glue Base Coat Top Coat for Acrylic Nail with Coffin Fake Nail and U V LED Nail Lamp,Nail Extension Gel DIY Home Nail Art Set…\nJanier\n{'Brand': 'Janier', 'Material': 'Acrylic', 'Item Form': 'Gel', 'Item Package Quantity': '1', 'Item Volume': '10 Milliliters', 'Package Dimensions': '7.72 x 4.25 x 3.98 inches; 15.2 Ounces', 'UPC': '750081717808'}\n[[VIDEOID:d4ff51d7ad82fa0bd32f178f4e8ce7e2]] I like this set.It is a good value.The tips are a nice size and have a little curve to them.They are flexible too.I was so happy about how quickly the little light cured the nail on with the nail gel glue that’s provided.\nGood value set\nBrazilian Virgin Hair Body Wave Bundles 10A Unprocessed Brazilian Human Hair Weave Body Wave Hair Weave Extensions Brazilian Body Wave Human Hair 3 Bundles Body Wave (18 20 22 Inch)\nWOWQUEEN\n{'Brand': 'WOWQUEEN', 'Color': 'Black', 'Material': 'Human Hair', 'Extension Length': '22 Inches', 'Hair Type': 'Wavy'}\nThe body wave of the bundles are nice.They’re are some short hairs on some of the bundle.The hair has a very natural density.\nNice wave\nAliPearl Hair Wig Highlight Grey Body Wave Lace Front Closure Wigs Human Hair Platinum Blonde Highlight Wig Brazilian Body Wave 4x4 Lace Closure Wigs Pre Plucked Human Hair Wigs For Black Woman 24 Inch\nAli Pearl\n{'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Ali Pearl', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.06 x 8.54 x 3.66 inches; 12.31 Ounces'}\nI was under the impression that I was ordering a 13x4 Lacefrontwig which was stated in the description when I ordered.However I received a 4x4 Lacewig.I liked the hair color and texture but I had to return it due to the wrong advertisement.\nNot 13x4\n100% PURE Coconut Body Scrub Exfoliating Deep Cleanse with Sea Salts & Nourishing Oils - Natural Deeply Moisturizing Skincare - Vibrant Radiant Skin Restore & Pore Cleanser - Vegan - 10oz\n100% PURE\n['Crystalline sea salt scrub smoothes while softening skin with rich, supple moisture. Suspended in a base of silky sunflower and apricot oils, this emollient sea salt scrub buffs away bumps and flakes to reveal glowing, rejuvenated skin.']\n{'Brand': '100% PURE', 'Material Feature': 'Natural', 'Number of Items': '1', 'Scent': 'Coconut', 'Recommended Uses For Product': 'Exfoliating', 'Package Dimensions': '3.66 x 3.62 x 1.93 inches; 11.99 Ounces', 'UPC': '843585107999', 'Manufacturer': '100% PURE'}\nThis scrub works great it’s very moisturizing.The granules are on the bigger side.It has a coconut scent that dries down to a very light hint of a fragrance after awhile.The hydrating effect last long.\nVery moisturizing",
  "profile": "**Updated User Profile Summary:**\n\n**Preferences:**\n- Values efficiency in beauty products, favoring quick, effective, and gentle solutions for easy application.\n- Enjoys vibrant and fashionable hair options, reflecting a playful and creative approach to beauty.\n- Prioritizes convenience and user control in product usage, particularly for hair, lash, and nail maintenance.\n- Appreciates softness and comfort in beauty products, focusing on high-quality materials and effective application techniques for extensions and wigs.\n- Exhibits a discerning consumer attitude, actively providing feedback on product effectiveness, value, and transparency in product descriptions.\n\n**Trends:**\n- Recently expressed satisfaction with a moisturizing body scrub, demonstrating a keen interest in skincare products that deliver hydration and a pleasant sensory experience.\n- Reported mixed experiences with hair products, indicating a desire for transparency in product marketing and an emphasis on accurately portrayed features.\n- Continues to praise well-designed applicators and tools, valuing comfort and efficiency in product usage.\n- Shows a favorable attitude towards aesthetic appeal and practicality, with an ongoing focus on vibrant colors and unique styles.\n- Engages with modern beauty solutions across hair, skin, and nail care, seeking innovative, trendy options that combine creativity with comfort.\n\nThis updated profile highlights a user dedicated to effective and gentle beauty solutions, embracing vibrant self-expression and maintaining a critical eye towards product accuracy in their purchases.",
  "metrics": {
    "rouge1_f": 0.15579357351509251,
    "rouge2_f": 0.007804878048780489,
    "rougeL_f": 0.07010710808179163,
    "meteor": 0.06371736427683383,
    "bleu1": 0.018830373515454288,
    "bleu2": 0.0019458796731669013,
    "bleu3": 0.0004243762359385746,
    "bleu4": 0.00019837283877894478,
    "bertscore_precision": 0.35780638456344604,
    "bertscore_recall": 0.4640173316001892,
    "bertscore_f1": 0.4040486216545105
  }
}