{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Karuna Oh, Glow On Face Mask Sheet, Skincare and Beauty Facial Masks with Moisturizing and Collagen Promotion Properties for Healthy Glow, Contain Green Tea, Vitamin C and Pineapple (3 Sheets)\nReview Date: 2021/06/22\nStore: Karuna\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrate Skin,Hydrate', 'Scent': 'Pineapple', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.54 x 4.88 x 0.87 inches; 9.59 Ounces', 'Item model number': 'MSF1004 - CA', 'UPC': '857950007166'}\nReview Text: Nice, refreshing.  Mask had a pleasant scent and fit well.  Skin felt nice and was not irritated after removal but I did need to add extra moisturizer because my skin is so dry.  No lasting results so while nice, this is a pass for me.\nReview Title: Nice; but not outstanding\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Replacement Toothbrush Heads Compatible With Oral B Braun Electric Toothbrush, 4 Count\nHDY\n{'Brand': 'HDY', 'Size': '4 Count (Pack of 1)', 'Age Range (Description)': 'Adult', 'Item Firmness Description': 'Extra Soft', 'Number of Pieces': '4', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.43 x 0.39 x 2.76 inches; 0.81 Ounces', 'UPC': '632088377561', 'Manufacturer': 'HDY'}\nThese are a solid generic replacement for our Oral-B brush heads.  They fit every toothbrush in the house without issue and work well.  They are a bit more angular than the name brand and I can tell, but my wife and kids didn't notice.  My kids love the smiley face on the back of the brush head.  A solid generic replacement.\nGood generic brush heads\nN3 No Name Necessary Pore Minimizing Moisturizing Scented Long-Lasting Anti-aging and Hydrating Face Primer Spray – (200ml)\nNo Name Necessary\n{'Brand': 'No Name Necessary', 'Skin Type': 'Normal', 'Package Information': 'Bottle', 'Specialty': 'Moisturizing, Cruelty Free, Vegan', 'Unit Count': '1.0 Ounce', 'Package Dimensions': '7.6 x 1.8 x 1.5 inches; 11.99 Ounces'}\nIt's a good product, not a great one for a primer.  Nothing overly wrong but I've used better.  This one's major flaw is that the spray is hard to keep out of my hair which causes issues on that side of the beauty regime.\nGood but application needs work\nCaudalie Vinosource SOS Intense Hydration Set: Hydrating Trio for Sensitive Skin including a Daily Foam Cleanser, Hydrating Serum, Facial Moisturizer\n{'Package Dimensions': '6.93 x 5.35 x 2.64 inches; 14.5 Ounces'}\nYou get a full size serum, mini face wash, and mini moisturizer for the price of the serum.  Beautiful presentation makes an excellent gift. Love this set!  I started using these products when my skin was breaking out and upset.  These have completely calmed and fully moisturized my skin.  My skin is now glowing!\nExcellent hydration and fantastic deal!\nKaruna 7 Days of Glow - Face & Eye Mask Variety Pack (7 Sheets), Hydrate, Brighten and Glow\nKaruna\n{'Package Dimensions': '7.05 x 5.04 x 1.57 inches; 8.75 Ounces', 'UPC': '857950007333'}\nGreat packaging.  I really like how they give you an idea to use each mask.  Not the best for my sensitive skin though...  I totally missed that 3 out of the 4 masks have a warning \"Not suitable for Sensitive Skin\" on the packaging so pay attention!.  You get: Clarifying+ Face Mask, Brightening+ Face Mask, Exfoliating+ Face Mask and Hydrating.  Even the hydrating was a bit much for my sensitive skin.  The Exfoliating... well I really enjoyed the hydrating!\nVariety pack with great packaging!\nDr. Au Anti-Aging Face Oil Retinol Serum by Au Natural Skinfood - Promotes Youthful, Glowing Skin | Collagen Boosting Wrinkle Repair | No Oily Residue - Just Soft to the Touch Skin | Day & Night Moisturizing treatment for Men and Women\nAÚ NATURAL SKINFOOD\n{'Brand': 'AÚ NATURAL SKINFOOD', 'Item Form': 'Oil', 'Number of Items': '1', 'Skin Type': 'Oily', 'Item Volume': '4 Fluid Ounces', 'Product Dimensions': '0.9 x 0.9 x 3.8 inches; 1.59 Ounces'}\nImmediately hydrates and diminishes my fine lines.  Still need a moisturizer during the dry winter, but will probably be able to use on it's own come spring.  Over all I really like it, but would like it even more if there was no mica or parfum.\nImmediate hydration!\nSpanature Aloe Vera Hand & Body Lotion Travel Size Selection, 4 Pack, Relaxing and Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nSpanature\n{'Brand': 'Spanature', 'Item Form': 'Lotion', 'Unit Count': '10.1 Ounce', 'Number of Items': '4', 'Use for': 'Hands', 'Package Dimensions': '4.21 x 3.62 x 2.8 inches; 1.05 Pounds', 'UPC': '088234470585'}\nThe four tubes arrived individually packed in cute boxes that looked like wrapped presents.  The hand cream absorbs nicely and leaves hand moisturized without a greasy feeling.  The aloe scent is appealing- light and fresh.  The only thing I don't like is that it feels like it leaves a film on the skin(maybe the mineral oil?)- so I prefer to use it on my hands where it doesn't bother me as much\nBeautifully wrapped; nice scent; absorbs quickly!\nKaruna Oh, Glow On Face Mask Sheet, Skincare and Beauty Facial Masks with Moisturizing and Collagen Promotion Properties for Healthy Glow, Contain Green Tea, Vitamin C and Pineapple (3 Sheets)\nKaruna\n{'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrate Skin,Hydrate', 'Scent': 'Pineapple', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.54 x 4.88 x 0.87 inches; 9.59 Ounces', 'Item model number': 'MSF1004 - CA', 'UPC': '857950007166'}\nNice, refreshing.  Mask had a pleasant scent and fit well.  Skin felt nice and was not irritated after removal but I did need to add extra moisturizer because my skin is so dry.  No lasting results so while nice, this is a pass for me.\nNice; but not outstanding",
  "profile": "**User Summary Update:**\n\n- **Preference for Quality and Value:** The user maintains a strong focus on high-quality personal care products that are gentle and effective for sensitive skin. Their recent acquisition demonstrates a continued commitment to hydrating solutions, although they seek products with lasting benefits.\n\n- **Family-Oriented Focus with a Personal Touch:** Balancing family care with personal wellness is crucial. The user appreciates self-care items that consider household responsibilities while addressing individual skincare needs.\n\n- **Functionality and Efficacy:** The user insists on effective hydration in their skincare, favoring products that absorb quickly and do not leave a greasy finish. They remain vigilant regarding problematic ingredients, adopting a cautious stance towards new formulations.\n\n- **Attention to Detail with Presentation:** The user values aesthetically pleasing packaging and thoughtful presentation, enhancing both personal use and gifting experiences.\n\n- **Positive Engagement with Constructive Feedback:** The user typically provides favorable ratings for products that meet their expectations but is also willing to give constructive feedback when a product falls short. They appreciate pleasant scents and fit but emphasize the importance of long-lasting results.\n\n- **Positive Family Engagement:** The user continues to explore options suitable for the entire family, ensuring their personal sensitivity needs are addressed within a broader context.\n\nIn summary, the user seeks effective, visually appealing personal care products that elevate both individual and family skincare routines, reflecting their dedication to self-care and quality in every purchase.",
  "metrics": {
    "rouge1_f": 0.1919096895578551,
    "rouge2_f": 0.024505183788878417,
    "rougeL_f": 0.08090310442144873,
    "meteor": 0.07763330415570513,
    "bleu1": 0.02474625946026104,
    "bleu2": 0.007058741198811102,
    "bleu3": 0.0022364509596784475,
    "bleu4": 0.0007085280848832117,
    "bertscore_precision": 0.38208717107772827,
    "bertscore_recall": 0.48799002170562744,
    "bertscore_f1": 0.4285935163497925
  }
}