{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Karuna 7 Days of Glow - Face & Eye Mask Variety Pack (7 Sheets), Hydrate, Brighten and Glow\nReview Date: 2021/01/28\nStore: Karuna\nAverage Rating: 4.4\nProduct Details: {'Package Dimensions': '7.05 x 5.04 x 1.57 inches; 8.75 Ounces', 'UPC': '857950007333'}\nReview Text: Great packaging.  I really like how they give you an idea to use each mask.  Not the best for my sensitive skin though...  I totally missed that 3 out of the 4 masks have a warning \"Not suitable for Sensitive Skin\" on the packaging so pay attention!.  You get: Clarifying+ Face Mask, Brightening+ Face Mask, Exfoliating+ Face Mask and Hydrating.  Even the hydrating was a bit much for my sensitive skin.  The Exfoliating... well I really enjoyed the hydrating!\nReview Title: Variety pack with great packaging!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Replacement Toothbrush Heads Compatible With Oral B Braun Electric Toothbrush, 4 Count\nHDY\n{'Brand': 'HDY', 'Size': '4 Count (Pack of 1)', 'Age Range (Description)': 'Adult', 'Item Firmness Description': 'Extra Soft', 'Number of Pieces': '4', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.43 x 0.39 x 2.76 inches; 0.81 Ounces', 'UPC': '632088377561', 'Manufacturer': 'HDY'}\nThese are a solid generic replacement for our Oral-B brush heads.  They fit every toothbrush in the house without issue and work well.  They are a bit more angular than the name brand and I can tell, but my wife and kids didn't notice.  My kids love the smiley face on the back of the brush head.  A solid generic replacement.\nGood generic brush heads\nN3 No Name Necessary Pore Minimizing Moisturizing Scented Long-Lasting Anti-aging and Hydrating Face Primer Spray – (200ml)\nNo Name Necessary\n{'Brand': 'No Name Necessary', 'Skin Type': 'Normal', 'Package Information': 'Bottle', 'Specialty': 'Moisturizing, Cruelty Free, Vegan', 'Unit Count': '1.0 Ounce', 'Package Dimensions': '7.6 x 1.8 x 1.5 inches; 11.99 Ounces'}\nIt's a good product, not a great one for a primer.  Nothing overly wrong but I've used better.  This one's major flaw is that the spray is hard to keep out of my hair which causes issues on that side of the beauty regime.\nGood but application needs work\nCaudalie Vinosource SOS Intense Hydration Set: Hydrating Trio for Sensitive Skin including a Daily Foam Cleanser, Hydrating Serum, Facial Moisturizer\n{'Package Dimensions': '6.93 x 5.35 x 2.64 inches; 14.5 Ounces'}\nYou get a full size serum, mini face wash, and mini moisturizer for the price of the serum.  Beautiful presentation makes an excellent gift. Love this set!  I started using these products when my skin was breaking out and upset.  These have completely calmed and fully moisturized my skin.  My skin is now glowing!\nExcellent hydration and fantastic deal!\nKaruna 7 Days of Glow - Face & Eye Mask Variety Pack (7 Sheets), Hydrate, Brighten and Glow\nKaruna\n{'Package Dimensions': '7.05 x 5.04 x 1.57 inches; 8.75 Ounces', 'UPC': '857950007333'}\nGreat packaging.  I really like how they give you an idea to use each mask.  Not the best for my sensitive skin though...  I totally missed that 3 out of the 4 masks have a warning \"Not suitable for Sensitive Skin\" on the packaging so pay attention!.  You get: Clarifying+ Face Mask, Brightening+ Face Mask, Exfoliating+ Face Mask and Hydrating.  Even the hydrating was a bit much for my sensitive skin.  The Exfoliating... well I really enjoyed the hydrating!\nVariety pack with great packaging!",
  "profile": "**User Summary:**\n\n- **Preference for Quality and Value:** The user continues to prioritize high-quality, effective products in personal care while maintaining a budget-friendly approach. Their recent purchase reflects a growing willingness to invest in premium items, particularly those that promise hydration and brightness, though the user remains cautious due to sensitive skin.\n\n- **Family-Oriented Focus with a Personal Touch:** The user balances family needs with personal wellness, emphasizing individual care alongside household responsibilities. Their choice in personal care products indicates an ongoing commitment to self-care.\n\n- **Functionality and Efficacy:** There is a strong focus on practical features and overall effectiveness of products. The recent review highlights a need for products to cater to sensitive skin, maintaining a critical eye for those that do not meet this requirement.\n\n- **Attention to Detail with Presentation:** The user appreciates well-designed packaging and the informative nature of products, indicating that aesthetics and thoughtful presentation are important, especially for gift-giving scenarios.\n\n- **Positive Engagement:** The user's consistent average rating of around 4.0 illustrates a trend toward rewarding products that exceed expectations, with a recent review reflecting satisfaction despite some drawbacks related to sensitive skin.\n\n- **Positive Family Engagement:** The user’s ongoing interest in kid-friendly products continues, showcasing a holistic approach to family care, but there is a stronger emphasis on personal wellness and careful consideration of product compatibility.\n\nOverall, the user seeks effective, high-quality solutions that harmoniously serve both individual and family needs, reflecting an evolving perspective on self-care within the household.",
  "metrics": {
    "rouge1_f": 0.23919308357348706,
    "rouge2_f": 0.011560693641618495,
    "rougeL_f": 0.09798270893371756,
    "meteor": 0.12206505745107069,
    "bleu1": 0.13136970207256998,
    "bleu2": 0.03629580991702797,
    "bleu3": 0.012371334617848059,
    "bleu4": 0.004064919800581887,
    "bertscore_precision": 0.3846803307533264,
    "bertscore_recall": 0.4398213028907776,
    "bertscore_f1": 0.4104069471359253
  }
}