{
  "interaction_number": 16,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/11/10\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語'], 'Directors': ['Scott Winant', 'Dan Attias', 'Gloria Muzio', 'Minkie Spiro', 'Daisy von Scherler Mayer', 'Roxann Dawson'], 'Producers': ['Dana Calvo', 'Darlene Hunt', 'Lynda Obst', 'Jeff Okin', 'Scott Winant', 'Don Kurt'], 'Starring': ['Genevieve Angelson', 'Anna Camp', 'Erin Darke'], 'Studio': ['Amazon Studios']}\nReview Text: Disappointing in some ways. More about sex than the feminist movement. The characters are engaging and the acting is very well done, but they make really poor choices sometimes which is infuriating.  I suppose they left us hanging at the end so there can be a season 2, but frankly I'm not that interested. I do like how they portray the lives of woman in the early 1970s. I think it will be educational for millennial women to truly appreciate how far women have progressed in the last 45 years.  I would like my teenage daughter to watch it but all the sex scenes means it will have to wait several years before I can recommend it to her.<br /><br />One anachronism I found funny - several times Patti picks up a multi-line phone, but doesn't press the lit button to engage the call. Only someone old who had used phones like that would notice, but it would be nice if that was fixed in future seasons.  Also I think using the term &#34;unpack&#34; for explaining something is a 21st century usage - I never heard it used that way before 10 years ago.\nReview Title: I love the characters when I'm not mad at them.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "I Love Lucy - The Complete Second Season [DVD]\nLucille Ball  (Actor),     Desi Arnaz  (Actor),     Marc Daniels  (Director),     William Asher  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Product Description', 'From its 1951 premiere to the present day,', 'I Love Lucy', 'has never been off the air! You’ll see why in this hilarious five-disc DVD collection, containing the show’s entire second season. Laugh out loud at such gems as “Job Switching”—in which Lucy and Ethel do unforgettable battle with a chocolate factory conveyor belt; “ The Handcuffs”—in which Lucy cuffs herself to Ricky and then loses the key; and “The Operetta”—in which Lucy’s money problems bring down the curtain on her role as “Queen of the Gypsies.” This collection also includes the groundbreaking “pregnancy shows,” including the touching moment at the Tropicana when Lucy breaks the news to Ricky that they are going to have a baby; and “Lucy Goes to the Hospital”—the record-setting episode that garnered the highest rating in the history of television!', 'Amazon.com', 'Season 2 of', 'I Love Lucy', 'includes two of the most famous half-hours in television history. \"Job Switching,\" originally broadcast mid-September of 1952, is the crazy, battle-of-the-sexes episode in which husbands Ricky Ricardo (Desi Arnaz) and Fred Mertz (William Frawley) trade roles with wives Lucy (Lucille Ball) and Ethel (Vivian Vance), culminating in the men making a shambles of domestic chores while Lucy and Ethel take disastrous work at a chocolate factory. That\\'s right: This is the show where the ladies have a Chaplinesque experience with a too-fast factory conveyor belt, forcing them to hide candies in their mouths, in their hats, and down their blouses lest a tough forewoman fire them for incompetence. A half-century later, the scene is still so fresh and funny it would grace any current sitcom. \"Lucy Goes to the Hospital,\" which received an amazing 71.7 rating on January 19, 1953, is the historic episode featuring the birth of Little Ricky and a load of wonderful slapstick. Other television series (', 'The Dick Van Dyke Show', ') and movies (', 'Nine Months', ') have tried to top', 'Lucy', \"'s time-to-go-to-the-hospital shenanigans, but there's nothing like the sight of Ricky and Fred falling all over themselves or Ricky showing up at the maternity ward (direct from a voodoo-themed show at the Tropicana) in witch doctor makeup.\", 'The other 31 episodes included in', 'I Love Lucy: The Compete Second Season', 'have choice moments, too. \"Lucy Becomes a Sculptress\" finds the ever-ambitious redhead falling for empty flattery at an art-supply store and commencing an ill-advised career working in clay. Ricky agrees to bless this new endeavor if an art critic says she has talent, but Lucy tries to increase her chances by posing as a bust of herself--resulting in mayhem, of course. The usual running themes in', 'I Love Lucy', \"--Lucy's misguided desire to be a part of Ricky's musical career, and her penchant for disguising herself to investigate something--are all over\", 'The Complete Second Season', '. \"Ricky Loses His Voice\" is a delightful piece in which Ricky\\'s laryngitis inspires Lucy, the Mertzes, and an aging chorus line to put on a Tropicana spectacle, and \"Ricky Has Labor Pains\" finds Lucy and Ethel going undercover as male reporters to find out what happens at a stag party. Lots to enjoy here, and the special features include bloopers, information about the guest cast, and snippets from Ball\\'s radio show.', '--Tom Keogh']\n{'Genre': 'Romance, Comedy', 'Format': 'Box set, Black & White, Dolby, DVD, Full Screen, NTSC, Subtitled', 'Contributor': 'Richard Reeves, Veola Vonn, Madelyn Davis, Bob Carroll Jr., William Asher, Marc Daniels, Carol Richards, Richard Lee Simmons, Jess Oppenheimer, Jerry Hausner, Vivian Vance, Desi Arnaz, Frank Gerstle, William Frawley, Will Wright, Paul Dubov, Lucille BallRichard Reeves, Veola Vonn, Madelyn Davis, Bob Carroll Jr., William Asher, Marc Daniels, Carol Richards, Richard Lee Simmons, Jess Oppenheimer, Jerry Hausner, Vivian Vance, Desi Arnaz, Frank Gerstle, William Frawley, Will Wright, Paul Dubov, Lucille Ball  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1.75 inches; 15.2 Ounces', 'Item model number': '2238096', 'Director': 'Marc Daniels, William Asher', 'Media Format': 'Box set, Black & White, Dolby, DVD, Full Screen, NTSC, Subtitled', 'Run time': '13 hours and 19 minutes', 'Release date': 'August 31, 2004', 'Actors': 'Lucille Ball, Desi Arnaz, Vivian Vance, William Frawley, Paul Dubov', 'Dubbed': 'English', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'Bob Carroll Jr., Jess Oppenheimer, Madelyn Davis', 'Number of discs': '5'}\nI'm an old fuddy-duddy!  I don't want my kids (ages 8 and almost 6) watching 99% of the garbage that is on TV outside of PBS.  But they are getting too old for Sesame Street.  So where to turn?  I've found help in my old friend Lucy.  We have bought Season One of I Love Lucy on DVD, and the kids think it is the funniest thing ever.  I enjoy watching it with them, and I laugh all over again.  Season one has Vitmeatavegemin, and the kids laugh hysterically on the ground everytime they watch it.  I can't wait to show them the Chocolate factory.  The only caveat we need to do is explain about the cigarette smoking that goes on on the show.  We just explain that \"back then\" no one knew how bad smoking was for your health, and they are fine with that.  It's a great alternative to SpongeBob, I can tell you that!\nI Love Lucy - a great alternative to the current junk on TV\n{'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Mark Cendrowski', 'Anthony Rich', 'Peter Chakos', 'Nikki Lorre', 'James Burrows', 'Howard Murray', 'Gay Linvill', 'Kristy Cecil', 'Ted Wass', 'Andrew D. Weyman'], 'Producers': ['Not Specified'], 'Starring': ['Johnny Galecki', 'Jim Parsons', 'Kaley Cuoco'], 'Studio': ['Discovery Global']}\nI don't watch much TV, but I love The Big Bang Theory.  It's funny in a nerdy way.  The characters are so well played, there are times I forget Sheldon Cooper is not a real person! The writing in this show is amazing - I am constantly wondering &#34;how do they come up with this stuff&#34; as I'm laughing hysterically.\nI hate broadcast TV in general but I love The Big Bang Theory\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nWhen version first came out, I watched it with great anticipation for liking it.  I love Jane Austen, have a Jane Austen related web site, and I am pretty easy to please when it comes to Jane movies.  But I really disliked it.  This past week I thought I would give it another try, and watched it again.  I still really really disliked it. I just think it was poorly portrayed. The Bennet family is made to look excessively poor, grimy and shabby, and not portrayed as the gentlemen's family that they were. Kitty and Lydia were just foolishly, cartoonishly ridiculous, to the point of absurdity. The ball scenes were frenetic and overly crowded, again to the point of absurdity. Keira Knightley's Elizabeth was not likable in any part of the movie - her portrayal was too modern. The entire pace of the movie was too fast - the dialogue was so fast to the point of not being able to understand it at times (and I am not old and I watch British period dramas frequently and so am used to the language). Mr. Bingley seemed a buffoon, which he is not. Mr. Darcy was just never appealing. Their eventually romance seemed implausible.  The whole thing just seemed forced. Jane Austen's subtle humor was never fairly portrayed.<br /><br />It seemed like they wanted give these characters a modern feel while keeping them in early 19th century setting, and it just didn't work. I'm all for modernizations and retelling of Pride and Prejudice, and am a HUGE fan of the Lizzie Bennet Diaries on YouTube.<br /><br />Of course, by far the best Pride and Prejudice portrayal is the Jennifer Ehle and Colin Firth 1995 BBC version. Well worth the $4.99 on Amazon Instant Video. [[ASIN:B0083IJWNC Episode 1]]\nI guess I'm one of the few that really dislikes this version\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Simon Langton'], 'Producers': ['Sue Birtwistle', 'Michael Wearing'], 'Starring': ['Alison Steadman', 'Julia Sawalha', 'Colin Firth'], 'Studio': ['Series']}\nI find this is the best version of Pride and Prejudice. It has the advantage of having 6 hours to tell the story. Just watch it - it's so much better than the Keira Knightley version.\nThe best Pride and Prejudice version\n{'Subtitles': ['None available'], 'Directors': ['Bill Asher'], 'Producers': ['Jess Oppenheimer'], 'Starring': ['Lucille Ball', 'Desi Arnaz', 'William Frawley']}\nEven though they are more than 60 years old,  I Love Lucy still makes me laugh like no other show can. The only other show that comes close is The Big Bang Theory, and the female actress on the show have said in interviews that they are huge I Love Lucy fans and have even studied her comedy techniques.When my kids were too old for PBS but too young for &#34;modern&#34; comedy, we watched classics like I Love Lucy. Even as teenagers they still love to watch it. And they are a part of American classic culture and should be watched if only for that! The story lines are classic and timeless.  I don't know what else to say. Just go buy it. They are awesome.\nI Love Lucy is the best comedy show ever. Period.\n{'Subtitles': ['None available'], 'Directors': ['William Asher', 'James V. Kern', 'Marc Daniels', 'Ralph Levy'], 'Producers': ['Desi Arnaz', 'Jess Oppenheimer', 'Al Simon', 'Jack Aldworth', 'Lucille Ball'], 'Studio': ['CBS']}\nEven though they are more than 60 years old,  I Love Lucy still makes me laugh like no other show can. The only other show that comes close is The Big Bang Theory, and the female actress on the show have said in interviews that they are huge I Love Lucy fans and have even studied her comedy techniques.When my kids were too old for PBS but too young for &#34;modern&#34; comedy, we watched classics like I Love Lucy. Even as teenagers they still love to watch it. And they are a part of American classic culture and should be watched if only for that! The story lines are classic and timeless.  I don't know what else to say. Just go buy it. They are awesome.\nI Love Lucy is the best comedy show ever. Period.\n{'Subtitles': ['None available'], 'Directors': ['Bill Asher'], 'Producers': ['Jess Oppenheimer'], 'Starring': ['Lucille Ball', 'Desi Arnaz', 'William Frawley'], 'Studio': ['CBS']}\nEven though they are more than 60 years old,  I Love Lucy still makes me laugh like no other show can. The only other show that comes close is The Big Bang Theory, and the female actress on the show have said in interviews that they are huge I Love Lucy fans and have even studied her comedy techniques.When my kids were too old for PBS but too young for &#34;modern&#34; comedy, we watched classics like I Love Lucy. Even as teenagers they still love to watch it. And they are a part of American classic culture and should be watched if only for that! The story lines are classic and timeless.  I don't know what else to say. Just go buy it. They are awesome.\nI Love Lucy is the best comedy show ever. Period.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': [\"Jim O'Hanlon\"], 'Producers': ['George Ormond', 'Rebecca Eaton', 'Phillippa Giles', 'Michas Kotz'], 'Starring': ['Romola Garai', 'Michael Gambon', 'Jonny Lee Miller'], 'Studio': ['BBC America']}\nThis is by far the best version of Emma. Romola Garai portrays Emma perfectly as likable but misguided. Other versions just have her haughty and pretentious. The BBC versions of Jane Austen's novels tend to be the best and this is no exception. This is just simply the best portrayal of Emma, Mr. Knightley, Mrs. Weston, Harriet and all the other beloved characters. If you are a Jane Austen fan at all you will love this.\nThe best version of Emma by far\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul A. Kaufman'], 'Producers': ['Paul A. Kaufman', 'Orly Adelson', 'Christian Bruyère', 'Jean-François Doray', 'Jonathan Eskenas', 'Ronald Gilbert', 'P. Jayakumar', 'Karine Martin', 'Louis-Simon Menard', 'Steven Stabler'], 'Starring': ['Poppy Montgomery', 'Emily Holmes', 'Antonio Cupo', 'Janet Kidder'], 'Studio': ['Lifetime']}\nI hadn't known a lot about JK Rowling's life before Harry Potter. This is a sweet movie portraying her earlier life and how she came to write HP. The portrayal of her relationship with her mother was poignant. I can't comment on how well it sticks to the truth but it is inspiring for young writers.\nFun movie for any Harry Potter fan\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Yates'], 'Producers': ['David Heyman', 'David Barron'], 'Starring': ['Daniel Radcliffe', 'Emma Watson', 'Rupert Grint'], 'Studio': ['Warner Bros.']}\nThe movie is rushed, because the book was so long. There were a lot of things missing, but it told the story well enough. Still a great movie though.\nof course 5 stars, its Harry Potter\nThe Princess Bride\nCary Elwes  (Actor),     Mandy Patinkin  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n{'Format': 'Full Screen, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Peter Cook, Christopher Guest, Fred Savage, Mandy Patinkin, William Goldman, Robin Wright, Carol Kane, Chris Sarandon, Peter Falk, Cary Elwes, Mel Smith, Rob Reiner, Wallace Shawn, Andr the GiantPeter Cook, Christopher Guest, Fred Savage, Mandy Patinkin, William Goldman, Robin Wright, Carol Kane, Chris Sarandon, Peter Falk, Cary Elwes, Mel Smith, Rob Reiner, Wallace Shawn, Andr the Giant  See more', 'Language': 'English', 'Runtime': '1 hour and 38 minutes'}\nOne of my favorite movies of all times. The dry humor is fantastic. Rob Reiner is a genius of comedy.\nOne of my favorite movies of all times\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gore Verbinski'], 'Producers': ['Jerry Bruckheimer'], 'Starring': ['Johnny Depp', 'Orlando Bloom', 'Keira Knightley']}\nIt's Pirates, what more can I say? I love the whole series.\nI love the whole series\nThe Lord of the Rings: The Motion Picture Trilogy (Extended Edition Blu-ray)\nElijah Wood  (Actor),     Ian McKellen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"The Fellowship of the Ring; A meek hobbit of the Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron. The Two Towers: While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. The Return of the King: Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring. Peter Jackson directs these action adventure movies starring Elijah Wood, Viggo Mortensen, Ian McKellen, Sean Astin, Cate Blanchet and more. This special edition of The Lord of the Rings Trilogy includes extended edition of the movies on 15 Blu-Ray discs.\", 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Review', \"Jackson surpasses the expectations anyone might have had for him with The Fellowship of the Ring, the first installment of his trilogy devoted to J.R.R. Tolkien's masterwork. --Charlotte Observer, Lawrence ToppmanMoviegoers should be almost as entranced by the teeming, glorious landscapes and dark, bloody battlegrounds of Two Towers: astonishing midpoint of an epic movie fantasy journey for the ages. --Chicago Tribune, Michael Wilmington\", 'See more']\n{'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Contributor': 'Viggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando BloomViggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando Bloom  See more', 'Initial release date': '2012-05-01', 'Language': 'Portuguese (Dolby Digital 5.1), English (DTS-HD Master Audio 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Item model number': '939705', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 21 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Liv Tyler', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Studio Distribution Services', 'Number of discs': '15'}\nI know people were complaining about Prime Day 2015 but this was a great deal at under $30 and I'm thrilled to have it. Can't wait to watch all the additional scenes.\nYay for Prime Day\nThe Hobbit: The Battle of The Five Armies\nDrama, Fantasy, Ambitious, Fantastic\n['The epic conclusion to the adventure of Bilbo Baggins, who joins the Wizard Gandalf, Thorin Oakenshield and his company of Dwarves, in the clash of the Battle of the Five Armies.']\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Jackson'], 'Producers': ['Carolynne Cunningham', 'Zane Weiner', 'Fran Walsh', 'Peter Jackson', 'Philippa Boyens', 'Eileen Moran'], 'Starring': ['Ian McKellen', 'Martin Freeman', 'Richard Armitage']}\nLove the whole series - okay, all the added parts were a little unnecessary but I really didn't mind all the additional screen time with Orlando Bloom. :-)\nLove the whole series - okay\nInto The Woods (Theatrical)\nComedy, Drama, Beautiful, Cerebral\n['A witch threatens a curse on childless couple, unless they bring her an eclectic collection of items - tales of Little Red Riding Hood, Jack & the Beanstalk, Rapunzel and more in a lavish musical spectacular.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Marshall'], 'Producers': ['Rob Marshall', 'John Deluca', 'Marc Platt', 'Callum McDougall'], 'Starring': ['Meryl Streep', 'Emily Blunt', 'Anna Kendrick']}\nLove this movie! Stayed pretty close to the Broadway production. The music was well done, and the Agony scene was hilarious. And I loved James Corden before it was cool...\nLove this movie\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語'], 'Directors': ['Scott Winant', 'Dan Attias', 'Gloria Muzio', 'Minkie Spiro', 'Daisy von Scherler Mayer', 'Roxann Dawson'], 'Producers': ['Dana Calvo', 'Darlene Hunt', 'Lynda Obst', 'Jeff Okin', 'Scott Winant', 'Don Kurt'], 'Starring': ['Genevieve Angelson', 'Anna Camp', 'Erin Darke'], 'Studio': ['Amazon Studios']}\nDisappointing in some ways. More about sex than the feminist movement. The characters are engaging and the acting is very well done, but they make really poor choices sometimes which is infuriating.  I suppose they left us hanging at the end so there can be a season 2, but frankly I'm not that interested. I do like how they portray the lives of woman in the early 1970s. I think it will be educational for millennial women to truly appreciate how far women have progressed in the last 45 years.  I would like my teenage daughter to watch it but all the sex scenes means it will have to wait several years before I can recommend it to her.<br /><br />One anachronism I found funny - several times Patti picks up a multi-line phone, but doesn't press the lit button to engage the call. Only someone old who had used phones like that would notice, but it would be nice if that was fixed in future seasons.  Also I think using the term &#34;unpack&#34; for explaining something is a 21st century usage - I never heard it used that way before 10 years ago.\nI love the characters when I'm not mad at them.",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user enjoys classic family-friendly humor and vintage television shows, particularly classic sitcoms, prioritizing quality entertainment for wholesome family viewing.\n\n- **Family Viewing:** Actively seeking suitable media for children, they explore alternatives to mainstream shows deemed inappropriate for family watching. They prioritize works that can educate and resonate with younger audiences.\n\n- **Nostalgia:** A profound fondness for nostalgic content drives them to relive childhood favorites, creating similar viewing experiences for their children while providing context for outdated elements.\n\n- **Critical Viewing of Contemporary Media:** The user has shown a critical stance toward newer series that may prioritize sensationalism over meaningful narratives. They appreciate well-developed characters but express frustration with poor choices made by characters and unfulfilled storylines. \n\n- **Parental Guidance:** They are cautious about recommending certain shows to their teenage daughter due to inappropriate content, emphasizing the need for age-appropriate viewing.\n\n- **High Rating Expectation:** The user consistently rates media highly, though they've demonstrated a willingness to rate lower when disappointed, especially with adaptations that falter in execution.\n\n- **Sense of Humor:** They appreciate humor that elicits genuine laughter, focusing on clever writing and relatable characters, while also noting anachronisms that distract from the viewing experience.\n\n- **Broader Comedy Appreciation and Engagement with Extended Editions:** While devoted to family-friendly content, they enjoy contemporary comedies with nuanced storytelling, including musical cinema, enhanced by additional content.",
  "metrics": {
    "rouge1_f": 0.058912713883474126,
    "rouge2_f": 0.004333694474539544,
    "rougeL_f": 0.028156811782542777,
    "meteor": 0.018498976216882047,
    "bleu1": 2.2427494702948786e-09,
    "bleu2": 7.327305482864881e-10,
    "bleu3": 9.508711301419702e-11,
    "bleu4": 3.428281918842205e-11,
    "bertscore_precision": 0.3538323938846588,
    "bertscore_recall": 0.5044553875923157,
    "bertscore_f1": 0.4159272611141205
  }
}