{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2012/12/19\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Mark Cendrowski', 'Anthony Rich', 'Peter Chakos', 'Nikki Lorre', 'James Burrows', 'Howard Murray', 'Gay Linvill', 'Kristy Cecil', 'Ted Wass', 'Andrew D. Weyman'], 'Producers': ['Not Specified'], 'Starring': ['Johnny Galecki', 'Jim Parsons', 'Kaley Cuoco'], 'Studio': ['Discovery Global']}\nReview Text: I don't watch much TV, but I love The Big Bang Theory.  It's funny in a nerdy way.  The characters are so well played, there are times I forget Sheldon Cooper is not a real person! The writing in this show is amazing - I am constantly wondering &#34;how do they come up with this stuff&#34; as I'm laughing hysterically.\nReview Title: I hate broadcast TV in general but I love The Big Bang Theory\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "I Love Lucy - The Complete Second Season [DVD]\nLucille Ball  (Actor),     Desi Arnaz  (Actor),     Marc Daniels  (Director),     William Asher  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Product Description', 'From its 1951 premiere to the present day,', 'I Love Lucy', 'has never been off the air! You’ll see why in this hilarious five-disc DVD collection, containing the show’s entire second season. Laugh out loud at such gems as “Job Switching”—in which Lucy and Ethel do unforgettable battle with a chocolate factory conveyor belt; “ The Handcuffs”—in which Lucy cuffs herself to Ricky and then loses the key; and “The Operetta”—in which Lucy’s money problems bring down the curtain on her role as “Queen of the Gypsies.” This collection also includes the groundbreaking “pregnancy shows,” including the touching moment at the Tropicana when Lucy breaks the news to Ricky that they are going to have a baby; and “Lucy Goes to the Hospital”—the record-setting episode that garnered the highest rating in the history of television!', 'Amazon.com', 'Season 2 of', 'I Love Lucy', 'includes two of the most famous half-hours in television history. \"Job Switching,\" originally broadcast mid-September of 1952, is the crazy, battle-of-the-sexes episode in which husbands Ricky Ricardo (Desi Arnaz) and Fred Mertz (William Frawley) trade roles with wives Lucy (Lucille Ball) and Ethel (Vivian Vance), culminating in the men making a shambles of domestic chores while Lucy and Ethel take disastrous work at a chocolate factory. That\\'s right: This is the show where the ladies have a Chaplinesque experience with a too-fast factory conveyor belt, forcing them to hide candies in their mouths, in their hats, and down their blouses lest a tough forewoman fire them for incompetence. A half-century later, the scene is still so fresh and funny it would grace any current sitcom. \"Lucy Goes to the Hospital,\" which received an amazing 71.7 rating on January 19, 1953, is the historic episode featuring the birth of Little Ricky and a load of wonderful slapstick. Other television series (', 'The Dick Van Dyke Show', ') and movies (', 'Nine Months', ') have tried to top', 'Lucy', \"'s time-to-go-to-the-hospital shenanigans, but there's nothing like the sight of Ricky and Fred falling all over themselves or Ricky showing up at the maternity ward (direct from a voodoo-themed show at the Tropicana) in witch doctor makeup.\", 'The other 31 episodes included in', 'I Love Lucy: The Compete Second Season', 'have choice moments, too. \"Lucy Becomes a Sculptress\" finds the ever-ambitious redhead falling for empty flattery at an art-supply store and commencing an ill-advised career working in clay. Ricky agrees to bless this new endeavor if an art critic says she has talent, but Lucy tries to increase her chances by posing as a bust of herself--resulting in mayhem, of course. The usual running themes in', 'I Love Lucy', \"--Lucy's misguided desire to be a part of Ricky's musical career, and her penchant for disguising herself to investigate something--are all over\", 'The Complete Second Season', '. \"Ricky Loses His Voice\" is a delightful piece in which Ricky\\'s laryngitis inspires Lucy, the Mertzes, and an aging chorus line to put on a Tropicana spectacle, and \"Ricky Has Labor Pains\" finds Lucy and Ethel going undercover as male reporters to find out what happens at a stag party. Lots to enjoy here, and the special features include bloopers, information about the guest cast, and snippets from Ball\\'s radio show.', '--Tom Keogh']\n{'Genre': 'Romance, Comedy', 'Format': 'Box set, Black & White, Dolby, DVD, Full Screen, NTSC, Subtitled', 'Contributor': 'Richard Reeves, Veola Vonn, Madelyn Davis, Bob Carroll Jr., William Asher, Marc Daniels, Carol Richards, Richard Lee Simmons, Jess Oppenheimer, Jerry Hausner, Vivian Vance, Desi Arnaz, Frank Gerstle, William Frawley, Will Wright, Paul Dubov, Lucille BallRichard Reeves, Veola Vonn, Madelyn Davis, Bob Carroll Jr., William Asher, Marc Daniels, Carol Richards, Richard Lee Simmons, Jess Oppenheimer, Jerry Hausner, Vivian Vance, Desi Arnaz, Frank Gerstle, William Frawley, Will Wright, Paul Dubov, Lucille Ball  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1.75 inches; 15.2 Ounces', 'Item model number': '2238096', 'Director': 'Marc Daniels, William Asher', 'Media Format': 'Box set, Black & White, Dolby, DVD, Full Screen, NTSC, Subtitled', 'Run time': '13 hours and 19 minutes', 'Release date': 'August 31, 2004', 'Actors': 'Lucille Ball, Desi Arnaz, Vivian Vance, William Frawley, Paul Dubov', 'Dubbed': 'English', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'Bob Carroll Jr., Jess Oppenheimer, Madelyn Davis', 'Number of discs': '5'}\nI'm an old fuddy-duddy!  I don't want my kids (ages 8 and almost 6) watching 99% of the garbage that is on TV outside of PBS.  But they are getting too old for Sesame Street.  So where to turn?  I've found help in my old friend Lucy.  We have bought Season One of I Love Lucy on DVD, and the kids think it is the funniest thing ever.  I enjoy watching it with them, and I laugh all over again.  Season one has Vitmeatavegemin, and the kids laugh hysterically on the ground everytime they watch it.  I can't wait to show them the Chocolate factory.  The only caveat we need to do is explain about the cigarette smoking that goes on on the show.  We just explain that \"back then\" no one knew how bad smoking was for your health, and they are fine with that.  It's a great alternative to SpongeBob, I can tell you that!\nI Love Lucy - a great alternative to the current junk on TV\n{'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Mark Cendrowski', 'Anthony Rich', 'Peter Chakos', 'Nikki Lorre', 'James Burrows', 'Howard Murray', 'Gay Linvill', 'Kristy Cecil', 'Ted Wass', 'Andrew D. Weyman'], 'Producers': ['Not Specified'], 'Starring': ['Johnny Galecki', 'Jim Parsons', 'Kaley Cuoco'], 'Studio': ['Discovery Global']}\nI don't watch much TV, but I love The Big Bang Theory.  It's funny in a nerdy way.  The characters are so well played, there are times I forget Sheldon Cooper is not a real person! The writing in this show is amazing - I am constantly wondering &#34;how do they come up with this stuff&#34; as I'm laughing hysterically.\nI hate broadcast TV in general but I love The Big Bang Theory",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** The user has a clear preference for classic family-friendly humor and vintage television shows, like *I Love Lucy*. They appreciate quality entertainment that fosters wholesome family viewing.\n\n- **Family Viewing:** Actively seeking media suitable for children, the user emphasizes the importance of sharing enjoyable and appropriate content, often looking for alternatives to mainstream shows they find unsuitable for their family.\n\n- **Nostalgia:** The user exhibits a strong fondness for nostalgic content, desiring to relive their childhood favorites while introducing similar experiences to their children.\n\n- **Parental Guidance:** Mindful of the content kids consume, they address outdated elements in older shows by providing context and discussions on aspects like smoking.\n\n- **High Rating Expectation:** With a tendency to rate chosen media very highly (often 5.0), the user gravitates towards well-received entertainment, demonstrating a requirement for quality in their viewing choices.\n\n- **Sense of Humor:** They appreciate humor that elicits genuine laughter, particularly fond of clever writing and relatable characters, which enhances their family viewing experience.\n\n- **Broader Comedy Appreciation:** Recently, the user has shown an appreciation for more contemporary comedies that have a nerdy sense of humor, indicating a broadened taste while still valuing the family-friendly aspect of media consumption. They enjoy comedic writing that showcases creativity and great character portrayal, enhancing their entertainment experience.",
  "metrics": {
    "rouge1_f": 0.1379833206974981,
    "rouge2_f": 0.013667425968109336,
    "rougeL_f": 0.06823351023502654,
    "meteor": 0.05436892118775405,
    "bleu1": 0.005371763609113334,
    "bleu2": 0.0016606782710016784,
    "bleu3": 0.0005218179426706654,
    "bleu4": 0.0001646342132076336,
    "bertscore_precision": 0.3576095402240753,
    "bertscore_recall": 0.44171449542045593,
    "bertscore_f1": 0.3952372670173645
  }
}