{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/03/17\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': [\"Jim O'Hanlon\"], 'Producers': ['George Ormond', 'Rebecca Eaton', 'Phillippa Giles', 'Michas Kotz'], 'Starring': ['Romola Garai', 'Michael Gambon', 'Jonny Lee Miller'], 'Studio': ['BBC America']}\nReview Text: This is by far the best version of Emma. Romola Garai portrays Emma perfectly as likable but misguided. Other versions just have her haughty and pretentious. The BBC versions of Jane Austen's novels tend to be the best and this is no exception. This is just simply the best portrayal of Emma, Mr. Knightley, Mrs. Weston, Harriet and all the other beloved characters. If you are a Jane Austen fan at all you will love this.\nReview Title: The best version of Emma by far\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "I Love Lucy - The Complete Second Season [DVD]\nLucille Ball  (Actor),     Desi Arnaz  (Actor),     Marc Daniels  (Director),     William Asher  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Product Description', 'From its 1951 premiere to the present day,', 'I Love Lucy', 'has never been off the air! You’ll see why in this hilarious five-disc DVD collection, containing the show’s entire second season. Laugh out loud at such gems as “Job Switching”—in which Lucy and Ethel do unforgettable battle with a chocolate factory conveyor belt; “ The Handcuffs”—in which Lucy cuffs herself to Ricky and then loses the key; and “The Operetta”—in which Lucy’s money problems bring down the curtain on her role as “Queen of the Gypsies.” This collection also includes the groundbreaking “pregnancy shows,” including the touching moment at the Tropicana when Lucy breaks the news to Ricky that they are going to have a baby; and “Lucy Goes to the Hospital”—the record-setting episode that garnered the highest rating in the history of television!', 'Amazon.com', 'Season 2 of', 'I Love Lucy', 'includes two of the most famous half-hours in television history. \"Job Switching,\" originally broadcast mid-September of 1952, is the crazy, battle-of-the-sexes episode in which husbands Ricky Ricardo (Desi Arnaz) and Fred Mertz (William Frawley) trade roles with wives Lucy (Lucille Ball) and Ethel (Vivian Vance), culminating in the men making a shambles of domestic chores while Lucy and Ethel take disastrous work at a chocolate factory. That\\'s right: This is the show where the ladies have a Chaplinesque experience with a too-fast factory conveyor belt, forcing them to hide candies in their mouths, in their hats, and down their blouses lest a tough forewoman fire them for incompetence. A half-century later, the scene is still so fresh and funny it would grace any current sitcom. \"Lucy Goes to the Hospital,\" which received an amazing 71.7 rating on January 19, 1953, is the historic episode featuring the birth of Little Ricky and a load of wonderful slapstick. Other television series (', 'The Dick Van Dyke Show', ') and movies (', 'Nine Months', ') have tried to top', 'Lucy', \"'s time-to-go-to-the-hospital shenanigans, but there's nothing like the sight of Ricky and Fred falling all over themselves or Ricky showing up at the maternity ward (direct from a voodoo-themed show at the Tropicana) in witch doctor makeup.\", 'The other 31 episodes included in', 'I Love Lucy: The Compete Second Season', 'have choice moments, too. \"Lucy Becomes a Sculptress\" finds the ever-ambitious redhead falling for empty flattery at an art-supply store and commencing an ill-advised career working in clay. Ricky agrees to bless this new endeavor if an art critic says she has talent, but Lucy tries to increase her chances by posing as a bust of herself--resulting in mayhem, of course. The usual running themes in', 'I Love Lucy', \"--Lucy's misguided desire to be a part of Ricky's musical career, and her penchant for disguising herself to investigate something--are all over\", 'The Complete Second Season', '. \"Ricky Loses His Voice\" is a delightful piece in which Ricky\\'s laryngitis inspires Lucy, the Mertzes, and an aging chorus line to put on a Tropicana spectacle, and \"Ricky Has Labor Pains\" finds Lucy and Ethel going undercover as male reporters to find out what happens at a stag party. Lots to enjoy here, and the special features include bloopers, information about the guest cast, and snippets from Ball\\'s radio show.', '--Tom Keogh']\n{'Genre': 'Romance, Comedy', 'Format': 'Box set, Black & White, Dolby, DVD, Full Screen, NTSC, Subtitled', 'Contributor': 'Richard Reeves, Veola Vonn, Madelyn Davis, Bob Carroll Jr., William Asher, Marc Daniels, Carol Richards, Richard Lee Simmons, Jess Oppenheimer, Jerry Hausner, Vivian Vance, Desi Arnaz, Frank Gerstle, William Frawley, Will Wright, Paul Dubov, Lucille BallRichard Reeves, Veola Vonn, Madelyn Davis, Bob Carroll Jr., William Asher, Marc Daniels, Carol Richards, Richard Lee Simmons, Jess Oppenheimer, Jerry Hausner, Vivian Vance, Desi Arnaz, Frank Gerstle, William Frawley, Will Wright, Paul Dubov, Lucille Ball  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1.75 inches; 15.2 Ounces', 'Item model number': '2238096', 'Director': 'Marc Daniels, William Asher', 'Media Format': 'Box set, Black & White, Dolby, DVD, Full Screen, NTSC, Subtitled', 'Run time': '13 hours and 19 minutes', 'Release date': 'August 31, 2004', 'Actors': 'Lucille Ball, Desi Arnaz, Vivian Vance, William Frawley, Paul Dubov', 'Dubbed': 'English', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'Bob Carroll Jr., Jess Oppenheimer, Madelyn Davis', 'Number of discs': '5'}\nI'm an old fuddy-duddy!  I don't want my kids (ages 8 and almost 6) watching 99% of the garbage that is on TV outside of PBS.  But they are getting too old for Sesame Street.  So where to turn?  I've found help in my old friend Lucy.  We have bought Season One of I Love Lucy on DVD, and the kids think it is the funniest thing ever.  I enjoy watching it with them, and I laugh all over again.  Season one has Vitmeatavegemin, and the kids laugh hysterically on the ground everytime they watch it.  I can't wait to show them the Chocolate factory.  The only caveat we need to do is explain about the cigarette smoking that goes on on the show.  We just explain that \"back then\" no one knew how bad smoking was for your health, and they are fine with that.  It's a great alternative to SpongeBob, I can tell you that!\nI Love Lucy - a great alternative to the current junk on TV\n{'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Mark Cendrowski', 'Anthony Rich', 'Peter Chakos', 'Nikki Lorre', 'James Burrows', 'Howard Murray', 'Gay Linvill', 'Kristy Cecil', 'Ted Wass', 'Andrew D. Weyman'], 'Producers': ['Not Specified'], 'Starring': ['Johnny Galecki', 'Jim Parsons', 'Kaley Cuoco'], 'Studio': ['Discovery Global']}\nI don't watch much TV, but I love The Big Bang Theory.  It's funny in a nerdy way.  The characters are so well played, there are times I forget Sheldon Cooper is not a real person! The writing in this show is amazing - I am constantly wondering &#34;how do they come up with this stuff&#34; as I'm laughing hysterically.\nI hate broadcast TV in general but I love The Big Bang Theory\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nWhen version first came out, I watched it with great anticipation for liking it.  I love Jane Austen, have a Jane Austen related web site, and I am pretty easy to please when it comes to Jane movies.  But I really disliked it.  This past week I thought I would give it another try, and watched it again.  I still really really disliked it. I just think it was poorly portrayed. The Bennet family is made to look excessively poor, grimy and shabby, and not portrayed as the gentlemen's family that they were. Kitty and Lydia were just foolishly, cartoonishly ridiculous, to the point of absurdity. The ball scenes were frenetic and overly crowded, again to the point of absurdity. Keira Knightley's Elizabeth was not likable in any part of the movie - her portrayal was too modern. The entire pace of the movie was too fast - the dialogue was so fast to the point of not being able to understand it at times (and I am not old and I watch British period dramas frequently and so am used to the language). Mr. Bingley seemed a buffoon, which he is not. Mr. Darcy was just never appealing. Their eventually romance seemed implausible.  The whole thing just seemed forced. Jane Austen's subtle humor was never fairly portrayed.<br /><br />It seemed like they wanted give these characters a modern feel while keeping them in early 19th century setting, and it just didn't work. I'm all for modernizations and retelling of Pride and Prejudice, and am a HUGE fan of the Lizzie Bennet Diaries on YouTube.<br /><br />Of course, by far the best Pride and Prejudice portrayal is the Jennifer Ehle and Colin Firth 1995 BBC version. Well worth the $4.99 on Amazon Instant Video. [[ASIN:B0083IJWNC Episode 1]]\nI guess I'm one of the few that really dislikes this version\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Simon Langton'], 'Producers': ['Sue Birtwistle', 'Michael Wearing'], 'Starring': ['Alison Steadman', 'Julia Sawalha', 'Colin Firth'], 'Studio': ['Series']}\nI find this is the best version of Pride and Prejudice. It has the advantage of having 6 hours to tell the story. Just watch it - it's so much better than the Keira Knightley version.\nThe best Pride and Prejudice version\n{'Subtitles': ['None available'], 'Directors': ['Bill Asher'], 'Producers': ['Jess Oppenheimer'], 'Starring': ['Lucille Ball', 'Desi Arnaz', 'William Frawley']}\nEven though they are more than 60 years old,  I Love Lucy still makes me laugh like no other show can. The only other show that comes close is The Big Bang Theory, and the female actress on the show have said in interviews that they are huge I Love Lucy fans and have even studied her comedy techniques.When my kids were too old for PBS but too young for &#34;modern&#34; comedy, we watched classics like I Love Lucy. Even as teenagers they still love to watch it. And they are a part of American classic culture and should be watched if only for that! The story lines are classic and timeless.  I don't know what else to say. Just go buy it. They are awesome.\nI Love Lucy is the best comedy show ever. Period.\n{'Subtitles': ['None available'], 'Directors': ['William Asher', 'James V. Kern', 'Marc Daniels', 'Ralph Levy'], 'Producers': ['Desi Arnaz', 'Jess Oppenheimer', 'Al Simon', 'Jack Aldworth', 'Lucille Ball'], 'Studio': ['CBS']}\nEven though they are more than 60 years old,  I Love Lucy still makes me laugh like no other show can. The only other show that comes close is The Big Bang Theory, and the female actress on the show have said in interviews that they are huge I Love Lucy fans and have even studied her comedy techniques.When my kids were too old for PBS but too young for &#34;modern&#34; comedy, we watched classics like I Love Lucy. Even as teenagers they still love to watch it. And they are a part of American classic culture and should be watched if only for that! The story lines are classic and timeless.  I don't know what else to say. Just go buy it. They are awesome.\nI Love Lucy is the best comedy show ever. Period.\n{'Subtitles': ['None available'], 'Directors': ['Bill Asher'], 'Producers': ['Jess Oppenheimer'], 'Starring': ['Lucille Ball', 'Desi Arnaz', 'William Frawley'], 'Studio': ['CBS']}\nEven though they are more than 60 years old,  I Love Lucy still makes me laugh like no other show can. The only other show that comes close is The Big Bang Theory, and the female actress on the show have said in interviews that they are huge I Love Lucy fans and have even studied her comedy techniques.When my kids were too old for PBS but too young for &#34;modern&#34; comedy, we watched classics like I Love Lucy. Even as teenagers they still love to watch it. And they are a part of American classic culture and should be watched if only for that! The story lines are classic and timeless.  I don't know what else to say. Just go buy it. They are awesome.\nI Love Lucy is the best comedy show ever. Period.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': [\"Jim O'Hanlon\"], 'Producers': ['George Ormond', 'Rebecca Eaton', 'Phillippa Giles', 'Michas Kotz'], 'Starring': ['Romola Garai', 'Michael Gambon', 'Jonny Lee Miller'], 'Studio': ['BBC America']}\nThis is by far the best version of Emma. Romola Garai portrays Emma perfectly as likable but misguided. Other versions just have her haughty and pretentious. The BBC versions of Jane Austen's novels tend to be the best and this is no exception. This is just simply the best portrayal of Emma, Mr. Knightley, Mrs. Weston, Harriet and all the other beloved characters. If you are a Jane Austen fan at all you will love this.\nThe best version of Emma by far",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** The user enjoys classic family-friendly humor and vintage television shows, particularly classic sitcoms, prioritizing quality entertainment for wholesome family viewing.\n\n- **Family Viewing:** Actively seeking suitable media for children, they explore alternatives to mainstream shows deemed inappropriate for family watching.\n\n- **Nostalgia:** A profound fondness for nostalgic content drives them to relive childhood favorites and create similar viewing experiences for their children, appreciating how classic shows resonate across generations.\n\n- **Parental Guidance:** They provide context for outdated elements in older shows, fostering meaningful discussions with their children about historical and cultural nuances.\n\n- **High Rating Expectation:** The user consistently rates media highly, favoring well-received entertainment that reflects their standards for quality.\n\n- **Sense of Humor:** They appreciate humor that generates genuine laughter, focusing on clever writing and relatable characters that enrich family viewing experiences.\n\n- **Broader Comedy Appreciation:** Recently, they have developed an affinity for contemporary comedies with a nerdy twist while still maintaining a commitment to family-friendly content.\n\n- **Critical Viewing of Adaptations:** The user expresses strong opinions on adaptations, particularly favoring those that capture subtle humor and depth while remaining true to classic literary works, such as beloved novels.\n\n- **Influence of Classic Shows:** They note the lasting impact of classic comedies on their family, with children appreciating this genre, reinforcing their belief in its timelessness.\n\n- **Literary Appreciation:** The user has a deep appreciation for well-crafted adaptations of classic literature, highlighting portrayals that enhance character depth and relatability, particularly in works by authors like Jane Austen.",
  "metrics": {
    "rouge1_f": 0.10284742881427965,
    "rouge2_f": 0.005104210974053594,
    "rougeL_f": 0.05014874628134297,
    "meteor": 0.036510518415976266,
    "bleu1": 0.00020961139572989203,
    "bleu2": 4.475635047588591e-05,
    "bleu3": 6.8399494364950684e-06,
    "bleu4": 2.6759594393124724e-06,
    "bertscore_precision": 0.3691911995410919,
    "bertscore_recall": 0.48484617471694946,
    "bertscore_f1": 0.41918760538101196
  }
}