{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nReview Date: 2020/09/03\nStore: Vedory\nProduct Description: ['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nReview Text: I work in a school that currently requires everyone to wear masks when on property. These mask brackets have really helped me feel more comfortable to wear a mask all day. I also find it much easier to speak and be heard with this bracket.<br /><br />These are the second set of brackets I have tried and I feel like these fit my face much better than other ones.  It took some getting used to as it doesn’t clip into my non pleated masks and sometimes moves around, but I am definitely liking using these better than nothing.  I have shared extras with coworkers and they have all found them to be helpful.  I would recommend.\nReview Title: Helps when wearing mask all day\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Headbands For Kids MINNIE Sequins Hair MOUSE Girls Baby EARS Bow knot (Red and Black)\nToptree\n{'Age Range (Description)': 'Child', 'Number of Items': '1', 'Brand': 'Toptree', 'Size': '1 Count (Pack of 1)', 'Item Form': 'Ribbon', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.54 x 3.58 x 0.94 inches; 0.74 Ounces', 'UPC': '710654129025'}\nSo excited for my daughter to wear these for her first trip to Disney!  8months old and they look adorable on her!  Fits great!<br /><br />UPDATE - my daughter wore these to Disney World and we received SO many compliments on them.  I actually prefer these for her age over the overpriced options at the park.\nPerfect for Disney trip!\nN3 No Name Necessary Pore-Minimizing Mattifying Oil and Shine Control Anti-aging Makeup Face Primer Spray (200ml)\nNo Name Necessary\n{'Brand': 'No Name Necessary', 'Skin Type': 'Combination', 'Package Information': 'Bottle', 'Finish Type': 'Matte', 'Specialty': 'Mattifying', 'Product Dimensions': '1.7 x 1.7 x 7.5 inches; 8.78 Ounces'}\nI am typically low maintenance with make up but wanted to try this product as I live in the sweltering heat of south Florida year round. First thing I noticed is this is a very nice sized bottle, almost as big as a standard can of hairspray.  I have been using this product for a week now and have definitely noticed a difference. My pores are less noticeable and my makeup lasts much longer than without the product. My face looks and feels smooth all day.  It’s so easy to use too!  All you have to do is shake it up and spray your face several times before applying makeup.  I haven’t noticed a scent to it and barely notice the product at all when I spray it on.  Now I just wish I had a travel size to take with me on upcoming trips!  I definitely recommend giving this a try!\nGreat product, face stays looking fresh all day\n3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nVedory\n['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\n{'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nI work in a school that currently requires everyone to wear masks when on property. These mask brackets have really helped me feel more comfortable to wear a mask all day. I also find it much easier to speak and be heard with this bracket.<br /><br />These are the second set of brackets I have tried and I feel like these fit my face much better than other ones.  It took some getting used to as it doesn’t clip into my non pleated masks and sometimes moves around, but I am definitely liking using these better than nothing.  I have shared extras with coworkers and they have all found them to be helpful.  I would recommend.\nHelps when wearing mask all day",
  "profile": "**User Profile Summary:**\n\n- **Target Audience:** Primarily focused on children's products for young girls.\n- **Shopping Preferences:** Values affordability and practicality while considering both aesthetics and function. A recent interest in items that support personal comfort and appearance, indicative of a growing focus on beauty and self-care.\n- **Occasion-Focused:** Interested in products suitable for special events, like trips to theme parks, emphasizing memorable experiences for her child and herself. This includes considerations for own beauty during events, highlighting a balance between practicality and visual appeal.\n- **Style Preference:** Seeks products that enhance a child’s appearance in a cute, thematic way, particularly those aligned with popular culture. Also values beauty products that help maintain a polished look.\n- **Satisfaction Indicators:** Strong emphasis on product functionality, comfort, and effectiveness, as indicated by her reviews. Recent focus on ease of use and supportive features in products reflects a desire for practical solutions without compromising on aesthetics.\n- **Social Engagement:** Appreciates products that garner positive attention, suggesting a value placed on social approval and shared experiences with others.\n- **Purchase Timing:** Engages in seasonal and occasion-driven shopping, carefully planning for family events and personal beauty routines.\n\nThe user is committed to finding delightful and cost-effective solutions for her child's activities while simultaneously addressing her own comfort and appearance, especially in the context of special occasions.",
  "metrics": {
    "rouge1_f": 0.18967587034813926,
    "rouge2_f": 0.01684717208182912,
    "rougeL_f": 0.08403361344537816,
    "meteor": 0.10028449502133713,
    "bleu1": 0.06973852836390834,
    "bleu2": 0.017198219358801243,
    "bleu3": 0.0027580798323878133,
    "bleu4": 0.001105471302226323,
    "bertscore_precision": 0.3654676675796509,
    "bertscore_recall": 0.4397242069244385,
    "bertscore_f1": 0.3991718888282776
  }
}