{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bette Midler: The Showgirl Must Go On\nReview Date: 2012/04/22\nStore: Bette Midler  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Music Videos & Concerts\nProduct Description: ['The Divine Miss M is back! Bette Midler returns in this Las Vegas extravaganza taped before a packed house at The Colosseum at Caesars Palace in Las Vegas, the 70-minute cavalcade features an exhilarating tour de force of some of Ms. Midler’s colorful and classic stage characters. Joining her is an entourage of talented performers, including the staggering Harlettes, 16 dazzling dancers she calls The Caesar Salad Girls and a 13-piece band. Thrilling audiences with her captivating performances, Ms. Midler’s superstar power continues to shine as she belts out show stopping renditions of her biggest hits including “The Rose,” “Boogie Woogie Bugle Boy,” “From a Distance,” “Hello in There” and “Wind Beneath My Wings.”', 'Song List: Big Noise from Winnetka, The Showgirl Must Go On, Friends, The Rose, Do You Wanna Dance, From a Distance, Boolya JaDa, Hello in There, Pretty Legs/Hot in Here, Boogie Woogie Bugle Boy, Wind Beneath My Wings']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Pop, Music Video & Concerts', 'Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Contributor': 'Bette Midler', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '21164824', 'Director': 'Bette Midler', 'Media Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Run time': '1 hour and 7 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Bette Midler', 'Studio': 'IMAGE ENTERTAINMENT', 'Number of discs': '1'}\nReview Text: I'm sure this was an incredible show at an incredible venue, but you'd never know if from the DVD.  This is the worst produced DVD ever in the history of the world.  The audio quality is horrible, and the video isn't much better.  For gosh sakes this is LAS VEGAS in the super showroom built to house Ms Dion for five years, you know they've got the very best sound and video available, but this DVD is just a bad afterthought.  It's a shame, because Ms Midler has always been captured best live on camera, and she has a whole catalogue of HBO shows that were extremely well done (but apparently aren't available today).<br /><br />I've loved Bette Midler her entire career, but this DVD is absolutely a piece of crap.  Do not bother.  It is an insult to one of the great talents of all time.\nReview Title: Even die-hard fans, don't bother\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Faerie Tale Theatre - Sleeping Beauty [DVD]\nJohn Achorn  (Actor),     Shelley Duvall  (Actor),     Jeremy Kagan  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['A princess who has been put into a deep sleep by an evil fairy is awakened one hundred years later by the kiss of a prince.']\n{'Format': 'Color, DVD, NTSC', 'Contributor': 'Donovan Scott, John Achorn, John Salazar, Patrick DeSantis, Shelley Duvall, Charlie Dell, Mark Blankfield, Bud Cort, Rene Auberjonois, Jean Stapleton, Maysie Hoy, Charles Perrault, Jeffrey Alan Fiskin, Jeremy Kagan, David McCharenDonovan Scott, John Achorn, John Salazar, Patrick DeSantis, Shelley Duvall, Charlie Dell, Mark Blankfield, Bud Cort, Rene Auberjonois, Jean Stapleton, Maysie Hoy, Charles Perrault, Jeffrey Alan Fiskin, Jeremy Kagan, David McCharen  See more', 'Language': 'English', 'Runtime': '58 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 0.75 inches; 4 Ounces', 'Director': 'Jeremy Kagan', 'Media Format': 'Color, DVD, NTSC', 'Run time': '58 minutes', 'Release date': 'November 16, 2004', 'Actors': 'John Achorn, Shelley Duvall, Patrick DeSantis, David McCharen, Charlie Dell', 'Studio': 'Starmaker II', 'Writers': 'Charles Perrault, Jeffrey Alan Fiskin', 'Number of discs': '1'}\nthis is worth it just to hear Bernadette Peters sing \"I'm nobody's baby\".  it is absolutely breathtaking and heartbreaking and all those wonderful qualities that only she can bring to a song.\njust for her voice\nBette Midler: The Showgirl Must Go On\nBette Midler  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['The Divine Miss M is back! Bette Midler returns in this Las Vegas extravaganza taped before a packed house at The Colosseum at Caesars Palace in Las Vegas, the 70-minute cavalcade features an exhilarating tour de force of some of Ms. Midler’s colorful and classic stage characters. Joining her is an entourage of talented performers, including the staggering Harlettes, 16 dazzling dancers she calls The Caesar Salad Girls and a 13-piece band. Thrilling audiences with her captivating performances, Ms. Midler’s superstar power continues to shine as she belts out show stopping renditions of her biggest hits including “The Rose,” “Boogie Woogie Bugle Boy,” “From a Distance,” “Hello in There” and “Wind Beneath My Wings.”', 'Song List: Big Noise from Winnetka, The Showgirl Must Go On, Friends, The Rose, Do You Wanna Dance, From a Distance, Boolya JaDa, Hello in There, Pretty Legs/Hot in Here, Boogie Woogie Bugle Boy, Wind Beneath My Wings']\n{'Genre': 'Pop, Music Video & Concerts', 'Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Contributor': 'Bette Midler', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '21164824', 'Director': 'Bette Midler', 'Media Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Run time': '1 hour and 7 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Bette Midler', 'Studio': 'IMAGE ENTERTAINMENT', 'Number of discs': '1'}\nI'm sure this was an incredible show at an incredible venue, but you'd never know if from the DVD.  This is the worst produced DVD ever in the history of the world.  The audio quality is horrible, and the video isn't much better.  For gosh sakes this is LAS VEGAS in the super showroom built to house Ms Dion for five years, you know they've got the very best sound and video available, but this DVD is just a bad afterthought.  It's a shame, because Ms Midler has always been captured best live on camera, and she has a whole catalogue of HBO shows that were extremely well done (but apparently aren't available today).<br /><br />I've loved Bette Midler her entire career, but this DVD is absolutely a piece of crap.  Do not bother.  It is an insult to one of the great talents of all time.\nEven die-hard fans, don't bother",
  "profile": "**User Profile Summary:**\n\n- **Primary Interests:** Movies and TV shows, particularly in the Science Fiction & Fantasy genre, with a growing interest in musicals and concert performances.\n- **Content Preference:** Enjoys family-friendly and wholesome entertainment (rated G), while also exploring live performance recordings.\n- **Artistic Appreciation:** Values strong vocal performances and musical elements, with a specific admiration for notable performers like Bernadette Peters and Bette Midler.\n- **Nostalgia Factor:** Shows an inclination towards classic tales and adaptations, indicating a fondness for timeless stories and celebrated artists.\n- **Engagement Style:** Provides thoughtful and critical feedback, emphasizing emotional responses to artistic performances and the quality of production. Expresses disappointment when expectations for production quality are not met.\n- **Media Format Preference:** Prefers physical media formats, evidenced by previous purchases of DVDs and a particular interest in live performances.\n\nThe user may continue to seek fantasy-themed content and live performances that highlight exceptional music and engaging narratives, particularly those that target family audiences, while being critical of production quality in their selections.",
  "metrics": {
    "rouge1_f": 0.17073170731707316,
    "rouge2_f": 0.026894865525672374,
    "rougeL_f": 0.08780487804878048,
    "meteor": 0.06597755575548084,
    "bleu1": 0.015046962746315824,
    "bleu2": 0.005298857990803442,
    "bleu3": 0.002191578297094353,
    "bleu4": 0.001186531426769801,
    "bertscore_precision": 0.3414379954338074,
    "bertscore_recall": 0.4540528357028961,
    "bertscore_f1": 0.3897741734981537
  }
}