{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Wall-E (Single-Disc Edition)\nReview Date: 2019/01/12\nStore: Ben Burtt  (Actor),     Elissa Knight  (Actor),     Andrew Stanton  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Characters & Series, Wall-E\nProduct Description: ['Product Description', \"The highly acclaimed director of FINDING NEMO and the creative storytellers behind CARS and RATATOUILLE transport you to a galaxy not so far away for a new cosmic comedy adventure about a determined robot named WALL-E. After hundreds of lonely years of doing what he was built for, the curious and lovable WALL-E discovers a new purpose in life when he meets a sleek search robot named EVE. Join them and a hilarious cast of characters on a fantastic journey across the universe. Transport yourself to a fascinating new world with Disney-Pixar's latest adventure, now even more astonishing on DVD and Blu-ray(TM) and loaded with bonus features, including the exclusive animated short film BURN-E. WALL-E is a film your family will want to enjoy over and over again.\", 'Amazon.com', 'Pixar genius reigns in this funny romantic comedy, which stars a robot who says absolutely nothing for a full 25 minutes yet somehow completely transfixes and endears himself to the audience within the first few minutes of the film. As the last robot left on earth, Wall-E (voiced by Ben Burtt) is one small robot--with a big, big heart--who holds the future of earth and mankind squarely in the palm of his metal hand. He\\'s outlasted all the \"Waste Allocation Load Lifter Earth-Class\" robots that were assigned some 700 years ago to clean up the environmental mess that man made of earth while man vacationed aboard the luxury spaceship Axiom. Wall-E has dutifully gone about his job compacting trash, the extreme solitude broken only by his pet cockroach, but he\\'s developed some oddly human habits and ideas. When the Axiom sends its regularly scheduled robotic EVE probe (Elissa Knight) to earth, Wall-E is instantly smitten and proceeds to try to impress EVE with his collection of human memorabilia. EVE\\'s directive compels her to bring Wall-E\\'s newly collected plant sprout to the captain of the Axiom and Wall-E follows in hot pursuit. Suddenly, the human world is turned upside down and the Captain (Jeff Garlin) joins forces with Wall-E and a cast of other misfit robots to lead the now lethargic people back home to earth.', 'Wall-E', 'is a great family film with the most impressive aspect being the depth of emotion conveyed by a simple robot--a machine typically considered devoid of emotion, but made so absolutely touching by the magic of Pixar animation. Also well-worth admiring are the sweeping views from space, the creative yet disturbing vision of what strange luxuries a future space vacation might offer, and the innovative use of trash in a future cityscape. Underneath the slapstick comedy and touching love story is a poignant message about the folly of human greed and its potential effects on earth and the entire human race.', 'Wall-E', 'is preceded in theaters by the comical short', 'Presto', \"in which a magician's rabbit, unfed one too many times takes his revenge against the egotistical magician. (Ages 3 and older)\", '--Tami Horiuchi', '>', 'Stills from', 'Wall-E', '(Click for larger image)', 'Review', 'Golden Globes 2009 Winner Best Animated Feature Film', 'Boston Society of Film Critics Awards 2008 Winner Best Animated Film', 'Chicago Film Critics Association Awards 2008 Winner Best Animated Feature', 'Chicago Film Critics Association Awards 2008Winner Best Original Score', 'Chicago Film Critics Association Awards 2008 Winner Best Picture', 'Chicago Film Critics Association Awards 2008 Winner Best Screenplay, Original', 'Hollywood Film Festival 2008 Winner Animation of the Year', 'Los Angeles Film Critics Association Awards 2008 Winner Best Picture', 'National Board of Review, USA 2008 Winner Best Animated Feature', 'National Movie Awards, UK 2008 Winner Best Family Film', 'New York Film Critics Circle Awards 2008 Winner Best Animated Film', 'Southeastern Film Critics Association Awards 2008 Winner Best Animated Film', 'Toronto Film Critics Association Awards 2008 Winner Best Animated Feature', 'World Soundtrack Awards 2008 Winner Best Original Song Written Directly for FilmMusic by Thomas Newman, Music by, lyrics by, performed by Peter Gabriel Down To Earth --imdb.com', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Kathy Najimy, Elissa Knight, Macintalk, Jeff Garlin, Ben Burtt, Fred Willard, John Ratzenberger, Andrew Stanton, Sigourney Weaver, Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim ReardonKathy Najimy, Elissa Knight, Macintalk, Jeff Garlin, Ben Burtt, Fred Willard, John Ratzenberger, Andrew Stanton, Sigourney Weaver, Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim Reardon  See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.5 x 7.4 inches; 2.4 Ounces', 'Item model number': 'DV05436100', 'Director': 'Andrew Stanton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Ben Burtt, Elissa Knight, Jeff Garlin, Fred Willard, Macintalk', 'Studio': 'DISNEY/PIXAR', 'Writers': 'Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim Reardon', 'Number of discs': '1'}\nReview Text: I didn't realize, but this movie is now 10 years old.  It holds up like it was in theaters yesterday.  Really well told and beautifully done.\nReview Title: excellent flick\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Faerie Tale Theatre - Sleeping Beauty [DVD]\nJohn Achorn  (Actor),     Shelley Duvall  (Actor),     Jeremy Kagan  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['A princess who has been put into a deep sleep by an evil fairy is awakened one hundred years later by the kiss of a prince.']\n{'Format': 'Color, DVD, NTSC', 'Contributor': 'Donovan Scott, John Achorn, John Salazar, Patrick DeSantis, Shelley Duvall, Charlie Dell, Mark Blankfield, Bud Cort, Rene Auberjonois, Jean Stapleton, Maysie Hoy, Charles Perrault, Jeffrey Alan Fiskin, Jeremy Kagan, David McCharenDonovan Scott, John Achorn, John Salazar, Patrick DeSantis, Shelley Duvall, Charlie Dell, Mark Blankfield, Bud Cort, Rene Auberjonois, Jean Stapleton, Maysie Hoy, Charles Perrault, Jeffrey Alan Fiskin, Jeremy Kagan, David McCharen  See more', 'Language': 'English', 'Runtime': '58 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 0.75 inches; 4 Ounces', 'Director': 'Jeremy Kagan', 'Media Format': 'Color, DVD, NTSC', 'Run time': '58 minutes', 'Release date': 'November 16, 2004', 'Actors': 'John Achorn, Shelley Duvall, Patrick DeSantis, David McCharen, Charlie Dell', 'Studio': 'Starmaker II', 'Writers': 'Charles Perrault, Jeffrey Alan Fiskin', 'Number of discs': '1'}\nthis is worth it just to hear Bernadette Peters sing \"I'm nobody's baby\".  it is absolutely breathtaking and heartbreaking and all those wonderful qualities that only she can bring to a song.\njust for her voice\nBette Midler: The Showgirl Must Go On\nBette Midler  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['The Divine Miss M is back! Bette Midler returns in this Las Vegas extravaganza taped before a packed house at The Colosseum at Caesars Palace in Las Vegas, the 70-minute cavalcade features an exhilarating tour de force of some of Ms. Midler’s colorful and classic stage characters. Joining her is an entourage of talented performers, including the staggering Harlettes, 16 dazzling dancers she calls The Caesar Salad Girls and a 13-piece band. Thrilling audiences with her captivating performances, Ms. Midler’s superstar power continues to shine as she belts out show stopping renditions of her biggest hits including “The Rose,” “Boogie Woogie Bugle Boy,” “From a Distance,” “Hello in There” and “Wind Beneath My Wings.”', 'Song List: Big Noise from Winnetka, The Showgirl Must Go On, Friends, The Rose, Do You Wanna Dance, From a Distance, Boolya JaDa, Hello in There, Pretty Legs/Hot in Here, Boogie Woogie Bugle Boy, Wind Beneath My Wings']\n{'Genre': 'Pop, Music Video & Concerts', 'Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Contributor': 'Bette Midler', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '21164824', 'Director': 'Bette Midler', 'Media Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Run time': '1 hour and 7 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Bette Midler', 'Studio': 'IMAGE ENTERTAINMENT', 'Number of discs': '1'}\nI'm sure this was an incredible show at an incredible venue, but you'd never know if from the DVD.  This is the worst produced DVD ever in the history of the world.  The audio quality is horrible, and the video isn't much better.  For gosh sakes this is LAS VEGAS in the super showroom built to house Ms Dion for five years, you know they've got the very best sound and video available, but this DVD is just a bad afterthought.  It's a shame, because Ms Midler has always been captured best live on camera, and she has a whole catalogue of HBO shows that were extremely well done (but apparently aren't available today).<br /><br />I've loved Bette Midler her entire career, but this DVD is absolutely a piece of crap.  Do not bother.  It is an insult to one of the great talents of all time.\nEven die-hard fans, don't bother\nBrazil\nJonathan Pryce  (Actor),     Robert De Niro  (Actor),     Terry Gilliam  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Product Description', \"Jonathan Pryce, Robert De Niro. Filled with Terry Gilliam's trademark humor and visual inventiveness, Brazil takes place in a futuristic world where individualism is revoked by a controlling state. In spite of it all, a civil servant dreams of overcoming the bureaucracy, winning over the woman he loves and reinstating true justice. A satirical, imaginative and ambitious film. 1985/color/131 min/NR/widescreen.\", 'Amazon.com', \"If Franz Kafka had been an animator and film director--oh, and a member of Monty Python's Flying Circus--this is the sort of outrageously dystopian satire one could easily imagine him making. However,\", 'Brazil', \"was made by Terry Gilliam, who is all of the above except, of course, Franz Kafka. Be that as it may, Gilliam sure captures the paranoid-subversive spirit of Kafka's\", 'The Trial', \"(along with his own Python animation) in this bureaucratic nightmare-comedy about a meek governmental clerk named Sam Lowry (Jonathan Pryce) whose life is destroyed by a simple bug. Not a software bug, a real bug (no doubt related to Kafka's famous\", 'Metamorphosis', 'insect) that gets smooshed in a printer and causes a typographical error unjustly identifying an innocent citizen, one Mr. Buttle, as suspected terrorist Harry Tuttle (Robert De Niro). When Sam becomes enmeshed in unraveling this bureaucratic glitch, he himself winds up labeled as a miscreant.', 'The movie presents such an unrelentingly imaginative and savage vision of 20th-century bureaucracy that it almost became a victim of small-minded studio management itself--until Gilliam surreptitiously screened his cut for the Los Angeles Film Critics Association, who named it the best movie of 1985 and virtually embarrassed Universal into releasing it. This DVD version of', 'Brazil', \"is the special director's cut that first appeared in Criterion's comprehensive (and expensive) six-disc laser package in 1996. Although the DVD (at a fraction of the price) doesn't include that set's many extras, it's still a bargain.\", '--Jim Emerson']\n{'Genre': 'Science Fiction & Fantasy, surreal movie, cult movie, movie night, buy movie, DVD movie, Art House & International, Blu-ray movie, mistaken identity movie, fantasy movie, comedy movie, cult classic, dark comedy movie, Comedy, independent movie, digital movie, indie movie, sci-fi movie, satire movie, rent movieScience Fiction & Fantasy, surreal movie, cult movie, movie night, buy movie, DVD movie, Art House & International, Blu-ray movie, mistaken identity movie, fantasy movie, comedy movie, cult classic, dark comedy movie, Comedy, independent movie, digital movie, indie…   See more', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Contributor': 'Tom Stoppard, Terry Gilliam, Robert De Niro, Bob Hoskins, Michael Palin, Jonathan Pryce, Arnon Milchan, Charles McKeown, Katherine Helmond, Ian HolmTom Stoppard, Terry Gilliam, Robert De Niro, Bob Hoskins, Michael Palin, Jonathan Pryce, Arnon Milchan, Charles McKeown, Katherine Helmond, Ian Holm   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 23 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.68 Ounces', 'Item model number': 'MHV62020168DVD', 'Director': 'Terry Gilliam', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 23 minutes', 'Release date': 'January 9, 2007', 'Actors': 'Jonathan Pryce, Robert De Niro, Michael Palin, Katherine Helmond, Ian Holm', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Arnon Milchan', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Terry Gilliam, Tom Stoppard, Charles McKeown', 'Number of discs': '1'}\nI loved this movie when it originally came out, and I still love it today.  It holds up well.  If anything, it may be even More socially relevant today than it was when originally written, making amazingly accurate predictions about the failure of the modern workplace to become anything close to useful.  An excellent commentary on State and Federal Government offices, ineptitude glorified, and the quest for eternal youth by the rich.\nStill Excellent\nThe Artist [DVD]\nJean Dujardin  (Actor),     Berenice Bejo  (Actor),     Michel Hazanavicius  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Hollywood 1927. George Valentin (Academy Award Winner Jean Dujardin) is a silent movie superstar. The advent of the talkies will sound the death knell for his career and see him fall into oblivion. For young extra Peppy Miller (Berenice Bejo), it seems the sky's the limit - major movie stardom awaits. THE ARTIST tells the story of their interlinked destinies.\", 'Amazon.com', 'The Artist', 'is a love letter and homage to classic black-and-white silent films. The film is enormously likable and is anchored by a charming performance from Jean Dujardin, as silent movie star George Valentin. In late-1920s Hollywood, as Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he makes an intense connection with Peppy Miller, a young dancer set for a big break. As one career declines, another flourishes, and by channeling elements of', 'A Star Is Born', 'and', 'Singing in the Rain', ',', 'The Artist', 'tells the engaging story with humor, melodrama, romance, and--most importantly--silence. As wonderful as the performances by Dujardin and Bérénice Bejo (Miller) are, the real star of', 'The Artist', 'is cinematographer Guillaume Schiffman. Visually, the film is stunning. Crisp and beautifully contrasted, each frame is so wonderfully constructed that this sweet and unique little movie is transformed from entertaining fluff to a profound cinematic achievement. --', 'Kira Canny']\n{'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25291000', 'Director': 'Michel Hazanavicius', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'June 26, 2012', 'Actors': 'Jean Dujardin, Berenice Bejo, James Cromwell, Penelope Miller, Malcolm McDowell', 'Subtitles': 'Spanish', 'Producers': 'Thomas Langmann', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI knew this was a silent movie paying homage to the silent moves of yore, and that it won the Oscar for Best Movie.  I'm surprised.  It's really, really, interesting and well done and beautifully photographed in black and white.  I'm just surprised it won the Oscar, it doesn't seem quite the normal caliber.  If you haven't seen it, watch it, it's interesting and fun.\nNot what I expected\nThe Normal Heart\nMark Ruffalo  (Actor),     Matt Bomer  (Actor),     Ryan Murphy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Emmy Central, Emmy Nominees\n['Directed by Emmy® Award winner Ryan Murphy and written by Academy Award® nominee Larry Kramer, The Normal Heart tells the story of the onset of the HIV-AIDS crisis in New York City in the early 1980s. Based on Kramer’s Tony Award® winning play of the same name, it takes an unflinching look at the nation’s sexual politics as gay activists and their allies in the medical community fight to expose the truth about the burgeoning epidemic to a city and nation in denial. An ensemble of searing performances featuring Academy Award® nominee Mark Ruffalo, Matt Bomer, Taylor Kitsch, Emmy® winner Jim Parsons, and Academy Award® winner Julia Roberts.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Denis O'Hare, Alfred Molina, Jim Parsons, Will Bradley, Alexis Martin Woodall, Taylor Kitsch, Stephen Spinella, Larry Kramer, Joe Mantello, Mark Ruffalo, Matt Bomer, Scott Ferguson, Julia Roberts, Ryan Murphy, BD WongDenis O'Hare, Alfred Molina, Jim Parsons, Will Bradley, Alexis Martin Woodall, Taylor Kitsch, Stephen Spinella, Larry Kramer, Joe Mantello, Mark Ruffalo, Matt Bomer, Scott Ferguson, Julia Roberts, Ryan Murphy, BD Wong   See more\", 'Language': 'English', 'Runtime': '2 hours and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'HBO1000498053DVD', 'Director': 'Ryan Murphy', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 23 minutes', 'Release date': 'August 26, 2014', 'Actors': 'Mark Ruffalo, Matt Bomer, Taylor Kitsch, Jim Parsons, Julia Roberts', 'Subtitles': 'Spanish, French, English', 'Producers': 'Scott Ferguson, Alexis Martin Woodall', 'Studio': 'HBO', 'Writers': 'Larry Kramer', 'Number of discs': '1'}\nNot much to be said except it's about time and this is a wonderful filmed version of the play Larry Kramer wrote back when all this nightmare started.  Everyone should see it, especially today's gay youth, because it's important and should not ever be forgotten.\nHooray and 5 stars\nPEE-WEE'S PLAYHOUSE SSN1-2 DVD\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Pee Wees Play S1&2']\n{'Genre': 'Kids & Family/Television', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': 'Various', 'Language': 'English, English', 'Runtime': '9 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 5.15 Ounces', 'Item model number': '30072198', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '9 hours', 'Release date': 'October 21, 2014', 'Actors': 'Various', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '4'}\nThis is essential\nessential\nInterior. Leather Bar.\nJames Franco  (Actor, Director),     Val Lauren  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Drama\n['Product Description', 'Inspired by the mythology surrounding the highly controversial 1980 film, Cruising, starring Al Pacino - in which, 40 minutes of sexually explicit material was forced to be cut out - filmmakers James Franco and Travis Mathews set out to re-imagine the lost footage. Assembling a mix of gay and straight men, including Val Lauren (THE SALTON SEA, LIVE FROM BAGHDAD) in the lead role, the result is a provocative exploration of the importance of the radical and transgress in society and the value of engaging with the unfamiliar.', 'Review', 'A truly one-of-a-kind film from James Franco & Co. seriously, intelligently, and movingly addresses sexuality in film. --Film Journal InternationalA cheerfully unsettling exploration of mainstream representations of male homosexuality. --The Los Angeles TimesOne of the sharpest, best surprises of the [2013 Sundance Film] Festival. --The New York Times']\n{'Genre': 'Gay & Lesbian, Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Val Lauren, Christian Patrick, James Franco, Travis Matthews', 'Language': 'English', 'Runtime': '1 hour', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '28935376', 'Director': 'James Franco, Travis Matthews', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'April 15, 2014', 'Actors': 'James Franco, Val Lauren, Travis Matthews, Christian Patrick', 'Studio': 'Strand Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA nice exploration of the creative process.  This is more of a documentary, not a feature film.  No, James Franco does not get naked or make out with guys, so just stop that.\nexploration\nSeven Psychopaths [DVD]\nColin Farrell  (Actor),     Sam Rockwell  (Actor),     Martin McDonagh  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"A struggling screenwriter inadvertently becomes entangled in the Los Angeles criminal underworld after his oddball friends kidnap a gangster's beloved Shih Tzu.\", 'Amazon.com', 'At a time when pop culture-savvy assassins run a dime a dozen,', 'In Bruges', \", the first film from Irish playwright Martin McDonagh, registered as a brilliant anomaly: a literate, mordantly funny hit man movie that didn't lean on the standard Tarantinoisms. (If the director had a cinematic inspiration, it was more likely Stephen Frears's masterful 1984 film\", 'The Hit', '.)', 'Seven Psychopaths', ', McDonagh\\'s follow-up, strikes a much broader vein, melding parody, self-referential humor, and clever meta-fiction into one big splattery ball. Buckle up, basically. Colin Farrell plays an Irish screenwriter named, er, Martin who is terminally stuck on his latest script, an ultraviolent affair named \"Seven Psychopaths.\" (We mentioned that this is meta, right?) Desperate for an ending, he turns to his lowlife friend (Sam Rockwell) for inspiration. As his new writing partner\\'s suggestions get increasingly detailed, Martin realizes that the insanity is no longer constrained to the page. Tom Waits shows up at one point, because this is the kind of movie that this is. It takes a strong director to hold together this amount of whirling chaos, and McDonagh proves himself up to the task (mostly), with the game work from his leads abetted by vivid supporting turns from Kevin Corrigan, Woody Harrelson, and Harry Dean Stanton, whose brief appearance cries out for a spinoff all of his own. McDonagh\\'s true ace in the hole, though, is Christopher Walken, who is simply astounding as an aging dognapper with one lulu of a backstory. Walken\\'s ability to go way over the top has been well documented, but here he underplays, a decision that ultimately stabilizes the film\\'s hurtling, streaky bursts of inspiration. No matter how goofy the movie around him gets, he\\'s always one step beyond. --', 'Andrew Wright']\n{'Genre': 'Comedy', 'Format': 'NTSC, DVD', 'Contributor': 'Colin Farrell, Christopher Walken, Tom Waits, Olga Kurylenko, Sam Rockwell, Woody Harrelson, Graham Broadbent, Blueprint Pictures; British Film Institute (BFI); Film4, Martin McDonagh, Peter Czernin, Abbie CornishColin Farrell, Christopher Walken, Tom Waits, Olga Kurylenko, Sam Rockwell, Woody Harrelson, Graham Broadbent, Blueprint Pictures; British Film Institute (BFI); Film4, Martin McDonagh, Peter Czernin, Abbie Cornish   See more', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': '26251796', 'Director': 'Martin McDonagh', 'Media Format': 'NTSC, DVD', 'Run time': '1 hour and 50 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Colin Farrell, Sam Rockwell, Woody Harrelson, Christopher Walken, Tom Waits', 'Subtitles': 'English, Spanish', 'Producers': 'Martin McDonagh, Peter Czernin, Graham Broadbent', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis movie is so well written, and so well cast, and so well acted, and so well done.  Just see it.\nwell done\nPee-Wee's Playhouse: Christmas Special\nPaul Reubens  (Actor, Director),     Annette Funicello  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Pee-wee’s Christmas Special As You’ve Never Seen It Before: Beautifully Restored, Remastered and in High Definition! Join the whole Playhouse gang for one of the wackiest specials ever! With laughs for the whole family, this unique, triple Emmy nominated special offers all the imagination and charm of Saturday morning’s most outrageous TV series, which became a cultural milestone when it aired from 1986-1991. Pee-wee gets into the spirit of the season with lots of singing, dancing and other holiday fun with his Playhouse pals and more than a dozen celebrity guest stars as you’ve never seen them before. Everything is going great for Pee-wee… until his Christmas wish list becomes so long that there won’t be enough presents for all the other kids in the world! When Santa Claus pleads for help, Pee-wee reluctantly learns a lesson about the true meaning of Christmas. Special Guests Include: Frankie Avalon, Charo, The Del Rubio Triplets, Annette Funicello, Zsa Zsa Gabor, Whoopi Goldberg, Magic Johnson, Grace Jones, k.d. lang, Little Richard, Joan Rivers, Dinah Shore and Oprah Winfrey!']\n{'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Paul Reubens, Frankie Avalon, Annette Funicello', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Item model number': '35225455', 'Director': 'Paul Reubens', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '48 minutes', 'Release date': 'October 6, 2015', 'Actors': 'Paul Reubens, Annette Funicello, Frankie Avalon', 'Studio': 'Shout Factory', 'Number of discs': '1'}\nIt's not the holidays until you and yours sit down to watch Pee Wee's Christmas Special.  Great fun for all ages.  A modern classic.\ntis the season\nWall-E (Single-Disc Edition)\nBen Burtt  (Actor),     Elissa Knight  (Actor),     Andrew Stanton  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Characters & Series, Wall-E\n['Product Description', \"The highly acclaimed director of FINDING NEMO and the creative storytellers behind CARS and RATATOUILLE transport you to a galaxy not so far away for a new cosmic comedy adventure about a determined robot named WALL-E. After hundreds of lonely years of doing what he was built for, the curious and lovable WALL-E discovers a new purpose in life when he meets a sleek search robot named EVE. Join them and a hilarious cast of characters on a fantastic journey across the universe. Transport yourself to a fascinating new world with Disney-Pixar's latest adventure, now even more astonishing on DVD and Blu-ray(TM) and loaded with bonus features, including the exclusive animated short film BURN-E. WALL-E is a film your family will want to enjoy over and over again.\", 'Amazon.com', 'Pixar genius reigns in this funny romantic comedy, which stars a robot who says absolutely nothing for a full 25 minutes yet somehow completely transfixes and endears himself to the audience within the first few minutes of the film. As the last robot left on earth, Wall-E (voiced by Ben Burtt) is one small robot--with a big, big heart--who holds the future of earth and mankind squarely in the palm of his metal hand. He\\'s outlasted all the \"Waste Allocation Load Lifter Earth-Class\" robots that were assigned some 700 years ago to clean up the environmental mess that man made of earth while man vacationed aboard the luxury spaceship Axiom. Wall-E has dutifully gone about his job compacting trash, the extreme solitude broken only by his pet cockroach, but he\\'s developed some oddly human habits and ideas. When the Axiom sends its regularly scheduled robotic EVE probe (Elissa Knight) to earth, Wall-E is instantly smitten and proceeds to try to impress EVE with his collection of human memorabilia. EVE\\'s directive compels her to bring Wall-E\\'s newly collected plant sprout to the captain of the Axiom and Wall-E follows in hot pursuit. Suddenly, the human world is turned upside down and the Captain (Jeff Garlin) joins forces with Wall-E and a cast of other misfit robots to lead the now lethargic people back home to earth.', 'Wall-E', 'is a great family film with the most impressive aspect being the depth of emotion conveyed by a simple robot--a machine typically considered devoid of emotion, but made so absolutely touching by the magic of Pixar animation. Also well-worth admiring are the sweeping views from space, the creative yet disturbing vision of what strange luxuries a future space vacation might offer, and the innovative use of trash in a future cityscape. Underneath the slapstick comedy and touching love story is a poignant message about the folly of human greed and its potential effects on earth and the entire human race.', 'Wall-E', 'is preceded in theaters by the comical short', 'Presto', \"in which a magician's rabbit, unfed one too many times takes his revenge against the egotistical magician. (Ages 3 and older)\", '--Tami Horiuchi', '>', 'Stills from', 'Wall-E', '(Click for larger image)', 'Review', 'Golden Globes 2009 Winner Best Animated Feature Film', 'Boston Society of Film Critics Awards 2008 Winner Best Animated Film', 'Chicago Film Critics Association Awards 2008 Winner Best Animated Feature', 'Chicago Film Critics Association Awards 2008Winner Best Original Score', 'Chicago Film Critics Association Awards 2008 Winner Best Picture', 'Chicago Film Critics Association Awards 2008 Winner Best Screenplay, Original', 'Hollywood Film Festival 2008 Winner Animation of the Year', 'Los Angeles Film Critics Association Awards 2008 Winner Best Picture', 'National Board of Review, USA 2008 Winner Best Animated Feature', 'National Movie Awards, UK 2008 Winner Best Family Film', 'New York Film Critics Circle Awards 2008 Winner Best Animated Film', 'Southeastern Film Critics Association Awards 2008 Winner Best Animated Film', 'Toronto Film Critics Association Awards 2008 Winner Best Animated Feature', 'World Soundtrack Awards 2008 Winner Best Original Song Written Directly for FilmMusic by Thomas Newman, Music by, lyrics by, performed by Peter Gabriel Down To Earth --imdb.com', 'See more']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Kathy Najimy, Elissa Knight, Macintalk, Jeff Garlin, Ben Burtt, Fred Willard, John Ratzenberger, Andrew Stanton, Sigourney Weaver, Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim ReardonKathy Najimy, Elissa Knight, Macintalk, Jeff Garlin, Ben Burtt, Fred Willard, John Ratzenberger, Andrew Stanton, Sigourney Weaver, Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim Reardon  See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.5 x 7.4 inches; 2.4 Ounces', 'Item model number': 'DV05436100', 'Director': 'Andrew Stanton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Ben Burtt, Elissa Knight, Jeff Garlin, Fred Willard, Macintalk', 'Studio': 'DISNEY/PIXAR', 'Writers': 'Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim Reardon', 'Number of discs': '1'}\nI didn't realize, but this movie is now 10 years old.  It holds up like it was in theaters yesterday.  Really well told and beautifully done.\nexcellent flick",
  "profile": "**User Profile Summary:**\n\n- **Primary Interests:** Deeply enjoys movies and TV shows, particularly in the Science Fiction & Fantasy genres, with a strong preference for independent films that challenge conventional narratives. The user also appreciates family-friendly children's programming that evokes nostalgia and offers laughter for all ages.\n\n- **Content Preference:** Values impactful narratives and wholesome entertainment, with a focus on titles addressing social issues and historical themes, as well as those promoting social justice.\n\n- **Artistic Appreciation:** Takes a strong interest in vocal performances and musical elements, favoring innovative storytelling that blends classic and contemporary styles while prioritizing narrative creativity.\n\n- **Nostalgia Factor:** Holds cherished memories of timeless stories, enjoying children's content that brings back fond experiences.\n\n- **Engagement Style:** Provides insightful feedback focusing on emotional responses, artistic quality, and societal implications, especially in relation to children's programming.\n\n- **Media Format Preference:** Prefers physical media formats, such as DVDs, for their comprehensive presentations and enriching bonus features.\n\n- **Recent Interaction:** Recently praised a highly acclaimed animated film for its emotional resonance and narrative integrity, highlighting its contemporary relevance and timeless storytelling. The user expressed a strong appreciation for well-crafted animated features that maintain their impact over the years.\n\nOverall, the user is committed to exploring imaginative and meaningful stories that resonate on multiple levels, embracing both critically acclaimed content and nostalgic properties to enhance family experiences during special occasions.",
  "metrics": {
    "rouge1_f": 0.057649667405764965,
    "rouge2_f": 0.007985803016858917,
    "rougeL_f": 0.03148558758314856,
    "meteor": 0.016479833153327624,
    "bleu1": 2.3470131876229237e-09,
    "bleu2": 9.449054384823105e-10,
    "bleu3": 4.0189976191780863e-10,
    "bleu4": 2.2059460033436163e-10,
    "bertscore_precision": 0.3490244150161743,
    "bertscore_recall": 0.5159599184989929,
    "bertscore_f1": 0.4163835048675537
  }
}