{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Normal Heart\nReview Date: 2014/12/05\nStore: Mark Ruffalo  (Actor),     Matt Bomer  (Actor),     Ryan Murphy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Award Winners in Movies & TV, Emmy Central, Emmy Nominees\nProduct Description: ['Directed by Emmy® Award winner Ryan Murphy and written by Academy Award® nominee Larry Kramer, The Normal Heart tells the story of the onset of the HIV-AIDS crisis in New York City in the early 1980s. Based on Kramer’s Tony Award® winning play of the same name, it takes an unflinching look at the nation’s sexual politics as gay activists and their allies in the medical community fight to expose the truth about the burgeoning epidemic to a city and nation in denial. An ensemble of searing performances featuring Academy Award® nominee Mark Ruffalo, Matt Bomer, Taylor Kitsch, Emmy® winner Jim Parsons, and Academy Award® winner Julia Roberts.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Denis O'Hare, Alfred Molina, Jim Parsons, Will Bradley, Alexis Martin Woodall, Taylor Kitsch, Stephen Spinella, Larry Kramer, Joe Mantello, Mark Ruffalo, Matt Bomer, Scott Ferguson, Julia Roberts, Ryan Murphy, BD WongDenis O'Hare, Alfred Molina, Jim Parsons, Will Bradley, Alexis Martin Woodall, Taylor Kitsch, Stephen Spinella, Larry Kramer, Joe Mantello, Mark Ruffalo, Matt Bomer, Scott Ferguson, Julia Roberts, Ryan Murphy, BD Wong   See more\", 'Language': 'English', 'Runtime': '2 hours and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'HBO1000498053DVD', 'Director': 'Ryan Murphy', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 23 minutes', 'Release date': 'August 26, 2014', 'Actors': 'Mark Ruffalo, Matt Bomer, Taylor Kitsch, Jim Parsons, Julia Roberts', 'Subtitles': 'Spanish, French, English', 'Producers': 'Scott Ferguson, Alexis Martin Woodall', 'Studio': 'HBO', 'Writers': 'Larry Kramer', 'Number of discs': '1'}\nReview Text: Not much to be said except it's about time and this is a wonderful filmed version of the play Larry Kramer wrote back when all this nightmare started.  Everyone should see it, especially today's gay youth, because it's important and should not ever be forgotten.\nReview Title: Hooray and 5 stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Faerie Tale Theatre - Sleeping Beauty [DVD]\nJohn Achorn  (Actor),     Shelley Duvall  (Actor),     Jeremy Kagan  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['A princess who has been put into a deep sleep by an evil fairy is awakened one hundred years later by the kiss of a prince.']\n{'Format': 'Color, DVD, NTSC', 'Contributor': 'Donovan Scott, John Achorn, John Salazar, Patrick DeSantis, Shelley Duvall, Charlie Dell, Mark Blankfield, Bud Cort, Rene Auberjonois, Jean Stapleton, Maysie Hoy, Charles Perrault, Jeffrey Alan Fiskin, Jeremy Kagan, David McCharenDonovan Scott, John Achorn, John Salazar, Patrick DeSantis, Shelley Duvall, Charlie Dell, Mark Blankfield, Bud Cort, Rene Auberjonois, Jean Stapleton, Maysie Hoy, Charles Perrault, Jeffrey Alan Fiskin, Jeremy Kagan, David McCharen  See more', 'Language': 'English', 'Runtime': '58 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.25 x 0.75 inches; 4 Ounces', 'Director': 'Jeremy Kagan', 'Media Format': 'Color, DVD, NTSC', 'Run time': '58 minutes', 'Release date': 'November 16, 2004', 'Actors': 'John Achorn, Shelley Duvall, Patrick DeSantis, David McCharen, Charlie Dell', 'Studio': 'Starmaker II', 'Writers': 'Charles Perrault, Jeffrey Alan Fiskin', 'Number of discs': '1'}\nthis is worth it just to hear Bernadette Peters sing \"I'm nobody's baby\".  it is absolutely breathtaking and heartbreaking and all those wonderful qualities that only she can bring to a song.\njust for her voice\nBette Midler: The Showgirl Must Go On\nBette Midler  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['The Divine Miss M is back! Bette Midler returns in this Las Vegas extravaganza taped before a packed house at The Colosseum at Caesars Palace in Las Vegas, the 70-minute cavalcade features an exhilarating tour de force of some of Ms. Midler’s colorful and classic stage characters. Joining her is an entourage of talented performers, including the staggering Harlettes, 16 dazzling dancers she calls The Caesar Salad Girls and a 13-piece band. Thrilling audiences with her captivating performances, Ms. Midler’s superstar power continues to shine as she belts out show stopping renditions of her biggest hits including “The Rose,” “Boogie Woogie Bugle Boy,” “From a Distance,” “Hello in There” and “Wind Beneath My Wings.”', 'Song List: Big Noise from Winnetka, The Showgirl Must Go On, Friends, The Rose, Do You Wanna Dance, From a Distance, Boolya JaDa, Hello in There, Pretty Legs/Hot in Here, Boogie Woogie Bugle Boy, Wind Beneath My Wings']\n{'Genre': 'Pop, Music Video & Concerts', 'Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Contributor': 'Bette Midler', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '21164824', 'Director': 'Bette Midler', 'Media Format': 'NTSC, Color, Dolby, DTS Surround Sound, Multiple Formats', 'Run time': '1 hour and 7 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Bette Midler', 'Studio': 'IMAGE ENTERTAINMENT', 'Number of discs': '1'}\nI'm sure this was an incredible show at an incredible venue, but you'd never know if from the DVD.  This is the worst produced DVD ever in the history of the world.  The audio quality is horrible, and the video isn't much better.  For gosh sakes this is LAS VEGAS in the super showroom built to house Ms Dion for five years, you know they've got the very best sound and video available, but this DVD is just a bad afterthought.  It's a shame, because Ms Midler has always been captured best live on camera, and she has a whole catalogue of HBO shows that were extremely well done (but apparently aren't available today).<br /><br />I've loved Bette Midler her entire career, but this DVD is absolutely a piece of crap.  Do not bother.  It is an insult to one of the great talents of all time.\nEven die-hard fans, don't bother\nBrazil\nJonathan Pryce  (Actor),     Robert De Niro  (Actor),     Terry Gilliam  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Product Description', \"Jonathan Pryce, Robert De Niro. Filled with Terry Gilliam's trademark humor and visual inventiveness, Brazil takes place in a futuristic world where individualism is revoked by a controlling state. In spite of it all, a civil servant dreams of overcoming the bureaucracy, winning over the woman he loves and reinstating true justice. A satirical, imaginative and ambitious film. 1985/color/131 min/NR/widescreen.\", 'Amazon.com', \"If Franz Kafka had been an animator and film director--oh, and a member of Monty Python's Flying Circus--this is the sort of outrageously dystopian satire one could easily imagine him making. However,\", 'Brazil', \"was made by Terry Gilliam, who is all of the above except, of course, Franz Kafka. Be that as it may, Gilliam sure captures the paranoid-subversive spirit of Kafka's\", 'The Trial', \"(along with his own Python animation) in this bureaucratic nightmare-comedy about a meek governmental clerk named Sam Lowry (Jonathan Pryce) whose life is destroyed by a simple bug. Not a software bug, a real bug (no doubt related to Kafka's famous\", 'Metamorphosis', 'insect) that gets smooshed in a printer and causes a typographical error unjustly identifying an innocent citizen, one Mr. Buttle, as suspected terrorist Harry Tuttle (Robert De Niro). When Sam becomes enmeshed in unraveling this bureaucratic glitch, he himself winds up labeled as a miscreant.', 'The movie presents such an unrelentingly imaginative and savage vision of 20th-century bureaucracy that it almost became a victim of small-minded studio management itself--until Gilliam surreptitiously screened his cut for the Los Angeles Film Critics Association, who named it the best movie of 1985 and virtually embarrassed Universal into releasing it. This DVD version of', 'Brazil', \"is the special director's cut that first appeared in Criterion's comprehensive (and expensive) six-disc laser package in 1996. Although the DVD (at a fraction of the price) doesn't include that set's many extras, it's still a bargain.\", '--Jim Emerson']\n{'Genre': 'Science Fiction & Fantasy, surreal movie, cult movie, movie night, buy movie, DVD movie, Art House & International, Blu-ray movie, mistaken identity movie, fantasy movie, comedy movie, cult classic, dark comedy movie, Comedy, independent movie, digital movie, indie movie, sci-fi movie, satire movie, rent movieScience Fiction & Fantasy, surreal movie, cult movie, movie night, buy movie, DVD movie, Art House & International, Blu-ray movie, mistaken identity movie, fantasy movie, comedy movie, cult classic, dark comedy movie, Comedy, independent movie, digital movie, indie…   See more', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Contributor': 'Tom Stoppard, Terry Gilliam, Robert De Niro, Bob Hoskins, Michael Palin, Jonathan Pryce, Arnon Milchan, Charles McKeown, Katherine Helmond, Ian HolmTom Stoppard, Terry Gilliam, Robert De Niro, Bob Hoskins, Michael Palin, Jonathan Pryce, Arnon Milchan, Charles McKeown, Katherine Helmond, Ian Holm   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 23 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.68 Ounces', 'Item model number': 'MHV62020168DVD', 'Director': 'Terry Gilliam', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 23 minutes', 'Release date': 'January 9, 2007', 'Actors': 'Jonathan Pryce, Robert De Niro, Michael Palin, Katherine Helmond, Ian Holm', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Arnon Milchan', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Terry Gilliam, Tom Stoppard, Charles McKeown', 'Number of discs': '1'}\nI loved this movie when it originally came out, and I still love it today.  It holds up well.  If anything, it may be even More socially relevant today than it was when originally written, making amazingly accurate predictions about the failure of the modern workplace to become anything close to useful.  An excellent commentary on State and Federal Government offices, ineptitude glorified, and the quest for eternal youth by the rich.\nStill Excellent\nThe Artist [DVD]\nJean Dujardin  (Actor),     Berenice Bejo  (Actor),     Michel Hazanavicius  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Hollywood 1927. George Valentin (Academy Award Winner Jean Dujardin) is a silent movie superstar. The advent of the talkies will sound the death knell for his career and see him fall into oblivion. For young extra Peppy Miller (Berenice Bejo), it seems the sky's the limit - major movie stardom awaits. THE ARTIST tells the story of their interlinked destinies.\", 'Amazon.com', 'The Artist', 'is a love letter and homage to classic black-and-white silent films. The film is enormously likable and is anchored by a charming performance from Jean Dujardin, as silent movie star George Valentin. In late-1920s Hollywood, as Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he makes an intense connection with Peppy Miller, a young dancer set for a big break. As one career declines, another flourishes, and by channeling elements of', 'A Star Is Born', 'and', 'Singing in the Rain', ',', 'The Artist', 'tells the engaging story with humor, melodrama, romance, and--most importantly--silence. As wonderful as the performances by Dujardin and Bérénice Bejo (Miller) are, the real star of', 'The Artist', 'is cinematographer Guillaume Schiffman. Visually, the film is stunning. Crisp and beautifully contrasted, each frame is so wonderfully constructed that this sweet and unique little movie is transformed from entertaining fluff to a profound cinematic achievement. --', 'Kira Canny']\n{'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25291000', 'Director': 'Michel Hazanavicius', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'June 26, 2012', 'Actors': 'Jean Dujardin, Berenice Bejo, James Cromwell, Penelope Miller, Malcolm McDowell', 'Subtitles': 'Spanish', 'Producers': 'Thomas Langmann', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI knew this was a silent movie paying homage to the silent moves of yore, and that it won the Oscar for Best Movie.  I'm surprised.  It's really, really, interesting and well done and beautifully photographed in black and white.  I'm just surprised it won the Oscar, it doesn't seem quite the normal caliber.  If you haven't seen it, watch it, it's interesting and fun.\nNot what I expected\nThe Normal Heart\nMark Ruffalo  (Actor),     Matt Bomer  (Actor),     Ryan Murphy  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Emmy Central, Emmy Nominees\n['Directed by Emmy® Award winner Ryan Murphy and written by Academy Award® nominee Larry Kramer, The Normal Heart tells the story of the onset of the HIV-AIDS crisis in New York City in the early 1980s. Based on Kramer’s Tony Award® winning play of the same name, it takes an unflinching look at the nation’s sexual politics as gay activists and their allies in the medical community fight to expose the truth about the burgeoning epidemic to a city and nation in denial. An ensemble of searing performances featuring Academy Award® nominee Mark Ruffalo, Matt Bomer, Taylor Kitsch, Emmy® winner Jim Parsons, and Academy Award® winner Julia Roberts.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Denis O'Hare, Alfred Molina, Jim Parsons, Will Bradley, Alexis Martin Woodall, Taylor Kitsch, Stephen Spinella, Larry Kramer, Joe Mantello, Mark Ruffalo, Matt Bomer, Scott Ferguson, Julia Roberts, Ryan Murphy, BD WongDenis O'Hare, Alfred Molina, Jim Parsons, Will Bradley, Alexis Martin Woodall, Taylor Kitsch, Stephen Spinella, Larry Kramer, Joe Mantello, Mark Ruffalo, Matt Bomer, Scott Ferguson, Julia Roberts, Ryan Murphy, BD Wong   See more\", 'Language': 'English', 'Runtime': '2 hours and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'HBO1000498053DVD', 'Director': 'Ryan Murphy', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 23 minutes', 'Release date': 'August 26, 2014', 'Actors': 'Mark Ruffalo, Matt Bomer, Taylor Kitsch, Jim Parsons, Julia Roberts', 'Subtitles': 'Spanish, French, English', 'Producers': 'Scott Ferguson, Alexis Martin Woodall', 'Studio': 'HBO', 'Writers': 'Larry Kramer', 'Number of discs': '1'}\nNot much to be said except it's about time and this is a wonderful filmed version of the play Larry Kramer wrote back when all this nightmare started.  Everyone should see it, especially today's gay youth, because it's important and should not ever be forgotten.\nHooray and 5 stars",
  "profile": "**User Profile Summary:**\n\n- **Primary Interests:** Movies and TV shows, with a continued focus on the Science Fiction & Fantasy genre, alongside a growing interest in musicals and concert performances, particularly those that address significant social issues.\n- **Content Preference:** Engages with family-friendly and wholesome entertainment (rated G), while also seeking out impactful narratives, including live performances and films that provide social commentary, evidenced by a sensitivity to historical contexts and social justice themes.\n- **Artistic Appreciation:** Values strong vocal performances and musical elements, with admiration for artists like Bernadette Peters and Bette Midler. Shows a notable appreciation for thought-provoking dramas that delve into critical aspects of society and history, merging classic and contemporary storytelling.\n- **Nostalgia Factor:** Deep respect for classic cinematic styles and timeless stories, particularly those spotlighting acclaimed artists celebrated in film history.\n- **Engagement Style:** Provides insightful and critical feedback focusing on emotional responses and production quality, demonstrating a commitment to understanding the deeper significance of award-winning works, especially those with socio-political relevance.\n- **Media Format Preference:** Prefers physical media formats like DVDs, valuing comprehensive presentations and special features that enhance the viewing experience.\n\nThe user is likely to continue exploring imaginative narratives that challenge societal norms while remaining discerning about artistic quality and historical accuracy.",
  "metrics": {
    "rouge1_f": 0.09814894532931555,
    "rouge2_f": 0.008616975441619991,
    "rougeL_f": 0.046491605682307355,
    "meteor": 0.029268203721624357,
    "bleu1": 1.738914421364118e-05,
    "bleu2": 5.411740189383755e-06,
    "bleu3": 2.08024365486791e-06,
    "bleu4": 1.0855649873326919e-06,
    "bertscore_precision": 0.3481382727622986,
    "bertscore_recall": 0.49020424485206604,
    "bertscore_f1": 0.40713393688201904
  }
}