{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Night of the Comet [DVD]\nReview Date: 2009/08/01\nStore: Catherine Mary Stewart  (Actor),     Kelli Maroney  (Actor),     Thom Eberhardt  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: ['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG13', 'Release Date:', '6-MAR-2007', 'Media Type:', 'DVD', 'Amazon.com', \"A sleeper at the time of its release in 1984, Thom Eberhardt's\", 'Night of the Comet', \"has built a small cadre of fans thanks to its breezy performances and blend of comedy and tongue-in-cheek science fiction. Catherine Mary Stewart and Kelli Maroney are thoroughly likable as a pair of San Fernando Valley sisters who find themselves completely alone after the arrival of Halley's Comet reduces their affluent community--and most of Los Angeles--to dust. Their subsequent nonstop shopping spree is soon interrupted by predatory zombies, as well as a sinister scientific cabal (led by cult favorites Mary Woronov and Geoffrey Lewis) with designs on the girls. Stewart and Maroney are terrifically game as the heroines (especially Maroney, whose flair for bubbly comedy was never given another chance on screen), and Robert (\", 'Star Trek: Voyager', \") Beltran is also on hand as a fellow survivor and romantic lead. Fun for '80s enthusiasts and sci-fi fiends who don't mind a little fizz in their end-of-the-world scenarios.\", '-- Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Contributor': 'Peter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon EricsonPeter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon Ericson   See more', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.55 inches; 2.4 Ounces', 'Director': 'Thom Eberhardt', 'Media Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'March 6, 2007', 'Actors': 'Catherine Mary Stewart, Kelli Maroney, Robert Beltran, Sharon Farrell, Mary Woronov', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Thom Eberhardt', 'Number of discs': '1'}\nReview Text: It's Hokey & Badly Acted for the most part but it screams Bad Old Science Fiction Horror from the 50's and anyone that's seen those films, knows what I mean.<br />I really Enjoyed it.\nReview Title: You Gotta Luv It\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Piglet Files: A Question of Intelligence\nLouise Catt  (Actor),     Nicholas Lyndhurst  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Don\\'t be fooled by the title: this arch British comedy series has nothing to do with Pooh Bear\\'s porcine pal. Instead, it concerns the misadventures of Peter Chapman, a college professor whose life takes surprising turns after he and his wife encounter two bungling spies. He loses his job in academia only to find himself thrust into the shadowy world of espionage, where he assumes the unlikely code name of \"Piglet.\" About 3 hours on 3 DVDs.']\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'Color, NTSC, DVD', 'Run time': '2 hours and 51 minutes', 'Release date': 'April 29, 2003', 'Actors': 'Louise Catt, Nicholas Lyndhurst, Serena Evans, Clive Francis, John Ringham', 'Studio': 'Bfs Entertainment', 'Number of discs': '2'}\nI found this by accident in my library and really enjoyed it! If you like spy-parody comedies, this is worth you're while.\nThis is a Great Series!\nBurn Notice: Season 1\nJeffrey Donovan  (Actor),     Sharon Gless  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'Covert intelligence operative Michael Westen has been punched, kicked, choked and shot. Now he\\'s being burned, and someone\\'s going to pay! When Michael receives a \"burn notice,\" blacklisting him from the intelligence community and compromising his very identity, he must track down a faceless nemesis without getting himself killed in the process. Meanwhile, Michael is forced to double as a private investigator on the dangerous streets of Miami in order to survive.', 'Amazon.com', 'Burn Notice', 'is a canny, clever comedy-thriller show about a covert operative with a heart of gold. Michael Westen (Jeffrey Donovan) is in the middle of a top-secret mission when he discovers he\\'s been \"burned\"--basically, fired without warning. After barely extricating himself from danger, he wakes up in Miami, where the government has abandoned him and locked him out of his own bank account. To make ends meet, he takes on private detective jobs (helping an old lady who\\'s fallen victim to a con artist; rescuing a young girl who\\'s being tricked into white slavery; helping a mother whose son has been kidnapped by the boy\\'s father... only it turns out the father is the rightful parent and the \"mom\" is an assassin sent to kill him--a nice guest star appearance by Lucy Lawless,', 'Xena: Warrior Princess', '), while trying to figure out who burned him and why. Westen tries to remain clinical in his approach to these problems, but he always ends up protecting the helpless with his sophisticated spy skills. Over the course of the first season, he gradually uncovers a mysterious conspiracy that plans to use his talents for their own nefarious ends.', 'Burn Notice', 'deftly mixes the old and the new. The old: Our hero has a hot ex-girlfriend (Gabrielle Anwar,', 'Scent of a Woman', '), a goofy sidekick (cult hero Bruce Campbell of the Evil Dead movies), and a meddling mom (Sharon Gless,', 'Cagney & Lacey', ') who help and hinder him in his investigations, as well as a', 'MacGyver', '-esque skill for making deadly devices out of common household products. The new: A media-savvy way of deconstructing the tricks and techniques of spies and government agencies, often resulting in smart and highly entertaining plot twists. Donovan, handsome but cheeky, combines a light comic touch with a convincing secret agent cool, and the supporting cast fill their niches with aplomb. Their escapades are pretty breezy and occasionally skirt being glib, but most of the time the show finds an extremely entertaining balance between action, romance, and humor. The extras are few (some montages of characteristic moments from the series, including one of the many bikini-clad girls the Miami locale provides) and the commentaries, rather than covering entire episodes, just discuss a few select scenes from each show. Fortunately, the series itself holds up; imagine a cross between', 'Magnum, P.I.', 'and', 'The Wild Wild West', \"(the classic series, not the insulting Will Smith movie) and you're on the right track. --\", 'Bret Fetzer', 'Stills from', 'Burn Notice', '(Click for larger image)']\n{'Genre': 'Action & Adventure/Television', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Contributor': 'Sharon Gless, Bruce Campbell, Gabrielle Anwar, Jeffrey Donovan', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Surround), Spanish (Dolby Surround)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 7.8 Ounces', 'Item model number': '19840984922', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Run time': '8 hours and 55 minutes', 'Release date': 'June 17, 2008', 'Actors': 'Jeffrey Donovan, Sharon Gless, Bruce Campbell, Gabrielle Anwar', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nI only began watching Burn Notice because Bruce Campbell was in the mix... I've always been a fan of his... Fortunately, the other stars of the show are just as entertaining and the stories aren't half bad either.\nIt's an Enjoyable Show\nNight of the Comet [DVD]\nCatherine Mary Stewart  (Actor),     Kelli Maroney  (Actor),     Thom Eberhardt  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG13', 'Release Date:', '6-MAR-2007', 'Media Type:', 'DVD', 'Amazon.com', \"A sleeper at the time of its release in 1984, Thom Eberhardt's\", 'Night of the Comet', \"has built a small cadre of fans thanks to its breezy performances and blend of comedy and tongue-in-cheek science fiction. Catherine Mary Stewart and Kelli Maroney are thoroughly likable as a pair of San Fernando Valley sisters who find themselves completely alone after the arrival of Halley's Comet reduces their affluent community--and most of Los Angeles--to dust. Their subsequent nonstop shopping spree is soon interrupted by predatory zombies, as well as a sinister scientific cabal (led by cult favorites Mary Woronov and Geoffrey Lewis) with designs on the girls. Stewart and Maroney are terrifically game as the heroines (especially Maroney, whose flair for bubbly comedy was never given another chance on screen), and Robert (\", 'Star Trek: Voyager', \") Beltran is also on hand as a fellow survivor and romantic lead. Fun for '80s enthusiasts and sci-fi fiends who don't mind a little fizz in their end-of-the-world scenarios.\", '-- Paul Gaita']\n{'Genre': 'Comedy', 'Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Contributor': 'Peter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon EricsonPeter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon Ericson   See more', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.55 inches; 2.4 Ounces', 'Director': 'Thom Eberhardt', 'Media Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'March 6, 2007', 'Actors': 'Catherine Mary Stewart, Kelli Maroney, Robert Beltran, Sharon Farrell, Mary Woronov', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Thom Eberhardt', 'Number of discs': '1'}\nIt's Hokey & Badly Acted for the most part but it screams Bad Old Science Fiction Horror from the 50's and anyone that's seen those films, knows what I mean.<br />I really Enjoyed it.\nYou Gotta Luv It",
  "profile": "**User Summary:**\n\nThis user has a keen affinity for British comedy, particularly within the spy-parody genre, valuing clever humor and engaging storytelling. Their positive reviews reveal a strong preference for well-developed characters and intricate narratives. Recently, they expanded their collection by purchasing a title that combines action, adventure, and humor involving a covert operative facing challenges, showcasing their taste for clever plots and character dynamics enriched with humor and drama.\n\nIn addition to their established tastes, the user's latest purchase of a science fiction-comedy film, noted for its nostalgic charm and low-budget appeal, indicates a broader appreciation for '80s cinematic experiences that blend humor with fantastical elements. Their enjoyment of quirky and campy storytelling is evident in their enthusiastic review, highlighting a taste for \"bad old science fiction horror.\"\n\nThe user's consistent engagement with lighthearted content that features character-driven plots and comedic elements reveals their pursuit of witty escapism. Their inclination for physical media suggests a nostalgic sentiment towards tangible collections and a discerning eye for quality entertainment. Overall, the user enjoys exploring series and films that offer a mix of comedy and adventure, often with strong character relationships and clever, entertaining storytelling that provokes thought while providing enjoyment.",
  "metrics": {
    "rouge1_f": 0.129366106080207,
    "rouge2_f": 0.023316062176165803,
    "rougeL_f": 0.06985769728331176,
    "meteor": 0.040716430584511645,
    "bleu1": 0.0003651753778801384,
    "bleu2": 0.0001597247265571008,
    "bleu3": 6.451526095194018e-05,
    "bleu4": 1.7539073640799153e-05,
    "bertscore_precision": 0.3386960029602051,
    "bertscore_recall": 0.4874783456325531,
    "bertscore_f1": 0.3996903598308563
  }
}