{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Richard Pryor Here and Now / Richard Pryor Live on the Sunset Strip - Set\nReview Date: 2011/01/29\nStore: Richard Pryor  (Actor, Director, Writer),     Gene Cross  (Actor),     Joe Layton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Double Feature - 2 Discs.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Gene Cross, Jesse Jackson, Paul Mooney, Richard Pryor, Julie Hampton, Joe Layton', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2226995', 'Director': 'Joe Layton, Richard Pryor', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Richard Pryor, Gene Cross, Julie Hampton, Jesse Jackson, Paul Mooney', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Paul Mooney, Richard Pryor', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: This was a wonder DVD, to have two shows in one is just wonderful.  My family really enjoyed him.\nReview Title: Richard Pryor\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Columbo - The Complete Fifth Season\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"Peter Falk dons his famous trenchcoat again as he returns in his 4-time Emmy award-winning role as everyone's favorite Police Lieutenant in Columbo: The Complete Fifth Season! Join Columbo in this three-disc set as he asks all the right questions in some of the most deceptive and deadly cases. The Fascinating Fifth season also features such brilliant guest stars as Janet Leigh, Sal Mineo, Robert Vaughn, Ricardo Montalban, Hector Elizondo, Robert Loggia, Patrick McGoohan, and more. The landmark crime series returns, and no murderer can hide for long with Columbo on the beat!\", 'Bonus Content:', 'Disc 1:', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', ']]>', 'Amazon.com', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show\\x92s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn\\x92s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set\\x92s sole extra.', '--Paul Gaita', 'Review', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set s sole extra.', '--Paul Gaita', '--Amazon.com', 'See more']\n{'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Peter Falk', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.28 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '8 hours and 49 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Peter Falk', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nThis package of Columbo is as good as the previously released version.  This is wonderful to enjoy Columbo at any time and a choice of shows.  I cannot wait until the other shows are released.  I am a Columbo fan, and this package and the others I have purchased have been GREAT!\nGood Collection\nThe Rockford Files - Season Two\nJames Garner  (Actor),     Noah Beery, Jr.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', \"Jim Rockford is back and better than ever in all 22 Season Two episodes of the celebrated detective hit The Rockford Files. Join James Garner in his breakout Emmy-winning role as the cool, calm and collected ex-con-turned-detective who loves to mouth off but avoids using his fists at all costs. He takes his time, but always solves the crime - whether it be blackmail, theft, scams or murder! Along for the ride on this five-time Emmy-winning series are such stellar guest stars as Rob Reiner, Louis Gossett Jr., Linda Evans, Isaac Hayes and Dick Butkus. Also included for the first time on DVD is the original series pilot. With his no-nonsense approach and wisecracking wit, it's no mystery that Rockford always gets his man.Bonus Content:\", 'Disc 6:', 'Stephen J. Cannell On-Camera Interview', 'Stephen J. Cannell On-Camera Interview', 'Bonus Episode: The Rockford Files Series Pilot', 'Bonus Episode: The Rockford Files Series Pilot', 'Amazon.com', '\"The best detective series ever,\" according to', 'TV Guide', ', the second', 'Rockford Files', 'set begins at the beginning. That\\'s because the double-length pilot (\"Backlash of the Hunter\") appears as an extra. In this episode, Jim Rockford (James Garner) explains to guest star Lindsay Wagner, \"I only handle criminal cases that are closed.\" The first Rockford file also introduces his errant father, Rocky (Robert Donley, who\\'ll soon be replaced by Noah Beery Jr.), detective buddy Dennis (Joe Santos,', 'The Sopranos', '), and squirrelly pal Angel (Emmy winner Stuart Margolin) with whom he did time at San Quentin (before being granted a full pardon). Season two highlights include the two-part \"Gearjammers,\" in which Rockford discovers his dad\\'s secret life, \"Chicken Little Is a Little Chicken,\" in which Rockford helps Angel fake his death, and \"The Hammer of C Block,\" with Isaac \"Shaft\" Hayes as a former cellmate who just can\\'t get his name straight\\x97he thinks it\\'s \"Rockfish.\" (The Oscar-winning Hayes also contributes an original number called \"Gandy\\'s Theme.\") Even when the episodes are less memorable, Garner\\'s easygoing Oklahoma charm and potent chemistry with his co-stars, including lawyer/ex-girlfriend girlfriend Beth (Gretchen Corbett), makes each one worth watching. Like most Stephen J. Cannell programs (', 'Baretta', ',', '21 Jump Street', ', etc.),', 'The Rockford Files', 'never had any difficulty attracting famous (and soon-to-be-famous) guests. The second year claims such notables as Linda Evans (\"The Farnsworth Stratagem\"), Stefanie Powers (\"The Real Easy Red Dog\"), Blair Brown (\"The Girl in the Bay City Boys Club\"), Rob Reiner (\"The No-Cut Contract\"), and Louis Gossett Jr. (\"Foul on the First Play\\'). The only other bonus feature is a short, if informative interview with Cannell, who reveals that the character of Joseph \"Rocky\" Rockford was modeled after his own father.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'James Garner, Joe Santos, Noah Beery, Jr., Stuart Margolin', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '18 hours and 29 minutes', 'Release date': 'June 13, 2006', 'Actors': 'James Garner, Noah Beery, Jr., Joe Santos, Stuart Margolin', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '6'}\nI have truly enjoyed watching the Rockford Files. This was one of my favorites shows on television and to have this collection is great.  It is Rockford at his best.  I am waiting for the release of the next season.\nRockford Files are the Best\nAdventures of Superman: The Complete Third & Fourth Seasons\nGeorge Reeves  (Actor),     Phyllis Coates  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Adventures of Superman, The Complete 3rd & 4th Seasons (DVD) (Multi-Title)', \"George Reeves returns as Superman (aka Clark Kent) in 26 episodes comprising Season 3 and Season 4 of the program that ran six seasons total. This time his exploits take him to stuffy European monarchy, a remote desert isle and even a cave in the year 50,000 BC. And now for the first time the Man of Steel's exciting flights, fights, and super heroics are presented in color!\", ']]>']\n{'Genre': 'Television, Action & Adventure', 'Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Contributor': 'Noel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert MaxwellNoel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert Maxwell  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 1 inches; 8.8 Ounces', 'Item model number': '2210928', 'Media Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Run time': '11 hours and 46 minutes', 'Release date': 'June 20, 2006', 'Actors': 'George Reeves, Phyllis Coates, Noel Neill, Jack Larson, John Hamilton', 'Subtitles': 'Spanish, French', 'Producers': 'Whitney Ellsworth, Bernard Luber, Robert Maxwell', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nI remember seeing these shows on TV as a child.  It is such a releef to see these shows again.  They are so relaxing and comforting knowing how the world is these days.  A Super hero for the imigination as a series is wonderful.  I am happy to be able to see these shows again and remember when.  They may not have the action and effects as current day superman movies, but these are great to have in any film library.\nTV's Superman\nLackawanna Blues\nS. Epatha Merkerson  (Actor),     Marcus Carl Franklin  (Actor),     George C. Wolfe  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'Based on the award winning play by Ruben Santiago-Hudson, this poignant and colorful drama tells the inspirational story of a courageous woman, Nanny, whose spirit and strength served as the foundation for a struggling community trying to survive during the segregation era. Starring an exceptional ensemble cast led by Jimmy Smits, Rosie Perez, and Macy Gray, this inspiring drama from HBO Films is a celebration of the good things in life, no matter how tough times may be.', 'DVD Features:', 'Audio Commentary:', 'Audio Commentary with director George C. Wolfe and writer Ruben Santiago-Hudson', 'Deleted Scenes', 'Featurette', 'Amazon.com', 'Cool music, a wonderful atmospheric feel, and first-rate performances by a stellar cast distinguish', 'Lackawanna Blues', \", a 2005, 90-minute film originally broadcast by HBO. Director George C. Wolfe's theater background (as a writer and/or director he's been responsible for\", 'The Colored Museum', ',', \"Jelly's Last Jam\", ', and', 'Bring in Da Noise, Bring in Da Funk', ') is apparent; adapted by scriptwriter Ruben Santiago-Hudson from his own autobiographical play,', 'Lackawanna Blues', 'is less a story than a reminiscence, told by a young man (an affecting performance by Marcus Carl Franklin) raised by the indefatigable Rachel \"Nanny\" Crosby (an equally fine turn by S. Epatha Merkerson, known to many from her role in TV\\'s', 'Law & Order', \") in that upstate New York town. The focus is on Nanny's rooming house, which is populated by all manner of colorful characters (played by the likes of Macy Gray, Jeffrey Wright, and many others, with Jimmy Smits and Carmen Ejogo as the boy's wayward parents). The roomers include drunks, hustlers, ex-cons, and other shady types, but while plenty of bad stuff goes on, it's all coated with a certain patina of sentiment that tends to minimize the hard realities of life for African Americans in the early 1960s. That's fine; Wolfe, with the help of some superb editing by Brian Kates, gives the film such a delightful period vibe that it's easy to overlook its few shortcomings. The music (available on a\", 'soundtrack CD', '), ranging from downhome country blues to uptown swing, jump blues, and more, also makes a major contribution to the delightful diversion that is', 'Lackawanna Blues', '.', '--Sam Graham']\n{'Genre': 'DRAMA', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Delroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Louis Gossett Jr., Rosie PerezDelroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Loui…   See more', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': '92749', 'Director': 'George C. Wolfe', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'August 23, 2005', 'Actors': 'S. Epatha Merkerson, Marcus Carl Franklin, Yasiin Bey, Carmen Ejogo, Bill Simms Jr.', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Halle Berry, Nellie Nugiel, Ruben Santiago-Hudson, Shelby Stone, Vincent Cirrincione', 'Studio': 'HBO Studios', 'Writers': 'Ruben Santiago-Hudson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was a very heart warming movie.  Very good acting.  I truly enjoyed it.\nVery Good\nRichard Pryor Here and Now / Richard Pryor Live on the Sunset Strip - Set\nRichard Pryor  (Actor, Director, Writer),     Gene Cross  (Actor),     Joe Layton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Double Feature - 2 Discs.']\n{'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Gene Cross, Jesse Jackson, Paul Mooney, Richard Pryor, Julie Hampton, Joe Layton', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2226995', 'Director': 'Joe Layton, Richard Pryor', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Richard Pryor, Gene Cross, Julie Hampton, Jesse Jackson, Paul Mooney', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Paul Mooney, Richard Pryor', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis was a wonder DVD, to have two shows in one is just wonderful.  My family really enjoyed him.\nRichard Pryor",
  "profile": "**User Summary:**\n\n- **Interests**: The user maintains a strong affinity for classic crime dramas and classic superhero series, while also appreciating poignant dramas with deep, character-driven narratives. Their interests have recently expanded to include classic stand-up comedy, specifically showcasing iconic performers.\n- **Favorite Actors**: In addition to Peter Falk, James Garner, and George Reeves, they now admire Richard Pryor, S. Epatha Merkerson, and Jimmy Smits, demonstrating a preference for strong performances across various genres, including comedy.\n- **Content Preference**: They value complete season collections for immersive storytelling experiences, focusing on mystery, suspense, classic action-adventure, heartfelt dramas, and now, classic stand-up comedy.\n- **Engagement with Genre**: The user actively engages with detective series, classic superhero narratives, impactful dramas, and comedy shows, appreciating clever resolutions and complex relationships, along with humor that resonates with family.\n- **Collection Enthusiast**: Continues to seek out series and film collections that evoke nostalgia and cater to more emotional narratives, including cherished comedy performances.\n- **Positive Feedback**: Frequently rates items highly, reflecting a positive outlook toward quality content that resonates emotionally and nostalgically.\n- **Future Interests**: Eagerly anticipates new releases in crime dramas, classic superhero shows, heartfelt films, and notable comedy performances, indicating a commitment to expanding their collection with diverse, related content.\n\nOverall, this user is a dedicated fan who values intricate storytelling and notable performances across a broader range of genres, now embracing the comedic aspect as well.",
  "metrics": {
    "rouge1_f": 0.08677542519958348,
    "rouge2_f": 0.009030913511635985,
    "rougeL_f": 0.040958000694203404,
    "meteor": 0.02722749485220989,
    "bleu1": 7.664395852231617e-06,
    "bleu2": 3.1784591390244664e-06,
    "bleu3": 1.4947748053734446e-06,
    "bleu4": 7.795174243421664e-07,
    "bertscore_precision": 0.3774319887161255,
    "bertscore_recall": 0.5100136995315552,
    "bertscore_f1": 0.4338191747665405
  }
}