{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Winter Kill (1974 Tvm)\nReview Date: 2013/11/11\nStore: Andy Griffith  (Actor),     John Larch  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: [\"Six years after he completed his long run as Sheriff Andy Taylor on The Andy Griffith Show, the beloved TV star returned as a small-town lawman in Winter Kill. Griffith brought the same common sense and friendly, laconic style to his new role, but Police Chief Sam McNeill has something more challenging than Mayberry's town drunk to deal with: life-and-death mystery. The ski resort Sam protects is the target of a serial killer who leaves no clues except taunting messages spray-painted next to the bodies of his -- or her -- victims. Among the supporting cast, look for a fresh-faced Nick Nolte as a womanizing ski instructor.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': \"Tim O'Connor, Lawrence Pressman, Eugene Roche, Andy Griffith, John Larch, Jud Taylor\", 'Language': 'Unqualified', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 34 minutes', 'Release date': 'February 24, 2010', 'Actors': \"Andy Griffith, John Larch, Tim O'Connor, Lawrence Pressman, Eugene Roche\", 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have always enjoyed Andy Griffith, and this movie is one of a series of three that I remember, and it is a good movie.  I truly enjoyed this movie and waiting for the other one called \"The empty grave\"  .\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Columbo - The Complete Fifth Season\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"Peter Falk dons his famous trenchcoat again as he returns in his 4-time Emmy award-winning role as everyone's favorite Police Lieutenant in Columbo: The Complete Fifth Season! Join Columbo in this three-disc set as he asks all the right questions in some of the most deceptive and deadly cases. The Fascinating Fifth season also features such brilliant guest stars as Janet Leigh, Sal Mineo, Robert Vaughn, Ricardo Montalban, Hector Elizondo, Robert Loggia, Patrick McGoohan, and more. The landmark crime series returns, and no murderer can hide for long with Columbo on the beat!\", 'Bonus Content:', 'Disc 1:', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', ']]>', 'Amazon.com', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show\\x92s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn\\x92s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set\\x92s sole extra.', '--Paul Gaita', 'Review', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set s sole extra.', '--Paul Gaita', '--Amazon.com', 'See more']\n{'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Peter Falk', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.28 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '8 hours and 49 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Peter Falk', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nThis package of Columbo is as good as the previously released version.  This is wonderful to enjoy Columbo at any time and a choice of shows.  I cannot wait until the other shows are released.  I am a Columbo fan, and this package and the others I have purchased have been GREAT!\nGood Collection\nThe Rockford Files - Season Two\nJames Garner  (Actor),     Noah Beery, Jr.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', \"Jim Rockford is back and better than ever in all 22 Season Two episodes of the celebrated detective hit The Rockford Files. Join James Garner in his breakout Emmy-winning role as the cool, calm and collected ex-con-turned-detective who loves to mouth off but avoids using his fists at all costs. He takes his time, but always solves the crime - whether it be blackmail, theft, scams or murder! Along for the ride on this five-time Emmy-winning series are such stellar guest stars as Rob Reiner, Louis Gossett Jr., Linda Evans, Isaac Hayes and Dick Butkus. Also included for the first time on DVD is the original series pilot. With his no-nonsense approach and wisecracking wit, it's no mystery that Rockford always gets his man.Bonus Content:\", 'Disc 6:', 'Stephen J. Cannell On-Camera Interview', 'Stephen J. Cannell On-Camera Interview', 'Bonus Episode: The Rockford Files Series Pilot', 'Bonus Episode: The Rockford Files Series Pilot', 'Amazon.com', '\"The best detective series ever,\" according to', 'TV Guide', ', the second', 'Rockford Files', 'set begins at the beginning. That\\'s because the double-length pilot (\"Backlash of the Hunter\") appears as an extra. In this episode, Jim Rockford (James Garner) explains to guest star Lindsay Wagner, \"I only handle criminal cases that are closed.\" The first Rockford file also introduces his errant father, Rocky (Robert Donley, who\\'ll soon be replaced by Noah Beery Jr.), detective buddy Dennis (Joe Santos,', 'The Sopranos', '), and squirrelly pal Angel (Emmy winner Stuart Margolin) with whom he did time at San Quentin (before being granted a full pardon). Season two highlights include the two-part \"Gearjammers,\" in which Rockford discovers his dad\\'s secret life, \"Chicken Little Is a Little Chicken,\" in which Rockford helps Angel fake his death, and \"The Hammer of C Block,\" with Isaac \"Shaft\" Hayes as a former cellmate who just can\\'t get his name straight\\x97he thinks it\\'s \"Rockfish.\" (The Oscar-winning Hayes also contributes an original number called \"Gandy\\'s Theme.\") Even when the episodes are less memorable, Garner\\'s easygoing Oklahoma charm and potent chemistry with his co-stars, including lawyer/ex-girlfriend girlfriend Beth (Gretchen Corbett), makes each one worth watching. Like most Stephen J. Cannell programs (', 'Baretta', ',', '21 Jump Street', ', etc.),', 'The Rockford Files', 'never had any difficulty attracting famous (and soon-to-be-famous) guests. The second year claims such notables as Linda Evans (\"The Farnsworth Stratagem\"), Stefanie Powers (\"The Real Easy Red Dog\"), Blair Brown (\"The Girl in the Bay City Boys Club\"), Rob Reiner (\"The No-Cut Contract\"), and Louis Gossett Jr. (\"Foul on the First Play\\'). The only other bonus feature is a short, if informative interview with Cannell, who reveals that the character of Joseph \"Rocky\" Rockford was modeled after his own father.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'James Garner, Joe Santos, Noah Beery, Jr., Stuart Margolin', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '18 hours and 29 minutes', 'Release date': 'June 13, 2006', 'Actors': 'James Garner, Noah Beery, Jr., Joe Santos, Stuart Margolin', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '6'}\nI have truly enjoyed watching the Rockford Files. This was one of my favorites shows on television and to have this collection is great.  It is Rockford at his best.  I am waiting for the release of the next season.\nRockford Files are the Best\nAdventures of Superman: The Complete Third & Fourth Seasons\nGeorge Reeves  (Actor),     Phyllis Coates  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Adventures of Superman, The Complete 3rd & 4th Seasons (DVD) (Multi-Title)', \"George Reeves returns as Superman (aka Clark Kent) in 26 episodes comprising Season 3 and Season 4 of the program that ran six seasons total. This time his exploits take him to stuffy European monarchy, a remote desert isle and even a cave in the year 50,000 BC. And now for the first time the Man of Steel's exciting flights, fights, and super heroics are presented in color!\", ']]>']\n{'Genre': 'Television, Action & Adventure', 'Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Contributor': 'Noel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert MaxwellNoel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert Maxwell  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 1 inches; 8.8 Ounces', 'Item model number': '2210928', 'Media Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Run time': '11 hours and 46 minutes', 'Release date': 'June 20, 2006', 'Actors': 'George Reeves, Phyllis Coates, Noel Neill, Jack Larson, John Hamilton', 'Subtitles': 'Spanish, French', 'Producers': 'Whitney Ellsworth, Bernard Luber, Robert Maxwell', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nI remember seeing these shows on TV as a child.  It is such a releef to see these shows again.  They are so relaxing and comforting knowing how the world is these days.  A Super hero for the imigination as a series is wonderful.  I am happy to be able to see these shows again and remember when.  They may not have the action and effects as current day superman movies, but these are great to have in any film library.\nTV's Superman\nLackawanna Blues\nS. Epatha Merkerson  (Actor),     Marcus Carl Franklin  (Actor),     George C. Wolfe  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'Based on the award winning play by Ruben Santiago-Hudson, this poignant and colorful drama tells the inspirational story of a courageous woman, Nanny, whose spirit and strength served as the foundation for a struggling community trying to survive during the segregation era. Starring an exceptional ensemble cast led by Jimmy Smits, Rosie Perez, and Macy Gray, this inspiring drama from HBO Films is a celebration of the good things in life, no matter how tough times may be.', 'DVD Features:', 'Audio Commentary:', 'Audio Commentary with director George C. Wolfe and writer Ruben Santiago-Hudson', 'Deleted Scenes', 'Featurette', 'Amazon.com', 'Cool music, a wonderful atmospheric feel, and first-rate performances by a stellar cast distinguish', 'Lackawanna Blues', \", a 2005, 90-minute film originally broadcast by HBO. Director George C. Wolfe's theater background (as a writer and/or director he's been responsible for\", 'The Colored Museum', ',', \"Jelly's Last Jam\", ', and', 'Bring in Da Noise, Bring in Da Funk', ') is apparent; adapted by scriptwriter Ruben Santiago-Hudson from his own autobiographical play,', 'Lackawanna Blues', 'is less a story than a reminiscence, told by a young man (an affecting performance by Marcus Carl Franklin) raised by the indefatigable Rachel \"Nanny\" Crosby (an equally fine turn by S. Epatha Merkerson, known to many from her role in TV\\'s', 'Law & Order', \") in that upstate New York town. The focus is on Nanny's rooming house, which is populated by all manner of colorful characters (played by the likes of Macy Gray, Jeffrey Wright, and many others, with Jimmy Smits and Carmen Ejogo as the boy's wayward parents). The roomers include drunks, hustlers, ex-cons, and other shady types, but while plenty of bad stuff goes on, it's all coated with a certain patina of sentiment that tends to minimize the hard realities of life for African Americans in the early 1960s. That's fine; Wolfe, with the help of some superb editing by Brian Kates, gives the film such a delightful period vibe that it's easy to overlook its few shortcomings. The music (available on a\", 'soundtrack CD', '), ranging from downhome country blues to uptown swing, jump blues, and more, also makes a major contribution to the delightful diversion that is', 'Lackawanna Blues', '.', '--Sam Graham']\n{'Genre': 'DRAMA', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Delroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Louis Gossett Jr., Rosie PerezDelroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Loui…   See more', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': '92749', 'Director': 'George C. Wolfe', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'August 23, 2005', 'Actors': 'S. Epatha Merkerson, Marcus Carl Franklin, Yasiin Bey, Carmen Ejogo, Bill Simms Jr.', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Halle Berry, Nellie Nugiel, Ruben Santiago-Hudson, Shelby Stone, Vincent Cirrincione', 'Studio': 'HBO Studios', 'Writers': 'Ruben Santiago-Hudson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was a very heart warming movie.  Very good acting.  I truly enjoyed it.\nVery Good\nRichard Pryor Here and Now / Richard Pryor Live on the Sunset Strip - Set\nRichard Pryor  (Actor, Director, Writer),     Gene Cross  (Actor),     Joe Layton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Double Feature - 2 Discs.']\n{'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Gene Cross, Jesse Jackson, Paul Mooney, Richard Pryor, Julie Hampton, Joe Layton', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2226995', 'Director': 'Joe Layton, Richard Pryor', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Richard Pryor, Gene Cross, Julie Hampton, Jesse Jackson, Paul Mooney', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Paul Mooney, Richard Pryor', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis was a wonder DVD, to have two shows in one is just wonderful.  My family really enjoyed him.\nRichard Pryor\nPerry Mason: Season 5, Vol. 2\nRaymond Burr  (Actor),     William Hopper  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'William Talman, William Hopper, Raymond Burr, Barbara Hale, Ray Collins', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.57 x 5.4 x 7.49 inches; 5.15 Ounces', 'Item model number': '540985592', 'Media Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Run time': '12 hours and 53 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, William Hopper, William Talman, Ray Collins', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nI have the complete set of all TV shows of Perry Mason, and cannot get enough of watching them. Just a Perry Mason FAN for a very long time.  I JUST LOVE THEM...\nPerry Mason\nNick Carter Mysteries Triple Feature\nWalter Pidgeon  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Private eye Nick Carter\\'s detective adventures encompassed over 1000 stories, a 1943-1955 radio series and, among his screen heroics, these three MGM \"Bs\" starring Walter Pidgeon (soon to be Greer Garson\\'s costar in nine films, including Mrs. Miniver). In Nick Carter, Master Detective, someone is sabotaging the creation of an innovative high-speed aircraft at Radex Corporation. Can Carter, posing as an executive at Radex, unmask the culprits and save the project? Phantom Raiders has Carter taking on a deadly case involving the mysterious sinking of cargo ships leaving Colon, Panama. In Sky Murder, our hero exposes an anti-U.S. spy operation while protecting a woman marked for death. Sharing the adventures and adding to the frequently comic tone of the storylines is beekeeper and Carter\\'s assistant \"Beeswax\" (Donald Meek), who sometimes sends a fistful of bees into action to help him escape a dire situation.']\n{'Genre': 'Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Walter Pidgeon', 'Language': 'English', 'Runtime': '3 hours and 21 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '397720', 'Media Format': 'NTSC', 'Run time': '3 hours and 21 minutes', 'Release date': 'April 23, 2013', 'Actors': 'Walter Pidgeon', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nJust what I expected.  The quality of the DVD is very good.  I have enjoyed these mysteries and to have three on the same DVD is so great.  It had been a long time since I saw any of these movies, but now I can watch as I wish, and as I said the quality if very good.\nGreat\nPerry Mason: Season 8, Vol. 2\nRaymond Burr  (Actor),     Barbara Hale  (Actor),     Arthu Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Renowned defense attorney Perry Mason is back on the front lines of justice in the 15 final episodes of Season Eight. Two-time Emmy® winner Raymond Burr brings his signature brand of clever questioning and deductive reasoning to cap off a killer season, which includes mischievous dolls, deadly debts and murderous mermaids. Always by his side are Detective Paul Drake (William Hopper), loyal secretary Della Street (Barbara Hale), and homicide officer Andy Anderson (Wesley Lau). In this four-disc, digitally remastered collection, courtroom fireworks are on full display, and one of television’s most iconic legal thrillers is at its peak.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.96 Ounces', 'Item model number': '35048550908', 'Director': 'Arthu Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Full Screen, Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 52 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nI thought I had all of the Perry Mason series, from Columbia House back in the day, but I find out from this one I do not.  I now have to get vol 1.  I have always enjoyed Perry Mason, and this DVD just adds to the enjoyment.\nGREAT\nPerry Mason: Season 8, Vol. 1\nRaymond Burr  (Actor),     Barbara Hale  (Actor),     Arthur Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Contributor': 'Jerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray CollinsJerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray Collins   See more', 'Language': 'English', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 3.21 Ounces', 'Item model number': '2409811098', 'Director': 'Arthur Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Run time': '12 hours and 54 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Subtitles': 'English', 'Studio': 'Paramount', 'Country of Origin': 'USA', 'Number of discs': '4'}\nI love me some Perry Mason, and years ago I thought I had all episodes but this set I did not have.  The quality was great and it was a great addition to my collection.\nwonderful\nThe Winter Kill (1974 Tvm)\nAndy Griffith  (Actor),     John Larch  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"Six years after he completed his long run as Sheriff Andy Taylor on The Andy Griffith Show, the beloved TV star returned as a small-town lawman in Winter Kill. Griffith brought the same common sense and friendly, laconic style to his new role, but Police Chief Sam McNeill has something more challenging than Mayberry's town drunk to deal with: life-and-death mystery. The ski resort Sam protects is the target of a serial killer who leaves no clues except taunting messages spray-painted next to the bodies of his -- or her -- victims. Among the supporting cast, look for a fresh-faced Nick Nolte as a womanizing ski instructor.\"]\n{'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': \"Tim O'Connor, Lawrence Pressman, Eugene Roche, Andy Griffith, John Larch, Jud Taylor\", 'Language': 'Unqualified', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 34 minutes', 'Release date': 'February 24, 2010', 'Actors': \"Andy Griffith, John Larch, Tim O'Connor, Lawrence Pressman, Eugene Roche\", 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have always enjoyed Andy Griffith, and this movie is one of a series of three that I remember, and it is a good movie.  I truly enjoyed this movie and waiting for the other one called \"The empty grave\"  .\nGreat Movie",
  "profile": "**User Summary:**\n\nThe user remains passionate about classic crime dramas and superhero series, now further committing to completing their collection of classic detective narratives. Their recent engagement highlights a fondness for nostalgic storytelling, particularly involving iconic figures like Andy Griffith, showcasing a strong interest in vintage mystery films and heartfelt dramas. \n\nIn addition to their admiration for classic performers such as Raymond Burr, Barbara Hale, Peter Falk, and James Garner, the user has now expressed an appreciation for Griffith’s work as a lawman in suspenseful settings, indicating a preference for layered narratives with emotional depth. Their high rating for a recent purchase reflects their ongoing enthusiasm for quality offerings within the mystery and suspense genres.\n\nThe user continues to prioritize complete collections while cherishing poignant dramas and classic stand-up comedy, highlighting a desire for rich narratives and notable performances. Looking ahead, they are eager for new releases that reflect both their dedication to classic genres and their quest to broaden their collection, especially within crime dramas and intricate suspense stories. Their consistent positive engagement demonstrates an appreciation for well-crafted storytelling that resonates emotionally.",
  "metrics": {
    "rouge1_f": 0.05295801526717557,
    "rouge2_f": 0.007159904534606206,
    "rougeL_f": 0.027671755725190837,
    "meteor": 0.014407599430169908,
    "bleu1": 1.7139309615652581e-12,
    "bleu2": 7.683424300322875e-13,
    "bleu3": 3.650563657150235e-13,
    "bleu4": 2.2173213201383508e-13,
    "bertscore_precision": 0.3294890820980072,
    "bertscore_recall": 0.5092167854309082,
    "bertscore_f1": 0.4000958204269409
  }
}