{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: L'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones\nReview Date: 2023/01/20\nStore: L'ANGE HAIR\nAverage Rating: 4.3\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Item Form': 'Cream', 'Skin Type': 'Dry', 'Product Benefits': 'Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more', 'Material Feature': 'Natural', 'Product Dimensions': '2.9 x 2.9 x 2.5 inches; 6.38 Ounces', 'UPC': '810108190721', 'Manufacturer': \"L'ANGE HAIR\"}\nReview Text: This is a great scalp scrub. It really leaves my scalp feeling refreshed and leaves my hair feeling bouncy and clarified. I take the time to really massage it in for at least one minute. It gets rid of all the buildup and my hair feels super soft and clean the next day. I follow this with my usual shampoo and conditioner. I've tried other scalp scrubs but this is one of the better ones. Others have left my hair so dry and tangled. This one is perfect. I use it once a week or so to really get that deep clean.\nReview Title: Refreshing!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "C.O. Bigelow No. 007 Dr Hiosous Quince Hand Lotion, 4 Ounces\nC. O. Bigelow\n{'Brand': 'C. O. Bigelow', 'Item Form': 'Lotion', 'Unit Count': '4 Ounce', 'Number of Items': '1', 'Use for': 'Hands', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 2 x 0.7 inches; 5.61 Ounces', 'Item model number': '20002240'}\nThis is a nice hand cream. The tube is a generous size. I've used C.O. Bigelow products in the past and have always enjoyed them so I was interested in trying this hand cream. It's very moisturizing! I usually use it after washing my hands or if I wake up in the night with dry hands from air conditioning. It's not so thick that it's hard to get out of the tube, and it's not very greasy, but still feels really good and moisturizing, taking a minute to really absorb. The smell is great! I wasn't really familiar with the scent of quince before. All I knew about it was that it was a fruit. The smell is really nice, I don't even know how to describe it! Subtly fruity, maybe a little spicy too, definitely enjoyable! This is a great product and will last a long time.\nLovely!\nEltaMD Skin Recovery Essence Hydrating Toner for Face, Face Toner for Oily Skin and Sensitive Skin, Alcohol Free Formula, Helps Detoxify and Hydrate Skin, pH Balanced, Oil Free, 7.3 oz Bottle\n{'Brand': 'EltaMD', 'Item Form': 'Lotion', 'Skin Type': 'Sensitive', 'Product Benefits': 'EltaMD Skin Recovery Toner helps to repair damaged skin, calms skin and helps to minimize the risk of irritation.EltaMD Skin Recovery Toner helps to repair damaged skin, calms skin and helps to minimize the risk of irritation.  See more', 'Recommended Uses For Product': 'Professional Skin Care', 'Product Dimensions': '1.19 x 1.19 x 6.31 inches; 7.3 Ounces', 'Item model number': '090205077518', 'UPC': '090205077518', 'Manufacturer': 'EltaMD', 'Country of Origin': 'USA'}\nThis is a nice toner. It gently tones the skin after cleansing. It leaves my skin feeling soft and moisturized, not tight or dry. I'm looking forward to using it more along with other products from Elta MD. It feels gentle on my skin, which is especially nice as it gets drier during the winter months. The bottle is a nice large size as well, so it is a good value.\nSoothes my skin\nSand & Sky Face Roller & Massager Tool. Aussie Skincare Essentials Firming Face Roller, Sculpt, Sooth & Contour to Banish Puffiness and Boost Serum Absorption.\nSand & Sky\n{'Package Dimensions': '8.19 x 6.46 x 2.95 inches; 9.35 Ounces', 'Manufacturer': 'Sand & Sky'}\nThis is a fun tool! I already use jade rollers and gua sha and all that good stuff so I was excited to try this facial roller. I use it after applying serum to really help it absorb. It feels amazing! The metal feels cold on my face and it's just fun to use. It helps wake me up in the morning and feels great, like I'm doing something luxurious. It's easy to glide across the face and you can just rinse it off when you are done. A nice tool and I enjoy using it.\nSoothing\n100% PURE Cocoa Coffee Body Scrub Exfoliating Deep Cleanse with Sea Salts & Nourishing Oils Natural Moisturizing Skincare Radiant Skin Restore & Pore Cleanser for Women & Men Vegan - 10oz\n100% PURE\n['Our invigorating cacao and coffee body scrub buffs away bumps and flakes for radiant, deeply nourished skin. We source the highest quality organic and fair trade Ecuadorian cacao, which contains beneficial tannins, flavonoids, and antioxidants. Natural caffeine from coffee and cacao offers calming benefits to reduce redness, combat the effects of UV damage in skin, and promote a glowing complexion.']\n{'Brand': '100% PURE', 'Skin Type': 'Dry', 'Product Benefits': 'Nourished', 'Material Feature': 'Certified Organic, Gluten Free, Cruelty Free, Vegan', 'Number of Items': '1', 'Package Dimensions': '3.74 x 3.58 x 1.93 inches; 11.99 Ounces', 'Item model number': '1BCCBS', 'Department': 'mens', 'UPC': '843585108033', 'Manufacturer': '100% PURE'}\nThis is a good scrub. It smells amazing and very chocolate-y! The scrub itself is a good texture. I wish it was a tad less runny but it isn't a big deal. The crushed coffee beans and sea salt give good scrub and the glycerin adds moisture. I will say that it does make a big mess. My shower looked so gross afterward. Thankfully I have a detachable shower head so I was able to easily spray around and clean things up because it was all over the place! Oh well. My skin felt soft and smooth and I'm obsessed with the scent so I'll continue to use it.\nSmells delicious!\nKristin Ess The Oversized Satin Scrunchie ? Cheetah\nKristin Ess\n['But make it fashun! This chic satin, oversized scrunchie can be wrapped once or twice depending on the thickness of your hair. Try securing your ponytail with a regular elastic first and then put this over to maximize the look!']\n{'Material': 'Satin', 'Item Form': 'Scrunchie', 'Brand': 'Kristin Ess', 'Hair Type': 'All', 'Number of Pieces': '1', 'Package Dimensions': '10.55 x 6.26 x 1.46 inches; 1.13 Ounces', 'Item model number': '184-KES-0309', 'UPC': '840797141438'}\nThis oversize scrunchie is so cute and fun! The look is super trendy and feminine. It's such an easy way to dress up what would otherwise be a basic bun or ponytail. The rust color is great, especially for Fall and Winter. Overall it feels fun and a little bit fancy.\nSo cute\nL’ANGE HAIR Wide Tooth Comb Tortoiseshell Acetate | Lightweight, Smooth, Compact Design | Easy Glide Wide Tooth Comb\nL'ANGE HAIR\n{'Product Dimensions': '0.25 x 7 x 3.13 inches; 1.76 Ounces', 'Item model number': '2427', 'UPC': '810108190974'}\nThis comb is ok. It is really pretty and I like the leather-style envelope. It makes it nice to pack for traveling. The comb itself feels a little breakable, but we'll see. It is not for intense tangles. I found that it works best for light tangles or just combing out already styled hair. I used my Wet Brush on my wet hair and then smoothed it out further with this comb. It is pretty though and looks luxurious on my bathroom counter.\nWorks ok\nL’ANGE HAIR Pocket Size Comb | Blush Acetate | Compact Design for Travel | Easy Glide Mini Wide Tooth Comb\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Hair Type': 'Wavy, Dry', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Product Dimensions': '5 x 3.63 x 0.25 inches; 1.45 Ounces', 'Item model number': '2438', 'UPC': '810108191001'}\nThis is a cute little comb that is perfect for tucking in your purse. The pretty pink plastic is really fun and the little leatherette case is a nice touch. It will definitely be helpful for keeping the comb safe when you throw it in your bag. The comb itself is pretty good. It works well to gently detangle as long as things aren't too matted. It's a nice size and great for travel.\nCute comb\nFrankies Bikinis Lip Butter Gloss, Sleeping Vegan Lip Mask Overnight, Moisturizing Lip Plumper, Vitamin E Lip Balm Moisturizer, Hydrating Lip Oil with Cocoa Butter, Made in USA, Guava 0.7 Ounces\nFrankies Bikinis\n{'Brand': 'Frankies Bikinis', 'Item Form': 'Balm', 'Finish Type': 'Glossy', 'Skin Type': 'Oily, Combination, Sensitive, Dry, Normal', 'Color': 'Rose Pink', 'Package Dimensions': '4.96 x 0.94 x 0.91 inches; 0.7 Ounces', 'UPC': '840123679413', 'Manufacturer': 'Frankies Bikinis', 'Country of Origin': 'USA'}\nThis is an ok lip balm/gloss. I probably would think of it more as a gloss than a balm or butter. It has a unique flavor and scent, which is different than any others that I own. The formula is not too thick or sticky and is easy to apply. It leaves a nice shine. My lips feel moisturized for a little while, but I don't feel like it has any lasting hydration. I prefer a thicker lip balm if that's what I'm after. I'll use this more for the shine than the moisture.\nIt's fine\nL'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Item Form': 'Cream', 'Skin Type': 'Dry', 'Product Benefits': 'Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more', 'Material Feature': 'Natural', 'Product Dimensions': '2.9 x 2.9 x 2.5 inches; 6.38 Ounces', 'UPC': '810108190721', 'Manufacturer': \"L'ANGE HAIR\"}\nThis is a great scalp scrub. It really leaves my scalp feeling refreshed and leaves my hair feeling bouncy and clarified. I take the time to really massage it in for at least one minute. It gets rid of all the buildup and my hair feels super soft and clean the next day. I follow this with my usual shampoo and conditioner. I've tried other scalp scrubs but this is one of the better ones. Others have left my hair so dry and tangled. This one is perfect. I use it once a week or so to really get that deep clean.\nRefreshing!",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Refreshing!",
    "text": "This is a great scalp scrub. It really leaves my scalp feeling refreshed and leaves my hair feeling bouncy and clarified. I take the time to really massage it in for at least one minute. It gets rid of all the buildup and my hair feels super soft and clean the next day. I follow this with my usual shampoo and conditioner. I've tried other scalp scrubs but this is one of the better ones. Others have left my hair so dry and tangled. This one is perfect. I use it once a week or so to really get that deep clean.",
    "images": [],
    "asin": "B0B3G3DCN6",
    "parent_asin": "B0B3G3DCN6",
    "user_id": "AFA367Z5MOI5XVW7IAQJS7OGXKMA",
    "timestamp": "2023-01-20 12:32:12.423000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "L'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones",
    "average_rating": 4.3,
    "rating_number": 8,
    "features": [
      "GENTLE CLEANSE – Remove buildup and help stimulate hair follicles to promote strong strands with this clarifying scalp scrub. It’s gentle enough that it can be used up to 2x a week!",
      "RESTORE SCALP HEALTH & BALANCE – Natural ingredients like apple cider vinegar & charcoal help detoxify and balance your scalp’s natural pH to eliminate excess buildup.",
      "INGREDIENTS YOU KNOW – Contains ingredients you know and love! Activated charcoal and apple cider vinegar help to detoxify, avocado fruit extract nourishes and soothes scalp & hair, and Himalayan salt helps exfoliate and eliminate buildup.",
      "FORMULATED FOR ALL HAIR TYPES – This scalp scrub is packed with flakey salt, nourishing extracts, and soothing botanicals to give you a refreshed, voluminous look no matter your hair type!",
      "RISK-FREE MONEY-BACK GUARANTEE – Your satisfaction and positive experience is our #1 priority. Contact us for a hassle-free return if you’re not happy with your purchase."
    ],
    "description": [],
    "price": 18.65,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/21kOWazoEGL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/21kOWazoEGL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/41Or0mUzYQL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/418QviiiO6L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/418QviiiO6L.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61l+cLF1GRL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/21AT8uBQIpL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/21AT8uBQIpL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/31HZSzjhvbL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51HlA4SnP7L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51HlA4SnP7L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/7167J8t5BXL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/516YTLWqhVL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/516YTLWqhVL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61GpYySd+yL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51B2xnRUt3L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51B2xnRUt3L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61iGu-ia0cL._SL1001_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Exfolier Purifying Scalp Scrub - Highlights & Features",
        "url": "https://www.amazon.com/vdp/0455884a758c47e09ae263a8f2392306?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "L'ANGE HAIR",
    "categories": [],
    "details": {
      "Brand": "L'ANGE HAIR",
      "Item Form": "Cream",
      "Skin Type": "Dry",
      "Product Benefits": "Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more",
      "Material Feature": "Natural",
      "Product Dimensions": "2.9 x 2.9 x 2.5 inches; 6.38 Ounces",
      "UPC": "810108190721",
      "Manufacturer": "L'ANGE HAIR"
    },
    "bought_together": null
  }
}