{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: QIC 4D Silk Fiber Lash Mascara, Fiber Mascara, Waterproof Mascara, Natural Thick Thickening and Lengthening Mascara Lasting All Day\nReview Date: 2020/02/16\nStore: Joruby\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Joruby', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '5.3 x 0.8 x 0.8 inches; 0.81 Ounces'}\nReview Text: This mascara is interesting. There are two brushes. You start with the smaller one first, which gives you a natural looking dark lash. Then you use the larger brush to give yourself bold, chunky lashes. I prefer the natural look, but the chunky look is good for pictures. The mascara did not clump.\nReview Title: Thick\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Yeshan Rhinestone and Crystal Teeth Comb Plastic Hairband Hair Hoop Headband for Women,Multicolor by Yeshan\nYeshan\n{'Age Range (Description)': 'Adult', 'Material': 'Plastic', 'Fabric Type': 'plastic', 'Number of Items': '1', 'Brand': 'Yeshan', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.51 x 4.72 x 0.79 inches; 0.35 Ounces', 'UPC': '702114359257'}\nThis headband is cute, but it is cheap. The first time I tried it on, some of the bling popped off. It is lightweight, so I don't expect it to last long.<br /><br />It's hard to tell from their pictures how this is designed. The tines are bent forward before bending back. They are also split at the band. The effect is separated hair.\nCute, but cheap\n1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nTemer\n{'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nI have been using this product around my eyes and between my brows for a few days. I haven't noticed any difference yet. It doesn't bother my sensitive skin, so that's one positive. I will finish using this bottle. If I do notice a change after that, I will update my review.\nI don't know\nWomen Facial Razor for Hair Removal - Dermaplaning Tool Peach Fuzz Trimmer Womens Fine Hair Remover Eyebrow Razors and Dermaplane Face Shavers Women's Exfoliating for Sensitive Skin Essential Travel\nMODEMODE\n[\"MODEMODE Women's Facial Razor Home Dermaplaning - Eyebrow Razor For Women Face Peach Fuzz Hair Removal Womens Face Exfoliating At Daily Eyebrow Shaping Tool\"]\n{'Brand': 'MODEMODE', 'Number of Blades': '1', 'Unit Count': '5.0 Count', 'Skin Type': 'Sensitive', 'Number of Items': '1', 'Package Dimensions': '5 x 1.2 x 0.5 inches; 1.59 Ounces', 'Manufacturer': 'MODEMODE'}\nI'v tried several types of products to remove facial hair: coil groomer, tweezers, electric face trimmer, and these. The coil groomer was the most difficult to use. No matter how much I twisted it, I could only get a hair or two after a few tries. Tweezing was faster and more effective. The electric face trimmer was designed for removing all facial hair, including nose and ear hair, so the cutting tip was very small and the cutting mechanism was gentle on delicate skin. It was great at removing the peach fuzz on my cheeks; I just needed to make several swipes to get my whole cheek.<br /><br />These shavers are well made. Unfortunately, the instructions were all written in either Japanese or Chinese. I figured they looked self explanatory, so I didn't look up videos on how to use them. The cutting tip is long, which should make shaving go faster as it can cover a larger area. However, the larger blade also means that it is more difficult to reach certain areas. I have a lot of small moles on my face, so I made sure to be extra careful while using them. Despite this, I managed to nick myself a few times. What's ironic is that the nicks weren't on any moles.<br /><br />I think my skin is just too delicate and uneven to use these shavers.\nNot for me\nJibitee Replacement Brush Heads Compatible with Philips Sonicare E-Series HX7001/22, fit Screw-On Sonicare Electric Toothbrush Handles, 6 Pack\nunp\n{'Brand': 'unp', 'Material': 'Nylon', 'Age Range (Description)': 'Adult', 'Bristle Material': 'Nylon', 'Item Firmness Description': 'Soft', 'Package Dimensions': '7.6 x 4.3 x 1.7 inches; 7.2 Ounces', 'UPC': '740030415442'}\nThese toothbrush replacement heads fit my Sonicare electric toothbrush. The only issue I have is that they seem firmer than the brush heads they are replacing, but not by too much.\nGreat!\nQIC 4D Silk Fiber Lash Mascara, Fiber Mascara, Waterproof Mascara, Natural Thick Thickening and Lengthening Mascara Lasting All Day\nJoruby\n{'Brand': 'Joruby', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '5.3 x 0.8 x 0.8 inches; 0.81 Ounces'}\nThis mascara is interesting. There are two brushes. You start with the smaller one first, which gives you a natural looking dark lash. Then you use the larger brush to give yourself bold, chunky lashes. I prefer the natural look, but the chunky look is good for pictures. The mascara did not clump.\nThick",
  "profile": "**Updated User Summary:**\n\n- **Product Preference:** The user maintains a strong interest in fashion accessories and skincare, with a notable addition of cosmetic products, specifically mascara. Their recent purchase demonstrates an engagement with beauty items designed to enhance appearance while considering varying aesthetics.\n\n- **Quality Awareness:** The user continues to prioritize product quality, reflected in their critical reviews. Their assessment of the mascara indicates an appreciation for effective performance without clumping, showcasing consistency in their focus on durability and functionality in all categories.\n\n- **Value Sensitivity:** The user's need for value for money remains evident, seeking products that balance effective design and satisfactory performance. Their experience with the mascara supports this trend, as they assess its performance and versatility based on natural and bold looks.\n\n- **Aesthetic Appreciation:** The user values visually appealing products and shows flexibility in their aesthetic preferences, highlighting an appreciation for both natural and bold appearances in cosmetics.\n\n- **Practical Use:** Practicality is still crucial in the user's grooming and personal care choices. Their preference for products that offer options—such as mascara with differing brush sizes—shows their desire for versatility in enhancing their beauty routine.\n\nOverall, the user embraces stylish and functional options across a range of categories, maintaining a discerning approach toward quality, performance, and practical application in both beauty and personal care.",
  "metrics": {
    "rouge1_f": 0.1687763713080169,
    "rouge2_f": 0.010570824524312896,
    "rougeL_f": 0.07383966244725738,
    "meteor": 0.072702487788254,
    "bleu1": 0.027007587533495366,
    "bleu2": 0.005736190264107151,
    "bleu3": 0.001001966721690093,
    "bleu4": 0.0004191529661459598,
    "bertscore_precision": 0.36327409744262695,
    "bertscore_recall": 0.4669484794139862,
    "bertscore_f1": 0.4086380898952484
  }
}