{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Elixir Beauty Fascy Salmon Coral The Secret Blusher Korean Beauty Cruelty-Free Powder Blush - Shape, Contour & Hightlight Face, Long Lasting Lightweight Texture Lovely Mood Color Blusher, 5g\nReview Date: 2020/07/11\nStore: The Elixir Beauty\nAverage Rating: 5.0\nProduct Details: {'Item Form': 'Powder', 'Brand': 'The Elixir Beauty', 'Skin Tone': 'All', 'Material Feature': 'Cruelty Free', 'Item Weight': '5 Grams', 'Package Dimensions': '2.52 x 2.44 x 0.71 inches; 0.18 Ounces', 'UPC': '604248060712'}\nReview Text: Such a unique shade of blush. It's a great shade to mix with other colors for blush. Korean makeup is the best!\nReview Title: I love the color of this blush!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Wyuen 12 Sheets Butterfly Women Temporary Tattoo Stickers Animal Tattoos Body Art Waterproof Hand Fake Sticker (W12-03)\nWyuen\n{'Brand': 'Wyuen', 'Size': '3.85x2.36 Inch (Pack of 12)', 'Water Resistance Level': 'Waterproof', 'Pattern': 'Animal', 'Number of Pieces': '12', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 3.94 x 0.39 inches; 0.28 Ounces', 'Item model number': 'FW12-03', 'UPC': '746591612887'}\nAbsolutely beautiful!! I just love them! The colors and designs are so pretty. I can't wait to try them out!!\nVery pretty designs and colors!!\nYallFF gold head chain jewelry for women gypsy bollywood halloween indian headband hair headpiece\nYallFF\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.7 x 3.6 x 0.6 inches; 0.81 Ounces', 'Item model number': 'YF4130054A'}\nBeautiful head pieces. Great for festivals!!\nPretty!! ❣\nAURIC BLENDS Perfume Oil; Sandalwood, 0.33 Ounce\nAuric Blends\n['Auric Blends has been a #1 customer-rated oil-based perfume for nearly 20 years. Our classic line of roll-ons are crafted with a combination of exotic, imported ingredients from around the globe. Each of our hand-blended perfumes is a journey in itself, offering a unique and captivating scent. Our perfumes have been enjoyed by millions of people worldwide and have received regional awards such as \"best love potion\" by New York Press. Our loyal customers and fans adore our oils. With a wide selection of almost 40 fragrances to choose from, including floral, fruit, oriental, and fresh scents, you\\'re sure to find one or more favorites in our collection']\n{'Brand': 'Auric Blends', 'Item Form': 'Oil', 'Item Volume': '0.33 Fluid Ounces', 'Scent': 'Sandalwood', 'Special Feature': 'Travel Size, Lightweight, Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3 x 2 x 1 inches; 1.6 Ounces', 'UPC': '712469001404', 'Manufacturer': 'AURIC BLENDS'}\nI love Auric Blends. I own numerous scents by this line, and I love the smell of sandalwood,  but for some reason I just wasn't feeling it with this one.\nEh..\nAISI BEAUTY Pink Jumbo Braid Crochet Braids Hair Extension Three Tone Ombre Color Rainbow Jumbo Braiding for Twist Braiding,Jumbo Box Braiding Hair 24\",3 Bundles/Lot,Blue-Light purple-Pink\nAISI BEAUTY\n{'Brand': 'AISI BEAUTY', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10 x 8 x 2.5 inches; 11.99 Ounces'}\nI like the color combo. I ordered the light pink, light blue, and lavender combo. Very pretty.  I am going to make dread locks with them. I'm excited!!\nKanekalon extensions are perfect for making dreadlocks!!\nMakeup Revolution I Heart Makeup Highlighter, Mermaids Heart, 10g\nMakeup Revolution\n{'Item Form': 'Powder', 'Brand': 'Makeup Revolution', 'Color': 'Mermaids Heart', 'Skin Tone': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.13 x 6.1 x 1.38 inches; 0.35 Ounces', 'Item model number': '30050'}\nI was really excited to receive this item. The heart box got smashed a little in the corner which irked me. The highlighter is alright. I guess it's just not what I was expecting.\nThe heart shaped box got damaged 😞\nBeauty Creations Baked Pops Highlight Sweet Candy\nBeauty Creations\n{'Finish Type': 'Shimmery', 'Brand': 'Beauty Creations', 'Skin Tone': 'All', 'Unit Count': '1 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.8 x 4 x 0.8 inches; 2.4 Ounces', 'Item model number': 'SG_B074R5ZVKN_US', 'UPC': '603149301795', 'Manufacturer': 'Beauty Creations'}\nI love the packinging.  It's so cute how it looks like a box of candy. I bought it for my grandmother for Christmas. She's been wanting some highlighter. I hope she likes it!\nI love the candy-like packaging. So cute!\nEtude House Any Cushion All Day Perfect SPF50+/PA+++ (#Pure)\nEtude House\n{'Item Form': 'Cream', 'Skin Type': 'All', 'Package Information': 'Tube', 'Brand': 'Etude House', 'Coverage': 'Full', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.29 x 3.15 x 1.02 inches; 2.88 Ounces', 'Item model number': 'SG_B06Y5HG6PR_US'}\nI adore Asian beauty products, particularly Korean and Japanese. I've been working my way around with different cushions seeing what I like. Cushions are nice because they are easy to carry around in a purse due to the compact design. This is a very decent cushion with good coverage. Etude House has never failed me. It also arrived much faster than I thought it would.\nGreat coverage/ beautiful color ❇️\nJeffree Star Blue Blood Palette Powder\nJeffree Star Cosmetics\n['Treat yourself like royalty with this collection of high-pigment blues shades. effree’s sixth eye shadow palette includes 18 pans of pigmented color housed within a jewelry box-inspired case. Featuring rich blues in matte and metallic finishes and complementary shades of peach and pink, this palette is sure to bring out your inner queen. The high-pigment formula melts into skin for easy mixing, matching, and blending Other Details Size: 18 x 1.5 g / 0.05 oz per pan Vegan Cruelty-Free Paraben-Free Gluten-Free']\n{'Color': 'Blue, Ice', 'Brand': 'Jeffree Star Cosmetics', 'Item Form': 'Powder', 'Finish Type': 'Shimmery', 'Special Feature': 'Travel size, Matte', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.5 x 5 x 2 inches; 1.1 Pounds', 'Item model number': 'SG_B07Q5HDJYX_US', 'UPC': '815446025421'}\nOk, I now understand the hype about the JS palettes. I recently started watching his videos and wanted to test out some of his products. These shadows are so pigmented and last all day. I love the shade range. There's a fair amount of product and the packaging is just stunning. It looks like a little jewelry box 💙\nBeautiful palette. Fantastic quality 💙\n[ACONCEPT] Cheek Me 10g (#1 Marry me) - Watercolor Cheek Liquid Blusher, Easy to Blush Makeup, Not Sticky Fresh Oil Base Water Fit Texture, Natural Daily Color\nACONCEPT\n{'Item Form': 'Liquid', 'Coverage': 'Medium', 'Brand': 'ACONCEPT', 'Number of Items': '1', 'Style': 'Compact', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.76 x 1.57 x 1.02 inches; 2.08 Ounces'}\nOh my goodness this is such a cute product!! I love how it looks like a bottle of nail polish. It's such a creative design. It's easy to apply and blend. It looks very pretty on and has a light flowery scent. I just love it. I went ahead and ordered the other 2 shades.\nCute and creative design. Beautiful shade of pink 😍\nSHIONLE - Paparazzi Velvet Tint: Long Lasting Lip Stain with Moisturizing effects | Wrinkle Coverage | Gradation Look | Available in 6 Colors | 01 Rosso | 4.5g\nSHIONLE\n{'Brand': 'SHIONLE', 'Skin Type': 'Dry', 'Item Form': 'Velvet', 'Finish Type': 'Velvet', 'Product Benefits': 'Softening,Long Lasting,Smoothening,Stain,Moisturizing,Makeup', 'Product Dimensions': '3.23 x 0.71 x 0.71 inches; 0.16 Ounces'}\nLovely lip tints. The pigmentation is gorgeous. It's a very flattering color.\nAnother great K. Lip tint!! 💄\nCANMAKE Perfect Stylist Eyes ,21 Strawberry Milk Mocha\nCANMAKE\n{'Brand': 'CANMAKE', 'Item Form': 'Powder', 'Finish Type': 'Shimmery', 'Special Feature': 'Moisturize', 'Product Benefits': 'Moisturizing', 'Product Dimensions': '2.76 x 0.59 x 2.36 inches; 0.04 Ounces'}\nCanmake never fails me. I love the color combo! This is perfect for carrying around in your bag.\nSuper cute shadow quad! I love the jewel topper!\nCANMAKE Silky Smooth Eye Crayon 02 Coral Bouquet\nCANMAKE\n{'Brand': 'CANMAKE', 'Item Form': 'Crayon', 'Finish Type': 'Glossy', 'Special Feature': 'Smooth', 'Unit Count': '1.00 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.35 x 0.55 x 0.55 inches; 0.35 Ounces'}\nI've been wanting to buy some eyeshadow pens to carry in my bag for easy use. This product is perfect for that. I love the peachy color.\nFlattering shade of peach🍑\nCANMAKE Powder Cheeks PW43 Coral Hologram 4g\nCANMAKE\n['Cheeks glimmering with light-polarizing pearl Coral♥ for the ultimate luster! PW43 Coral Hologram Pearl Type Coral with alluring light-polarizing pearl Smooth and moist oil in cheek Oil-In-Base Formula ● Contains fresh moisturize powder, which makes your skin moisturize with smooth and silky texture. Formulation designed to cling to your cheeks!!! ● Contains a long-lasting effect powder you can be sure your cheeks will keep looking soft and cute, absorbing extra sebum. Contains 8 types of beautifying and moisturizing agents ♡ Hyaluronic acid, glycerin, ectoin, squalane, grapeseed oil, honey, royal jelly extract, and apple fruit extract']\n{'Brand': 'CANMAKE', 'Item Form': 'Powder', 'Finish Type': 'Matte', 'Coverage': 'Light', 'Skin Tone': 'All', 'Product Dimensions': '2.01 x 1.97 x 0.43 inches; 0.14 Ounces'}\nI love Canmake!! This is so pretty and can be used for every day makeup. I thought it would be bigger but that's ok.\nGreat blush! Such a flattering color\nThe Elixir Beauty Fascy Salmon Coral The Secret Blusher Korean Beauty Cruelty-Free Powder Blush - Shape, Contour & Hightlight Face, Long Lasting Lightweight Texture Lovely Mood Color Blusher, 5g\nThe Elixir Beauty\n{'Item Form': 'Powder', 'Brand': 'The Elixir Beauty', 'Skin Tone': 'All', 'Material Feature': 'Cruelty Free', 'Item Weight': '5 Grams', 'Package Dimensions': '2.52 x 2.44 x 0.71 inches; 0.18 Ounces', 'UPC': '604248060712'}\nSuch a unique shade of blush. It's a great shade to mix with other colors for blush. Korean makeup is the best!\nI love the color of this blush!!",
  "profile": "**Updated User Profile Summary:**\n\n- **Artistic Appreciation:** The user continues to exhibit a strong affinity for visually striking items, demonstrating their commitment to vibrant artistic expression through recent acquisitions that prioritize colorful designs.\n\n- **Interest in Beauty Products:** Their enthusiasm for beauty items remains robust, particularly for products that blend functionality with artistry, as evidenced by their latest purchase of a uniquely hued blush that complements various makeup looks.\n\n- **Focus on Quality and Effectiveness:** The user prioritizes high-quality beauty products that meet their elevated standards for aesthetics and performance. Their recent engagement with a product known for its flattering shade and effective formulation reflects their desire for items that not only look good but also feel good on the skin.\n\n- **Positive Attitude Yet Selective Ratings:** They maintain a positive outlook while providing thoughtful, critical evaluations, expecting items to align with their aesthetic and functional criteria. Their recent review highlights a deep appreciation for the product's versatility and innovative color.\n\n- **Engagement with Creative Events:** Their ongoing involvement in festival culture continues to enrich their vibrant social lifestyle and evolving standards for creativity and aesthetic quality, influencing their beauty preferences.\n\nOverall, the user exemplifies a dedication to captivating, artistic beauty products that embody creativity, quality, and unique aesthetics, enhancing their journey of self-expression through their beauty regimen.",
  "metrics": {
    "rouge1_f": 0.11243611584327087,
    "rouge2_f": 0.006822057987492894,
    "rougeL_f": 0.05337876206700738,
    "meteor": 0.035264615223865,
    "bleu1": 0.0004014233322755209,
    "bleu2": 9.900848291941051e-05,
    "bleu3": 1.588016932456136e-05,
    "bleu4": 6.365835780686357e-06,
    "bertscore_precision": 0.34532588720321655,
    "bertscore_recall": 0.4698975682258606,
    "bertscore_f1": 0.3980940282344818
  }
}