{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: AISI BEAUTY Pink Jumbo Braid Crochet Braids Hair Extension Three Tone Ombre Color Rainbow Jumbo Braiding for Twist Braiding,Jumbo Box Braiding Hair 24\",3 Bundles/Lot,Blue-Light purple-Pink\nReview Date: 2019/09/14\nStore: AISI BEAUTY\nAverage Rating: 3.9\nProduct Details: {'Brand': 'AISI BEAUTY', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10 x 8 x 2.5 inches; 11.99 Ounces'}\nReview Text: I like the color combo. I ordered the light pink, light blue, and lavender combo. Very pretty.  I am going to make dread locks with them. I'm excited!!\nReview Title: Kanekalon extensions are perfect for making dreadlocks!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Wyuen 12 Sheets Butterfly Women Temporary Tattoo Stickers Animal Tattoos Body Art Waterproof Hand Fake Sticker (W12-03)\nWyuen\n{'Brand': 'Wyuen', 'Size': '3.85x2.36 Inch (Pack of 12)', 'Water Resistance Level': 'Waterproof', 'Pattern': 'Animal', 'Number of Pieces': '12', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 3.94 x 0.39 inches; 0.28 Ounces', 'Item model number': 'FW12-03', 'UPC': '746591612887'}\nAbsolutely beautiful!! I just love them! The colors and designs are so pretty. I can't wait to try them out!!\nVery pretty designs and colors!!\nYallFF gold head chain jewelry for women gypsy bollywood halloween indian headband hair headpiece\nYallFF\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.7 x 3.6 x 0.6 inches; 0.81 Ounces', 'Item model number': 'YF4130054A'}\nBeautiful head pieces. Great for festivals!!\nPretty!! ❣\nAURIC BLENDS Perfume Oil; Sandalwood, 0.33 Ounce\nAuric Blends\n['Auric Blends has been a #1 customer-rated oil-based perfume for nearly 20 years. Our classic line of roll-ons are crafted with a combination of exotic, imported ingredients from around the globe. Each of our hand-blended perfumes is a journey in itself, offering a unique and captivating scent. Our perfumes have been enjoyed by millions of people worldwide and have received regional awards such as \"best love potion\" by New York Press. Our loyal customers and fans adore our oils. With a wide selection of almost 40 fragrances to choose from, including floral, fruit, oriental, and fresh scents, you\\'re sure to find one or more favorites in our collection']\n{'Brand': 'Auric Blends', 'Item Form': 'Oil', 'Item Volume': '0.33 Fluid Ounces', 'Scent': 'Sandalwood', 'Special Feature': 'Travel Size, Lightweight, Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3 x 2 x 1 inches; 1.6 Ounces', 'UPC': '712469001404', 'Manufacturer': 'AURIC BLENDS'}\nI love Auric Blends. I own numerous scents by this line, and I love the smell of sandalwood,  but for some reason I just wasn't feeling it with this one.\nEh..\nAISI BEAUTY Pink Jumbo Braid Crochet Braids Hair Extension Three Tone Ombre Color Rainbow Jumbo Braiding for Twist Braiding,Jumbo Box Braiding Hair 24\",3 Bundles/Lot,Blue-Light purple-Pink\nAISI BEAUTY\n{'Brand': 'AISI BEAUTY', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10 x 8 x 2.5 inches; 11.99 Ounces'}\nI like the color combo. I ordered the light pink, light blue, and lavender combo. Very pretty.  I am going to make dread locks with them. I'm excited!!\nKanekalon extensions are perfect for making dreadlocks!!",
  "profile": "**User Profile Summary:**\n\n- **Artistic Appreciation:** The user maintains a strong preference for visually appealing items, characterized by vibrant colors and attractive designs, as reflected in their latest purchase focused on colorful hair extensions.\n- **Interest in Body Art and Accessories:** The user enjoys temporary tattoos and unique accessories that enhance personal style and enable creative expression, including hair accessories suited for festivals.\n- **Aesthetic Focus:** Values beauty and aesthetics over practicality, consistently expressing excitement for artistic accessories and body art. The recent acquisition further emphasizes their enthusiasm for vibrant colors and creative hairstyling options.\n- **Positive Attitude with Selectivity:** This user generally exhibits an optimistic outlook while being discerning in evaluations. Their past experiences with fragrances reveal nuanced expectations regarding aesthetic value. The recent interaction showcases a clear appreciation for color combinations.\n- **Rating Behavior:** Typically rates products highly when they meet expectations, but recent interactions indicate a balanced rating approach, demonstrating expectations for quality and alignment with personal preferences.\n- **Engagement with Creative Events:** The user shows a keen interest in festival culture and accessories that support self-expression, reflecting a vibrant social lifestyle. The intention to create dreadlocks with purchased items aligns with their creative engagement and pursuit of unique personal style.\n\nOverall, the user continues to gravitate towards colorful, artistic products that facilitate self-expression, highlighting an evolving standard of aesthetic quality and creativity in their preferences.",
  "metrics": {
    "rouge1_f": 0.19817073170731705,
    "rouge2_f": 0.015290519877675844,
    "rougeL_f": 0.07621951219512194,
    "meteor": 0.09358412973573321,
    "bleu1": 0.09062223596111464,
    "bleu2": 0.023597564171648204,
    "bleu3": 0.0040951072150013845,
    "bleu4": 0.0017074526102445202,
    "bertscore_precision": 0.36119237542152405,
    "bertscore_recall": 0.43013352155685425,
    "bertscore_f1": 0.39265984296798706
  }
}