{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Etude House Any Cushion All Day Perfect SPF50+/PA+++ (#Pure)\nReview Date: 2020/02/07\nStore: Etude House\nAverage Rating: 3.4\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'All', 'Package Information': 'Tube', 'Brand': 'Etude House', 'Coverage': 'Full', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.29 x 3.15 x 1.02 inches; 2.88 Ounces', 'Item model number': 'SG_B06Y5HG6PR_US'}\nReview Text: I adore Asian beauty products, particularly Korean and Japanese. I've been working my way around with different cushions seeing what I like. Cushions are nice because they are easy to carry around in a purse due to the compact design. This is a very decent cushion with good coverage. Etude House has never failed me. It also arrived much faster than I thought it would.\nReview Title: Great coverage/ beautiful color ❇️\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Wyuen 12 Sheets Butterfly Women Temporary Tattoo Stickers Animal Tattoos Body Art Waterproof Hand Fake Sticker (W12-03)\nWyuen\n{'Brand': 'Wyuen', 'Size': '3.85x2.36 Inch (Pack of 12)', 'Water Resistance Level': 'Waterproof', 'Pattern': 'Animal', 'Number of Pieces': '12', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 3.94 x 0.39 inches; 0.28 Ounces', 'Item model number': 'FW12-03', 'UPC': '746591612887'}\nAbsolutely beautiful!! I just love them! The colors and designs are so pretty. I can't wait to try them out!!\nVery pretty designs and colors!!\nYallFF gold head chain jewelry for women gypsy bollywood halloween indian headband hair headpiece\nYallFF\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.7 x 3.6 x 0.6 inches; 0.81 Ounces', 'Item model number': 'YF4130054A'}\nBeautiful head pieces. Great for festivals!!\nPretty!! ❣\nAURIC BLENDS Perfume Oil; Sandalwood, 0.33 Ounce\nAuric Blends\n['Auric Blends has been a #1 customer-rated oil-based perfume for nearly 20 years. Our classic line of roll-ons are crafted with a combination of exotic, imported ingredients from around the globe. Each of our hand-blended perfumes is a journey in itself, offering a unique and captivating scent. Our perfumes have been enjoyed by millions of people worldwide and have received regional awards such as \"best love potion\" by New York Press. Our loyal customers and fans adore our oils. With a wide selection of almost 40 fragrances to choose from, including floral, fruit, oriental, and fresh scents, you\\'re sure to find one or more favorites in our collection']\n{'Brand': 'Auric Blends', 'Item Form': 'Oil', 'Item Volume': '0.33 Fluid Ounces', 'Scent': 'Sandalwood', 'Special Feature': 'Travel Size, Lightweight, Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3 x 2 x 1 inches; 1.6 Ounces', 'UPC': '712469001404', 'Manufacturer': 'AURIC BLENDS'}\nI love Auric Blends. I own numerous scents by this line, and I love the smell of sandalwood,  but for some reason I just wasn't feeling it with this one.\nEh..\nAISI BEAUTY Pink Jumbo Braid Crochet Braids Hair Extension Three Tone Ombre Color Rainbow Jumbo Braiding for Twist Braiding,Jumbo Box Braiding Hair 24\",3 Bundles/Lot,Blue-Light purple-Pink\nAISI BEAUTY\n{'Brand': 'AISI BEAUTY', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10 x 8 x 2.5 inches; 11.99 Ounces'}\nI like the color combo. I ordered the light pink, light blue, and lavender combo. Very pretty.  I am going to make dread locks with them. I'm excited!!\nKanekalon extensions are perfect for making dreadlocks!!\nMakeup Revolution I Heart Makeup Highlighter, Mermaids Heart, 10g\nMakeup Revolution\n{'Item Form': 'Powder', 'Brand': 'Makeup Revolution', 'Color': 'Mermaids Heart', 'Skin Tone': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.13 x 6.1 x 1.38 inches; 0.35 Ounces', 'Item model number': '30050'}\nI was really excited to receive this item. The heart box got smashed a little in the corner which irked me. The highlighter is alright. I guess it's just not what I was expecting.\nThe heart shaped box got damaged 😞\nBeauty Creations Baked Pops Highlight Sweet Candy\nBeauty Creations\n{'Finish Type': 'Shimmery', 'Brand': 'Beauty Creations', 'Skin Tone': 'All', 'Unit Count': '1 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.8 x 4 x 0.8 inches; 2.4 Ounces', 'Item model number': 'SG_B074R5ZVKN_US', 'UPC': '603149301795', 'Manufacturer': 'Beauty Creations'}\nI love the packinging.  It's so cute how it looks like a box of candy. I bought it for my grandmother for Christmas. She's been wanting some highlighter. I hope she likes it!\nI love the candy-like packaging. So cute!\nEtude House Any Cushion All Day Perfect SPF50+/PA+++ (#Pure)\nEtude House\n{'Item Form': 'Cream', 'Skin Type': 'All', 'Package Information': 'Tube', 'Brand': 'Etude House', 'Coverage': 'Full', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.29 x 3.15 x 1.02 inches; 2.88 Ounces', 'Item model number': 'SG_B06Y5HG6PR_US'}\nI adore Asian beauty products, particularly Korean and Japanese. I've been working my way around with different cushions seeing what I like. Cushions are nice because they are easy to carry around in a purse due to the compact design. This is a very decent cushion with good coverage. Etude House has never failed me. It also arrived much faster than I thought it would.\nGreat coverage/ beautiful color ❇️",
  "profile": "**User Profile Summary:**\n\n- **Artistic Appreciation:** The user maintains a strong preference for visually appealing items, particularly those showcasing vibrant colors and captivating designs. Their recent purchases and gifts reflect a dedication to artistic expression.\n\n- **Interest in Body Art and Accessories:** They enjoy temporary tattoos and unique accessories that enhance personal style, emphasizing a passion for creative self-expression.\n\n- **Aesthetic Focus:** This individual prioritizes beauty and aesthetics, demonstrated by their enthusiastic evaluations of products with appealing designs. They are increasingly selective, demonstrating discernment regarding aesthetic quality in their purchases.\n\n- **Positive Attitude with Increased Selectivity:** While they possess an optimistic outlook, the user is becoming more critical, especially regarding product presentation. They appreciate innovative packaging and creative designs, willing to express dissatisfaction when standards are not met.\n\n- **Rating Behavior:** The user typically rates products highly when they align with their preferences. However, recent interactions indicate a shift to more selective ratings, reflecting an emphasis on uniqueness and presentation.\n\n- **Engagement with Creative Events:** Their interest in festival culture and accessories emphasizes a vibrant social lifestyle, highlighting an ongoing evolution in their standards for creativity and aesthetic quality.\n\n- **Exploration of Beauty Products:** The user's recent focus on beauty products, especially effective and compact options, illustrates an expanding interest in cosmetics that blend functionality with artistry. \n\nThis profile underscores the user's commitment to vibrant, artistic products while fostering growing expectations for quality and creative presentation.",
  "metrics": {
    "rouge1_f": 0.1601642710472279,
    "rouge2_f": 0.014403292181069961,
    "rougeL_f": 0.0677618069815195,
    "meteor": 0.06173409391876671,
    "bleu1": 0.02920327767481895,
    "bleu2": 0.007982419249163146,
    "bleu3": 0.0027111256651706434,
    "bleu4": 0.0008892390289598846,
    "bertscore_precision": 0.3629246652126312,
    "bertscore_recall": 0.4585716128349304,
    "bertscore_f1": 0.40518003702163696
  }
}