{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Watermark Sweet Heart Eau De Parfum For Women 3.4 Oz, Inspired By Pink All My Heart\nReview Date: 2020/09/30\nStore: Watermark Beauty\nProduct Description: ['Sweet Heart Perfume By Watermark Beauty.', 'If you got it, flaunt it!', \"If you feel the love in the air, it's time to show it to the world! With this exquisite sweet fragrance inspired by Pink All My Heart you can express what your heart feels even without words. This lovely perfume will help you feel amazing and attractive every time you go hand in hand with the loved one. The refreshing mix of perfume, demineralized water and essential oils will ensure that this romantic aroma will last so you can enjoy those special moments. (Note: When applying any fragrance please consider that there are several factors which can affect the natural smell of your skin and, in turn, the way a scent smells on you. For instance, your mood, stress level, age, body chemistry, diet, and current medications may all alter the scents you wear. Similarly, factor such as dry or oily skin can even affect the amount of time a fragrance will last after being applied)\", 'Made by Watermark Beauty. To ensure Great customers satisfaction this product Essential Oils was manufactured in the UK.', 'Eau De Parfum Spray Women 3.4 Fl. Oz./100 Ml. The product is inspired by Pink All My Heart. Packaging for this product may vary from that shown in the image above.', 'Ingredients: Product contains 80% alcohol grade 40-B, parfum, aqua, (demineralizad water)', 'Essential Oils Made in UK']\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Watermark Beauty', 'Item Form': 'Spray', 'Item Volume': '100 Milliliters', 'Fragrance Concentration': 'eau_de_parfum', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.2 x 2.2 x 7 inches; 9.92 Ounces', 'Item model number': 'SC1007', 'UPC': '713807393021'}\nReview Text: I looooove this perfume!! I originally found this at 5 below and was soooo happy amazon had a bigger bottle! Love Love Love\nReview Title: I love this scent\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "2 Pieces Soft Sleep Cap – Night Satin Bonnet with Wide Premium Elastic Band for Women\nSamserot\n{'Product Dimensions': '12.6 x 12.6 x 0.8 inches; 2.19 Ounces', 'UPC': '828217364995'}\nI absolutely LOVE the colors and designs. My ONLY con is the band is so damn tight I had to push it back past my edges and stretch it out a few times in order for it not to be so tight, and even then it’s still tight. But the colors are cute😩\nThe colors are cute\nWinzfred Female Waterproof Glowing Vib Multispeed Mssager G-Didlos for Women (Puple)\nWinzfred\n{'Color': 'Puple', 'Brand': 'Winzfred', 'Pattern': 'Floral', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Manufacturer': 'Winzfred'}\nI only like the jelly material & the color. It took FOREVEEER to get here. An it is small :( MEH!!!\nWhatever! I’ve had better\nWatermark Sweet Heart Eau De Parfum For Women 3.4 Oz, Inspired By Pink All My Heart\nWatermark Beauty\n['Sweet Heart Perfume By Watermark Beauty.', 'If you got it, flaunt it!', \"If you feel the love in the air, it's time to show it to the world! With this exquisite sweet fragrance inspired by Pink All My Heart you can express what your heart feels even without words. This lovely perfume will help you feel amazing and attractive every time you go hand in hand with the loved one. The refreshing mix of perfume, demineralized water and essential oils will ensure that this romantic aroma will last so you can enjoy those special moments. (Note: When applying any fragrance please consider that there are several factors which can affect the natural smell of your skin and, in turn, the way a scent smells on you. For instance, your mood, stress level, age, body chemistry, diet, and current medications may all alter the scents you wear. Similarly, factor such as dry or oily skin can even affect the amount of time a fragrance will last after being applied)\", 'Made by Watermark Beauty. To ensure Great customers satisfaction this product Essential Oils was manufactured in the UK.', 'Eau De Parfum Spray Women 3.4 Fl. Oz./100 Ml. The product is inspired by Pink All My Heart. Packaging for this product may vary from that shown in the image above.', 'Ingredients: Product contains 80% alcohol grade 40-B, parfum, aqua, (demineralizad water)', 'Essential Oils Made in UK']\n{'Brand': 'Watermark Beauty', 'Item Form': 'Spray', 'Item Volume': '100 Milliliters', 'Fragrance Concentration': 'eau_de_parfum', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.2 x 2.2 x 7 inches; 9.92 Ounces', 'Item model number': 'SC1007', 'UPC': '713807393021'}\nI looooove this perfume!! I originally found this at 5 below and was soooo happy amazon had a bigger bottle! Love Love Love\nI love this scent",
  "profile": "**User Summary:**\n\n- **Aesthetic Appreciation:** The user continues to express a strong fondness for vibrant colors and attractive designs, as evidenced by their recent purchase of a perfume that is both appealing and well-reviewed. This suggests a successful alignment of aesthetics with their expectations.\n\n- **Comfort Concerns:** While they remain sensitive to fit and size issues in various products, their recent experience with a fragrance indicates a willingness to engage with products that offer sensory comfort and satisfaction, suggesting a slightly broader focus beyond solely physical items.\n\n- **Mixed Satisfaction:** The user generally has mixed feelings about purchases; however, their positive review of the recent fragrance illustrates a growing appreciation for products that fulfill their expectations in terms of both scent and experience, despite previous frustrations with delivery and sizing in other categories.\n\n- **Attention to Detail:** The user values practical usability and product dimensions, with a recent shift toward products that successfully balance aesthetic appeal and functionality. Their review reflects satisfaction with the usability of the fragrance.\n\n- **Product Functionality:** They maintain a consistent emphasis on functionality in self-care products while showcasing a reinforcement of their desire for both aesthetic appeal and sensory experience.\n\n- **Brand Awareness:** User engagement with brands focusing on quality materials remains strong, and their recent purchase reinforces a trend towards critically evaluating overall product satisfaction, especially regarding sensory enjoyment.\n\nOverall, the user effectively balances an appreciation for style with a desire for sensory comfort, increasingly valuing effective product experiences that align with their aesthetic preferences.",
  "metrics": {
    "rouge1_f": 0.19804741980474197,
    "rouge2_f": 0.013986013986013986,
    "rougeL_f": 0.09483960948396095,
    "meteor": 0.08781081551034603,
    "bleu1": 0.10455332731894147,
    "bleu2": 0.03005302614190486,
    "bleu3": 0.004817788507184566,
    "bleu4": 0.0019305685682803693,
    "bertscore_precision": 0.37061935663223267,
    "bertscore_recall": 0.4283955693244934,
    "bertscore_f1": 0.3974185883998871
  }
}