{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: e.l.f. Essential Instant Lift Brow Pencil Neutral Brown 0.06 oz\nReview Date: 2021/04/07\nStore: e.l.f.\nAverage Rating: 4.7\nProduct Details: {'Brand': 'E.l.f.', 'Item Form': 'Pencil', 'Finish Type': 'Polished,Natural', 'Skin Type': 'All', 'Item Weight': '0.06 Ounces', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.81 x 1.46 x 0.47 inches; 0.06 Ounces', 'UPC': '609332217225'}\nReview Text: My favorite eyebrow pencil. I use these on my brows I’ve been using this for like 3 years now!\nReview Title: My fav\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "2 Pieces Soft Sleep Cap – Night Satin Bonnet with Wide Premium Elastic Band for Women\nSamserot\n{'Product Dimensions': '12.6 x 12.6 x 0.8 inches; 2.19 Ounces', 'UPC': '828217364995'}\nI absolutely LOVE the colors and designs. My ONLY con is the band is so damn tight I had to push it back past my edges and stretch it out a few times in order for it not to be so tight, and even then it’s still tight. But the colors are cute😩\nThe colors are cute\nWinzfred Female Waterproof Glowing Vib Multispeed Mssager G-Didlos for Women (Puple)\nWinzfred\n{'Color': 'Puple', 'Brand': 'Winzfred', 'Pattern': 'Floral', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Manufacturer': 'Winzfred'}\nI only like the jelly material & the color. It took FOREVEEER to get here. An it is small :( MEH!!!\nWhatever! I’ve had better\nWatermark Sweet Heart Eau De Parfum For Women 3.4 Oz, Inspired By Pink All My Heart\nWatermark Beauty\n['Sweet Heart Perfume By Watermark Beauty.', 'If you got it, flaunt it!', \"If you feel the love in the air, it's time to show it to the world! With this exquisite sweet fragrance inspired by Pink All My Heart you can express what your heart feels even without words. This lovely perfume will help you feel amazing and attractive every time you go hand in hand with the loved one. The refreshing mix of perfume, demineralized water and essential oils will ensure that this romantic aroma will last so you can enjoy those special moments. (Note: When applying any fragrance please consider that there are several factors which can affect the natural smell of your skin and, in turn, the way a scent smells on you. For instance, your mood, stress level, age, body chemistry, diet, and current medications may all alter the scents you wear. Similarly, factor such as dry or oily skin can even affect the amount of time a fragrance will last after being applied)\", 'Made by Watermark Beauty. To ensure Great customers satisfaction this product Essential Oils was manufactured in the UK.', 'Eau De Parfum Spray Women 3.4 Fl. Oz./100 Ml. The product is inspired by Pink All My Heart. Packaging for this product may vary from that shown in the image above.', 'Ingredients: Product contains 80% alcohol grade 40-B, parfum, aqua, (demineralizad water)', 'Essential Oils Made in UK']\n{'Brand': 'Watermark Beauty', 'Item Form': 'Spray', 'Item Volume': '100 Milliliters', 'Fragrance Concentration': 'eau_de_parfum', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.2 x 2.2 x 7 inches; 9.92 Ounces', 'Item model number': 'SC1007', 'UPC': '713807393021'}\nI looooove this perfume!! I originally found this at 5 below and was soooo happy amazon had a bigger bottle! Love Love Love\nI love this scent\nDesigner Fashion Elastic Rhinestone Hairtie Ponytail Holder Headband Jewelry Accessories for Women Girls Hair Band by Hair Accessories\nHair Accessories\n['Designer Fashion Elastic Rhinestone Hairtie Ponytail Holder Headband Jewelry Accessories for Women Girls Hair Band by Hair Accessories']\n{'Age Range (Description)': 'Adult', 'Material': 'Rhinestone', 'Fabric Type': 'Elastic', 'Number of Items': '1', 'Brand': 'Hair Accessories', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 1 x 5 inches; 1.13 Ounces', 'UPC': '784179363714 619231801227 755332069774'}\nI was sort of disappointed in the size!! It’s really small.\nMeh...\nLong Curly Wigs for Black Women Middle Part Long Wavy Curly Synthetic Wig Heat Resistant Hair for Daily Party Cosplay Use (6#)\nUbrand\n{'Material': 'Synthetic', 'Hair Type': 'Wigs,Curly Wigs', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'Ubrand', 'Package Dimensions': '9.29 x 6.69 x 2.76 inches; 11.36 Ounces'}\nI’ve had better wigs from Amazon!! Way to fake looking! The part was so horrible\nSmh\ne.l.f. Essential Instant Lift Brow Pencil Neutral Brown 0.06 oz\ne.l.f.\n{'Brand': 'E.l.f.', 'Item Form': 'Pencil', 'Finish Type': 'Polished,Natural', 'Skin Type': 'All', 'Item Weight': '0.06 Ounces', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.81 x 1.46 x 0.47 inches; 0.06 Ounces', 'UPC': '609332217225'}\nMy favorite eyebrow pencil. I use these on my brows I’ve been using this for like 3 years now!\nMy fav",
  "profile": "**User Summary:**\n\n- **Aesthetic Appreciation:** The user remains drawn to vibrant colors and appealing designs, consistently seeking products that align aesthetically with their preferences.\n\n- **Comfort and Usability Concerns:** Their sensitivity to fit and size issues is a significant focus, echoed by past experiences with products that did not meet expectations in terms of realism and quality.\n\n- **Mixed Satisfaction:** The user has a complex relationship with purchases; while they enjoy certain products, recent disappointments with hair accessories and wigs highlight their heightened scrutiny regarding overall satisfaction.\n\n- **Attention to Detail:** They possess a critical eye for practical usability, always evaluating product dimensions and features, and favoring items that successfully merge aesthetic appeal with functionality.\n\n- **Product Functionality:** The commitment to effective and high-quality accessories is evident, as they prioritize consistent performance across their purchases, particularly after experiences with less satisfactory items.\n\n- **Brand Engagement:** The user engages with brands emphasizing quality and stylistic appeal, reflecting a focus on both sensory enjoyment and aesthetic alignment. Their positive experience with an eyebrow pencil further reinforces their preference for reliable, high-performing products that stand up to long-term use.\n\nOverall, the user adeptly navigates a balance between style and practicality, increasingly motivated to ensure products meet both aesthetic desires and functional needs, while remaining vigilant about potential sizing and usability issues.",
  "metrics": {
    "rouge1_f": 0.15669205658324267,
    "rouge2_f": 0.013086150490730647,
    "rougeL_f": 0.06746463547334058,
    "meteor": 0.060799844436611974,
    "bleu1": 0.025039371040008442,
    "bleu2": 0.005609218732852747,
    "bleu3": 0.0009973324420031746,
    "bleu4": 0.0004209287938657298,
    "bertscore_precision": 0.34542518854141235,
    "bertscore_recall": 0.43555596470832825,
    "bertscore_f1": 0.3852896988391876
  }
}