{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mynena Bronze Cream Shimmer Eyeshadow Eyeliner\nReview Date: 2021/08/23\nStore: Mynena\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Mynena', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Shimmer,Smooth', 'Special Feature': 'Travel size', 'Product Benefits': 'Smoothening', 'Package Dimensions': '2.64 x 2.32 x 1.46 inches; 0.63 Ounces'}\nReview Text: The almost bronze-ish color of this eyeshadow by Mynena Jelly is what attracted me. What I got was far lighter and was almost a light gold.<br /><br />It's very nice, but I tend to go with darker shades on my eyelid and lighter as the makeup goes toward the brow bone.  This will work for the latter, but not on the eyelid itself for me.  For the color difference I subtracted one star.\nReview Title: Color is different from the picture\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Spa Grade Jade Roller for Face with Gua Sha | Jade Face Roller Massager | Jade Facial Roller | Face Roller Massager | Jade Rollers | Wrinkle Roller\nJane Cosmetics\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 3.4 x 1.2 inches; 4.8 Ounces', 'UPC': '814689026516', 'Manufacturer': 'Jane & Co.'}\nBefore receiving Jane & Co.'s Roller and Gua Sha, I had never really used anything like it on my skin before. For me, it was simply wash, dry, moisturize and occasionally use makeup.<br /><br />The roller and Gua Sha that I received is supposedly made of Jade. To me, it looked more like New Zealand Nephrite or even Aventurine. The packaging and product are nicely done, complete with a handwritten note from the proprietress of Jane & Co.<br /><br />There is a small pamphlet with a set of instructions that includes a contact number where you can send a text to receive a complete guide on how to use both the roller and the Gua Sha. Instantly, you are given a URl to download the free eBook to go with the product.<br /><br />To use either the roller or Gua Sha you simply chill the implements in the refrigerator or freezer.  This  extra coolness helps to shrink the pores and ease any puffiness that might be present.<br /><br />Wash your face as normal to avoid pushing any dirt or impurities in your skin with the roller. Dry your face and apply a moisturizing oil such as coconut oil, jojoba, or argan oil which are particularly nourishing to the skin.<br /><br />Take your now-cool roller and roll over your face, from the center outward. The included instructions suggest to pay particular attention to the area around the nose and under the eyes to aid in the draining and circulation of the lymph glands in those areas.<br /><br />To use the Gua Sha, again, cleanse the face, and moisturize with an oil that is beneficial for the skin. Never, Never NEVER use mineral oil on the face (or anywhere else on the body for that matter).<br /><br />Using moderate yet firm pressure in a gentle scraping motion to ease out tension from the face.  I confess I haven't quite gotten the hang of the Gua Sha yet, but I am still working on it. The coolness of these facial tools feels excellent on my skin and it definitely is a relaxing practice to get into regularly.\nGive your face a beauty massage!\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nI was super excited to try this Princess Elizabeth 4D silk las mascara.  Initially, it went on well, but after a few minutes, I noticed that my lashes started clumping together. Once it was dried, those clumps would start flaking.<br /><br />The packaging is gorgeous, with a picture of Princess Elizabeth, who later became Queen Elizabeth I. The product just doesn't work as well as I would like.\nIt clumps and flakes a bit more than I would like\nOval Large Makeup Brushes Fast Application Liquid Cream Powder Foundation (Rose Gold 1)\nLAMJAD\n{'Brand': 'LAMJAD', 'Material': 'synthetic', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Skin Tone': 'All', 'Package Dimensions': '8.23 x 3.07 x 1.61 inches; 0.71 Ounces', 'UPC': '714403137835'}\nThis large oval makeup brush for applying foundation and powder is the first of its type for me to use.  What I normally use sponges or my fingers for ends up looking flawless when I use this brush!<br /><br />It's super soft on the skin and gives a fantastic matte finish so there are no lines of demarcation and your foundation can be blended perfectly.  I am truly impressed with the results!\nLove it!\nCOLORGRAM Artist Formula Auto Brow Pencil 0.25g- True Beauty K-Drama Makeup, Built-in-Spoolie, Clump-Free Formula, Softly Glides, Natural Look (04 Dark Brown)\nCOLORGRAM\n[\"Featuring a unique, triangular tip, Brow Definer's retractable pencil design is ideal for outlining and filling your brows in one fluid motion. The custom spooley end is created with a precise width and firmness to seamlessly blend color.\"]\n{'Brand': 'COLORGRAM', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Product Benefits': 'Softening', 'Skin Type': 'All', 'Product Dimensions': '0.59 x 0.71 x 6.1 inches; 0.63 Ounces'}\nI have gone from having very dark hair to going prematurely gray.  Of course, when that happens, your eyebrows have a tendency to look a bit patchy. Colorgram's Artist formula Auto Brow Pencil is just what I have been looking for.<br /><br />I love the broad, brush like tip that fills my eyebrows in easily and makes them look super natural. There is a blending brush at the oppposite end so you can do more blending.  The color tends to last all day and stays put until I decide to take it off ant night.\nThe perfect color for me\nNeoCell Overnighter Collagen, 9.3oz\nNeoCell\n{'Brand': 'NeoCell', 'Item Form': 'Powder', 'Active Ingredients': 'Vitamin c,zinc', 'Unit Count': '9.3 Ounce', 'Number of Items': '1', 'Package Dimensions': '5.55 x 5.08 x 3.46 inches; 9.3 Ounces', 'UPC': '016185130623'}\nI have been using NeoCell's collagen supplements for a little over six months and have had a great experience with the brand.. This overnighter collagen just adds to what I was doing and I am noticing a distinct difference in my skin.<br /><br />I usually mix mine into a coconut milk base with fruit and the taste is pretty good, not gritty.  As for the added melatonin for sleep, I really don't notice it that much. All in all I really like the product.\nGreat brand, works well\nMynena Bronze Cream Shimmer Eyeshadow Eyeliner\nMynena\n{'Brand': 'Mynena', 'Item Form': 'Cream,Powder,Creamy', 'Finish Type': 'Shimmer,Smooth', 'Special Feature': 'Travel size', 'Product Benefits': 'Smoothening', 'Package Dimensions': '2.64 x 2.32 x 1.46 inches; 0.63 Ounces'}\nThe almost bronze-ish color of this eyeshadow by Mynena Jelly is what attracted me. What I got was far lighter and was almost a light gold.<br /><br />It's very nice, but I tend to go with darker shades on my eyelid and lighter as the makeup goes toward the brow bone.  This will work for the latter, but not on the eyelid itself for me.  For the color difference I subtracted one star.\nColor is different from the picture",
  "profile": "**Updated User Profile Summary:**\n\n- **Skincare and Beauty Enthusiast**: Maintains a strong interest in skincare practices and cosmetics, particularly valuing products that enhance beauty while promoting wellness.\n- **Preference for Natural Materials**: Values skincare products crafted from natural ingredients and cosmetics that offer a natural look, reflecting a deep inclination towards holistic and traditional beauty routines.\n- **Instruction-Oriented**: Prefers clear guides and detailed instructions for using skincare tools and cosmetics, suggesting a methodical approach to beauty applications.\n- **Focus on Hydration**: Emphasizes the importance of nourishing and hydrating treatments, showcasing a commitment to maintaining healthy skin and improving its appearance.\n- **Relaxation and Self-Care**: Enjoys the calming aspects of skincare rituals, finding stress relief and self-care through beauty practices.\n- **Seeking Improvement**: Open to learning and refining skills in beauty applications, integrating supplements that foster skin health and overall wellness, emphasizing a dedication to mastering techniques.\n- **Product Experience and Feedback**: Values brands that prioritize thoughtful packaging and customer engagement, indicating a preference for positive experiences and effective results.\n- **Cosmetic Exploration**: Actively seeks products that enhance application and blendability with an appreciation for various cosmetic finishes. Recently expressed interest in cream formulations and shimmer effects, while also valuing color consistency in cosmetics. Notably selective about shade preferences for eye makeup, demonstrating a thoughtful approach to color matching. \n\nThe user's ongoing commitment to exploring beauty products reflects a desire for effectiveness and aesthetic appeal in their beauty routine.",
  "metrics": {
    "rouge1_f": 0.15395894428152493,
    "rouge2_f": 0.005873715124816446,
    "rougeL_f": 0.07771260997067449,
    "meteor": 0.05589735894357743,
    "bleu1": 0.008375513878176253,
    "bleu2": 0.0016145173201247375,
    "bleu3": 0.0002730088830930582,
    "bleu4": 0.00011235767259746967,
    "bertscore_precision": 0.3907468318939209,
    "bertscore_recall": 0.48698943853378296,
    "bertscore_f1": 0.43359172344207764
  }
}