{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bold Men, Mens Hair Gel\"Casual Hold\" 100ml, Mens Styling Gel\nReview Date: 2020/12/19\nStore: BOLD MEN\nAverage Rating: 4.0\nProduct Details: {'Hair Type': 'All, Dry, Curly, Thick, Thin', 'Material Type Free': 'Alcohol Free', 'Scent': 'Natural', 'Liquid Volume': '100 Milliliters', 'Item Form': 'Gel', 'Product Dimensions': '2.36 x 2.36 x 2.36 inches; 4.16 Ounces', 'Item model number': '793611800243', 'UPC': '793611800243'}\nReview Text: I’m sick of using big-box store tube gel and want to get back to using more boutique products.<br /><br />I opened this and was NOT expecting it to be clear.<br />It’s a cross between a gel and pomade.<br /><br />I really like the smell. Something like fait sour patch kids.<br /><br />It holds well too, not greasy, not gooey etc.<br /><br />I’m glad I ordered this to give it a try.\nReview Title: Smells a little like sour patch kids, decent hold\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mane Tame Deluxe Pomade 3.3oz/97mL - Firm Hold, Medium Shine - Made in USA, Water-Based, Combable, Rinses Out Easily, BARBER RECOMMENDED - Best used on dry hair\nMane Tame Professional Men's Grooming\n{'Hair Type': 'Dry', 'Liquid Volume': '118 Milliliters', 'Item Form': 'Clay', 'Brand': \"Mane Tame Professional Men's Grooming\", 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3 x 3 x 2.5 inches; 5.6 Ounces', 'UPC': '851088008163'}\nI ordered this because I’m tired of using big-box store hair gel.<br /><br />I miss using pomade style products and for the few dollars I used to save, 2020 has taught me to treat myself to the small luxuries in life.<br /><br />Overall, you get A LOT of product in this jar.<br />I like the texture and the hold.<br /><br />I spike up my hair a little and this worked well for that.<br /><br />My problem, and mind you it’s MY problem not the product; is I personally don’t like the smell. It’s like a hairdresser perfume like scent. Very much like it’s got some cologne mixed into it.<br /><br />You can smell the cologne through the shipping bag.<br /><br />Overall while I don’t like the scent I absolutely appreciate the quantity provided. The value is definitely there.\nI don’t like the scent but it works well\nBold Men, Mens Hair Gel\"Casual Hold\" 100ml, Mens Styling Gel\nBOLD MEN\n{'Hair Type': 'All, Dry, Curly, Thick, Thin', 'Material Type Free': 'Alcohol Free', 'Scent': 'Natural', 'Liquid Volume': '100 Milliliters', 'Item Form': 'Gel', 'Product Dimensions': '2.36 x 2.36 x 2.36 inches; 4.16 Ounces', 'Item model number': '793611800243', 'UPC': '793611800243'}\nI’m sick of using big-box store tube gel and want to get back to using more boutique products.<br /><br />I opened this and was NOT expecting it to be clear.<br />It’s a cross between a gel and pomade.<br /><br />I really like the smell. Something like fait sour patch kids.<br /><br />It holds well too, not greasy, not gooey etc.<br /><br />I’m glad I ordered this to give it a try.\nSmells a little like sour patch kids, decent hold",
  "profile": "**User Summary:**\n\n- **Hair Product Preference:** The user has a strong inclination towards quality grooming products, moving away from mass-market options towards boutique items that cater to a variety of hair types, including dry and curly hair.\n- **Value for Money:** They appreciate receiving a good quantity of product for the price, emphasizing a balance between quality and cost-effectiveness in their purchases.\n- **Texture and Performance:** Performance remains a top priority, with a preference for products that offer a decent hold for styling without causing greasiness or stickiness.\n- **Scent Sensitivity:** Despite an earlier aversion to overly perfumed scents, the user has shown a more positive response to products with natural and softer fragrances, as indicated by their enjoyment of a recent product's unique scent reminiscent of sweets.\n- **Treating Themselves:** The user continues to indulge in self-care and appreciates the experience that comes with using specialty grooming products, reflecting their desire for small luxuries.\n- **Overall Satisfaction:** They express a high level of satisfaction with the effectiveness and quality of products, leading to favorable ratings. The user appears to be evolving in their scent preferences, favoring products that are less conventional and more appealing.\n\nIn conclusion, the user values performance, quantity, and increasingly positive scents in hair grooming products while maintaining a focus on boutique quality over mass-market alternatives.",
  "metrics": {
    "rouge1_f": 0.271356783919598,
    "rouge2_f": 0.02689075630252101,
    "rougeL_f": 0.10720268006700168,
    "meteor": 0.11965125578036159,
    "bleu1": 0.12074449905197504,
    "bleu2": 0.034116402702405624,
    "bleu3": 0.005438634689379658,
    "bleu4": 0.0021734527115205558,
    "bertscore_precision": 0.3769802451133728,
    "bertscore_recall": 0.4386075735092163,
    "bertscore_f1": 0.4054655432701111
  }
}