{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/08/08\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Starzak', 'Christopher Sadler', 'Jay Grace', 'Lee Wilton', 'Seamus Malone', 'Jean-Philippe Vine', 'Richard Webber', 'Will Becher', 'Mike Mort', 'Dave Osmand'], 'Starring': ['John Sparkes', 'Justin Fletcher', 'Kate Harbour'], 'Studio': ['Aardman Animations']}\nReview Text: Love Shaun the Sheep.  He IA always thinking.  He doesn't miss a beat, I hope you will be able to meet, Shaun the Sheep.  I love Shirley and Timmy too\nReview Title: Dont miss a beat, come watch Shaun the Sheep\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Alpha House\nComedy, Drama\n[\"An Amazon Original series: They work in the Senate. They live in the house - Alpha House. Created by Garry Trudeau (Doonesbury, Tanner '88).\"]\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch'], 'Directors': ['Adam Bernstein', 'Michael Mayer', 'Andrew McCarthy', 'Bob Balaban', 'Jann Turner', 'Jake Schreier', 'Antoine Douaihy', 'Clark Johnson', 'Michael Pressman'], 'Producers': ['Jonathan Alter']}\nI do not like politics in real life.  But this clever show makes me laugh because I think it might be closer to the truth than politicians will admit.\nFunny pokes at politics\nJustified\nSuspense, Western, Drama, Action\n[\"Deputy US Marshal Raylan Givens (Timothy Olyphant) will start to pick at the thread of a cold case over 30 years in the making, unraveling a riddle that echoes all the way back to his boyhood and his criminal father's bad dealings. Meanwhile, Boyd Crowder (Walton Goggins) finds his grip on Harlan loosening due to a Pentecostal preacher with a penchant for theatrics and a knack for manipulation...\"]\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nI enjoy westerners.  Justified is a modern day cowboy tale.  Even some of the bad guys are loveable and others are just plain fun to hate.  Every once in awhile, I find myself boo and hissing at events.\nlove the modern day cowboy\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Starzak', 'Christopher Sadler', 'Jay Grace', 'Lee Wilton', 'Seamus Malone', 'Jean-Philippe Vine', 'Richard Webber', 'Will Becher', 'Mike Mort', 'Dave Osmand'], 'Starring': ['John Sparkes', 'Justin Fletcher', 'Kate Harbour'], 'Studio': ['Aardman Animations']}\nLove Shaun the Sheep.  He IA always thinking.  He doesn't miss a beat, I hope you will be able to meet, Shaun the Sheep.  I love Shirley and Timmy too\nDont miss a beat, come watch Shaun the Sheep",
  "profile": "User Preferences Summary:\n\n- **Genres**: Maintains a strong preference for comedy and drama, with a particular focus on satire and clever humor related to political themes. Recent engagement with Westerns and suspense dramas reflects a broader interest in narrative-driven genres. Recent appreciation for animated content indicates an openness to diverse storytelling formats.\n\n- **Tone**: Enjoys shows that balance humor with critical perspectives on serious subjects, including politics and morality. Values character dynamics, especially lovable villains and the complexities of good versus evil, which are also evident in animated narratives.\n\n- **Content Sensitivity**: Engages comfortably with mature themes, including violence, substance use, and language, when presented in compelling narratives. This highlights a preference for gritty storytelling that remains entertaining, extending to animated and family-oriented content that offers depth.\n\n- **Viewing Purpose**: Seeks entertainment that is both amusing and reflective of real-world issues, revealing deeper social commentary. Enjoys narratives that evoke a range of emotions, such as tension, humor, and introspection, even in animated formats.\n\n- **Engagement Style**: Shows high enthusiasm for media featuring clever writing and robust character arcs, receiving strong positive ratings across comedies, dramas, and now animated series. This suggests a versatile genre appreciation that extends to intelligent storytelling in various formats.\n\nOverall, the user values insightful storytelling that encourages emotional involvement, whether delivered through humor, dramatic tension, or clever animation.",
  "metrics": {
    "rouge1_f": 0.18965517241379312,
    "rouge2_f": 0.01384083044982699,
    "rougeL_f": 0.09655172413793103,
    "meteor": 0.09034543844109832,
    "bleu1": 0.09047856710211388,
    "bleu2": 0.010262958128386988,
    "bleu3": 0.0023086926166397243,
    "bleu4": 0.0010959802911893024,
    "bertscore_precision": 0.352455198764801,
    "bertscore_recall": 0.4257393479347229,
    "bertscore_f1": 0.38564664125442505
  }
}