{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Spartacus: Gods Of The Arena - The Complete Collection [DVD]\nReview Date: 2012/02/13\nStore: John Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: You either love this Starz series or you hate it. I happend to love this prequel. I like the actors and I have watched the first season as well. Too bad that Andy Whitfield died of cancer because he was a great Spartacus. The prequel is about Crixus and Ganicus. I can't wair for season 2 to come out on DVD.\nReview Title: Spartacus\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Woman in Berlin\nNina Hoss  (Actor),     Evgeny Sidikhin  (Actor),     Max Faerberboeck  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Directed by Max Ferberbrock (Aimee & Jaguar) and based on an international bestselling diary. Berlin, 1945, women become the victims of the Red Army invasion. One of them, Anonyma, decides to look for an officer who can protect her. A complex symbiotic relationship develops between her and a Russian officer that will force them to remain enemies until the bitter end. In German and Russian with English subtitles.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.37 x 7.57 inches; 4 Ounces', 'Item model number': 'STDV2904DVD', 'Director': 'Max Faerberboeck', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Nina Hoss, Evgeny Sidikhin, Irm Hermann, Rudiger Vogler, Ulrike Krumbiegel', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Strand Home Video', 'Number of discs': '1'}\nthis was a great movie. i had read the book already twice, both in german and english. the movie is more enjoyable if you can at least understand german. but the english subtitles were sufficiant. the story is a true account of what happend to the city of Berlin at the end of WWII. my grandmother and her sisters and my mother and her mom expierienced the end of the war in Berlin and their story were similar. the book though also touches on the end how Berlin was rebuild out of ashes and roubles. there is even a man made mountain of rubble in Berlin which has a statue of a woman to honor the women of Berlin who helped rebuild the city. too bad that the movie does not portrait that part of the book.\ngreat movie\nHallmark The Courageous Heart of Irena Sendler Hall of Fame War\nRated:    PG    Format: Unknown Binding\nMovies & TV, Genre for Featured Categories, Kids & Family\n['The Courageous Heart of Irena Sendler Hallmar']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Media Format': \"DVD, Collector's Edition\", 'Studio': 'Hallmark'}\nthe Irena Sendler movie was definately worth purchasing. i am a great fan of Goran Visnjic and enjoyed his role in the movie. i had never heard of this ladies story and i was surprised that students in Kansas discovered her story. unbelievable the way Miss Sendler risked her life to rescue many Jewish children in the Warsaw Ghetto. it was wonderful to see that there were people courageous enough to risk their lives for the Jewish population. and i did love the happy ending even though Miss Sendler was sick from her imprisonment.\nThis Hallmark movie was great\nThe Grey Zone\nDavid Arquette  (Actor),     Velizar Binev  (Actor),     Tim Blake Nelson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product description', \"Based on the real-life events and featuring a first-rate ensemble cast, this compelling and harrowing film chronicles a unit of Auschwitz's Sonderkommando, a special squad of Jewish prisoners, who staged the only armed revolt that would ever take place at Auschwitz.\", 'Amazon.com', 'The title of Tim Blake Nelson\\'s harrowing drama of Jewish death camp prisoners who rise up against their captors to \"destroy the machinery\" refers as much to the compromise and cloudy morality of collaboration as to the gray world coated in the smoke and ash of the crematoriums. Inspired by real-life events at the Auschwitz death camp,', 'The Grey Zone', \"stars David Arquette as a soul-deadened laborer whose being fiercely jolts to life when he finds a young girl alive among the gassed corpses. He's the heart and soul of an outstanding cast that includes Steve Buscemi and Daniel Benzali as revolt leaders, Allan Corduner as the shunned camp doctor, and Harvey Keitel as the commandant. Nelson's rapid pacing, intimate shooting, and terse, jagged dialogue give the moral debate a discomforting immediacy as it races a deadline. When doom hangs in the air, sure death creates unique priorities.\", '--Sean Axmaker']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'David Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael StuhlbargDavid Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael Stuhlbarg  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.25 x 0.75 inches; 2.4 Ounces', 'Item model number': '2223629', 'Director': 'Tim Blake Nelson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 17, 2003', 'Actors': 'David Arquette, Velizar Binev, David Chandler, Michael Stuhlbarg, George Zlatarev', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lions Gate', 'Writers': 'Miklos Nyiszli, Tim Blake Nelson', 'Number of discs': '1'}\nI found the movie interesting but it won't be a movie a will watch over and over. it told the story of the crematorium worker who planned a rebellion. also it told the story of the girls who worked in the amunition factory and smuggled the explosives. the story about the little girl they found alive after a gassing was a bit strange. especially on the end where the SS shoots her. all in all they subject was well, but i just didn't enjoy the movie as much as i should have.\nInteresting\nHidden in Silence\nTom Radcliffe  (Actor),     Kellie Martin  (Actor),     Richard A. Colla  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Przemysl, Poland, WWII. Germany emerges victorious over the Russians, and the city comes under Nazi control. The Jewish are sent to the ghettos. While some stand silent, Catholic teenager Stefania Podgorska (portrayed by', \"ER's\", 'Kellie Martin', \"as Fusia) chooses the role of a savior and sneaks 13 Jews into her attic. Every day, she risks detection--and immediate execution--by smuggling food and water to the silent group living above her. And when two German nurses are assigned to her living quarters, the chances of discovery become dangerously high. This is the true story of a young woman's selfless commitment and unwavering resolve in the face of war.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.5 x 7.4 inches; 2.56 Ounces', 'Director': 'Richard A. Colla', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Tom Radcliffe, Kellie Martin', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nI watched the movie once on TV and I had to buy it to watch it from time to time. I like the main actress a lot. the story is a true story about a polish girl who helps her best friends family during the time of Nazi occupation. Her sister and her hide over 10 Jews in her addict for a long time. she goes to work every day to provide all the hidden Jews with food. She has to work very hard to find food for her friends. on the end of the movie her house will be for a short time a Wehrmacht head quarter and she still manages to keep her friends hidden and save. after the war she ends up marrying her childhood sweetheart's brother. great story about the courage of a young girl.\ngreat movie\nSpartacus: Gods Of The Arena - The Complete Collection [DVD]\nJohn Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Movies\n['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\n{'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nYou either love this Starz series or you hate it. I happend to love this prequel. I like the actors and I have watched the first season as well. Too bad that Andy Whitfield died of cancer because he was a great Spartacus. The prequel is about Crixus and Ganicus. I can't wair for season 2 to come out on DVD.\nSpartacus",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user has a strong affinity for historical dramas and narratives rooted in significant wartime events, emphasizing authenticity and cultural histories. They continue to explore storylines that highlight bravery and moral dilemmas, now showing an interest in series that mix entertainment with historical context.\n\n- **Language Proficiency:** They prefer original language content, especially in German, complemented by English subtitles, which aligns with their passion for foreign films and series closely connected to their interests.\n\n- **Cultural Connection:** A personal connection to Berlin's history enhances their taste for narratives that resonate with lived experiences related to WWII and its aftermath, as well as intriguing prequel stories that explore character backstories.\n\n- **Literary Background:** The user enjoys adapted literature with historical themes, demonstrating a willingness to engage with various media that reflect these interests.\n\n- **Rating Behavior:** They provide high ratings for content that resonates with them and have shown a discerning taste, as evidenced by their positive response to a recent prequel series, acknowledging its engaging performances.\n\n- **Emotional Engagement:** They value complex human relationships under duress and seek narratives that celebrate human resilience. Their recent interactions indicate a preference for bold storytelling with emotional depth, even in less nuanced portrayals.\n\nOverall, the user maintains a focus on depth, authenticity, and emotional resonance in their media experiences, particularly in real-life historical accounts and compelling character-driven narratives.",
  "metrics": {
    "rouge1_f": 0.10892448512585812,
    "rouge2_f": 0.005497022446174989,
    "rougeL_f": 0.05034324942791761,
    "meteor": 0.03342406240375698,
    "bleu1": 0.00013155171411381118,
    "bleu2": 3.347212923953059e-05,
    "bleu3": 4.9281715494754215e-06,
    "bleu4": 1.892631316289212e-06,
    "bertscore_precision": 0.3469887971878052,
    "bertscore_recall": 0.4831616282463074,
    "bertscore_f1": 0.4039067327976227
  }
}