{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hidden in Silence\nReview Date: 2011/04/09\nStore: Tom Radcliffe  (Actor),     Kellie Martin  (Actor),     Richard A. Colla  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Przemysl, Poland, WWII. Germany emerges victorious over the Russians, and the city comes under Nazi control. The Jewish are sent to the ghettos. While some stand silent, Catholic teenager Stefania Podgorska (portrayed by', \"ER's\", 'Kellie Martin', \"as Fusia) chooses the role of a savior and sneaks 13 Jews into her attic. Every day, she risks detection--and immediate execution--by smuggling food and water to the silent group living above her. And when two German nurses are assigned to her living quarters, the chances of discovery become dangerously high. This is the true story of a young woman's selfless commitment and unwavering resolve in the face of war.\"]\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.5 x 7.4 inches; 2.56 Ounces', 'Director': 'Richard A. Colla', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Tom Radcliffe, Kellie Martin', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nReview Text: I watched the movie once on TV and I had to buy it to watch it from time to time. I like the main actress a lot. the story is a true story about a polish girl who helps her best friends family during the time of Nazi occupation. Her sister and her hide over 10 Jews in her addict for a long time. she goes to work every day to provide all the hidden Jews with food. She has to work very hard to find food for her friends. on the end of the movie her house will be for a short time a Wehrmacht head quarter and she still manages to keep her friends hidden and save. after the war she ends up marrying her childhood sweetheart's brother. great story about the courage of a young girl.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Woman in Berlin\nNina Hoss  (Actor),     Evgeny Sidikhin  (Actor),     Max Faerberboeck  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Directed by Max Ferberbrock (Aimee & Jaguar) and based on an international bestselling diary. Berlin, 1945, women become the victims of the Red Army invasion. One of them, Anonyma, decides to look for an officer who can protect her. A complex symbiotic relationship develops between her and a Russian officer that will force them to remain enemies until the bitter end. In German and Russian with English subtitles.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.37 x 7.57 inches; 4 Ounces', 'Item model number': 'STDV2904DVD', 'Director': 'Max Faerberboeck', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Nina Hoss, Evgeny Sidikhin, Irm Hermann, Rudiger Vogler, Ulrike Krumbiegel', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Strand Home Video', 'Number of discs': '1'}\nthis was a great movie. i had read the book already twice, both in german and english. the movie is more enjoyable if you can at least understand german. but the english subtitles were sufficiant. the story is a true account of what happend to the city of Berlin at the end of WWII. my grandmother and her sisters and my mother and her mom expierienced the end of the war in Berlin and their story were similar. the book though also touches on the end how Berlin was rebuild out of ashes and roubles. there is even a man made mountain of rubble in Berlin which has a statue of a woman to honor the women of Berlin who helped rebuild the city. too bad that the movie does not portrait that part of the book.\ngreat movie\nHallmark The Courageous Heart of Irena Sendler Hall of Fame War\nRated:    PG    Format: Unknown Binding\nMovies & TV, Genre for Featured Categories, Kids & Family\n['The Courageous Heart of Irena Sendler Hallmar']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Media Format': \"DVD, Collector's Edition\", 'Studio': 'Hallmark'}\nthe Irena Sendler movie was definately worth purchasing. i am a great fan of Goran Visnjic and enjoyed his role in the movie. i had never heard of this ladies story and i was surprised that students in Kansas discovered her story. unbelievable the way Miss Sendler risked her life to rescue many Jewish children in the Warsaw Ghetto. it was wonderful to see that there were people courageous enough to risk their lives for the Jewish population. and i did love the happy ending even though Miss Sendler was sick from her imprisonment.\nThis Hallmark movie was great\nThe Grey Zone\nDavid Arquette  (Actor),     Velizar Binev  (Actor),     Tim Blake Nelson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product description', \"Based on the real-life events and featuring a first-rate ensemble cast, this compelling and harrowing film chronicles a unit of Auschwitz's Sonderkommando, a special squad of Jewish prisoners, who staged the only armed revolt that would ever take place at Auschwitz.\", 'Amazon.com', 'The title of Tim Blake Nelson\\'s harrowing drama of Jewish death camp prisoners who rise up against their captors to \"destroy the machinery\" refers as much to the compromise and cloudy morality of collaboration as to the gray world coated in the smoke and ash of the crematoriums. Inspired by real-life events at the Auschwitz death camp,', 'The Grey Zone', \"stars David Arquette as a soul-deadened laborer whose being fiercely jolts to life when he finds a young girl alive among the gassed corpses. He's the heart and soul of an outstanding cast that includes Steve Buscemi and Daniel Benzali as revolt leaders, Allan Corduner as the shunned camp doctor, and Harvey Keitel as the commandant. Nelson's rapid pacing, intimate shooting, and terse, jagged dialogue give the moral debate a discomforting immediacy as it races a deadline. When doom hangs in the air, sure death creates unique priorities.\", '--Sean Axmaker']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'David Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael StuhlbargDavid Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael Stuhlbarg  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.25 x 0.75 inches; 2.4 Ounces', 'Item model number': '2223629', 'Director': 'Tim Blake Nelson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 17, 2003', 'Actors': 'David Arquette, Velizar Binev, David Chandler, Michael Stuhlbarg, George Zlatarev', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lions Gate', 'Writers': 'Miklos Nyiszli, Tim Blake Nelson', 'Number of discs': '1'}\nI found the movie interesting but it won't be a movie a will watch over and over. it told the story of the crematorium worker who planned a rebellion. also it told the story of the girls who worked in the amunition factory and smuggled the explosives. the story about the little girl they found alive after a gassing was a bit strange. especially on the end where the SS shoots her. all in all they subject was well, but i just didn't enjoy the movie as much as i should have.\nInteresting\nHidden in Silence\nTom Radcliffe  (Actor),     Kellie Martin  (Actor),     Richard A. Colla  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Przemysl, Poland, WWII. Germany emerges victorious over the Russians, and the city comes under Nazi control. The Jewish are sent to the ghettos. While some stand silent, Catholic teenager Stefania Podgorska (portrayed by', \"ER's\", 'Kellie Martin', \"as Fusia) chooses the role of a savior and sneaks 13 Jews into her attic. Every day, she risks detection--and immediate execution--by smuggling food and water to the silent group living above her. And when two German nurses are assigned to her living quarters, the chances of discovery become dangerously high. This is the true story of a young woman's selfless commitment and unwavering resolve in the face of war.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.5 x 7.4 inches; 2.56 Ounces', 'Director': 'Richard A. Colla', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Tom Radcliffe, Kellie Martin', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nI watched the movie once on TV and I had to buy it to watch it from time to time. I like the main actress a lot. the story is a true story about a polish girl who helps her best friends family during the time of Nazi occupation. Her sister and her hide over 10 Jews in her addict for a long time. she goes to work every day to provide all the hidden Jews with food. She has to work very hard to find food for her friends. on the end of the movie her house will be for a short time a Wehrmacht head quarter and she still manages to keep her friends hidden and save. after the war she ends up marrying her childhood sweetheart's brother. great story about the courage of a young girl.\ngreat movie",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user maintains a strong affinity for historical dramas, particularly those focusing on significant wartime events that emphasize authentic narratives and cultural histories. Their recent engagement with storylines that highlight bravery and moral dilemmas amidst crises reaffirms this interest.\n\n- **Language Proficiency:** The user prefers original language content, particularly in German, complemented by English subtitles, showcasing a passion for foreign films that align with their interests.\n\n- **Cultural Connection:** A personal connection to Berlin’s history bolsters their taste for narratives that resonate with lived experiences related to WWII and post-war reconstruction.\n\n- **Literary Background:** They enjoy adapted literature, often exploring historical themes and lesser-known stories across various media.\n\n- **Rating Behavior:** The user tends to provide high ratings for content that resonates with their personal interests, although recent reviews indicate a nuanced emotional engagement, reflecting a discerning taste.\n\n- **Emotional Engagement:** They value complex human relationships in extreme circumstances. Their latest interaction reveals a deep appreciation for true stories about courage and selflessness, though they note limitations in emotional connection, indicating a thoughtful approach to the material.\n\nOverall, the user maintains a focus on depth, authenticity, and emotional resonance in their media choices, particularly in real-life historical accounts that celebrate human resilience during adversity.",
  "metrics": {
    "rouge1_f": 0.11505016722408028,
    "rouge2_f": 0.009377093101138647,
    "rougeL_f": 0.0588628762541806,
    "meteor": 0.039518652600245445,
    "bleu1": 0.0016202581502888875,
    "bleu2": 0.0003724081532772847,
    "bleu3": 6.199890834725036e-05,
    "bleu4": 2.5320682896892017e-05,
    "bertscore_precision": 0.33879518508911133,
    "bertscore_recall": 0.45856189727783203,
    "bertscore_f1": 0.3896837830543518
  }
}