{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 45 Years\nReview Date: 2017/06/09\nStore: Charlotte Rampling  (Actor),     Tom Courtenay  (Actor),     Andrew Haigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['Award-winning actors Charlotte Rampling (Swimming Pool) and Tom Courtenay (Doctor Zhviago) give career-defining performances in 45 Years. As Kate and Geoff prepare to celebrate their 45th wedding anniversary, their marriage is shaken when unexpected news threatens to change their lives. The body of his first love has been discovered, frozen and preserved in the icy glaciers of the Swiss Alps. By the time the party is upon them, five days later, there may not be a marriage left to celebrate.']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Charlotte Rampling, Andrew Haigh, Tom Courtenay, Geraldine James', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35375576', 'Director': 'Andrew Haigh', 'Media Format': 'NTSC', 'Release date': 'June 14, 2016', 'Actors': 'Charlotte Rampling, Tom Courtenay, Geraldine James', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: An exceptional film. If you cannot appreciate the small movements and the subtleties of changes in facial expressions, you will fail to see what an amazing film this is. Charlotte Rampling at her very best...so far.\nReview Title: you will fail to see what an amazing film this is\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Charlotte Rampling: The Look\nCharlotte Rampling  (Actor),     Angelina Maccarone  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['A biographical study of legendary actress Charlotte Rampling (Babylon A.D., Swimming Pool), told through her own conversations with artist friends and collaborators, including Peter Lindbergh, Paul Auster, and Juergen Teller. Intercut with footage from some of Rampling\\'s most famous films, this \"self-portrait through others\" is a revealing look at one of our most iconic screen stars.']\n{'Genre': 'Documentary/Biography, Special Interests', 'Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Contributor': 'Charlotte Rampling, Angelina Maccarone', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '25093537', 'Director': 'Angelina Maccarone', 'Media Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2012', 'Actors': 'Charlotte Rampling', 'Studio': 'Kino Lorber', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAbsolutely amazing film. If you are a fan of Charlotte Rampling, you'll love it, of course. But what she has to say has significance far beyond her own life. A must-see.\nAbsolutely amazing film. If you are a fan of Charlotte ...\nThe Statement\nMichael Caine  (Actor),     Tilda Swinton  (Actor),     Norman Jewison  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Veteran actor and two-time Oscar(r) winner Michael Caine stars with Tilda Swinton and Jeremy Northam in THE STATEMENT, a shocking and provoking thriller that delves into a fascinating chapter in modernevents! An ambitious Judge (Swinton) and an exacting Colonel (Jeremy Northam) re-open the sixty-year-old case of Pierre Brossard (Michael Caine), an escaped Nazi collaborator accused of murdering seven Jews. Now an old man living a sheltered life within the Catholic Church, Brossard is also being trailed by mysterious hit men, determined to kill him before he's arrested. When the Church shuts outBrossard to protect their dirty secret, it's a race against time, the government, and the hit men to discover whether justice will prevail or revenge will be served!\"]\n{'Genre': 'Thriller', 'Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, WidescreenMultiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen   See more', 'Contributor': 'John Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy NorthamJohn Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy Northam   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.32 Ounces', 'Item model number': '2225824', 'Director': 'Norman Jewison', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'April 27, 2004', 'Actors': 'Michael Caine, Tilda Swinton, Jeremy Northam, Alan Bates, John Neville', 'Subtitles': 'English', 'Producers': 'Robert Lantos, Norman Jewison', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThoroughly enjoyed this chase thriller. Good story, complex characters, good acting. The fact that Michael Caine's character wasn't entirely despicabledisturbed many viewers when the film was released, so it wasn't a hit at the box office and received some poor reviews. They should take another look now.\nThoroughly enjoyed this chase thriller\n45 Years\nCharlotte Rampling  (Actor),     Tom Courtenay  (Actor),     Andrew Haigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Award-winning actors Charlotte Rampling (Swimming Pool) and Tom Courtenay (Doctor Zhviago) give career-defining performances in 45 Years. As Kate and Geoff prepare to celebrate their 45th wedding anniversary, their marriage is shaken when unexpected news threatens to change their lives. The body of his first love has been discovered, frozen and preserved in the icy glaciers of the Swiss Alps. By the time the party is upon them, five days later, there may not be a marriage left to celebrate.']\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Charlotte Rampling, Andrew Haigh, Tom Courtenay, Geraldine James', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35375576', 'Director': 'Andrew Haigh', 'Media Format': 'NTSC', 'Release date': 'June 14, 2016', 'Actors': 'Charlotte Rampling, Tom Courtenay, Geraldine James', 'Studio': 'Paramount', 'Number of discs': '1'}\nAn exceptional film. If you cannot appreciate the small movements and the subtleties of changes in facial expressions, you will fail to see what an amazing film this is. Charlotte Rampling at her very best...so far.\nyou will fail to see what an amazing film this is",
  "profile": "The user continues to demonstrate a profound appreciation for documentary and biographical films that delve into the lives of significant cultural figures, particularly favoring the work of Charlotte Rampling. Their admiration for emotionally resonant storytelling and layered narratives is evident in their recent engagement with a film underscoring complex character dynamics, reinforcing their affinity for cinema that provides intellectual stimulation alongside emotional depth.\n\nThe latest interaction, highlighting a five-star rating for a drama featuring Rampling, emphasizes the user's ability to discern and appreciate subtle, powerful performances and intricate storytelling elements. They value films that convey deep emotions through nuanced character interactions, further solidifying their preference for poignant cinema. This interaction aligns seamlessly with their established patterns, suggesting a consistent taste for character-driven narratives that evoke thought and reflection.\n\nOverall, the user's evolving cinematic interests now encompass a rich tapestry of films that includes documentaries, biopics, and character-centric dramas, centered around themes of human experience and profound personal insights. Keywords defining their preferences continue to include: documentaries, significant cultural figures, poignant storytelling, emotional resonance, complex characters, and intellectual engagement.",
  "metrics": {
    "rouge1_f": 0.14090019569471623,
    "rouge2_f": 0.00980392156862745,
    "rougeL_f": 0.07045009784735812,
    "meteor": 0.04821300443781366,
    "bleu1": 0.0025724757280876694,
    "bleu2": 0.0009503250642696128,
    "bleu3": 0.00044293183504419057,
    "bleu4": 0.00023005292844849814,
    "bertscore_precision": 0.3307412266731262,
    "bertscore_recall": 0.46800094842910767,
    "bertscore_f1": 0.3875774145126343
  }
}