{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Grave of the Fireflies\nReview Date: 2019/08/07\nStore: Isao Takahata  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Anime & Manga\nProduct Description: [\"As the Empire of the Sun crumbles upon itself and a rain of firebombs falls upon Japan, the final death march of a nation is echoed in millions of smaller tragedies. This is the story of Seita and his younger sister Setsuko, two children born at the wrong time, in the wrong place, and now cast adrift in a world that lacks not the care to shelter them, but simply the resources. Forced to fend for themselves in the aftermath of fires that swept entire cities from the face of the earth, their doomed struggle is both a tribute to the human spirit and the stuff of nightmares. Beautiful, yet at times brutal and horrifying. Based on the retellings of survivor Nosaka Akiyuki and directed by Iaso Takahata (co-founder, with Hayao Miyazaki, of Japan's legendary Studio Ghibli,) Grave of the Fireflies has been universally hailed as an artistic and emotional tour de force. Now digitally remastered and restored, it is one of the rare films that truly deserves to be called a masterpiece.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'kids & family', 'Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Contributor': 'Isao Takahata', 'Language': 'English, Japanese', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 1.6 Ounces', 'Item model number': '26387168', 'Director': 'Isao Takahata', 'Media Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Release date': 'March 6, 2012', 'Subtitles': 'English', 'Studio': 'Section 23', 'Number of discs': '1'}\nReview Text: This is one of the saddest films I have ever seen. Very eye opening and different from any Miyazaki film I have watched. Be prepared with a box of tissues the first time you watch this film. The whole movie follows the effects of a war-torn city on two small children.\nReview Title: Devastatingly Great\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "A Ghost Story [DVD]\nCasey Affleck  (Actor),     Rooney Mara  (Actor),     David Lowery  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['This is the story of a ghost and the house he haunts.']\n{'Genre': 'Drama', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Kenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney MaraKenneisha Thompson, David Lowery, Adam Donaghey, James Johnston, Toby Halbrooks, McColm Cephas Jr., Casey Affleck, Rooney Mara  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 32 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'ghost-story', 'Director': 'David Lowery', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 3, 2017', 'Actors': 'Casey Affleck, Rooney Mara, McColm Cephas Jr., Kenneisha Thompson', 'Subtitles': 'Spanish', 'Producers': 'Adam Donaghey, Toby Halbrooks, James Johnston', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nI saw this movie in theaters and fell in love. It gives you this nostalgic feeling you just don’t get from many movies. Between the ambiance and music, it is truly haunting to watch. Be careful because you can find yourself in a sad mood at the end.\nNostalgic ambiance\nAngel: The Complete Series\nDavid Boreanaz  (Actor),     Alexis Denisof  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Monsters & Mutants\n['Product Description', '* ANGEL SEASON 1 (6 DISCS)', '* ANGEL SEASON 2 (6 DISCS)', '* ANGEL SEASON 3 (6 DISCS)', '* ANGEL SEASON 4 (6 DISCS)', '* ANGEL SEASON 5 (6 DISCS)', 'Amazon.com', 'Angel - Season One', \"He's hunky, he's brooding, he's a do-gooder, and he was Buffy's first boyfriend. Angel, the tortured vampire destined to walk the earth with a soul, got his own series after three seasons on Buffy the Vampire Slayerand did what any new star might do: he moved to L.A. (the City of Angels--get it?) and set up shop. Angel (co-created by Buffy mastermind Joss Whedon) finds the titular vampire (David Boreanaz) as a kind of supernatural private investigator, fighting evil one case at a time and, like his ex-girlfriend, keeping the world from getting destroyed by vengeful demons and such. This first season features guest appearances by various Buffy characters, including werewolf boy Oz (Seth Green), rogue slayer Faith (Eliza Dushku), deliciously evil vamp Darla (Julie Benz), and Buffy herself (Sarah Michelle Gellar), all of whom helped get the show off and running in style.\", 'Angel - Season Two', \"The second season of Angel, saw the cult vampire show finally stand on its own from Buffy the Vampire Slayer, assembling all the members of the show's core cast, transferring the action to a fashionably run-down L.A. hotel, and bringing in a few Buffy characters from Angel's history to further establish the moody vampire's own mythology. Moving their Angel Investigations to posher digs, Angel (David Boreanaz), Cordelia (Charisma Carpenter), and Wesley (Alexis Denisof) were soon joined by street fighter (J. August Richards)–-and by street fighter, of course we mean demon street fighter. But just as this group was solidifying, up popped Angel's old love, Darla (the fantastic Julie Benz), freshly arrived in L.A. from a hell dimension… just in time to be turned into a vampire again by her old cohort, Drusilla (Juliet Landau), and lure Angel into abandoning his newly formed team.\", 'Angel - Season Three', \"In the third season of Angel, the titular vampire with a soul was forced to stand alone thanks to the (temporary) death of his beloved Buffy and her show's move to a new network, with no crossover between the two allowed. He returns from seeking peace in a demon-haunted monastery to find the L.A. Angel Investigations team fighting supernatural crime in his absence. Fred is still haunted by the nightmare dimension from which they rescued her; Cordelia's visions get ever more painful and debilitating. The schemes of the evil law firm Wolfram and Hart become every more imaginative and dragon lady Lilah Morgan becomes even more of an enemy when lusting after Angel. Unbelievably, Darla, Angel's vampire sire and lover, turns up, pregnant with his child and is tortured by inexplicable motherly feelings as well as a raging thirst for human blood.\", 'Angel - Season Four', \"As the fourth season of Angel, starts, everything is still as we left it: Angel has been sunk to the bottom of the sea in an iron box by his inexplicable and vindictive son Connor and Cordelia has been summoned to higher realms to await orders. Gunn and Fred are left in the Hyperion Hotel, unsure about what has happened to their friends, and Lilah is working hard to seduce Wesley to the dark side. In the first few episodes, some of this is resolved but it's almost immediately replaced by far worse crises: prophesies of doom accumulate more rapidly even than usual in this wonderfully gloomy show and a horned rock-like beast rains fire on Los Angeles. This last year is Angel’s most tightly dramatic season yet--with a story arc of surprising intensity punctuated by the show's usual wit and sexiness.\", 'Angel - Season Five', \"Lives were upended--and some co-opted--in the fifth and final season of Angel, as the denizens of Angel Investigations found themselves taking on one of their scariest endeavors ever: corporate life. After making a literal deal with the devil (or something distinctly devil-like), Angel (David Boreanaz) moved his team from their crumbling hotel to the high-rise digs of law-firm-from-hell Wolfram & Hart, his reasoning being they could better fight the forces of evil from the inside, and with more resources to boot. Clever maneuvering or easy rationalization? Not a few members of Angel's team accused him of selling out (as did a number of viewers), but as with most of the show's previous four seasons, Angel somehow took a dubious premise and mined it for gold. And with one core cast member gone (Charisma Carpenter, whose Cordelia was immersed in a deep coma), it seemed as if the show, from within and without, would suddenly fall apart--that is, until Angel's longtime nemesis Spike (James Marsters) showed up, fresh from his sacrificial roasting at the series finale of Buffy the Vampire Slayer. Let the vampire games begin!\"]\n{'Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Contributor': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '16 hours and 30 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '80', 'Media Format': 'Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen, Dubbed, Box set', 'Run time': '16 hours and 30 minutes', 'Release date': 'October 12, 2010', 'Actors': 'David Boreanaz, Alexis Denisof, J. August Richards', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nThe case is beautiful. This was, and always will be, my favorite television series. It ended too soon, most likely due to a lack of good digital editing and cgi at the time.  The character developments and storylines were beautiful. It is not a surprise Joss Whedon went on to direct one of the most success franchises today.\nGreat package design for a great television series\nSPIRITED AWAY DVD\nRumi Hiiragi  (Actor),     Miyu Irino  (Actor),     Hayao Miyazaki  (Director, Writer),     Kirk Wise  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n[\"Winner of the Academy Award® for Best Animated Feature, Hayao Miyazaki's wondrous fantasy adventure is a dazzling masterpiece from one of the most celebrated filmmakers in the history of animation. Chihiro's family is moving to a new house, but when they stop on the way to explore an abandoned village, her parents undergo a mysterious transformation and Chihiro is whisked into a world of fantastic spirits ruled over by the sorceress, Yubaba. Put to work in a magical bathhouse for spirits and demons, Chihiro must use all her wits to survive in this strange new place, find a way to free her parents and return to the normal world. Overflowing with imaginative creatures and thrilling storytelling, Spirited Away became a worldwide smash hit, and is one of the most critically-acclaimed films of all time.\", 'Bonus Content:', 'Behind the Microphone', 'Behind the Microphone', 'Nippon Television Special', 'Nippon Television Special', 'Original Theatrical Trailers', 'Original Theatrical Trailers', 'TV Spots', 'TV Spots', ']]>']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'spirited-away', 'Director': 'Hayao Miyazaki, Kirk Wise', 'Media Format': 'Widescreen, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 17, 2017', 'Actors': 'Rumi Hiiragi, Miyu Irino, Mari Natsuki, Takashi Naito, Yasuko Sawaguchi', 'Dubbed': 'French, Japanese', 'Subtitles': 'French', 'Producers': 'Toshio Suzuki', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hayao Miyazaki', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love this movie, have seen it about five times. I have been wanting to watch some Ghibli films so I bought this with four other DVDs. Package itself was fine but the shrink wrap on the dvd split open, and the disc popped out of the tab and had been moving around inside the case. I have yet to watch the DVD but the disc looks fine and does not have any scratches.\nLovely movie for the whole family\nGrave of the Fireflies\nIsao Takahata  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n[\"As the Empire of the Sun crumbles upon itself and a rain of firebombs falls upon Japan, the final death march of a nation is echoed in millions of smaller tragedies. This is the story of Seita and his younger sister Setsuko, two children born at the wrong time, in the wrong place, and now cast adrift in a world that lacks not the care to shelter them, but simply the resources. Forced to fend for themselves in the aftermath of fires that swept entire cities from the face of the earth, their doomed struggle is both a tribute to the human spirit and the stuff of nightmares. Beautiful, yet at times brutal and horrifying. Based on the retellings of survivor Nosaka Akiyuki and directed by Iaso Takahata (co-founder, with Hayao Miyazaki, of Japan's legendary Studio Ghibli,) Grave of the Fireflies has been universally hailed as an artistic and emotional tour de force. Now digitally remastered and restored, it is one of the rare films that truly deserves to be called a masterpiece.\"]\n{'Genre': 'kids & family', 'Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Contributor': 'Isao Takahata', 'Language': 'English, Japanese', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 1.6 Ounces', 'Item model number': '26387168', 'Director': 'Isao Takahata', 'Media Format': 'Color, NTSC, Multiple Formats, Subtitled, Original recording remastered', 'Release date': 'March 6, 2012', 'Subtitles': 'English', 'Studio': 'Section 23', 'Number of discs': '1'}\nThis is one of the saddest films I have ever seen. Very eye opening and different from any Miyazaki film I have watched. Be prepared with a box of tissues the first time you watch this film. The whole movie follows the effects of a war-torn city on two small children.\nDevastatingly Great",
  "profile": "The user has reinforced their strong affinity for character-driven storytelling and profound emotional resonance, as demonstrated by their recent engagement with a film that highlights the impacts of war through the eyes of children. Their review indicates a deep emotional investment, describing the film as a devastating yet eye-opening experience, differing significantly from more mainstream works in the genre. This aligns with their established preference for narratives that evoke strong feelings and showcase the complexities of human experience.\n\nTheir commitment to quality production remains evident, as they appreciate artistic works that blend storytelling with high-quality execution. The user continues to seek out immersive experiences, demonstrating a particular interest in family-oriented narratives that also tackle challenging themes. They value unique voices in filmmaking, favoring intricate character arcs and atmospheric content that delve into profound themes. Overall, their profile reflects a continuous pursuit of artistic depth and emotional impact, underscoring their desire for stories that resonate on multiple levels and leave a lasting impression.",
  "metrics": {
    "rouge1_f": 0.0812470477090222,
    "rouge2_f": 0.007565011820330969,
    "rougeL_f": 0.04534718941898914,
    "meteor": 0.021879996633846672,
    "bleu1": 4.554259498398326e-07,
    "bleu2": 1.6147417656616218e-07,
    "bleu3": 2.4669275031672546e-08,
    "bleu4": 9.656177516221145e-09,
    "bertscore_precision": 0.3058866262435913,
    "bertscore_recall": 0.49653735756874084,
    "bertscore_f1": 0.3785633146762848
  }
}