{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/06/30\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Haifaa Al-Mansour'], 'Producers': ['Amy Baer', 'Alan Moloney', 'Ruth Coady'], 'Starring': ['Elle Fanning', 'Maisie Williams', 'Bel Powley'], 'Studio': ['IFC Films']}\nReview Text: This is one of the best movies I have seen in a long time. I had no idea of the inspiration behind Mary Shelley's book Frankestein. It is remarkable how this intellectually gifted woman through life hardships could develop such book and character. Movie offers great depth. The actors are also remarkable\nReview Title: I highly recommend it\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Penny Dreadful: The Complete Series\nRory Kinnear  (Actor),     Josh Hartnett  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n[\"Some of literature's most terrifying characters, including Dr. Frankenstein and his monster, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. They are joined by a core of original characters in a complex, frightening new narrative, where personal demons from the past can be stronger than vampires, evil spirits and immortal beasts. Relive every chilling episode of Showtime's Penny Dreadful if you dare.\"]\n{'Genre': 'Television, Horror/Television', 'Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Eva Green, Harry Treadaway, Rory Kinnear, Reeve Carney, Timothy Dalton, Josh Hartnett, Billie Piper', 'Language': 'English', 'Number Of Discs': '9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.74 Ounces', 'Media Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '24 hours and 22 minutes', 'Release date': 'July 18, 2017', 'Actors': 'Rory Kinnear, Josh Hartnett, Eva Green, Billie Piper, Harry Treadaway', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '9'}\nExcellent series. Really scary, superb acting and scenery. Too bad season 2 was too sexually graphic.\nGood series\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Haifaa Al-Mansour'], 'Producers': ['Amy Baer', 'Alan Moloney', 'Ruth Coady'], 'Starring': ['Elle Fanning', 'Maisie Williams', 'Bel Powley'], 'Studio': ['IFC Films']}\nThis is one of the best movies I have seen in a long time. I had no idea of the inspiration behind Mary Shelley's book Frankestein. It is remarkable how this intellectually gifted woman through life hardships could develop such book and character. Movie offers great depth. The actors are also remarkable\nI highly recommend it",
  "profile": "**Updated User Profile Summary:**\n\n- **Key Interests:** \n  - Deeply enjoys horror and suspense genres, particularly those related to classic literature figures, showcasing a fascination with historical contexts and character origins.\n  - Highly values strong performances and production quality in cinematic experiences, consistent with a preference for critically acclaimed films.\n\n- **Media Format Preference:** \n  - Continues to favor DVD boxed sets, reflecting a desire for comprehensive and uninterrupted viewing experiences.\n\n- **Viewing Preferences:**\n  - Appreciates narratives that blend original storytelling with classic horror themes, emphasizing character depth and intellectual discourse.\n  - Maintains a critical approach towards graphic content and excessive sexual themes, favoring balanced storytelling while demonstrating a tolerance for violence and foul language.\n\n- **Overall Sentiment:**\n  - Likely to offer positive feedback for well-executed productions; this recent interaction underscores a discerning taste that appreciates depth and artistry in narrative.\n\n- **Engagement Style:**\n  - Engages with content through platforms featuring detailed reviews and ratings, indicating a thoughtful and analytical approach toward media consumption. The recent review reflects a keen interest in understanding the artistic and historical inspirations behind narratives, reinforcing the user's preference for intellectually stimulating content within the horror genre.",
  "metrics": {
    "rouge1_f": 0.19797979797979798,
    "rouge2_f": 0.020283975659229212,
    "rougeL_f": 0.10909090909090909,
    "meteor": 0.07758648802098196,
    "bleu1": 0.07849114828816037,
    "bleu2": 0.014999218829337465,
    "bleu3": 0.0031872789653124233,
    "bleu4": 0.0014708108651648303,
    "bertscore_precision": 0.35995179414749146,
    "bertscore_recall": 0.42608654499053955,
    "bertscore_f1": 0.3902370035648346
  }
}