{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bohemian Rhapsody\nReview Date: 2019/03/26\nCategories: Drama, Arts, Entertainment, and Culture, Bold, Electrifying\nProduct Description: ['Bohemian Rhapsody celebrates the band Queen, their music, and their extraordinary lead singer Freddie Mercury, who defied convention to become one of the most beloved entertainers ever.']\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryan Singer'], 'Producers': ['Graham King', 'Jim Beach'], 'Starring': ['Rami Malek', 'Lucy Boynton', 'Gwilym Lee']}\nReview Text: It is a sanitized version of Mercury's life. Not so accurate based on some reviews but it was great fun to watch. I love Queen's music. I would watch it again\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Penny Dreadful: The Complete Series\nRory Kinnear  (Actor),     Josh Hartnett  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n[\"Some of literature's most terrifying characters, including Dr. Frankenstein and his monster, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. They are joined by a core of original characters in a complex, frightening new narrative, where personal demons from the past can be stronger than vampires, evil spirits and immortal beasts. Relive every chilling episode of Showtime's Penny Dreadful if you dare.\"]\n{'Genre': 'Television, Horror/Television', 'Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Eva Green, Harry Treadaway, Rory Kinnear, Reeve Carney, Timothy Dalton, Josh Hartnett, Billie Piper', 'Language': 'English', 'Number Of Discs': '9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.74 Ounces', 'Media Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '24 hours and 22 minutes', 'Release date': 'July 18, 2017', 'Actors': 'Rory Kinnear, Josh Hartnett, Eva Green, Billie Piper, Harry Treadaway', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '9'}\nExcellent series. Really scary, superb acting and scenery. Too bad season 2 was too sexually graphic.\nGood series\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Haifaa Al-Mansour'], 'Producers': ['Amy Baer', 'Alan Moloney', 'Ruth Coady'], 'Starring': ['Elle Fanning', 'Maisie Williams', 'Bel Powley'], 'Studio': ['IFC Films']}\nThis is one of the best movies I have seen in a long time. I had no idea of the inspiration behind Mary Shelley's book Frankestein. It is remarkable how this intellectually gifted woman through life hardships could develop such book and character. Movie offers great depth. The actors are also remarkable\nI highly recommend it\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Steven Spielberg', 'Amy Pascal', 'Kristie Macosko Krieger'], 'Starring': ['Meryl Streep', 'Tom Hanks', 'Sarah Paulson'], 'Studio': ['20th Century Fox']}\nA very self serving account. I read an article from the NY times debating the facts related in the movie. Nevertheless, it is a refreshing story of courage. I guess feminism is in vogue so the movie caters to it. I felt movie was very slow, making a bit boring on some portions.\nNot very impressed\nBohemian Rhapsody\nDrama, Arts, Entertainment, and Culture, Bold, Electrifying\n['Bohemian Rhapsody celebrates the band Queen, their music, and their extraordinary lead singer Freddie Mercury, who defied convention to become one of the most beloved entertainers ever.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryan Singer'], 'Producers': ['Graham King', 'Jim Beach'], 'Starring': ['Rami Malek', 'Lucy Boynton', 'Gwilym Lee']}\nIt is a sanitized version of Mercury's life. Not so accurate based on some reviews but it was great fun to watch. I love Queen's music. I would watch it again\nGreat movie",
  "profile": "**Updated User Profile Summary:**\n\n- **Key Interests:** \n  - Deeply enjoys horror and suspense genres, particularly those related to classic literature figures, with a fascination for historical contexts and character origins.\n  - Recently expanded interest to biographical dramas, especially those highlighting influential figures, while maintaining a focus on themes of artistry and cultural impact.\n\n- **Media Format Preference:** \n  - Continues to favor DVD boxed sets, reflecting a desire for comprehensive and uninterrupted viewing experiences.\n\n- **Viewing Preferences:**\n  - Appreciates narratives blending original storytelling with classic horror themes, emphasizing character depth and intellectual discourse. Shows an openness to biographical films that celebrate musical legends, provided they maintain quality storytelling.\n  - Maintains a critical stance on narrative pacing and accuracy, with a tendency to find slower narratives less engaging. Prefers balanced storytelling and aversion to excessive graphic content or overt sexual themes.\n\n- **Overall Sentiment:**\n  - Likely to provide constructive feedback; recent interactions highlight a discerning taste that recognizes artistic merit while remaining critical of narrative authenticity, especially in biographical content.\n\n- **Engagement Style:**\n  - Engages with content through platforms featuring detailed reviews and ratings, demonstrating a thoughtful, analytical approach to media consumption. Recent reviews reflect flexibility in appreciating various genres while still valuing intellectual stimulation and narrative integrity.",
  "metrics": {
    "rouge1_f": 0.15804597701149425,
    "rouge2_f": 0.011527377521613832,
    "rougeL_f": 0.07183908045977011,
    "meteor": 0.06561444783921655,
    "bleu1": 0.0308275191560652,
    "bleu2": 0.0038311150064482364,
    "bleu3": 0.0008885566325197964,
    "bleu4": 0.00042834136963500863,
    "bertscore_precision": 0.35243335366249084,
    "bertscore_recall": 0.42857643961906433,
    "bertscore_f1": 0.38679319620132446
  }
}