{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/07/10\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Steven Spielberg', 'Amy Pascal', 'Kristie Macosko Krieger'], 'Starring': ['Meryl Streep', 'Tom Hanks', 'Sarah Paulson'], 'Studio': ['20th Century Fox']}\nReview Text: A very self serving account. I read an article from the NY times debating the facts related in the movie. Nevertheless, it is a refreshing story of courage. I guess feminism is in vogue so the movie caters to it. I felt movie was very slow, making a bit boring on some portions.\nReview Title: Not very impressed\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Penny Dreadful: The Complete Series\nRory Kinnear  (Actor),     Josh Hartnett  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n[\"Some of literature's most terrifying characters, including Dr. Frankenstein and his monster, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. They are joined by a core of original characters in a complex, frightening new narrative, where personal demons from the past can be stronger than vampires, evil spirits and immortal beasts. Relive every chilling episode of Showtime's Penny Dreadful if you dare.\"]\n{'Genre': 'Television, Horror/Television', 'Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Eva Green, Harry Treadaway, Rory Kinnear, Reeve Carney, Timothy Dalton, Josh Hartnett, Billie Piper', 'Language': 'English', 'Number Of Discs': '9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.74 Ounces', 'Media Format': 'AC-3, Box set, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '24 hours and 22 minutes', 'Release date': 'July 18, 2017', 'Actors': 'Rory Kinnear, Josh Hartnett, Eva Green, Billie Piper, Harry Treadaway', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '9'}\nExcellent series. Really scary, superb acting and scenery. Too bad season 2 was too sexually graphic.\nGood series\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Haifaa Al-Mansour'], 'Producers': ['Amy Baer', 'Alan Moloney', 'Ruth Coady'], 'Starring': ['Elle Fanning', 'Maisie Williams', 'Bel Powley'], 'Studio': ['IFC Films']}\nThis is one of the best movies I have seen in a long time. I had no idea of the inspiration behind Mary Shelley's book Frankestein. It is remarkable how this intellectually gifted woman through life hardships could develop such book and character. Movie offers great depth. The actors are also remarkable\nI highly recommend it\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Spielberg'], 'Producers': ['Steven Spielberg', 'Amy Pascal', 'Kristie Macosko Krieger'], 'Starring': ['Meryl Streep', 'Tom Hanks', 'Sarah Paulson'], 'Studio': ['20th Century Fox']}\nA very self serving account. I read an article from the NY times debating the facts related in the movie. Nevertheless, it is a refreshing story of courage. I guess feminism is in vogue so the movie caters to it. I felt movie was very slow, making a bit boring on some portions.\nNot very impressed",
  "profile": "**Updated User Profile Summary:**\n\n- **Key Interests:** \n  - Deeply enjoys horror and suspense genres, particularly those related to classic literature figures, with a fascination for historical contexts and character origins.\n  - Values strong performances and production quality, maintaining a preference for critically acclaimed films while showing a thoughtful engagement with themes such as feminism and social issues.\n\n- **Media Format Preference:** \n  - Continues to favor DVD boxed sets, reflecting a desire for comprehensive and uninterrupted viewing experiences.\n\n- **Viewing Preferences:**\n  - Appreciates narratives blending original storytelling with classic horror themes, emphasizing character depth and intellectual discourse.\n  - Maintains a critical stance on narrative pacing, demonstrating a tolerance for complex themes but a tendency to find slower films less engaging. Expresses an aversion to excessive graphic content and sexual themes, favoring balanced storytelling.\n\n- **Overall Sentiment:**\n  - Likely to provide constructive feedback; recent interactions highlight a discerning taste that recognizes artistic merit while remaining critical of pacing and perceived self-serving narratives.\n\n- **Engagement Style:**\n  - Engages with content through platforms featuring detailed reviews and ratings, demonstrating a thoughtful, analytical approach to media consumption. The recent review reflects a keen interest in understanding the complexities of narrative themes, confirming the user's preference for intellectually stimulating content while being open to constructive criticism of execution.",
  "metrics": {
    "rouge1_f": 0.1773399014778325,
    "rouge2_f": 0.013179571663920921,
    "rougeL_f": 0.08866995073891625,
    "meteor": 0.07062438430877079,
    "bleu1": 0.05650947281473078,
    "bleu2": 0.010008603742608684,
    "bleu3": 0.002073327164124918,
    "bleu4": 0.0009445648906153073,
    "bertscore_precision": 0.359214723110199,
    "bertscore_recall": 0.42277103662490845,
    "bertscore_f1": 0.38841012120246887
  }
}