{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: VeSunny 20\" Remy Keratin Tip Hair Extensions Blonde Human Hair 1G/S #60 Platinum Blonde Pre Bonded Flat Tip Human Hair Extensions 50 Strands\nReview Date: 2019/04/28\nStore: Ve Sunny\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Fusion', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '798863458884'}\nReview Text: Love this hair. It does require some additional toning if ur looking for that icy blonde color. And requires deep conditioning but I love this hair. Great for someone looking for some added length and thickness\nReview Title: Love these\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Moresoo 18inch Tape in Hair Extensions Human Hair Blonde Hair Real Human Hair 20pcs 50g Remy Human Hair Extensions Tape on Balayage #6 Brown to Blonde #60 Glue on Hair Seamless Skin Weft Hair\n{'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.49 x 5 x 1.89 inches; 1.76 Ounces', 'UPC': '711931080862'}\nLove love love this company love the hair. I use a little bit of blonde shampoo to keep the color nice and bright. Love it. Ive been doing extensions for nearly 12 years and these are some of the best in this price point.\nAmaaaaazing hairr omgg\nFull Shine 18\" Tape in Remy Human Hair Extensions Tape Ombre Extensions Dip Dyed Color #8 Ash Brown Fading to #60 and #18 Ash Blonde Highlighted Extensions 20 Pcs 50gram Per Package\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.6 x 5 x 2 inches; 3.21 Ounces', 'UPC': '734602042013'}\nThis color is very hard to find. Very blendable and soft. I would def recommend two or three packs for a full head of extensions.\nColor is perfect\nVeSunny 20\" Remy Keratin Tip Hair Extensions Blonde Human Hair 1G/S #60 Platinum Blonde Pre Bonded Flat Tip Human Hair Extensions 50 Strands\nVe Sunny\n{'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Fusion', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '798863458884'}\nLove this hair. It does require some additional toning if ur looking for that icy blonde color. And requires deep conditioning but I love this hair. Great for someone looking for some added length and thickness\nLove these",
  "profile": "**User Summary:**\n\n- **Hair Preference:** Strong preference for high-quality human hair extensions, particularly in blonde hues and blendable colors.\n- **Experience Level:** Has significant experience (12 years) with hair extensions, exhibiting familiarity with various product ranges and installation techniques.\n- **Product Type:** Favors seamless, tape-in, and fusion extensions for their ease of use, natural appearance, and blendability.\n- **Recent Purchases:** Recently acquired extensions in versatile shades, including ombre options that transition from ash brown to blonde, and platinum blonde extensions, highlighting an ongoing interest in unique color variations.\n- **Maintenance:** Employs specific hair care products (like blonde shampoo and deep conditioning treatments) to uphold color vibrancy and hair texture, showcasing a commitment to meticulous maintenance standards.\n- **Quality Focus:** Prioritizes quality at a reasonable price, consistently seeking products that deliver exceptional performance and enhance aesthetic appeal.\n- **Overall Satisfaction:** Regularly provides high ratings for products, indicating satisfaction with performance, with a particular emphasis on qualities such as softness, blendability, and overall look; shares positive feedback about products requiring minor adjustments (like toning) to achieve desired aesthetics.\n\nThis profile illustrates a user who values high-quality, aesthetically pleasing extensions while maintaining a focus on color versatility and ease of maintenance.",
  "metrics": {
    "rouge1_f": 0.28215767634854777,
    "rouge2_f": 0.05416666666666667,
    "rougeL_f": 0.14522821576763487,
    "meteor": 0.1534063273727648,
    "bleu1": 0.188707357188719,
    "bleu2": 0.04366132783611429,
    "bleu3": 0.00784731023253648,
    "bleu4": 0.0033299688408111217,
    "bertscore_precision": 0.3954275846481323,
    "bertscore_recall": 0.446274071931839,
    "bertscore_f1": 0.41931504011154175
  }
}