{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sunny 40pcs 100g 16inch Tape in Colored Hair Extensions Dark Brown Fade to Honey Blonde Balayage Double Weft Tape in Hair Extensions Real Human Hair\nReview Date: 2019/08/08\nStore: Sunny Beauty\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Sunny Beauty', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Tape', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16 x 1 x 1 inches; 3.52 Ounces', 'UPC': '639631413158'}\nReview Text: My clients love this hair. The downfall is that is does shed but even extensions twice as much $$ shed. They do get dry so I would recommend using a leave in conditioner on them. I do re-tape them with babe tape for extra hold. These are re.usable if properly cared for. The color is very blend-able and natural.\nReview Title: Love this hair.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Moresoo 18inch Tape in Hair Extensions Human Hair Blonde Hair Real Human Hair 20pcs 50g Remy Human Hair Extensions Tape on Balayage #6 Brown to Blonde #60 Glue on Hair Seamless Skin Weft Hair\n{'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.49 x 5 x 1.89 inches; 1.76 Ounces', 'UPC': '711931080862'}\nLove love love this company love the hair. I use a little bit of blonde shampoo to keep the color nice and bright. Love it. Ive been doing extensions for nearly 12 years and these are some of the best in this price point.\nAmaaaaazing hairr omgg\nFull Shine 18\" Tape in Remy Human Hair Extensions Tape Ombre Extensions Dip Dyed Color #8 Ash Brown Fading to #60 and #18 Ash Blonde Highlighted Extensions 20 Pcs 50gram Per Package\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.6 x 5 x 2 inches; 3.21 Ounces', 'UPC': '734602042013'}\nThis color is very hard to find. Very blendable and soft. I would def recommend two or three packs for a full head of extensions.\nColor is perfect\nVeSunny 20\" Remy Keratin Tip Hair Extensions Blonde Human Hair 1G/S #60 Platinum Blonde Pre Bonded Flat Tip Human Hair Extensions 50 Strands\nVe Sunny\n{'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Fusion', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '798863458884'}\nLove this hair. It does require some additional toning if ur looking for that icy blonde color. And requires deep conditioning but I love this hair. Great for someone looking for some added length and thickness\nLove these\nVeSunny 16inch #4 Dark Brown Remy Tape in Hair Extensions Human Hair 20pcs 100% Remy Tape in Hair Extensions 50g Per Pack 20pcs\nVe Sunny\n{'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16 x 1 x 1 inches; 1.76 Ounces', 'UPC': '799577978088'}\nBeautiful hair. Great quality. It does shed a lot but stays in well for about five to six weeks. Great for a temporary longer thicker look. Would highly recommend.\nGreat hair\nSunny 40pcs 100g 16inch Tape in Colored Hair Extensions Dark Brown Fade to Honey Blonde Balayage Double Weft Tape in Hair Extensions Real Human Hair\nSunny Beauty\n{'Brand': 'Sunny Beauty', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Tape', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16 x 1 x 1 inches; 3.52 Ounces', 'UPC': '639631413158'}\nMy clients love this hair. The downfall is that is does shed but even extensions twice as much $$ shed. They do get dry so I would recommend using a leave in conditioner on them. I do re-tape them with babe tape for extra hold. These are re.usable if properly cared for. The color is very blend-able and natural.\nLove this hair.",
  "profile": "**User Summary:**\n\n- **Hair Preference:** Strong preference for high-quality human hair extensions, particularly in blonde hues and blendable colors, with an established interest in darker shades, as evidenced by recent purchases.\n  \n- **Experience Level:** Possesses significant experience (12 years) with hair extensions, demonstrating familiarity with diverse product ranges and installation techniques.\n\n- **Product Type:** Prefers seamless, tape-in, and fusion extensions for their ease of use and natural appearance. Recent acquisitions include extensions with balayage effects, indicating a continued pursuit of unique color variations.\n\n- **Recent Purchases:** Notably acquired colored extensions that transition from dark brown to honey blonde, reflecting an interest in versatility and aesthetics. This indicates a willingness to experiment with innovative color combinations.\n\n- **Maintenance:** Employs specific hair care practices, including the use of leave-in conditioners and re-taping extensions, illustrating dedication to upkeep and enhancement of hair quality.\n\n- **Quality Focus:** Consistently prioritizes high-quality products at reasonable prices. Although some products may shed, the user appreciates their performance and blendability, focusing on extensions that can be reused with proper care.\n\n- **Overall Satisfaction:** Provides favorable ratings for products, highlighting satisfaction with aspects such as softness and blendability while acknowledging minor maintenance needs. This suggests an ongoing commitment to finding extensions that offer both visual appeal and durability. \n\nThis profile indicates a user who is enthusiastic about exploring color versatility in extensions while maintaining high standards for quality and care.",
  "metrics": {
    "rouge1_f": 0.252400548696845,
    "rouge2_f": 0.04126547455295736,
    "rougeL_f": 0.11522633744855969,
    "meteor": 0.10950632895158706,
    "bleu1": 0.08863555379959037,
    "bleu2": 0.018822307415580296,
    "bleu3": 0.0032872248484744015,
    "bleu4": 0.0013749126550955918,
    "bertscore_precision": 0.3804774880409241,
    "bertscore_recall": 0.4440116286277771,
    "bertscore_f1": 0.4097966253757477
  }
}