{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nReview Date: 2020/06/26\nStore: Sdara Skincare\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nReview Text: Seriously there’s nothing better on a sunburn than Aloe Vera.  It’s natural and won’t harm your skin.  This aloe has a clear color so there’s no artificial dyes contained in this gel.  Just pure headlining and soothing properties.  I feel for the size of the bottle, it’s a great bargain and it’s effective.\nReview Title: Cooling Natural Aloe Vera\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Gents of London Design Paste Matt Firm Hold Professional Hair Styling Wax (3 oz)\nGENTS OF LONDON\n{'Hair Type': 'All', 'Scent': 'Aloe', 'Liquid Volume': '3 Fluid Ounces', 'Item Form': 'Wax', 'Brand': 'GENTS OF LONDON'}\nThis hair paste is awesome! for the price, it almost even out performs some way more expensive hair products! I used to use Paul Mitchell hair paste, but this is probably going to be my go to now.<br /><br />This stuff does have somewhat of a smell, but it smells sort of like the original old spice.  It's not too strong though, but if you want something scentless, then you may wanna try something else.\nSmells Kinda like Old Spice\nSdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nSdara Skincare\n{'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nSeriously there’s nothing better on a sunburn than Aloe Vera.  It’s natural and won’t harm your skin.  This aloe has a clear color so there’s no artificial dyes contained in this gel.  Just pure headlining and soothing properties.  I feel for the size of the bottle, it’s a great bargain and it’s effective.\nCooling Natural Aloe Vera",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Preference:** The user prioritizes effective hair styling products, favoring professional-grade items that provide a firm hold. They demonstrate a tendency to switch from higher-priced brands to more affordable alternatives that deliver similar results.\n\n- **Scent Sensitivity:** The user shows a moderate tolerance for scents, preferring subtle fragrances. Their recent purchase indicates an appreciation for natural scents, as evidenced by their positive response to Aloe Vera's mild aroma.\n\n- **Brand Loyalty:** The user exhibits flexibility in brand allegiance, illustrating a willingness to explore new products based on performance rather than brand loyalty alone. This behavior is further reflected in their choice to opt for an organic product, signaling an openness to high-quality, natural items.\n\n- **Value-Consciousness:** The user values good quality and effectiveness, as demonstrated by their recent purchase, which they deemed a great bargain for the size and efficacy. They are inclined to switch to products that offer superior quality at a better price, showing a budget-conscious approach to personal care.\n\nOverall, the user values performance and quality in their personal care products, displaying a flexible approach to scents and brands, alongside a strong emphasis on effective, value-driven choices.",
  "metrics": {
    "rouge1_f": 0.24367816091954023,
    "rouge2_f": 0.03233256351039262,
    "rougeL_f": 0.11494252873563218,
    "meteor": 0.16056261232638563,
    "bleu1": 0.18357257872654212,
    "bleu2": 0.06180967182788666,
    "bleu3": 0.028360643047975094,
    "bleu4": 0.00909368367450876,
    "bertscore_precision": 0.397035151720047,
    "bertscore_recall": 0.4404526948928833,
    "bertscore_f1": 0.4176184833049774
  }
}