{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 21Pcs Dip Powder Nail Kit - Aubss 10 Colors Dip Nail Kit, Neutral Skin Tone Dipping Powder Colors Kit, Dip Powder for French Nail Art Nail Manicure Kit Salon DIY Home, No Nail Lamp Needed\nReview Date: 2021/11/24\nStore: AUBSS\nAverage Rating: 3.7\nProduct Details: {'Material': 'Acrylic', 'Brand': 'AUBSS', 'Included Components': 'Dip Powder', 'Item Form': 'Powder', 'Product Dimensions': '8.94 x 8.23 x 1.73 inches; 1.29 Pounds'}\nReview Text: Nice looking nails. Easy instructions and easy to use.  Makes acrylic-like nails easy at home.  Unlike traditional nails, these wear very well, and don't chip or flake off<br /><br />In the attached photo I have my nail I've had for over a week, and though my nail is beginning to grow out, the color itself if still holding fast\nReview Title: Makes nice looking nails\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Philips Norelco T980 Turbo Vacuum Trimmer\nPhilips Norelco\n['Product Description', \"Philips Norelco's T980 Turbo Vacuum Trimmer lets you keep your beard and mustache perfectly groomed without the mess. The T980's power vacuum and turbo power switch means the most suction ever - guaranteed - for no mess. The unique AccuControl system with flexing guide comb adjusts to facial contours for even and comfortable trimming. Find the look that's right for you with the patented zoom lock that adjusts among 9 different settings to accommodate your style. Features a comfortable ergonomic design and self-sharpening blades. Includes a specialty mini trimmer and travel/storage pouch.\", 'Amazon.com', 'The Philips Norelco T980 Rechargeable Turbo Vacuum Trimmer is equipped to conveniently deliver a superior trimming performance. A powerful vacuum delivers suction power, while hair deflector captures hair for no clean up. A transparent hair chamber makes it easy to see when the trimmer needs to be emptied for optimal performance. A turbo power switch boosts cutting and fan speed by 30-percent for significantly increased suction power. Revolutionary SteelWave self-sharpening blades ensure a precise and even trim every time. Other features include 9 lockable length settings, rechargeable battery, and cordless operation for maximum freedom of movement. The Trimmer also comes with a contour following comb and a specialty mini-beard trimmer attachment, allowing for precise trimming of beard line, moustache, and sideburns.']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 8 inches; 2 Pounds', 'Item model number': 'T980', 'UPC': '075020187543', 'Manufacturer': 'Philips Norelco'}\nThis is a great way to trim your beard. A definite step up from traditional trimmers. The magic in it is the vacuum that captures and stores trimmed beard and mustache hair instead of letting it fall into your sink to make a mess. You don't make your lady mad, and everyone is happy.<br /><br />The trimmer itself fits comfortably in your hand. It has an detachable cord that allows the unit to be charged. It can operate on the cord or off it's batteries for cordless use. The trimmer is NOT submersible.<br /><br />The attached guard can be adjusted to 9 length settings with a rotating selector. It can also be taken off for trimming necklines or other areas. There is also a separate smaller attachment that can be used for precision cuts.<br /><br />The vacuum is power and made more powerful over earlier models through the use of the \"Turbo\" button that amps up the cutting power and vacuum power substantially.  When you are done cutting your hairs are captured in a removable tray for disposal. There are still a few hairs that don't get sucked up but it a huge improvement over using trimmers without suction.<br /><br />The only negatives are that the hair capture cup is a tad small. There is also a plastic piece that guides hair into the cup that makes neck and cheek-line trimming a little tricky until you get the hang of it.<br /><br />Overall a great trimmer for those of us real men with beards. A must have!!\nA great way to trim your beard!\nPhilips Norelco QC5055 Power Hair Clipper\nPHILIPS\n['Product Description', \"Philips Norelco's Power Hair Clipper cuts normal, coarse and curly hair. The turbo power option can be turned on when hair is more difficult to get through. This easy-to-use hair clipper brings simplicity to you life, giving you all the options without all the pieces. Three hair clipper combs provide 15 length options (up to 1-3/5 inch long), while the no slip grip ensures that the Philips Norelco Power Hair Clipper cuts exactly where it should--with or without a cord. Attachments can be rinsed clean with some running water and blades are self-sharpening, needing only minimal maintenance.\", 'Amazon.com', \"100% turbo power. Cuts all hair types. The Philips Power Clipper gives you the power of a corded clipper with all the benefits of a rechargable one. Thanks to its powerful motor and battery, it is suited to cut all hair types with ease--even coarse, curly and thick hair. The clipper can be used both cordless -for up to 35 minutes of running time- and corded. It comes with a special comb for that almost bald look. As with all Philips hair clippers, there aren't extra pieces to juggle: this clipper has simply two integrated guide combs that adjust to cover all hair lengths up to 1 3/5in. Once a length is selected, the guide comb is locked to ensure a clean and even haircut. Cleaning is easy, fast and hygienic as this clipper's cutting unit can be rinsed under the tap.\", 'Technology Explained', 'Best performance that feels great', 'Safely cleans under the tap', 'Quick and easy thanks to the unique bayonet fixture.', 'SteelWave self-sharpening blades for precise results', 'Revolutionary wave-shaped, self-sharpening blades channel and cut hair for a precise and even result.', 'Create the look you want', '14 integrated length settings up to 41mm', 'Select and locks your desired length within a versatile range of possible lengths.', 'Short length comb to cut your hair to 1.6mm', 'A dedicated comb to cut your head hair for an extra short hair style.', 'Brings maximum ease of use', 'Ultra silent to keep children calm', 'Provides optimal power', 'Extra powerful battery for easily cutting all hair types', 'Perfectly balanced for optimal control and handling', 'Specifications', 'Guarantee', '2-year worldwide guarantee Yes', 'Power system', 'Charging time 10 hour(s) Operating time 35 minute(s) Rechargeable - Cord/Cordless Corded or cordless operation', 'Accessories', 'Cleaning brush Yes Charger Yes', 'Cutting system', 'Steelwave technology Yes Cutter width 41 mm Lubrication for life Yes', 'Design', 'Extra powerful design Yes']\n{'Recommended Uses For Product': 'Clipping', 'Color': 'Black', 'Hair Type': 'All', 'Brand': 'PHILIPS', 'Power Source': 'Corded Electric', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '3.34 x 6.57 x 9.64 inches; 1.2 Pounds', 'Item model number': 'QC5055', 'UPC': '075020007575', 'Manufacturer': 'Philips Norelco'}\nMy wife is a professional hair stylist. She cuts my hair every 2-3 weeks and relies heavily on using electric shears to do so.  This unit works very well. It can work plugged in, or with battery, which should give you about 40 minutes of time per charge.<br /><br />The shears are sharp and do a great job of cutting through my thick hair. The attachments are also very nice. Unlike other units that have 6 or 7 different guards depending on what you want to do. It has a fixed length one, a short variable one, and a long variable one. For my hair she used the short variable one.  The settings go from 1/16 of a inch up to about 3/4 inch, and the long variable one goes up from there.<br /><br />Having the variable length guards is great as it reduces the number of guards you need and allows you to change lengths on the fly.<br /><br />Using the shears without the guard is also good for trimming to the skinline, edging and shaping.<br /><br />The only complaint my wife had is that she wishes it were a little more powerful on battery, but wasn't really lacking in power, it is just that she usually uses professional shears. This unit is actually as powerful or more powerful than most shears you buy at walmart or the like.<br /><br />Overall a great shear for home hair cutting.\nGreat hair cutter, easy to use.\nJack Black MP 10 Nourishing Oil, 2 Fl Oz\n{'Brand': 'Jack Black', 'Scent': 'Watermelon, Argan Oil', 'Item Form': 'Oil', 'Active Ingredients': 'argan_oil', 'Unit Count': '2 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.71 x 0.71 x 4.49 inches; 1.6 Ounces', 'Item model number': '4053', 'Department': 'Men', 'UPC': '885790453232 682223040539 885790555219 885310433744', 'Manufacturer': 'Jack Black', 'Country of Origin': 'USA', 'Domestic Shipping': 'Item can be shipped within U.S.', 'International Shipping': 'This item is not eligible for international shipping.  Learn More'}\nI have a big fluffy beard. Unfortunately in the winter, it more resembles a brillo pad in texture and I sometimes look like a homeless person.<br /><br />This oil works well to condition and treat your beard, and the skin underneath. I apply it right out of the shower after towel drying my beard while it is still damp. I use three squirts of oil, placed in my palm, run my hands together and massage into my beard. It keeps my beard soft and supple all day, and treats the skin underneath to stop dryness and itching.<br /><br />I almost thought of trimming my magnificent beard down because it was so rough, and it was itchy, this is allowing me to continue to grow it.<br /><br />My beard hair is soft, manageable, and free of knots.<br /><br />The glass bottle is heavy duty, so you can take it when you travel.<br /><br />My ONLY complaint is the cost. It's pretty expensive, but I think a bottle would last you 2 months or so, but it's still a pretty hefty price to pay for a soft and manageable beard, free of itchiness.\nThis is nice oil. Works very well as a beard oil.\nsdoot Misting Spray Bottle, 2 Pack 200ml Plasitc Plant Spray Bottle Refillable Clear Mist Bottle Sprayer for Hair, Cleaning\nsdoot\n{'Brand': 'sdoot', 'Material': 'Plastic', 'Capacity': '200 Milliliters', 'Number of Items': '2', 'Special Feature': 'Lightweight, Mist Spray'}\nThese worked great the first three times I sprayed my plants.  Then they broke. Junk.\nbroke after 3 uses\nBeeTheLight Pure Castile Soap - 12 small Bars - Choose from Peppermint, Orange Citrus, Lavender, or Unscented - Made from 100% Fair Trade and Organic oils - Vegan - 6 two-packs (30 oz)\nthe Light\n{'Item Form': 'Bar,Creamy', 'Brand': 'the Light', 'Scent': 'Unscented,Peppermint,Lavender', 'Material Feature': 'Organic, Vegan', 'Age Range (Description)': 'Adult', 'Product Dimensions': '0.79 x 1.18 x 1.97 inches; 2.23 Pounds', 'UPC': '737488057348'}\nThis soap is great for gifts or yourself!  There are 2 bars nicely wrapped together.  Lavender and peppermint both smell great.  The peppermint has a nice cooling sensation.  They suds nicely and rinse clean with no residue.  Would highly recommend it!!!\nGREAT soap!\nMaestee 9 Pcs Gel Nail Polish Kit, 6 Colors (8ml) with Base and Top Coat and Matte Top Gel (8ml) Neon Nail Polish Hot Neon City Collection Soak Off Nail Gel Polish Starter Professional Kit Best Mothers Day Gift\nmaestee\n{'Brand': 'maestee', 'Item Form': 'Gel', 'Finish Type': 'Matte,Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '9', 'Number of Pieces': '9', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.69 x 3.66 x 1.42 inches; 14.07 Ounces'}\nThe bottles are a nice size, with plenty of polish to work with!  2 thin coats is all I've need to get full coverage. These are a great variety of neon colors.  So fun to work with!  Great for using as a base for stamping.  If applied correctly as directed I have had the polish last for up to 2 weeks.  This is a great value and I highly recommend this polish.\nGreat neon gel polish set\nClear Nails Tips Coffin Shape, 480PCS Cosics 2IN1 Glossy Clear Press On Nails Almond Stiletto & Ballerina Shape Medium with Storage Box, Artificial Acrylic False Fake Nail Art Tips for Women DIY\nCOSICS\n{'Color': 'Green', 'Size': '480 Piece Assortment', 'Material': 'Plastic, Acrylic, Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'COSICS', 'Style': 'French', 'Package Dimensions': '9.53 x 6.54 x 1.3 inches; 2.12 Ounces'}\nI purchased these not for their intended purpose.  I use them as a display for all my polish colors.  I glue them to index cards and mark the brand and name/number of the polish so I know exactly which color I want to choose with no guesswork.  They work great for this purpose.\ngreat for what I used them for\n21Pcs Dip Powder Nail Kit - Aubss 10 Colors Dip Nail Kit, Neutral Skin Tone Dipping Powder Colors Kit, Dip Powder for French Nail Art Nail Manicure Kit Salon DIY Home, No Nail Lamp Needed\nAUBSS\n{'Material': 'Acrylic', 'Brand': 'AUBSS', 'Included Components': 'Dip Powder', 'Item Form': 'Powder', 'Product Dimensions': '8.94 x 8.23 x 1.73 inches; 1.29 Pounds'}\nNice looking nails. Easy instructions and easy to use.  Makes acrylic-like nails easy at home.  Unlike traditional nails, these wear very well, and don't chip or flake off<br /><br />In the attached photo I have my nail I've had for over a week, and though my nail is beginning to grow out, the color itself if still holding fast\nMakes nice looking nails",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Makes nice looking nails",
    "text": "Nice looking nails. Easy instructions and easy to use.  Makes acrylic-like nails easy at home.  Unlike traditional nails, these wear very well, and don't chip or flake off<br /><br />In the attached photo I have my nail I've had for over a week, and though my nail is beginning to grow out, the color itself if still holding fast",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/51od-TMqErL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/51od-TMqErL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/51od-TMqErL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B095RYJJHY",
    "parent_asin": "B095RYJJHY",
    "user_id": "AE6AUO3Z6Q5N5VK2JDWGZEGFW4GA",
    "timestamp": "2021-11-24 12:49:09.109000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "21Pcs Dip Powder Nail Kit - Aubss 10 Colors Dip Nail Kit, Neutral Skin Tone Dipping Powder Colors Kit, Dip Powder for French Nail Art Nail Manicure Kit Salon DIY Home, No Nail Lamp Needed",
    "average_rating": 3.7,
    "rating_number": 22,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51TlQvAn-4L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51TlQvAn-4L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71HL0hdoLkL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/516y0VagohL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/516y0VagohL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71Lu2UA1-8L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51ts1gUCYJL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ts1gUCYJL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71GujD-w2HL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51ahHbRh4XL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ahHbRh4XL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/7195xfhWadL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51-bDbdGUIL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-bDbdGUIL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71I16BXQXIL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51zDA51X+AL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51zDA51X+AL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71vWmmediXL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51HfM4Sn1ML._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51HfM4Sn1ML.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71wRdXfqgrL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51sO8HtKv7L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51sO8HtKv7L.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71Vg-jEeEuL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "AUBSS",
    "categories": [],
    "details": {
      "Material": "Acrylic",
      "Brand": "AUBSS",
      "Included Components": "Dip Powder",
      "Item Form": "Powder",
      "Product Dimensions": "8.94 x 8.23 x 1.73 inches; 1.29 Pounds"
    },
    "bought_together": null
  }
}