{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Last Unicorn (The Enchanted Edition)\nReview Date: 2018/01/14\nStore: Mia Farrow  (Actor),     Jeff Bridges  (Actor),     Jules Bass  (Director),     Arthur Rankin Jr.  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Animation\nProduct Description: [\"The Enchanted Tale of The Last Unicorn! Upon hearing that she may be the very last of her kind on Earth, a Unicorn (Mia Farrow) goes in search of others like her. Her quest won't be easy, as it leads her straight to the evil King Haggard (Christopher Lee) and his infamous Red Bull! And the journey is made even more complicated when, to protect her from the envious wrath of Haggard, a spell is cast to turn the Unicorn into the Lady Amalthea, a beautiful, young human woman. But with this new body comes new thoughts and feelings, such as love for Haggard's son, Prince Lir (Jeff Bridges). Will Amalthea get lost inside this new body? Will she meet the fate of the other Unicorns? Or will she be able to defeat Haggard and his Red Bull with the aid of her friends, Schmendrick the bumbling magician (Alan Arkin) and Molly Grue (Tammy Grimes)? From Arthur Rankin, Jr. and Jules Bass (The Hobbit), comes a magical adventure with an all-star cast, including Mia Farrow, Jeff Bridges, Christopher Lee, Alan Arkin, Tammy Grimes, Angela Lansbury, René Auberjonois and Robert Klein, and unforgettable songs from the rock band, America! The original, uncut version of The Last Unicorn is proudly presented with a stunning new transfer and new bonus materials!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family/Animation', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Jules Bass, Jeff Bridges, Arthur Rankin Jr., Mia Farrow, Alan Arkin, Angela Lansbury', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Item model number': '15905', 'Director': 'Jules Bass, Arthur Rankin Jr.', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'June 9, 2015', 'Actors': 'Mia Farrow, Jeff Bridges, Alan Arkin, Angela Lansbury', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Grandkids like this show. My children used to love this show when they were little.\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Hatfields & McCoys [Blu-ray]\nKevin Costner  (Actor, Producer),     Bill Paxton  (Actor),     Kevin Reynolds  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Bonded by their oath to the same flag, two confederate soldiers, “Devil” Anse Hatfield (Kevin Costner) and Randall McCoy (Bill Paxton), return home seeking peace after tireless months of battle. Their expectations are quickly shattered when a murder based on misunderstandings and an illicit love affair trigger warfare between former comrades and their clans. This historic feud teeters on the brink of an all out civil war as friends and neighbors join opposing sides in a rivalry that would ultimately shape American History.']\n{'Genre': 'Drama, History', 'Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Noel Fisher, Hatfield and McCoy Productions, LLC, Matt Barr, Jena Malone, Sarah Parish, Bill Paxton, Sam Reid, Kevin Costner, Jilon VanOver, Darrell Fetty, Boyd Holbrook, Andrew Howard, Mare Winningham, Ronan Vibert, Powers Boothe, Kevin Reynolds, Tom McKay, Joe Absolom, Herb Nanas, Tom Berenger, Lindsay PulsipherNoel Fisher, Hatfield and McCoy Productions, LLC, Matt Barr, Jena Malone, Sarah Parish, Bill Paxton, Sam Reid, Kevin Costner, Jilon VanOver, Darrell Fetty, Boyd Holbrook, Andrew Howard, Mare Winningham, Ronan Vibert, Powers Boothe, Kevin Reynolds, Tom McKay, Joe…   See more', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '25343070', 'Director': 'Kevin Reynolds', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 50 minutes', 'Release date': 'July 31, 2012', 'Actors': 'Kevin Costner, Bill Paxton, Matt Barr, Tom Berenger, Powers Boothe', 'Subtitles': 'English', 'Producers': 'Kevin Costner, Herb Nanas, Darrell Fetty', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nI had already seen most of it on TV. But I missed some, so I decided to order it. I loved it. It was really a sad thing that went on, but I enjoyed the movie.\nLoved It !!!!!!!\nCedarmont Kids Sing-Along-Songs: Preschool Songs [DVD]\nSue Martin Gay  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.25 inches; 2.88 Ounces', 'Director': 'Sue Martin Gay', 'Media Format': 'Color, DVD, Live, NTSC', 'Run time': '30 minutes', 'Release date': 'January 14, 2003', 'Studio': 'Time Life (Ventura)', 'Number of discs': '1'}\nMy grandkids love this DVD. The 2 year old not so much yet.  I'm glad I decided to buy it.\nGood songs\nCedarmont Kids - Toddler Tunes [DVD]\nChildren  (Actor),     Gary Musick  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['English & Spanish Versions!', \"Give your kids the gift of song! Jam-packed with best-loved, classic children's songs, this live-action collection offers hours of wholesome, interactive fun. Your children will sing and dance along with these all-time favorites - performed by the famous Cedarmont Kids - over and over again. They'll love Sing-Along-Songs! and so will you!\", '25 Back-to-Back Music Videos for Kids!The Wheels on the Bus - The Alphabet Song - Polly, Put the Kettle On - God Made Me - Eensy, Weensy Spider - The More We Get Together - Six Little Ducks - Baa, Baa, Black Sheep - Roll Over - Father, We Thank Thee - Are You Sleeping? - Jack and Jill - Oh Where, Oh Where Has My Little Dog Gone? - Get on Board - Oh Dear! What Can The Matter Be? - Pop! Goes the Weasel! - This Old Man - London Bridge - Mary Had a Little Lamb - The Muffin Man - Row, Row, Row Your Boat - Deep and Wide - Mulberry Bush - Old MacDonald - Be Kind to Your Web-footed Friends', 'DVD Bonus Features: English or Spanish language options available, in stereo, with subtitled sing-along lyrics! Split track audio lets you sing along with Cedarmont Kids or by yourself with the music Plus, cast and production notes - 30 minutes']\n{'Genre': 'Kids & Family', 'Format': 'Color, DVD, Live, NTSC', 'Contributor': 'Gary Musick, Children', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 0.6 inches; 3.2 Ounces', 'Director': 'Gary Musick', 'Media Format': 'Color, DVD, Live, NTSC', 'Run time': '35 minutes', 'Release date': 'July 30, 2002', 'Actors': 'Children', 'Studio': 'Time Life (Ventura)', 'Number of discs': '1'}\nThe kids loves the songs and they run, play,dance and jump around to the music and singing. They have lots of fun.\nGrandkids\nLets Hear It for the Laurie Berkner Band\nRated:    Unrated    Format: DVD\nMovies & TV, Movies\n[\"Get ready to jump , dance, and sing along to this collection of catchy music with a message! Packed with songs performed by the wildly popular Laurie Berkner Band, this DVD compilation features some of Laurie's most popular tunes from her regular appearances on Jack's Big Music Show. With hosts Moose and Zee, its never been easier to get in tune with learning.\"]\n{'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.4 x 5.2 x 0.6 inches; 0.01 Ounces', 'Item model number': '894524', 'Media Format': 'Dolby, Full Screen, Subtitled, NTSC', 'Release date': 'September 28, 2010', 'Actors': 'Berkner, Laurie', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Nickelodeon'}\nThe 2 year old loves these the most. It really gets them moving. She already sings some of the songs.\nLove Berkner Band\nWe Are The Laurie Berkner Band\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'PreS-Gr 3—,The first DVD from the Laurie Berkner Band in five years, this party-themed production features 12 original music videos, a mix of new songs and fan favorites. A party invitation drops from the sky and is opened, and Laurie and her band mates are surprised when a pop-up party room springs to life. They jump into the party where they are joined by a multicultural group of children who dance and sing along with the band. Berkner leads \"This Hat,\" \"Last Night I Had a Dream,\" and \"Party Day.\" Then the band is invited to a birthday party where they sing \"Balloons,\" \"Shake Your Body Down,\" \"Where Is the Cake?,\" and \"Happy, Happy, Happy Birthday.\" Finally, they are transported to a pajama party and sing \"The Cookie Bakers of the Night,\" \"Choc-o-lot in My Pock-o-lot,\" \"Pillowland,\" and \"Goodnight.\" Footage of the band playing each song is mixed with shots of the children and computer-generated images, adding interest. Backdrops and costumes are bright and colorful, with lots of pop. The camera work is always sharp, panning, cutting in or out, or zooming in and out. Bonus materials on the DVD include Laurie recording an acoustic version of \"My Family\", a music video of \"I Really Love to Dance\" with footage of a birthday concert, and \"Meet the Band,\" four vignettes to acquaint fans with the band members. The bonus CD includes fives songs from the DVD. Once again, the Laurie Berkner Band does a terrific job of sharing the joy of their music with kids.—,\"Stephanie Bange, Wright State University, Dayton, OH\"Science Copyright 2011 Reed Business Information.', 'Amazon.com', 'Well-known children\\'s musician Laurie Berkner bursts onto the children\\'s music video scene with the energy and enthusiasm of her concert stage appearances fully intact. The Laurie Berkner Band, comprised of Laurie Berkner on vocals and guitar, Brian Mueller on bass and vocals, and Susie Lampert on keyboard and vocals (joined sporadically by Bob Golden on drums and additional instruments), is an accomplished group of musicians who create and perform whimsical, catchy children\\'s songs in a folksy rock style. From the playful rhymes that declare Tuesday \"snooze day\" in \"I\\'m Gonna Catch You\" to the absurd image of fish taking showers and brushing their teeth in \"The Goldfish,\" Laurie Berkner\\'s songs celebrate a child\\'s love of the ridiculous. The uninhibited trio performs live onstage (\"Under a Shady Tree\") or within simply animated scenes (\"Bumblebee--Buzz, Buzz, Buzz\") and the songs are undisputedly catchy--so catchy that many parents sheepishly admit to humming or even singing Laurie Berkner\\'s songs full voice even when their children aren\\'t around. In these days of splashy animation and over-thought, overly-glitzy children\\'s music videos, it\\'s a real treat to enjoy a simple production that features songs that kids love performed by musicians who appear to be having just as much fun as their young audiences. (Ages 1 to 8)', '--Tami Horiuchi']\n{'Genre': \"Children's Music, Music Video & Concerts\", 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Laurie Berkner', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 7.5 x 0.6 inches; 4.8 Ounces', 'Item model number': 'RAZ 86009', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Release date': 'February 14, 2006', 'Actors': 'Laurie Berkner', 'Studio': 'Razor & Tie', 'Number of discs': '2'}\nMy daughter bought some of these for her daughter years ago. That's how I know Laurie Berkner Band's stuff. The kids all love her, that's why I buy them.\nGrandkids\nScary Godmother: The Revenge of Jimmy\nEzekiel Norton  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Animation\n['Hannah must stop Jimmy from erasing Halloween from the calendar for good. Scary Godmother prepares for Halloween, but with disastrous results.']\n{'Genre': 'Children', 'Format': 'Multiple Formats, Animated, Color, NTSC, Widescreen', 'Contributor': 'Barbara Zelinski, Ezekiel Norton', 'Language': 'Unqualified', 'Runtime': '46 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '13131576290', 'Director': 'Ezekiel Norton', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Widescreen', 'Run time': '46 minutes', 'Release date': 'June 29, 2010', 'Producers': 'Barbara Zelinski', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy grandkids all love this movie. That's why I ordered it. I actually think it's cute too.\nFour Stars\nScary Godmother: Halloween Spooktakular\nEzekiel Norton  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Animation\n[\"In this wonderfully unique Halloween special, little Hannah Marie is excited to be going trick-or-treating with the older kids. but when her rotten cousin Jimmy tries to ditch her in the dark basement of a spooky house, Hannah is rescued by her Scary Godmother and whisked away to the best Halloween party ever! It's a 'who's-boo' of monsters with Skully Pettibone, Harry The Werewolf, Orson, Bug-A-Boo and more, all in one unforgettable night of big screams, strange pizza and the ultimate plan for revenge on Jimmy and his friends.\"]\n{'Aspect Ratio': '1.77:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '13131576191', 'Director': 'Ezekiel Norton', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Widescreen', 'Run time': '48 minutes', 'Release date': 'September 2, 2008', 'Language': 'Unqualified', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nAll of us like this movie, especially my granddaughters.\nFour Stars\nTwitches Too (Double Charmed Edition)\nTia Mowry  (Actor),     Tamera Mowry  (Actor),     Stuart Gillard  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Disney Channel, Disney Channel Original Movies\n['Product Description', 'Exciting secrets are lurking in the shadows of TWITCHES TOO, the Double Charmed Edition DVD. Join stars Tia and Tamera Mowry as they take you behind the scenes for a revealing look at the special effects tricks used in the movie -- and the funny tricks played on the cast and crew -- as well as a mystical alternate scene. Now that \"twin witches\" Alex (Tia) and Camryn (Tamera) know the truth about their royal birth, it\\'s time for the girls to learn about each other and how to use their magical powers -- with hilarious results! While Alex wants to focus on college and having a semi-normal life, Camryn is all about the \"princessing\" -- glamour, gowns and tiaras. But their dreams must be set aside when destiny calls again. There\\'s a new supernatural evil threatening the people of Coventry, and it\\'s up to the twitches to save them. Twice the magic, twice the fun! You\\'ll be doubly charmed by Twitches Too!', 'Amazon.com', 'Life is settling into an almost normal routine for twin witches Camryn (Tamera Mowry) and Alex (Tia Mowry) following their heroic efforts to save the magical realm of Coventry from the evil warlock Thantos (Patrick Fabian) and the invading darkness in', 'Twitches', \". The two sisters are learning to use and control their magical powers and getting used to living as one family while they explore collegiate life at Waverly University and get to know their real mother Miranda (Kristen Wilson). Unexpectedly, the darkness returns to threaten Coventry once again and this time it follows Camryn and Alex into the mortal world. Protectors Karsh (Pat Kelly) and Ileana (this time played by Leslie Seiler) interrupt their nuptial planning to bring the girls back to Coventry at Miranda's command, but Camryn and Alex find themselves questioning their mother's decision to deprive her people of their magical powers as well as her insistence that the girls perform a spell to vanquish the darkness in two days time. Even more confusing is Alex's inexplicable conviction that her father Aron (Kevin Jubinville) is alive and residing in the very Shadow lands her and Camryn are set to destroy. In the end, Camryn and Alex must find a way to collaboratively use their powers to preserve Coventry without sacrificing their own convictions. Like the first film, an alternate ending leaves viewers with a shred of doubt, opening the door for another sequel. Also included is a 6-minute behind the scenes featurette. (Ages 7 and older)\", '--Tami Horiuchi']\n{'Genre': 'Disney Channel', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Special Edition, Full Screen', 'Contributor': 'Karen Holness, Kristen Wilson, Nathaniel Stephenson, Stuart Gillard, Kevin Jubinville, Arnold Pinnock, Tia Mowry, Pat Kelly, Leslie Seiler, Patrick Fabian, Teleplay By By Dan Berendsen, Tamera Mowry, Chris Gallinger, Jackie Rosenbaum, Based On The Characters From The Series Of Books E, Jayne EastwoodKaren Holness, Kristen Wilson, Nathaniel Stephenson, Stuart Gillard, Kevin Jubinville, Arnold Pinnock, Tia Mowry, Pat Kelly, Leslie Seiler, Patrick Fabian, Teleplay By By Dan Berendsen, Tamera Mowry, Chris Gallinger, Jackie Rosenbaum, Based On The Characters From The Se…   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.56 Ounces', 'Item model number': '5559600', 'Director': 'Stuart Gillard', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Special Edition, Full Screen', 'Run time': '1 hour and 23 minutes', 'Release date': 'January 29, 2008', 'Actors': 'Tia Mowry, Tamera Mowry, Kristen Wilson, Patrick Fabian, Pat Kelly', 'Studio': 'DISNEY CHANNEL', 'Writers': 'Based On The Characters From The Series Of Books E, Teleplay By By Dan Berendsen', 'Number of discs': '1'}\nAgain this was for the grandkids. All the girls love it.\nAll the girls love it.\nTwitches (Betwitched Edition)\nTia Mowry  (Actor),     Tamera Mowry  (Actor),     Stuart Gillard  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Disney Channel, Disney Channel Original Movies\n['Product Description', 'The enchanting best-selling book series comes to life in the Disney Channel Original Movie TWITCHES. Only the BETWITCHED EDITION DVD has the exclusive alternate ending and a spellbinding look behind-the-scenes with Tia and Tamera. Superstar twin sisters Tia and Tamera Mowry (SISTER, SISTER) star as twin witches -- \"twitches\"! -- who were separated at birth. On their 21st birthday, Alex (Tia) and Camryn (Tamera) reunite and discover that their unusual powers double in strength when they work together. Get caught in their spell as they work their magic to save everyone they love and fulfill their destiny. Go Twitches!', 'Amazon.com', 'The innate connection between twins is a strange but very real phenomenon, so it\\'s no surprise that when 21-year old twins Camryn (Tamera Mowry) and Alex (Tia Mowry) bump into one other in a clothing shop, they feel an instant connection with one another even though they were separated at birth. What is a surprise is that the two girls are really powerful witches from another dimension who were spirited away to escape the destructive force known as the \"Darkness.\" Kept safe for the last 21 years by two quirky protectors Karsh and Ileana, the girls are now destined to combine their respective gifts of sight and knowing with their newly discovered magical powers in order to save their own mother and her entire dimension from the invading Darkness. The biggest difficulties for the girls prove to be learning to trust in themselves and their powers, agreeing upon their combined role in the fight, and focusing their powers against the Darkness. Based on the book', 'The Power of Two', \", this 86-minute Disney Channel Original Movie features a convincing and enthusiastic performance by Disney Channel's\", 'Sister, Sister', 'stars Tia and Tamara Mowry and some other-worldly special effects. Bonus features include brief behind the scenes commentary by Tia and Tamara Mowry, a never-before-seen alternate ending, and an interactive fortune-telling game. (Ages 7 and older)', '--Tami Horiuchi']\n{'Genre': 'Disney Channel', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Karen Holness, Jennifer Robertson, Kathryn Haggis, Kristen Wilson, Stuart Gillard, Teleplay By Melissa Gould And Dan Berendsen, Arnold Pinnock, Based On The Book By H.B. Gilmour & Randi Reisfeld, Tia Mowry, Pat Kelly, Patrick Fabian, Albert Howell, Tamera Mowry, David Ingram, Jessica Greco, Jackie Rosenbaum, Natalie Krill, Jessica FelizKaren Holness, Jennifer Robertson, Kathryn Haggis, Kristen Wilson, Stuart Gillard, Teleplay By Melissa Gould And Dan Berendsen, Arnold Pinnock, Based On The Book By H.B. Gilmour & Randi Reisfeld, Tia Mowry, Pat Kelly, Patrick Fabian, Albert Howell, Tamera Mowry, David In…   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '05075200', 'Director': 'Stuart Gillard', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'September 5, 2006', 'Actors': 'Tia Mowry, Tamera Mowry, Kristen Wilson, Patrick Fabian, Jennifer Robertson', 'Studio': 'DISNEY CHANNEL', 'Writers': 'Teleplay By Melissa Gould And Dan Berendsen, Based On The Book By H.B. Gilmour & Randi Reisfeld', 'Number of discs': '1'}\nGranddaughters love this one too.\nFour Stars\nHalloweentown / Halloweentown II: Kalabar's Revenge (Double Feature)\nDebbie Reynolds  (Actor),     Judith Hoag  (Actor),     Duwayne Dunham  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Disney Channel, Disney Channel Original Movies\n['Product Description', \"Join Marnie (Kimberly J. Brown) and her grandmother Aggie (Debbie Reynolds) as they stir up a cauldron full of comedy and adventure in two Disney Channel classics -- HALLOWEENTOWN and HALLOWEENTOWN II: KALABAR'S REVENGE. On her 13th birthday, Marnie learns she's a witch, discovers a secret portal and is transported to HALLOWEENTOWN -- a magical place where ghosts and ghouls, witches and werewolves live apart from the human world. but she soon finds herself battling wicked warlocks, evil curses and endless surprises. HALLOWEENTOWN Double Feature will charm pixies, trolls and families everywhere every day of the year.\", 'Amazon.com', 'In a place called Halloweentown, good and evil look very different than one might expect. Thanks to a visit from Grandmother Aggie (Debbie Reynolds), Marnie (Kimberly J. Brown) and her family\\'s tradition of ignoring the Halloween holiday are about to change in the extreme. It seems that Marnie\\'s mother Gwen (Judith Hoag) has been hiding a big secret from her three children--all of them possess supernatural powers. Now that it\\'s Marnie\\'s thirteenth birthday, she must begin her training as a witch or lose her powers forever. While Gwen wants nothing more than to see her children grow up as \"normal\" humans, Grandmother Aggie and Marnie have other ideas. A brewing crisis between good and evil in the alternate world Halloweentown soon pulls the entire family through a portal and into an intense battle against ghouls, goblins and the warlock Kalabar (Robin Thomas).', 'Halloweentown II', 'takes place two years after', 'Halloweentown', \"and finds Kalabar's son bent on revenge. Marnie has matured as a witch, but her powers are pushed to the limit in a desperate effort to triumph over an evil curse in order to save Halloweentown, her family and the human world. This is good\", 'Disney', \"Halloween fun with nice costuming and special effects, a wholesome message about the power of family, cooperation and perseverance, and ghouls that, though creepy looking, aren't likely to inspire nightmares in younger family members. (Ages 5 and older)\", '--Tami Horiuchi']\n{'Genre': 'Disney Channel, ACTION, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Teleplay By Paul Bernbaum And Jon Cooksey & Ali Ma, Duwayne Dunham, Robin Thomas, Joey Zimmerman, Story By Paul Bernbaum, Emily Roeske, Judith Hoag, Phillip Van Dyke, Kimberly J. Brown, Debbie ReynoldsTeleplay By Paul Bernbaum And Jon Cooksey & Ali Ma, Duwayne Dunham, Robin Thomas, Joey Zimmerman, Story By Paul Bernbaum, Emily Roeske, Judith Hoag, Phillip Van Dyke, Kimberly J. Brown, Debbie Reynolds  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.53 x 7.53 inches; 2.4 Ounces', 'Item model number': '4113000', 'Director': 'Duwayne Dunham', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC', 'Run time': '2 hours and 45 minutes', 'Release date': 'September 13, 2005', 'Actors': 'Debbie Reynolds, Judith Hoag, Kimberly J. Brown, Joey Zimmerman, Phillip Van Dyke', 'Studio': 'Buena Vista Home Entertainment / Disney', 'Writers': 'Teleplay By Paul Bernbaum And Jon Cooksey & Ali Ma, Story By Paul Bernbaum', 'Number of discs': '1'}\nAll of us enjoy these movies.\nFive Stars\nOrca\nBo Derek  (Actor),     Richard Harris  (Actor),     Michael Anderson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Orca (DVD)', \"The natural beauty of Bo Derek in her screen debut and the supernatural spectacle of Dino De Laurentiis' (King Kong) masterful use o f special e ffects on a gigantic scale highlights this rousing adventure story. It's the epic tale of one powerful being against anot her; a strong, determi ned fisherman (Richard Harris) versus an equally determined whale. When the giant whale's pregnant mate is mai med and killed by Harris, in a va riation on Moby Dick, the whale seeks revenge on the man. Orca smashes b oats, collapses buildings, and even manages to cause enormous destructio n by fire. A suspenseful action drama.\", ']]>']\n{'Genre': 'Horror, Drama, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Charlotte Rampling, Michael Anderson, Will Sharpton, Richard Harris, Bo Derek', 'Language': 'English (Mono)', 'Runtime': '1 hour and 32 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26412202', 'Director': 'Michael Anderson', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'September 14, 2004', 'Actors': 'Bo Derek, Richard Harris, Charlotte Rampling, Will Sharpton', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nI really like this show, I always have.  That's why I bought it. I had a hard time finding it.\nLike this movie!\nDracula - Dead and Loving It\nLeslie Nielsen  (Actor),     Peter MacNicol  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Dracula: Dead and Loving It (DVD)', \"Mel Brooks takes a turn at a classic horror tale. The vampires are loose, but somehow everyone's having a great time, including the undead count himself in Dracula: Dead and Loving It.\", ']]>', 'Amazon.com', 'In 1995, it was promising to hear that Mel Brooks was creating \"the companion piece to', 'Young Frankenstein', '.\" He had also brought in the heavyweight of deadpan--Leslie Nielsen. As Lt. Frank Drebin in the', 'Police Squad', 'movies, Nielsen has no peer for silly stuff--just the player Brooks would seem to need for a strong movie, as any fan of Brooks perpetually hopes a new film may rekindle his madcap magic. Alas, the end results in', 'Dracula: Dead and Loving It', \"include a sprinkling of amusements and one big belly laugh. Brooks and his writers use a very tight adaptation of Bram Stoker's novel, but the spoofs can be spelled out as we go, as if they are paint-by-number. Some are jabs at Coppola's version of\", 'Dracula', \", but most are attached to classic Dracula films. If any real pleasure comes from the movie it's thanks to the efforts of the cast. Peter MacNicol plays the crazed Renfield to the letter, Steven Weber has a good time as the tight British Harkin, and Lysette Anthony charms as the doomed Lucy. Brooks and Nielsen ham it up just fine. There's even a surprisingly controlled performance by Harvey Korman (a character spoofing Anthony Hopkins's role in the misfire\", 'The Road to Wellville', \"). As with Brooks's period comedies, the film looks better than it needs to and includes a few tricky special effects for good measure. This has nothing to do with the audience laughing--we need bigger jokes. And when you double over laughing in one scene--involving a stake through the heart and a bucket of blood--you want the movie to achieve Brooks's days of glory, when hearty laughter was the norm, not an isolated moment.\", '--Doug Thomas']\n{'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, Color, Anamorphic, Closed-captioned, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Clive Revill, Leslie Nielsen, Amy Yasbeck, Harvey Korman, Gregg Binkley, Lysette Anthony, Steven Weber, Steve Haberman, Avery Schreiber, Mel Brooks, Mark Blankfield, Peter MacNicol, Cherie Franklin, Anne Bancroft, Megan Cavanagh, Chuck McCann, Bram Stoker, Matthew Porretta, Peter Schindler, Rudy De LucaClive Revill, Leslie Nielsen, Amy Yasbeck, Harvey Korman, Gregg Binkley, Lysette Anthony, Steven Weber, Steve Haberman, Avery Schreiber, Mel Brooks, Mark Blankfield, Peter MacNicol, Cherie Franklin, Anne Bancroft, Megan Cavanagh, Chuck McCann, Bram Stoker, Ma…   See more', 'Initial release date': '2006-02-14', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'false', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.31 x 7.56 x 0.75 inches; 2.12 Ounces', 'Item model number': '2228569', 'Director': 'Mel Brooks', 'Media Format': 'Multiple Formats, Color, Anamorphic, Closed-captioned, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 14, 2006', 'Actors': 'Leslie Nielsen, Peter MacNicol, Steven Weber, Amy Yasbeck, Mel Brooks', 'Subtitles': 'English, Spanish, French', 'Producers': 'Peter Schindler, Mel Brooks', 'Studio': 'Studio Distribution Services', 'Writers': 'Mel Brooks, Rudy De Luca, Steve Haberman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love this movie, and had a hard time finding it! Am really glad I looked here!\nGreat movie\nJohn Carpenter's Ghosts of Mars\nNatasha Hestridge  (Actor),     Ice Cube  (Actor),     John Carpenter  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Mystery & Thrillers\n['Terror is the same on any planet.', \"From John Carpenter, the master of horror behind 1998's hit\", \"John Carpenter's Vampires\", 'and classics like', 'The Thing', 'and', 'Halloween', ', comes a sci-fi thriller full of explosive action and bone-chilling suspense.', 'Natasha Henstridge (', 'Species', ') is Melanie Ballard, a headstrong police lieutenant on Mars in the year 2025. Humans have been colonizing and mining on the red planet for some time, but when Ballard and her squad are sent to a remote region to apprehend the dangerous criminal James \"Desolation\" Williams, played by Ice Cube (', 'Friday', \"), they discover that he's the least of their worries. The mining operations have unleashed a deadly army of Martian spirits who take over the bodies of humans and won't stop until they destroy all invaders of their planet.\", 'Starring:', 'Ice Cube, Natasha Henstridge, Jason Statham, Clea DuVall and Pam GrierDirected and written by John Carpenter (', 'Halloween, The Thing, Vampires', ')']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MLCR53413DVD', 'Director': 'John Carpenter', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'June 17, 2014', 'Actors': 'Natasha Hestridge, Ice Cube, Jason Statham, Pam Grier, Joanna Cassidy', 'Studio': 'Mill Creek Ent', 'Number of discs': '1'}\nLove this show! It was really hard to find. Thanks!\nFive Stars\nThe Last Unicorn (The Enchanted Edition)\nMia Farrow  (Actor),     Jeff Bridges  (Actor),     Jules Bass  (Director),     Arthur Rankin Jr.  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n[\"The Enchanted Tale of The Last Unicorn! Upon hearing that she may be the very last of her kind on Earth, a Unicorn (Mia Farrow) goes in search of others like her. Her quest won't be easy, as it leads her straight to the evil King Haggard (Christopher Lee) and his infamous Red Bull! And the journey is made even more complicated when, to protect her from the envious wrath of Haggard, a spell is cast to turn the Unicorn into the Lady Amalthea, a beautiful, young human woman. But with this new body comes new thoughts and feelings, such as love for Haggard's son, Prince Lir (Jeff Bridges). Will Amalthea get lost inside this new body? Will she meet the fate of the other Unicorns? Or will she be able to defeat Haggard and his Red Bull with the aid of her friends, Schmendrick the bumbling magician (Alan Arkin) and Molly Grue (Tammy Grimes)? From Arthur Rankin, Jr. and Jules Bass (The Hobbit), comes a magical adventure with an all-star cast, including Mia Farrow, Jeff Bridges, Christopher Lee, Alan Arkin, Tammy Grimes, Angela Lansbury, René Auberjonois and Robert Klein, and unforgettable songs from the rock band, America! The original, uncut version of The Last Unicorn is proudly presented with a stunning new transfer and new bonus materials!\"]\n{'Genre': 'Kids & Family/Animation', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Jules Bass, Jeff Bridges, Arthur Rankin Jr., Mia Farrow, Alan Arkin, Angela Lansbury', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.12 Ounces', 'Item model number': '15905', 'Director': 'Jules Bass, Arthur Rankin Jr.', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'June 9, 2015', 'Actors': 'Mia Farrow, Jeff Bridges, Alan Arkin, Angela Lansbury', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGrandkids like this show. My children used to love this show when they were little.\nFour Stars",
  "profile": "**Updated User Profile Summary**\n\n- **Interests**: The user is dedicated to enhancing family interactions through engaging historical dramas and family-oriented animated content, characterized by humor and whimsical storytelling. Their appreciation for comedic narratives remains strong, reflecting their desire for entertainment that fosters joy and connection.\n\n- **Media Format Preference**: The user prefers high-quality formats for adult films while sticking to DVDs for children's programming, valuing enhancements that encourage shared viewing experiences. Their recent selections continue to balance humor with creative storytelling.\n\n- **Engagement with Content**: Recent interactions show the user is expanding their exploration into genres like fantasy, thrillers, and sci-fi. They remain focused on imaginative narratives for their grandchildren, favoring films that invite active participation and laughter.\n\n- **Emotional Response**: The user's nurturing disposition emphasizes emotional connections to stories, highlighting their commitment to fostering joy in their grandchildren's lives through varied entertainment.\n\n- **Rating Behavior**: Consistently providing positive ratings, the user underscores their preference for family-friendly content. Their recent review indicates a nostalgic appreciation for classic animated films, showcasing a willingness to engage with both new and beloved classics while maintaining their core enthusiasm for humor and storytelling.\n\nOverall, this profile reflects a family-oriented individual who enriches their grandchildren's experiences with captivating and joyful content, blending humor with quality narratives across diverse media formats.",
  "metrics": {
    "rouge1_f": 0.04245019549432136,
    "rouge2_f": 0.00223505308251071,
    "rougeL_f": 0.02681064978588717,
    "meteor": 0.011553528799657218,
    "bleu1": 2.374528865639134e-12,
    "bleu2": 6.774012000840102e-13,
    "bleu3": 9.963130194423482e-14,
    "bleu4": 3.824530543668954e-14,
    "bertscore_precision": 0.33960992097854614,
    "bertscore_recall": 0.5092443227767944,
    "bertscore_f1": 0.40747731924057007
  }
}