{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Kissemoji 15 Colors Cosmetics Cream Contour Makeup Highlight Palette Contour Palette Contouring Kit Concealer Makeup Foundation Blemish Concealer Professional Makeup Kit\nReview Date: 2016/02/06\nStore: Kissemoji\nAverage Rating: 3.2\nProduct Details: {'Package Dimensions': '6.1 x 4.2 x 0.5 inches; 3.2 Ounces', 'Item model number': 'WK000006_1', 'UPC': '758330241005'}\nReview Text: This is a very nice quality make up palette. My daughter wears make up alot I don't so much so deciding on the right one was difficult for me but she had been asking for this so I got it for her and I am so glad I did. She looks lovely and uses it all the time. It is great it doesn't irritate her skin or bother her at all which was something I was concerned about since she has sensitive skin. It goes on lovely and the colors are very nice not to bright but you can see them easily. I like this alot and am glad I was able to get it for her.<br />I purchased this product for a reduced price to make an honest and unbiased review.\nReview Title: This is a very nice quality make up palette\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Majestic Pure Moroccan Ghassoul Paste, Hammam Spa's Premium Quality Paste with Rose Water and Argan Oil, 8.8 Oz - Visibly Improves the Appearance of Your Skin Within Minutes\nYRMJK\n{'Brand': 'YRMJK', 'Item Form': 'Paste', 'Scent': 'Rose', 'Package Dimensions': '2.8 x 2.7 x 2.6 inches; 8.8 Ounces'}\nThis Morracan Ghassoul paste is awesome!! useing of Ghassoul Paste can improve skin tone, texture, elasticity, and clarity while eliminating dryness and flakiness. My skin looks and smells so much better, I smell like roses and I love it. The benefits of Ghassoul Paste are so great I make them into spa-quality masks for almost no money and in the convienince of my home.<br />The high concentration of natural minerals in Ghassoul Paste help replenish depleted minerals in your skin, resulting in a firmer, plumper, and more even-toned complexion. It can also be used as a scalp treatment to absorb oil, dirt, sebum and cleanse and clarify hair. No natural beauty tool kit should be without this fabulous Ghassoul Paste.<br />Moroccan Ghassoul, also known as Rhassoul Clay lessens dryness, enhances skin clarity and elasticity. It's known to clears pores, reduce stubborn blackheads and tighten skin resulting in a general smoothing of the surface skin. A lovely ochre colored clay with a silky smooth texture, mined in the Atlas Mountains of Morocco, this extraordinary mineral-rich clay is known for its unmatched ability to absorb impurities from the skin. It cleanses deep, clearing pores and tightening skin without harsh scrubs or chemicals.<br />I have been using this paste and see such wonderful results. I plan to use this for a long time to come, this is something that needs to be a staple in all of our homes. I am so happy with this.<br />I purchased this product for a reduced price to make an honest and unbiased review.\nThis Morracan Ghassoul paste is awesome!! useing of Ghassoul Paste can improve skin ...\nPlant Therapy Lavender Body Cream 8 oz Aromatherapy Body Cream, All Natural Base\nPlant Therapy\n{'Brand': 'Plant Therapy', 'Scent': 'Lavender', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.48 x 1.48 x 0.79 inches; 4.96 Ounces', 'UPC': '680912012751'}\nI really appreciate plant therapy and all they do to bring natural healthy herbal products to my home and my family. I don't have to worry about harmful ingredients I know with their products and I'm getting exactly what I need and what's best for my family. I got this so that I could get soothing foot rubs for my wonderful son who loves to give them to me. It is so wonderful it smells so good and it feels so good I'm so pleased with this product. It is everything that I could have wanted in a body cream. I purchased this product reduce price to give an honest and unbiased review thank you\nI don't have to worry about harmful ingredients I know with their products and I'm getting exactly what I need and what's best f\nBeautyBliss Anti Aging Eye Cream with Caffeine and Retinol 1 Ounce\n{'Item Form': 'Cream', 'Unit Count': '1 Count', 'Number of Items': '1', 'Use for': 'Eyes', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 2 inches; 0.8 Ounces', 'Item model number': '08012015', 'UPC': '684758409386'}\nAs I get older I find that I need to be a bit more creative with what I do to treat puffy under eye woes. This is a nice new product that I thought I would give a try. I am so glad I did. It really is working to improve the way I look and feel. It is really making a noticeable  difference in my appearance. I like the results of using it just for the small amount of time that I have been. The caffeine and retinol really do make a difference. This is a natural product with some good ingredients. I am so happy I got it<br />I purchased this product for a reduced price to give an honest and unbiased review.\nThis is a nice new product that I thought I would give a ...\nTweezers Set with Case | Slant, Straight and Pointed Tip Stainless Steel Tweezer\nOMAROA\n[\"Trying to pull out a troublesome splinter?Tired of gluing your fingers together when applying fake eyelashes? Losing a screw from the hinge on your glasses? Scared of the massive ball of hair stuck in your shower drain? Sick of trying to thread needles with nearly-invisible thread?  You need tweezers! Make difficult tasks easy with the right tools. Our Love It tweezers are perfect for grabbing, twisting, shaping and holding on to anything that's too delicate, small, fragile, or hard to grasp with your hands.   These tweezers are built to last. Too often, tweezers are made with cheap material and careless manufacturing standards. This means that they quickly bend out of alignment and become useless. We don't want that to happen to you... which is why we build our tweezers out of stainless steel, machined carefully to come together in exactly the right position.   A variety of tips for a variety of jobs. When you're handling anything small or fragile, the shape of your tweezers becomes extra important. That's why our Love It tweezer set ships with three different sizes of tool: standard, slanted, and extra-small. They're sharp, too-perfect for dislodging splinters or pulling that one annoying hair.  And because they're sharp, we ship our Love It tweezers with a stylish leather carrying case, perfect for keeping them safe and protecting the other objects in your purse.   No more squinting and fumbling when you try to do delicate jobs - order your set of Love It tweezers today!\"]\n{'Brand': 'OMAROA', 'Material': 'Stainless Steel', 'Item Dimensions LxWxH': '3 x 0.1 x 0.3 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 0.1 x 0.3 inches; 0.1 Ounces', 'Item model number': '3179654', 'UPC': '646437258098', 'Manufacturer': 'OMAROA'}\nTweezers!!!!<br />This is a great set of tweezers. Pink is my favorite color so right off the bat they get a plus for that. But seriously they work great. They are really sturdy and well made. Not those cheap ones that bend really easy. With three different pairs each with thier own unique job you can't go wrong. They have a nice sharp pinch at the end to grab the little hairs and get them gone. These tweezers are awesome they are great tweezers. I am so glad I was able to get these. This is an excellent set that I totally love.<br />I purchased this product for a reduced price for an honest and unbiased review.\nThis is a great set of tweezers\nOrganic Veda Moringa Turmeric Herbal Soap. Plant Based Vitamains and Minerals. Mild and Gentle Daily Care.\nOrganic Veda\n{'Item Form': 'Bar', 'Brand': 'Organic Veda', 'Scent': 'Turmeric', 'Material Feature': 'Organic, Plant Based', 'Age Range (Description)': 'Adult'}\nOrganic Moringa 100% natural handmade soap is such an awesome product I love it. I always try to source out all natural wholesome products for my family and I am so glad I was able to find this one. Turmeric is one of my favorite supplements to use for my health and my skin. It is free from harsh detergents, sulfates, additives, artificial colors and perfumes.<br />I am very impressed with the high quality and care that is taken into making this excellent soap. My skin feels softer and smoother and my dry skin is so nourished and soft now. It was a very nice experience that left my skin feeling soft and smooth and smelling lovely.<br />This is a Excellent soap that is full of all healthy natural ingredients. I am very pleased with the quality of this product. I am very pleased with my skin and how it feels from using this product as well. It is wrapped is a great wrapper that makes it unique and decorative.<br />I purchased this product for a reduced price to make an honest and unbiased review.\nOrganic Moringa 100% natural handmade soap is such an awesome product I love it\nHOMMP Bath Loofahs Back Scrubber, 5 Counts\n{'Package Dimensions': '12 x 9.9 x 2 inches; 14.24 Ounces', 'UPC': '602731323481'}\nThis set of loofah scrubbers is the best I have ever gotten. I didn't expect them to be so big and nice but I am really pleased with how nice they are. They are good quality and full not flimsy so they don't fall apart. They are well made and very nice and strong. They are long enough to really get my back easily while I am in the shower. This is a huge set of five sponges they will last a. Ice long time. The colors are nice and bright and the handles are attached well so I can hang them to dry with no worries. This is a great set I am glad I was able to get them.<br />I purchased this product for a reduced price to make an honest and unbiased review.\nThis set of loofah scrubbers is the best I have ever gotten\nJade Roller for Face, Jade Facial Roller, Gua Sha Scraping Massager, Anti-aging 100% Natural Facial Jade Stone Set - Face Eye Neck Beauty Roller For Slimming & Firming\nTiny Captain\n{'Product Dimensions': '9 x 9 x 0.2 inches', 'Item model number': 'toullgo3uetyy5', 'Is Discontinued By Manufacturer': 'No', 'Batteries required': 'No', 'Item Weight': '0.32 ounces', 'Color': 'Blue', 'Brand': 'Tiny Captain', 'Item Dimensions LxWxH': '9 x 9 x 0.2 inches', 'Water Resistance Level': 'Waterproof'}\nI love these bibs!  My son really needs these, he is one and a bit messy. He has lots of teeth coming in and lots of sisters who enjoy feeding him lots things. They go on easily with a small snap on the back and stay put. They come off easily and the material is great. It's beathable and I can throw them right in the washing machine. They come witha nice cloth bag that has a draw string so I can keep them together. Nice and easy just like it should be. My son looks adorable and I am very happy.<br />I purchased this product at a reduced price for an honest and unbiased review\nI love these bibs\nMoroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nPure Body Naturals\n{'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nThis is a great shampoo it is a rich thick product that feels so nice and smooth when  you put it on your hair. It works into a nice thick lather and when you rinse it is super silky smooth. I am such a fan of all natural products and even more a fan of essential oils and now my hair looks and feels like i had a spa day that was in the comfort of my own home. Argan oil is effective in thoroughly cleansing and improving the health of the scalp, removing any impurities, and acting as a natural antidandruff remedy. Which is something i truly need since i have a super sensitive scalp and water even seems to bother it alot of the time.  It also contains pure organic argan oil that works to leave the scalp feeling refreshed while locking in moisture and shine into each strand of hair. I am so delighted to come across this product and used it this is one that I will use for a very long time and highly recommend it to everyone else.<br />I purchased this product for a reduced price to make an honest and unbiased review thank you\nThis is a great shampoo it is a rich thick product that feels ...\nKissemoji 15 Colors Cosmetics Cream Contour Makeup Highlight Palette Contour Palette Contouring Kit Concealer Makeup Foundation Blemish Concealer Professional Makeup Kit\nKissemoji\n{'Package Dimensions': '6.1 x 4.2 x 0.5 inches; 3.2 Ounces', 'Item model number': 'WK000006_1', 'UPC': '758330241005'}\nThis is a very nice quality make up palette. My daughter wears make up alot I don't so much so deciding on the right one was difficult for me but she had been asking for this so I got it for her and I am so glad I did. She looks lovely and uses it all the time. It is great it doesn't irritate her skin or bother her at all which was something I was concerned about since she has sensitive skin. It goes on lovely and the colors are very nice not to bright but you can see them easily. I like this alot and am glad I was able to get it for her.<br />I purchased this product for a reduced price to make an honest and unbiased review.\nThis is a very nice quality make up palette",
  "actual_interaction": {
    "rating": 5.0,
    "title": "This is a very nice quality make up palette",
    "text": "This is a very nice quality make up palette. My daughter wears make up alot I don't so much so deciding on the right one was difficult for me but she had been asking for this so I got it for her and I am so glad I did. She looks lovely and uses it all the time. It is great it doesn't irritate her skin or bother her at all which was something I was concerned about since she has sensitive skin. It goes on lovely and the colors are very nice not to bright but you can see them easily. I like this alot and am glad I was able to get it for her.<br />I purchased this product for a reduced price to make an honest and unbiased review.",
    "images": [
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/51wlEsSX20L._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/51wlEsSX20L._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/51wlEsSX20L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61CJdmEwAOL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61CJdmEwAOL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61CJdmEwAOL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61T27hsHWKL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61T27hsHWKL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61T27hsHWKL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61pw-XY0SvL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61pw-XY0SvL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61pw-XY0SvL.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B019NBEIKY",
    "parent_asin": "B019NBEIKY",
    "user_id": "AEVVEYZF4MQDPC2BY2HBBNGZRYHA",
    "timestamp": "2016-02-06 02:00:45",
    "helpful_vote": 4,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Kissemoji 15 Colors Cosmetics Cream Contour Makeup Highlight Palette Contour Palette Contouring Kit Concealer Makeup Foundation Blemish Concealer Professional Makeup Kit",
    "average_rating": 3.2,
    "rating_number": 73,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41wGRhuRH3L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41wGRhuRH3L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/710Jeurk0DL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/416JbmWrMIL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/416JbmWrMIL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81nY1sb9jLL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41UfkJvooHL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41UfkJvooHL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71b12NktfRL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51ihq6t7NeL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ihq6t7NeL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71l8n66Y1ZL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51GNt8q32iL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GNt8q32iL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71q8l+tOeWL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41W-+mo3p3L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41W-+mo3p3L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61elZE2Qr7L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41djhkFswmL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41djhkFswmL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71kPXKBjKZL._SL1316_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51SEmyUnHvL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51SEmyUnHvL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71ORIeofGXL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Kissemoji",
    "categories": [],
    "details": {
      "Package Dimensions": "6.1 x 4.2 x 0.5 inches; 3.2 Ounces",
      "Item model number": "WK000006_1",
      "UPC": "758330241005"
    },
    "bought_together": null
  }
}