{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/07/27\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Destin Daniel Cretton'], 'Producers': ['Gil Netter', 'Asher Goldstein', 'Michael B. Jordan'], 'Starring': ['Michael B. Jordan', 'Jamie Foxx', 'Brie Larson'], 'Studio': ['WARNER BROS.']}\nReview Text: This movie was amazing.... amazing. This is based on the EJI (Equal Justice Initiative) the only bad thing about this movie was the acting provided by emotionless Brea Larson. Other than that, this movie was flawless in its execution and very entertaining\nReview Title: Great movie based on a true story of an amazing non profit\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Grim Adventures of Billy and Mandy - Billy and Mandy's Big Boogey Adventure [DVD]\nGreg Eagles  (Actor),     Richard Steven Horvitz  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"It's Billy, Mandy and Grim versus the Boogeyman in an epic tale of monster pirates, futuristic robots, evil artifacts, and snot. When the underworld strips Grim of his powers (due to years of Billy and Mandy abusing them), Billy, Mandy, Grim and Irwin must race the Boogey Man and a crew of monster pirates to capture Horror's Hand, a powerful artifact capable of making whoever wields it into the scariest being alive.\", 'Amazon.com', 'Devious characters and nightmarish happenings are the norm in the twisted, cell animated world of', 'The Grim Adventures of Billy and Mandy', \"where evil clashes with evil and mean meets meaner on a daily basis. The cast of characters includes Mandy, a surly, controlling, sarcastic girl; Billy, a dim-witted, hyperactive boy obsessed with snot and other bodily fluids; Irwin, a boy who's madly in love with Mandy; the Boogeyman, a bully who's lost his ability to scare people; and the Grim Reaper, a skeletal Mr. Death who's beleaguered by the constant company of Billy and Mandy. In\", \"Billy and Mandy's Big Boogey Adventure\", ', Billy and Mandy have recently won ownership of the Grim Reaper and their unceasing demands to accompany him as he drags unsuspecting souls to their deaths is cramping the Grim Reaper\\'s style--so much so that one of his intended victims gets away. Grim is put on trial and fired from his deathly employment which leads him, Mandy, Billy, and Irwin to embark on a quest to capture Horror\\'s Hand in hopes of utilizing its evil powers to get Grim\\'s job back and cause widespread suffering throughout the world. The Boogeyman, Grim\\'s rival since middle school, is experiencing a personal crisis because he can\\'t scare modern children and is also plotting to capture Horror\\'s Hand and then use it to transform himself into everyone\\'s worst nightmare. Grim, Billy, Mandy, Irwin, and Boogeyman battle each other and a host of frightening monsters that include a band of pirates along the river Styx, and Billybot and Mandybot robots from the future in a fight that forces each character to face his/her own worst fears. Bonus features include the original \"Bully Boogie\" short which explores the middle school beginnings of the feud between Boogeyman and Grim Reaper and a \"Behind the Voices\" featurette with interviews with creator Maxwell Atoms, Greg Eagles (Grim), Richard Horvitz (Billy), and Grey Delisle (Mandy). (Ages 7 and older)', '--Tami Horiuchi']\n{'Genre': 'Kids & Family', 'Format': 'Animated, Color, Widescreen, NTSC, DVD, Closed-captioned', 'Contributor': 'Renee Raudman, Maxwell Atoms, Richard Steven Horvitz, Rob Desales, Greg Eagles, Dee Bradley Baker, Jane Carr, Rachael MacFarlane, Grey DeLisle, Jennifer Hale, Chris Cox, Vanessa Marshall, Phil LaMarrRenee Raudman, Maxwell Atoms, Richard Steven Horvitz, Rob Desales, Greg Eagles, Dee Bradley Baker, Jane Carr, Rachael MacFarlane, Grey DeLisle, Jennifer Hale, Chris Cox, Vanessa Marshall, Phil LaMarr  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Media Format': 'Animated, Color, Widescreen, NTSC, DVD, Closed-captioned', 'Run time': '30 minutes', 'Release date': 'April 3, 2007', 'Actors': 'Greg Eagles, Richard Steven Horvitz, Grey DeLisle, Vanessa Marshall, Jennifer Hale', 'Subtitles': 'English, Spanish, French', 'Studio': 'Turner Home Ent', 'Writers': 'Maxwell Atoms, Rob Desales', 'Number of discs': '1'}\nDecent item, I wish that it had additional content and information.\nNostalgia\nPaw Patrol: Pups Save Christmas\nOwen Mason  (Actor),     Jamie Whitney  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Your little heroes can romp to the rescue with the PAW Patrol pups, as they use their tools, tech, vehicles, and problem-solving skills to save Adventure Bay.']\n{'Genre': 'Animation/Holidays', 'Format': 'NTSC, Widescreen', 'Contributor': 'Jamie Whitney, Owen Mason', 'Language': 'English', 'Runtime': '1 hour and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43212933', 'Director': 'Jamie Whitney', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 14 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Owen Mason', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nMy 2 year old is obsessed. This was a good movie with many chapters. As soon as we get in the car my son asks for it to be turned on.\nGood movie, my son loves it!\nPaw Patrol: Meet Everest!\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Join the PAW Patrol for 7 cool rescues featuring the team’s new snow pup hero! Meet Everest in her first ever rescue when she saves a stranded Jake, and check out her PAW some skills as she plows through a snowed-over Adventure Bay and rescues deer from some slippery ice! Then join Skye and the team for 4 more high-flying adventures!']\n{'Genre': 'Kids & Family/Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Contributor': 'PAW PATROL: MEET EVEREST!', 'Language': 'English', 'Runtime': '1 hour and 36 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.26 Ounces', 'Item model number': '59171674000', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'September 1, 2015', 'Dubbed': 'French, Spanish', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy son loves all things Paw Patrol. This is a good movie and enjoyable considering I’m usually watching it with him.\nGood clean movie, great content for kids\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Vadim Kapridov', 'Demetrius Wren', 'Matthias Sundberg', 'Tammy Langton', 'Nathan W. Fullerton', 'Nathalie Toriel'], 'Producers': ['Matthias Sundberg', 'Sarah Wallendjack', 'Angela Santomero', 'Alexandra Cassel', 'Wendy Harris'], 'Starring': ['Jake Beale', 'Heather Bambrick', 'Ted Dykstra'], 'Studio': ['PBS']}\nTo say that my 3 year old is obsessed would be an understatement. Daniel tiger is Mr Rogers that has been animated for young kids. It’s education and great messaging is wonderful for teaching your pre-K kid to potty train, deal with angry, share etc\nI can’t say enough amazing things about this\nThomas & Friends: Dinos & Discoveries [DVD]\nBen Small  (Actor),     Bob Golding  (Actor),     Don Spencer  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"All aboard for a roaring good time with Thomas and his friends! The engines are filled with wonder at the fantastical new sights and sounds on Sodor. Volcanoes sizzle and dinosaurs roar as the engines help the Earl with a special surprise. Marion experiences some dino daydreams, as Bill and Ben send Timothy on an expedition for a rainbow-colored car. Samson discovers his slip-ups cause confusion and delay, while Emily marvels at her giant and worldly Special. It's time for big adventure and dino-sized fun with Thomas & Friends™!\", 'Bonus Content:', '\"Hey Hey Thomas\" Sing-Along Music Video', '\"Hey Hey Thomas\" Sing-Along Music Video', 'Guess Who? Puzzles', 'Guess Who? Puzzles', ']]>']\n{'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Animated', 'Contributor': 'Teresa Gallagher, Andrew Brenner, Laura Beaumont, Nick Ostler, Keith Wickham, Martin T. Sherman, Steven Kynman, Rob Wilfort, Glenn Wrage, Paul Larson, Ben Small, Ian McCue, William Hope, Davey Moore, Jules de Jongh, Don Spencer, Kerry Shale, Tim Whitnall, Mark Huckerby, Robert Anderson, David Menkin, Olivia Colman, Britt Allcroft, Mike Grady, Jonathan Broadbent, Miranda Raison, Bob Golding, David Bedella, Tom StourtonTeresa Gallagher, Andrew Brenner, Laura Beaumont, Nick Ostler, Keith Wickham, Martin T. Sherman, Steven Kynman, Rob Wilfort, Glenn Wrage, Paul Larson, Ben Small, Ian McCue, William Hope, Davey Moore, Jules de Jongh, Don Spencer, Kerry Shale, Tim Whitnall, Mark…  See more', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0), Spanish (Dolby Digital 2.0)', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': '453484', 'Director': 'Don Spencer', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Animated', 'Run time': '1 hour and 8 minutes', 'Release date': 'March 3, 2015', 'Actors': 'Ben Small, Bob Golding, David Bedella, David Menkin, Glenn Wrage', 'Producers': 'Ian McCue, Robert Anderson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Andrew Brenner, Paul Larson, Mark Huckerby, Nick Ostler, Davey Moore', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMovie is decent. It is what you would expect from a movie. My 3 year old is obsessed with Thomas. After a while it becomes redundant for adults to watch.\nDecent movie, the more you watch the worse it gets\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles E. Bastien', 'Jamie Whitney'], 'Producers': ['Patricia Burns', 'Jen D.T.', 'Jason McKenzie', 'Christina Rotsaert', 'Ulla Junell', 'Matthew Wexler', 'Keith Chapman', 'Ronnen Harary'], 'Starring': ['Devan Cohen', 'Owen Mason', 'Kallan Holley'], 'Studio': ['NICK JR']}\nI love kid shows about as much as any father out there. This season was much better than others as they have the Mighty Pups. It has made them feel more super hero like and have been pretty enjoyable overall.\nGood wholesome show.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles E. Bastien', 'Jamie Whitney'], 'Producers': ['Patricia Burns', 'Jen D.T.', 'Jason McKenzie', 'Christina Rotsaert', 'Ulla Junell', 'Matthew Wexler', 'Keith Chapman', 'Ronnen Harary'], 'Starring': ['Solomon Brown', 'Justin Paul Kelly'], 'Studio': ['NICK JR']}\nThis was a must have for my 4 year old son. Sadly, it’s not as great as the new season 13 Mighty Pups; however, definitely a good season. Overall, my son enjoys this programming and likes to watch one each night before bed.\nDecent season, wholesome episodes.\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Vadim Kapridov', 'Demetrius Wren', 'Matthias Sundberg', 'Tammy Langton', 'Nathan W. Fullerton', 'Nathalie Toriel'], 'Producers': ['Matthias Sundberg', 'Sarah Wallendjack', 'Angela Santomero', 'Alexandra Cassel', 'Wendy Harris'], 'Starring': ['Jake Beale', 'Heather Bambrick', 'Zachary Bloch'], 'Studio': ['PBS']}\nFor those that don’t know imagine Mr Rogers Neighborhood was reimagined as an animated tiger. The show is both wholesome and entertaining. Anytime my 4 year old experiences a life issue we quickly search for the correct episode to play for him. Like when our son was experiencing life with a new sister we played the episode of Daniel tigers new sibling coming home. Overall amazing\nGreat animation show for kids ever.\n{'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Jon Erwin', 'Andrew Erwin (The Erwin Brothers)'], 'Producers': ['Kevin Downes', 'Jon Erwin', 'Andrew Erwin'], 'Starring': ['KJ Apa', 'Britt Robertson', 'Melissa Roxburgh'], 'Studio': ['Lionsgate']}\nWhile I enjoyed the film, I felt it was slow at times. By comparison the I can only imagine movie was much better and entertaining.\nDecent movie, 1 thumb up.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Destin Daniel Cretton'], 'Producers': ['Gil Netter', 'Asher Goldstein', 'Michael B. Jordan'], 'Starring': ['Michael B. Jordan', 'Jamie Foxx', 'Brie Larson'], 'Studio': ['WARNER BROS.']}\nThis movie was amazing.... amazing. This is based on the EJI (Equal Justice Initiative) the only bad thing about this movie was the acting provided by emotionless Brea Larson. Other than that, this movie was flawless in its execution and very entertaining\nGreat movie based on a true story of an amazing non profit",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user continues to engage deeply with animated content aimed at children and families, particularly nostalgic series that evoke fond childhood memories, while expanding into a wider range of family-oriented films, now including some compelling live-action titles.\n\n- **Content Preferences:** They actively seek family-friendly media characterized by engaging storytelling and educational themes, aiming to enhance their child's viewing experience. Their recent positive reaction to a live-action film indicates a growing appreciation for diverse genres while maintaining a focus on quality content.\n\n- **Rating Behavior:** The user typically assigns high ratings to animated, family-centric content but approaches adult films with a more critical mindset. Their recent review reflects this, as they praised the execution of a serious film but expressed disappointment in the acting of a key character, showcasing their discerning nature.\n\n- **Value for Information:** They prioritize depth in media, particularly regarding educational value and bonus features, reinforcing their commitment to well-rounded media consumption.\n\n- **Nostalgia Factor:** Nostalgia for animated content continues to influence their choices; however, they are increasingly open to exploring impactful family films across different formats.\n\n- **Recent Engagement:** In their latest review, the user balanced their enjoyment of an emotionally charged true story with constructive criticism on specific performances, further highlighting their dedication to finding enriching, entertaining content for their family.",
  "metrics": {
    "rouge1_f": 0.09128630705394192,
    "rouge2_f": 0.008306414397784956,
    "rougeL_f": 0.041493775933609964,
    "meteor": 0.027482537421794538,
    "bleu1": 2.4016976114709127e-05,
    "bleu2": 8.465937470640788e-06,
    "bleu3": 3.2083213151523793e-06,
    "bleu4": 9.347908000601204e-07,
    "bertscore_precision": 0.33208611607551575,
    "bertscore_recall": 0.4744570255279541,
    "bertscore_f1": 0.3907059133052826
  }
}