{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Paw Patrol: Pups Save Christmas\nReview Date: 2018/12/05\nStore: Owen Mason  (Actor),     Jamie Whitney  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['Your little heroes can romp to the rescue with the PAW Patrol pups, as they use their tools, tech, vehicles, and problem-solving skills to save Adventure Bay.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation/Holidays', 'Format': 'NTSC, Widescreen', 'Contributor': 'Jamie Whitney, Owen Mason', 'Language': 'English', 'Runtime': '1 hour and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43212933', 'Director': 'Jamie Whitney', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 14 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Owen Mason', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nReview Text: My 2 year old is obsessed. This was a good movie with many chapters. As soon as we get in the car my son asks for it to be turned on.\nReview Title: Good movie, my son loves it!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Grim Adventures of Billy and Mandy - Billy and Mandy's Big Boogey Adventure [DVD]\nGreg Eagles  (Actor),     Richard Steven Horvitz  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"It's Billy, Mandy and Grim versus the Boogeyman in an epic tale of monster pirates, futuristic robots, evil artifacts, and snot. When the underworld strips Grim of his powers (due to years of Billy and Mandy abusing them), Billy, Mandy, Grim and Irwin must race the Boogey Man and a crew of monster pirates to capture Horror's Hand, a powerful artifact capable of making whoever wields it into the scariest being alive.\", 'Amazon.com', 'Devious characters and nightmarish happenings are the norm in the twisted, cell animated world of', 'The Grim Adventures of Billy and Mandy', \"where evil clashes with evil and mean meets meaner on a daily basis. The cast of characters includes Mandy, a surly, controlling, sarcastic girl; Billy, a dim-witted, hyperactive boy obsessed with snot and other bodily fluids; Irwin, a boy who's madly in love with Mandy; the Boogeyman, a bully who's lost his ability to scare people; and the Grim Reaper, a skeletal Mr. Death who's beleaguered by the constant company of Billy and Mandy. In\", \"Billy and Mandy's Big Boogey Adventure\", ', Billy and Mandy have recently won ownership of the Grim Reaper and their unceasing demands to accompany him as he drags unsuspecting souls to their deaths is cramping the Grim Reaper\\'s style--so much so that one of his intended victims gets away. Grim is put on trial and fired from his deathly employment which leads him, Mandy, Billy, and Irwin to embark on a quest to capture Horror\\'s Hand in hopes of utilizing its evil powers to get Grim\\'s job back and cause widespread suffering throughout the world. The Boogeyman, Grim\\'s rival since middle school, is experiencing a personal crisis because he can\\'t scare modern children and is also plotting to capture Horror\\'s Hand and then use it to transform himself into everyone\\'s worst nightmare. Grim, Billy, Mandy, Irwin, and Boogeyman battle each other and a host of frightening monsters that include a band of pirates along the river Styx, and Billybot and Mandybot robots from the future in a fight that forces each character to face his/her own worst fears. Bonus features include the original \"Bully Boogie\" short which explores the middle school beginnings of the feud between Boogeyman and Grim Reaper and a \"Behind the Voices\" featurette with interviews with creator Maxwell Atoms, Greg Eagles (Grim), Richard Horvitz (Billy), and Grey Delisle (Mandy). (Ages 7 and older)', '--Tami Horiuchi']\n{'Genre': 'Kids & Family', 'Format': 'Animated, Color, Widescreen, NTSC, DVD, Closed-captioned', 'Contributor': 'Renee Raudman, Maxwell Atoms, Richard Steven Horvitz, Rob Desales, Greg Eagles, Dee Bradley Baker, Jane Carr, Rachael MacFarlane, Grey DeLisle, Jennifer Hale, Chris Cox, Vanessa Marshall, Phil LaMarrRenee Raudman, Maxwell Atoms, Richard Steven Horvitz, Rob Desales, Greg Eagles, Dee Bradley Baker, Jane Carr, Rachael MacFarlane, Grey DeLisle, Jennifer Hale, Chris Cox, Vanessa Marshall, Phil LaMarr  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Media Format': 'Animated, Color, Widescreen, NTSC, DVD, Closed-captioned', 'Run time': '30 minutes', 'Release date': 'April 3, 2007', 'Actors': 'Greg Eagles, Richard Steven Horvitz, Grey DeLisle, Vanessa Marshall, Jennifer Hale', 'Subtitles': 'English, Spanish, French', 'Studio': 'Turner Home Ent', 'Writers': 'Maxwell Atoms, Rob Desales', 'Number of discs': '1'}\nDecent item, I wish that it had additional content and information.\nNostalgia\nPaw Patrol: Pups Save Christmas\nOwen Mason  (Actor),     Jamie Whitney  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Your little heroes can romp to the rescue with the PAW Patrol pups, as they use their tools, tech, vehicles, and problem-solving skills to save Adventure Bay.']\n{'Genre': 'Animation/Holidays', 'Format': 'NTSC, Widescreen', 'Contributor': 'Jamie Whitney, Owen Mason', 'Language': 'English', 'Runtime': '1 hour and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43212933', 'Director': 'Jamie Whitney', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 14 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Owen Mason', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nMy 2 year old is obsessed. This was a good movie with many chapters. As soon as we get in the car my son asks for it to be turned on.\nGood movie, my son loves it!",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user continues to show a strong affinity for animated content, particularly those aimed at children and families, highlighting a fondness for nostalgic series. Their preference includes humorous narratives with fantasy elements and devious characters in playful yet sometimes dark storylines.\n\n- **Content Preferences:** They are likely to purchase DVDs featuring unique storylines, especially those that involve supernatural or holiday themes, and appreciate entertaining content suitable for young audiences. The user values enjoyable experiences for their child, indicating a focus on family-friendly entertainment.\n\n- **Rating Behavior:** The user exhibits a discerning taste and is inclined to rate products positively when they resonate with family needs, as evidenced by their recent high rating for a children's movie. Their ratings reflect satisfaction in engaging content, especially when it caters to their child.\n\n- **Value for Information:** Despite enjoying lighter content, the user still desires some depth, notably in terms of bonus material and behind-the-scenes insights, suggesting a well-rounded approach to media consumption.\n\n- **Nostalgia Factor:** Nostalgia remains significant, influencing their interaction with animated content and their appreciation for childhood favorites, while their recent engagement underscores a commitment to sharing that joy with their child. \n\nOverall, the user appreciates animated family features that provide entertainment and engagement for kids, balancing their own nostalgic preferences with a focus on quality content for their family.",
  "metrics": {
    "rouge1_f": 0.158,
    "rouge2_f": 0.01603206412825651,
    "rougeL_f": 0.082,
    "meteor": 0.05500550055005499,
    "bleu1": 0.018475310288528567,
    "bleu2": 0.005487767988538587,
    "bleu3": 0.0008507894364225792,
    "bleu4": 0.00033529566166674493,
    "bertscore_precision": 0.3514138162136078,
    "bertscore_recall": 0.45531582832336426,
    "bertscore_f1": 0.3966738283634186
  }
}