{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Paw Patrol: Meet Everest!\nReview Date: 2018/12/05\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Join the PAW Patrol for 7 cool rescues featuring the team’s new snow pup hero! Meet Everest in her first ever rescue when she saves a stranded Jake, and check out her PAW some skills as she plows through a snowed-over Adventure Bay and rescues deer from some slippery ice! Then join Skye and the team for 4 more high-flying adventures!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family/Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Contributor': 'PAW PATROL: MEET EVEREST!', 'Language': 'English', 'Runtime': '1 hour and 36 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.26 Ounces', 'Item model number': '59171674000', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'September 1, 2015', 'Dubbed': 'French, Spanish', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My son loves all things Paw Patrol. This is a good movie and enjoyable considering I’m usually watching it with him.\nReview Title: Good clean movie, great content for kids\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Grim Adventures of Billy and Mandy - Billy and Mandy's Big Boogey Adventure [DVD]\nGreg Eagles  (Actor),     Richard Steven Horvitz  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"It's Billy, Mandy and Grim versus the Boogeyman in an epic tale of monster pirates, futuristic robots, evil artifacts, and snot. When the underworld strips Grim of his powers (due to years of Billy and Mandy abusing them), Billy, Mandy, Grim and Irwin must race the Boogey Man and a crew of monster pirates to capture Horror's Hand, a powerful artifact capable of making whoever wields it into the scariest being alive.\", 'Amazon.com', 'Devious characters and nightmarish happenings are the norm in the twisted, cell animated world of', 'The Grim Adventures of Billy and Mandy', \"where evil clashes with evil and mean meets meaner on a daily basis. The cast of characters includes Mandy, a surly, controlling, sarcastic girl; Billy, a dim-witted, hyperactive boy obsessed with snot and other bodily fluids; Irwin, a boy who's madly in love with Mandy; the Boogeyman, a bully who's lost his ability to scare people; and the Grim Reaper, a skeletal Mr. Death who's beleaguered by the constant company of Billy and Mandy. In\", \"Billy and Mandy's Big Boogey Adventure\", ', Billy and Mandy have recently won ownership of the Grim Reaper and their unceasing demands to accompany him as he drags unsuspecting souls to their deaths is cramping the Grim Reaper\\'s style--so much so that one of his intended victims gets away. Grim is put on trial and fired from his deathly employment which leads him, Mandy, Billy, and Irwin to embark on a quest to capture Horror\\'s Hand in hopes of utilizing its evil powers to get Grim\\'s job back and cause widespread suffering throughout the world. The Boogeyman, Grim\\'s rival since middle school, is experiencing a personal crisis because he can\\'t scare modern children and is also plotting to capture Horror\\'s Hand and then use it to transform himself into everyone\\'s worst nightmare. Grim, Billy, Mandy, Irwin, and Boogeyman battle each other and a host of frightening monsters that include a band of pirates along the river Styx, and Billybot and Mandybot robots from the future in a fight that forces each character to face his/her own worst fears. Bonus features include the original \"Bully Boogie\" short which explores the middle school beginnings of the feud between Boogeyman and Grim Reaper and a \"Behind the Voices\" featurette with interviews with creator Maxwell Atoms, Greg Eagles (Grim), Richard Horvitz (Billy), and Grey Delisle (Mandy). (Ages 7 and older)', '--Tami Horiuchi']\n{'Genre': 'Kids & Family', 'Format': 'Animated, Color, Widescreen, NTSC, DVD, Closed-captioned', 'Contributor': 'Renee Raudman, Maxwell Atoms, Richard Steven Horvitz, Rob Desales, Greg Eagles, Dee Bradley Baker, Jane Carr, Rachael MacFarlane, Grey DeLisle, Jennifer Hale, Chris Cox, Vanessa Marshall, Phil LaMarrRenee Raudman, Maxwell Atoms, Richard Steven Horvitz, Rob Desales, Greg Eagles, Dee Bradley Baker, Jane Carr, Rachael MacFarlane, Grey DeLisle, Jennifer Hale, Chris Cox, Vanessa Marshall, Phil LaMarr  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Media Format': 'Animated, Color, Widescreen, NTSC, DVD, Closed-captioned', 'Run time': '30 minutes', 'Release date': 'April 3, 2007', 'Actors': 'Greg Eagles, Richard Steven Horvitz, Grey DeLisle, Vanessa Marshall, Jennifer Hale', 'Subtitles': 'English, Spanish, French', 'Studio': 'Turner Home Ent', 'Writers': 'Maxwell Atoms, Rob Desales', 'Number of discs': '1'}\nDecent item, I wish that it had additional content and information.\nNostalgia\nPaw Patrol: Pups Save Christmas\nOwen Mason  (Actor),     Jamie Whitney  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Your little heroes can romp to the rescue with the PAW Patrol pups, as they use their tools, tech, vehicles, and problem-solving skills to save Adventure Bay.']\n{'Genre': 'Animation/Holidays', 'Format': 'NTSC, Widescreen', 'Contributor': 'Jamie Whitney, Owen Mason', 'Language': 'English', 'Runtime': '1 hour and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43212933', 'Director': 'Jamie Whitney', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 14 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Owen Mason', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nMy 2 year old is obsessed. This was a good movie with many chapters. As soon as we get in the car my son asks for it to be turned on.\nGood movie, my son loves it!\nPaw Patrol: Meet Everest!\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Join the PAW Patrol for 7 cool rescues featuring the team’s new snow pup hero! Meet Everest in her first ever rescue when she saves a stranded Jake, and check out her PAW some skills as she plows through a snowed-over Adventure Bay and rescues deer from some slippery ice! Then join Skye and the team for 4 more high-flying adventures!']\n{'Genre': 'Kids & Family/Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Contributor': 'PAW PATROL: MEET EVEREST!', 'Language': 'English', 'Runtime': '1 hour and 36 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.26 Ounces', 'Item model number': '59171674000', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'September 1, 2015', 'Dubbed': 'French, Spanish', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy son loves all things Paw Patrol. This is a good movie and enjoyable considering I’m usually watching it with him.\nGood clean movie, great content for kids",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user has a strong affinity for animated content, particularly aimed at children and families, with a focus on nostalgic series. They enjoy humorous narratives with fantasy elements and playful characters, often highlighted by devious undertones.\n\n- **Content Preferences:** The user actively seeks out family-friendly DVDs that feature unique and engaging storylines, especially those incorporating supernatural or holiday themes. Their commitment to providing enjoyable experiences for their child is evident in their selection of content.\n\n- **Rating Behavior:** The user exhibits a discerning taste, consistently assigning high ratings to products that resonate with family needs. Their recent rating of a children's movie reflects satisfaction in engaging material that entertains and captivates young audiences.\n\n- **Value for Information:** While the user enjoys lighter content, they appreciate depth, particularly in bonus features and behind-the-scenes insights, indicating a well-rounded media consumption approach.\n\n- **Nostalgia Factor:** Nostalgia plays a significant role in the user's interactions with animated content, influencing their appreciation for childhood favorites and their desire to share these experiences with their child.\n\n- **Recent Engagement:** Their latest purchase, featuring beloved characters and engaging adventures, demonstrates their commitment to quality animated content that delights both their child and themselves, reinforcing their focus on entertaining and clean family media. \n\nOverall, the user values animated family features that are both entertaining and engaging for children while balancing nostalgic preferences.",
  "metrics": {
    "rouge1_f": 0.1537190082644628,
    "rouge2_f": 0.009933774834437087,
    "rougeL_f": 0.08099173553719008,
    "meteor": 0.05007432908223143,
    "bleu1": 0.007950934055395292,
    "bleu2": 0.0015695755044073403,
    "bleu3": 0.0002675389997918157,
    "bleu4": 0.00011055248482758003,
    "bertscore_precision": 0.35021668672561646,
    "bertscore_recall": 0.46404576301574707,
    "bertscore_f1": 0.39917489886283875
  }
}