{
  "interaction_number": 20,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/05/29\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Blackwood'], 'Producers': ['Michael Blackwood'], 'Starring': ['Robert A.M. Stern', 'Bruce Graham', 'Arthur Drexler'], 'Studio': ['Michael Blackwood Productions']}\nReview Text: I understand now what's wrong with the Lake Shore Drive buildings: they were things of sublime beauty before the outer walls went on, which are, as Posener points out, all gunked up decoratively. They're astonishingly beautiful buildings, you just can't see it. And then when that Park Ave heiress turned up looking for an architect she misread the building armor as the idea, as city toughness, and then you got that weird Seagram thing just being a...member in the middle of the avenue, with all that wasted real estate in front of it. Too bad. Much beauty along the way, though.\nReview Title: No accounting for taste\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Three Colors: Blue\nJuliette Binoche  (Actor),     Zbigniew Zamachowski  (Actor),     Krzysztof Kieslowski  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"The first installment of the late Polish director Krzysztof Kieslowski's trilogy on Liberty, Equality, and Fraternity, the three colors of the French flag. Blue is the most somber of the three, a movie dominated by feelings of grief. As the film begins, a\"]\n{'Format': 'NTSC', 'Contributor': 'Claude Duneton, Edward Zebrowski, Zbigniew Zamachowski, Florence Pernel, Benoît Régent, Juliette Binoche, Marin Karmitz, Philippe Volter, Agnieszka Holland, Julie Delpy, Florence Vignon, Krzysztof Piesiewicz, Charlotte Véry, Slawomir Idziak, Emmanuelle Riva, Hugues Quester, Hélène Vincent, Krzysztof KieslowskiClaude Duneton, Edward Zebrowski, Zbigniew Zamachowski, Florence Pernel, Benoît Régent, Juliette Binoche, Marin Karmitz, Philippe Volter, Agnieszka Holland, Julie Delpy, Florence Vignon, Krzysztof Piesiewicz, Charlotte Véry, Slawomir Idziak, Emmanuelle Riva, Hugues…  See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Krzysztof Kieslowski', 'Media Format': 'NTSC', 'Run time': '1 hour and 38 minutes', 'Actors': 'Juliette Binoche, Zbigniew Zamachowski, Julie Delpy, Benoît Régent, Florence Pernel', 'Producers': 'Marin Karmitz', 'Studio': 'Imports', 'Writers': 'Agnieszka Holland, Edward Zebrowski, Krzysztof Kieslowski, Krzysztof Piesiewicz, Slawomir Idziak'}\nI've seen this movie many times since 1995, but last night I watched it for the first time as an artist and single mother, and I realize I hadn't appreciated before the costs of her liberty, the value of the liberty, or the cruelty inherent in the art that carried her along after her daughter's death, the genuine death of her marriage, even (to twist the knife) the loss of her mother's memory.  He went right to the joint, Kieslowski did.  I couldn't watch it all, this time.<br /><br />I don't think the blue mobile was her daughter's, by the way. I accept that she was the composer, and that for her there was a synaesthesia with the music and the blue lights.  I expect the blue room was her composing room, and that the mobile was a thing from her art, which is why in the end she took it along.  She had to; she needed it.  The music needed it.\na sharp choice of story for the theme\nGood Night, and Good Luck (Widescreen Edition)\nDavid Strathairn  (Actor),     Patricia Clarkson  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, Television\n['Good Night and Good Luck (DVD) (WS)', \"In the early 1950's, the threat of Communism created an air of paranoia in the United States and exploiting those fears was Senator Joseph McCarthy. CBS reporter Edward R. Murrow and his producer Fred W. Friendly decided to take a stand and challenge.\", ']]>']\n{'Genre': 'Documentary, Drama, Historical', 'Format': 'Black & White, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby', 'Contributor': 'Frank Langella, Jeff Daniels, Ben Cosgrove, Alex Borstein, Tate Donovan, Jennifer Todd, Mark Cuban, Matt Brandon Ross, Robert Downey Jr., David Strathairn, Steven Soderbergh, Patricia Clarkson, George Clooney, Ray Wise, Marion Kodama Yue, Robert John Burke, Todd Wagner, Marc Butan, Reed Diamond, Rose Abdoo, Jeff SkollFrank Langella, Jeff Daniels, Ben Cosgrove, Alex Borstein, Tate Donovan, Jennifer Todd, Mark Cuban, Matt Brandon Ross, Robert Downey Jr., David Strathairn, Steven Soderbergh, Patricia Clarkson, George Clooney, Ray Wise, Marion Kodama Yue, Robert John Burke, Todd Wagner…   See more', 'Initial release date': '2006-05-23', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.4 Ounces', 'Item model number': '73678', 'Director': 'George Clooney', 'Media Format': 'Black & White, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 23, 2006', 'Actors': 'David Strathairn, Patricia Clarkson, George Clooney, Jeff Daniels, Robert Downey Jr.', 'Subtitles': 'English, Spanish, French', 'Producers': 'Steven Soderbergh, George Clooney, Ben Cosgrove, Marion Kodama Yue, Jennifer Todd', 'Studio': 'Studio Distribution Services', 'Writers': 'George Clooney, Marion Kodama Yue', 'Number of discs': '1'}\nIt's very pretty, I'll say that for it, and the acting's certainly pro. That b/w process they used is terrifically lush, almost Max Factor.<br /><br />Beyond that, though...boy, this is Journalism Heroes 101. The McCarthy story's a great one and Murrow was a serious guy, but the story's reduced to semaphore for this thing, a series of journalistic cliches. All the President's Men did much better, and that was with Woodward writing his patented Fantasy Internal Dialogue of High Officials. I'm sure the excuse goes that it's a movie, it's supposed to entertain and teach people who've never heard of Joe McCarthy, but that's all messed up. If they've never heard of Joe McCarthy, you want to serve up a shovelful of reality, not gleanings.<br /><br />The acting-to-newsreel trick's a nice one, but it doesn't compensate for the thinness of the storytelling or the punch-pulling with the elbow out to Mars (there's a suicide? I'm shocked!). If you're not just looking for eye candy, try actual books instead on this subject. There's no end of books on both McCarthy and CBS -- I think Fred Friendly wrote one of his own.\nDumbed-down history for the NCLB era\n{'Subtitles': ['None available'], 'Directors': ['Guy Maddin'], 'Producers': ['Jody Shapiro', 'Phyllis Laing'], 'Starring': ['Ann Savage', 'Louis Negin', 'Darcy Fehr']}\nI totally believe everything he told me about Winnipeg. I believe the snow, the sleepiness, the ectoplasm, the lost and benumbed waspiness of it, the wackadoodle mom, the, yeah, I buy it. I still don't want to go there but it's nice that it's dear to someone.\nI believe it.\n{'Subtitles': ['None available'], 'Directors': ['Wendy Keys'], 'Producers': ['Edgar B. Howard', 'Wendy Keys'], 'Starring': ['Milton Glaser'], 'Studio': ['Arthouse Films/Curiously Bright']}\nI hadn't realized how responsible Glaser was for the look and feel of my childhood. I don't much like it -- it makes me feel queasy -- but I appreciate and understand what he was doing, and it's a fine doc. A must for design students, I'd think.\nRock on.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Louis Malle'], 'Producers': ['Fred Berner'], 'Starring': ['Andre Gregory', 'Brooke Smith', 'Julianne Moore'], 'Studio': ['Sony Pictures Classics']}\nThis is magnificent, even better than I remember. You forget that Wally Shawn can act like this -- what a curdled, potent character. (Where has he been?) The conceits aren't bothersome, they're fine, it's really too painful to watch all at once. It's really theatre, it's film but it's theatre. I don't know how they made that work.\neven better than I remember\nSunflower (English Subtitled)\nInternational, Arthouse, Passionate, Sad\n[\"An Oscar nominee for Best Score (Henry Mancini), SUNFLOWER is a grandly emotional melodrama featuring a stunning performance from Sophia Loren.In another of the actress's great collaborations with director Vittorio De Sica (THE BICYCLE THIEF), Loren plays Giovanna, a steel-willed Italian woman on a desperate search to find her husband Antonio (Marcello Mastroianni), who has gone missing on the WWII battlefields of Russia. Making the grueling overland journey years after the end of the war, she tracks Antonio down and finds him a changed man. This heart-wrenching reunion will forever alter the course of their lives.\"]\n{'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Vittorio De Sica'], 'Producers': ['Carlo Ponti', 'Arthur Cohn', 'Giorgi Mdivani', 'Joseph E. Levine'], 'Starring': ['Sophia Loren', 'Marcello Mastroianni']}\nUnderused actors, syrupy plot.\nTwo Stars\nA Special Day (English Subtitled)\nDrama, Arthouse, Compelling, Sentimental\n['Italian dream team Sophia Loren and Marcello Mastroianni are cast against type and deliver two of the finest performances of their careers in this moving, quietly subversive drama set in Rome on the historic day when Benito Mussolini and the city first rolled out the red carpet for Adolf Hitler.']\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Ettore Scola'], 'Producers': ['Carlo Ponti'], 'Starring': ['Marcello Mastroianni', 'Sophia Loren']}\nit's a short story, not a movie. A very, very good short story that makes clear how wildly underused both these actors were throughout their careers, all this distraction about sex symbols.\nvery good short story that makes clear how wildly underused both ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bernardo Bertolucci'], 'Producers': ['Alberto Grimaldi'], 'Starring': ['Marlon Brando', 'Maria Schneider'], 'Studio': ['MGM Domestic Television Distri']}\nWhy, why did I think this would be a good idea. This is what directors did in the 70s because the internet hadn't been invented yet. Urgh.\nwhy did I think this would be a good idea. This is what directors did in the ...\n{'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stanley Kramer'], 'Producers': ['Stanley Kramer'], 'Starring': ['Spencer Tracy', 'Fredric March', 'Gene Kelly']}\nAll that shade and it's still too hot. Grand movie.\nYes, you should watch it.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joanne McGrath'], 'Starring': ['Dermot Bannan'], 'Studio': ['Indigenius']}\nI really did want to like this — the projects are interesting, the homeowners are hugely sympathetic, and Dermot’s quite likeable at first blush. But over and over he takes to bullying and talking over his female clients until I want to shove him out of the room and have a shouting match with him myself. I’m sure the idea was to make a bit of theatre here, but it’s in no way amusing.<br /><br />Apart from which, unfortunately, he just isn’t that good an architect. He’s all right, I guess, but it’s all much of a muchness, the same standard high-end modernism-inflected boxes with big windows. Lots of talk about wanting to preserve the charm of some wreck and then delivering some atrium-ridden nightmare to heat. It’s always an improvement, and certainly things could’ve gone much worse, but...I’m sorry, Dermot, you’re not an artist, and frankly your interiors and additions often don’t really suit the old buildings.\nFor the love of god, stop bullying the woman clients\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Batty'], 'Producers': ['Simon Fuller', 'Michael Caine', 'Dick Clement', 'Ian La Frenais', \"Fodhla Cronin O'Reilly\"], 'Starring': ['David Bailey', 'Michael Caine', 'Joan Collins'], 'Studio': ['Gravitas Ventures']}\nI mean....<br /><br />I get that at the end of your life you want to look back, see what it was, remember why it was, relive the good times. It’s just that the rest of us have had to live your particular good time along with you for over fifty bleeding years, and it’s been incredibly damaging. Freedom, self-expression, that’s all great, but so is knowing when to stop. We’re all painfully aware that that’s been a missing feature, and an hour in I just couldn’t watch any more. The film clips were good, entertaining, not actually terribly novel (like I said, it’s been more than 50 years), but what was missing overwhelmed what was there if you weren’t just having a party in the rearview mirror.<br /><br />I’d have welcomed though hearing more from everyone’s non-frugging parents. And more recognition of what you got wrong, how you’ve noticed it at this point. If you’ve noticed it.\nNice footage but it’s endless Boomers partying in the mirror\n{'Content advisory': ['Alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Hugh Hudson'], 'Producers': ['David Puttnam'], 'Starring': ['Nicholas Farrell', 'Nigel Havers', 'Ian Charleson'], 'Studio': ['Warner Bros. Domestic Televisi']}\nWow, this one didn’t hold up that well. The “I have a massive chip on my shoulder because I’m a Jew in antisemitic upper-class England” is wildly, unwatchably OTT, and the film’s got some of the most hysterically closeted-homoerotic scenes I’ve ever seen on film. THAT IS SOME MIGHTY SLOW CHANGING IN THE LOCKER ROOM, MY MAN. I sort of felt like I should leave and give them privacy, or head for the Personal Best section because I plainly had not been invited to this viewing gallery, but then all they did was shake hands sportingly. Also: many, many slow-mo running scenes, often from multiple angles, for those of you who dig the bony knees and flapping shorts.<br /><br />That said, they are indeed handsome men, and when the running’s really happening, it’s very exciting for those of you whose idea of good sports spectator fun is watching people run fast and shouting “Go!” a lot while jumping up and down. But the scenery-chewing got me in the end and I couldn’t watch all the way through.\nWhat a strange, lavish, repressed time the ‘80s were.\n{'Audio languages': ['Deutsch'], 'Subtitles': ['English [CC]'], 'Directors': ['Gary Hustwit'], 'Producers': ['Gary Hustwit', 'Eugen Bräunig', 'Jessica Edwards'], 'Starring': ['Dieter Rams', 'Naoto Fukasawa', 'Sophie Lovell']}\nOdd doc about an odd duck whose postwar-democratic impulses are routinely overlooked; his is really just a particular manifestation of a social movement whose reasons too many people have forgotten. Very awkward watching the young people treat him like a god. I’d say the most important thing you can remember from this is that the 606 shelves are made for *small apartments*. For social housing. Where people can live with some social support and without constant terror of poverty and eviction. It was a good idea.\nPay attention to the word “democratic”\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tad Fettig', 'Mark Decena'], 'Producers': ['PBS'], 'Starring': ['Brad Pitt'], 'Studio': ['PBS']}\nThese are all really interesting projects and well worth hearing about. After four or five episodes, though, I found that I was listening to man after man after man after man. Nearly all middle-aged, middle-class. Nearly all white. All well-educated in similar ways. Nearly all brimming with biases about how people live and want to live. And while I recognize that this series was made several years ago, there's just no excuse for this sort of thing anymore.<br /><br />The NYC low-income housing project -- perhaps because of NYC's own processes, or because of Rose's -- got a good earful from prospective residents, and heard an entirely different set of concerns than the residents had...and promptly translated them into a professional middle-class sensibilty. Here's a lady who's terrified that her kid will die of an asthma attack, wants to know about air quality, so their solutions are...nope, not HVAC, duct cleaning, interior air quality, nearby highway air-intake filtration. Instead? An organic market on the ground floor, a gym and a health clinic.<br /><br />I was thinking afterwards about those residents, about how you live when you're poor and there are poor old people with no one most of the time, and poor families, mostly single-mother families. And I was thinking about The Pruitt-Igoe Myth, another housing doc, and how one of the residents remembered the sense of community and playing records so the whole hall could hear, opening up the windows for a dance party. I thought: these mothers need a courtyard, but close together, and not a skyscraper. They need to be able to wave to each other and pass things over window to window, shout to please come over and watch the kids for a minute. To have the kids playing down below so all the mothers can look out the window and see what's happening, not rooftop gardens in eco-sensitive planters. And they need this because they can't function without each other's help. They're poor, that's how it works. They can't afford to think only about their apartments and the gardening class schedule.<br /><br />The architects in this series aren't thinking about these things because it hasn't been their job to bring children up, and if they've ever been poor it hasn't been for many decades. They're thinking about what the other architects are thinking about. So it's a very interesting series, for sure. But it's also a very powerful argument for why every field needs strong diversity and a habit of looking around every gathering and saying, \"who are we missing?\"\nGreat intentions, projects undermined by a monoculture of architects & planners\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Niklas Lindgren'], 'Producers': ['Laura Kuulasmaa', 'Sari Lempiäinen'], 'Starring': ['Anna Paavilainen', 'Elmer Bäck', 'Mikko Penttilä'], 'Studio': ['AMC Plus Independent']}\nGreat stuff, and some lowkey, terrific acting. Micke’s mom is hilarious. Theme by Taira hasn’t left my head in two days. Storylines aren’t hyped with tension beyond acute social situations, which I like; it’s character-driven, though Aino needs more sense of character that’s not in-reaction-to. Scenes with her mom were lovely. Their flat’s making me self-conscious about my own furnishings....Smarter than Easy, infinitely less self-absorbed and more company-collegial than Portlandia.<br /><br />Amazon cataloguer doesn’t get the series, though; just tags foreign/Scandi and you get a lot of foreign true crime in your feed.\nEnglish major? Do it.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Français'], 'Subtitles': ['English [CC]', 'Français'], 'Directors': ['Phyllida Lloyd'], 'Producers': ['Rory Gilmartin', 'Ed Guiney', 'Sharon Horgan'], 'Starring': ['Clare Dunne', 'Harriet Walter', 'Conleth Hill'], 'Studio': ['Amazon Studios']}\nI could not have ruder words for this English knighted **** of a playwright who wrote this thing for doing such a disservice to single mothers, right down to “it takes a man to save her”. You may be all misty and feeling wonderful about it, but if you believe that any of this is representative of single motherhood, let alone single motherhood after abuse, how many single moms have you devoted that much effort and time to? Exactly, unless they’re your own daughter. And neither does anyone else.<br /><br />Here’s where single moms generally find help, when they find it at all:<br /><br />- The next abusive, predatory man<br />- The women who run the shelters and support-collecting agencies<br />- The women lawyers and legislators who are occasionally able to make the law work for them<br />- A woman at the kids’ school<br />- Their moms and sisters, sometimes<br /><br />If you actually believe that some lovely, competent, resource-rich community comes together to help the plucky abuse-escapee mom in America, I have a shelter to introduce you to. When are you signing up to dedicate a significant slice of your life to the women and children there? You know, ongoing, committed time? Right. You and everybody else. But hey, now you feel great and inspired, so why should you worry about actual single moms? Surely there’s a nice fairy tale taking care of them all.<br /><br />For the next fairy tale in the book, please turn to “seek help from your faith community.”<br /><br />What actually helps: flexible and part-time salaried jobs with benefits that recognize that kids don’t hatch from eggs and raise themselves. Reasonable quality creches like the rest of the world has. Decent educational systems. All the things that make it possible for single parents to make a reasonable living while bringing up the kids. If you insist on building a society whose entire purpose is to defend men’s ideas of themselves as the big heroes in the story, and entitled to women’s free service, then you get misery for single mothers and their kids. Skip that part, and actually acknowledge violence against women when you vote and in how you build your police & legal systems, and single mothers aren’t pore desperate abused-but-gritty hardship cases fit for making you feel all glowy in a fairy tale. They just become normal parents, raising kids, paying bills.<br /><br />In orther words, it’s up to you, how you vote, what you tell your legislators & councils you want. You don’t get to feel glowy and inspired that way because you don’t get to see a struggle-and-triumph story? Well, maybe it’s not supposed to be about you.\nunrepresentative garbage that throws actual single moms under the bus\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Apted'], 'Studio': ['BritBox']}\nRly.\nStill no 63 Up?\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dennis Scholl'], 'Producers': ['Dennis Scholl', 'Cristina Dumas', 'Marlon Johnson', 'Konstantia Kontaxis'], 'Starring': ['Clyfford Still', 'Mark Bradford'], 'Studio': ['Kino Lorber']}\nAbsolutely a worthwhile watch, but if you don't already know Still's work you're unlikely to come out much the wiser about it. You can of course remedy this by going and looking at it. Despite nan's review below you can certainly find it in major American museums; I grew up with it and frankly hadn't known he'd been an outsider of any kind. And I don't know that he was; he merely wasn't careerist or a pedagogue. Certainly recognized in the top circles though.\nMuch about the artist, not so much about the art\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Curtis'], 'Studio': ['Adam Curtis']}\nAdam Curtis has been working in this vein for decades, and I was expecting some North-London socialist-bookshop dramatics, but as it turned out he didn't need them here; the story overwhelmed his imagination in how selfish people make things go wrong. Everything's bigger in America, I guess.<br /><br />He's telling the story of my adulthood. I watched all of this, as a young and then not-so-young person trained in economics, trade, and international relations, and it was all as he describes. Actually what he describes doesn't begin to touch the Steinbeck-quality realities of how things went, and of what it's meant in terms of race, which we've only just started noticing, here in whiteland. For that you want Giorgio Angelini's documentary Owned, which is also all true. Neither tells the story of women. We've been too busy working for free or near-free for other people to make so many documentaries.<br /><br />But yes. Selfishness destroys societies, and Atlas Shrugged appeals to people who like pulp fiction dressed up to sound meaningful. It's not even good pulp fiction. It's got one good impassioned speech, which is about the nature of money, and the rest can be stripped of the ridiculous B-movie fiction full of Rand's disturbed sexuality and scars from Soviet Communism, and condensed into her pamphlet Anthem. She only ever wrote the same thing over and over again. The fact that Greenspan found any of this appealing...well, it's no surprise, then, that he was slow on the uptake about what people are like, and later professed to be shocked to find that the bond raters and accountancies were on the take, and that rational magic wasn't happening all around him.<br /><br />As for me, I remember reading Atlas Shrugged for the first time: I was 18 and a copy was being passed hand to hand among classmates. So I got it and found it to be such dreadful, miserably-written garbage -- both in its \"philosophy\" and as fiction -- that I actually threw it. I threw an actual book. I don't think I'd ever done that before. (Then, of course, I picked it up and waded through the rest to see if it got any better. It didn't.) Several years later I went back to see what had provoked that kind of reaction, and when I read it through again I heard a terribly sad thing: a woman trapped mentally in the abuses of the Soviet systems she'd grown up in. Since then I've heard echoes of the same from Soviet/Russian émigrés on the left and the right, and all I can say about that is that you have to discount the fact that they still see their old world in front of their eyes and hear its sentiments about people, and these are stronger than the vision of the people actually in front of them. Still tedious garbage as a novel, though, and still nothing but solipsism and masochistic fantasies as a philosophy, with a heavy dose of \"I'm going to the garden to eat worms.\" And still attractive to tech/finbros who can't read but want permission to be wholly selfish. Then again, they always like the ladies who give them that, don't they.\nThis sounds like hysterical propaganda and is all true.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Blackwood'], 'Producers': ['Michael Blackwood'], 'Starring': ['Robert A.M. Stern', 'Bruce Graham', 'Arthur Drexler'], 'Studio': ['Michael Blackwood Productions']}\nI understand now what's wrong with the Lake Shore Drive buildings: they were things of sublime beauty before the outer walls went on, which are, as Posener points out, all gunked up decoratively. They're astonishingly beautiful buildings, you just can't see it. And then when that Park Ave heiress turned up looking for an architect she misread the building armor as the idea, as city toughness, and then you got that weird Seagram thing just being a...member in the middle of the avenue, with all that wasted real estate in front of it. Too bad. Much beauty along the way, though.\nNo accounting for taste",
  "actual_interaction": {
    "rating": 5.0,
    "title": "No accounting for taste",
    "text": "I understand now what's wrong with the Lake Shore Drive buildings: they were things of sublime beauty before the outer walls went on, which are, as Posener points out, all gunked up decoratively. They're astonishingly beautiful buildings, you just can't see it. And then when that Park Ave heiress turned up looking for an architect she misread the building armor as the idea, as city toughness, and then you got that weird Seagram thing just being a...member in the middle of the avenue, with all that wasted real estate in front of it. Too bad. Much beauty along the way, though.",
    "images": [],
    "asin": "B073WK8MZV",
    "parent_asin": "B073WK8MZV",
    "user_id": "AHA5VZQKVUKTVMK7HZDKMWEEVUWQ",
    "timestamp": "2021-05-29 18:52:23.307000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.5,
    "rating_number": 29,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fa5d067954ffd0b3f37f89e1a1cd1e4bd0e9a9dbcd89fe69a92f734e0e2f935a._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fa5d067954ffd0b3f37f89e1a1cd1e4bd0e9a9dbcd89fe69a92f734e0e2f935a._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fa5d067954ffd0b3f37f89e1a1cd1e4bd0e9a9dbcd89fe69a92f734e0e2f935a._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fa5d067954ffd0b3f37f89e1a1cd1e4bd0e9a9dbcd89fe69a92f734e0e2f935a._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fa5d067954ffd0b3f37f89e1a1cd1e4bd0e9a9dbcd89fe69a92f734e0e2f935a._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fa5d067954ffd0b3f37f89e1a1cd1e4bd0e9a9dbcd89fe69a92f734e0e2f935a._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Michael Blackwood"
      ],
      "Producers": [
        "Michael Blackwood"
      ],
      "Starring": [
        "Robert A.M. Stern",
        "Bruce Graham",
        "Arthur Drexler"
      ],
      "Studio": [
        "Michael Blackwood Productions"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}