{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/10/24\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick'], 'Studio': ['CBS']}\nReview Text: Very good.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Babette's Feast [DVD]\nStphane Audran  (Actor),     Bodil Kjer  (Actor),     Gabriel Axel  (Director, Writer)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Product Description', 'Artistic, sensual and sacred passions unite in Babette\\'s Feast. Written and directed by Gabriel Axel, from a short story by Out of Africa\\'s Isak Dinesen, this Oscar(r)-winning*film offers \"an irresistible mixture of dry wit and robust humanity\" (Newsweek). Onthe desolate coast of Denmark live Martina and Philippa, the beautiful daughters of a devout clergyman who preaches salvation through self-denial. Both girls sacrifice youthful passion to faith and duty, and even many years after their father\\'s death, they keep his austere teachings alive among thetownspeople. But with the arrival of Babette, a mysterious refugee from France\\'s civil war, life for the sisters and their tiny hamlet begins to change. Soon, Babette has convinced them to try something truly outrageousa gourmet French meal! Her feast, of course, scandalizes the local elders. Just who is this strangely talented Babette, who has terrified this pious town with the prospect of losing their souls for enjoying too much earthly pleasure? *1987: Foreign Language Film', 'Amazon.com', 'Some movies can only be described as delicious. In', \"Babette's Feast\", \", a woman flees the French civil war and lands in a small seacoast village in Denmark, where she comes to work for two spinsters, devout daughters of a puritan minister. After many years, Babette unexpectedly wins a lottery, and decides to create a real French dinner--which leads the sisters to fear for their souls. Joining them for the meal will be a Danish general who, as a young soldier, courted one of the sisters, but she turned him away because of her religion. The village elders all resolve not to enjoy the meal, but can their moral fiber resist the sensual pleasure of Babette's cooking?\", \"Babette's Feast\", 'deservedly won the 1987 Academy Award for Best Foreign Language Film. This lovely movie is impeccably simple, yet its slender narrative contains a wealth of humor, melancholy, and hope.', '--Bret Fetzer']\n{'Genre': 'Foreign', 'Format': 'Closed-captioned, Color, DVD, Subtitled, Widescreen, NTSC, Letterboxed', 'Contributor': 'Ghita Nrby, Bodil Kjer, Asta Esper Hagen Andersen, Vibeke Hastrup, Jarl Kulle, Karen Blixen, Viggo Bentzon, Gert Bastian, Gabriel Axel, Birgitte Federspiel, Thomas Antoni, Stphane Audran, Jean-Philippe Lafont, Bibi AnderssonGhita Nrby, Bodil Kjer, Asta Esper Hagen Andersen, Vibeke Hastrup, Jarl Kulle, Karen Blixen, Viggo Bentzon, Gert Bastian, Gabriel Axel, Birgitte Federspiel, Thomas Antoni, Stphane Audran, Jean-Philippe Lafont, Bibi Andersson   See more', 'Language': 'English (Dolby Digital 1.0), Danish (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '9 x 5.5 x 0.5 inches; 1.6 Ounces', 'Director': 'Gabriel Axel', 'Media Format': 'Closed-captioned, Color, DVD, Subtitled, Widescreen, NTSC, Letterboxed', 'Run time': '1 hour and 42 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Stphane Audran, Bodil Kjer, Birgitte Federspiel, Jarl Kulle, Jean-Philippe Lafont', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Gabriel Axel, Karen Blixen', 'Number of discs': '1'}\nThis is a wonderful inspirational movie.  One person modestly changes an entire village with beautiful food.  It is a subtle movie, so don't expect a cooking lesson, or fast action.  It is a great rainy day movie.\nIF YOU LOVE FOOD - THIS IS A GREAT MOVIE\nNorth Face\nBenno Furmann  (Actor),     Johanna Wokalek  (Actor),     Philipp Stolzl  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'This is the incredible story behind the first ever attempted scaling of the North Face of the infamous Eiger mountain. Summer 1936. Bearing the expectations of a nation and their Fuhrer, two climbers set out to be the first to conquer the last great problem. But soon their ascent becomes a race for survival threatened by injury and extreme storms. Suddenly, it becomes a pulse-pounding race against both time and the awesome forces of nature.', 'Amazon.com', 'North Face', 'is a men vs. mountain adventure so harrowing and gripping that, as with the doomed sailors in', 'Das Boot', ', one almost forgets that the bruised, battered, and frostbitten climbers we\\'re urging onward are Nazis. Toni Kurz (Benno Fürmann) and Andi Hinterstoisser (Florian Lukas) are cocky mountaineers who \"will scale anything that\\'s tall.\" In 1936 they are prevailed upon to climb the unconquered 13,000-foot north face of the Eiger, \"the death wall\" and \"the last problem of the Alps,\" as a heroic and glorious prelude to the Berlin Olympic Games. Toni and Andi are not true believers (they ignore greetings of \"Heil Hitler\" as they quit the Bavarian Mountain Brigade). They\\'ve got company on their treacherous quest, two Austrian climbers. As long as', 'North Face', \"sticks to the mountain, it is viscerally thrilling and grueling. But the movie adds unnecessary baggage, a romantic subplot. Why is there a love story? Because it's there. Johanna Wokalek costars as Luise, an aspiring photojournalist and Toni's former girlfriend, who is covering the story with her boss, a Nazi sympathizer whose paper is a cog in the propaganda machine. Based on a true story,\", 'North Face', \"has a you-are-there immediacy and authenticity (the cinematography was honored with Germany's equivalent of the Academy Award) that transcends any dramatic missteps.\", '--Donald Liebenson', 'Review', 'Stunning! Takes you along on one of the great adventures of the 20th century. --Jeffrey Lyons, KNBC/LYONS DEN\"Powerfully Intense!\" --Rex Reed, The New York Observer\"Edge of the Seat Suspenseful!\" --Anthony Quinn, The Independent', 'See more']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Ulrich Tukur, Benno Furmann, Florian Lukas, Johanna Wokalek, Philipp Stolzl', 'Language': 'Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.57 x 5.38 x 7.51 inches; 2.56 Ounces', 'Item model number': 'unknown', 'Director': 'Philipp Stolzl', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'May 11, 2010', 'Actors': 'Benno Furmann, Johanna Wokalek, Ulrich Tukur, Florian Lukas', 'Subtitles': 'English', 'Studio': 'Music Box Films Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was filmed over the village where my family came from in Switzerland.  It is an incredible historical rendition of a time when modern climbing was in its birth.  The fact they did this with the type of rudimentary equipment they used is just amazing.  Spectacular views and filming.\nLeaves you Breathless!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti'], 'Producers': ['Michael Hirst', \"Morgan O'Sullivan\", 'John Weber', 'James Flynn', 'Sherry Marsh', 'Alan Gasmer', 'Shelia Hockin', 'Steve Wakefield', 'Keith Thompson'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Gabriel Byrne'], 'Studio': ['History']}\nReally give you a sense of what life may have been like.  Never a dull moment and you want to keep watching!\nCharacters with depth!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Atom Egoyan'], 'Producers': ['Atom Egoyan', 'Stephen Traynor', 'Simone Urdl', 'Jennifer Weiss'], 'Starring': ['Ryan Reynolds', 'Scott Speedman', 'Rosario Dawson'], 'Studio': ['A24 Distribution LLC']}\nIt was a pretty good movie.  Some unexpected twists and turns.\nFour Stars\nGame of Thrones: Season 4 (Blu-ray)\nPeter Dinklage  (Actor),     Nikolaj Coster-Waldau  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Game of Thrones is one of HBO’s signature series and a huge runaway hit for the network. This year, a plethora of compelling storylines will play out to their inevitable, and bloody, conclusions. As the season begins, encouraged by the Red Wedding slaughter in the Riverlands that wiped out many of their Stark nemeses, the Lannisters’ hold on the Iron Throne remains intact … but can they survive their own egos as well as new and ongoing threats from the south, north and east? While an unbowed Stannis Baratheon continues to rebuild his army in Dragonstone, a more immediate danger comes from the south, as Oberyn Martell, the Lannister-loathing “Red Viper of Dorne,” arrives at King’s Landing to attend Joffrey’s wedding to Margaery Tyrell, and perhaps act on an ulterior agenda. In the north, a depleted Night’s Watch seems overmatched against the inexorable Wall advances of Mance Rayder’s army of wildlings, which in turn is being trailed by an even more formidable foe: the undead White Walkers. If that’s not enough, Daenerys Targaryen, accompanied by her fierce trio of dragons and Unsullied army, is poised to \"liberate\" Meereen, the largest Slaver City in the east, which could provide her with an imposing force to execute her ultimate plan: to sail to Westeros and reclaim the Iron Throne the Lannisters usurped from her family.']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Digital_copy, Blu-ray, NTSC, Subtitled', 'Contributor': 'Jack Gleeson, Greg Spence, John Bradley, Liam Cunningham, Diana Rigg, Peter Dinklage, Charles Dance, Stephen Dillane, Frank Doelger, Gwendoline Christie, Rory McCann, Lena Headey, Jerome Flynn, Ciarán Hinds, Bernadette Caulfield, Kristofer Hivju, Rose Leslie, Carice van Houten, Nikolaj Coster-Waldau, David Benioff, George R.R. Martin, Sibel Kekilli, Alfie Allen, Vince Gerardis, Sophie Turner, Carolyn Strauss, Iain Glen, Emilia Clarke, Natalie Dormer, Conleth Hill, Kit Harington, Aidan Gillen, Dianna Rigg, Guymon Casady, Isaac Hempstead Wright, Maisie Williams, Chris Newman, D.B. WeissJack Gleeson, Greg Spence, John Bradley, Liam Cunningham, Diana Rigg, Peter Dinklage, Charles Dance, Stephen Dillane, Frank Doelger, Gwendoline Christie, Rory McCann, Lena Headey, Jerome Flynn, Ciarán Hinds, Bernadette Caulfield, Kristofer Hivju, Rose Leslie, Cari…   See more', 'Language': 'English (DTS-HD Master Audio 5.1), Spanish (DTS-HD Master Audio 5.1)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '29861825', 'Media Format': 'Digital_copy, Blu-ray, NTSC, Subtitled', 'Run time': '9 hours and 21 minutes', 'Release date': 'February 17, 2015', 'Actors': 'Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke, Kit Harington', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French', 'Producers': 'George R.R. Martin, Chris Newman, Greg Spence, Guymon Casady, Vince Gerardis', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReally good story continues.  Very adult content, but for once the DVD's are just about as good as the books.\nAmazing imagination.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jean-Marc Vallee'], 'Producers': ['Reese Witherspoon', 'Bruna Papandrea', 'Bill Pohlad'], 'Starring': ['Reese Witherspoon', 'Laura Dern'], 'Studio': ['20th Century Fox']}\nPretty good movie...  definitely worth watching.  You got the basic idea of what it was like for a &#34;broken&#34; person to try and heal herself by re-inventing herself.  I've known people who hiked the PCT and it is NOT for a beginner, as she was.  I've heard people say there was too much sex, but really -- broken women sometimes try to find human touch wherever they can, to feel closeness.  Having gone through a divorce, and much loss in her life; her mom at a young age,, as well as no real relationship with a father figure, it is really understandable.  The movie tries to deal with this aspect without dwelling on it.  The focus is on her journey to heal.  I recommend.\nJourney of one woman to find healing.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Sam Taylor-Johnson'], 'Producers': ['Michael De Luca', 'E L James', 'Dana Brunetti'], 'Starring': ['Dakota Johnson', 'Jamie Dornan', 'Jennifer Ehle'], 'Studio': ['Universal Pictures']}\nThe book was so very much better.  The movie leaves out a lot of their thoughts and the reasons for Grey's hangups.  The movie just touches the surface...  there is so much lost in the movie.  In addition to this, for some reason every three minutes the movie cut out on me and I had to back out of it and then resume.  I have a newer powerful computer and this has never happened with any other movies i've watched on here.  That my have colored my view a bit.  All in all it was an okay movie.\nSo Sp...\n{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth']}\nGood movie... not just for teens.  I'm looking forward to the second part.\nGet the popcorn ready!\n{'Content advisory': ['Violence', 'smoking'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Fincher'], 'Producers': ['Scott Rudin', 'Cean Chaffin', 'Søren Stærmose', 'Ole Søndberg'], 'Starring': ['Daniel Craig', 'Rooney Mara', 'Christopher Plummer'], 'Studio': ['Columbia Pictures']}\nI saw these movies in the Swedish version.  This was a little different, but it was also very good.  Great books make good movies.\nGood movie.\nHarry Potter: Complete 8-Film Collection\nDaniel Radcliffe  (Actor),     Emma Watson  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Imported from UK', 'Extra Content:', \"Harry Potter and the Half-Blood Prince Create your own Picture-in-Picture commentary J.K. Rowling: A Year in the Life Cast members guide to moviemaking What's on your mind? - Q & A with cast/crew One-Minute Drills - Cast members sum up their characters Harry Potter and the Deathly Hallows - Part 1 The Last Days of Privet Drive - Maximum Movie Mode Hagrid's Motorbike - Maximum Movie Mode Death Eaters Attack Cafe - Maximum Movie Mode Creating Dobby and Kreacher - Maximum Movie Mode Magical Tents! - Maximum Movie Mode The Return of Griphook - Maximum Movie Mode The Seven Harry's On the Green with Rupert, Tom, Oliver, and James Deleted Scenes Godric's Hollow/Harry Nagini Battle The Frozen Lake Harry Potter and the Deathly Hallows Part 1: Behind the Soundtrack The Wizarding World of Harry Potter Promotional Trailer Dan, Rupert, and Emma's Running Competition Harry Potter and the Deathly Hallows - Part 2 Maximum Movie Mode: Aberforth Dumbledore Deathly Hallows Costume Changes Harry Returns to Hogwarts The Hogwarts Shield The Room of Requirement Set The Fiery Escape Neville's Stand Molly Takes Down Bellatrix Final Farewells from Cast and Crew Pottermore Preview When Harry Left Hogwarts The Goblins of Gringotts The Women of Harry Potter Deleted Scenes Warner Bros. Studio Tour London A Conversation with JK Rowling and Daniel Radcliffe\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '2.68 x 6.89 x 5.35 inches; 14.46 Ounces', 'Audio Description': 'English', 'Director': 'David Yates', 'Media Format': 'Blu-ray, Import', 'Run time': '19 hours and 59 minutes', 'Release date': 'May 14, 2013', 'Actors': 'Daniel Radcliffe, Emma Watson, Rupert Grint, Ralph Fiennes, Helena Bonham Carter', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital-Plus 5.1)', 'Studio': 'Imports', 'Number of discs': '11'}\nThis is a bargain.\nBargain for Classics.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti', 'Steve Saint Leger', 'Jeff Woolnough', 'Helen Shaver', 'Daniel Grou', 'David Frazee', 'Joshua Zimmerman', 'David Wellington', 'Johan Renck'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Clive Standen'], 'Studio': ['History']}\nIt was a rough life, and it is portrayed as such.  Very violent, but the acting is superb.\nFour Stars\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick'], 'Studio': ['CBS']}\nVery good.\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Preferred Genre:** The user maintains a deep appreciation for foreign films that blend culinary arts with personal growth, alongside an enduring interest in action and adventure stories enriched by historical elements. They continue to be captivated by intricate storytelling featuring unexpected twists and well-rounded characters.\n\n- **Theme Appreciation:** There is a consistent fondness for narratives that emphasize emotional connections and cultural depth, particularly focusing on healing and resilience. Their latest viewing behavior suggests an inclination towards stories that celebrate personal development through adversity, even within darker contexts that address life’s complexities.\n\n- **Mood and Atmosphere:** While the user still favors uplifting films, their recent engagement reflects a growing enthusiasm for visually striking and fast-paced narratives that are thought-provoking. They are increasingly receptive to more intense portrayals of human experiences, even when they explore darker themes.\n\n- **Viewing Context:** The user enjoys reflective cinema during quiet times yet is increasingly drawn to suspenseful adventures that provoke deep thought and feature intricate plotting, including those with moral complexities and darker themes.\n\n- **Overall Rating Trend:** Upholding high standards in their evaluations, the user often rates films around 4 to 5 stars. They notably engage in critical assessments of adaptations and narratives that delve into complex character motivations, including those that contain elements of violence and moral dilemmas.\n\nIn summary, the user demonstrates a nuanced embrace of imaginative storytelling, balancing adventure with emotionally rich narratives while welcoming more intense and thought-provoking content.",
  "metrics": {
    "rouge1_f": 0.08142319534724597,
    "rouge2_f": 0.00547757617254365,
    "rougeL_f": 0.039685254875128285,
    "meteor": 0.024470061762735758,
    "bleu1": 1.5047802125026543e-06,
    "bleu2": 3.9930108205645325e-07,
    "bleu3": 1.2844125046106278e-07,
    "bleu4": 4.099930280316505e-08,
    "bertscore_precision": 0.3428729474544525,
    "bertscore_recall": 0.4919129014015198,
    "bertscore_f1": 0.4040883779525757
  }
}