{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Colombiana\nReview Date: 2023/03/01\nStore: Zoe Saldana  (Actor),     Jordi Mollà  (Actor),     Olivier Megaton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'From writer/producer Luc Besson (', 'The Fifth Element', ',', 'Leon: The Professional', ') comes', 'Colombiana', '. Zoe Saldana plays a young woman who has grown up to be an assassin after witnessing the murder of her parents as a child. Turning herself into a professional killer, she remains focused on her ultimate goal: to hunt down and get revenge on the mobster responsible for her parents’ deaths.', 'Amazon.com', 'As a producer, Luc Besson (', 'The Transporter', 'series,', 'Taken', ',', 'District B-13', ') has made extremely profitable B-movie hay out of a fairly strict formula incorporating whisper-thin femme fatales, parkour, Gaultier, and guns.', 'Colombiana', ', another Besson collaboration with director Olivier Megaton (', 'Transporter 3', \"), doesn't exactly blaze new trails, but the combination of Zoe Saldana's fierce performance and a dash of oddball surrealism sure makes the running time zoom by. Purportedly beginning as a sequel to\", 'The Professional', \", the story follows a beautiful South American assassin bent on rubbing out the murderers of her parents. Unfortunately, the closer she gets to her drug lord prey, the more her own loved ones (including Michael Vartan and an amusingly hambone Cliff Curtis) are put at risk. Things go boom, frequently. Director Megaton handles the action with the rapid-cut, blue-filtered zing common to the Besson factory, but things receive a definite boost via the efforts of Saldana, whose performance combines the intensely physical with an appealing soulfulness. Whether slithering through air ducts in a skin-tight cat suit or using a toothbrush as an impromptu weapon, she somehow manages to maintain an air of beyond-the-call gravitas. Also of note are the scenes of the heroine plying her lethal trade, some of which bear the funky logic-defying influence of Mario Bava's great fugue-state caper movie\", 'Danger: Diabolik', '. Ultimately, although the story elements and secondary character motivations rarely hang together,', 'Colombiana', \"'s distinguishing marks help place the film somewhere above the level of guilty pleasure. When pitted against the likes of a mobster with a glass-paneled shark tank for a dance floor, reality can take a seat, frankly.\", '--Andrew Wright']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Cynthia Addai-Robinson, Ofelia Medina, Lennie James, Angel Garnica, Michael Vartan, Ariel Zeitoun, Cliff Curtis, EuropaCorp, Max Martini, Callum Blue, Jordi Mollà, Zoe Saldana, Olivier Megaton, Amandla Stenberg, Sam Douglas, Beto Benites, Jesse Borrego, Luc Besson, Graham McTavishCynthia Addai-Robinson, Ofelia Medina, Lennie James, Angel Garnica, Michael Vartan, Ariel Zeitoun, Cliff Curtis, EuropaCorp, Max Martini, Callum Blue, Jordi Mollà, Zoe Saldana, Olivier Megaton, Amandla Stenberg, Sam Douglas, Beto Benites, Jesse Borrego, Luc Besson, Grah…  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 52 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '23915953', 'Director': 'Olivier Megaton', 'Media Format': 'AC-3, Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'December 20, 2011', 'Actors': 'Zoe Saldana, Jordi Mollà, Lennie James, Amandla Stenberg, Callum Blue', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Ariel Zeitoun, Luc Besson', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Very easy to find and order. It was sent very quickly and in perfect condition. Love this movie!\nReview Title: Awesome movie!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Girls Trip\nRegina Hall  (Actor),     Tiffany Haddish  (Actor),     Malcolm D. Lee  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"When four lifelong friends (Regina Hall, Tiffany Haddish, Jada Pinkett Smith and Queen Latifah) travel to New Orleans for the annual Essence Festival, sisterhoods are rekindled, wild sides are rediscovered, and there's enough dancing, drinking, brawling and romancing to make the Big Easy blush.\", 'Bonus Content:', 'Deleted Scenes with Optional Commentary by Director Malcolm D. Lee', 'Deleted Scenes with Optional Commentary by Director Malcolm D. Lee', 'Outtakes', 'Outtakes', 'Planning the Trip', 'Planning the Trip', 'Outrageous Moments', 'Outrageous Moments', 'The Essence of NOLA', 'The Essence of NOLA', 'Extended Performance \"Because of You\" by Ne-Yo', 'Extended Performance \"Because of You\" by Ne-Yo', 'Feature Commentary with Director Malcolm D. Lee', 'Feature Commentary with Director Malcolm D. Lee', ']]>']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Malcolm D. Lee', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 2 minutes', 'Release date': 'October 17, 2017', 'Actors': 'Regina Hall, Tiffany Haddish, Larenz Tate, Mike Colter, Kate Walsh', 'Subtitles': 'Spanish, French', 'Producers': 'Will Packer, Malcolm D. Lee', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Kenya Barris, Tracy Oliver', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA grest movie, very funny!\nI loved it\nDespicable Me 3\nSteve Carell  (Actor),     Kristen Wiig  (Actor),     Pierre Coffin  (Director),     Kyle Balda  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n[\"Illumination, who brought moviegoers Despicable Me, Despicable Me 2, and the biggest animated hit of 2015, Minions, continues the story of Gru, Lucy, their adorable daughters—Margo, Edith and Agnes—and the Minions in Despicable Me 3. After he is fired from the Anti-Villain League for failing to take down Balthazar Bratt, the latest bad guy to threaten humanity, Gru finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother—a brother who desperately wishes to follow in his twin's despicable footsteps—one former super-villain will rediscover just how good it feels to be bad.Bonus Content:\", 'Deleted Scene with Intro by Dana Gaier', 'Deleted Scene with Intro by Dana Gaier', 'Minion Moments', 'Minion Moments', 'Character Profiles', 'Character Profiles', 'The Making of Despicable Me 3', 'The Making of Despicable Me 3', 'Developing Dru', 'Developing Dru', 'The AVL Files', 'The AVL Files', 'Freedonia Visitors Guide', 'Freedonia Visitors Guide', 'Despicable Me\\xa0TV', 'Despicable Me\\xa0TV', '\"Doowit\" Sing-Along', '\"Doowit\" Sing-Along', '\"Yellow Light\" Music Video', '\"Yellow Light\" Music Video', 'Minion Mug Shots', 'Minion Mug Shots', 'Wanted Posters', 'Wanted Posters', 'Mini-Movie: The Secret Life of Kyle', 'Mini-Movie: The Secret Life of Kyle', 'There are multiple versions of this movie cover and each shipment is random. Customers are not guaranteed to receive specific cover or to receive multiple covers with multiple purchases.']\n{'Genre': 'Illumination Entertainment, Minions, Kids & Family, DVD Movie, Despicable Me 3 3D, Animation, Blu-ray Movie, Comedy, Action & Adventure, Detestable moi 3Illumination Entertainment, Minions, Kids & Family, DVD Movie, Despicable Me 3 3D, Animation, Blu-ray Movie, Comedy, Action & Adventure, Detestable moi 3  See more', 'Format': 'Animated, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Trey Parker, Steve Carell, Kyle Balda, Chris Meledandri, Pierre Coffin, Ken Daurio, Julie Andrews, Dana Gaier, Cinco Paul, Janet Healy, Miranda Cosgrove, Jenny Slate, Kristen Wiig, Steve CooganTrey Parker, Steve Carell, Kyle Balda, Chris Meledandri, Pierre Coffin, Ken Daurio, Julie Andrews, Dana Gaier, Cinco Paul, Janet Healy, Miranda Cosgrove, Jenny Slate, Kristen Wiig, Steve Coogan  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.3 x 0.55 inches; 2.4 Ounces', 'Item model number': '36771', 'Director': 'Pierre Coffin, Kyle Balda', 'Media Format': 'Animated, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'December 5, 2017', 'Actors': 'Steve Carell, Kristen Wiig, Trey Parker, Miranda Cosgrove, Steve Coogan', 'Subtitles': 'French, Spanish', 'Producers': 'Chris Meledandri, Janet Healy', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cinco Paul, Ken Daurio', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy daughter loved this movie\nGreat gift\nAll About the Benjamins (New Line Platinum Series)\nBeres, Julianne  (Actor),     Bray, Kevin  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Fully Loaded DVDs, New Line Platinum Series\n['Product Description', 'All About the Benjamins (DVD) (WS)', \"There's a lot of money in Miami, but bounty hunter Bucum Jackson (Ice Cube) has yet to claim his share of it. Bucum dreams of opening his own private investigation firm, but right now he's on the trail of slippery con artist Reggie Wright (Mike Epps). Bucum's wild pursuit of Reggie leads to the middle of a multi-million dollar diamond heist, where Reggie's flailing hysteria allows him to avoid capture. Things start to look up for Reggie when he realizes he's the sole winner of a $60 million lottery! Unfortunately, the winning ticket is still in Reggie's wallet ... in the getaway van ... and has been discovered by the diamond thieves. And then Reggie sees Bucum. Bucum may not trust Reggie, but if Reggie's story is true it means a whole lot more than the bail money ... and if it's a scam, Bucum can use Reggie as bait to catch the diamond thieves. Now, either way Bucum can't lose--because, after all, it's All About the Benjamins.\", ']]>', 'Amazon.com', \"Ice Cube cowrote, produced, and stars in this action caper. Bucum (Cube) is a bounty hunter (get it?) with dreams of big money. Reggie (Mike Epps) is a small-time grifter who also has dreams of big money and is at the top of Bucum's list to boot. Yep, you guessed it: tough guy/funny guy buddy flick.\", 'All About the Benjamins', \"is pretty much a by-the-numbers piece of work. There's plenty of macho posturing, gunfire, big-ticket items exploding, and curse words inserted into the script in lieu of actual punch lines. The plot has holes big enough to drive a locomotive through, but then again the plot isn't really the point. Epps's attempts at wacky comedy wear thin early on, but Ice Cube does a fine job, and together they do make quite a few moments hit. Best recommended for when you want turn-your-brain-off excitement.\", '--Ali Davis']\n{'Genre': 'Comedy, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, DTS Surround Sound, NTSC, Dolby, Subtitled, WidescreenMultiple Formats, Anamorphic, Closed-captioned, Color, DTS Surround Sound, NTSC, Dolby, Subtitled, Widescreen  See more', 'Contributor': 'Bray, Kevin, Beres, Julianne, Miller, Valarie Rae, Cube, Ice, Giaimo, Anthony, Chase, Jeff, Flanagan, Tommy, Corone, Antoni, Mendes, Eva, Chaplin, Carmen, Epps, Mike, Wow, Bow, Turner, Joan, Brooks, Evelyn, Hall, Anthony Michael, Smith, Roger Guenveur, Chianese Jr., Dominic, Salvano, Gino, Ward (III), Tony, Carter, BobBray, Kevin, Beres, Julianne, Miller, Valarie Rae, Cube, Ice, Giaimo, Anthony, Chase, Jeff, Flanagan, Tommy, Corone, Antoni, Mendes, Eva, Chaplin, Carmen, Epps, Mike, Wow, Bow, Turner, Joan, Brooks, Evelyn, Hall, Anthony Michael, Smith, Roger Guenveur, Chianese Jr., D…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (DTS 5.1)', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1000032313', 'Director': 'Bray, Kevin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, DTS Surround Sound, NTSC, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 14, 2004', 'Actors': 'Beres, Julianne, Bray, Kevin, Brooks, Evelyn, Carter, Bob, Chaplin, Carmen', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nWe absolutely loved this movie. So funny\nGreat movie. We watch it all the time\nYou Again\nKristen Bell  (Actor),     Betty White  (Actor),     Andy Fickman  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"You Again, the nonstop laugh fest, is pure fun that features an all-star cast with comedy pedigrees - including Kristen Bell, Jamie Lee Curtis, Sigourney Weaver and the always outrageous Betty White. For Marnie (Bell), high school was a horror movie, and her brother's wedding is the sequel when her archrival comes back to haunt her as his bride. It's nice girl versus mean girl in this hysterical reunion with the one person Marnie would really like to forget. And if that weren't enough, Marnie's mom (Curtis) reunites with her own high school nemesis (Weaver). Complete with hilarious, never-before-seen bonus material, You Again is one crazy comedy that'll keep you laughing again and again.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Kristen Bell, Odette Yustman, Andy Fickman, Victor Garber, Moe Jelline, Betty White, Jamie Lee Curtis, Sigourney Weaver, Kristen ChenowethKristen Bell, Odette Yustman, Andy Fickman, Victor Garber, Moe Jelline, Betty White, Jamie Lee Curtis, Sigourney Weaver, Kristen Chenoweth  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '622800', 'Director': 'Andy Fickman', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Kristen Bell, Betty White, Jamie Lee Curtis, Sigourney Weaver, Odette Yustman', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Touchstone Pictures', 'Writers': 'Moe Jelline', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie\nGreat movie\nRide Along\nIce Cube  (Actor, Producer),     Kevin Hart  (Actor),     Tim Story  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"For the past two years, high school security guard Ben (Kevin Hart) has been trying to show decorated detective James (Ice Cube) that he's more than just a video game junkie who's unworthy of James' sister. When Ben finally gets accepted into the police academy, James invites him on a ride-along designed to scare the hell out of him and ultimately demonstrate if Ben has what it takes to take care of his sister. But when the wild night leads them to the most notorious criminal in the city, James will find that his new partner's rapid-fire mouth is just as dangerous as the bullets speeding at it. Also starring John Leguizamo and Laurence Fishburne, Ride Along is an action-packed comedy with big thrills and even bigger laughs.\", 'Bonus Content:', 'Gag Reel', 'Gag Reel', 'It Was a Good Day – On the Set of Ride Along', 'It Was a Good Day – On the Set of Ride Along', 'Atlanta: The Character', 'Atlanta: The Character', 'Feature Commentary with Director Tim Story', 'Feature Commentary with Director Tim Story', ']]>']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Greg Coolidge, John Leguizamo, Kevin Hart, Phil Hay, Larry Brezner, Ice Cube, Will Packer, Bruce McGill, Tim Story, Matt Alvarez, Tika Sumpter, Jason Mantzoukas, Laurence Fishburne, Matt ManfrediGreg Coolidge, John Leguizamo, Kevin Hart, Phil Hay, Larry Brezner, Ice Cube, Will Packer, Bruce McGill, Tim Story, Matt Alvarez, Tika Sumpter, Jason Mantzoukas, Laurence Fishburne, Matt Manfredi   See more', 'Initial release date': '2014-04-15', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '111378', 'Director': 'Tim Story', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 15, 2014', 'Actors': 'Ice Cube, Kevin Hart, John Leguizamo, Bruce McGill, Tika Sumpter', 'Subtitles': 'Spanish, French', 'Producers': 'Will Packer, Ice Cube, Matt Alvarez, Larry Brezner', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Greg Coolidge, Jason Mantzoukas, Phil Hay, Matt Manfredi', 'Number of discs': '1'}\nA good funny movie\nVery happy\n21 Jump Street\nJonah Hill  (Actor),     Channing Tatum  (Actor),     Phil Lord  (Director),     Chris Miller  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Former high school foes turned rookie cop partners can’t catch a break – until they’re assigned to pose as students and bust a drug ring inside their old alma mater. Living like teenagers again, they slip back into their adolescent selves and risk the case – and their friendship - with hysterically disastrous results! Jonah Hill, Channing Tatum and Ice Cube star in this outrageously hilarious action-comedy!', 'Amazon.com', 'When', '21 Jump Street', 'premiered on Fox in 1987, it offered a cool-kid twist on the cop drama formula. This new-era reinvention keeps the cops, but trades earnest drama for raunchy comedy. At Sagan High, Schmidt (newly scrawny Jonah Hill, fresh off an Oscar nomination for', 'Moneyball', ') was a brainy guy with no game, while Jenko (ever-brawny Channing Tatum, funnier than expected) was a popular jock with bad grades. Five years later, they reconnect at police academy, where enemies become friends when they pool their resources, but after their first bust goes bad, the deputy chief (Nick Offerman) ships them off to Jump Street, where their youthful looks lead to an undercover sting operation at Sagan (apparently, no staff members recognize the former students). Due to a mix-up, Schmidt ends up with the theater kids and Jenko with the science nerds. Through a production of', 'Peter Pan', \", Schmidt meets Molly (Brie Larson), who introduces him to her drug dealer boyfriend, Eric (James Franco's deadpan brother, Dave). Now, they just need to track down Eric's supplier to shut the whole operation down. Along the way, Schmidt discovers his inner performer and Jenko his inner geek, but these new personas threaten the case, generating several\", 'Superbad', \"-style laughs, so it's too bad the finale devolves into bloodshed more befitting a John Woo crime caper, though the snappy chemistry between Hill and Tatum papers over some of the holes in the script--along with a foul-mouthed Ice Cube and one rather famous original cast member.\", '--Kathleen C. Fennessy']\n{'Genre': 'Action, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Ultraviolet, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copyMultiple Formats, AC-3, Closed-captioned, Color, Ultraviolet, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copy  See more', 'Contributor': 'Jonah Hill, Channing Tatum, Phil Lord, Chris Miller, Dave Franco, Brie Larson', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '21-jump-street-2012', 'Director': 'Phil Lord, Chris Miller', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Ultraviolet, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copy', 'Run time': '1 hour and 50 minutes', 'Release date': 'June 26, 2012', 'Actors': 'Jonah Hill, Channing Tatum, Brie Larson, Dave Franco', 'Dubbed': 'French', 'Studio': 'Sony Pictures Studios', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLoved this movie watch alot\nGreat movie\nJust Go With It\nJennifer Aniston  (Actor),     Adam Sandler  (Actor),     Dennis Dugan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Danny Maccabee (Adam Sandler) meets the girl of his dreams (Brooklyn Decker) but has to enlist his loyal assistant Katherine (Jennifer Aniston) to pretend to be his soon-to-be ex-wife in order to cover up a careless lie. When more lies backfire, Katherine’s kids become involved, and everyone heads off to Hawaii for a ridiculous, out-of-control weekend that tests the limits of how far we’ll go for love.', 'Amazon.com', 'It all comes down to chemistry. And the two main stars of', 'Just Go with It', ', Jennifer Aniston and Adam Sandler, thankfully, have chemistry to spare. Both actors have plenty of sheer likability and honest ease, as well as sparks in just the right places, which helps propel', 'Just Go with It', 'to its satisfying (if a bit predictable) conclusion. (Hollywood execs: Consider an update of', 'Moonlighting', 'starring these two.) If the premise, loosely based on the Goldie Hawn film', 'Cactus Flower', ', stretches reality, the capability of the whole cast makes', 'Just Go with It', \"an enjoyable ride. Sandler plays Danny, a surgeon who falls for a much-younger bombshell, Palmer (swimsuit model Brooklyn Decker, a surprisingly natural actress). But when Palmer finds the fake wedding band that commitment-phobe Danny has used for his no-strings-attached previous relationships, the web of fibs begins. Danny asks his assistant, Katherine (Aniston), to pretend to be his soon-to-be-ex-wife, and Aniston plays it to the hilt. But soon Danny's wobbly house of cards includes Katherine's children--and, in the ultimate romantic-comedy trope, a group trip to Hawaii to work things out. The cast really is stellar, including very small supporting roles by Nicole Kidman and singer Dave Matthews, as an insufferable couple disliked intensely by Katherine. (Of course they end up in Hawaii with the gang, too.) Minka Kelly, Kevin Nealon, and Rachel Dratch also make memorable cameos. But it's Sandler and Aniston, along with the snappy direction by Dennis Dugan (\", 'Happy Gilmore', ',', 'Big Daddy', '), who make', 'Just Go with It', 'one of the more romantic--and funny--romantic comedies in recent memory. Our advice: Sit back, and just go with it. --', 'A.T. Hurley']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Jennifer Aniston, Adam Sandler, Dennis Dugan', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 56 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'COLD37679D', 'Director': 'Dennis Dugan', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 7, 2011', 'Actors': 'Jennifer Aniston, Adam Sandler', 'Dubbed': 'French', 'Subtitles': 'Spanish, English, French', 'Studio': 'Columbia Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie\nGreat movie\nThe Proposal (Single-Disc Edition)\nSandra Bullock  (Actor),     Ryan Reynolds  (Actor),     Anne Fletcher  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'Sandra Bullock is at her funniest in the fresh, laugh-out-loud romantic comedy THE PROPOSAL. On the verge of being deported and losing the high-powered job she lives for, the controlling Margaret announces she\\'s engaged to her unsuspecting, put-upon assistant Andrew (Ryan Reynolds). After proposing a few demands of his own, the mismatched couple heads to Alaska where they have four short days to convince his quirky family and a very skeptical immigration agent that their charade is real. Featuring a star-studded supporting cast, including Mary Steenburgen, Craig T. Nelson and the delightfully inappropriate Betty White, this madcap comedy will have you saying \"yes\" to The proposal again and again.', 'Amazon.com', 'Rom-com favorite Sandra Bullock and the affably charming Ryan Reynolds’s superb chemistry turn', 'The Proposal', 'from otherwise standard romantic-comedy fare to one that is entertaining and sure to garner laughs. Margaret (Sandra Bullock) is a workaholic, tyrannical book editor (reminiscent of', 'The Devil Wears Prada', ') who suddenly finds her career in jeopardy as she faces deportation back to Canada. Her solution is to simply fake an engagement to her unsuspecting assistant Andrew (Ryan Reynolds), who in turn blackmails her for a promotion. However, when Margaret is forced to head to Alaska with Andrew to visit his family in an effort to make their story believable to the deportation officers, they soon realize that their plan may not be so simple after all. The supporting cast of Dad (Craig T. Nelson), Mom (Mary Steenburgen), and kooky Grandma (Betty White, still a scene-stealer at 87) is great casting that makes for many amusing scenes. Bottom line: witty Reynolds and Bullock are perfect sparring partners for each other and not half bad to look at either. --', 'Lisanne Chastain', 'Stills from', 'The Proposal', '(Click for larger image)']\n{'Genre': 'Romantic Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Sandra Bullock, Anne Fletcher, Craig T. Nelson, Malin Akerman, Oscar Nunez, Mary Steenburgen, Ryan Reynolds, Betty WhiteSandra Bullock, Anne Fletcher, Craig T. Nelson, Malin Akerman, Oscar Nunez, Mary Steenburgen, Ryan Reynolds, Betty White  See more', 'Language': 'English (Dolby Digital 5.1), French, Spanish, Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.4 x 7.5 inches; 0.71 Ounces', 'Item model number': '5822847', 'Director': 'Anne Fletcher', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'October 13, 2009', 'Actors': 'Sandra Bullock, Ryan Reynolds, Betty White, Mary Steenburgen, Craig T. Nelson', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Touchstone Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOne of my favorites great movie\nWatched alot\nAce Ventura Deluxe Double Feature (Pet Detective / When Nature Calls)\nJim Carrey  (Actor, Writer),     Courteney Cox  (Actor),     Steve Oedekerk  (Director, Writer),     Tom Shadyac  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Allllll righty then. Let's get to it. As Ace Ventura Pet Detective, Jim Carrey instantly soared to stardom while tearing decorum to pieces. The award-winning actor plays the screwloose sleuth determined to sniff out the Miami Dolphins' missing mascot and quarterback Dan Marino. Jim Carrey returns in Ace Ventura When Nature Calls as the alligator-wrasslin,' elephant-calling, monkeyshining, loogie-launching, burning coals-crossing, disguise-mastering pet detective. Includes a bonus DVD with specially selected cartoons from the hit TV show Ace Ventura The Animated Series.\", 'DVD Features:', 'Audio Commentary:', 'Commentary by Director Tom Shadyac', 'TV Spot', 'Theatrical Trailer', 'TV Spot', 'Theatrical Trailer', 'Amazon.com', 'The', 'Ace Ventura Deluxe Double Feature', 'offers both', 'Pet Detective', 'and', 'When Nature Calls', 'in anamorphic widescreen with soundtracks in Dolby 5.1 and (not indicated on the packaging) DTS. The original DVD of', 'Pet Detective', 'was full-screen (1.33 aspect ratio) only, though it had a scene with Ace masquerading as Hans Kissvelvet, the dolphin trainer, that was dropped from the theatrical release. The deluxe edition is missing this scene. The deluxe edition also has a third disc with three episodes (about 70 minutes total) from the 1995-96', 'Ace Ventura', 'animated series with Michael Hall as the voice of Ace.', '--David Horiuchi', 'Ace Ventura: Pet Detective', \"was the 1994 box-office hit that turned comedy maniac Jim Carrey into Hollywood's first $20-million man. This gag-filled no-brainer stars Carrey as the titular rubber-faced gumshoe who tracks down lost pets for his heartbroken clients. Ace's latest case involves the apparent kidnapping of the Miami Dolphins' team mascot, Snowflake the dolphin (natch), and his investigation is a source of constant irritation for Miami police lieutenant Lois Einhorn (Sean Young).\", 'Friends', \"fans will appreciate the presence of Courtney Cox, who remains admirably straight-faced as the Dolphins' publicist and Ace's would-be girlfriend, but of course it's Carrey who steals the show with shameless abandon.\", '--Jeff Shannon', 'In', 'When Nature Calls', ', the inevitable sequel, the disappearance of a rare African white bat, draws Ace (Carrey again) out of his spiritual retreat at a Tibetan monastery following the tragic outcome of his previous case. That traumatic experience, which makes for a hilarious opening-scene send-up of the Stallone thriller', 'Cliffhanger', ', prompts Ace to venture to Africa, where he goes native with the tribe that hired him to find their symbolic bat. From that point anything goes, with Carrey pushing the boundaries of good taste (what, you were expecting good taste?) up to and including his now-infamous \"birth\" scene from the backside of a mechanical rhinoceros. Lighten up, and don\\'t be ashamed if you find yourself laughing.', '--Jeff Shannon']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Widescreen, NTSC', 'Contributor': 'Peter Fernandez, Lisa DeSimone, Ralph Soll, Michael Daingerfield, Alison Fraser, D.G. Beatty, Jim Carrey, Courteney Cox, Steve Oedekerk, Jeff Bergman, Stefan Fredrich, Vince Corazza, Jack Bernstein, Bob Kaliban, John Beach, Kevin Campbell, Tom Shadyac, Seth MacFarlanePeter Fernandez, Lisa DeSimone, Ralph Soll, Michael Daingerfield, Alison Fraser, D.G. Beatty, Jim Carrey, Courteney Cox, Steve Oedekerk, Jeff Bergman, Stefan Fredrich, Vince Corazza, Jack Bernstein, Bob Kaliban, John Beach, Kevin Campbell, Tom Shadyac, Seth MacFarlane  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (DTS 5.1)', 'Runtime': '4 hours and 10 minutes', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.6 Ounces', 'Director': 'Steve Oedekerk, Tom Shadyac', 'Media Format': 'Widescreen, NTSC', 'Run time': '4 hours and 10 minutes', 'Release date': 'September 5, 2006', 'Actors': 'Jim Carrey, Courteney Cox, Michael Daingerfield, John Beach, D.G. Beatty', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Jack Bernstein, Jim Carrey, Kevin Campbell, Ralph Soll, Seth MacFarlane', 'Number of discs': '3'}\nWhole family loved it, very funny\nGreat movie\nThe Longest Yard (Full Screen Edition)\nAdam Sandler  (Actor),     Burt Reynolds  (Actor),     Peter Segal  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['THE LONGEST YARD tells the story of pro quarterback Paul Crewe (Sandler) and former college champion and coach Nate Scarboro (Reynolds) who are doing time in the same prison. Asked to put together a team of inmates to take on the guards, Crewe enlists the help of Scarboro to coach the inmates to victory in a football game fixed to turn out quite another way.']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Walter Williamson, Peter Segal, Burt Reynolds, Albert S. Ruddy, Dalip Singh, Terry Crews, Lobo Sebastian, Chris Rock, Michael Irvin, Adam Sandler, Nicholas Turturro, Sheldon Turner, Nelly, Bill Goldberg, Tracy Keenan Wynn, Bob SappWalter Williamson, Peter Segal, Burt Reynolds, Albert S. Ruddy, Dalip Singh, Terry Crews, Lobo Sebastian, Chris Rock, Michael Irvin, Adam Sandler, Nicholas Turturro, Sheldon Turner, Nelly, Bill Goldberg, Tracy Keenan Wynn, Bob Sapp  See more', 'Language': 'English', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Director': 'Peter Segal', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'September 20, 2005', 'Actors': 'Adam Sandler, Burt Reynolds, Chris Rock, Nelly, Michael Irvin', 'Studio': 'Paramount', 'Writers': 'Albert S. Ruddy, Sheldon Turner, Tracy Keenan Wynn', 'Number of discs': '1'}\nWhole family loved it\nGreat movie\nWWE: DX - One Last Stand\nTriple H  (Actor),     Shawn Michaels  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Sports\n['WWE: DX: One Last Stand (3-Disc) (DVD)', \"They are perhaps the most influential duo in entertainment with crazy antics outside the ring backed up with dominant performances inside. Both Shawn Michaels and Triple H were highly successful on their own, but when they came together as D-Generation X, they were unstoppable. Now fans can relive their final chapter as a team from late 2009 and 2010 with some of their biggest matches against Legacy and JeriShow, as well as Shawn's emotional send-off the night after WrestleMania XXVI.\", ']]>']\n{'Genre': 'Sports', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Chris Jericho, Triple H, Big Show, WWE, Cody Rhodes, Shawn Michaels, Natalya', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '6499709', 'Director': 'WWE', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Widescreen', 'Run time': '9 hours', 'Release date': 'August 6, 2013', 'Actors': 'Triple H, Shawn Michaels, Chris Jericho, Big Show, Cody Rhodes', 'Producers': 'WWE', 'Studio': 'WWE', 'Writers': 'WWE', 'Number of discs': '3'}\nWe love wrestling, great dvd\nLoved it\nColombiana\nZoe Saldana  (Actor),     Jordi Mollà  (Actor),     Olivier Megaton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'From writer/producer Luc Besson (', 'The Fifth Element', ',', 'Leon: The Professional', ') comes', 'Colombiana', '. Zoe Saldana plays a young woman who has grown up to be an assassin after witnessing the murder of her parents as a child. Turning herself into a professional killer, she remains focused on her ultimate goal: to hunt down and get revenge on the mobster responsible for her parents’ deaths.', 'Amazon.com', 'As a producer, Luc Besson (', 'The Transporter', 'series,', 'Taken', ',', 'District B-13', ') has made extremely profitable B-movie hay out of a fairly strict formula incorporating whisper-thin femme fatales, parkour, Gaultier, and guns.', 'Colombiana', ', another Besson collaboration with director Olivier Megaton (', 'Transporter 3', \"), doesn't exactly blaze new trails, but the combination of Zoe Saldana's fierce performance and a dash of oddball surrealism sure makes the running time zoom by. Purportedly beginning as a sequel to\", 'The Professional', \", the story follows a beautiful South American assassin bent on rubbing out the murderers of her parents. Unfortunately, the closer she gets to her drug lord prey, the more her own loved ones (including Michael Vartan and an amusingly hambone Cliff Curtis) are put at risk. Things go boom, frequently. Director Megaton handles the action with the rapid-cut, blue-filtered zing common to the Besson factory, but things receive a definite boost via the efforts of Saldana, whose performance combines the intensely physical with an appealing soulfulness. Whether slithering through air ducts in a skin-tight cat suit or using a toothbrush as an impromptu weapon, she somehow manages to maintain an air of beyond-the-call gravitas. Also of note are the scenes of the heroine plying her lethal trade, some of which bear the funky logic-defying influence of Mario Bava's great fugue-state caper movie\", 'Danger: Diabolik', '. Ultimately, although the story elements and secondary character motivations rarely hang together,', 'Colombiana', \"'s distinguishing marks help place the film somewhere above the level of guilty pleasure. When pitted against the likes of a mobster with a glass-paneled shark tank for a dance floor, reality can take a seat, frankly.\", '--Andrew Wright']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Cynthia Addai-Robinson, Ofelia Medina, Lennie James, Angel Garnica, Michael Vartan, Ariel Zeitoun, Cliff Curtis, EuropaCorp, Max Martini, Callum Blue, Jordi Mollà, Zoe Saldana, Olivier Megaton, Amandla Stenberg, Sam Douglas, Beto Benites, Jesse Borrego, Luc Besson, Graham McTavishCynthia Addai-Robinson, Ofelia Medina, Lennie James, Angel Garnica, Michael Vartan, Ariel Zeitoun, Cliff Curtis, EuropaCorp, Max Martini, Callum Blue, Jordi Mollà, Zoe Saldana, Olivier Megaton, Amandla Stenberg, Sam Douglas, Beto Benites, Jesse Borrego, Luc Besson, Grah…  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 52 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '23915953', 'Director': 'Olivier Megaton', 'Media Format': 'AC-3, Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'December 20, 2011', 'Actors': 'Zoe Saldana, Jordi Mollà, Lennie James, Amandla Stenberg, Callum Blue', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Ariel Zeitoun, Luc Besson', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nVery easy to find and order. It was sent very quickly and in perfect condition. Love this movie!\nAwesome movie!",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Awesome movie!",
    "text": "Very easy to find and order. It was sent very quickly and in perfect condition. Love this movie!",
    "images": [],
    "asin": "B005OK721G",
    "parent_asin": "B005OK721G",
    "user_id": "AHKUHEIUY7WUAMGKHAXC45LCRHZA",
    "timestamp": "2023-03-01 14:55:57.870000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Colombiana",
    "average_rating": 4.7,
    "rating_number": 8598,
    "features": [],
    "description": [
      "Product Description",
      "From writer/producer Luc Besson (",
      "The Fifth Element",
      ",",
      "Leon: The Professional",
      ") comes",
      "Colombiana",
      ". Zoe Saldana plays a young woman who has grown up to be an assassin after witnessing the murder of her parents as a child. Turning herself into a professional killer, she remains focused on her ultimate goal: to hunt down and get revenge on the mobster responsible for her parents’ deaths.",
      "Amazon.com",
      "As a producer, Luc Besson (",
      "The Transporter",
      "series,",
      "Taken",
      ",",
      "District B-13",
      ") has made extremely profitable B-movie hay out of a fairly strict formula incorporating whisper-thin femme fatales, parkour, Gaultier, and guns.",
      "Colombiana",
      ", another Besson collaboration with director Olivier Megaton (",
      "Transporter 3",
      "), doesn't exactly blaze new trails, but the combination of Zoe Saldana's fierce performance and a dash of oddball surrealism sure makes the running time zoom by. Purportedly beginning as a sequel to",
      "The Professional",
      ", the story follows a beautiful South American assassin bent on rubbing out the murderers of her parents. Unfortunately, the closer she gets to her drug lord prey, the more her own loved ones (including Michael Vartan and an amusingly hambone Cliff Curtis) are put at risk. Things go boom, frequently. Director Megaton handles the action with the rapid-cut, blue-filtered zing common to the Besson factory, but things receive a definite boost via the efforts of Saldana, whose performance combines the intensely physical with an appealing soulfulness. Whether slithering through air ducts in a skin-tight cat suit or using a toothbrush as an impromptu weapon, she somehow manages to maintain an air of beyond-the-call gravitas. Also of note are the scenes of the heroine plying her lethal trade, some of which bear the funky logic-defying influence of Mario Bava's great fugue-state caper movie",
      "Danger: Diabolik",
      ". Ultimately, although the story elements and secondary character motivations rarely hang together,",
      "Colombiana",
      "'s distinguishing marks help place the film somewhere above the level of guilty pleasure. When pitted against the likes of a mobster with a glass-paneled shark tank for a dance floor, reality can take a seat, frankly.",
      "--Andrew Wright"
    ],
    "price": 6.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51NKlUfKOwL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51NKlUfKOwL.jpg",
        "variant": "MAIN",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51k63fozNKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51k63fozNKL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/91oJOvqdrjL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/4141H+bg0nL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/4141H+bg0nL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/91gOFBm1b0L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41YV2Rg-UTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41YV2Rg-UTL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/91YRhRdxT4L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41nm6PUtIbL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41nm6PUtIbL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81lKGdFJSIL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41ghzwHEyzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41ghzwHEyzL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81Y7crpJr6L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51PJCedSpaL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51PJCedSpaL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/91GXT8vRt9L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/416dMAgF3DL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/416dMAgF3DL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/810UspomgTL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512wVh8JiDL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/512wVh8JiDL.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/81WS6kkHRsL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41R0Or0gHoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41R0Or0gHoL.jpg",
        "variant": "PT09",
        "hi_res": "https://m.media-amazon.com/images/I/91YcY980ZHL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "The Goal Video",
        "url": "https://www.amazon.com/vdp/5d75eeedb08d408e86556c47010afb2e?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Zoe Saldana  (Actor),     Jordi Mollà  (Actor),     Olivier Megaton  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD",
    "categories": [
      "Movies & TV",
      "Studio Specials",
      "Sony Pictures Home Entertainment",
      "All Sony Pictures Titles"
    ],
    "details": {
      "Genre": "Action, Drama, Thriller",
      "Format": "AC-3, Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen",
      "Contributor": "Cynthia Addai-Robinson, Ofelia Medina, Lennie James, Angel Garnica, Michael Vartan, Ariel Zeitoun, Cliff Curtis, EuropaCorp, Max Martini, Callum Blue, Jordi Mollà, Zoe Saldana, Olivier Megaton, Amandla Stenberg, Sam Douglas, Beto Benites, Jesse Borrego, Luc Besson, Graham McTavishCynthia Addai-Robinson, Ofelia Medina, Lennie James, Angel Garnica, Michael Vartan, Ariel Zeitoun, Cliff Curtis, EuropaCorp, Max Martini, Callum Blue, Jordi Mollà, Zoe Saldana, Olivier Megaton, Amandla Stenberg, Sam Douglas, Beto Benites, Jesse Borrego, Luc Besson, Grah…  See more",
      "Language": "English (Dolby Digital 2.0 Stereo)",
      "Runtime": "1 hour and 52 minutes",
      "Aspect Ratio": "2.35:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "Unrated (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.4 Ounces",
      "Audio Description": "English",
      "Item model number": "23915953",
      "Director": "Olivier Megaton",
      "Media Format": "AC-3, Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen",
      "Run time": "1 hour and 52 minutes",
      "Release date": "December 20, 2011",
      "Actors": "Zoe Saldana, Jordi Mollà, Lennie James, Amandla Stenberg, Callum Blue",
      "Dubbed": "French",
      "Subtitles": "English, French, Spanish",
      "Producers": "Ariel Zeitoun, Luc Besson",
      "Studio": "Sony Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}