{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Just Go With It\nReview Date: 2021/02/19\nStore: Jennifer Aniston  (Actor),     Adam Sandler  (Actor),     Dennis Dugan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Danny Maccabee (Adam Sandler) meets the girl of his dreams (Brooklyn Decker) but has to enlist his loyal assistant Katherine (Jennifer Aniston) to pretend to be his soon-to-be ex-wife in order to cover up a careless lie. When more lies backfire, Katherine’s kids become involved, and everyone heads off to Hawaii for a ridiculous, out-of-control weekend that tests the limits of how far we’ll go for love.', 'Amazon.com', 'It all comes down to chemistry. And the two main stars of', 'Just Go with It', ', Jennifer Aniston and Adam Sandler, thankfully, have chemistry to spare. Both actors have plenty of sheer likability and honest ease, as well as sparks in just the right places, which helps propel', 'Just Go with It', 'to its satisfying (if a bit predictable) conclusion. (Hollywood execs: Consider an update of', 'Moonlighting', 'starring these two.) If the premise, loosely based on the Goldie Hawn film', 'Cactus Flower', ', stretches reality, the capability of the whole cast makes', 'Just Go with It', \"an enjoyable ride. Sandler plays Danny, a surgeon who falls for a much-younger bombshell, Palmer (swimsuit model Brooklyn Decker, a surprisingly natural actress). But when Palmer finds the fake wedding band that commitment-phobe Danny has used for his no-strings-attached previous relationships, the web of fibs begins. Danny asks his assistant, Katherine (Aniston), to pretend to be his soon-to-be-ex-wife, and Aniston plays it to the hilt. But soon Danny's wobbly house of cards includes Katherine's children--and, in the ultimate romantic-comedy trope, a group trip to Hawaii to work things out. The cast really is stellar, including very small supporting roles by Nicole Kidman and singer Dave Matthews, as an insufferable couple disliked intensely by Katherine. (Of course they end up in Hawaii with the gang, too.) Minka Kelly, Kevin Nealon, and Rachel Dratch also make memorable cameos. But it's Sandler and Aniston, along with the snappy direction by Dennis Dugan (\", 'Happy Gilmore', ',', 'Big Daddy', '), who make', 'Just Go with It', 'one of the more romantic--and funny--romantic comedies in recent memory. Our advice: Sit back, and just go with it. --', 'A.T. Hurley']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Jennifer Aniston, Adam Sandler, Dennis Dugan', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 56 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'COLD37679D', 'Director': 'Dennis Dugan', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 7, 2011', 'Actors': 'Jennifer Aniston, Adam Sandler', 'Dubbed': 'French', 'Subtitles': 'Spanish, English, French', 'Studio': 'Columbia Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this movie\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Girls Trip\nRegina Hall  (Actor),     Tiffany Haddish  (Actor),     Malcolm D. Lee  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"When four lifelong friends (Regina Hall, Tiffany Haddish, Jada Pinkett Smith and Queen Latifah) travel to New Orleans for the annual Essence Festival, sisterhoods are rekindled, wild sides are rediscovered, and there's enough dancing, drinking, brawling and romancing to make the Big Easy blush.\", 'Bonus Content:', 'Deleted Scenes with Optional Commentary by Director Malcolm D. Lee', 'Deleted Scenes with Optional Commentary by Director Malcolm D. Lee', 'Outtakes', 'Outtakes', 'Planning the Trip', 'Planning the Trip', 'Outrageous Moments', 'Outrageous Moments', 'The Essence of NOLA', 'The Essence of NOLA', 'Extended Performance \"Because of You\" by Ne-Yo', 'Extended Performance \"Because of You\" by Ne-Yo', 'Feature Commentary with Director Malcolm D. Lee', 'Feature Commentary with Director Malcolm D. Lee', ']]>']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Malcolm D. Lee', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 2 minutes', 'Release date': 'October 17, 2017', 'Actors': 'Regina Hall, Tiffany Haddish, Larenz Tate, Mike Colter, Kate Walsh', 'Subtitles': 'Spanish, French', 'Producers': 'Will Packer, Malcolm D. Lee', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Kenya Barris, Tracy Oliver', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA grest movie, very funny!\nI loved it\nDespicable Me 3\nSteve Carell  (Actor),     Kristen Wiig  (Actor),     Pierre Coffin  (Director),     Kyle Balda  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n[\"Illumination, who brought moviegoers Despicable Me, Despicable Me 2, and the biggest animated hit of 2015, Minions, continues the story of Gru, Lucy, their adorable daughters—Margo, Edith and Agnes—and the Minions in Despicable Me 3. After he is fired from the Anti-Villain League for failing to take down Balthazar Bratt, the latest bad guy to threaten humanity, Gru finds himself in the midst of a major identity crisis. But when a mysterious stranger shows up to inform Gru that he has a long-lost twin brother—a brother who desperately wishes to follow in his twin's despicable footsteps—one former super-villain will rediscover just how good it feels to be bad.Bonus Content:\", 'Deleted Scene with Intro by Dana Gaier', 'Deleted Scene with Intro by Dana Gaier', 'Minion Moments', 'Minion Moments', 'Character Profiles', 'Character Profiles', 'The Making of Despicable Me 3', 'The Making of Despicable Me 3', 'Developing Dru', 'Developing Dru', 'The AVL Files', 'The AVL Files', 'Freedonia Visitors Guide', 'Freedonia Visitors Guide', 'Despicable Me\\xa0TV', 'Despicable Me\\xa0TV', '\"Doowit\" Sing-Along', '\"Doowit\" Sing-Along', '\"Yellow Light\" Music Video', '\"Yellow Light\" Music Video', 'Minion Mug Shots', 'Minion Mug Shots', 'Wanted Posters', 'Wanted Posters', 'Mini-Movie: The Secret Life of Kyle', 'Mini-Movie: The Secret Life of Kyle', 'There are multiple versions of this movie cover and each shipment is random. Customers are not guaranteed to receive specific cover or to receive multiple covers with multiple purchases.']\n{'Genre': 'Illumination Entertainment, Minions, Kids & Family, DVD Movie, Despicable Me 3 3D, Animation, Blu-ray Movie, Comedy, Action & Adventure, Detestable moi 3Illumination Entertainment, Minions, Kids & Family, DVD Movie, Despicable Me 3 3D, Animation, Blu-ray Movie, Comedy, Action & Adventure, Detestable moi 3  See more', 'Format': 'Animated, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Trey Parker, Steve Carell, Kyle Balda, Chris Meledandri, Pierre Coffin, Ken Daurio, Julie Andrews, Dana Gaier, Cinco Paul, Janet Healy, Miranda Cosgrove, Jenny Slate, Kristen Wiig, Steve CooganTrey Parker, Steve Carell, Kyle Balda, Chris Meledandri, Pierre Coffin, Ken Daurio, Julie Andrews, Dana Gaier, Cinco Paul, Janet Healy, Miranda Cosgrove, Jenny Slate, Kristen Wiig, Steve Coogan  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.3 x 0.55 inches; 2.4 Ounces', 'Item model number': '36771', 'Director': 'Pierre Coffin, Kyle Balda', 'Media Format': 'Animated, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'December 5, 2017', 'Actors': 'Steve Carell, Kristen Wiig, Trey Parker, Miranda Cosgrove, Steve Coogan', 'Subtitles': 'French, Spanish', 'Producers': 'Chris Meledandri, Janet Healy', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cinco Paul, Ken Daurio', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy daughter loved this movie\nGreat gift\nAll About the Benjamins (New Line Platinum Series)\nBeres, Julianne  (Actor),     Bray, Kevin  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Fully Loaded DVDs, New Line Platinum Series\n['Product Description', 'All About the Benjamins (DVD) (WS)', \"There's a lot of money in Miami, but bounty hunter Bucum Jackson (Ice Cube) has yet to claim his share of it. Bucum dreams of opening his own private investigation firm, but right now he's on the trail of slippery con artist Reggie Wright (Mike Epps). Bucum's wild pursuit of Reggie leads to the middle of a multi-million dollar diamond heist, where Reggie's flailing hysteria allows him to avoid capture. Things start to look up for Reggie when he realizes he's the sole winner of a $60 million lottery! Unfortunately, the winning ticket is still in Reggie's wallet ... in the getaway van ... and has been discovered by the diamond thieves. And then Reggie sees Bucum. Bucum may not trust Reggie, but if Reggie's story is true it means a whole lot more than the bail money ... and if it's a scam, Bucum can use Reggie as bait to catch the diamond thieves. Now, either way Bucum can't lose--because, after all, it's All About the Benjamins.\", ']]>', 'Amazon.com', \"Ice Cube cowrote, produced, and stars in this action caper. Bucum (Cube) is a bounty hunter (get it?) with dreams of big money. Reggie (Mike Epps) is a small-time grifter who also has dreams of big money and is at the top of Bucum's list to boot. Yep, you guessed it: tough guy/funny guy buddy flick.\", 'All About the Benjamins', \"is pretty much a by-the-numbers piece of work. There's plenty of macho posturing, gunfire, big-ticket items exploding, and curse words inserted into the script in lieu of actual punch lines. The plot has holes big enough to drive a locomotive through, but then again the plot isn't really the point. Epps's attempts at wacky comedy wear thin early on, but Ice Cube does a fine job, and together they do make quite a few moments hit. Best recommended for when you want turn-your-brain-off excitement.\", '--Ali Davis']\n{'Genre': 'Comedy, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, DTS Surround Sound, NTSC, Dolby, Subtitled, WidescreenMultiple Formats, Anamorphic, Closed-captioned, Color, DTS Surround Sound, NTSC, Dolby, Subtitled, Widescreen  See more', 'Contributor': 'Bray, Kevin, Beres, Julianne, Miller, Valarie Rae, Cube, Ice, Giaimo, Anthony, Chase, Jeff, Flanagan, Tommy, Corone, Antoni, Mendes, Eva, Chaplin, Carmen, Epps, Mike, Wow, Bow, Turner, Joan, Brooks, Evelyn, Hall, Anthony Michael, Smith, Roger Guenveur, Chianese Jr., Dominic, Salvano, Gino, Ward (III), Tony, Carter, BobBray, Kevin, Beres, Julianne, Miller, Valarie Rae, Cube, Ice, Giaimo, Anthony, Chase, Jeff, Flanagan, Tommy, Corone, Antoni, Mendes, Eva, Chaplin, Carmen, Epps, Mike, Wow, Bow, Turner, Joan, Brooks, Evelyn, Hall, Anthony Michael, Smith, Roger Guenveur, Chianese Jr., D…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (DTS 5.1)', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1000032313', 'Director': 'Bray, Kevin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, DTS Surround Sound, NTSC, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 14, 2004', 'Actors': 'Beres, Julianne, Bray, Kevin, Brooks, Evelyn, Carter, Bob, Chaplin, Carmen', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nWe absolutely loved this movie. So funny\nGreat movie. We watch it all the time\nYou Again\nKristen Bell  (Actor),     Betty White  (Actor),     Andy Fickman  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"You Again, the nonstop laugh fest, is pure fun that features an all-star cast with comedy pedigrees - including Kristen Bell, Jamie Lee Curtis, Sigourney Weaver and the always outrageous Betty White. For Marnie (Bell), high school was a horror movie, and her brother's wedding is the sequel when her archrival comes back to haunt her as his bride. It's nice girl versus mean girl in this hysterical reunion with the one person Marnie would really like to forget. And if that weren't enough, Marnie's mom (Curtis) reunites with her own high school nemesis (Weaver). Complete with hilarious, never-before-seen bonus material, You Again is one crazy comedy that'll keep you laughing again and again.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Kristen Bell, Odette Yustman, Andy Fickman, Victor Garber, Moe Jelline, Betty White, Jamie Lee Curtis, Sigourney Weaver, Kristen ChenowethKristen Bell, Odette Yustman, Andy Fickman, Victor Garber, Moe Jelline, Betty White, Jamie Lee Curtis, Sigourney Weaver, Kristen Chenoweth  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '622800', 'Director': 'Andy Fickman', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Kristen Bell, Betty White, Jamie Lee Curtis, Sigourney Weaver, Odette Yustman', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Touchstone Pictures', 'Writers': 'Moe Jelline', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie\nGreat movie\nRide Along\nIce Cube  (Actor, Producer),     Kevin Hart  (Actor),     Tim Story  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"For the past two years, high school security guard Ben (Kevin Hart) has been trying to show decorated detective James (Ice Cube) that he's more than just a video game junkie who's unworthy of James' sister. When Ben finally gets accepted into the police academy, James invites him on a ride-along designed to scare the hell out of him and ultimately demonstrate if Ben has what it takes to take care of his sister. But when the wild night leads them to the most notorious criminal in the city, James will find that his new partner's rapid-fire mouth is just as dangerous as the bullets speeding at it. Also starring John Leguizamo and Laurence Fishburne, Ride Along is an action-packed comedy with big thrills and even bigger laughs.\", 'Bonus Content:', 'Gag Reel', 'Gag Reel', 'It Was a Good Day – On the Set of Ride Along', 'It Was a Good Day – On the Set of Ride Along', 'Atlanta: The Character', 'Atlanta: The Character', 'Feature Commentary with Director Tim Story', 'Feature Commentary with Director Tim Story', ']]>']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Greg Coolidge, John Leguizamo, Kevin Hart, Phil Hay, Larry Brezner, Ice Cube, Will Packer, Bruce McGill, Tim Story, Matt Alvarez, Tika Sumpter, Jason Mantzoukas, Laurence Fishburne, Matt ManfrediGreg Coolidge, John Leguizamo, Kevin Hart, Phil Hay, Larry Brezner, Ice Cube, Will Packer, Bruce McGill, Tim Story, Matt Alvarez, Tika Sumpter, Jason Mantzoukas, Laurence Fishburne, Matt Manfredi   See more', 'Initial release date': '2014-04-15', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '111378', 'Director': 'Tim Story', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 15, 2014', 'Actors': 'Ice Cube, Kevin Hart, John Leguizamo, Bruce McGill, Tika Sumpter', 'Subtitles': 'Spanish, French', 'Producers': 'Will Packer, Ice Cube, Matt Alvarez, Larry Brezner', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Greg Coolidge, Jason Mantzoukas, Phil Hay, Matt Manfredi', 'Number of discs': '1'}\nA good funny movie\nVery happy\n21 Jump Street\nJonah Hill  (Actor),     Channing Tatum  (Actor),     Phil Lord  (Director),     Chris Miller  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Former high school foes turned rookie cop partners can’t catch a break – until they’re assigned to pose as students and bust a drug ring inside their old alma mater. Living like teenagers again, they slip back into their adolescent selves and risk the case – and their friendship - with hysterically disastrous results! Jonah Hill, Channing Tatum and Ice Cube star in this outrageously hilarious action-comedy!', 'Amazon.com', 'When', '21 Jump Street', 'premiered on Fox in 1987, it offered a cool-kid twist on the cop drama formula. This new-era reinvention keeps the cops, but trades earnest drama for raunchy comedy. At Sagan High, Schmidt (newly scrawny Jonah Hill, fresh off an Oscar nomination for', 'Moneyball', ') was a brainy guy with no game, while Jenko (ever-brawny Channing Tatum, funnier than expected) was a popular jock with bad grades. Five years later, they reconnect at police academy, where enemies become friends when they pool their resources, but after their first bust goes bad, the deputy chief (Nick Offerman) ships them off to Jump Street, where their youthful looks lead to an undercover sting operation at Sagan (apparently, no staff members recognize the former students). Due to a mix-up, Schmidt ends up with the theater kids and Jenko with the science nerds. Through a production of', 'Peter Pan', \", Schmidt meets Molly (Brie Larson), who introduces him to her drug dealer boyfriend, Eric (James Franco's deadpan brother, Dave). Now, they just need to track down Eric's supplier to shut the whole operation down. Along the way, Schmidt discovers his inner performer and Jenko his inner geek, but these new personas threaten the case, generating several\", 'Superbad', \"-style laughs, so it's too bad the finale devolves into bloodshed more befitting a John Woo crime caper, though the snappy chemistry between Hill and Tatum papers over some of the holes in the script--along with a foul-mouthed Ice Cube and one rather famous original cast member.\", '--Kathleen C. Fennessy']\n{'Genre': 'Action, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Ultraviolet, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copyMultiple Formats, AC-3, Closed-captioned, Color, Ultraviolet, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copy  See more', 'Contributor': 'Jonah Hill, Channing Tatum, Phil Lord, Chris Miller, Dave Franco, Brie Larson', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '21-jump-street-2012', 'Director': 'Phil Lord, Chris Miller', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Ultraviolet, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Ultraviolet, Digital_copy', 'Run time': '1 hour and 50 minutes', 'Release date': 'June 26, 2012', 'Actors': 'Jonah Hill, Channing Tatum, Brie Larson, Dave Franco', 'Dubbed': 'French', 'Studio': 'Sony Pictures Studios', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLoved this movie watch alot\nGreat movie\nJust Go With It\nJennifer Aniston  (Actor),     Adam Sandler  (Actor),     Dennis Dugan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Danny Maccabee (Adam Sandler) meets the girl of his dreams (Brooklyn Decker) but has to enlist his loyal assistant Katherine (Jennifer Aniston) to pretend to be his soon-to-be ex-wife in order to cover up a careless lie. When more lies backfire, Katherine’s kids become involved, and everyone heads off to Hawaii for a ridiculous, out-of-control weekend that tests the limits of how far we’ll go for love.', 'Amazon.com', 'It all comes down to chemistry. And the two main stars of', 'Just Go with It', ', Jennifer Aniston and Adam Sandler, thankfully, have chemistry to spare. Both actors have plenty of sheer likability and honest ease, as well as sparks in just the right places, which helps propel', 'Just Go with It', 'to its satisfying (if a bit predictable) conclusion. (Hollywood execs: Consider an update of', 'Moonlighting', 'starring these two.) If the premise, loosely based on the Goldie Hawn film', 'Cactus Flower', ', stretches reality, the capability of the whole cast makes', 'Just Go with It', \"an enjoyable ride. Sandler plays Danny, a surgeon who falls for a much-younger bombshell, Palmer (swimsuit model Brooklyn Decker, a surprisingly natural actress). But when Palmer finds the fake wedding band that commitment-phobe Danny has used for his no-strings-attached previous relationships, the web of fibs begins. Danny asks his assistant, Katherine (Aniston), to pretend to be his soon-to-be-ex-wife, and Aniston plays it to the hilt. But soon Danny's wobbly house of cards includes Katherine's children--and, in the ultimate romantic-comedy trope, a group trip to Hawaii to work things out. The cast really is stellar, including very small supporting roles by Nicole Kidman and singer Dave Matthews, as an insufferable couple disliked intensely by Katherine. (Of course they end up in Hawaii with the gang, too.) Minka Kelly, Kevin Nealon, and Rachel Dratch also make memorable cameos. But it's Sandler and Aniston, along with the snappy direction by Dennis Dugan (\", 'Happy Gilmore', ',', 'Big Daddy', '), who make', 'Just Go with It', 'one of the more romantic--and funny--romantic comedies in recent memory. Our advice: Sit back, and just go with it. --', 'A.T. Hurley']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Jennifer Aniston, Adam Sandler, Dennis Dugan', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 56 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'COLD37679D', 'Director': 'Dennis Dugan', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 7, 2011', 'Actors': 'Jennifer Aniston, Adam Sandler', 'Dubbed': 'French', 'Subtitles': 'Spanish, English, French', 'Studio': 'Columbia Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie\nGreat movie",
  "profile": "**Updated User Profile Summary:**\n\nThe user maintains a strong preference for comedy films that highlight themes of friendship, female camaraderie, and family dynamics. Their enthusiasm for action-comedy narratives continues, enjoying films that blend humor with thrilling escapades. The user's commitment to collecting physical media remains evident, as they consistently favor DVDs for their collection.\n\nRecent interactions emphasize their enjoyment of romantic comedies, particularly those featuring engaging performances from well-known actors, which resonate with their love for heartfelt humor and family-friendly content. Their average rating for enjoyable films remains high at 5.0, reflecting a keen appreciation for emotionally impactful narratives that encourage shared viewing experiences, especially with their daughter.\n\nThe user actively seeks out films that balance laughter with genuine connection, favoring stories that celebrate relationships and camaraderie. They exhibit a consistent interest in lighthearted, fun-filled movies that foster joy and bonding. Recent purchases further bolster their love for comedies that explore love and friendship through amusing and at times chaotic scenarios.\n\nIn summary, the user demonstrates a dedicated preference for comedies rich in relational themes, combining adventure with humor, while still prioritizing the emotional depth that enhances their family movie-watching experiences. This reinforces their enthusiasm for cinematic content that both entertains and resonates on a personal level.",
  "metrics": {
    "rouge1_f": 0.06803939122649956,
    "rouge2_f": 0.002985965959988056,
    "rougeL_f": 0.03282602208296031,
    "meteor": 0.01826132923254361,
    "bleu1": 4.100513347963099e-09,
    "bleu2": 1.2803882733850382e-09,
    "bleu3": 1.874103228823558e-10,
    "bleu4": 7.17768514061283e-11,
    "bertscore_precision": 0.3227357864379883,
    "bertscore_recall": 0.48709529638290405,
    "bertscore_f1": 0.3882367014884949
  }
}