{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/07/05\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Billy Gierhart', 'Terry McDonough', 'Mark Pellington', 'Rosemary Rodriguez', 'Daniel Sackheim', 'Romeo Tirone', 'J. Miller Tobin', 'Alex Zakrzewski'], 'Producers': ['Alon Aranya', 'Elizabeth Benjamin'], 'Studio': ['ABC']}\nReview Text: I loved this series.  I wanted to rewatch it and the price from amazon video was very good.  I do not have room to store dvd's anymore.  I store them on my computer.  it is great.  just turn it on and watch as many episodes as I want.  no getting up and down to start a new episode.  think about it.  it's super.\nReview Title: love red widow\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Doing Time on Maple Drive\nJames Sikking  (Actor),     Bibi Besch  (Actor),     Ken Olin  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'NR', 'Release Date:', '6-FEB-2007', 'Media Type:', 'DVD']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Richard Israel, James Sikking, Jayne Brook, Lori Loughlin, Ken Olin, Bennett Cale, Bibi Besch, William McNamara, Philip Linton, David Byron, Jim Carrey, James Duff, Janice Lynde, Mark ChaetRichard Israel, James Sikking, Jayne Brook, Lori Loughlin, Ken Olin, Bennett Cale, Bibi Besch, William McNamara, Philip Linton, David Byron, Jim Carrey, James Duff, Janice Lynde, Mark Chaet  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2218257', 'Director': 'Ken Olin', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'September 7, 2004', 'Actors': 'James Sikking, Bibi Besch, William McNamara, Jayne Brook, David Byron', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'James Duff', 'Number of discs': '1'}\ni looked for years for this dvd.  i am so pleased to find it.  amazon comes thru again with something that was unfindable everyplace else.\namazon delivers again\nAvatar (Three-Disc Extended Collector's Edition)\nSam Worthington  (Actor),     Zoe Saldana  (Actor),     James Cameron  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"Experience the spectacular world of James Cameron's\", 'Avatar', \"as never before with this all-new three-disc extended collector’s edition. The journey begins with three movie versions: the original theatrical release, the special edition re-release, and the exclusive extended cut not shown in theaters. The set's bonus feature run more than three hours and include over 45 minutes of deleted scenes and a feature-length documentary on the film's groundbreaking production. The greatest adventure of all time just got bigger and better.\", 'Versions of', 'Avatar', 'on Blu-ray and DVD', 'Edition', 'Format', 'Release Date', 'Special Features', 'Avatar', \"(Extended Collector's Edition)\", 'Three Blu-ray Discs Nov. 16, 2010 Three versions of the movie including the previously unreleased extended cut, plus more than eight hours of bonus features including over 45 minutes of deleted scenes, interactive scene deconstruction,', 'Pandorapedia', ', documentaries and featurettes, and BD-LIVE content (requires compatible player and Internet connection)', 'Avatar', \"(Extended Collector's Edition)\", 'Three DVDs Nov. 16, 2010 Three versions of the movie including the previously unreleased extended cut, plus more than three hours of bonus features including documentaries and over 45 minutes of deleted scenes', 'Avatar', '(Original Theatrical Edition)', 'Two-disc Blu-ray/DVD combo Apr. 22, 2010 None', 'Avatar', '(Original Theatrical Edition)', 'DVD Apr. 22, 2010 None', \"Contents of the DVD Extended Collector's Edition\", 'Review of the Original Theatrical Edition', \"Here's what we had to say about the original theatrical edition of\", 'Avatar', 'after seeing it on the big screen: After 12 years of thinking about it (and waiting for movie technology to catch up with his visions), James Cameron followed up his unsinkable', 'Titanic', 'with', 'Avatar', ', a sci-fi epic meant to trump all previous sci-fi epics. Set in the future on a distant planet,', 'Avatar', \"spins a simple little parable about greedy colonizers (that would be mankind) messing up the lush tribal world of Pandora. A paraplegic Marine named Jake (Sam Worthington) acts through a 9-foot-tall avatar that allows him to roam the planet and pass as one of the Na'vi, the blue-skinned, large-eyed native people who would very much like to live their peaceful lives without the interference of the visitors. Although he's supposed to be gathering intel for the badass general (Stephen Lang) who'd like to lay waste to the planet and its inhabitants, Jake naturally begins to take a liking to the Na'vi, especially the feisty Neytiri (Zoë Saldana, whose entire performance, recorded by Cameron's complicated motion-capture system, exists as a digitally rendered Na'vi). The movie uses state-of-the-art 3D technology to plunge the viewer deep into Cameron's crazy toy box of planetary ecosystems and high-tech machinery. Maybe it's the fact that Cameron seems torn between his two loves--awesome destructive gizmos and flower-power message mongering--that makes\", 'Avatar', '\\'s pursuit of its point ultimately uncertain. That, and the fact that Cameron\\'s dialogue continues to clunk badly. If you\\'re won over by the movie\\'s trippy new world, the characters will be forgivable as broad, useful archetypes rather than standard-issue stereotypes, and you might be able to overlook the unsurprising central plot. (The overextended \"take that, Michael Bay\" final battle sequences could tax even Cameron enthusiasts, however.) It doesn\\'t measure up to the hype (what could?) yet', 'Avatar', 'frequently hits a giddy delirium all its own. The film itself is our Pandora, a sensation-saturated universe only the movies could create.', '--Robert Horton']\n{'Genre': 'Action/Adventure', 'Format': 'Color, Multiple Formats, DTS Surround Sound, Dubbed, Dolby, NTSC, Subtitled, Special Extended Version, Widescreen, Surround SoundColor, Multiple Formats, DTS Surround Sound, Dubbed, Dolby, NTSC, Subtitled, Special Extended Version, Widescreen, Surround Sound  See more', 'Contributor': 'Stephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Joel David Moore, Sam WorthingtonStephen Lang, Michelle Rodriguez, Giovanni Ribisi, James Cameron, Sigourney Weaver, Zoe Saldana, Joel David Moore, Sam Worthington  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Surround), Spanish (Dolby Surround), French (Dolby Surround)', 'Runtime': '2 hours and 42 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.75 x 5.38 x 7.68 inches; 8.8 Ounces', 'Item model number': '15035542', 'Director': 'James Cameron', 'Media Format': 'Color, Multiple Formats, DTS Surround Sound, Dubbed, Dolby, NTSC, Subtitled, Special Extended Version, Widescreen, Surround Sound', 'Run time': '2 hours and 42 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Sam Worthington, Zoe Saldana, Sigourney Weaver, Michelle Rodriguez, Stephen Lang', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Writers': 'James Cameron', 'Number of discs': '3'}\nwhy did they not put one version per disc and the extras on a fourth????  i watch this with my grandchildren over and over and over and now we have to change disc and pick the version again.  it's a real pain and totally not necessary.  who thought this up and why????  they cannot watch by themselves, somebody has to come and change the discs.  get a brain.  my copy skips several places also. very, very disappointed.\nchanging discs?????\nAyn Rand's We the Living\nAlida Valli  (Actor),     Rossano Brazzi  (Actor),     Gofreddo Alessandrini  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Movies\n['Product Description', 'Beautiful, strong-willed Kira (Alida Valli) is torn between two men (Rossano Brazzi and Fosco Giachetti) while she courageously defies the authoritarian rule of post-revolutionary Russia. Her passionate struggle for the right to her own life burns at the core of WE THE LIVING.', 'BONUS FEATURES', 'This special 2-DVD set includes over 45 minutes of deleted scenes never before released. Each scene is preceded by a title that explaining why Ayn Rand wanted it removed.', 'Review', 'An amazing piece of cinema. I loved every minute of it...Alida Valli has the same kind of quality on-screen as Garbo-just magical-what a performance! I think you will also fall under the spell of this film. --Michael Medved/Sneak Previews(An) ambitious and ingenious film. --Caryn James/New York TimesNothing stirs the soul quite so much as buried treasure. WE THE LIVING qualifies in every respect as film treasure...dazzling performances...Director Alessandrini brilliantly blends glamour, romance, politics, intrigue and danger..this is a film that avoids the predictable every step of the way...one of the best movies of the year. --Mike McGrady/New York Newsday']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Gofreddo Alessandrini', 'Media Format': 'NTSC', 'Run time': '2 hours and 52 minutes', 'Release date': 'September 11, 2009', 'Actors': 'Alida Valli, Rossano Brazzi, Fosco Giachetti', 'Subtitles': 'English', 'Studio': 'Scalera Films/Duncan Scott Productions', 'Number of discs': '2'}\ni was amazed to find this available.  never thought it might be possible to watch it.  thanks amazon, for providing this long sought item.\namazed to find this\n{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Leslie Stevens', 'Byron Haskin', 'Laslo Benedek', 'James Goldstone', 'Leonard Horn', 'Gerd Oswald', 'Abner Biberman', 'John Erman', 'John Brahm', 'Paul Stanley', 'Robert Florey', 'Alan Crosland Jr.', 'Charles Haas', 'Leon Benson', 'Felix Fiest'], 'Producers': ['Leslie Stevens'], 'Starring': ['Robert Culp', 'Arlene Martel', 'Abraham Sofaer'], 'Studio': ['MGM']}\none of my favorites from when i was young -- admittedly a longgggggg time ago,  some of these episodes are classics never surpassed by all the subsequent immitations.  well worth the price.  not just the empty entertainment of so many tv series, the moral teachings to be found in these shows still hold true.\ngreat find great price\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Billy Gierhart', 'Terry McDonough', 'Mark Pellington', 'Rosemary Rodriguez', 'Daniel Sackheim', 'Romeo Tirone', 'J. Miller Tobin', 'Alex Zakrzewski'], 'Producers': ['Alon Aranya', 'Elizabeth Benjamin'], 'Studio': ['ABC']}\nI loved this series.  I wanted to rewatch it and the price from amazon video was very good.  I do not have room to store dvd's anymore.  I store them on my computer.  it is great.  just turn it on and watch as many episodes as I want.  no getting up and down to start a new episode.  think about it.  it's super.\nlove red widow",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interests:** The user maintains a deep passion for movies and TV, particularly family-oriented dramas and classic series that resonate across generations. They continue to enjoy action and adventure films suitable for viewing with grandchildren, valuing engaging storytelling with meaningful themes.\n\n- **Preferred Formats:** While the user has traditionally favored DVDs, they are adapting to digital formats due to space constraints. They now store films on their computer for easy access, appreciating the convenience of binge-watching series without interruption. Despite this shift, they still prioritize features such as closed captioning and subtitles for enhanced accessibility.\n\n- **Shopping Behavior:** The user enjoys the excitement of discovering hard-to-find titles and shows a strong inclination towards online shopping, valuing competitive pricing. They take pleasure in finding unique films that evoke personal memories and align with their interests.\n\n- **Reviewing Behavior:** As an active reviewer, the user shares thoughtful evaluations reflecting a focus on product reliability and emotional impact. Their recent review highlighted satisfaction with a beloved series, emphasizing the joy of convenient streaming options.\n\n- **Emotional Connection:** The user's connection to cinema remains deeply emotional, intertwining film-watching with cherished family memories. They appreciate nostalgic titles that reinforce familial bonds and meaningful storytelling.\n\nThis profile highlights a dedicated film enthusiast navigating the evolving landscape of media consumption while still valuing the emotional resonance of cinema.",
  "metrics": {
    "rouge1_f": 0.11683483802442911,
    "rouge2_f": 0.007442849548112705,
    "rougeL_f": 0.05204460966542751,
    "meteor": 0.03242422848732926,
    "bleu1": 0.00018932814790566382,
    "bleu2": 4.1789203124528884e-05,
    "bleu3": 1.4787018571719348e-05,
    "bleu4": 4.950886608741086e-06,
    "bertscore_precision": 0.3317028880119324,
    "bertscore_recall": 0.46820440888404846,
    "bertscore_f1": 0.3883068859577179
  }
}