{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/02/06\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)'], 'Directors': ['Brad Bird'], 'Producers': ['Brad Lewis'], 'Starring': ['Patton Oswalt', 'Ian Holm', 'Lou Romano']}\nReview Text: Fun movie for everyone. The adult jokes are definitely set so the young ones will not get them.\nReview Title: Great fun\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Amiel', 'Michael Trim', 'Adam Bernstein', 'Andrew Bernstein', 'Rosemary Rodriguez', 'Peter Werner', 'Keith Boak', 'Bill Johnson', 'David Rodriguez', 'Peter Weller'], 'Studio': ['WGN America']}\nNot bad just not excellent\nDecent show\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Conrad Vernon', 'Greg Tiernan'], 'Producers': ['Seth Rogen'], 'Starring': ['Michael Cera', 'James Franco', 'Bill Hader'], 'Studio': ['Columbia Pictures']}\nCould not stop laughing\nHilarious\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['David Ayer'], 'Producers': ['Charles Roven', 'Richard Suckle'], 'Starring': ['Will Smith', 'Jared Leto', 'Margot Robbie'], 'Studio': ['WARNER BROS.']}\nWas actually better than the version shown in the theater\nBetter than theater\n{'Content advisory': ['Violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Romeo Tirone', 'Neil Marshall', 'John Badham', 'Nick Gomez', 'T.J. Scott', 'Steve Shill', 'John F. Showalter', 'David Boyd', 'Mary Harron', 'Sam Hill'], 'Producers': ['Not Specified'], 'Starring': ['Matt Ryan', 'Angelica Celaya', 'Charles Halford']}\nLove the action and pace of show\nGreat show\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['G. J. Echternkamp'], 'Producers': ['Roger Corman'], 'Starring': ['Manu Bennett', 'Malcolm McDowell', 'Marci Miller']}\nNot as good as original. You can tell they used old vw bugs for the cars.\nMediocre at best\n50 Dead Men Walking\nJim Sturgess  (Actor),     Sir Ben Kingsley  (Actor),     Kari Skogland  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Belfast hoodlum Martin (Jim Sturgess) is recruited by a British agent (Ben Kingsley) to infiltrate the IRA during the height of the Northern Irish conflict and quickly becomes embroiled in a dangerous game that could cost him his life if his secret is found out. As other informers are brutally murdered, Martin starts to look for a way out, but his handler urges him to stay undercover in this taut action packed thriller based on a true story.', 'Amazon.com', \"In her nerve-jangling adaptation of Martin McGartland's memoir, director Kari Skogland takes the politics out of an inherently political scenario. As Martin, Jim Sturgess (\", '21', ') affects a convincing accent as a \"Catholic hood selling stolen goods\" in Belfast in 1988. When the British Special Branch catches Martin in the act and coerces him to inform on the Irish Republican Army in lieu of jail time, he takes the bait, knowing full well the army will kill him if they find out. Once his girlfriend, Lara (Natalie Press), becomes pregnant, the income the British provide becomes more necessary than ever. Further, Martin\\'s sympathetic handler, Fergus (Ben Kingsley in fine form), turns out to be even more of an ally than his best mate, Sean (Kevin Zegers). During Martin\\'s days with the IRA, he also meets the flame-haired Grace (Rose McGowan in an underwritten role), who offers him a vision of a different life. The title refers to the belief that Martin\\'s intelligence saved the lives of 50 potential targets, though the film suggests he acted more out of self-interest than a sense of duty. It\\'s also hard to imagine that anyone raised in Northern Ireland could remain so resolutely apolitical--but it isn\\'t inconceivable either. The real-life informer survived where many others did not, though he\\'s been living under an assumed name since. Extras include deleted scenes, 30 minutes of fairly unilluminating B-roll (unused) footage, and commentary from Skogland, who states, \"Ultimately, this movie is not a political story; this is a human drama.\"', '--Kathleen C. Fennessy', 'Review', 'A harrowing slice of life - genuinely gripping. Adrenalized thriller. --The New York Times3 Stars --Roger Ebert - Chicago Sun-TimesEnough thrills to start a theme park. --Variety', 'See more']\n{'Genre': 'Mystery & Thrillers, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'Jim Sturgess, Sir Ben Kingsley, Kari Skogland, Rose McGowan, Kevin Zegers', 'Language': 'English', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 1.6 Ounces', 'Item model number': '6.25829E+11', 'Director': 'Kari Skogland', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 5, 2010', 'Actors': 'Jim Sturgess, Sir Ben Kingsley, Rose McGowan, Kevin Zegers', 'Subtitles': 'English, Spanish', 'Studio': 'Peace Arch Trinity', 'Number of discs': '1'}\nNot quite in as new condition as described in the add. But still in relatively good condition.\nGood condition\nRoughnecks - The Starship Troopers Chronicles - The Complete Campaigns\nNicholas Guest  (Actor),     James Horan  (Actor),     Andre Clavel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['FOLLOWS THE ADVENTURES OF RICO, CARMEN & CARL, A TRIO OF HIGH SCHOOL BUDS, LURED TO ENLIST BY THE THRILL OF ADVENTURE ONDISTANT PLANETS, THESE UNSUNG HEROES ARE UNAWARE THAT THE BATTLE OF THE BUGS IS ABOUT TO RE-ERUPT, SENDING THEM ALL TOTHE FRONT LINES OF THE FIRST INTERSTELLAR WAR.']\n{'Genre': 'Family', 'Format': \"Box set, Color, Dolby, AC-3, Full Screen, NTSC, Surround Sound, Collector's Edition\", 'Contributor': 'Tony Sommo, Michael Kramer, Bill Fagerbakke, Steve Staley, David S. Clark, Alexander Polinsky, Paul Diamond, James Horan, Andre Clavel, Tish Hicks, David DeLuise, Thomas Wagner, Pat Allee, Elizabeth Daily, Rider Strong, Rino Romano, Jamie Hanes, Timothy Schlattmann, Nicholas GuestTony Sommo, Michael Kramer, Bill Fagerbakke, Steve Staley, David S. Clark, Alexander Polinsky, Paul Diamond, James Horan, Andre Clavel, Tish Hicks, David DeLuise, Thomas Wagner, Pat Allee, Elizabeth Daily, Rider Strong, Rino Romano, Jamie Hanes, Timothy Schl…   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '12 hours and 58 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 11.2 Ounces', 'Director': 'Andre Clavel', 'Media Format': \"Box set, Color, Dolby, AC-3, Full Screen, NTSC, Surround Sound, Collector's Edition\", 'Run time': '12 hours and 58 minutes', 'Release date': 'July 5, 2005', 'Actors': 'Nicholas Guest, James Horan, Alexander Polinsky, Rino Romano, Elizabeth Daily', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'David S. Clark, Michael Kramer, Pat Allee, Paul Diamond, Timothy Schlattmann', 'Number of discs': '4'}\nVery happy to have found these.\nGreat service\nMax Headroom: The Complete Series\nMatt Frewer  (Actor),     Amanda Pays  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n{'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC, Dolby, Full Screen', 'Contributor': 'George Coe, Jeffrey Tambor, Amanda Pays, Lee Wilkof, Chris Young, Matt Frewer', 'Language': 'English', 'Number Of Discs': '5'}\nBrings back memories from many years ago. Still funny now.\nGreat product and service\nHeavy Metal\nScience Fiction, Animation, Futuristic, Sensual\n['The otherworldly tale of a glowing green orb that spreads destruction until confronted with pure goodness. Lavish animation and score.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gerald Potterton'], 'Producers': ['Ivan Reitman'], 'Starring': ['John Candy', 'Eugene Levy', 'Richard Romanus']}\nOne of my favorite movies from when I was much younger. Great music and allusion to things that were common at the time.\nMemories of yore.\n{'Audio languages': ['English', 'English [Audio Description]', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)'], 'Directors': ['Brad Bird'], 'Producers': ['Brad Lewis'], 'Starring': ['Patton Oswalt', 'Ian Holm', 'Lou Romano']}\nFun movie for everyone. The adult jokes are definitely set so the young ones will not get them.\nGreat fun",
  "profile": "User Profile Summary:\n\nThe user maintains a strong passion for television and film, reflected in an impressive average rating of 4.7. They value originality and high production quality, particularly in emotionally and intellectually engaging storytelling. Recent purchasing behavior continues to highlight their appreciation for gripping narratives that skillfully blend action and complex themes, with a growing interest in family-oriented content.\n\nA recent interaction reveals a nostalgic connection to animation that combines humor and adventure, further diversifying their interests. Their reviews consistently emphasize production authenticity and quality, showcasing a discerning eye for detail and a commitment to service excellence.\n\nWith a preference for English-language productions fostering deep storytelling connections, the user remains open to subtitled works. They favor immersive narratives across multiple genres, particularly animated offerings that balance humor with emotional depth. This most recent purchase reinforces their enjoyment of entertaining narratives rich in humor and profound themes, indicating a nuanced understanding of cinematic storytelling.\n\nAdditionally, the user demonstrates a strong engagement with music and cultural references in films, reflecting cherished memories from childhood. Their refined taste continues to evolve, embracing varied artistic styles and narratives while valuing content suitable for both adults and children, indicating a well-rounded appreciation for storytelling that resonates across generations.",
  "metrics": {
    "rouge1_f": 0.12474297464016451,
    "rouge2_f": 0.00549073438572409,
    "rougeL_f": 0.0520904729266621,
    "meteor": 0.03080082135523614,
    "bleu1": 0.000127758686629315,
    "bleu2": 3.463521170647367e-05,
    "bleu3": 5.734363326197428e-06,
    "bleu4": 2.335890663846548e-06,
    "bertscore_precision": 0.30795249342918396,
    "bertscore_recall": 0.45182549953460693,
    "bertscore_f1": 0.3662669360637665
  }
}