{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/08/27\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Reiner'], 'Producers': ['Rob Reiner', 'Andrew Scheinman'], 'Starring': ['Billy Crystal', 'Meg Ryan', 'Carrie Fisher'], 'Studio': ['WARNER BROS.']}\nReview Text: Heartwarming and hold up over time.\nReview Title: Sweet love.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Matthew Bonifacio'], 'Producers': ['Stephen Ashkinos', 'Matthew Bonifacio', 'Carmine Famiglietti'], 'Starring': ['Lou Martini Jr.', 'Susan Varon', 'Sharon Angela'], 'Studio': ['FilmBuff']}\nThis was listed as being a documentary and so I started it. It's clearly not, and from what I can tell (I only watched 20 minutes it's not that great of a movie.\nNot a Documentary\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Berlinger', 'Bruce Sinofsky'], 'Producers': ['Joe Berlinger', 'Bruce Sinofsky', 'IFC'], 'Starring': ['Delbert Ward', 'Roscoe Ward', 'Connie Chung']}\nI felt this was well done and true. No need to make a story this one tells itself in the footage alone and does a great job. I think it is easy to understand the peoples emotions in this movie and how they feel about the family.\nWell Done\n{'Subtitles': ['None available'], 'Directors': ['Richard Press'], 'Producers': ['Philip Gefter'], 'Starring': ['Bill Cunningham', 'Anna Wintour', 'Tom Wolfe'], 'Studio': ['Zeitgeist Films']}\nI love a good documentary about talented interesting people and this is one of them for sure. You really fall for Bill's simplicity and his talent. What a neat person.\nLove him~\nSurviving Progress\nMargaret Atwood  (Actor),     Colin Beavan  (Actor),     Mathieu Roy  (Director),     Harold Crooks  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Product Description', 'Technological advancement, economic development, population increase - are they signs of a thriving society? Or too much of a good thing? Based on the best-selling book a Short History of Progress, this provocative documentary explores the concept of progress in our modern world, guiding US through a sweeping but detailed survey of the major \"progress traps\" facing our civilization in the arenas of technology, economics, consumption, and the environment. Featuring powerful arguments from such visionaries as Jane Goodall, Margaret Atwood, Stephen Hawking, Craig Venter, Robert Wright, Michael Hudson, and Ronald Wright, this enlightening and visually spectacular film invites US to contemplate the progress traps that destroyed past civilizations and that lie treacherously embedded in our own. Leading critics of Wall Street, cognitive psychologists, and ecologists lay bare the consequences of progress-as-usual as the film travels around the world - from a burgeoning China to the disappearing rainforest\\'s of Brazil to a chimp research lab in New Iberia, Louisiana - to construct a shocking overview of the way our global economic system is eating away at our planet\\'s resources and shackling entire populations with poverty. Providing an honest look at the risks and pitfalls of running 21st Century \"software\" (our accumulated knowledge) on 50,000-year-old \"hardware\" (our primate brains), Surviving Progress offers a challenge: To prove making apes smarter was not an evolutionary dead end.', 'Review', \"MIND-EXPANDING... SUBVERSIVE... BRISTLING WITH PROVOCATIVE INSIGHTS. Both brainy and light on its feet, and with wide variety of involving visuals, this mind-expanding ecological documentary bristles with provocative insights and probing questions about humanity and the state of the world. --Kenneth Turan, LA TimesA who's-who of great thinkers are riveting as they walk us through the question of whether we will or can survive progress. --Ernest Hardy, Seattle WeeklyCRITIC'S CHOICE. EXCELLENT! Succinct and entertaining. Weaves together a vast assortment of materials as well as information, to highly watchable results. Do the earth a favor: see this movie, and drag a skeptic you know along. --Dennis Harvey, San Francisco Bay Guardian\"]\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Gary Marcus, Daniel Povinelli, Mark Levine, Marina Silva, Kambale Musavuli, David Suzuki, Harold Crooks, Jim Thomas, Mathieu Roy, Michael Hudson, Victor Zhikai Gao, Vaclav Smil, Jane Goodall, Stephen Hawking, Robert Wright, Colin Beavan, Margaret Atwood, Simon JohnsonGary Marcus, Daniel Povinelli, Mark Levine, Marina Silva, Kambale Musavuli, David Suzuki, Harold Crooks, Jim Thomas, Mathieu Roy, Michael Hudson, Victor Zhikai Gao, Vaclav Smil, Jane Goodall, Stephen Hawking, Robert Wright, Colin Beavan, Margaret Atwood, Simon Jo…   See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25729809', 'Director': 'Mathieu Roy, Harold Crooks', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'September 25, 2012', 'Actors': 'Margaret Atwood, Colin Beavan, Jane Goodall, Stephen Hawking, Michael Hudson', 'Subtitles': 'English', 'Studio': 'First Run Features', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis one really gets you thinking and inspires change. With a great soundtrack to boot (Philip Glass like) Excellent ~\nExcellent ~\nPeppa Pig: My Birthday Party\nRated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Peppa is a lovable little piggy who lives with her younger brother George, Mummy Pig and Daddy Pig. Peppa loves playing games, dressing up, visiting exciting places and making new friends, but her absolute favorite thing is jumping up and down in muddy puddles!Bonus Content:', 'Disc 1 - Peppa Pig My Birthday Party:', 'Learn the Alphabet', 'Learn the Alphabet', 'Learn to Count', 'Learn to Count']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '272270', 'Media Format': 'Multiple Formats, Color, Animated, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 1, 2019', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nBoring.\nDull\nAmerican Girl: Grace Stirs Up Success\nOlivia Rodrigo  (Actor),     Eloise Webb  (Actor),     Vince Marcello  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Grace has a real talent for baking and a passion for making delicious dreams come true. When her mom announces a trip to visit relatives in Paris, Grace isn't so sure about leaving her friends and their cupcake business. That is, until she discovers she'll get to work with her uncle and cousin in a real French pastry shop! But nothing goes as planned and her attempts to help out end in disaster. With some help from her family and a pup named Bonbon, she turns her vacation around. But when Grace returns home, she discovers her grandparents' bakery is in trouble! With their dreams on the line, can Grace find the winning recipe for success?\", 'Bonus Content:', 'Masterchef Junior', 'Masterchef Junior', 'Doggie Day Spa', 'Doggie Day Spa', 'Playing Dress Up', 'Playing Dress Up', ']]>']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '33679142', 'Director': 'Vince Marcello', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'June 23, 2015', 'Actors': 'Olivia Rodrigo, Eloise Webb, Caitlin Carmichael, Notlim Taylor, Joe Bastianich', 'Subtitles': 'Spanish', 'Producers': 'Debra Martin Chase, Jean A. McKenzie', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Studio Distribution Services', 'Writers': \"Jessica O'Toole, Amy Rardin\", 'Number of discs': '1'}\nVery well done.\nAmerican Girl\nThe One I Love\nElisabeth Moss  (Actor),     Mark Duplass  (Actor),     Charlie McDowell  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Ted Danson, Charlie McDowell, Mark Duplass, Elisabeth Moss, Mel Eslyn', 'Language': 'English', 'Runtime': '1 hour and 31 minutes'}\nI love this movie and was shocked I didn't hear about it. I love the concept the acting and last but not least the house!!!! The guest house is my dream house.\nLove it!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Victor Levin'], 'Producers': ['Julie Lynn', 'Bonnie Curtis'], 'Starring': ['Anton Yelchin', 'Berenice Marlohe', 'Olivia Thirlby']}\nLovely movie.\nFour Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Milton Katselas'], 'Producers': ['M.J. Frankovich', 'Mike Frankovich'], 'Starring': ['Liv Ullmann', 'Edward Albert', 'Gene Kelly'], 'Studio': ['Columbia Pictures']}\nA 40 year old who looks stunning falling in love with a stunning younger man without all the cheesy gross cougar stuff. No silly plot twist a true love story. 😍<br /><br />Happily married to an slightly older man (6 months) and I still loved this movie.\nClassic and classy.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Neil LaBute'], 'Producers': ['Gordon Bijelonic', 'Reggie Carter', 'Tim Chonacas', 'Michael Corrente', 'Forrest Crisman', 'Daryl Freimark', 'Tim Harms', 'Corey Large', 'Trent Othick'], 'Starring': ['Stanley Tucci', 'Alice Eve']}\nThis movie was recommended as a good love movie and that it is not. If you want a dramatic movie then yes, but heart felt no!\nDramatic not romantic.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Roland Emmerich'], 'Producers': ['Mark Gordon', 'Roland Emmerich'], 'Starring': ['Dennis Quaid', 'Jake Gyllenhaal', 'Ian Holm'], 'Studio': ['Fox/Buena Vista']}\nI just love this over the top scientifically silly movie. It's pretty great despite being inaccurate but that just adds to its greatness, and Jake Gyllenhaal is hog. My biggest regret ******Spoiler Alert*******<br />Why did the 3 super smart science guys not just start a fire to stay warm so they could live?\nWorth the watch.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mary Harron'], 'Producers': ['Edward R. Pressman', 'Chris Hanley', 'Christian Halsey Solomon'], 'Starring': ['Christian Bale', 'Willem Dafoe', 'Jared Leto']}\nDefinitely one of my favorite movies!\nLove this movie.\n{'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Reiner'], 'Producers': ['Rob Reiner', 'Andrew Scheinman'], 'Starring': ['Billy Crystal', 'Meg Ryan', 'Carrie Fisher'], 'Studio': ['WARNER BROS.']}\nHeartwarming and hold up over time.\nSweet love.",
  "profile": "**Updated User Profile Summary:**\n\n- **Preferred Genres:** The user enjoys documentaries and heartfelt romances, while increasingly delving into various genres. Their recent engagement with a nostalgic, emotionally resonant film highlights an appreciation for narratives that blend charm with enduring relevance.\n\n- **Expectations:** The user seeks authenticity and genuine representation but values entertainment and emotional connection. Their recent review showcases a deep appreciation for heartwarming stories that transcend time, emphasizing their desire for narratives that evoke strong feelings.\n\n- **Engagement Duration:** The user has a discerning taste yet displays growing flexibility in their viewing habits. They appreciate films with emotional resonance but are also drawn to content that delivers joy and escapism, reflecting a balance between critical insight and appreciation for feel-good storytelling.\n\n- **Rating Tendencies:** The user shows a keen ability to differentiate between entertainment value and authenticity. Their recent perfect rating reveals a capacity to fully enjoy films that embody warmth and charm, regardless of their alignment with realism.\n\n- **Content Appreciation:** The user values emotional narratives and authenticity while embracing escapist storytelling. Their engagement with heartwarming films reflects an evolving appreciation for diverse narratives, enhancing their selective yet broadened approach to film and media.\n\nOverall, the user continues to cherish authentic storytelling, reveling in the delight of varied narratives that evoke emotional responses and timeless enjoyment.",
  "metrics": {
    "rouge1_f": 0.08695652173913043,
    "rouge2_f": 0.005509641873278236,
    "rougeL_f": 0.04733076499724821,
    "meteor": 0.03317483805935596,
    "bleu1": 7.163862134091196e-05,
    "bleu2": 2.6855055214166724e-05,
    "bleu3": 3.7338331058144203e-06,
    "bleu4": 1.3935732938132902e-06,
    "bertscore_precision": 0.33791017532348633,
    "bertscore_recall": 0.4616689682006836,
    "bertscore_f1": 0.39021188020706177
  }
}