{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Peppa Pig: My Birthday Party\nReview Date: 2014/11/16\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Peppa is a lovable little piggy who lives with her younger brother George, Mummy Pig and Daddy Pig. Peppa loves playing games, dressing up, visiting exciting places and making new friends, but her absolute favorite thing is jumping up and down in muddy puddles!Bonus Content:', 'Disc 1 - Peppa Pig My Birthday Party:', 'Learn the Alphabet', 'Learn the Alphabet', 'Learn to Count', 'Learn to Count']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '272270', 'Media Format': 'Multiple Formats, Color, Animated, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 1, 2019', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Boring.\nReview Title: Dull\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Matthew Bonifacio'], 'Producers': ['Stephen Ashkinos', 'Matthew Bonifacio', 'Carmine Famiglietti'], 'Starring': ['Lou Martini Jr.', 'Susan Varon', 'Sharon Angela'], 'Studio': ['FilmBuff']}\nThis was listed as being a documentary and so I started it. It's clearly not, and from what I can tell (I only watched 20 minutes it's not that great of a movie.\nNot a Documentary\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Berlinger', 'Bruce Sinofsky'], 'Producers': ['Joe Berlinger', 'Bruce Sinofsky', 'IFC'], 'Starring': ['Delbert Ward', 'Roscoe Ward', 'Connie Chung']}\nI felt this was well done and true. No need to make a story this one tells itself in the footage alone and does a great job. I think it is easy to understand the peoples emotions in this movie and how they feel about the family.\nWell Done\n{'Subtitles': ['None available'], 'Directors': ['Richard Press'], 'Producers': ['Philip Gefter'], 'Starring': ['Bill Cunningham', 'Anna Wintour', 'Tom Wolfe'], 'Studio': ['Zeitgeist Films']}\nI love a good documentary about talented interesting people and this is one of them for sure. You really fall for Bill's simplicity and his talent. What a neat person.\nLove him~\nSurviving Progress\nMargaret Atwood  (Actor),     Colin Beavan  (Actor),     Mathieu Roy  (Director),     Harold Crooks  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Product Description', 'Technological advancement, economic development, population increase - are they signs of a thriving society? Or too much of a good thing? Based on the best-selling book a Short History of Progress, this provocative documentary explores the concept of progress in our modern world, guiding US through a sweeping but detailed survey of the major \"progress traps\" facing our civilization in the arenas of technology, economics, consumption, and the environment. Featuring powerful arguments from such visionaries as Jane Goodall, Margaret Atwood, Stephen Hawking, Craig Venter, Robert Wright, Michael Hudson, and Ronald Wright, this enlightening and visually spectacular film invites US to contemplate the progress traps that destroyed past civilizations and that lie treacherously embedded in our own. Leading critics of Wall Street, cognitive psychologists, and ecologists lay bare the consequences of progress-as-usual as the film travels around the world - from a burgeoning China to the disappearing rainforest\\'s of Brazil to a chimp research lab in New Iberia, Louisiana - to construct a shocking overview of the way our global economic system is eating away at our planet\\'s resources and shackling entire populations with poverty. Providing an honest look at the risks and pitfalls of running 21st Century \"software\" (our accumulated knowledge) on 50,000-year-old \"hardware\" (our primate brains), Surviving Progress offers a challenge: To prove making apes smarter was not an evolutionary dead end.', 'Review', \"MIND-EXPANDING... SUBVERSIVE... BRISTLING WITH PROVOCATIVE INSIGHTS. Both brainy and light on its feet, and with wide variety of involving visuals, this mind-expanding ecological documentary bristles with provocative insights and probing questions about humanity and the state of the world. --Kenneth Turan, LA TimesA who's-who of great thinkers are riveting as they walk us through the question of whether we will or can survive progress. --Ernest Hardy, Seattle WeeklyCRITIC'S CHOICE. EXCELLENT! Succinct and entertaining. Weaves together a vast assortment of materials as well as information, to highly watchable results. Do the earth a favor: see this movie, and drag a skeptic you know along. --Dennis Harvey, San Francisco Bay Guardian\"]\n{'Genre': 'Special Interests', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Gary Marcus, Daniel Povinelli, Mark Levine, Marina Silva, Kambale Musavuli, David Suzuki, Harold Crooks, Jim Thomas, Mathieu Roy, Michael Hudson, Victor Zhikai Gao, Vaclav Smil, Jane Goodall, Stephen Hawking, Robert Wright, Colin Beavan, Margaret Atwood, Simon JohnsonGary Marcus, Daniel Povinelli, Mark Levine, Marina Silva, Kambale Musavuli, David Suzuki, Harold Crooks, Jim Thomas, Mathieu Roy, Michael Hudson, Victor Zhikai Gao, Vaclav Smil, Jane Goodall, Stephen Hawking, Robert Wright, Colin Beavan, Margaret Atwood, Simon Jo…   See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25729809', 'Director': 'Mathieu Roy, Harold Crooks', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'September 25, 2012', 'Actors': 'Margaret Atwood, Colin Beavan, Jane Goodall, Stephen Hawking, Michael Hudson', 'Subtitles': 'English', 'Studio': 'First Run Features', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis one really gets you thinking and inspires change. With a great soundtrack to boot (Philip Glass like) Excellent ~\nExcellent ~\nPeppa Pig: My Birthday Party\nRated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Peppa is a lovable little piggy who lives with her younger brother George, Mummy Pig and Daddy Pig. Peppa loves playing games, dressing up, visiting exciting places and making new friends, but her absolute favorite thing is jumping up and down in muddy puddles!Bonus Content:', 'Disc 1 - Peppa Pig My Birthday Party:', 'Learn the Alphabet', 'Learn the Alphabet', 'Learn to Count', 'Learn to Count']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '272270', 'Media Format': 'Multiple Formats, Color, Animated, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 1, 2019', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nBoring.\nDull",
  "profile": "**Updated User Profile Summary:**\n\n- **Preferred Genres:** The user maintains a strong preference for documentaries that delve into the lives of compelling individuals through authentic narratives. Their recent interaction highlights a marked appreciation for intellectually stimulating content that challenges societal norms, despite a notable foray into children's media, which provided an uncharacteristic experience of disengagement.\n  \n- **Expectations:** Consistent with their critical viewpoint, the user continues to expect films and shows to reflect genuine representations, focusing on narratives that avoid sensationalism and prioritize thoughtful engagement.\n\n- **Engagement Duration:** The user's discerning nature is evident in their tendency to quickly disengage from content deemed subpar, as evidenced by their recent low rating for a less captivating viewing experience. However, they remain open to engaging deeply with well-crafted documentaries that genuinely captivate their interest.\n\n- **Rating Tendencies:** Their inclination toward high ratings persists, although the recent lower rating indicates a clear boundary for content quality. This reinforces their commitment to thoughtful evaluations and highlights their selective engagement with media.\n\n- **Content Appreciation:** The user values documentaries that resonate emotionally and provide nuanced insights into real-life issues. They particularly seek content that provokes reflection and encourages societal change, reaffirming their profile as a discerning and engaged viewer. \n\nOverall, the summary showcases a user committed to authenticity and depth in their media consumption, while also indicating a recent deviation that brought forth a critical assessment of less impactful content.",
  "metrics": {
    "rouge1_f": 0.13708260105448156,
    "rouge2_f": 0.0017605633802816902,
    "rougeL_f": 0.06678383128295255,
    "meteor": 0.04969199178644765,
    "bleu1": 0.008156298639230532,
    "bleu2": 0.0008759797750839861,
    "bleu3": 0.00019349507073096142,
    "bleu4": 9.102083082871276e-05,
    "bertscore_precision": 0.3464891314506531,
    "bertscore_recall": 0.44462844729423523,
    "bertscore_f1": 0.3894716203212738
  }
}