{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bishop's Wife, The (BD)\nReview Date: 2017/07/11\nStore: Cary Grant  (Actor),     Loretta Young  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Bishop's Wife, The (BD)\", 'Heavenly bells are ringing, jubilant choirs are singing, and Christmas joy is blanketing the world like freshly fallen snow. But the Yuletide spirit has yet to warm Bishop Henry Brougham’s Victorian home. Struggling to raise funds for a new cathedral, the preoccupied young clergyman has neglected his loving wife, Julia, and now only divine intervention can save their marriage! But the powerful and handsome angel sent from above has a mind of his own…and teaching mortal Henry an immortal lesson in romance isn’t all he has planned! Starring Oscar® winners Cary Grant, Loretta Young and David Niven*, and featuring “a stellar supporting cast” (The Hollywood Reporter), which includes James Gleason and Monty Woolley, this delightful romantic comedy is wondrous, witty and truly divine!', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Cary Grant, Henry Koster, David Niven, Loretta Young', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000360166BR', 'Director': 'Henry Koster', 'Media Format': 'NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Cary Grant, Loretta Young, David Niven', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Wish they made more movies like this.  Its nice to have movies you dont have to be afraid to let your kids watch.  Refreshing, funny and just a good overall movie.\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Lord of the Rings: The Motion Picture Trilogy (The Fellowship of the Ring / The Two Towers / The Return of the King Extended Editions)\nElijah Wood  (Actor),     Viggo Mortensen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', 'The Quest Is Over: All three extended versions in dazzling 1080p and DTS HD-MA 5.1 Audio. Deluxe set includes over 26 Hours of spellbinding behind-the- moviemaking material, including the Rare Costa Botes documentaries, on 15 discs.', 'The Lord of the Rings: The Fellowship of the Ring Extended Edition', ': With the help of a courageous fellowship of friends and allies, Frodo embarks on a perilous mission to destroy the legendary One Ring.', 'The Lord of the Rings: The Two Towers Extended Edition', ': In the middle chapter of this historic movie trilogy, the Fellowship is broken but its quest to destroy the One Ring continues.', 'The Lord of the Rings: The Return of the King Extended Edition', ': The final battle for Middle-earth begins. Frodo and Sam, led by Gollum, continue their dangerous mission toward the fires of Mount Doom in order to destroy the One Ring.', 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Versions of', 'Lord of the Rings: The Motion Picture Trilogy', 'on Blu-ray and DVD', 'Original Theatrical Edition', 'Platinum Series Special Extended Edition', 'Original Theatrical and Extended Limited Edition', 'Original Theatrical Edition [Blu-ray]', 'Extended Edition [Blu-ray]', 'Release Date', 'May 25, 2004 Dec. 14, 2004 Aug. 29, 2006 Apr. 16, 2010 TBA', 'Format/Disc #', 'Three DVDs 12 DVDs Six DVDs Three Blu-ray Discs, Three DVDs, Three Digital Copies 15 Discs Total: Films are on Blu-ray, with Special Features on DVDs', 'Digital Copies', 'No No No Yes, on three discs (expired Apr. 4, 2011) Yes, online (expires Jun. 26, 2012)', 'Extra footage', 'None 30 minutes added to', 'Return of the King', '; 43 minutes added to', 'The Two Towers', '; 50 minutes added to', 'Return of the King', 'For all three films: Both the theatrical and extended edition on one disc None Same as extended-edition DVD', 'Commentaries', 'None Commentary by Peter Jackson, Fran Walsh, and Philippa Boyens; Commentary by the design team; Commentary by the production/post-production team; Commentary by the cast, including Elijah Wood, Ian McKellen, Sean Astin, Andy Serkis, John Rhys-Davies, Orlando Bloom, Christopher Lee, and Miranda Otto None None Same commentaries as extended-edition DVD', 'Documentaries', 'Fellowship of the Ring', ': \"Welcome to Middle-earth,\" \"The Quest for the Ring,\" \"A Passage to Middle-earth\";', 'The Two Towers', ': \"On the Set: The Lord of the Rings: The Two Towers\"; \"Return to Middle- earth\"', 'Return of the King', ': Three documentaries: \"The Quest Fulfilled: A Director\\'s Vision,\" \"A Filmmaker\\'s Journey: Making The Return of The King,\" \"National Geographic Special: Beyond the Movie\" \"From Book to Vision,\" \"From Vision to Reality,\" \"The Journey Continues...,\" Documentaries on J.R.R. Tolkein, \"From Book to Script\" documentaries, \"Designing and Building Middle-earth,\" \"Home of the Horse Lords,\" \"Gollum,\" \"Filming \\'The Two Towers,\\'\" \"Visual Effects,\" \"Editorial: Refining the Story,\" \"Music and Sound,\" \"The Battle for Helm\\'s Deep is Over...\"; \"Filming The Return of the King,\" \"Weta Digital,\" \"Post-Production: Journey\\'s End,\" \"The Passing of an Age,\" \"Cameron Duncan: The Inspiration for \\'Into the West\\'\" Three behind-the-scenes documentaries by Costa Botes, the filmmaker director Peter Jackson personally hired Same as theatrical-edition DVD Same as extended-edition DVD, plus Costa Botes documentaries from the Original Theatrical & Extended Limited Edition', 'Featurettes', 'Fellowship of the Ring', ': 15 featurettes originally created for lordoftherings.net;', 'The Two Towers', ': Eight featurettes originally created for lordoftherings.net;', 'Return of the King', ': Six featurettes None None Same as theatrical-edition DVD None', 'Other Features', 'Exclusive 10-minute behind-the-scenes previews of', 'The Two Towers', 'and', 'The Fellowship of the Ring', '; Enya \"May It Be\" music video; An inside look at the Special Extended DVD Edition of', 'The Lord of the Rings Trilogy', '; Preview of Electronic Arts\\' video games; DVD-ROM features: Exclusive online content; Emiliana Torrini \"Gollum Song\" music video; \"The Long and Short of It,\" a short film by Sean Astin; \"The Lord of The Rings\" Trilogy Supertrailer Design Galleries; \"Middle-earth Atlas: Tracing the Journeys of the Fellowship\" interactive map; \"New Zealand as Middle-earth\" interactive map w/on-location footage; production photos; \"The Mumakil Battle\" demonstration / multi-angle interactive feature; \"DFK6498\" short film, \"Strike Zone\" short film, DVD-ROM access to exclusive online features None Same as theatrical-edition DVD Same as extended edition DVDs; see above for complete special features']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 6 x 2.25 inches; 1.84 Pounds', 'Director': 'Peter Jackson', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 22 minutes', 'Release date': 'June 28, 2011', 'Actors': 'Elijah Wood, Viggo Mortensen, Ian McKellen', 'Subtitles': 'French, English', 'Studio': 'New Line Home Video', 'Number of discs': '15'}\nI love the extended blu ray version of the lotr. Its worth the money and I havent even watched it all yet.  I love it!!!!!!\nExcellent\nDark Shadows DVD Collection 9\nJonathan Frid  (Actor),     Grayson Hall  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['With its alluring tales of gothic mystery and supernatural intrigue, Dark Shadows became the most popular daytime series of all time during its run on ABC from 1966-71. Muck like the show\\x92s character Barnabas Collins, a guilt-ridden vampire released from his chained coffin after nearly 200 years, Dark Shadows retains an immortality that time steadfastly fails to erode.']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Box set, Color, DVD, NTSC', 'Contributor': 'David Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John KarlenDavid Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John Karlen  See more', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1.75 inches; 8.47 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '14 hours', 'Release date': 'November 25, 2003', 'Actors': 'Jonathan Frid, Grayson Hall, Nancy Barrett, Joan Bennett, Alexandra Isles', 'Studio': 'Mpi Home Video', 'Writers': 'Dan Curtis', 'Number of discs': '4'}\nDark Shadows.......classic .....awesome....what more can I say??  Its just a fun, clean series that is great for everyone to watch.  I love it, always have!\nAwesome\nThe Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\n{'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nI love all of the extended LOTR movies, and now the extended Hobbit movie.  It does not disappoint. I especially love the beginning with Frodo and the older Bilbo.  Fantastic scenery, costumes and graphics.\nExcellent Movie\nArsenic and Old Lace\nCary Grant  (Actor),     Raymond Massey  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Arsenic and Old Lace (DVD) (Rpkg)', \"Cary Grant stars as the one sane member of a charmingly lunatic family in director Frank Capra's classic comedy. When Mortimer Brewster (Grant) brings his new bride to meet his two kindly aunts, he discovers that, among many other acts of charity, the two genteel ladies help lonely old men die happy ... by feeding them a wonderful meal before poisoning them. Now, Mortimer desperately wants to protect the two serial murderers he loves, stop them from killing anyone else and keep his bride from discovering how deranged his family really is.\", ']]>']\n{'Genre': 'Comedy, Mystery & Suspense', 'Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': 'Raymond Massey, Frank Capra, Cary Grant', 'Language': 'Unqualified (DTS ES 6.1), English (Mono)', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '163719', 'Director': 'Frank Capra', 'Media Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 54 minutes', 'Release date': 'November 9, 2010', 'Actors': 'Cary Grant, Raymond Massey', 'Subtitles': 'French, English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nI love this movie. It a fun clean movie for the whole family. The expressions on Cary Grants face are hilarious.  Wish they would make more movies like this one!\nGreat Classic Movie\nBishop's Wife, The (BD)\nCary Grant  (Actor),     Loretta Young  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Bishop's Wife, The (BD)\", 'Heavenly bells are ringing, jubilant choirs are singing, and Christmas joy is blanketing the world like freshly fallen snow. But the Yuletide spirit has yet to warm Bishop Henry Brougham’s Victorian home. Struggling to raise funds for a new cathedral, the preoccupied young clergyman has neglected his loving wife, Julia, and now only divine intervention can save their marriage! But the powerful and handsome angel sent from above has a mind of his own…and teaching mortal Henry an immortal lesson in romance isn’t all he has planned! Starring Oscar® winners Cary Grant, Loretta Young and David Niven*, and featuring “a stellar supporting cast” (The Hollywood Reporter), which includes James Gleason and Monty Woolley, this delightful romantic comedy is wondrous, witty and truly divine!', ']]>']\n{'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Cary Grant, Henry Koster, David Niven, Loretta Young', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000360166BR', 'Director': 'Henry Koster', 'Media Format': 'NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Cary Grant, Loretta Young, David Niven', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nWish they made more movies like this.  Its nice to have movies you dont have to be afraid to let your kids watch.  Refreshing, funny and just a good overall movie.\nGreat Movie",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user continues to cherish fantasy films and series, particularly epic trilogies, along with classic comedies that intertwine gothic mystery and supernatural elements. Their recent engagement with a charming romantic comedy highlights their enjoyment of uplifting narratives suitable for family viewing.\n\n- **Media Consumption**: They maintain a strong preference for intricate storytelling and character development across various genres, reinforcing their appreciation for timeless and wholesome cinematic experiences. \n\n- **Format Preference**: The user favors high-quality formats like Blu-ray, indicating a commitment to optimal viewing experiences, especially for classic films that offer rich narratives and nostalgic charm.\n\n- **Rating Trend**: They consistently provide high ratings, showcasing a discerning taste for quality media. Their enthusiasm extends to classic and family-friendly films, indicating an appreciation for narratives that resonate positively with all audiences.\n\n- **Engagement**: The user expresses excitement for beloved franchises and classic series, highlighting a deep connection to the artistry of film and the joy it can bring to viewers of all ages.\n\n- **Collecting Behavior**: They continue to invest in comprehensive collections and special releases, actively seeking media that enhances their enjoyment of cherished films and promotes memorable family moments.\n\nIn summary, this user is a dedicated fan of fantasy, supernatural, and classic comedy genres, valuing cinematic experiences that blend rich narratives with high-quality formats and family-friendly content.",
  "metrics": {
    "rouge1_f": 0.08742075408742075,
    "rouge2_f": 0.008013355592654424,
    "rougeL_f": 0.044044044044044044,
    "meteor": 0.0237902993252206,
    "bleu1": 1.489224337054004e-06,
    "bleu2": 5.703509420981824e-07,
    "bleu3": 1.9580094193410925e-07,
    "bleu4": 9.655723953249689e-08,
    "bertscore_precision": 0.36103686690330505,
    "bertscore_recall": 0.5178436636924744,
    "bertscore_f1": 0.4254518151283264
  }
}