{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Calily Genuine Handcrafted Sandalwood Comb for Men – Pocket Size Mustache and Beard Comb with Premium Synthetic Leather Case / Ultra-Smooth Combing; No Static or Snagging\nReview Date: 2016/08/05\nStore: Calily\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Calily', 'Hair Type': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.6 x 3.1 x 0.6 inches; 2.4 Ounces', 'UPC': '821079365117'}\nReview Text: If you’re looking for a compact, yet very stylish comb that can be used on your beard, mustache, and even hair, look no further than this handcrafted sandalwood comb by Calily. The comb itself is just over 3 inches, meaning it fits perfectly in any pocket, bag, glove compartment of a car, etc. If you are always on the run like I am, having a useful and reliable comb is key in making sure you look your best! I usually slick back my hair, and on especially hot days, it can come undone, leading to a rather homely look. Now the only thing I have to do is take the comb out of my pocket and I’m good to go! Although my beard isn’t anywhere near as long as I’d like it, It also works well there.<br /><br />The comb itself features a nice sandalwood scent that is both refreshing and calming. The wood on the comb feels very sturdy, and the teeth on the comb feel as if they will not break easily, like plastic combs do. The comb also comes with a very nice carrying case.<br /><br />Overall, if you need a reliable, stylish, and VERY compact comb, I would absolutely recommend this comb by Calily.<br /><br />I was sent this product for free in order to evaluate and leave my honest feedback.\nReview Title: The perfect comb for anybody who is always on the go!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Calily Genuine Handcrafted Sandalwood Comb for Men – Pocket Size Mustache and Beard Comb with Premium Synthetic Leather Case / Ultra-Smooth Combing; No Static or Snagging\nCalily\n{'Brand': 'Calily', 'Hair Type': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.6 x 3.1 x 0.6 inches; 2.4 Ounces', 'UPC': '821079365117'}\nIf you’re looking for a compact, yet very stylish comb that can be used on your beard, mustache, and even hair, look no further than this handcrafted sandalwood comb by Calily. The comb itself is just over 3 inches, meaning it fits perfectly in any pocket, bag, glove compartment of a car, etc. If you are always on the run like I am, having a useful and reliable comb is key in making sure you look your best! I usually slick back my hair, and on especially hot days, it can come undone, leading to a rather homely look. Now the only thing I have to do is take the comb out of my pocket and I’m good to go! Although my beard isn’t anywhere near as long as I’d like it, It also works well there.<br /><br />The comb itself features a nice sandalwood scent that is both refreshing and calming. The wood on the comb feels very sturdy, and the teeth on the comb feel as if they will not break easily, like plastic combs do. The comb also comes with a very nice carrying case.<br /><br />Overall, if you need a reliable, stylish, and VERY compact comb, I would absolutely recommend this comb by Calily.<br /><br />I was sent this product for free in order to evaluate and leave my honest feedback.\nThe perfect comb for anybody who is always on the go!",
  "profile": "**User Profile Summary:**\n\n- **Convenience**: Prefers compact, portable grooming tools that fit easily into pockets or bags, indicating a busy lifestyle.\n- **Functionality**: Values multifunctional products that can serve various purposes, such as grooming beard, mustache, and hair.\n- **Quality**: Appreciates well-crafted, durable items with a premium feel, favoring materials like sandalwood over plastic.\n- **Aesthetic Appeal**: Shows interest in stylish designs and products that reflect personal style, indicated by the emphasis on the comb's appearance.\n- **Sensory Experience**: Enjoys products with pleasant attributes, such as the calming scent of sandalwood, highlighting the significance of sensory elements in product preference.\n- **Reliability**: Seeks dependable grooming solutions to maintain appearance throughout the day, especially under varying conditions like heat.\n- **Positive Feedback**: Tends to give high ratings for satisfactory products, emphasizing enthusiasm and support for quality items.\n\nOverall, the user demonstrates a preference for high-quality, stylish, and practical grooming products that enhance everyday convenience and reliability.",
  "metrics": {
    "rouge1_f": 0.2749445676274944,
    "rouge2_f": 0.035634743875278395,
    "rougeL_f": 0.12416851441241686,
    "meteor": 0.1335559265442404,
    "bleu1": 0.17917830309223048,
    "bleu2": 0.07239455661024426,
    "bleu3": 0.041423579987160175,
    "bleu4": 0.02637925249688703,
    "bertscore_precision": 0.42200732231140137,
    "bertscore_recall": 0.48189303278923035,
    "bertscore_f1": 0.4499663710594177
  }
}