{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Webat Bath Bombs Gift Set, Spa Bomb Fizzies & Ultra Lush Essential Oil - Dry Skin Moisturize, Fit for Bubble & Spa Bath, Handmade Birthday Gift Ideal for Lady, Women, Girlfriend, Men\nReview Date: 2016/08/15\nStore: Webat\nProduct Description: [\"Product Specification: 1. Quantity: 6* 2.5 oz 2. Set Size: 6.3 * 4.3 * 2 inch 3. Total Weight: 14.5 oz 4. Ingredients: Baking soda, citric acid, cellulose, sodium sulfate 5. Flavor: Purple-lavender, Blue-ocean, Red-rose, Pink-vanilla, Green-green Tea, Yellow-lemon ★Best Gift Set for All Individually wrapped and gift set, perfect for birthdays, Christmas gift, anniversaries, parties and wedding favours. It is a best gift set for lover, friend, lady, women, men and so on. ★Healthy Spa at Home Bath bombs features exfoliating, fine pores, anti-fatigue, bactericidal and itching functions. Fit for detoxifying minerals and moisturizers skin, it relaxs your body and relieves fatigue to get a deep sleep after the whole day's work. A enjoyable spa aromatherapy at your home. ★Note: For external use only. Keep out of eyes. If irritation occurs, stop to use immediately and consult with your doctor. ★Package included: 1* bath bombs set（6* bath bombs)\"]\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Webat', 'Scent': 'Lavender, Vanilla, Rose, Lemon', 'Age Range (Description)': 'Adult', 'Product Benefits': 'Moisturizing,Relaxing,Aromatherapy,Moisturize', 'Material Feature': 'No artificial flavors', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.52 x 5.2 x 2.8 inches; 1.85 Pounds', 'UPC': '600736170253', 'Manufacturer': 'Webat'}\nReview Text: It can be argued that taking a bath is one of the most relaxing experiences there is! Now add these bath bombs by Calily to the mix, and you have an even more enjoyable experience!<br /><br />This set comes with 6 bath bombs; Garden of Heaven, Yoga Strength, Revive, Vanilla Indulgence, Stress relief, and Energy Grapefruit.<br /><br />The bath bombs all come individually wrapped, in a very nice gift box. This means that they would be an excellent present for any lady in your life. Once you add them to the water, the immediately begin to fizz and turn your water a color (does not stain your skin). They all smell beautiful. My personal favorite is the Vanilla Indulgence scent!<br /><br />If you’re looking for a gift for a special lady (I suppose guys can use them as well!) in your life, or looking for a way to take your relaxation to the next level, I would totally recommend trying out these bath bombs by Calily!<br /><br />I received these bath bombs for free in order to test and leave my honest feedback.\nReview Title: The ultimate bath time experience!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Calily Genuine Handcrafted Sandalwood Comb for Men – Pocket Size Mustache and Beard Comb with Premium Synthetic Leather Case / Ultra-Smooth Combing; No Static or Snagging\nCalily\n{'Brand': 'Calily', 'Hair Type': 'All', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.6 x 3.1 x 0.6 inches; 2.4 Ounces', 'UPC': '821079365117'}\nIf you’re looking for a compact, yet very stylish comb that can be used on your beard, mustache, and even hair, look no further than this handcrafted sandalwood comb by Calily. The comb itself is just over 3 inches, meaning it fits perfectly in any pocket, bag, glove compartment of a car, etc. If you are always on the run like I am, having a useful and reliable comb is key in making sure you look your best! I usually slick back my hair, and on especially hot days, it can come undone, leading to a rather homely look. Now the only thing I have to do is take the comb out of my pocket and I’m good to go! Although my beard isn’t anywhere near as long as I’d like it, It also works well there.<br /><br />The comb itself features a nice sandalwood scent that is both refreshing and calming. The wood on the comb feels very sturdy, and the teeth on the comb feel as if they will not break easily, like plastic combs do. The comb also comes with a very nice carrying case.<br /><br />Overall, if you need a reliable, stylish, and VERY compact comb, I would absolutely recommend this comb by Calily.<br /><br />I was sent this product for free in order to evaluate and leave my honest feedback.\nThe perfect comb for anybody who is always on the go!\nWebat Bath Bombs Gift Set, Spa Bomb Fizzies & Ultra Lush Essential Oil - Dry Skin Moisturize, Fit for Bubble & Spa Bath, Handmade Birthday Gift Ideal for Lady, Women, Girlfriend, Men\nWebat\n[\"Product Specification: 1. Quantity: 6* 2.5 oz 2. Set Size: 6.3 * 4.3 * 2 inch 3. Total Weight: 14.5 oz 4. Ingredients: Baking soda, citric acid, cellulose, sodium sulfate 5. Flavor: Purple-lavender, Blue-ocean, Red-rose, Pink-vanilla, Green-green Tea, Yellow-lemon ★Best Gift Set for All Individually wrapped and gift set, perfect for birthdays, Christmas gift, anniversaries, parties and wedding favours. It is a best gift set for lover, friend, lady, women, men and so on. ★Healthy Spa at Home Bath bombs features exfoliating, fine pores, anti-fatigue, bactericidal and itching functions. Fit for detoxifying minerals and moisturizers skin, it relaxs your body and relieves fatigue to get a deep sleep after the whole day's work. A enjoyable spa aromatherapy at your home. ★Note: For external use only. Keep out of eyes. If irritation occurs, stop to use immediately and consult with your doctor. ★Package included: 1* bath bombs set（6* bath bombs)\"]\n{'Brand': 'Webat', 'Scent': 'Lavender, Vanilla, Rose, Lemon', 'Age Range (Description)': 'Adult', 'Product Benefits': 'Moisturizing,Relaxing,Aromatherapy,Moisturize', 'Material Feature': 'No artificial flavors', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.52 x 5.2 x 2.8 inches; 1.85 Pounds', 'UPC': '600736170253', 'Manufacturer': 'Webat'}\nIt can be argued that taking a bath is one of the most relaxing experiences there is! Now add these bath bombs by Calily to the mix, and you have an even more enjoyable experience!<br /><br />This set comes with 6 bath bombs; Garden of Heaven, Yoga Strength, Revive, Vanilla Indulgence, Stress relief, and Energy Grapefruit.<br /><br />The bath bombs all come individually wrapped, in a very nice gift box. This means that they would be an excellent present for any lady in your life. Once you add them to the water, the immediately begin to fizz and turn your water a color (does not stain your skin). They all smell beautiful. My personal favorite is the Vanilla Indulgence scent!<br /><br />If you’re looking for a gift for a special lady (I suppose guys can use them as well!) in your life, or looking for a way to take your relaxation to the next level, I would totally recommend trying out these bath bombs by Calily!<br /><br />I received these bath bombs for free in order to test and leave my honest feedback.\nThe ultimate bath time experience!",
  "profile": "**Updated User Profile Summary:**\n\n- **Convenience**: Prefers compact, portable grooming tools that fit easily into pockets or bags, indicating a busy lifestyle.\n- **Functionality**: Values multifunctional products that serve various grooming purposes, such as beard, mustache, and hair care.\n- **Quality**: Appreciates well-crafted, durable items with a premium feel, favoring materials like sandalwood over plastic.\n- **Aesthetic Appeal**: Shows interest in stylish designs and products that reflect personal style, emphasizing the appearance of grooming tools.\n- **Sensory Experience**: Enjoys products with pleasant attributes, such as calming scents, underlining the importance of sensory elements in product preference.\n- **Self-Care Appreciation**: Demonstrates an interest in luxurious self-care products, indicating a desire for relaxation and pampering experiences at home.\n- **Reliability**: Seeks dependable grooming solutions that maintain appearance throughout the day, particularly under varying conditions like heat.\n- **Positive Feedback**: Tends to give high ratings for satisfactory products, emphasizing enthusiasm and support for quality items, including gifts for others.\n\nOverall, the user exhibits a preference for high-quality, stylish, and practical grooming and self-care products that enhance everyday convenience and reliability, alongside a growing interest in luxurious bath experiences for relaxation.",
  "metrics": {
    "rouge1_f": 0.17763157894736842,
    "rouge2_f": 0.015384615384615384,
    "rougeL_f": 0.08771929824561403,
    "meteor": 0.07692769298949935,
    "bleu1": 0.028298490497462456,
    "bleu2": 0.009631130164305586,
    "bleu3": 0.005028908033330422,
    "bleu4": 0.0032013489568081073,
    "bertscore_precision": 0.3802441954612732,
    "bertscore_recall": 0.48358750343322754,
    "bertscore_f1": 0.42573419213294983
  }
}