{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Dish\nReview Date: 2015/12/22\nStore: Rob Sitch  (Director),     Sam Neill  (Actor),     Kevin Harrington  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['It\\'s the biggest event since sheep invented wool! Apollo 11\\'s astronauts will walk on the moon -- and the 1,000-ton satellite dish in tiny, sheep-farming Parkes, Australia, will beam that historic first step around the globe. But as giddy citizens prepare for the moment when the entire world will depend on them, the dish flatlines. And its unconventional Aussie crew and its by-the-book NASA supervisor from the U.S. have very different ideas about how to fix it. A culture clash of cosmic proportions erupts in this fact-based tale of how the biggest televised event in history was almost not televised. The Dish, with Sam Neill (Jurassic Park), Patrick Warburton (Seinfeld) and others in a skilled ensemble portraying a spirited array of techies and townies, \"will send you to the moon and back laughing\" (Bruce Kirkland, Toronto Sun).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Patrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John McmartinPatrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John Mcmartin  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': 'WARA667702DVD', 'Director': 'Rob Sitch', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 6, 2012', 'Actors': 'Sam Neill, Kevin Harrington, Tom Long, Patrick Warburton, Genevieve Mooy', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have loved this movie since my first viewing in a theater.  Based on the true story of how the television signal made it from the moon to all those TV sets worldwide back in July 1969 -- thanks to a wonderful facility in Parkes, Australia.  Get ready to enjoy a story where the geeks are also the heroes!\nReview Title: Excellent Apollo 11 story from a different viewpoint\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Standeven'], 'Producers': ['Gub Neal'], 'Starring': ['Robbie Coltrane', 'Ricky Tomlinson', 'Dennis Philby'], 'Studio': ['Acorn Media']}\nRight in line with others in this series.  Great writing and great acting.  A vintage retrospective look at British Hong Kong at the time of the handover to China also.\nCrime in Hong Kong\n{'Subtitles': ['None available'], 'Directors': ['Antonia Bird'], 'Producers': ['ITV'], 'Starring': ['Robbie Coltrane', 'Barbara Flynn', 'Geraldine Somerville'], 'Studio': ['Acorn TV']}\nThis story is that of a British vet with 3 tours in Ulster under its belt.  He has lost mates and is suffering from PTSD.  The anti-American comments and moments are from his point of view.  As Fitz says, understandable but not justified.  I find the other reviewers a bit thin skinned.  If they had complained about the believability of the vet going off the rails, that would have been more valid in my opinion.\nNot that bloody awful if you watch the whole thing\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Carson', 'Michael Grossman', 'Michael Robison', 'Jim Contner'], 'Producers': ['David Simkins', 'Robert Hewitt Wolfe', 'Nicolas Cage'], 'Starring': ['Paul Blackthorne', 'Valerie Cruz', 'Terrence Mann'], 'Studio': ['Lionsgate']}\nIf you read and loved the books, you are likely to be disappointed.  But if you view this series with fresh eyes and without preconceptions, it's quite good.  Settle back and enjoy!\nTake it as a fresh look\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Reed', 'Marc Jobst', 'Sarah Harding'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Kate McKerrell', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nIf you liked Morse and Lewis, you will like Lewis and Hathaway.  Lewis has grown since his time with Morse and following the death of his wife.  Hathaway as the erstwhile Cambridge theologian is a wonderful foil to Lewis.  Enjoy!\nMurders in Oxford---or Shades of Morse\nDr.Who Xmas Specials (Giftset/BD)\nVarious  (Actor, Director)    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['AMAZON EXCLUSIVE GIFTSET WITH BLUETOOTH SPEAKER:', 'Doctor Who: Christmas Specials Giftset with TARDIS Speakers [Blu-ray]', 'For the first time on one complete set, own every Christmas special from the new generation of Doctor Who. David Tennant, Matt Smith and Peter Capaldi all take starring turns in eleven exhilarating Christmas specials that set the Doctor rushing to save the world from an array of dastardly foes including the Master, the Cybermen and even Santa Clause himself.', 'Set includes the following:', '11 Doctor Who Christmas Specials', '(3 discs):', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE CHRISTMAS INVASION', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE RUNAWAY BRIDE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 VOYAGE OF THE DAMNED', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE NEXT DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART ONE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE END OF TIME, PART TWO', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 A CHRISTMAS CAROL', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE DOCTOR, THE WIDOW, AND THE WARDROBE', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE SNOWMEN', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 THE TIME OF THE DOCTOR', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 LAST CHRISTMAS', 'TARDIS Bluetooth Speaker', \"This Doctor Who TARDIS Wireless Bluetooth Speaker will seamlessly pair with most any Bluetooth device. It features meticulous craftsmanship and incredible sound quality, making it highly desirable to collectors and audiophiles alike. The easy-to-use interface allows for an array of control options, while LED indicators let you know when you power the device on and when you're connected.\", 'Features:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Sound clips include Materialize, Dematerialize, Cloister Bell, Flight, and Turbulence!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Top LED flashes and the Police Box sign illuminates! Perfect for Doctor Who collectors and audiophiles alike. Wireless Doctor Who speakers!', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Made of super-rigid ABS', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 The Police Box sign illuminates when connected to a device.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Auxiliary In/Out for linking multiple models together for surround sound', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Built-in omnidirectional microphone for phone calls with noise cancellation', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Multifunction interface for Volume / Play / Pause / >> /', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery indicator display / voice battery low indicator', 'Specifications:', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 3 1/2-foot 3.5 mm auxiliary cable and 3-foot micro USB charging cable included', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Connectivity: wireless Bluetooth or 3.5 mm auxiliary', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Wireless range: 33 feet / 10 meters', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Battery: 10-hour life via rechargeable lithium-ion', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Speakers: 2-inch high-power and 2 1/2-inch passive bass radiator', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 USB-rechargeable lithium-ion battery', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 TARDIS measures about 8 1/2-inches tall x 4 2/5-inches wide x 4 2/5-inches long.', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 For ages 6 and up.']\n{'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.1 Pounds', 'Item model number': '43382038', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Run time': '9 hours', 'Release date': 'November 24, 2015', 'Actors': 'Various', 'Studio': 'BBC', 'Number of discs': '3'}\nI love the Tardis speaker.  It charges quickly with the USB cable.  The instructions say it should be able to hook up with your computer if attached by the USB cable, but I have only been able to get it to connect to my aging 2008 MacBook Pro by using the Bluetooth connection.  It pairs excellently with my iPhone and iPad also.  A total treat for this Whovian.<br /><br />In a comment to another post I listed all the episodes included in the three disk set, and I am repeating this info below as it is not included in the item information by Amazon.  I am giving this only 4 stars because the DVD set arrived with the middle piece to one of the DVD holders half broken, making it impossible to securely stow one of them when not in use.  All three DVD's were loose in the case on arrival but fortunately not scratched and all played well.<br /><br />Tenth Doctor David Tennant specials---<br />The Christmas Invasion<br />The Runaway Bride<br />Voyage of the Damned<br />The Next Doctor<br />The End Of Time, Part One<br />The End Of Time, Part Two<br /><br />Eleventh Doctor Matt Smith specials--<br />A Christmas Carol<br />The Doctor, the Widow and the Wardrobe<br />The Snowmen<br />The Time of the Doctor<br /><br />Twelfth Doctor Peter Capaldi special--<br />Last Christmas<br /><br />There is also a bonus feature called Ten Christmases:  &#34;in this exclusive new feature Rufus Hound is on a mission to discover what makes a Doctor Who Christmas Special so special!&#34;\nSuper gift for your favorite Whovian\nThe Dish\nRob Sitch  (Director),     Sam Neill  (Actor),     Kevin Harrington  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['It\\'s the biggest event since sheep invented wool! Apollo 11\\'s astronauts will walk on the moon -- and the 1,000-ton satellite dish in tiny, sheep-farming Parkes, Australia, will beam that historic first step around the globe. But as giddy citizens prepare for the moment when the entire world will depend on them, the dish flatlines. And its unconventional Aussie crew and its by-the-book NASA supervisor from the U.S. have very different ideas about how to fix it. A culture clash of cosmic proportions erupts in this fact-based tale of how the biggest televised event in history was almost not televised. The Dish, with Sam Neill (Jurassic Park), Patrick Warburton (Seinfeld) and others in a skilled ensemble portraying a spirited array of techies and townies, \"will send you to the moon and back laughing\" (Bruce Kirkland, Toronto Sun).']\n{'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Patrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John McmartinPatrick Warburton, Rob Sitch, Genevieve Mooy, Lenka Kripac, Eliza Szonert, Sam Neill, Bille Brown, Matthew Moore, Andrew S. Gilbert, Roy Billing, Kevin Harrington, Tom Long, Tayler Kane, John Mcmartin  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': 'WARA667702DVD', 'Director': 'Rob Sitch', 'Media Format': 'NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'November 6, 2012', 'Actors': 'Sam Neill, Kevin Harrington, Tom Long, Patrick Warburton, Genevieve Mooy', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have loved this movie since my first viewing in a theater.  Based on the true story of how the television signal made it from the moon to all those TV sets worldwide back in July 1969 -- thanks to a wonderful facility in Parkes, Australia.  Get ready to enjoy a story where the geeks are also the heroes!\nExcellent Apollo 11 story from a different viewpoint",
  "profile": "**User Summary:**\n\n- **Content Preference:** The user continues to enjoy high-quality writing and strong acting in series and movies, particularly those with historical or cultural themes. There is a clear appreciation for comedic yet insightful narratives, especially those based on true stories. This interaction reflects their ongoing engagement with iconic films and a penchant for innovative storytelling that provides fresh perspectives.\n\n- **Geographic Interest:** Maintains a strong interest in British culture and narratives related to Hong Kong's history. The user also shows an interest in Australian culture through their recent purchase, highlighting a growing engagement with diverse cultural narratives.\n\n- **Rating Pattern:** With an average rating still around 4.4, the user has recently rated a comedy film 5.0, enthusiastically supporting well-crafted productions that resonate with them. Their willingness to express high praise signifies their nuanced understanding of quality storytelling.\n\n- **Language and Accessibility:** Prefers content in English with closed captions, showcasing a consistent emphasis on accessibility and comprehension in their viewing experience.\n\n- **Cultural Insight:** Appreciates in-depth analyses of historical events and cultural phenomena and remains open to various perspectives while maintaining critical discernment regarding storytelling integrity.\n\nOverall, the user gravitates toward diverse, well-crafted productions that combine entertaining storytelling with cultural or historical insights, reinforced by their ongoing passion for beloved narratives and their related themes.",
  "metrics": {
    "rouge1_f": 0.10284463894967179,
    "rouge2_f": 0.007667031763417306,
    "rougeL_f": 0.04814004376367615,
    "meteor": 0.03472322016189928,
    "bleu1": 0.0005395124915556593,
    "bleu2": 0.0001544369946092053,
    "bleu3": 2.3651132468735218e-05,
    "bleu4": 9.26433572165486e-06,
    "bertscore_precision": 0.3353801965713501,
    "bertscore_recall": 0.47911888360977173,
    "bertscore_f1": 0.3945663869380951
  }
}