{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Face and Body Paint Kit By Color Technik 24 Professional Oil Based Flash Colors, 2 Sets of 12 Color Palettes, 6 Paint Brushes 70 Stencils 2 Sponges Non-Toxic For Adults & Kids Halloween Painting Party\nReview Date: 2020/10/07\nStore: Color Technik\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Color Technik', 'Package Information': 'Palette', 'Package Type': 'Palette', 'Skin Type': 'Sensitive', 'Package Dimensions': '9 x 5 x 1 inches; 8.78 Ounces', 'Item model number': 'CTFPS24'}\nReview Text: Easily wiped off, if you want it to last longer using a makeup setting spray. One of the pallets came broken on the side and they were really oily. But they did stand out in color well, if using multiple colors be patient and let dry so you don't run colors.\nReview Title: Oily\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "SELF/ish Men's Face Scrub | Exfoliating Facial Cleanser | Deep Cleansing | Effective Shave Prep & Beard Exfoliator for Men | Natural Ingredients | 3.4fl oz\nMELARQT\n{'Brand': 'MELARQT', 'Item Form': 'Scrub', 'Skin Type': 'Acne Prone', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Natural', 'Package Dimensions': '6.26 x 2.09 x 2.01 inches; 4.73 Ounces', 'Department': 'Men', 'UPC': '810042384002'}\nMy husband is always using my face wash so I wanted to get him his own. He says it made his face feel clean but not dry. The smell was really good too.\nMy husband approved\nMaya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nMAYA MARI\n{'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nGreat smelling shampoo, used this morning and it still smells good. Doesn't sud up a lot but works good.\nsmells good\nKing Style Dark Brown Short Curly Bob Wig with Air Bangs 14'' Shoulder Length Synthetic Wig with Wig Cap Pastel Cosplay Wigs for Women\nKing Style\n{'Color': 'Brown', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Brand': 'King Style', 'Package Dimensions': '10.6 x 7 x 1 inches; 5.61 Ounces', 'Manufacturer': 'King Style'}\nNice shade of brown and the hair has a natural thickness to it. Using for a cosplay and it matches. Value for the money.\nNice shade of brown\nFace and Body Paint Kit By Color Technik 24 Professional Oil Based Flash Colors, 2 Sets of 12 Color Palettes, 6 Paint Brushes 70 Stencils 2 Sponges Non-Toxic For Adults & Kids Halloween Painting Party\nColor Technik\n{'Brand': 'Color Technik', 'Package Information': 'Palette', 'Package Type': 'Palette', 'Skin Type': 'Sensitive', 'Package Dimensions': '9 x 5 x 1 inches; 8.78 Ounces', 'Item model number': 'CTFPS24'}\nEasily wiped off, if you want it to last longer using a makeup setting spray. One of the pallets came broken on the side and they were really oily. But they did stand out in color well, if using multiple colors be patient and let dry so you don't run colors.\nOily",
  "profile": "User Profile Summary:\n\n- **Target Audience**: Primarily male skincare products with a focus on facial care; recently expanded to include grooming solutions, especially hair care and creative cosmetic products for family events.\n- **Product Preference**: Seeks effective exfoliating cleansers suitable for acne-prone skin and formulated with natural ingredients. The user's interests have broadened to include hair care products that restore moisture, shine, and feature enjoyable fragrances. Recently showed interest in cosmetic products for creative activities, highlighting versatility in grooming solutions.\n- **Scent Sensitivity**: Values products with enjoyable scents, emphasizing a strong appreciation for sensory experiences, as seen in preferences for both hair care and previous fragrance selections.\n- **User Experience**: Prefers products that cleanse without causing dryness, prioritizing hydration and comfort. The user appreciates cosmetic products that are user-friendly, although requires caution with specific textures like oiliness.\n- **Purchase Behavior**: Likely purchases for family members, indicating a desire for diverse grooming solutions catering to varying tastes and requirements across family needs, including both hair care and cosmetic products.\n- **Quality Focus**: Chooses high-quality items with good average ratings, reflecting a commitment to efficacy and user satisfaction across skincare, hair care, and new cosmetic purchases.\n\nOverall, the user seeks holistic, versatile grooming solutions that combine sensory enjoyment, effective formulations, and quality across skincare, hair care, and creative cosmetic applications for family experiences.",
  "metrics": {
    "rouge1_f": 0.18461538461538463,
    "rouge2_f": 0.0137221269296741,
    "rougeL_f": 0.09230769230769231,
    "meteor": 0.09282464853407803,
    "bleu1": 0.10408170509429523,
    "bleu2": 0.012932616032394812,
    "bleu3": 0.0029989643848325953,
    "bleu4": 0.0014454425751618586,
    "bertscore_precision": 0.3782685399055481,
    "bertscore_recall": 0.42641401290893555,
    "bertscore_f1": 0.4009009599685669
  }
}