{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Grilled\nReview Date: 2015/08/10\nStore: Ray Romano  (Actor),     Kevin James  (Actor),     Jason Ensler  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product description', 'Bar code gash. Brand New, Factory Sealed', 'Amazon.com', 'Meat connoisseurs will adore', 'Grilled', ', possibly the only film dedicated exclusively to high quality beef. Maurice (Ray Romano) and Dave (Kevin James) are meat salesmen roving the San Fernando Valley, armpit of America, for clients to buy their line of prime-cut steaks. Once they get a hold of the hottest leads in town, Maurice and Dave embark on a comedic adventure spiked with danger and sexual innuendo involving transvestites, gangsters, and even Burt Reynolds, playing the macho beef lover hosting his son\\x92s Bar Mitzvah. As soon as', 'Grilled', 'starts feeling like a carbon copy of', 'Glengarry Glen Ross', ', some hip actors, like Juliette Lewis cast as the drunken, suicidal girlfriend of a mob ringleader, make the film cooler like', 'Pulp Fiction', '. Sales made under ridiculously dire circumstances are sometimes corny, sometimes funny, odd, and surprising. Director Jason Ensler, known mostly for his work on television shows such as', 'West Wing', ',', 'South Beach', ', and', 'Scrubs', ', has taken the formulaic salesman flick and remade it into something almost original, were it not so similar to the abovementioned two movies. Still, there are many entertaining moments in', 'Grilled', ', especially when scenes of gang-related crime overlap with scenes proving these gangsters\\x92 devotion to red meat. Eventually, carnage prevails, as Dave and Maurice teach us that the sale must be made at all costs.', '--Trinie Dalton']\nAverage Rating: 3.7\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 0.3 x 5.25 inches; 3.2 Ounces', 'Director': 'Jason Ensler', 'Media Format': 'Closed-captioned, Color, NTSC, Multiple Formats', 'Run time': '1 hour and 23 minutes', 'Release date': 'July 11, 2006', 'Actors': 'Ray Romano, Kevin James, Sofa Vergara, Juliette Lewis, Kim Coates', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), English (DTS 5.1)', 'Studio': 'New Line Home Video', 'Writers': 'Larry Hankin, William Tepper', 'Number of discs': '1'}\nReview Text: How do you take Ray Romano and Kevin James, two of my families favorite actors and make a below average movie? You cast them in roles that are completely out of character for them, give them a poor script and then over direct them so that their natural talent is suppressed. We read some poor reviews but thought it couldn't be this bad. What stood out was the gratuitous foul language of Ray's character. It would have been ridiculous for any actor but was particularly noticeable for Ray as that is not how we think of him. Not a Disney character, but also not someone who would play a contract killer in Pulp Fiction. If like me you are thinking &#34;Ray Romano and Kevin James, how bad can it be?&#34;. Pretty bad. Let this one go.\nReview Title: For a change, the reviews were correct, pass on this one\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "The Dilemma [Blu-ray]\nVince Vaughn  (Actor, Producer),     Kevin James  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Vince Vaughn and Kevin James headline an all-star comedy from director Ron Howard. Ronny's (Vaughn) world is turned upside down when he inadvertently sees something he should not have, and makes it his mission to get answers. As the amateur investigation dissolves his world into comic mayhem, he learns that his best friend Nick (James) has a few secrets of his own. Now, Ronny must decide what will happen if he reveals the truth. Also starring Jennifer Connelly, Winona Ryder, Channing Tatum and Queen Latifah.\", 'Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Gag Reel', 'Gag Reel', 'Improvs with Vince Vaughn and Kevin James', 'Improvs with Vince Vaughn and Kevin James', 'This is The Dilemma', 'This is The Dilemma', 'Tour Chicago', 'Tour Chicago', 'On Ice', 'On Ice', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', ']]>']\n{'Genre': 'comedy movie, movie night, cheating movie, Comedy, buy movie, digital movie, DVD movie, dilemma movie, Blu-ray movie, Ron Howard movie, rent moviecomedy movie, movie night, cheating movie, Comedy, buy movie, digital movie, DVD movie, dilemma movie, Blu-ray movie, Ron Howard movie, rent movie  See more', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Channing Tatum, Queen Latifah, Ron Howard, Jennifer Connelly, Vince Vaughn, Clint Howard, Kevin James, Winona Ryder, Brian Grazer, Allan LoebChanning Tatum, Queen Latifah, Ron Howard, Jennifer Connelly, Vince Vaughn, Clint Howard, Kevin James, Winona Ryder, Brian Grazer, Allan Loeb  See more', 'Language': 'English (DTS-HD Master Audio 5.1), Spanish (DTS 5.1)', 'Runtime': '1 hour and 52 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.3 inches; 0.01 Ounces', 'Director': 'Ron Howard', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'September 25, 2011', 'Actors': 'Vince Vaughn, Kevin James, Jennifer Connelly, Winona Ryder, Channing Tatum', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Brian Grazer, Ron Howard, Vince Vaughn', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Allan Loeb', 'Number of discs': '1'}\nWe are Kevin James (particularly) and Vince Vaughn (generally) fans. We really enjoyed this moving. It was fine for my teenager. It had a story line and some great actors to make it sing. People who like Hitch will definitely like this. King of Queens fans will like Kevin as well.\nA great way to spend a few hours\nVampires\nJames Woods  (Actor),     Daniel Baldwin  (Actor),     John Carpenter  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'The future of mankind rests in the hands of Master Slayer Jack Crow as he moves to prevent the Master Vampire from reaching his ultimate goal for the legions of undead, the ability to walk in daylight.', 'Amazon.com', \"Talk about an opening. The first few minutes of John Carpenter's\", 'Vampires', '--in which James Woods\\'s vampire killer leads a dawn raid on a New Mexico \"goon nest\" of bloodsuckers--not only suggests a horror movie that will not pull any punches, it even evokes some of the more disturbing dream-memories of American Westerns. Muscular and uncompromised, the sequence suggests a new Carpenter classic unraveling before one\\'s eyes. Well, dream on. Things don\\'t quite work out that way, but this is still a film to reckon with. There are a few serious (and surprising) misjudgments on the director\\'s part, particularly a mishandling of Sheryl Lee\\'s role as a prostitute poisoned by the bite of a \"master vampire\" (who pretty much wiped out Woods\\'s team of goon terminators). But aside from some weaknesses, the action is jolting, the suggested complicity of the Catholic Church in destroying monsters is provocative, and the traces of Howard Hawks\\'s continuing influence on Carpenter\\'s storytelling are in evidence.', '--Tom Keogh']\n{'Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'James Woods, John Steakley, Mark Boone Junior, Tim Guinee, Don Jakoby, John Carpenter, Maximilian Schell, Thomas Ian Griffith, Cary-Hiroyuki Tagawa, Henry Kingi, Sheryl Lee, Thomas Rosales Jr., Daniel Baldwin, David Rowden, Gregory SierraJames Woods, John Steakley, Mark Boone Junior, Tim Guinee, Don Jakoby, John Carpenter, Maximilian Schell, Thomas Ian Griffith, Cary-Hiroyuki Tagawa, Henry Kingi, Sheryl Lee, Thomas Rosales Jr., Daniel Baldwin, David Rowden, Gregory Sierra  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.2 Ounces', 'Item model number': '43396030640', 'Director': 'John Carpenter', 'Media Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, Dolby, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'February 9, 1999', 'Actors': 'James Woods, Daniel Baldwin, Sheryl Lee, Thomas Ian Griffith, Maximilian Schell', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Don Jakoby, John Steakley', 'Number of discs': '1'}\n&#34;Hey Padre, got a little wood?&#34;. Certainly not everyones taste, but the mix of humor and action is good for me.\nOne of my two favorite movies\nDyatlov Pass Incident\nGemma Atkinson  (Actor, Host),     Matt Stokoe  (Actor, Host),     Renny Harlin  (Director, Host)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"United Kingdom released, Blu-Ray/Region B : it WILL NOT play on regular DVD player, or on standard US Blu-Ray player. You need multi-region Blu-Ray player to view it in USA/Canada: LANGUAGES: English ( Dolby Digital 2.0 ), English ( Dolby Digital 5.1 ), English ( Dolby Digital Stereo ), English ( DTS-HD Master Audio ), WIDESCREEN (2.35:1), SPECIAL FEATURES: Interactive Menu, Scene Access, SYNOPSIS: In January 1959, ten experienced young skiers set out to travel to a mountain named Mount Otorten in the far north of Russia. The name Otorten translates as 'Don't go there' in the local Mansi language. One of the skiers fell ill and returned. The remaining nine lost their way and ended up on another mountain slope known as Kholat Syakhl (translated as 'Mountain of the Dead' due to the previous deaths that occurred there). On the night of 1 February 1959 something or someone caused the skiers to flee their tent in terror by using knives to slash their way out rather than leaving by the entrance. When they failed to return, search parties were sent out and their bodies were found, some with massive internal injuries but with no external marks on them. The autopsy stated the violent injuries were caused by 'an unknown compelling force'. The area was sealed off for years by the authorities and the deaths and events of that night remain unexplained. Benefitting from original research carried out in Russia, this book attempts to explain what happened to the nine skiers who lost their lives on the 'Mountain of the Dead', in what has come to be known as the 'Dyatlov Pass Incident'. ...The Dyatlov Pass Incident (2013) ( Devil's Pass )\"]\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.51 x 6.69 x 0.79 inches; 3.74 Ounces', 'Director': 'Renny Harlin', 'Media Format': 'Import', 'Run time': '96 minutes', 'Release date': 'September 3, 2013', 'Actors': 'Gemma Atkinson, Matt Stokoe, Richard Reid, Holly Goss, Luke Albright', 'Producers': \"The Dyatlov Pass Incident (2013) ( Devil's Pass ), The Dyatlov Pass Incident (2013), Devil's Pass\", 'Language': 'English (Dolby Digital 2.0)', 'Studio': 'IMPORTS', 'Country of Origin': 'United Kingdom', 'Number of discs': '1'}\nWhile I didn't expect much, this was really pretty well done. I watched it with my 15-25 kids and they also enjoyed it. You get a sense of the actual events and the story built around it fictional, but not completely incredible.\nWorth a watch\nSafe House [Blu-ray]\nDenzel Washington  (Actor),     Ryan Reynolds  (Actor),     Daniel Espinosa  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Tobin Frost (Oscar winner Denzel Washington), one of the CIA’s most dangerous traitors, resurfaces in South Africa after eluding capture for almost a decade. During his interrogation, the safe house he’s being held in is attacked by brutal mercenaries forcing rookie agent, Matt Weston (Ryan Reynolds) to take the infamous Frost on the run. As the masterful manipulator toys with his reluctant protégé, shaking the young operative’s morality and idealism, the unlikely allies must fight to stay alive long enough to uncover who wants them both dead. Packed with intense action and thrilling suspense, Safe House takes you on a deadly ride through a covert world where no one and no place is ever safe.NOTE:Expiration date of the digital copy is extended till 5/2/2016.Even-though item states UltraViolet Digital Copy expires on 10/27/12.']\n{'Genre': 'DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Ultraviolet, Color, Widescreen', 'Contributor': 'Daniel Espinosa, Denzel Washington, Ryan Reynolds', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), Spanish (DTS 5.1), French Canadian (DTS 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '3 hours and 50 minutes', 'Digital Copy Expiration Date': 'May 2, 2016', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 2.4 Ounces', 'Item model number': '25192124716', 'Director': 'Daniel Espinosa', 'Media Format': 'Multiple Formats, Blu-ray, Ultraviolet, Color, Widescreen', 'Run time': '3 hours and 50 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Denzel Washington, Ryan Reynolds', 'Subtitles': 'English, French, Spanish', 'Studio': 'Universal', 'Number of discs': '2'}\nAlthough I am a fan of nearly all of Denzel's work, this was a well done movie that didn't go overboard with language, sex and gratuitous violence. It is not a kids movie but not something you are embarrassed to watch with a teenager.\nAlthough I am a fan of nearly all of Denzel's ...\nChronicle\nMichael B. Jordan  (Actor),     Michael Kelly  (Actor),     Josh Trank  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Today's Deals, Spotlight Deals, Sci-fi & Fantasy\n['Three high school students make an incredible discovery; leading to their developing uncanny powers beyond their understanding. As they learn to control their abilities and use them to their advantage; their lives start to spin out of control; and their darker sides begin to take over.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Item model number': 'Relay time: 84min; 20 Videos', 'Director': 'Josh Trank', 'Media Format': \"Multiple Formats, Blu-ray, AC-3, Color, Dolby, Director's Cut, Dubbed, DTS Surround Sound, Subtitled, Widescreen, Digital_copy\", 'Run time': '1 hour and 24 minutes', 'Release date': 'May 15, 2012', 'Actors': 'Michael B. Jordan, Michael Kelly, Dane DeHaan', 'Dubbed': 'French, English, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nAn interesting story with some neat special effects. Certainly not a classic, but a good evenings entertainment.\nbut a good evenings entertainment\nThe King of Queens: The Complete Series\nMary Lynn Rajskub  (Actor),     Lisa Rieffel  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'The King of Queens', 'consistently delivered laughs for nine seasons, making it one of the most popular and longest-running comedies in television history! Kevin James stars as Doug Heffernan, a lovable regular guy with an adoring wife, Carrie (Leah Remini), and a frustrating father-in-law (Jerry Stiler) under his roof. Packed with a crazy cast of characters, hilarious situations and plenty of great guest stars, this is one show that brings the goods!', 'Amazon.com', 'The King of Queens - The Complete First Season', 'In the sitcom', 'The King of Queens', \", comedian Kevin James has created a new archetype: the sensitive lug. This deceptively simple comedy bounces along because delivery man Doug Heffernen (James), though completely a guy's guy, constantly struggles to keep the world around him in a delicate emotional balance. Meanwhile, his wife Carrie (Leah Remini), though utterly feminine (and one of the sexiest women on television), uses the kind of no-nonsense rational approach that's usually a man's province. Add to this mix Carrie's father Arthur (Jerry Stiller), whose life as a fussy, self-absorbed retiree makes him more like their child than an adult, and you've got the building blocks for an excellent and durable show. The first season of\", 'The King of Queens', \"quickly found its voice with stories firmly rooted in the everyday world, rarely spinning off into absurdity--and why should it, when there's such a wealth of humor to be found in petty neuroses (when Doug gets assigned an attractive young woman as a trainee at work, he gets hurt when Carrie isn't remotely jealous), ill-advised scheming (to weasel out of a traffic ticket, Carrie agrees to go out on a date with the cop who pulled her over), and juggling obligations to friends and family (just about every episode). Brilliant comic bits abound; one classic moment features Doug and Carrie having a furious argument in absolute silence at a cello concert--a scene that fuses deft physicality, well-developed characters, and sheer silliness.\", 'The King of Queens', 'is a delight.', '--Bret Fetzer', 'The King of Queens - The Complete Second Season', 'Like its characters,', 'The King of Queens', \"is a unpretentious but utterly dependable sitcom. Kevin James and Leah Remini, as blue-collar couple Doug and Carrie Heffernan, have the kind of chemistry that every sitcom craves (but far too few have). Layered on top of this solid foundation are the bizarre flights of Jerry Stiller as Arthur, Carrie's loud, paranoid, and combustible father. The second season has no overarching plotlines or recurring themes; it's just a compilation of excellent material, including Doug's ego inflating when a waitress flirts with him; Doug and Carrie squirming when their best friends ask them to be godparents; Doug discovering that Carrie compulsively cheats at games; and a flashback to when they first met. It's the attention to emotional detail that makes the show fly; James and Remini take the most mundane material--say, an argument over where to go for a vacation or how their marriage lacks romance--and turn the many ways in which couples cope into a pugnacious duet. Their sparring not only is funny, but consistently rings true as irrational but oh-so-common human behavior. The show pulls you in all the more because the Heffernans make up just as often as they fight, demonstrating one of the most functional marriages on television. It's meat-and-potatoes comedy, but sometimes nothing else will hit the spot.\", '--Bret Fetzer', 'The King of Queens: The Complete Third Season', 'The third season of', 'The King of Queens', \"upholds the quality of the first two: Smart but unpretentious comedy based firmly in the daily lives of blue-collar couple Doug and Carrie Heffernan (Kevin James and Leah Remini) as they cope with their jobs, their friends, and sharing their home with Carrie's eccentric, obsessive father Arthur (Jerry Stiller). While dozens of mediocre sitcoms are built around fat guys implausibly married to sexy women, James and Remini have such chemistry and their characters are so well-crafted and complex that their marriage seems not only convenient for sitcom purposes but downright meant to be.  The show only goes astray when it goes for a gimmick. In one episode, Doug dreams of himself as Ralph Kramden in\", 'The Honeymooners', \"; while it's understandable for James to tip his hat to one of his idols, this belabored concept sucked all the humor out of the show. But when\", 'The King of Queens', \"sticks to small, mundane troubles, the results are unfailingly delightful. For example, Doug becomes self-conscious about his weight when he discovers that Carrie buys his clothes at the Big & Tall Shop; Carrie is excited to go to lunch with some of the women lawyers at her firm, then humiliated when it turns out they didn't know she's a secretary; or Carrie admits she finds Doug's best friend Deacon (Victor Williams) hot. These events launch some wonderful farce, all the funnier because anyone can identify with the characters' insecurity and jealousy. This firm psychological grounding lets the series keep its footing as it dips into some deeper emotions, like the break-up of Deacon's marriage or an unexpected pregnancy. Because James and Remini keep their characters truthful in their most ridiculous moments, they keep us engaged and even moved as they enter what could be maudlin territory--plus, the writers never lose the opportunity for a sharp but telling joke along the way.\", 'The King of Queens', \"makes sitcoms look easy, but the show's skillful balance of an ordinary world and fine-tuned humor is anything but.\", '--Bret Fetzer', 'The King of Queens - The Complete Fourth Season', 'The fourth season of', 'The King of Queens', \"opens with a perfect example of how the show spins real life into farce: Delivery guy Doug and his sardonic wife Carrie (Kevin James and Leah Remini) want to get pregnant, but can't get Carrie's cantankerous father Arthur (Jerry Stiller) out of the house; the only solution their budget will allow is hiring a dog-walker named Holly (Nicole Sullivan) to take Arthur to the park. A more banal sitcom would conclude with Arthur's rage when he discovers the truth, but\", 'The King of Queens', 'finds a grace note with Arthur and Holly beginning a genuine friendship. Which is not to say that', 'The King of Queens', \"goes for easy sentiment; some of the fourth season's best moments walk a distinctly unsentimental line. When Arthur goes into the hospital for a heart problem, Carrie discovers that he hid a college acceptance letter from her in order to keep her at home. While Arthur lies unconscious, Carrie wrestles with anger and grief--and, thanks to smart writing and Remini's deft performance, it's almost uncomfortably funny.  James, Remini, and Stiller form the sitcom equivalent of a rock'n'roll power trio--it's astonishing that so much comedy can come out of just three people.\", 'The King of Queens', \"has solid supporting players (and, towards the end of this season, succumbs to the questionable trend of casting celebrity guest stars), but the skillful interplay between Doug, Carrie, and Arthur drives the vast majority of the show's stories. The fourth season has a handful of episodes that wallow in typical sitcom schtick, but it's impressive how many more episodes remain fresh, lively, and true to these vivid characters. Even an episode that flashes back to Doug and Carrie's wedding--a premise that usually guarantees a saccharine kiss of death--finds a balance of tartness and genuine warmth. Satisfying and well-crafted.\", '--Bret Fetzer', 'The King of Queens: The Complete Ninth Season', 'The final season of', 'The King of Queens', 'sends this under-appreciated sitcom out with a bang. The season begins with several strong stand-alone episodes, including ones in which Doug (Kevin James) uses a tax refund to buy an ice cream truck; Carrie (Leah Remini) suspects that their best friends have managed to buy a vacation home by sponging off of her and Doug; Doug, after rescuing a chicken from being killed, becomes a vegetarian; Arthur (Jerry Stiller), eternally resplendent in argyle sweaters, asks Doug and Carrie for the money to get braces; and Adam Sandler (', 'Punch Drunk Love', \") plays a high school friend of Doug's with a lot of repressed anger. But the season crescendos in a three-episode story that begins with Arthur preparing to get married again while Doug and Carrie's marriage crumbles when Carrie wants to move to an apartment in Manhattan. From there, the Heffernans' worst impulses run comically amok, demonstrating this show's long-standing strengths: The cheerful exploitation of all the character's bad behavior, be it Doug's selfishness, Carrie's envy, or Arthur's raging egomania; snowballing storylines that routinely end in entertaining disaster and humiliation; and the skillfully-honed interplay of the three leads. The supporting cast--including Doug's best friend Deacon (Victor Williams), the emotionally enmeshed roommates Spence (Patton Oswalt) and Danny (Gary Valentine), and needy dog-walker Holly (Nicole Sullivan)--all have their moments, but James, Remini, and Stiller are the show's engine, and it runs like a Maserati.\", '--Bret Fetzer']\n{'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': \"Lou Ferrigno, Jerry Stiller, Anthony Powers, Lisa Rieffel, Larry Romano, Kevin James, Nicole Sullivan, Mookie Barker, Gary Valentine, Victor Williams, Dakin Matthews, Merrin Dungey, Leah Remini, Jenny O'Hara, Alex Skuby, Sam McMurray, Mary Lynn Rajskub, Annette Sahakian Davis, Patton OswaltLou Ferrigno, Jerry Stiller, Anthony Powers, Lisa Rieffel, Larry Romano, Kevin James, Nicole Sullivan, Mookie Barker, Gary Valentine, Victor Williams, Dakin Matthews, Merrin Dungey, Leah Remini, Jenny O'Hara, Alex Skuby, Sam McMurray, Mary Lynn Rajskub, Annette Sahaki…   See more\", 'Language': 'English', 'Runtime': '75 hours and 55 minutes', 'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '2.9 x 5.7 x 7.9 inches; 1.3 Pounds', 'Item model number': '17597971', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '75 hours and 55 minutes', 'Release date': 'September 27, 2011', 'Actors': 'Mary Lynn Rajskub, Lisa Rieffel, Anthony Powers, Kevin James, Leah Remini', 'Producers': 'Annette Sahakian Davis', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nWhat can I say. One of the shows I really like. Kevin/Doug is always great. When Leah/Carey is managing her weight, she is hot. Even when overweight, she is funny. Why this isn't available for streaming is beyond me, but why you should oppose any organization ending in &#34;AA&#34; (RIAA, MPAA, etc). AA is for anti-artist. Some day, we will pay a fair price to view the shows we like. I don't have a problem with $25 for the entire KOQ series. I miss them, but enjoy Kevin's other work. I assume Leah is gearing up for an extreme weight loss episode...\nOne of the shows I really like. Kevin/Doug is always great\nGrilled\nRay Romano  (Actor),     Kevin James  (Actor),     Jason Ensler  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product description', 'Bar code gash. Brand New, Factory Sealed', 'Amazon.com', 'Meat connoisseurs will adore', 'Grilled', ', possibly the only film dedicated exclusively to high quality beef. Maurice (Ray Romano) and Dave (Kevin James) are meat salesmen roving the San Fernando Valley, armpit of America, for clients to buy their line of prime-cut steaks. Once they get a hold of the hottest leads in town, Maurice and Dave embark on a comedic adventure spiked with danger and sexual innuendo involving transvestites, gangsters, and even Burt Reynolds, playing the macho beef lover hosting his son\\x92s Bar Mitzvah. As soon as', 'Grilled', 'starts feeling like a carbon copy of', 'Glengarry Glen Ross', ', some hip actors, like Juliette Lewis cast as the drunken, suicidal girlfriend of a mob ringleader, make the film cooler like', 'Pulp Fiction', '. Sales made under ridiculously dire circumstances are sometimes corny, sometimes funny, odd, and surprising. Director Jason Ensler, known mostly for his work on television shows such as', 'West Wing', ',', 'South Beach', ', and', 'Scrubs', ', has taken the formulaic salesman flick and remade it into something almost original, were it not so similar to the abovementioned two movies. Still, there are many entertaining moments in', 'Grilled', ', especially when scenes of gang-related crime overlap with scenes proving these gangsters\\x92 devotion to red meat. Eventually, carnage prevails, as Dave and Maurice teach us that the sale must be made at all costs.', '--Trinie Dalton']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 0.3 x 5.25 inches; 3.2 Ounces', 'Director': 'Jason Ensler', 'Media Format': 'Closed-captioned, Color, NTSC, Multiple Formats', 'Run time': '1 hour and 23 minutes', 'Release date': 'July 11, 2006', 'Actors': 'Ray Romano, Kevin James, Sofa Vergara, Juliette Lewis, Kim Coates', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), English (DTS 5.1)', 'Studio': 'New Line Home Video', 'Writers': 'Larry Hankin, William Tepper', 'Number of discs': '1'}\nHow do you take Ray Romano and Kevin James, two of my families favorite actors and make a below average movie? You cast them in roles that are completely out of character for them, give them a poor script and then over direct them so that their natural talent is suppressed. We read some poor reviews but thought it couldn't be this bad. What stood out was the gratuitous foul language of Ray's character. It would have been ridiculous for any actor but was particularly noticeable for Ray as that is not how we think of him. Not a Disney character, but also not someone who would play a contract killer in Pulp Fiction. If like me you are thinking &#34;Ray Romano and Kevin James, how bad can it be?&#34;. Pretty bad. Let this one go.\nFor a change, the reviews were correct, pass on this one",
  "profile": "**Updated User Profile Summary:**\n\n- **Favorite Genres:** Enjoys comedy, particularly family-friendly content suitable for teenagers, as well as genre-blending films that incorporate humor and suspense, including horror-comedy and thrillers. User is expanding their interest into sci-fi and fantasy narratives.\n- **Actor Preferences:** Strongly favors Kevin James, reflecting a consistent affinity for his work, and appreciates Vince Vaughn. User is growing in admiration for Denzel Washington and Ryan Reynolds, and is exploring films with Michael B. Jordan.\n- **Director Appreciation:** Interested in films by Ron Howard and John Carpenter, with curiosity towards Renny Harlin and Daniel Espinosa, showing openness to works by Josh Trank.\n- **Viewing Experience:** Values engaging storylines that balance suspense and humor, enjoying films that spark family discussions. Prefers relatable dilemmas that are comedic yet thought-provoking.\n- **Film Characteristics:** Enjoys bonus content like deleted scenes and behind-the-scenes features. Likely enjoys family movie nights with a penchant for lighthearted films while remaining open to more intense themes with humor.\n- **Overall Sentiment:** Maintains a positive outlook on films but can be critical when favorites are miscast or scripts underdeliver, as reflected in recent feedback. Appreciates special effects that enhance the viewing experience, aiming for both family appropriateness and entertainment value.",
  "metrics": {
    "rouge1_f": 0.06315789473684211,
    "rouge2_f": 0.010530934620447565,
    "rougeL_f": 0.029824561403508774,
    "meteor": 0.01793065325954914,
    "bleu1": 2.341197404523077e-10,
    "bleu2": 1.1378548376325883e-10,
    "bleu3": 4.478894774143078e-11,
    "bleu4": 1.1184660533219912e-11,
    "bertscore_precision": 0.3582705855369568,
    "bertscore_recall": 0.5312454700469971,
    "bertscore_f1": 0.4279397130012512
  }
}