{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Safe House [Blu-ray]\nReview Date: 2015/02/24\nStore: Denzel Washington  (Actor),     Ryan Reynolds  (Actor),     Daniel Espinosa  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Tobin Frost (Oscar winner Denzel Washington), one of the CIA’s most dangerous traitors, resurfaces in South Africa after eluding capture for almost a decade. During his interrogation, the safe house he’s being held in is attacked by brutal mercenaries forcing rookie agent, Matt Weston (Ryan Reynolds) to take the infamous Frost on the run. As the masterful manipulator toys with his reluctant protégé, shaking the young operative’s morality and idealism, the unlikely allies must fight to stay alive long enough to uncover who wants them both dead. Packed with intense action and thrilling suspense, Safe House takes you on a deadly ride through a covert world where no one and no place is ever safe.NOTE:Expiration date of the digital copy is extended till 5/2/2016.Even-though item states UltraViolet Digital Copy expires on 10/27/12.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Ultraviolet, Color, Widescreen', 'Contributor': 'Daniel Espinosa, Denzel Washington, Ryan Reynolds', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), Spanish (DTS 5.1), French Canadian (DTS 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '3 hours and 50 minutes', 'Digital Copy Expiration Date': 'May 2, 2016', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 2.4 Ounces', 'Item model number': '25192124716', 'Director': 'Daniel Espinosa', 'Media Format': 'Multiple Formats, Blu-ray, Ultraviolet, Color, Widescreen', 'Run time': '3 hours and 50 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Denzel Washington, Ryan Reynolds', 'Subtitles': 'English, French, Spanish', 'Studio': 'Universal', 'Number of discs': '2'}\nReview Text: Although I am a fan of nearly all of Denzel's work, this was a well done movie that didn't go overboard with language, sex and gratuitous violence. It is not a kids movie but not something you are embarrassed to watch with a teenager.\nReview Title: Although I am a fan of nearly all of Denzel's ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Dilemma [Blu-ray]\nVince Vaughn  (Actor, Producer),     Kevin James  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Vince Vaughn and Kevin James headline an all-star comedy from director Ron Howard. Ronny's (Vaughn) world is turned upside down when he inadvertently sees something he should not have, and makes it his mission to get answers. As the amateur investigation dissolves his world into comic mayhem, he learns that his best friend Nick (James) has a few secrets of his own. Now, Ronny must decide what will happen if he reveals the truth. Also starring Jennifer Connelly, Winona Ryder, Channing Tatum and Queen Latifah.\", 'Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Gag Reel', 'Gag Reel', 'Improvs with Vince Vaughn and Kevin James', 'Improvs with Vince Vaughn and Kevin James', 'This is The Dilemma', 'This is The Dilemma', 'Tour Chicago', 'Tour Chicago', 'On Ice', 'On Ice', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', ']]>']\n{'Genre': 'comedy movie, movie night, cheating movie, Comedy, buy movie, digital movie, DVD movie, dilemma movie, Blu-ray movie, Ron Howard movie, rent moviecomedy movie, movie night, cheating movie, Comedy, buy movie, digital movie, DVD movie, dilemma movie, Blu-ray movie, Ron Howard movie, rent movie  See more', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Channing Tatum, Queen Latifah, Ron Howard, Jennifer Connelly, Vince Vaughn, Clint Howard, Kevin James, Winona Ryder, Brian Grazer, Allan LoebChanning Tatum, Queen Latifah, Ron Howard, Jennifer Connelly, Vince Vaughn, Clint Howard, Kevin James, Winona Ryder, Brian Grazer, Allan Loeb  See more', 'Language': 'English (DTS-HD Master Audio 5.1), Spanish (DTS 5.1)', 'Runtime': '1 hour and 52 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.3 inches; 0.01 Ounces', 'Director': 'Ron Howard', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'September 25, 2011', 'Actors': 'Vince Vaughn, Kevin James, Jennifer Connelly, Winona Ryder, Channing Tatum', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Brian Grazer, Ron Howard, Vince Vaughn', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Allan Loeb', 'Number of discs': '1'}\nWe are Kevin James (particularly) and Vince Vaughn (generally) fans. We really enjoyed this moving. It was fine for my teenager. It had a story line and some great actors to make it sing. People who like Hitch will definitely like this. King of Queens fans will like Kevin as well.\nA great way to spend a few hours\nVampires\nJames Woods  (Actor),     Daniel Baldwin  (Actor),     John Carpenter  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'The future of mankind rests in the hands of Master Slayer Jack Crow as he moves to prevent the Master Vampire from reaching his ultimate goal for the legions of undead, the ability to walk in daylight.', 'Amazon.com', \"Talk about an opening. The first few minutes of John Carpenter's\", 'Vampires', '--in which James Woods\\'s vampire killer leads a dawn raid on a New Mexico \"goon nest\" of bloodsuckers--not only suggests a horror movie that will not pull any punches, it even evokes some of the more disturbing dream-memories of American Westerns. Muscular and uncompromised, the sequence suggests a new Carpenter classic unraveling before one\\'s eyes. Well, dream on. Things don\\'t quite work out that way, but this is still a film to reckon with. There are a few serious (and surprising) misjudgments on the director\\'s part, particularly a mishandling of Sheryl Lee\\'s role as a prostitute poisoned by the bite of a \"master vampire\" (who pretty much wiped out Woods\\'s team of goon terminators). But aside from some weaknesses, the action is jolting, the suggested complicity of the Catholic Church in destroying monsters is provocative, and the traces of Howard Hawks\\'s continuing influence on Carpenter\\'s storytelling are in evidence.', '--Tom Keogh']\n{'Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'James Woods, John Steakley, Mark Boone Junior, Tim Guinee, Don Jakoby, John Carpenter, Maximilian Schell, Thomas Ian Griffith, Cary-Hiroyuki Tagawa, Henry Kingi, Sheryl Lee, Thomas Rosales Jr., Daniel Baldwin, David Rowden, Gregory SierraJames Woods, John Steakley, Mark Boone Junior, Tim Guinee, Don Jakoby, John Carpenter, Maximilian Schell, Thomas Ian Griffith, Cary-Hiroyuki Tagawa, Henry Kingi, Sheryl Lee, Thomas Rosales Jr., Daniel Baldwin, David Rowden, Gregory Sierra  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.2 Ounces', 'Item model number': '43396030640', 'Director': 'John Carpenter', 'Media Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, Dolby, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'February 9, 1999', 'Actors': 'James Woods, Daniel Baldwin, Sheryl Lee, Thomas Ian Griffith, Maximilian Schell', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Don Jakoby, John Steakley', 'Number of discs': '1'}\n&#34;Hey Padre, got a little wood?&#34;. Certainly not everyones taste, but the mix of humor and action is good for me.\nOne of my two favorite movies\nDyatlov Pass Incident\nGemma Atkinson  (Actor, Host),     Matt Stokoe  (Actor, Host),     Renny Harlin  (Director, Host)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"United Kingdom released, Blu-Ray/Region B : it WILL NOT play on regular DVD player, or on standard US Blu-Ray player. You need multi-region Blu-Ray player to view it in USA/Canada: LANGUAGES: English ( Dolby Digital 2.0 ), English ( Dolby Digital 5.1 ), English ( Dolby Digital Stereo ), English ( DTS-HD Master Audio ), WIDESCREEN (2.35:1), SPECIAL FEATURES: Interactive Menu, Scene Access, SYNOPSIS: In January 1959, ten experienced young skiers set out to travel to a mountain named Mount Otorten in the far north of Russia. The name Otorten translates as 'Don't go there' in the local Mansi language. One of the skiers fell ill and returned. The remaining nine lost their way and ended up on another mountain slope known as Kholat Syakhl (translated as 'Mountain of the Dead' due to the previous deaths that occurred there). On the night of 1 February 1959 something or someone caused the skiers to flee their tent in terror by using knives to slash their way out rather than leaving by the entrance. When they failed to return, search parties were sent out and their bodies were found, some with massive internal injuries but with no external marks on them. The autopsy stated the violent injuries were caused by 'an unknown compelling force'. The area was sealed off for years by the authorities and the deaths and events of that night remain unexplained. Benefitting from original research carried out in Russia, this book attempts to explain what happened to the nine skiers who lost their lives on the 'Mountain of the Dead', in what has come to be known as the 'Dyatlov Pass Incident'. ...The Dyatlov Pass Incident (2013) ( Devil's Pass )\"]\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.51 x 6.69 x 0.79 inches; 3.74 Ounces', 'Director': 'Renny Harlin', 'Media Format': 'Import', 'Run time': '96 minutes', 'Release date': 'September 3, 2013', 'Actors': 'Gemma Atkinson, Matt Stokoe, Richard Reid, Holly Goss, Luke Albright', 'Producers': \"The Dyatlov Pass Incident (2013) ( Devil's Pass ), The Dyatlov Pass Incident (2013), Devil's Pass\", 'Language': 'English (Dolby Digital 2.0)', 'Studio': 'IMPORTS', 'Country of Origin': 'United Kingdom', 'Number of discs': '1'}\nWhile I didn't expect much, this was really pretty well done. I watched it with my 15-25 kids and they also enjoyed it. You get a sense of the actual events and the story built around it fictional, but not completely incredible.\nWorth a watch\nSafe House [Blu-ray]\nDenzel Washington  (Actor),     Ryan Reynolds  (Actor),     Daniel Espinosa  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Tobin Frost (Oscar winner Denzel Washington), one of the CIA’s most dangerous traitors, resurfaces in South Africa after eluding capture for almost a decade. During his interrogation, the safe house he’s being held in is attacked by brutal mercenaries forcing rookie agent, Matt Weston (Ryan Reynolds) to take the infamous Frost on the run. As the masterful manipulator toys with his reluctant protégé, shaking the young operative’s morality and idealism, the unlikely allies must fight to stay alive long enough to uncover who wants them both dead. Packed with intense action and thrilling suspense, Safe House takes you on a deadly ride through a covert world where no one and no place is ever safe.NOTE:Expiration date of the digital copy is extended till 5/2/2016.Even-though item states UltraViolet Digital Copy expires on 10/27/12.']\n{'Genre': 'DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Ultraviolet, Color, Widescreen', 'Contributor': 'Daniel Espinosa, Denzel Washington, Ryan Reynolds', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), Spanish (DTS 5.1), French Canadian (DTS 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '3 hours and 50 minutes', 'Digital Copy Expiration Date': 'May 2, 2016', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 2.4 Ounces', 'Item model number': '25192124716', 'Director': 'Daniel Espinosa', 'Media Format': 'Multiple Formats, Blu-ray, Ultraviolet, Color, Widescreen', 'Run time': '3 hours and 50 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Denzel Washington, Ryan Reynolds', 'Subtitles': 'English, French, Spanish', 'Studio': 'Universal', 'Number of discs': '2'}\nAlthough I am a fan of nearly all of Denzel's work, this was a well done movie that didn't go overboard with language, sex and gratuitous violence. It is not a kids movie but not something you are embarrassed to watch with a teenager.\nAlthough I am a fan of nearly all of Denzel's ...",
  "profile": "**Updated User Profile Summary:**\n\n- **Favorite Genres:** Enjoys comedy, particularly family-friendly content suitable for teenagers, and genre-blending films with humor and suspense, including horror-comedy and thrillers.\n- **Actor Preferences:** Strongly favors Kevin James and Vince Vaughn, with a growing interest in more serious performances by Denzel Washington and Ryan Reynolds, reflecting an openness to diverse roles.\n- **Director Appreciation:** Interested in films by Ron Howard and John Carpenter, with a curiosity towards Renny Harlin and Daniel Espinosa, indicating a willingness to explore various storytelling styles.\n- **Viewing Experience:** Values engaging storylines that balance suspense and humor, and enjoys films that facilitate family discussions while being entertaining and thought-provoking.\n- **Film Characteristics:** Prefers relatable dilemmas featuring comedic and suspenseful themes. Enjoys bonus content like deleted scenes and behind-the-scenes features to enhance the viewing experience.\n- **Social Viewing:** Likely enjoys movie nights with family, favoring lighthearted films but receptive to intense themes when coupled with humor or intriguing narratives.\n- **Overall Sentiment:** Maintains a generally positive outlook towards films, with high ratings reflecting satisfaction, even for content that isn’t strictly family-friendly, as long as it maintains a reasonable level of appropriateness. Recently expressed a fondness for action films that avoid excessive graphic content, making them suitable for teenage viewing.",
  "metrics": {
    "rouge1_f": 0.11632653061224489,
    "rouge2_f": 0.015321756894790602,
    "rougeL_f": 0.05306122448979592,
    "meteor": 0.034581919037550736,
    "bleu1": 0.00013320685240182062,
    "bleu2": 5.279790157096531e-05,
    "bleu3": 2.1369782659139614e-05,
    "bleu4": 5.81454699002713e-06,
    "bertscore_precision": 0.36086487770080566,
    "bertscore_recall": 0.49895352125167847,
    "bertscore_f1": 0.4188205301761627
  }
}