{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hair model tripod aluminum white adjustable mannequin head tripod with travel bag{The mannequin head is not included.}\nReview Date: 2019/11/08\nStore: zyqing\nProduct Description: ['A tripod stand A black bag With packaging The mannequin head is not included. Teaching head bracket wig bracket, aluminum white bracket with travel bag, aluminum alloy, aluminum white, light weight suitable for most training heads, with suitcase, easy for hairdressers and professionals to practice cutting, weaving and inlaying.  Wig model head tripod, hair training head with handbag, suitable for beauty students or anyone practicing hair cutting, weaving, hair cutting practice handbag, easy to carry, very suitable for students, hairdressers, salons, home users, etc.  1. Barber stand bracket with tripod legs, non-slip sleeves, retractable legs.  2. Rotatable head, adjustable rod, adjustable height, can meet your needs.  3. With a bag, easy to carry.  4. Sturdy and durable, tripod legs, higher stability.  5. Suitable for beauty students or anyone practicing cutting, weaving, inlaying 6. Very suitable for salon and family use.  Made of metal aluminum, light and beautiful.  Conical design, stable and easy to fold and unfold.  Comes with a bag for easy collection and carrying.  This tripod stand is designed to help you practice and improve your hairdressing skills.  You can rotate the wig model and adjust the height as needed.  Color:  Aluminum white Folding height:  About 60 cm (with ball head) Unfolded feet: minimum height: about 75 cm (with ball head) Maximum height:  Approximately 135 cm (with ball head) Item weight: approximately 1 kg']\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '27.3 x 4 x 4 inches; 3.59 Pounds', 'UPC': '674862295029', 'Manufacturer': 'zyqing'}\nReview Text: Very nice easy to work with\nReview Title: Knows\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Brazilian Virgin Hair 3 Bundles with Closure Brazilian Body Wave 8A 100% Unprocessed Human Hair bundles With Lace Closure Natural Black Color brazilian hair (12\" 14\" 16\"+10\"closure, Free Part)\nFree Queen\n{'Brand': 'Free Queen', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Installation Type': 'weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.02 x 7.01 x 5 inches; 12 Ounces', 'Manufacturer': 'Free Queen'}\nMy wife loved this hair. she made a very beautiful wig and even bleached her bundles. it came out very nice\nMy wife loved this hair\nHair model tripod aluminum white adjustable mannequin head tripod with travel bag{The mannequin head is not included.}\nzyqing\n['A tripod stand A black bag With packaging The mannequin head is not included. Teaching head bracket wig bracket, aluminum white bracket with travel bag, aluminum alloy, aluminum white, light weight suitable for most training heads, with suitcase, easy for hairdressers and professionals to practice cutting, weaving and inlaying.  Wig model head tripod, hair training head with handbag, suitable for beauty students or anyone practicing hair cutting, weaving, hair cutting practice handbag, easy to carry, very suitable for students, hairdressers, salons, home users, etc.  1. Barber stand bracket with tripod legs, non-slip sleeves, retractable legs.  2. Rotatable head, adjustable rod, adjustable height, can meet your needs.  3. With a bag, easy to carry.  4. Sturdy and durable, tripod legs, higher stability.  5. Suitable for beauty students or anyone practicing cutting, weaving, inlaying 6. Very suitable for salon and family use.  Made of metal aluminum, light and beautiful.  Conical design, stable and easy to fold and unfold.  Comes with a bag for easy collection and carrying.  This tripod stand is designed to help you practice and improve your hairdressing skills.  You can rotate the wig model and adjust the height as needed.  Color:  Aluminum white Folding height:  About 60 cm (with ball head) Unfolded feet: minimum height: about 75 cm (with ball head) Maximum height:  Approximately 135 cm (with ball head) Item weight: approximately 1 kg']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '27.3 x 4 x 4 inches; 3.59 Pounds', 'UPC': '674862295029', 'Manufacturer': 'zyqing'}\nVery nice easy to work with\nKnows",
  "profile": "The user maintains a strong preference for high-quality, unprocessed hair products that allow for styling and customization, particularly valuing Brazilian virgin hair for its versatility in creating various hairstyles, including wigs. Their interest in body wave textures reflects a desire for natural appearance and manageable options. The user's recent purchase of a professional tool for practicing hairdressing skills indicates a commitment to enhancing their creative hair styling abilities and suggests they may pursue hair-related activities more seriously, whether for personal use or to assist others, such as students or family members.\n\nThis purchase reinforces the user's inclination toward products that cater to both aesthetic outcomes and practical applications in hair care and styling. The positive feedback on their recent acquisition underscores their satisfaction with high-quality items that additionally support their creative endeavors. Overall, the user values quality, versatility, and functionality in their hair products, combining both personal enjoyment and community-oriented experiences in their interactions.",
  "metrics": {
    "rouge1_f": 0.20532319391634982,
    "rouge2_f": 0.019083969465648856,
    "rougeL_f": 0.10266159695817491,
    "meteor": 0.09408646816751391,
    "bleu1": 0.050405403618088686,
    "bleu2": 0.011700847120772571,
    "bleu3": 0.0023188769048260657,
    "bleu4": 0.0010338374163249495,
    "bertscore_precision": 0.3364941477775574,
    "bertscore_recall": 0.41589581966400146,
    "bertscore_f1": 0.37200525403022766
  }
}