{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: AuokMar 18 20 22 Inch Curly Hair Extensions Real Human Hair Jerry Curl Hair Weave Hair Extensions Double Weft Unprocessed Remy Hair Curly Brazilian Hair Bundles For Women 18 20 22 Inch\nReview Date: 2021/08/31\nStore: AuokMar\nAverage Rating: 3.4\nProduct Details: {'Brand': 'AuokMar', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Sew-In', 'Package Dimensions': '15.27 x 11.89 x 2.68 inches; 13.44 Ounces', 'UPC': '679265455285'}\nReview Text: Receive bundles promptly on time three bundles 18 20 and  22 And guess what they were not human I had to return\nReview Title: Not human\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Brazilian Virgin Hair 3 Bundles with Closure Brazilian Body Wave 8A 100% Unprocessed Human Hair bundles With Lace Closure Natural Black Color brazilian hair (12\" 14\" 16\"+10\"closure, Free Part)\nFree Queen\n{'Brand': 'Free Queen', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Installation Type': 'weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.02 x 7.01 x 5 inches; 12 Ounces', 'Manufacturer': 'Free Queen'}\nMy wife loved this hair. she made a very beautiful wig and even bleached her bundles. it came out very nice\nMy wife loved this hair\nHair model tripod aluminum white adjustable mannequin head tripod with travel bag{The mannequin head is not included.}\nzyqing\n['A tripod stand A black bag With packaging The mannequin head is not included. Teaching head bracket wig bracket, aluminum white bracket with travel bag, aluminum alloy, aluminum white, light weight suitable for most training heads, with suitcase, easy for hairdressers and professionals to practice cutting, weaving and inlaying.  Wig model head tripod, hair training head with handbag, suitable for beauty students or anyone practicing hair cutting, weaving, hair cutting practice handbag, easy to carry, very suitable for students, hairdressers, salons, home users, etc.  1. Barber stand bracket with tripod legs, non-slip sleeves, retractable legs.  2. Rotatable head, adjustable rod, adjustable height, can meet your needs.  3. With a bag, easy to carry.  4. Sturdy and durable, tripod legs, higher stability.  5. Suitable for beauty students or anyone practicing cutting, weaving, inlaying 6. Very suitable for salon and family use.  Made of metal aluminum, light and beautiful.  Conical design, stable and easy to fold and unfold.  Comes with a bag for easy collection and carrying.  This tripod stand is designed to help you practice and improve your hairdressing skills.  You can rotate the wig model and adjust the height as needed.  Color:  Aluminum white Folding height:  About 60 cm (with ball head) Unfolded feet: minimum height: about 75 cm (with ball head) Maximum height:  Approximately 135 cm (with ball head) Item weight: approximately 1 kg']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '27.3 x 4 x 4 inches; 3.59 Pounds', 'UPC': '674862295029', 'Manufacturer': 'zyqing'}\nVery nice easy to work with\nKnows\nOUTRE TIMELESS PINEAPPLE PONY - SWEETIE #S1B/30\nOutre\n['Outre Synthetic Hair Ponytail Timeless Pineapple Ponytail Sweetie', 'TIMELESS PINEAPPLE PONYTAIL', \"Pick your curl pattern and get an instant curly updo with timeless Ponytail's Pineapple Drawstring. These curly puffs feature gorgeous curls that fall down your forehead for an effortlessly tousled look. Innovatively designed with a clip to attach to the front of your hairline, and a drawstring to attach to your hair, Timeless Ponytail's Pineapple Drawstring was made for the stylish woman on-the-go.\", 'HOW TO WEAR', 'Brush your hair back into a high bun.', 'Brush your hair back into a high bun.', 'Attach the piece to your own bun, and pull the drawstring so that it is securely fastened.', 'Attach the piece to your own bun, and pull the drawstring so that it is securely fastened.', 'Extend the front of the piece forward and clip it just behind your hairline, so that the curls fall loosely down your forehead.', 'Extend the front of the piece forward and clip it just behind your hairline, so that the curls fall loosely down your forehead.', 'Fluff the curls, and go!', 'Fluff the curls, and go!', 'Tip:For a more voluminous look, pull your hair up into an even higher bun.', 'Tip:For a more voluminous look, pull your hair up into an even higher bun.']\n{'Color': '1', 'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'Outre', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.75 x 6 x 2.75 inches; 5.6 Ounces', 'UPC': '827298792468', 'Manufacturer': 'OUTRE'}\nI had to send this product back received it all fuzzy Did not look anything as advertised\nReturn to Vendor\nBrazilian Remy Virgin Curly Hair Free Part Lace Closure 4\"x4\" Size Natural Color (18inch) By Leticia\nLeticia\n{'Brand': 'Leticia', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Package Dimensions': '10.39 x 7.72 x 1.06 inches; 2.4 Ounces', 'UPC': '681413986817'}\nnice and long\npretty curl pattern and full!!\nOmbre Bundles with Closure Body Wave 3 Bundles Brazilian Virgin Human Hair Bundles with 4X4 Lace Closure Free Part (10 12 14 + 10 lace closure free part)\nKaisheng\n{'Brand': 'Kaisheng', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Package Dimensions': '12.72 x 9.72 x 2.09 inches; 11.82 Ounces', 'UPC': '779296907064'}\npoor job on coloring bundles color is very uneven and the closure did not blend well period!!  Ugly and uneven color. I should’ve returned But you never see how discolored it will be until work was constructed\ncolor is very uneven\nSpring Twist Hair 6packs/lot Synthetic Crochet Braids Hair 24 Strands/Pack Pre Stretched Ombre Brown Passion Braiding Hair Extensions For Women (T30)\nTOZIKA\n{'Brand': 'TOZIKA', 'Material': 'Human Hair', 'Extension Length': '12 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '13.19 x 11.18 x 2.56 inches; 14.43 Ounces', 'UPC': '610895136892'}\nI am in love with this style these miniature twisty locks turned out so beautiful. Not only were they easy to install they were tangle free. Also filled in very well.  I created this style myself using my latch hook yes I love them highly recommend you try them. They are very light weight doesn’t even feel like I have anything in my head.\nTurned out so beautiful\nAuokMar 18 20 22 Inch Curly Hair Extensions Real Human Hair Jerry Curl Hair Weave Hair Extensions Double Weft Unprocessed Remy Hair Curly Brazilian Hair Bundles For Women 18 20 22 Inch\nAuokMar\n{'Brand': 'AuokMar', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Sew-In', 'Package Dimensions': '15.27 x 11.89 x 2.68 inches; 13.44 Ounces', 'UPC': '679265455285'}\nReceive bundles promptly on time three bundles 18 20 and  22 And guess what they were not human I had to return\nNot human",
  "profile": "The user remains committed to prioritizing high-quality, unprocessed hair products that support versatile styling, particularly favoring adaptable textures such as body wave and curly styles. Despite their recent positive experience with a premium curly product, their latest purchase of human hair extensions resulted in disappointment when the product did not meet their expectations, leading to a return. This incident underscores the user’s discerning nature and high standards regarding product authenticity and quality.\n\nTheir interest in experimenting with different styles continues to grow, enhanced by previous positive experiences with synthetic extensions that offered ease of installation and aesthetic appeal. The preference for lightweight and tangle-free options remains consistent, reflecting their desire for manageable and visually striking hair solutions.\n\nAdditionally, the user adopts a proactive approach to hairdressing, evident through their investment in professional tools to enhance their skills. Overall, their preferences are focused on quality, versatility, and functionality in hair care and styling, emphasizing the importance of consistent product performance. This latest negative review highlights the user’s selectiveness in future purchases as they navigate their hair journey, seeking only the best options to achieve their desired looks.",
  "metrics": {
    "rouge1_f": 0.1391450125733445,
    "rouge2_f": 0.011754827875734676,
    "rougeL_f": 0.06202849958088851,
    "meteor": 0.04846121781870069,
    "bleu1": 0.0019900022020573104,
    "bleu2": 0.0004866654287925476,
    "bleu3": 8.274158023219633e-05,
    "bleu4": 3.415790340379094e-05,
    "bertscore_precision": 0.312611848115921,
    "bertscore_recall": 0.4262424409389496,
    "bertscore_f1": 0.36068934202194214
  }
}