{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ombre Bundles with Closure Body Wave 3 Bundles Brazilian Virgin Human Hair Bundles with 4X4 Lace Closure Free Part (10 12 14 + 10 lace closure free part)\nReview Date: 2021/07/03\nStore: Kaisheng\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Kaisheng', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Package Dimensions': '12.72 x 9.72 x 2.09 inches; 11.82 Ounces', 'UPC': '779296907064'}\nReview Text: poor job on coloring bundles color is very uneven and the closure did not blend well period!!  Ugly and uneven color. I should’ve returned But you never see how discolored it will be until work was constructed\nReview Title: color is very uneven\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Brazilian Virgin Hair 3 Bundles with Closure Brazilian Body Wave 8A 100% Unprocessed Human Hair bundles With Lace Closure Natural Black Color brazilian hair (12\" 14\" 16\"+10\"closure, Free Part)\nFree Queen\n{'Brand': 'Free Queen', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Installation Type': 'weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.02 x 7.01 x 5 inches; 12 Ounces', 'Manufacturer': 'Free Queen'}\nMy wife loved this hair. she made a very beautiful wig and even bleached her bundles. it came out very nice\nMy wife loved this hair\nHair model tripod aluminum white adjustable mannequin head tripod with travel bag{The mannequin head is not included.}\nzyqing\n['A tripod stand A black bag With packaging The mannequin head is not included. Teaching head bracket wig bracket, aluminum white bracket with travel bag, aluminum alloy, aluminum white, light weight suitable for most training heads, with suitcase, easy for hairdressers and professionals to practice cutting, weaving and inlaying.  Wig model head tripod, hair training head with handbag, suitable for beauty students or anyone practicing hair cutting, weaving, hair cutting practice handbag, easy to carry, very suitable for students, hairdressers, salons, home users, etc.  1. Barber stand bracket with tripod legs, non-slip sleeves, retractable legs.  2. Rotatable head, adjustable rod, adjustable height, can meet your needs.  3. With a bag, easy to carry.  4. Sturdy and durable, tripod legs, higher stability.  5. Suitable for beauty students or anyone practicing cutting, weaving, inlaying 6. Very suitable for salon and family use.  Made of metal aluminum, light and beautiful.  Conical design, stable and easy to fold and unfold.  Comes with a bag for easy collection and carrying.  This tripod stand is designed to help you practice and improve your hairdressing skills.  You can rotate the wig model and adjust the height as needed.  Color:  Aluminum white Folding height:  About 60 cm (with ball head) Unfolded feet: minimum height: about 75 cm (with ball head) Maximum height:  Approximately 135 cm (with ball head) Item weight: approximately 1 kg']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '27.3 x 4 x 4 inches; 3.59 Pounds', 'UPC': '674862295029', 'Manufacturer': 'zyqing'}\nVery nice easy to work with\nKnows\nOUTRE TIMELESS PINEAPPLE PONY - SWEETIE #S1B/30\nOutre\n['Outre Synthetic Hair Ponytail Timeless Pineapple Ponytail Sweetie', 'TIMELESS PINEAPPLE PONYTAIL', \"Pick your curl pattern and get an instant curly updo with timeless Ponytail's Pineapple Drawstring. These curly puffs feature gorgeous curls that fall down your forehead for an effortlessly tousled look. Innovatively designed with a clip to attach to the front of your hairline, and a drawstring to attach to your hair, Timeless Ponytail's Pineapple Drawstring was made for the stylish woman on-the-go.\", 'HOW TO WEAR', 'Brush your hair back into a high bun.', 'Brush your hair back into a high bun.', 'Attach the piece to your own bun, and pull the drawstring so that it is securely fastened.', 'Attach the piece to your own bun, and pull the drawstring so that it is securely fastened.', 'Extend the front of the piece forward and clip it just behind your hairline, so that the curls fall loosely down your forehead.', 'Extend the front of the piece forward and clip it just behind your hairline, so that the curls fall loosely down your forehead.', 'Fluff the curls, and go!', 'Fluff the curls, and go!', 'Tip:For a more voluminous look, pull your hair up into an even higher bun.', 'Tip:For a more voluminous look, pull your hair up into an even higher bun.']\n{'Color': '1', 'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'Outre', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.75 x 6 x 2.75 inches; 5.6 Ounces', 'UPC': '827298792468', 'Manufacturer': 'OUTRE'}\nI had to send this product back received it all fuzzy Did not look anything as advertised\nReturn to Vendor\nBrazilian Remy Virgin Curly Hair Free Part Lace Closure 4\"x4\" Size Natural Color (18inch) By Leticia\nLeticia\n{'Brand': 'Leticia', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Package Dimensions': '10.39 x 7.72 x 1.06 inches; 2.4 Ounces', 'UPC': '681413986817'}\nnice and long\npretty curl pattern and full!!\nOmbre Bundles with Closure Body Wave 3 Bundles Brazilian Virgin Human Hair Bundles with 4X4 Lace Closure Free Part (10 12 14 + 10 lace closure free part)\nKaisheng\n{'Brand': 'Kaisheng', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Package Dimensions': '12.72 x 9.72 x 2.09 inches; 11.82 Ounces', 'UPC': '779296907064'}\npoor job on coloring bundles color is very uneven and the closure did not blend well period!!  Ugly and uneven color. I should’ve returned But you never see how discolored it will be until work was constructed\ncolor is very uneven",
  "profile": "The user continues to demonstrate a strong preference for high-quality, unprocessed hair products that enable versatile styling and customization, particularly favoring Brazilian virgin hair for its adaptability in creating various hairstyles, including wigs. Their desire for natural aesthetics is highlighted by interest in both body wave and curly textures, indicating a pursuit of manageable and visually appealing options. \n\nRecently, the user expressed satisfaction with a premium curly hair product, reinforcing their commitment to obtaining high-standard items. However, this positive experience contrasts sharply with their latest purchase, which revealed dissatisfaction due to poor color quality and blending issues, leading to a negative evaluation. This incident emphasizes the user's ongoing focus on quality and performance, as they seek products that meet or exceed expectations.\n\nTheir proactive approach to hairdressing is showcased through the acquisition of professional tools aimed at improving their skills. The user's preferences center on quality, versatility, and functionality, as they merge personal enjoyment with a dedication to high standards in hair care and styling. This recent disappointment illustrates the importance they place on consistent quality, making them more discerning in future purchases, especially as they navigate their hair journey.",
  "metrics": {
    "rouge1_f": 0.15587044534412955,
    "rouge2_f": 0.012170385395537527,
    "rougeL_f": 0.0708502024291498,
    "meteor": 0.061568678492995965,
    "bleu1": 0.007338739964856234,
    "bleu2": 0.00180542644202136,
    "bleu3": 0.0003075534622414845,
    "bleu4": 0.00012708724549056859,
    "bertscore_precision": 0.32720068097114563,
    "bertscore_recall": 0.4227481484413147,
    "bertscore_f1": 0.3688877820968628
  }
}