{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Brazilian Remy Virgin Curly Hair Free Part Lace Closure 4\"x4\" Size Natural Color (18inch) By Leticia\nReview Date: 2020/08/12\nStore: Leticia\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Leticia', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Package Dimensions': '10.39 x 7.72 x 1.06 inches; 2.4 Ounces', 'UPC': '681413986817'}\nReview Text: nice and long\nReview Title: pretty curl pattern and full!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Brazilian Virgin Hair 3 Bundles with Closure Brazilian Body Wave 8A 100% Unprocessed Human Hair bundles With Lace Closure Natural Black Color brazilian hair (12\" 14\" 16\"+10\"closure, Free Part)\nFree Queen\n{'Brand': 'Free Queen', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Installation Type': 'weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.02 x 7.01 x 5 inches; 12 Ounces', 'Manufacturer': 'Free Queen'}\nMy wife loved this hair. she made a very beautiful wig and even bleached her bundles. it came out very nice\nMy wife loved this hair\nHair model tripod aluminum white adjustable mannequin head tripod with travel bag{The mannequin head is not included.}\nzyqing\n['A tripod stand A black bag With packaging The mannequin head is not included. Teaching head bracket wig bracket, aluminum white bracket with travel bag, aluminum alloy, aluminum white, light weight suitable for most training heads, with suitcase, easy for hairdressers and professionals to practice cutting, weaving and inlaying.  Wig model head tripod, hair training head with handbag, suitable for beauty students or anyone practicing hair cutting, weaving, hair cutting practice handbag, easy to carry, very suitable for students, hairdressers, salons, home users, etc.  1. Barber stand bracket with tripod legs, non-slip sleeves, retractable legs.  2. Rotatable head, adjustable rod, adjustable height, can meet your needs.  3. With a bag, easy to carry.  4. Sturdy and durable, tripod legs, higher stability.  5. Suitable for beauty students or anyone practicing cutting, weaving, inlaying 6. Very suitable for salon and family use.  Made of metal aluminum, light and beautiful.  Conical design, stable and easy to fold and unfold.  Comes with a bag for easy collection and carrying.  This tripod stand is designed to help you practice and improve your hairdressing skills.  You can rotate the wig model and adjust the height as needed.  Color:  Aluminum white Folding height:  About 60 cm (with ball head) Unfolded feet: minimum height: about 75 cm (with ball head) Maximum height:  Approximately 135 cm (with ball head) Item weight: approximately 1 kg']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '27.3 x 4 x 4 inches; 3.59 Pounds', 'UPC': '674862295029', 'Manufacturer': 'zyqing'}\nVery nice easy to work with\nKnows\nOUTRE TIMELESS PINEAPPLE PONY - SWEETIE #S1B/30\nOutre\n['Outre Synthetic Hair Ponytail Timeless Pineapple Ponytail Sweetie', 'TIMELESS PINEAPPLE PONYTAIL', \"Pick your curl pattern and get an instant curly updo with timeless Ponytail's Pineapple Drawstring. These curly puffs feature gorgeous curls that fall down your forehead for an effortlessly tousled look. Innovatively designed with a clip to attach to the front of your hairline, and a drawstring to attach to your hair, Timeless Ponytail's Pineapple Drawstring was made for the stylish woman on-the-go.\", 'HOW TO WEAR', 'Brush your hair back into a high bun.', 'Brush your hair back into a high bun.', 'Attach the piece to your own bun, and pull the drawstring so that it is securely fastened.', 'Attach the piece to your own bun, and pull the drawstring so that it is securely fastened.', 'Extend the front of the piece forward and clip it just behind your hairline, so that the curls fall loosely down your forehead.', 'Extend the front of the piece forward and clip it just behind your hairline, so that the curls fall loosely down your forehead.', 'Fluff the curls, and go!', 'Fluff the curls, and go!', 'Tip:For a more voluminous look, pull your hair up into an even higher bun.', 'Tip:For a more voluminous look, pull your hair up into an even higher bun.']\n{'Color': '1', 'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'Outre', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.75 x 6 x 2.75 inches; 5.6 Ounces', 'UPC': '827298792468', 'Manufacturer': 'OUTRE'}\nI had to send this product back received it all fuzzy Did not look anything as advertised\nReturn to Vendor\nBrazilian Remy Virgin Curly Hair Free Part Lace Closure 4\"x4\" Size Natural Color (18inch) By Leticia\nLeticia\n{'Brand': 'Leticia', 'Material': 'Human Hair', 'Hair Type': 'Curly', 'Package Dimensions': '10.39 x 7.72 x 1.06 inches; 2.4 Ounces', 'UPC': '681413986817'}\nnice and long\npretty curl pattern and full!!",
  "profile": "The user demonstrates a strong preference for high-quality, unprocessed hair products that facilitate styling and customization, with a particular affinity for Brazilian virgin hair, which allows for versatility in creating various hairstyles, particularly wigs. Their interest in body wave textures and now curly options reflects a desire for natural aesthetics and manageable choices. Recently, the user made a new purchase of a premium quality curly hair product, expressing satisfaction with its length and fullness, which reinforces their commitment to obtaining high-standard items for hairstyling.\n\nThis recent positive experience contrasts with a prior disappointment related to a synthetic product, emphasizing the user's ongoing focus on quality and performance. They value products that not only meet but exceed expectations, demonstrating a keen eye for items that deliver on their promises and enhance both personal styling skills and community-oriented engagements. The user's proactive approach is further highlighted by their acquisition of a professional tool aimed at honing their hairdressing skills, indicating a serious commitment to hair-related activities. Overall, their preferences center on quality, versatility, and functionality, as they merge personal enjoyment with a dedication to high standards in hair care and styling.",
  "metrics": {
    "rouge1_f": 0.17547806524184478,
    "rouge2_f": 0.02254791431792559,
    "rougeL_f": 0.08548931383577055,
    "meteor": 0.06773747668531842,
    "bleu1": 0.012679135667018109,
    "bleu2": 0.003994099095293399,
    "bleu3": 0.0006317127210070636,
    "bleu4": 0.0002515291180792671,
    "bertscore_precision": 0.3252730369567871,
    "bertscore_recall": 0.4208841919898987,
    "bertscore_f1": 0.36695289611816406
  }
}