{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: About Me Skin Tone Up Massage Cream, 150ml\nReview Date: 2021/05/16\nStore: ABOUT ME\nAverage Rating: 4.0\nProduct Details: {'Brand': 'ABOUT ME', 'Scent': 'Unscented', 'Item Form': 'Lotion', 'Material Feature': 'Natural', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 3 x 2.5 inches; 8 Ounces', 'Item model number': 'about01-c', 'UPC': '794866404903 787461313244', 'Manufacturer': 'About Me'}\nReview Text: I like the massage aspect of using this cleanser. I feel like it might help with the lymphatic system or just circulation in general, though I’m not sure exactly how it works...just that it feels good. :) I use it as sort of a deep cleaning to get rid of any SPF or makeup residue. I really like how soft and supple my skin feels after using it. It’s a nice treat for weekly or biweekly pampering, but a bit too labor intensive for my everyday use. I am also not always keen on an additional cleanse. I’d be more likely to use this as a first cleanse, but I use it on skin that’s already clean, per the instructions.\nReview Title: Nice, but a lot of work...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "b.m.c by Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-CYO 2 Collection\nHealthMarket\n['Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-2014 CYO Collection']\n{'Product Dimensions': '2.2 x 2.2 x 0.1 inches; 2.4 Ounces', 'UPC': '701233192271', 'Manufacturer': 'HealthMarket'}\nAmazing images that stamp very well. My only complaint and the reason for taking off a star is that some of the images are too small for longer nails. I'm not yet good enough at stamping to &#34;stretch&#34; the images yet, but I plan to learn.\nEtched well, but I wish images were larger.\nPlant Therapy Himalayan Pink Salt. Fine Grain, Rich in Nutrients and Minerals To Improve Your Health. 1 pound (454 grams).\nPlant Therapy\n['Our All Natural Pink Himalayan Salt is perfect for body care products as well as for cooking. It tastes great and is full of minerals including magnesium, calcium, potassium, and iron, which makes it great for your skin too! Well known for its amazing health benefits, our All Natural Pink Himalayan Salt is the highest quality, food grade, Himalayan Salt available! Whether you use it in cooking to season meats and veggies or used in soups, or you use it in your DIY body care products, our Himalayan Salt is the perfect choice!']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.25 x 4 x 8 inches; 14.39 Ounces', 'UPC': '680912016056', 'Manufacturer': 'Plant Therapy Inc'}\nI like that this salt contains additional minerals and other nutrients I need. About ten years ago, I stopped using salt at the table. Because of a family history of hypertension, I wanted to start lowering my sodium intake, and just start a few healthier eating habits, in general. I used to sit at the table and sprinkle salt on my food before I'd even tasted it, and I just thought it was a terribly unhealthy habit and that it was time for a change. I'm not sure of all its health benefits of this pink Himalayan salt, or how significant they are, but I like the flavor. The kid in me loves the pretty pink color, and while I know, rationally, that it has no bearing on the flavor, I can't help but enjoy the way it looks in the shaker, with its grains of different shades. I tasted a bit upon opening the bag. To me, it doesn't have as strong a salty taste as regular table salt does, and it dissipates more rapidly on the tongue. In use with cooking, I also feel it's not as salty as my normal variety. It does a great job of allowing my other spices to do the work, and the seasoning blends I use can be better appreciated. I've also found that if I accidentally get a bit heavy-handed with this salt, it's more forgiving, since it's not as salty. Overall, I'm enjoying the way it looks and tastes, and my next experiment will be making my own body scrub. I was able to purchase this Himalayan pink salt at a discounted rate in exchange for my evaluation and unbiased review.\nA tasty alternative to table salt...\nModern Mirror 92231 Dual-sided Led Illuminated Tabletop Makeup Silver Mirror\nModern Mirror\n{'Brand': 'Modern Mirror', 'Room Type': 'Bathroom', 'Shape': 'Round', 'Product Dimensions': '7.2 x 4 x 11.5 inches; 15 Ounces', 'Mounting Type': 'Tabletop Mount', 'Is Discontinued By Manufacturer': 'No', 'UPC': '692014021838'}\nThis makeup mirror is very stylish. It's fairly compact and is very lightweight.  It doesn't have the shiny surface displayed in the picture, but is made of a metallic gray plastic. It would blend well with nearly any decor, and I like the way it looks with my stainless steel bathroom accessories.<br /><br />It has two mirrors; the first is a regular mirror, while the other side is a magnifying mirror. The magnifying effect is a really good one, and there is little to no distortion.<br /><br />It comes with the three AA batteries it requires, which is a plus. It also has an outlet for an AC adapter, which isn't included, but is something most households probably have lying around. It turns on and off by sliding the single switch on the mirror's base. The light it gives off is bright, and illuminates both the mirror and my face.<br /><br /> It seems everyone in my household has adopted this mirror as part of their morning ritual. My husband uses it for shaving, while my daughter and I use it for makeup and skin treatments. It's very nice and would be useful, not only in the bathroom, but on the bedroom dresser, as well.<br /><br />I received this mirror free in exchange for my evaluation and unbiased review. Any opinion I've expressed is purely mine and based on my own personal experience using this mirror.\nLightweight and compact...\nLiquid Latex Fashions - Clear Zombie Skin Makeup Body Paint for Adults and Kids, Ideal for School Plays, Parties, Theater, Cosplays and Carnivals- 4 Oz\nLiquid Latex Fashions\n{'Color': 'Clear', 'Brand': 'Liquid Latex Fashions', 'Item Weight': '4 Ounces', 'Item Form': 'Liquid', 'Package Information': 'Bottle', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 3 x 3 inches; 4 Ounces', 'Item model number': '010446a', 'UPC': '793379160191 811832010446', 'Manufacturer': 'Liquid Latex Fashions'}\nThis liquid latex is of good quality. I got it to use as a nail art barrier for stamping and gradients. It works well, and I appreciate the ammonia-free formula. This latex also has less of that fishy smell they latex has; it's there, but very faint.<br /><br />It goes on white, for easy application, and dries clear. It is sticky, but a little cuticle oil or cornstarch helps, if it's a bother. I didn't find it so sticky it was unmanageable, I just exercised a little care.<br /><br />This latex works exactly as I need it to for stamping. It peels off cleanly, in a single piece. It doesn't peel up my stamping, and it makes cleanup minimal. I'm very happy with my purchase, and would recommend it.<br /><br />This latex was a personal purchase, made at the regular price listed at the time. I am not obligated to provide a review, but choose to do so.\nExcellent nail art barrier...\nInnoLife Nail Art Drill Treatments KIT Electric File Buffer Bits Acrylics 6 File Pedicure Hands & Nails Repair (110V US 1.5M Plug) - Pink\nInnolife\n['Product Description Electric Nail Art Pen Shape File Drilling Handpiece Machine 6 Optional Bits (5 diamond bits, 1 emery rod with 6 sanding bands) Electric Nail Art Drill Variable speed control: 3,000 RPM up to 20,000 RPM Handpiece can directly connected to electricity, easy to carry around!! Light-weight design for precise operation! Quiet and smooth Suitable for pedicure and manicure The nail file can be used for natural nails as well as artificial nails', 'Product high lights: 1.5M power cord (50% longer than regular cord) 1.Sutitable for professional use, Nail Salon, Makeup Studio or home use Size: 16cm(L) x 2.4cm(Diameter of handpiece) Voltage: 110V Plug Type: US Plug Operation Detail: Plug in the electric cord to the main electric outlet Select the desired speed by turning the variable speed control knob on the handpiece To secure the bits: push in the desired bit firmly into the hole To remove the bits: turn off the machine and gently pull the bit out', 'Safety rules: Always unplug the tool when you change accessory Do not use near or place in water. If motor falls into water, unplug immediately. Do not reach into water Do not touch the bit after use. The bit is too hot to be touched by bare hands Keep dust out of eyes and lungs by using protective eyewear or a dust mask Always unplug it after use When the machine is not is use, all tool must be stored in a dry location abd keep out of children']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 15 x 4 inches; 7.94 Ounces', 'UPC': '616929589696', 'Manufacturer': 'InnoLife'}\nFor me, this little nail drill works very well. It's touted as being good for beginners, but I was really nervous about using it for the first time, because it came with absolutely no instructions. Yikes! I'd cut my nails down to nubbins, and have been wearing falsies, so I figured it was a great way to get some practice.<br /><br />There are a few notes on the product listing about how to insert and remove the drill bits, so with that being all I had to go on, I just went for it.<br /><br />As I had no clue as to which bits were for what job, I had to wing it. I tried two. The first I tried wasn't quite coarse enough, so I went with the larger, barrel-shaped bit, which worked well for what I wanted. I'd basically put on some stiletto tips, and managed to jab every family member at least once. I didn't want to completely remove them, but I wanted to take them down a bit and round out the tips. Once I changed the bit this drill did a great job.<br /><br />It got a little warm, but didn't get too hot, and it didn't overheat and stop on me. In my photo is what they looked like right after I was done. I did go over the edges briefly with an emery board for the couple of rough spots left, simply because I'm not yet quite adept enough to get the perfect shaping I want, but practice is key.<br /><br />It's for the same reason that I haven't yet tried the drill on my natural nails. I will, though, once I get a little more know-how under my belt. So, in summary, I like it, and it seems to be beginner-friendly, but I wish there were detailed information available on its use.<br /><br />I received this nail drill free to try in exchange for my evaluation and unbiased review. Any opinion I've expressed is purely mine and based on my own personal experience using this drill.\nWorks well, but detailed instructions would have been helpful...\nBEST ROSE CLAY FACIAL WASH - - Includes Rose Clay the Trendy New ingredient used for fighting wrinkles and aging! - Handcrafted Face Wash Cleanser - Anti Aging Cleanser\n{'Item Form': 'Cream', 'Skin Type': 'All', 'Scent': 'Rose', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Package Dimensions': '7.8 x 2 x 1.9 inches; 9.6 Ounces', 'UPC': '780873595130'}\nI wasn't sure what to expect from this facial wash, when I got it. It's labeled a wash, but the instructions state that it is to be used after cleansing. For my sanity's sake, I just assumed it was mislabeled, and used it as a regular wash. It appears I was correct.<br /><br />It's clear, which is always nice, for me. I have eczema, and the more natural the ingredients, the better. I was concerned that this wash contains alcohol, but there must not be much, since my skin hasn't freaked out.<br /><br />This wash lathers quite nicely. It rinses off quickly and cleanly. Despite its oil content, it doesn't leave my skin feeling greasy. Despite the alcohol, I'm not left with any dryness or tightness. It leaves my skin feeling soft and smooth.<br /><br />What's most impressive is how long the softness lasts. It's been a hot summer, and I recently changed my regimen, so I only moisturize at night. In the morning, I just wash and go. The moisture in this wash is plenty, and my skin stays supple, with no flakiness. If your skin is sensitive to alcohol, I'd still recommend giving this wash a try; it seems to be a blend that works really well, with no irritation.<br /><br />I received a discount on this facial wash in exchange for my evaluation and unbiased review. Any opinion I've expressed is purely mine and based on my own personal experience using this cleanser.\nCleansing without dryness...\n19pc LA Girl Gel Glide Eyeliner Pencil set of 19 color #GP351-369\nL.A. Girl\n{'Brand': 'L.A. Girl', 'Item Form': 'Gel,Pencil', 'Finish Type': 'Shimmery', 'Special Feature': 'Travel size', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.5 x 5.1 x 0.6 inches; 3.99 Ounces', 'Item model number': 'GP', 'UPC': '787734416467 811901015839', 'Manufacturer': 'L.A. Girl'}\nI'm so happy I bought this eyeliner set. The colors are extremely vivid, and they pop, even on my darker skin. I'm a black eyeliner fanatic, and have been wanting to switch things up. I love the mix of colors, which includes average, everyday colors as well as colors appropriate for a night out. They aren't clumpy or runny, and they stay put nicely.<br /><br />The formula was a pleasant surprise. These pencils glide smoothly, even over eyeshadow and my waterline. The waterline is always a challenging area, because I tear up easily and often. I can create a sharp line or smudge it out, and either way, it wears extremely well. In one photo, I'm wearing black on the waterline and inner corner, and in the other, I'm wearing champagne on the waterline.<br /><br />I like that these liners each arrive sealed, but be aware that the plastic can be tough to get off, and also that the liners are extremely soft. I broke one unwrapping it, but luckily, they sharpen well, without constantly breaking. The quality, value, and variety of this set are excellent, overall...it's a win.\nGreat quality and selection...\nAbout Me Skin Tone Up Massage Cream, 150ml\nABOUT ME\n{'Brand': 'ABOUT ME', 'Scent': 'Unscented', 'Item Form': 'Lotion', 'Material Feature': 'Natural', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 3 x 2.5 inches; 8 Ounces', 'Item model number': 'about01-c', 'UPC': '794866404903 787461313244', 'Manufacturer': 'About Me'}\nI like the massage aspect of using this cleanser. I feel like it might help with the lymphatic system or just circulation in general, though I’m not sure exactly how it works...just that it feels good. :) I use it as sort of a deep cleaning to get rid of any SPF or makeup residue. I really like how soft and supple my skin feels after using it. It’s a nice treat for weekly or biweekly pampering, but a bit too labor intensive for my everyday use. I am also not always keen on an additional cleanse. I’d be more likely to use this as a first cleanse, but I use it on skin that’s already clean, per the instructions.\nNice, but a lot of work...",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Nice, but a lot of work...",
    "text": "I like the massage aspect of using this cleanser. I feel like it might help with the lymphatic system or just circulation in general, though I’m not sure exactly how it works...just that it feels good. :) I use it as sort of a deep cleaning to get rid of any SPF or makeup residue. I really like how soft and supple my skin feels after using it. It’s a nice treat for weekly or biweekly pampering, but a bit too labor intensive for my everyday use. I am also not always keen on an additional cleanse. I’d be more likely to use this as a first cleanse, but I use it on skin that’s already clean, per the instructions.",
    "images": [],
    "asin": "B00TE8JD8O",
    "parent_asin": "B00TE8JD8O",
    "user_id": "AEEO4SJ4MMZH2GD3NY56GLGO3VEA",
    "timestamp": "2021-05-16 16:10:41.809000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "About Me Skin Tone Up Massage Cream, 150ml",
    "average_rating": 4.0,
    "rating_number": 66,
    "features": [
      "Effective discharge of toxins and skin aging skin",
      "To create light and transparent skin",
      "Safe care: the use of natural materials and the safety of high-quality materials and no one can be assured",
      "Three non-care: does not include three components (parabens, artificial colors, artificial flavors",
      "Professional nursing"
    ],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/411DPI9+IXL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/411DPI9+IXL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/518b29VjNQL._SL1024_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/410hlGIWBaL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/410hlGIWBaL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/51lv6txv1sL._SL1024_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41QTzUQbeFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41QTzUQbeFL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61f+5EwaOfL._SL1024_.jpg"
      }
    ],
    "videos": [],
    "store": "ABOUT ME",
    "categories": [],
    "details": {
      "Brand": "ABOUT ME",
      "Scent": "Unscented",
      "Item Form": "Lotion",
      "Material Feature": "Natural",
      "Unit Count": "1 Count",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3 x 3 x 2.5 inches; 8 Ounces",
      "Item model number": "about01-c",
      "UPC": "794866404903 787461313244",
      "Manufacturer": "About Me"
    },
    "bought_together": null
  }
}