{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/06/05\nAverage Rating: 2.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Kevin Hicks'], 'Producers': ['Kevin Hicks', 'Brian Balog', 'Debbie Cady', 'Dan Griffin', 'Vickie Hicks', 'Juan Pablo Reinoso'], 'Studio': ['Unavailable']}\nReview Text: I should have looked closer, not just the title. This is the original movie, I wanted the remake, oh well :(\nReview Title: Wrong movie\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "The Dame Edna Experience - The Complete Collection (Series 1/2 & Specials)\nBarry Humphries  (Actor),     Emily Perry  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Ten hours of outright hilarity make up this 5-disc Ednathon,', 'The Dame Edna Experience: The Complete Collection', \". Every program from Dame Edna's hysterical and historical series plus over 4 hours of side-splitting extras make this collection a must-have for Edna's legion of die-hard fans!\"]\n{'Genre': 'Comedy', 'Format': 'Box set, Closed-captioned, Color, NTSC', 'Contributor': 'Robin Houston, Charlton Heston, Barry Humphries, Jeffrey Archer, Emily Perry', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.7 x 5.5 x 1.9 inches; 0.01 Ounces', 'Media Format': 'Box set, Closed-captioned, Color, NTSC', 'Run time': '10 hours and 4 minutes', 'Release date': 'October 5, 2004', 'Actors': 'Barry Humphries, Emily Perry, Robin Houston, Jeffrey Archer, Charlton Heston', 'Studio': 'BBC Worldwide', 'Number of discs': '5'}\nI saw her/him on Graham Norton a while ago. They did a repeat show and I just had to have more. Dame Edna reminds me of the humor we had years ago. She is so quick and witty. You won't be disappointed to get these collections - they are gold....\nWONDERFULLY HYSTERICAL !!!!!\n1408 (Two-Disc Collector's Edition)\nJohn Cusack  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['(Thriller) Based on a short story by Stephen King, a man who specializes in debunking the paranormal checks into the infamous room 1408 in the Dolphin Hotel, only to discover\\x85 the terror is real.']\n{'Genre': 'Thriller', 'Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Collector's Edition, Widescreen\", 'Contributor': 'John Cusack', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Media Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Collector's Edition, Widescreen\", 'Run time': '1 hour and 44 minutes', 'Release date': 'October 2, 2007', 'Actors': 'John Cusack', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '2'}\nWhat's not to like??? Another great Stephen King movie with great actors like John Cusack and Samuel L Jackson. Stephen's movies are always so fascinating, his plots rarely cease to amaze me. Always something different, he thinks outside of the box.\nLUV IT.....\nTCM Greatest Classic Films Collection: Comedy (Arsenic and Old Lace / A Night at the Opera / The Long Long Trailer / Father of the Bride 1950)\nCary Grant  (Actor),     Marx Brothers  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['TCM Greatest Classic Films: Comedy (4FE) (DVD)', 'ARSENIC AND OLD LACE Cary Grant and a stellar cast romp through this classic farce based on the Broadway hit and breezily directed by Frank Capra. A frazzled drama critic’s two maiden aunts put a secret ingredient in their elderberry wine – and the resulting circus is howlingly hilarious, with a comically rubber-faced, rubber-legged Grant in the center ring. A NIGHT AT THE OPERA Grand opera equals grand comedy as the Marx Brothers cram a ship’s stateroom and more with wall-to-wall gags, one-liners, musical riffs and two hard-boiled eggs – all while skewering pompous schemes to sabotage an opera production. “Arguably their finest film” (4 Star Rating! - Leonard Maltin’s Movie Guide). THE LONG, LONG TRAILER Anyone know how to park this thing? Lucille Ball and Desi Arnaz play newlyweds who hit the honeymoon road with a 40-foot house trailer in tow in this slaphappily-ever-after comedy directed by Vincente Minnelli. FATHER OF THE BRIDE (1950) Spencer Tracy is the father and Elizabeth Taylor the bride in this comic celebration of an American rite (and wrongs) of passage. Here comes the bride, there goes dad’s wallet…and everyone’s heart. What sparkling fun!', ']]>']\n{'Genre': 'Classics, Comedy', 'Format': 'Multiple Formats, Color, Full Screen, Black & White, Subtitled, NTSC', 'Contributor': 'Spencer Tracy, Marx Brothers, Cary Grant, Desi Arnaz, Elizabeth Taylor, Lucille Ball', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '6 hours and 46 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': '400649', 'Media Format': 'Multiple Formats, Color, Full Screen, Black & White, Subtitled, NTSC', 'Run time': '6 hours and 46 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Cary Grant, Marx Brothers, Lucille Ball, Desi Arnaz, Spencer Tracy', 'Subtitles': 'English, French', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nIt's nice to be able to get a copy of these oldies but goodies. They just don't make them like they used to.\nGreat old movies\n{'Subtitles': ['None available'], 'Directors': ['Kevin Hicks'], 'Producers': ['Kevin Hicks', 'Brian Balog', 'Debbie Cady', 'Dan Griffin', 'Vickie Hicks', 'Juan Pablo Reinoso'], 'Studio': ['Unavailable']}\nI should have looked closer, not just the title. This is the original movie, I wanted the remake, oh well :(\nWrong movie",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user has a strong affinity for classic comedy and values the wit of performances, alongside an appreciation for well-crafted thrillers, indicating a diverse taste in storytelling that spans various genres.\n- **Content Preference:** Enjoys collecting episodic series and box sets, with a specific interest in collector's editions that enhance the viewing experience, reflecting a commitment to quality content.\n- **Nostalgia Factor:** Finds joy in humor and narratives that evoke traditional comedic styles and significant cultural moments, showcasing a fondness for classic storylines.\n- **Engagement with Media:** Actively engages with physical media formats like DVDs and collector’s editions, indicating a preference for tangible collections that provide rich, immersive content.\n- **Rating Behavior:** The user typically rates content highly but has recently shown a tendency to provide lower ratings when expectations are unmet, as evidenced by a recent interaction where a significant discrepancy in content type led to disappointment, influencing a lower rating. This highlights a growing critical perspective toward media quality.\n- **Influences:** Influenced by performances on talk shows and the craftsmanship of actors, emphasizing a broad interest in acting across genres.\n- **Community Connection:** Appreciates communities of like-minded fans, often expressing nostalgia for the golden age of cinema while supporting diverse genres.\n\nOverall, the user values quality comedic content and engaging narratives but is becoming more discerning about the specific attributes of the media they choose to add to their collection.",
  "metrics": {
    "rouge1_f": 0.18065693430656934,
    "rouge2_f": 0.02010968921389397,
    "rougeL_f": 0.08394160583941605,
    "meteor": 0.06055249264648317,
    "bleu1": 0.014693824993579825,
    "bleu2": 0.0034853084545651124,
    "bleu3": 0.001188619755134214,
    "bleu4": 0.00039066772838924034,
    "bertscore_precision": 0.3530418276786804,
    "bertscore_recall": 0.44071435928344727,
    "bertscore_f1": 0.3920362591743469
  }
}