{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nReview Date: 2020/09/19\nStore: COSYMAY\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nReview Text: I'm glad I got this for free through the Vine program. The length on this hair is nice, but it's definitely thin like others have mentioned. And I'm not just talking about the bangs. The bangs are ridiculously thin — to the point where you would rather they hadn't given it bangs. It doesn't look at all like the product description photo. I have yet to color and layer this wig, but it would definitely be a backup option rather than a daily go to choice.\nReview Title: Cute but way too thin\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Gifts for Dad from Daughter Son, Unique Fathers Day Christmas Birthday Gift Ideas for Men Father Him, Cool Gadgets Stocking Stuffers for Men, 16 in 1 Stainless Steel Manicure Set (Zang Cyan)\natimier\n{'Brand': 'Atimier', 'Material': 'Stainless Steel', 'Blade Material': 'Stainless Steel', 'Target Audience': 'Men', 'Package Dimensions': '6.1 x 4.5 x 1.3 inches; 7.2 Ounces', 'UPC': '731889076519'}\nMy husband is ALWAYS trying to \"borrow\" pieces from my manicure kit. In particular, he always tries to take my cuticle nippers and nail clippers — and then doesn't put them back. So, then when I need them, I can't find them...not cool. So I'm giving him this as one of his many Christmas gifts because I'm tired of chasing him for my stuff. He'll say he doesn't need it...but he does!\nGreat essentials for guys\nJPNK 10PCS Makeup tool set, Blender Sponges& Air cushion puff&Sponge Holder for Blending Liquid, Cream or Flawless Powder Cosmetics\nJPNK\n{'Brand': 'JPNK', 'Skin Type': 'All', 'Recommended Uses For Product': 'Foundation,Concealer,Blender', 'Package Dimensions': '8.5 x 5.4 x 2.3 inches; 5.61 Ounces'}\nThese are great sponges. Sometimes when you buy knockoff versions of a Beauty Blender, they can be hard or don't work like you would expect. But these sponges are soft and work great wet or dry.\nGreat for blending and texture is soft\nshort bob human hair wigs lace front human hair wigs straight bob wigs natural color\naibasi\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Aibasi', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.8 x 6.8 x 3 inches; 11.99 Ounces', 'UPC': '733810686330'}\nI'm always nervous about ordering human hair wigs through Amazon because you never know what you're going to get but this one was nice. I've been thinking about cutting my actual hair into an angled bob but wanted to test run the length first. So I got this wig and I love how it looks. I also love that I was able to lightly bleach highlights into the wig and the hair took it easily. So the quality on this wig is great.\nGreat quality wig with very soft hair\nDyson Hair Dryer Wall Mount Holder, Aluminum Alloy Wall Bracket Holder for Dyson Supersonic Hair Dryer (Style 2)\nYeegfeycc\n{'Product Dimensions': '15.8 x 3.1 x 6.7 inches; 5.36 Pounds', 'UPC': '763231060839'}\nThis is a great piece to keep your Dyson accessories organized in one place. A great space saver.\nGreat to keep accessories organized\n6 Pack Soft Headband BEoffer Coral Fleece Women Makeup Spa Head Bands Turban Fashion Bow Bowknot Hairlace Headwear Wash Face Hair Holder Elastic Top Knot Bandage Girl Baby Hair Accessories 6 Colors\nBEoffer\n{'Age Range (Description)': 'Baby', 'Material': 'Elastic', 'Fabric Type': 'Fleece', 'Number of Items': '6', 'Recommended Uses For Product': 'Face Makeup', 'Product Dimensions': '7.28 x 1.97 x 0.67 inches; 1.16 Ounces', 'Item model number': 'BH-002', 'UPC': '799899729252'}\nI like these because they keep my baby hairs back when I'm giving myself a home facial. And I love that there are multiples so I'm never without a hairband even when one or more are in the laundry.\nGreat for spa days\nNATWAG Reusable Update Makeup Remover Cloths for Sensitive Skin - Microfiber Face Cloth Makeup Remover | Washable Round Makeup Remover Pads | Natural Facial Towels (2 Pads,2 Cloth) (Purple)\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'Sensitive,All Skin Types', 'Material Feature': 'Reusable', 'Unit Count': '4.00 Count', 'Number of Items': '2', 'Package Dimensions': '12.75 x 9.88 x 0.59 inches; 2.08 Ounces', 'UPC': '745103569978'}\nI LOVE makeup removing cloths. I don't use them solo — only with a makeup remover or micellar water. But these things are great because they're gentle on your skin and are far more economical and environmentally friendly than using disposable wipes.\nYou can never have too many makeup removing cloths\n20 PCS Zoostliss Nail Polish Remover Clips\nZoostliss\n{'Brand': 'Zoostliss', 'Number of Items': '20', 'Unit Count': '20 Count', 'Package Dimensions': '6.6 x 5.1 x 1.8 inches; 3.99 Ounces'}\nI recently started doing dip nails and they're definitely more work to remove than normal polish. But I like these clips to ensure that the acetone is really working into the polish and isn't sliding.\nGreat for removing stubborn polish\nAMAJULIE Non Slip Flexible Silicon Wigs Fix Strong Hold Comfort Silicone Lace Wig Grip Transparent Headband Hair Band Adjustable for Lace Wigs (Light Brown)\nAMAJULIE\n{'Material': 'Silicone', 'Fabric Type': 'Silicone,Silicon,Lace', 'Brand': 'AMAJULIE', 'Unit Count': '1.00 Count', 'Package Dimensions': '3.98 x 2.28 x 0.55 inches; 0.88 Ounces', 'UPC': '192389741275'}\nThis is a great option for full or frontal lace wigs. I like that it's not too thick, and even though it's a bit tight, it's not uncomfortable.\nNice\nCOSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nCOSYMAY\n{'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nI'm glad I got this for free through the Vine program. The length on this hair is nice, but it's definitely thin like others have mentioned. And I'm not just talking about the bangs. The bangs are ridiculously thin — to the point where you would rather they hadn't given it bangs. It doesn't look at all like the product description photo. I have yet to color and layer this wig, but it would definitely be a backup option rather than a daily go to choice.\nCute but way too thin",
  "profile": "**Updated User Profile Summary:**\n\n- **Gifting Preferences:** The user prioritizes practical gifts that address everyday needs and enhance convenience. Their interest in beauty products, particularly for women, emphasizes inclusivity and environmentally-conscious gifting.\n\n- **Target Audience:** The user focuses primarily on male recipients, including partners and fathers, while also embracing gifts that enhance women's beauty and self-care routines. This highlights a nurturing and supportive approach to gifting across genders.\n\n- **Materials Selection:** The user favors durable, eco-friendly materials and appreciates soft, comfortable personal care items, balancing functionality with sustainable practices.\n\n- **Personal Insights:** Their thoughtful gift-giving philosophy emphasizes products that alleviate common routine challenges and enhance daily experiences. A commitment to quality signifies an intention to uplift lifestyles.\n\n- **Occasion Awareness:** The user actively engages in significant gifting events, such as Christmas and Father's Day, and recognizes opportunities to promote personal care and self-improvement among all recipients.\n\n- **Recent Interests:** A recent interaction with beauty products, including hair accessories and wigs, further solidifies the user's refined perspective on practical gifts for both men and women. This signals a continuous dedication to enhancing beauty routines while acknowledging the importance of comfort and effectiveness in beauty solutions. Concerns regarding product thickness highlight the user's discerning taste and preference for high-quality items that meet expectations.",
  "metrics": {
    "rouge1_f": 0.15656565656565657,
    "rouge2_f": 0.008431703204047217,
    "rougeL_f": 0.0622895622895623,
    "meteor": 0.05664354087995082,
    "bleu1": 0.009915622358273438,
    "bleu2": 0.0014567777786507596,
    "bleu3": 0.00028353690555184,
    "bleu4": 0.00012520469362501394,
    "bertscore_precision": 0.3541122078895569,
    "bertscore_recall": 0.4629114270210266,
    "bertscore_f1": 0.4012676775455475
  }
}