{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fengde Hair 8A Ombre Brazilian Deep Wave Virgin Hair One Bundle 100% Unprocessed Human Hair Extensions(24,1B/30)\nReview Date: 2017/12/30\nStore: NewRang\nAverage Rating: 3.1\nProduct Details: {'Brand': 'NewRang', 'Material': 'Human', 'Hair Type': 'Wavy, Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.5 x 3.7 x 1.3 inches; 0.32 Ounces', 'UPC': '742354230718'}\nReview Text: The least amount of tangling of all the brands I've tried so far.  THe color is a shiny 27/30 color.  I wiish it came in 26&#34;.  Will def buy again.\nReview Title: The least amount of tangling of all the brands I've ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "One Dozen Hibiscus Flower Hair Clips/LUAU/BEACH Party Supplies/Hair Accessories\n{'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Flower, Bow', 'Theme': 'Floral', 'Occasion': 'Wedding, Birthdays', 'Package Dimensions': '3.5 x 2.3 x 0.5 inches; 2.4 Ounces'}\nVery lovely.  Would buy again.\nVery lovely. Would buy again.\nChuse Permanent Makeup Eyebrow Tattoo Machine Kit with Needles Tips Power Supply Kx-104\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 3.94 x 1.97 inches; 8.8 Ounces', 'Item model number': 'KX-104', 'UPC': '708302456616'}\nDoes not go deep enough for the dye to be permenant.  Maybe I have to go over the area a second session for the color to stay.\nDoes not go deep enough for the dye to be ...\nR RACILY HAIR Racily Hair 8A Ombre Brazilian Hair 3/4 Bundles Kinky Curly Unprocessed Virgin Brazilian Hair Black to Dark Brown 2 Tone #1B 30 Curly Weave Human Hair (14\" 16\" 18\")\n{'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13 x 8 x 2 inches; 12 Ounces', 'UPC': '718040918840'}\nWill definitely order again.  Longer next time.  This time, I got the 14,16,18. The color is gorgeous and a true 30 color.  I did lightly bleach it to bring that ombre 30 higher/closer to the weft (I wanted the lighter color closer to my eye area and not just on the bottom half of the hair. I attached photos to show how the curl pattern was affected by the bleach (deep curl pattern still in effect, just went from a deep 4a to a 3b/3c (see the third pic).  In that 3rd pic, the first piece of hair is out of the pack, not washed or dyed; the second piece of hair is the bleached portion, and the third piece is just cowashed.  You can see beautiful curls in all three parts, so feel free to wash or bleach, the curls seem to be here to stay. Lastly, the length is very true (slightly longer, actually).\nYes, yes, yes!!!!!  I hope this seller stays in business 4ever!\nFengde Hair 8A Ombre Brazilian Deep Wave Virgin Hair One Bundle 100% Unprocessed Human Hair Extensions(24,1B/30)\nNewRang\n{'Brand': 'NewRang', 'Material': 'Human', 'Hair Type': 'Wavy, Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.5 x 3.7 x 1.3 inches; 0.32 Ounces', 'UPC': '742354230718'}\nThe least amount of tangling of all the brands I've tried so far.  THe color is a shiny 27/30 color.  I wiish it came in 26&#34;.  Will def buy again.\nThe least amount of tangling of all the brands I've ...",
  "profile": "**User Summary:**\n\n- **Interests:** The user maintains a strong affinity for floral themes and vibrant, decorative accessories, particularly in hair styling. They continue to explore high-quality beauty tools that enhance personal appearance, emphasizing a focus on effective, practical solutions for hair care.\n\n- **Occasions:** Their interests in products suitable for weddings and birthdays highlight a penchant for celebratory items that allow for creative expression through accessories and styling.\n\n- **Aesthetic:** The user appreciates lovely, visually appealing designs featuring colorful embellishments such as flowers and bows. They have demonstrated a keen interest in high-quality hair accessories that offer versatility for personalized looks.\n\n- **Quality Expectation:** Exhibiting a critical approach to reviews, the user is vocal about quality and effectiveness, showing satisfaction with recent purchases that reinforce their commitment to reliable brands. Their feedback suggests a positive experience with minimal tangling in hair products, indicating a preference for practicality and ease of maintenance.\n\n- **Target Group:** They lean towards sophisticated, adult-targeted products that enhance personal grooming and style.\n\nOverall, the user enjoys decorative accessories that enrich their personal style for social events while actively seeking quality beauty solutions, particularly in hair care and styling. Their recent positive experience with hair extensions further cements their focus on effective products that align with their aesthetic ideals.",
  "metrics": {
    "rouge1_f": 0.1679160419790105,
    "rouge2_f": 0.006015037593984962,
    "rougeL_f": 0.08695652173913043,
    "meteor": 0.07436945560562734,
    "bleu1": 0.06595491307093514,
    "bleu2": 0.011868437140094942,
    "bleu3": 0.0024716440344313595,
    "bleu4": 0.0011290129119889624,
    "bertscore_precision": 0.35098797082901,
    "bertscore_recall": 0.4158697724342346,
    "bertscore_f1": 0.38068413734436035
  }
}