{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: BEYELIAN Premade Ultra Volume Eyelash Extensions 8D 0.07mm 10mm C Curl Express Cluster Lash Extensions\nReview Date: 2018/07/31\nStore: BEYELIAN\nAverage Rating: 4.3\nProduct Details: {'Brand': 'BEYELIAN', 'Material': 'Polyester, Polybutylene Terephthalate Fiber', 'Item Dimensions LxWxH': '4.7 x 1.96 x 0.39 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Individual', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.7 x 1.96 x 0.39 inches; 0.71 Ounces', 'UPC': '712022597757'}\nReview Text: Was disappointed at first sight because of how thin the individual lashes used to make the clusters were...until I put them on. They do not fail to fan out and quickly make themselves known.  Being so light keeps them from weighing down my own fragile lashes, which is a good thing.  I do have that glam look now and plan to keep that way...until I get bored.\nReview Title: Will buy again.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "One Dozen Hibiscus Flower Hair Clips/LUAU/BEACH Party Supplies/Hair Accessories\n{'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Flower, Bow', 'Theme': 'Floral', 'Occasion': 'Wedding, Birthdays', 'Package Dimensions': '3.5 x 2.3 x 0.5 inches; 2.4 Ounces'}\nVery lovely.  Would buy again.\nVery lovely. Would buy again.\nChuse Permanent Makeup Eyebrow Tattoo Machine Kit with Needles Tips Power Supply Kx-104\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 3.94 x 1.97 inches; 8.8 Ounces', 'Item model number': 'KX-104', 'UPC': '708302456616'}\nDoes not go deep enough for the dye to be permenant.  Maybe I have to go over the area a second session for the color to stay.\nDoes not go deep enough for the dye to be ...\nR RACILY HAIR Racily Hair 8A Ombre Brazilian Hair 3/4 Bundles Kinky Curly Unprocessed Virgin Brazilian Hair Black to Dark Brown 2 Tone #1B 30 Curly Weave Human Hair (14\" 16\" 18\")\n{'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13 x 8 x 2 inches; 12 Ounces', 'UPC': '718040918840'}\nWill definitely order again.  Longer next time.  This time, I got the 14,16,18. The color is gorgeous and a true 30 color.  I did lightly bleach it to bring that ombre 30 higher/closer to the weft (I wanted the lighter color closer to my eye area and not just on the bottom half of the hair. I attached photos to show how the curl pattern was affected by the bleach (deep curl pattern still in effect, just went from a deep 4a to a 3b/3c (see the third pic).  In that 3rd pic, the first piece of hair is out of the pack, not washed or dyed; the second piece of hair is the bleached portion, and the third piece is just cowashed.  You can see beautiful curls in all three parts, so feel free to wash or bleach, the curls seem to be here to stay. Lastly, the length is very true (slightly longer, actually).\nYes, yes, yes!!!!!  I hope this seller stays in business 4ever!\nFengde Hair 8A Ombre Brazilian Deep Wave Virgin Hair One Bundle 100% Unprocessed Human Hair Extensions(24,1B/30)\nNewRang\n{'Brand': 'NewRang', 'Material': 'Human', 'Hair Type': 'Wavy, Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.5 x 3.7 x 1.3 inches; 0.32 Ounces', 'UPC': '742354230718'}\nThe least amount of tangling of all the brands I've tried so far.  THe color is a shiny 27/30 color.  I wiish it came in 26&#34;.  Will def buy again.\nThe least amount of tangling of all the brands I've ...\nRacily Hair 8A Brazilian Kinky Curly Ombre Hair Extensions 3 Pcs 2 Tone 1B 30# Ombre Brazilian Curly Virgin Hair (12\"14\"16\")\nR RACILY HAIR\n{'Brand': 'R RACILY HAIR', 'Extension Length': '12 Inches', 'Hair Type': 'Curly', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.35 x 7.72 x 2.24 inches; 10.88 Ounces', 'UPC': '783057242585'}\nWill definitely order again. Longer next time. This time, I got the 14,16,18. The color is gorgeous and a true 30 color. I did lightly bleach it to bring that ombre 30 higher/closer to the weft (I wanted the lighter color closer to my eye area and not just on the bottom half of the hair. I attached photos to show how the curl pattern was affected by the bleach (deep curl pattern still in effect, just went from a jerry-4a to a 3b/3c (see the first and second pics). In that 2nd pic, the first section of hair is out of the pack, not washed or dyed; the second section of hair is the bleached portion, and the third piece is not bleached, only just cowashed. You can see beautiful curls in all three section, so feel free to wash or bleach (be careful, though), the curls seem to be here to stay. Lastly, the length is very true (slightly longer, actually).\nYes, yes, yes!!!!! I hope this seller stays in business 4ever! Wish I could order single bundles...\nBEYELIAN 3D Premade Fans Volume Lashes Individual Eyelash Extensions Ultra Natural (0.05mm 9mm C Curl 228 pcs)\nBEYELIAN\n{'Brand': 'BEYELIAN', 'Item Dimensions LxWxH': '4.7 x 1.96 x 0.39 inches', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.7 x 1.96 x 0.39 inches; 0.8 Ounces', 'UPC': '712022597146'}\n'Meh', compared to their volume lashes...\nThree Stars\nBEYELIAN Premade Ultra Volume Eyelash Extensions 8D 0.07mm 10mm C Curl Express Cluster Lash Extensions\nBEYELIAN\n{'Brand': 'BEYELIAN', 'Material': 'Polyester, Polybutylene Terephthalate Fiber', 'Item Dimensions LxWxH': '4.7 x 1.96 x 0.39 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Individual', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.7 x 1.96 x 0.39 inches; 0.71 Ounces', 'UPC': '712022597757'}\nWas disappointed at first sight because of how thin the individual lashes used to make the clusters were...until I put them on. They do not fail to fan out and quickly make themselves known.  Being so light keeps them from weighing down my own fragile lashes, which is a good thing.  I do have that glam look now and plan to keep that way...until I get bored.\nWill buy again.",
  "profile": "**User Summary:**\n\nThe user continues to demonstrate a strong affinity for floral-themed and vibrant decorative accessories in hair styling, while actively exploring high-quality beauty tools to enhance their personal appearance. Their focus remains on practical solutions for hair care. \n\nTheir interest in celebratory items suitable for weddings and birthdays showcases a love for creative expression, complemented by a preference for visually appealing designs with colorful embellishments. The user seeks high-quality, versatile hair accessories that allow for personalized looks.\n\nRecently, the user made a notable purchase of eyelash extensions, which received an average rating. Their review reflects a discerning approach to quality, emphasizing that despite initial disappointment with the product's thin lashes, they were impressed by the final glam effect and lightness. This interaction reveals a balance between cautious optimism and a critical perspective, as the user holds established favorites to a high standard while remaining open to trying new solutions.\n\nOverall, the user gravitates toward sophisticated, adult-targeted beauty products that enhance grooming, underscoring their commitment to effective and reliable beauty solutions in both hair care and styling. They enjoy decorative accessories that enrich their personal style for social events, continually prioritizing quality and practical use in their beauty routine.",
  "metrics": {
    "rouge1_f": 0.14634146341463417,
    "rouge2_f": 0.00904977375565611,
    "rougeL_f": 0.06684733514001806,
    "meteor": 0.05075433041534736,
    "bleu1": 0.0054115011932545755,
    "bleu2": 0.0019295994799791109,
    "bleu3": 0.000295230900800264,
    "bleu4": 0.00011560987179169886,
    "bertscore_precision": 0.32850325107574463,
    "bertscore_recall": 0.4373733103275299,
    "bertscore_f1": 0.3752003312110901
  }
}