{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Moda Mode Kinky Curly Human Hair Weave Virgin Hair Extensions Unprocessed Brazilian Human Hair Curly Wavy Hair 3 Bundles Natural Black (20 22 24 Inch)\nReview Date: 2019/05/13\nStore: Moda Mode\nAverage Rating: 2.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.8 x 7.1 x 2.2 inches; 9.44 Ounces', 'UPC': '611029564451'}\nReview Text: I bought the curly wavy version of this hair (is tighter than wavy  but that's what I wanted) and I bought the kinky curly version of this hair.  Both take bleaching very well without losing the curl integrity (very important to me).  I mean, I bleached and toned and bleached again to get to the 27 color and the hair didn't fry.  The curly wavy still looks great after three months and I expect the kinky curly probably will, too.  Love this company and will continue to buy from them as long as the prices are this great.\nReview Title: BUY THIS FREAKING HAIR!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "One Dozen Hibiscus Flower Hair Clips/LUAU/BEACH Party Supplies/Hair Accessories\n{'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Flower, Bow', 'Theme': 'Floral', 'Occasion': 'Wedding, Birthdays', 'Package Dimensions': '3.5 x 2.3 x 0.5 inches; 2.4 Ounces'}\nVery lovely.  Would buy again.\nVery lovely. Would buy again.\nChuse Permanent Makeup Eyebrow Tattoo Machine Kit with Needles Tips Power Supply Kx-104\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 3.94 x 1.97 inches; 8.8 Ounces', 'Item model number': 'KX-104', 'UPC': '708302456616'}\nDoes not go deep enough for the dye to be permenant.  Maybe I have to go over the area a second session for the color to stay.\nDoes not go deep enough for the dye to be ...\nR RACILY HAIR Racily Hair 8A Ombre Brazilian Hair 3/4 Bundles Kinky Curly Unprocessed Virgin Brazilian Hair Black to Dark Brown 2 Tone #1B 30 Curly Weave Human Hair (14\" 16\" 18\")\n{'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13 x 8 x 2 inches; 12 Ounces', 'UPC': '718040918840'}\nWill definitely order again.  Longer next time.  This time, I got the 14,16,18. The color is gorgeous and a true 30 color.  I did lightly bleach it to bring that ombre 30 higher/closer to the weft (I wanted the lighter color closer to my eye area and not just on the bottom half of the hair. I attached photos to show how the curl pattern was affected by the bleach (deep curl pattern still in effect, just went from a deep 4a to a 3b/3c (see the third pic).  In that 3rd pic, the first piece of hair is out of the pack, not washed or dyed; the second piece of hair is the bleached portion, and the third piece is just cowashed.  You can see beautiful curls in all three parts, so feel free to wash or bleach, the curls seem to be here to stay. Lastly, the length is very true (slightly longer, actually).\nYes, yes, yes!!!!!  I hope this seller stays in business 4ever!\nFengde Hair 8A Ombre Brazilian Deep Wave Virgin Hair One Bundle 100% Unprocessed Human Hair Extensions(24,1B/30)\nNewRang\n{'Brand': 'NewRang', 'Material': 'Human', 'Hair Type': 'Wavy, Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.5 x 3.7 x 1.3 inches; 0.32 Ounces', 'UPC': '742354230718'}\nThe least amount of tangling of all the brands I've tried so far.  THe color is a shiny 27/30 color.  I wiish it came in 26&#34;.  Will def buy again.\nThe least amount of tangling of all the brands I've ...\nRacily Hair 8A Brazilian Kinky Curly Ombre Hair Extensions 3 Pcs 2 Tone 1B 30# Ombre Brazilian Curly Virgin Hair (12\"14\"16\")\nR RACILY HAIR\n{'Brand': 'R RACILY HAIR', 'Extension Length': '12 Inches', 'Hair Type': 'Curly', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.35 x 7.72 x 2.24 inches; 10.88 Ounces', 'UPC': '783057242585'}\nWill definitely order again. Longer next time. This time, I got the 14,16,18. The color is gorgeous and a true 30 color. I did lightly bleach it to bring that ombre 30 higher/closer to the weft (I wanted the lighter color closer to my eye area and not just on the bottom half of the hair. I attached photos to show how the curl pattern was affected by the bleach (deep curl pattern still in effect, just went from a jerry-4a to a 3b/3c (see the first and second pics). In that 2nd pic, the first section of hair is out of the pack, not washed or dyed; the second section of hair is the bleached portion, and the third piece is not bleached, only just cowashed. You can see beautiful curls in all three section, so feel free to wash or bleach (be careful, though), the curls seem to be here to stay. Lastly, the length is very true (slightly longer, actually).\nYes, yes, yes!!!!! I hope this seller stays in business 4ever! Wish I could order single bundles...\nBEYELIAN 3D Premade Fans Volume Lashes Individual Eyelash Extensions Ultra Natural (0.05mm 9mm C Curl 228 pcs)\nBEYELIAN\n{'Brand': 'BEYELIAN', 'Item Dimensions LxWxH': '4.7 x 1.96 x 0.39 inches', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.7 x 1.96 x 0.39 inches; 0.8 Ounces', 'UPC': '712022597146'}\n'Meh', compared to their volume lashes...\nThree Stars\nBEYELIAN Premade Ultra Volume Eyelash Extensions 8D 0.07mm 10mm C Curl Express Cluster Lash Extensions\nBEYELIAN\n{'Brand': 'BEYELIAN', 'Material': 'Polyester, Polybutylene Terephthalate Fiber', 'Item Dimensions LxWxH': '4.7 x 1.96 x 0.39 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Individual', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.7 x 1.96 x 0.39 inches; 0.71 Ounces', 'UPC': '712022597757'}\nWas disappointed at first sight because of how thin the individual lashes used to make the clusters were...until I put them on. They do not fail to fan out and quickly make themselves known.  Being so light keeps them from weighing down my own fragile lashes, which is a good thing.  I do have that glam look now and plan to keep that way...until I get bored.\nWill buy again.\nElectric Shavers for Women, 4 in 1 Ladies Cordless Rechargeable Painless Hair Remover for Eyebrows, Nasal Hair, Underarms, Bikini Area and Whole Body- Safe, Gentle Shaving Razor Systems -Pink Gold …\nFOXCESD\n{'Is Discontinued By Manufacturer': 'No', 'Batteries': '1 AA batteries required. (included)', 'UPC': '666354185604'}\nIt seems you should go in one direction or it will pull the hair a bit.  In the other direction (you'll have to discover which way for your self), it is completely painless.  Even in the 'wrong' direction, it's not bad and I'm not super pain tolerant. Needs no batteries, so that's great, too.\nSo far, so good\nModa Mode Kinky Curly Human Hair Weave Virgin Hair Extensions Unprocessed Brazilian Human Hair Curly Wavy Hair 3 Bundles Natural Black (20 22 24 Inch)\nModa Mode\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.8 x 7.1 x 2.2 inches; 9.44 Ounces', 'UPC': '611029564451'}\nI bought the curly wavy version of this hair (is tighter than wavy  but that's what I wanted) and I bought the kinky curly version of this hair.  Both take bleaching very well without losing the curl integrity (very important to me).  I mean, I bleached and toned and bleached again to get to the 27 color and the hair didn't fry.  The curly wavy still looks great after three months and I expect the kinky curly probably will, too.  Love this company and will continue to buy from them as long as the prices are this great.\nBUY THIS FREAKING HAIR!!!",
  "profile": "**User Summary:**\n\nThe user demonstrates a strong affinity for floral-themed and vibrant decorative accessories in hair styling while actively seeking high-quality beauty tools to enhance their appearance. Their focus remains on practical solutions for hair care and grooming, reflecting a commitment to high standards in their beauty regimen. Recent interactions have showcased their openness to versatile products, particularly in hair extensions, where they appreciate the durability and quality of materials used.\n\nThe user recently purchased hair extensions that allowed for extensive processing without compromising curl integrity, a critical factor in their choices. Their positive review emphasizes a discerning approach; they've noted the effectiveness and longevity of products while also highlighting aesthetic preferences. This showcases a blend of cautious optimism, where they remain willing to try new solutions while holding favorites to a high standard.\n\nTheir interest in celebratory items appropriate for weddings and birthdays further underlines a passion for creative expression and visually appealing designs. Overall, the user prioritizes quality, versatility, and personal style in their beauty regimen, consistently refining their aesthetic for social events, and continues to cultivate a sophisticated grooming routine that melds practicality with aesthetic preference.",
  "metrics": {
    "rouge1_f": 0.11529933481152994,
    "rouge2_f": 0.007401924500370096,
    "rougeL_f": 0.06356245380635625,
    "meteor": 0.04111697208951279,
    "bleu1": 0.0009466906167913805,
    "bleu2": 0.00028426728144807556,
    "bleu3": 4.626100303127116e-05,
    "bleu4": 1.8684112805109992e-05,
    "bertscore_precision": 0.30892762541770935,
    "bertscore_recall": 0.42750561237335205,
    "bertscore_f1": 0.35867008566856384
  }
}