{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: R RACILY HAIR Racily Hair 8A Ombre Brazilian Hair 3/4 Bundles Kinky Curly Unprocessed Virgin Brazilian Hair Black to Dark Brown 2 Tone #1B 30 Curly Weave Human Hair (14\" 16\" 18\")\nReview Date: 2017/08/10\nAverage Rating: 3.0\nProduct Details: {'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13 x 8 x 2 inches; 12 Ounces', 'UPC': '718040918840'}\nReview Text: Will definitely order again.  Longer next time.  This time, I got the 14,16,18. The color is gorgeous and a true 30 color.  I did lightly bleach it to bring that ombre 30 higher/closer to the weft (I wanted the lighter color closer to my eye area and not just on the bottom half of the hair. I attached photos to show how the curl pattern was affected by the bleach (deep curl pattern still in effect, just went from a deep 4a to a 3b/3c (see the third pic).  In that 3rd pic, the first piece of hair is out of the pack, not washed or dyed; the second piece of hair is the bleached portion, and the third piece is just cowashed.  You can see beautiful curls in all three parts, so feel free to wash or bleach, the curls seem to be here to stay. Lastly, the length is very true (slightly longer, actually).\nReview Title: Yes, yes, yes!!!!!  I hope this seller stays in business 4ever!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "One Dozen Hibiscus Flower Hair Clips/LUAU/BEACH Party Supplies/Hair Accessories\n{'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Flower, Bow', 'Theme': 'Floral', 'Occasion': 'Wedding, Birthdays', 'Package Dimensions': '3.5 x 2.3 x 0.5 inches; 2.4 Ounces'}\nVery lovely.  Would buy again.\nVery lovely. Would buy again.\nChuse Permanent Makeup Eyebrow Tattoo Machine Kit with Needles Tips Power Supply Kx-104\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 3.94 x 1.97 inches; 8.8 Ounces', 'Item model number': 'KX-104', 'UPC': '708302456616'}\nDoes not go deep enough for the dye to be permenant.  Maybe I have to go over the area a second session for the color to stay.\nDoes not go deep enough for the dye to be ...\nR RACILY HAIR Racily Hair 8A Ombre Brazilian Hair 3/4 Bundles Kinky Curly Unprocessed Virgin Brazilian Hair Black to Dark Brown 2 Tone #1B 30 Curly Weave Human Hair (14\" 16\" 18\")\n{'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Curly', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13 x 8 x 2 inches; 12 Ounces', 'UPC': '718040918840'}\nWill definitely order again.  Longer next time.  This time, I got the 14,16,18. The color is gorgeous and a true 30 color.  I did lightly bleach it to bring that ombre 30 higher/closer to the weft (I wanted the lighter color closer to my eye area and not just on the bottom half of the hair. I attached photos to show how the curl pattern was affected by the bleach (deep curl pattern still in effect, just went from a deep 4a to a 3b/3c (see the third pic).  In that 3rd pic, the first piece of hair is out of the pack, not washed or dyed; the second piece of hair is the bleached portion, and the third piece is just cowashed.  You can see beautiful curls in all three parts, so feel free to wash or bleach, the curls seem to be here to stay. Lastly, the length is very true (slightly longer, actually).\nYes, yes, yes!!!!!  I hope this seller stays in business 4ever!",
  "profile": "**User Summary:**\n\n- **Interests:** The user has a distinct affinity for floral themes, vibrant and decorative accessories, particularly in hair styling, and continues to explore beauty tools that enhance personal appearance. Their interest in hair products showcases a deeper engagement with styling and maintenance.\n- **Occasions:** They enjoy products suited for weddings and birthdays, indicating a preference for celebratory items and moments that allow for creative expression through accessories.\n- **Aesthetic:** They appreciate lovely, visually appealing designs with colorful embellishments such as flowers and bows, while increasingly valuing high-quality hair accessories that can be styled and altered for a more personalized look.\n- **Quality Expectation:** The user demonstrates a willingness to critique and highlight areas for improvement in beauty tools and hair products. They show a strong preference for quality, as indicated by their satisfaction with the recent purchase, which has reinforced their commitment to repurchase from reliable sellers.\n- **Target Group:** Preferring adult-targeted products, they are refining their taste to include sophisticated styling and beauty maintenance solutions that enhance personal grooming.\n\nOverall, the user favors decorative accessories that enrich their personal style for social events and is actively exploring practical beauty solutions, demanding quality and effectiveness across all evaluated products. Their recent purchases highlight a continued focus on hair care and styling that complement their overall aesthetic.",
  "metrics": {
    "rouge1_f": 0.19130434782608696,
    "rouge2_f": 0.003490401396160558,
    "rougeL_f": 0.09739130434782609,
    "meteor": 0.08946544397226569,
    "bleu1": 0.10832162915022793,
    "bleu2": 0.019650654948266035,
    "bleu3": 0.004103277181118499,
    "bleu4": 0.0018767944407366295,
    "bertscore_precision": 0.3610009551048279,
    "bertscore_recall": 0.41279321908950806,
    "bertscore_f1": 0.3851637840270996
  }
}