{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The New Corporation: The Unfortunately Necessary Sequel\nReview Date: 2023/02/28\nStore: Jennifer Abbott  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Special Interests\nProduct Description: ['This product is an authorized manufactured on demand DVD-R']\nAverage Rating: 4.2\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.48 x 5.35 x 0.51 inches; 2.89 Ounces', 'Director': 'Jennifer Abbott', 'Media Format': 'NTSC', 'Run time': '105 minutes', 'Release date': 'May 24, 2022', 'Subtitles': 'English', 'Studio': 'Gravitas Ventures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is one of the biggest issues of our time. The issue persists even after we learned in the first edition of this video that corporations are basically sociopaths.  in fact our Supreme Court has declared that corporations are entitled to some of the privileges of individual humans.  Sadly, the necessary sequel does not have all the necessary backup material, nor does it articulate a path forward so that citizens can correct the egregious mistake, such as \"sunsetting\" corporate charters automatically unless they can prove a social benefit.  Yes the sequel is \"necessary\" but not sufficient.\nReview Title: Not as good as the original\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "LEGO Ninjago Masters of Spinjitzu (DVD)\nVarious  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video\n['Product Description', 'LEGO Ninjago Masters of Spinjitzu', 'Masters of Spinjitzu: a new force to save the world! The world of Ninjago is in terrible danger. An army of skeletons has invaded from the underworld, under the command of the evil Lord Garmadon. Their goal: capture the Four Weapons of Spinjitzu, artifacts so powerful it is said no one being can wield them all at once. Now Garmadon’s brother, the heroic Sensei Wu, must gather four young men and train them in the ways of the ancient art of Spinjitzu. These four – Kai, Jay, Zane and Cole – must become ninja and stand against the dark power of Garmadon and his evil skeleton army. If they fail, the four weapons will be lost and Ninjago doomed forever.', ']]>', 'Amazon.com', 'The two-part adventure', 'Ninjago: Masters of Spinjitzu', \"is based on a line of toys Lego introduced in 2011. Kai, a young blacksmith, is eager--too eager--to forge a great sword. He initially snubs the unassuming Sensei Wu, the master of Spinjitzu martial arts. When Kai's sister Nya is kidnapped by Samukai and his skeleton army from the Underworld, Wu realizes the evil Garmadon is using Samukai to find four legendary weapons that will give him enormous power. Wu trains Kai to join his student-warriors, Jay, Zane, and Cole, and keep Garmadon from seizing power.\", 'Masters of Spinjitzu', \"is a lightweight, product-based adventure, but it's not a terribly original one. The training sequence, which pits Kai against a series of armed mechanical devices, borrows heavily from\", 'Kung Fu Panda', '. Other elements recall', 'Naruto', 'and', 'Teenage Mutant Ninja Turtles', ', and the filmmakers blithely mix Chinese, Japanese, and Western elements. But little kids who love their Lego toys will probably overlook these shortcoming and enjoy the adventure, which is obviously designed to kick off a series. Parents should be prepared to field requests for the many toys that appear in', 'Masters of Spinjitzu', '. (Unrated; suitable for ages 5 and older: cartoon violence)', '--Charles Solomon']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25195594', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Animated', 'Run time': '44 minutes', 'Release date': 'March 27, 2012', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nOur 5 year old grandson can't get enough of the Ninjago series.  I wish all of season 3 would be available in the USA, but apparently it's not.  (Why can other countries get it and we can't? Bummer!)  One thing I, as a septuagenarian adult, like very much is that the characters have a moral compass, even though there is the usual cartoon mayhem.  Also, the oriental aesthetic is a refreshing change from the ordinary cartoon graphics.  Well done.\nFrom the grandparents of a 5 year old boy\nLEGO Ninjago: Masters of Spinjitzu: Season 2\nMichael Helmuth Hansen  (Director),     Trylle Vilstrup  (Director),     Vincent Tong  (Actor),     Kirby Morrow  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Musicals & Performing Arts\n['LEGO Ninjago: Masters of Spinjitzu Season Two', 'Since Lord Garmadon’s disappearance from the Underworld, Ninjago has been at peace; but when Garmadon’s son, Lloyd, releases the five ancient warring tribes of the Serpentine, the Ninja had to learn how to unlock their full potential in order to combat the growing threat. The Ninja also learned of a prophecy that one of them will become the Green Ninja – a warrior destined to defeat the Dark Lord in the ultimate battle of good versus evil. In the first season, the Ninjas unlocked their full elemental powers. Meanwhile, the Serpentine released the all-consuming snake known as the Great Devourer. In the climactic finale, the Ninja had to rely on Lord Garmadon and his ability to wield the Four Golden Weapons in order to destroy the Great Devourer and bring peace. In the end, the Ninja are heralded as heroes, but Lord Garmadon has disappeared with the very weapons he needed in order to turn Ninjago into his evil image.', ']]>']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Brian Drummond, IRENE SPARRE, John Novak, Mark Oliver, Trylle Vilstrup, Erik Wilstrup, Michael Adamthwaite, Martin Skov, Michael Helmuth Hansen, Vincent Tong, Mackenzie Gray, Kirby Morrow, Jillian Michaels, Kelly Metzger, Colin Murdock, Brent Miller, Torsten Jacobsen, Paul DobsonBrian Drummond, IRENE SPARRE, John Novak, Mark Oliver, Trylle Vilstrup, Erik Wilstrup, Michael Adamthwaite, Martin Skov, Michael Helmuth Hansen, Vincent Tong, Mackenzie Gray, Kirby Morrow, Jillian Michaels, Kelly Metzger, Colin Murdock, Brent Miller, Torsten Jacobsen…  See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '26337710', 'Director': 'Michael Helmuth Hansen, Trylle Vilstrup, Martin Skov', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '4 hours and 46 minutes', 'Release date': 'March 5, 2013', 'Actors': 'Vincent Tong, Kirby Morrow, Michael Adamthwaite, Brent Miller, Paul Dobson', 'Producers': 'IRENE SPARRE, Torsten Jacobsen, Erik Wilstrup', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nThis is a great fantasy series which grandparents can enjoy with their lego-obsessed grandsons, then go out and get some of the sets and build the vehicles etc.  Not lacking in moral content, either.  The boy is going to be Lloyd, the green ninja, this halloween.\nThis is a great fantasy series which grandparents can enjoy with their lego-obsessed ...\nLEGO Ninjago: The Complete First Season (DVD)\nVincent Tong  (Actor),     Kirby Morrow  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'LEGO Ninjago: Masters of Spinjitzu Season One', \"Since Lord Garmadon's disappearance from the Underworld, Ninjago has been at peace; but when Garmadon's son, Lloyd, releases the five ancient warring tribes of the Serpentine, the Ninja had to learn how to unlock their full potential in order to combat the growing threat. The Ninja also learned of a prophecy that one of them will become the Green Ninja – a warrior destined to defeat the Dark Lord in the ultimate battle of good versus evil. In the first season, the Ninjas unlocked their full elemental powers. Meanwhile, the Serpentine released the all-consuming snake known as the Great Devourer. In the climactic finale, the Ninja had to rely on Lord Garmadon and his ability to wield the Four Golden Weapons in order to destroy the Great Devourer and bring peace. In the end, the Ninja are heralded as heroes, but Lord Garmadon has disappeared with the very weapons he needed in order to turn Ninjago into his evil image.\", ']]>', 'Amazon.com', 'Ninjago', 'is an action TV series that\\'s based on the Lego toys and features the martial arts-inspired \"spinjitzu\": basically a combination of martial arts performed with weapons like swords, scythes, nunchucks, and shurikens combined with very fast spinning.', 'Ninjago: Masters of Spinjitzu, Season One', \"begins after the series pilot episode and follows ninjas Kai, Cole, Jay, and Zane as they study their craft with Sensei Wu. The four hope to unleash their inner potential in preparation for defending the world against the return of the Dark Lord Garmadon. Prophecy states that one ninja will rise above the others to become the Green Ninja, who is destined to defeat Garmadon. Unfortunately, the four young ninjas are poorly disciplined and more interested in video games (Lego's\", 'Ninjago', \", of course) and food fights than actual training. But when Garmadon's son Lloyd escapes from a boarding school for bad boys and accidentally releases an army of snakes, the ninjas suddenly have a reason to get serious about their training, as the snakes are a threat to the entire land of Ninjago. Sensei Wu is a wise teacher and the young ninjas develop their skills quickly, learning to use their four special weapons in a way that releases their elemental powers. But fate has a surprise for everyone when Lloyd is captured by the snakes and Sensei Wu informs the ninjas that they must rescue him. The question of which of the four ninjas will become the Green Ninja causes no end of bickering among the boys, even as they work together to rescue Lloyd and save Ninjago from the serpents. Interestingly, Kai's sister Nya also plays an unexpectedly important role in the mission to save Ninjago. The surprises just keep coming as five tribes of snakes band together in a quest to release an evil monster known as the Devourer, and eventually the ninjas find Lloyd training right alongside them. The action and suspense throughout this series is good, even if the ninjas often act like unruly prepubescent boys, and there are plenty of important life lessons woven throughout. (Ages 7 to 12)\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family, Animation, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Vincent Tong, IRENE SPARRE, Kirby Morrow, John Novak, Jillian Michaels, Erik Wilstrup, Colin Murdock, Michael Adamthwaite, Ian James Corlett, Torsten Jacobsen, Paul DobsonVincent Tong, IRENE SPARRE, Kirby Morrow, John Novak, Jillian Michaels, Erik Wilstrup, Colin Murdock, Michael Adamthwaite, Ian James Corlett, Torsten Jacobsen, Paul Dobson   See more', 'Language': 'Unqualified (Dolby Surround)', 'Runtime': '4 hours and 46 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 3.2 Ounces', 'Item model number': '25297567', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '4 hours and 46 minutes', 'Release date': 'June 26, 2012', 'Actors': 'Vincent Tong, Kirby Morrow, Michael Adamthwaite, Paul Dobson, Jillian Michaels', 'Producers': 'IRENE SPARRE, Torsten Jacobsen, Erik Wilstrup', 'Studio': 'Warner Home Video', 'Number of discs': '2'}\nSeasons one and two are the best, can be viewed over and over without losing their charm.  By far the best movie series Lego has produced.  Good action pace, good graphics, engaging story lines, fun characters - seasons one and two are winners.\nSeasons one and two are the best, can be viewed over and over without losing ...\nLEGO:NINJAGO:MASTERS SPINJITZU:REBTD: Season 3 Battle for New Ninjago City Season 3 Part 1\nVincent Tong  (Actor),     Kirby Morrow  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['LEGO Ninjago: Rebooted: Battle for New Ninjago City Season Three Part One (DVD)', 'Victory in the Final Battle between the Gold Ninja and the Overlord has ushered in a new era of peace and begun a technological renaissance. Time has passed and the Ninja have become obsolete in this new hi-tech world. Just when they think all is safe in Ninjago, they’re called back into action when the reclusive inventor Cyrus Borg warns them the Overlord has survived as a digital virus and is trapped within the Digiverse. The Ninja will learn the Overlord seeks to steal Lloyd’s golden power to enable him to escape his digital prison and reign as the great prophesized destructor, “The Golden Master”. And to aid his villainous plot, he’s created a new technological menace more powerful than any foe the Ninja have ever faced – Nindroids.', ']]>']\n{'Genre': 'Kids & Family, Animation, Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC, Widescreen', 'Contributor': 'Scott McNeil, Lee Tockar, Erik Wilstrup, Michael Adamthwaite, Jilian Michaels, Vincent Tong, Jennifer Hayward, Kirby Morrow, Alan Marriott, Kelly Metzger, Kathleen Barr, Brent Miller, Torsten Jacobsen, Paul DobsonScott McNeil, Lee Tockar, Erik Wilstrup, Michael Adamthwaite, Jilian Michaels, Vincent Tong, Jennifer Hayward, Kirby Morrow, Alan Marriott, Kelly Metzger, Kathleen Barr, Brent Miller, Torsten Jacobsen, Paul Dobson  See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'WHV1000490372DVD', 'Media Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'August 5, 2014', 'Actors': 'Vincent Tong, Kirby Morrow, Michael Adamthwaite, Brent Miller, Paul Dobson', 'Producers': 'Torsten Jacobsen, Erik Wilstrup', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nThe original 3 series were better, because the action was less confusing and there was more of a coherent story.  To the creators: Please go back to that thoughtful place where you carefully crafted the original series.\nThe original 3 series were better, because the action was less confusing and there ...\nTHE PALLISERS: 40TH ANNIVERSARY EDITION\nSusan Hampshire  (Actor),     Philip Latham  (Actor),     Hugh David  (Director),     Ronald Wilson  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['“In the grand tradition of', 'The Forsyte Saga', 'and', 'Upstairs, Downstairs', '” —', 'Time', 'magazine  “Powerfully addictive” —', 'Time', 'magazine “Chronicles the passion and politics of Victorian England” —', 'Los Angeles Times', 'This sprawling BBC saga follows an aristocratic family through three generations of power, wealth, intrigue, and scandal in Victorian England. Based on Anthony Trollope’s “political” novels and adapted by British author Simon Raven (', 'Alms for Oblivion', '), this classic PBS series has captivated audiences on both sides of the Atlantic.  Emmy', '®', 'winner Susan Hampshire (', 'The Forsyte Saga', ') stars as the beautiful and witty Lady Glencora, whose arranged marriage to rising politician Plantagenet Palliser (Philip Latham, “marvelous from beginning to end” —', 'The New York Times', ') endures public and private crises as the family ascends the social ladder. The outstanding cast also features Jeremy Irons (', 'The Borgias', '), Derek Jacobi (', 'The King’s Speech', '), Anthony Andrews (', 'Brideshead Revisited', '), Peter Vaughan (', 'The Remains of the Day', '), and Penelope Keith (', 'To the Manor Born', ').']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'NTSC, Subtitled', 'Contributor': 'Susan Hampshire, Philip Latham, Ronald Wilson, Hugh David, Peter Vaughan, Jeremy Irons, Penelope Keith, Derek Jacobi, Anthony AndrewsSusan Hampshire, Philip Latham, Ronald Wilson, Hugh David, Peter Vaughan, Jeremy Irons, Penelope Keith, Derek Jacobi, Anthony Andrews  See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.8 Ounces', 'Item model number': '27617990', 'Director': 'Hugh David, Ronald Wilson', 'Media Format': 'NTSC, Subtitled', 'Run time': '22 hours and 20 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Susan Hampshire, Philip Latham, Jeremy Irons, Derek Jacobi, Anthony Andrews', 'Subtitles': 'English', 'Studio': 'Acorn Media', 'Number of discs': '1'}\nOh, who can forget how much fun it was to watch this series when it first came out?  The Susan Hampshire interviews are interesting too.\nwho can forget how much fun it was to watch this series when it first ...\nThe West Wing: The Complete Series Collection\nMartin Sheen  (Actor),     Allison Janney  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The West Wing ventured where no other TV series had gone before: an extraordinarily intimate look at an American President and the inner workings of the White House. Experience all the crises, triumphs, lofty idealism and hard realities of the acclaimed series in this complete seven-season DVD set. Here, on 45 discs, are all 154 episodes of the series that won 26 Emmys, including 4 for Outstanding Drama Series. Hail to chief - and to the creators and stars of this ground-breaking series.', 'Note on Boxed Sets:', \"During shipping, discs in boxed sets occasionally become dislodged without damage. Please examine and play these discs. If you are not completely satisfied, we'll refund or replace your purchase.\", 'Set Contains:', 'A prestigious, award-winning drama series like', 'The West Wing', 'deserves first-class treatment on DVD, and the', 'Complete Series Collection', 'really delivers the goods. Like the series itself, the packaging is first-class all the way. The entire DVD set is held in a dossier file box, with a faux-leather navy blue exterior graced with an embossed silver-foil presidential seal and a magnet-sealing flap that neatly closes the lid with no visible latches or clasps. The 45 DVDs are held in seven individually tabbed and numbered fold-out files (one for each complete season) with a pocket for each DVD and', 'West Wing', \"cast members pictured on each fold-out file. (In addition, the DVDs themselves are labeled with a photo of the entire primary cast.) And while the audio commentaries, behind-the-scenes featurettes, gag reels, and other DVD extras remain the same from the previous individual-season DVD sets, the glossy, lavishly illustrated episode guide is exclusive to this set, and it's a convenient one-stop source for specific episode information. Also exclusive to this set is Aaron Sorkin's Emmy-nominated teleplay for the pilot episode, along with a new foreword by Sorkin detailing the genesis of the series from concept to casting. You can bet that Sorkin and his\", 'West Wing', \"colleagues are pleased with the overall presentation of this full-series collection; it's durable, impressively stately without being ostentatious (like President Jed Bartlet himself), and guaranteed to look great on any bookshelf.\", '--Jeff Shannon']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC, Box set', 'Contributor': 'Martin Sheen, Allison Janney, John Spencer', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '45', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '11.75 x 8 x 3.25 inches; 4.01 Pounds', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC, Box set', 'Run time': '112 hours and 10 minutes', 'Release date': 'November 7, 2006', 'Actors': 'Martin Sheen, Allison Janney, John Spencer', 'Subtitles': 'Spanish, French', 'Studio': 'Warner Home Video', 'Number of discs': '45'}\nBinge-watched during a bout of the flu, and it was an incredibly enjoyable escape from that misery.  Wish there were more political series like this, with a moral compass.  The Netflix series &#34;House of Cards&#34; may be a more accurate portrayal of our currently corrupt political situation, sadly.\nWish there were more political series like this, with a moral compass\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Baz Luhrmann'], 'Producers': ['Baz Luhrmann', 'Catherine Martin', 'Douglas Wick', 'Lucy Fisher', 'Catherine Knapman'], 'Starring': ['Leonardo DiCaprio', 'Tobey Maguire', 'Carey Mulligan']}\nDo not waste your time or money with this version, unless you are a teeny bopper in love with DiCaprio and have to see everything he ever acted in.  From the initial screen to the last credits, this movie is a complete failure.  The art deco frame on the initial screen overpowers the information it surrounds.  There is HIP HOP music in a 1920's Charleston era film! The dancing sucks and the crowd scenes are filled with people who don't look at all like people of the era.  The supporting characters are extremely poorly developed and in some cases so wooden that they might as well be mannequins. It is not the fault of the actors, it's the terrible script and direction that they were subjected to. The stage set looks like something concocted by Disney, not at all like a 1920's mansion.  Even DiCaprio's character is only marginally believable.  And to top it all off, the DVD is encrusted with 8 or 9 previews.  Again, save your money for an earlier version, e.g. with Robert Redford.  Too bad, Mr. Luhrmann, your \"Strictly Ballroom\" was a very good movie.\nA dreadful remake!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Trygve Allister Diesen', 'Peter Medak', 'Jeff T. Thomas', 'Rudy Bednar', 'Adam Feinstein'], 'Producers': ['Jeff T. Thomas', 'Rudy Bednar', 'Linda Berman', 'James Elkus', 'Gary Tuck', 'Andrew Chapman', 'Morgan Hertzan']}\nI rarely comment on videos but this one is an engaging spy thriller that just happens to be a true story.  From the research I have done since watching the whole thing, I've concluded that the makers of this series tried very hard to bring facts to life. I deplore violence in movies and there is some of that, but it is in the service of the story and not glorified.  Squeamish viewers like me may want to look away while some of the assets get brutalized by the KGB.  I am surprised at the movie's apparent lack of commercial success, because it is both compelling and educational.  Recommended for binge watching.\nCompelling and informative movie\nThe Sapphires\nChris O'Dowd  (Actor),     Deborah Mailman  (Actor),     Wayne Blair  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Editor's Picks\n['our smart, gutsy young Australian Aboriginal women become unlikely stars in the most unlikely of places, with the most unlikely of allied, in THE SAPPHIRES. Set in 1968, the film follows Gail, Cynthia, Julie and Kay as they seize the risky, but irresistible chance to launch a professional music career singing for U.S. troops in Vietnam. Under the tutelage of an R&B loving Irish musician, Dave Lovelace, the girls transform themselves into a sizzling soul act and set out to make a name for themselves hundreds of miles from home. Inspired by a true story, THE SAPPHIRES is a triumphant celebration of youthful emotion, family and music.']\n{'Genre': 'Comedy', 'Format': 'NTSC, Widescreen', 'Contributor': \"Shari Sebbens, Tory Kittles, Harvey Weinstein, Tony Briggs, Bob Weinstein, Jessica Mauboy, Keith Thompson, Deborah Mailman, Chris O'Dowd, Miranda Tapsell, Wayne BlairShari Sebbens, Tory Kittles, Harvey Weinstein, Tony Briggs, Bob Weinstein, Jessica Mauboy, Keith Thompson, Deborah Mailman, Chris O'Dowd, Miranda Tapsell, Wayne Blair  See more\", 'Language': 'English', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '60736', 'Director': 'Wayne Blair', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'August 6, 2013', 'Actors': \"Chris O'Dowd, Deborah Mailman, Jessica Mauboy, Shari Sebbens, Miranda Tapsell\", 'Subtitles': 'Spanish, English', 'Producers': 'Bob Weinstein, Harvey Weinstein', 'Studio': 'Lionsgate', 'Writers': 'Tony Briggs, Keith Thompson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat book, not about the guy on the cover!  Cover should change to reflect what the story is REALLY about.\nGreat book, not about the guy on the cover\nLand Girls Collection Set\nNathaniel Parker  (Actor),     Sophie Ward  (Actor),     Various  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Against the backdrop of war-torn 1940's England, Land Girls follows the lives and loves of the girls away from home, doing their bit for Britain in the Women's Land Army during World War II. Includes: Series 1 to 3\"]\n{'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Sophie Ward, Nathaniel Parker, Various', 'Language': 'English', 'Number Of Discs': '6', 'Runtime': '12 hours', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8 x 5.75 x 3 inches; 1.2 Pounds', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '12 hours', 'Release date': 'October 30, 2012', 'Actors': 'Nathaniel Parker, Sophie Ward', 'Studio': 'Bfs Entertainment', 'Number of discs': '6'}\nLand Girls, Bomb Girls, both essential to understand WW2 women's situation, plus very entertaining.\nFive Stars\nMiss Fisher's Murder Mysteries 1\nEssie Davis  (Actor),     Nathan Page  (Actor),     Tony Tilse  (Director),     Daina Reid  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Mystery & Suspense\n['Based on the novels by Kerry Greenwood  “A blockbuster hit” —', 'The Sydney Morning Herald', '“Witty and elegant” —', 'The Australian', 'Seen on public television  In 1920s Melbourne, the Honorable Phryne Fisher (Essie Davis,', 'Girl with a Pearl Earring', ') is a thoroughly modern woman operating in a mostly male world. The glamorous “lady detective” goes about her work with a pistol close at hand—and, more often than not, a male admirer even closer.  To the dismay of Detective Inspector Jack Robinson (Nathan Page,', 'The Secret Life of Us', '), Phryne’s investigations take her through back alleys, jazz clubs, and shady neighborhoods. Ignoring the dangers all around her, she glides through life determined to enjoy every moment. But beneath her devil-may-care attitude, Phryne hides ghosts from the past that continue to haunt her.  Gorgeously costumed and evocatively shot, Miss Fisher’s Murder Mysteries also stars Hugo Johnstone-Burt (', 'Cloudstreet', '), Ashleigh Cummings (', 'Tomorrow, When the War Began', '), Miriam Margolyes (', 'Little Dorrit', '), and Nicholas Bell (', 'Shine', '). Miranda Otto (', 'The Lord of the Rings', ') guest stars.  Contains violence, coarse language, nudity, sexual situations, and drug use']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Nathan Page, David Caesar, Essie Davis, Daina Reid, Richard Bligh, Tony Tilse, Ashleigh Cummins, Hugo Johnstone-BurtNathan Page, David Caesar, Essie Davis, Daina Reid, Richard Bligh, Tony Tilse, Ashleigh Cummins, Hugo Johnstone-Burt  See more', 'Language': 'English', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '8934', 'Director': 'Tony Tilse, Daina Reid, David Caesar', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '11 hours and 46 minutes', 'Release date': 'March 26, 2013', 'Actors': 'Essie Davis, Nathan Page, Hugo Johnstone-Burt, Ashleigh Cummins, Richard Bligh', 'Studio': 'Acorn', 'Number of discs': '4'}\nWow, Phriney Fisher... more, please.  How about a series 4?\nFive Stars\nA Lego Brickumentary\nJason Bateman  (Actor),     Daniel Junge  (Director),     Kief Davidson  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n[\"LEGO bricks have captured imaginations for generations, and today, the community of builders is bigger than ever: Adult Fans of LEGO (AFOLs) display their latest creations at Brick Conventions, self-proclaimed Master Builders create entire worlds out of the modular bricks, and a corporate design team plans the Times Square unveiling of the largest LEGO model ever created. Directed by Oscar-winner Daniel Junge and Oscar- nominee Kief Davidson, Beyond the Brick: A LEGO Brickumentary playfully delves into the extraordinary impact of the LEGO brick , its massive global fan base, and the innovative uses for it that have sprung up around the world. Junge and Davidson's delightful survey of boundless and surprising creativity will inspire audiences of all ages rediscover their inner child\"]\n{'Genre': 'Documentary', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Jason Bateman, Daniel Junge, Kief Davidson', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '35219313', 'Director': 'Daniel Junge, Kief Davidson', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'November 3, 2015', 'Actors': 'Jason Bateman', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFor those of us who love LEGOs this is a fascinating documentary\nFive Stars\nI Know Where I'm Going! (The Criterion Collection) (1945) [DVD]\nPamela Brown  (Actor),     Petula Clark  (Actor),     Michael Powell  (Director, Producer),     Emeric Pressburger  (Director, Producer)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Criterion Collection, All\n['Product Description', 'A young woman (Hiller) is determined to marry a wealthy man in the Hebrides for money, but on the way there she gets stranded in a sea coast town where she meets and falls in love with a handsome young navy officer instead.', 'Amazon.com', 'Assured, headstrong Joan Webster (Wendy Hiller) knows exactly what she wants and how to get it, until she\\'s stranded in a rough, windswept Scottish village--in sight but out of reach of an island where a rich fiancée, a lavish wedding, and a loveless marriage await. While a raging storm prevents her crossing, a quiet, modest, and penniless Scottish laird named Torquil (Roger Livesey) slowly wins her cheerfully mercenary heart and upsets her carefully arranged plans with messy emotions. Michael Powell and Emeric Pressburger\\'s much-loved romantic drama is a handsome work full of vivid, offbeat characters (Pamela Brown is especially striking as an earthy villager always accompanied by a pack of bloodhounds) living in a world that\\'s part tradition and part myth. Villagers work and celebrate with the simple spirit of common folk (\"We\\'re not poor, we just haven\\'t any money,\" Torquil admonishes the materialist Joan). Powell brings his lively manner and bold visual invention to the creation of his beautiful but harsh primal paradise, culminating in the awesome spectacle of a massive whirlpool that could be the work of the \"legend of Corryvreckan\" or the stormy embodiment of Joan\\'s hysterical heart. Awash in mystic power of ancient castles and chanted legends,', \"I Know Where I'm Going\", \"is one of the most romantic visions of Britain's most magical director.\", '--Sean Axmaker']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'CRRNKNO30DVD', 'Director': 'Michael Powell, Emeric Pressburger', 'Media Format': 'Multiple Formats, Closed-captioned, NTSC, Black & White', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Pamela Brown, Petula Clark, Finlay Currie, Wendy Hiller, Roger Livesey', 'Subtitles': 'English', 'Producers': 'George R. Busby, Michael Powell, Emeric Pressburger', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI always wondered where that song came from!  Now I know.  But the version in the movie isn't quite right.  If you love classic romantic movies and Scotland, you will like this.  Be sure to watch the special features.\nIf you love classic romantic movies and Scotland\nMonarch of the Glen: The Complete Collection\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Monarch of the Glen: The Complete Collection (Repackage/DVD)', 'Now assembled in one collectors set, every episode of the immensely popular BBC series,', 'Monarch of the Glen', '! Set against t spectacular scenery of the Scottish Highlands, this immensely popular, heart-warming drama centers around an ancient castle, a collection of tartan-clad eccentrics and the handsome new master of the impoverished estate.', 'Monarch of the Glen', \"is one of the BBC's international success stories. From America to Vietnam, fans around the world have fallen in love with the beautiful Scottish countryside and the story of Glenbogle.\", ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0)', 'Number Of Discs': '18', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 4.25 inches; 1.95 Pounds', 'Item model number': '15399257', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '51 hours and 31 minutes', 'Release date': 'December 28, 2010', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '18'}\nFantastic scenery, engaging characters including the now-famous Julian Fellowes.  I was sorry to see the series end.\nFive Stars\nTHE SHAPE OF THE WORLD\nPatrick Stewart  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Documentary\n['Product Description', 'The epic tale of mapping the globe', 'As seen on PBS', '\"Explores the history of mapmaking with elegance and intelligence\" --', 'The New York Times', 'How do we see the world? Some ancients believed it rode on the back of a turtle. The Greeks viewed it as a sphere and measured it with astonishing accuracy. Today, scientists monitor it from space, detecting complex climate patterns that threaten our survival.', 'Narrated by Patrick Stewart', '(', 'X-Men, Star Trek: The Next Generation', '), this fascinating six-part series traces the history of mapmaking from crude clay tablets to sophisticated electronic screens. Internationally respected historians, NASA scientists, and other experts explain how humans rely on imagination, observation, and mathematics to create pictures that make sense of our world. Throughout history, maps have served as symbols of wealth and power, tools of conquest and subjugation, and instruments for saving lives. They once held information worth killing for, and now they offer clues that might avert global destruction.', 'Award-winning actor Patrick Stewart narrates this acclaimed series, produced in consultation with the British Library and Royal Geographical Society--the world’s largest scholarly organization dedicated to the science of geography.', 'SPECIAL FEATURES', '20-page viewer’s guide includes highlights, questions to consider, avenues for further learning, \"Tools of the Mapmaker’s Trade,\" \"The Math Behind a Map,\" and \"Myths on Maps.\"', '20-page viewer’s guide includes highlights, questions to consider, avenues for further learning, \"Tools of the Mapmaker’s Trade,\" \"The Math Behind a Map,\" and \"Myths on Maps.\"', '\"The Chartbusters\": pioneers in cartography', '\"The Chartbusters\": pioneers in cartography', 'Text interview with Patrick Stewart', 'Text interview with Patrick Stewart', 'Biographies of Stewart and series editor Simon Berthon', 'Biographies of Stewart and series editor Simon Berthon', 'Exclusive web extras', 'Exclusive web extras', 'Amazon.com', 'Shown on PBS when the series was first released,', 'The Shape of the World', 'has until now only had limited availability through VHS. Now readily available on DVD, these six 50-minute episodes will, for those of us for whom world geography is a foggy haze, serve as a welcome crash course. Why do maps matter and what are their political implications? While this topic may sound dry,', 'The Shape of the World', 'is ultimately fascinating, especially as narrated by Patrick Stewart of', 'Star Trek', 'fame. Produced in consultation with the British Library and the Royal Geographical Society, the series functions like a college course: episodes are broken up chronologically and thematically and there’s even a 20-page supplementary booklet that asks pertinent questions about each show. All in all, it reminds one just how arbitrary and subjective drawing up a map can be.', 'Episode One, \"Heaven and Earth,\" starts the series off on a lofty cosmological note, detailing beliefs in Egypt, China, ancient Greece, and Europe regarding the shape of the planet and how Earth was formed. Opening with scenes set at a map-reading ceremony on the island of Java, the episode covers both indigenous cultural views and Western philosophy with adept acuity. Philosophers and museum curators show works of art that encapsulate past beliefs, and the subject matter is far-reaching. Where did Ptolemy\\'s accurate maps disappear to during the Middle Ages? And how does the history of silk production factor into influencing worldviews about a round earth versus a flat one? Each ensuing episode follows similarly. Episodes three and four, \"Staking a Claim\" and \"Empire!\" survey naval exploration of the Americas and the French, English, and Dutch colonization of countries such as India and Australia to illustrate how the New World was mapped out based on a few men\\'s opinions. Native Americans and Indian scholars alike are interviewed on historical topics, and for these reasons the show feels round, as if it\\'s offering a holistic view in efforts to create a more accurate map of public opinion. One of the best parts about the series is that important maps are discussed politically, economically, and artistically.', 'Episode six, \"The Writing on the Screen,\" shows us what in 1990 was a new technology invented for ambulances: GPS driving systems. Though this and other later episodes feature dated computer technology, it is interesting to meditate on our advances and to consider what purposes inventions were originally meant to serve versus what they are presently used for.', '--Trinie Dalton']\n{'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Patrick Stewart', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '5 hours and 6 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.8 inches; 10.4 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '5 hours and 6 minutes', 'Release date': 'August 4, 2009', 'Actors': 'Patrick Stewart', 'Studio': 'Athena', 'Number of discs': '3'}\nI love maps so I was very interested in this documentary.  Much was new to me.\nFour Stars\nBomb Girls - The Complete First & Second Series [DVD]\nMeg Tilly  (Actor, Host),     Jodi Balfour  (Actor, Host),     Adrienne Mitchell  (Director, Host),     Ken Girotti  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD\n[\"All 18 episodes from the first two seasons of the Canadian wartime drama about a group of women who take over the jobs in the munitions factories as the men go away to war. The show follows Gladys (Jodi Balfour), Kate (Charlotte Hegele), Betty (Ali Liebert) and Lorna (Meg Tilly) as they come up against a variety of different challenges while embracing their newfound freedom from traditional cultural stereotypes. Series one episodes are: 'Jumping Tracks', 'Misfires', 'How You Trust', 'Bringing Up Bombshell', 'Armistice' and 'Elements of Surprise'. Series two episodes are: 'The Quickening', 'Roses Red', 'The Enemy Within', 'Guests of Honour', 'The Harder We Fight', 'Where There's Smoke', 'Party Line', 'Fifth Column', 'Something Fierce', 'Romeo Foxtrot', 'Kings and Pawns' and 'Blood Relations'. English language.\"]\n{'Format': 'PAL', 'Contributor': 'Peter Outerbridge, Bomb Girls - Complete Series One and Two, Ali Liebert, Richard Fitzpatrick, Meg Tilly, Anastasia Phillips, Antonio Cupo, Jodi Balfour, James McGowan, Bomb Girls (Complete Series 1 & 2) - 6-DVD Box Set, Adrienne Mitchell, Natasha Greenblatt, Ken Girotti, Charlotte Hegele, Bomb Girls (Complete Series 1 & 2) - 6-DVD Box Set ( Bomb Girls - Complete Series One and Two )Peter Outerbridge, Bomb Girls - Complete Series One and Two, Ali Liebert, Richard Fitzpatrick, Meg Tilly, Anastasia Phillips, Antonio Cupo, Jodi Balfour, James McGowan, Bomb Girls (Complete Series 1 & 2) - 6-DVD Box Set, Adrienne Mitchell, Natasha Greenblatt, Ken…   See more', 'Language': 'English (Dolby Digital 2.0)', 'Number Of Discs': '6', 'Runtime': '759 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.48 x 5.35 x 1.02 inches; 7.76 Ounces', 'Director': 'Adrienne Mitchell, Ken Girotti', 'Media Format': 'PAL', 'Run time': '759 minutes', 'Release date': 'April 21, 2014', 'Actors': 'Meg Tilly, Jodi Balfour, Charlotte Hegele, Ali Liebert, Anastasia Phillips', 'Producers': 'Bomb Girls (Complete Series 1 & 2) - 6-DVD Box Set ( Bomb Girls - Complete Series One and Two ), Bomb Girls (Complete Series 1 & 2) - 6-DVD Box Set, Bomb Girls - Complete Series One and Two', 'Studio': 'Kaleidoscope Home Entertainment', 'Number of discs': '6'}\nLand Girls, Bomb Girls, both essential to understand WW2 women's situation, plus very entertaining.  This particular Canadian series does not get the exposure it deserves.  Very well done.\nLand Girls, Bomb Girls, both essential to understand ...\nThe New Corporation: The Unfortunately Necessary Sequel\nJennifer Abbott  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n['This product is an authorized manufactured on demand DVD-R']\n{'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.48 x 5.35 x 0.51 inches; 2.89 Ounces', 'Director': 'Jennifer Abbott', 'Media Format': 'NTSC', 'Run time': '105 minutes', 'Release date': 'May 24, 2022', 'Subtitles': 'English', 'Studio': 'Gravitas Ventures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of the biggest issues of our time. The issue persists even after we learned in the first edition of this video that corporations are basically sociopaths.  in fact our Supreme Court has declared that corporations are entitled to some of the privileges of individual humans.  Sadly, the necessary sequel does not have all the necessary backup material, nor does it articulate a path forward so that citizens can correct the egregious mistake, such as \"sunsetting\" corporate charters automatically unless they can prove a social benefit.  Yes the sequel is \"necessary\" but not sufficient.\nNot as good as the original",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Not as good as the original",
    "text": "This is one of the biggest issues of our time. The issue persists even after we learned in the first edition of this video that corporations are basically sociopaths.  in fact our Supreme Court has declared that corporations are entitled to some of the privileges of individual humans.  Sadly, the necessary sequel does not have all the necessary backup material, nor does it articulate a path forward so that citizens can correct the egregious mistake, such as \"sunsetting\" corporate charters automatically unless they can prove a social benefit.  Yes the sequel is \"necessary\" but not sufficient.",
    "images": [],
    "asin": "B09TFYLFP1",
    "parent_asin": "B09TFYLFP1",
    "user_id": "AH42EJUAZSXIRYO477J4DVJ3H6RA",
    "timestamp": "2023-02-28 16:13:31.868000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The New Corporation: The Unfortunately Necessary Sequel",
    "average_rating": 4.2,
    "rating_number": 90,
    "features": [],
    "description": [
      "This product is an authorized manufactured on demand DVD-R"
    ],
    "price": 17.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41z0QfDX6zL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41z0QfDX6zL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71jrBpet3UL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Jennifer Abbott  (Director)    Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Special Interests"
    ],
    "details": {
      "MPAA rating": "NR (Not Rated)",
      "Package Dimensions": "7.48 x 5.35 x 0.51 inches; 2.89 Ounces",
      "Director": "Jennifer Abbott",
      "Media Format": "NTSC",
      "Run time": "105 minutes",
      "Release date": "May 24, 2022",
      "Subtitles": "English",
      "Studio": "Gravitas Ventures",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}