{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: THE PALLISERS: 40TH ANNIVERSARY EDITION\nReview Date: 2014/09/17\nStore: Susan Hampshire  (Actor),     Philip Latham  (Actor),     Hugh David  (Director),     Ronald Wilson  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['“In the grand tradition of', 'The Forsyte Saga', 'and', 'Upstairs, Downstairs', '” —', 'Time', 'magazine  “Powerfully addictive” —', 'Time', 'magazine “Chronicles the passion and politics of Victorian England” —', 'Los Angeles Times', 'This sprawling BBC saga follows an aristocratic family through three generations of power, wealth, intrigue, and scandal in Victorian England. Based on Anthony Trollope’s “political” novels and adapted by British author Simon Raven (', 'Alms for Oblivion', '), this classic PBS series has captivated audiences on both sides of the Atlantic.  Emmy', '®', 'winner Susan Hampshire (', 'The Forsyte Saga', ') stars as the beautiful and witty Lady Glencora, whose arranged marriage to rising politician Plantagenet Palliser (Philip Latham, “marvelous from beginning to end” —', 'The New York Times', ') endures public and private crises as the family ascends the social ladder. The outstanding cast also features Jeremy Irons (', 'The Borgias', '), Derek Jacobi (', 'The King’s Speech', '), Anthony Andrews (', 'Brideshead Revisited', '), Peter Vaughan (', 'The Remains of the Day', '), and Penelope Keith (', 'To the Manor Born', ').']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'NTSC, Subtitled', 'Contributor': 'Susan Hampshire, Philip Latham, Ronald Wilson, Hugh David, Peter Vaughan, Jeremy Irons, Penelope Keith, Derek Jacobi, Anthony AndrewsSusan Hampshire, Philip Latham, Ronald Wilson, Hugh David, Peter Vaughan, Jeremy Irons, Penelope Keith, Derek Jacobi, Anthony Andrews  See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.8 Ounces', 'Item model number': '27617990', 'Director': 'Hugh David, Ronald Wilson', 'Media Format': 'NTSC, Subtitled', 'Run time': '22 hours and 20 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Susan Hampshire, Philip Latham, Jeremy Irons, Derek Jacobi, Anthony Andrews', 'Subtitles': 'English', 'Studio': 'Acorn Media', 'Number of discs': '1'}\nReview Text: Oh, who can forget how much fun it was to watch this series when it first came out?  The Susan Hampshire interviews are interesting too.\nReview Title: who can forget how much fun it was to watch this series when it first ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "LEGO Ninjago Masters of Spinjitzu (DVD)\nVarious  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video\n['Product Description', 'LEGO Ninjago Masters of Spinjitzu', 'Masters of Spinjitzu: a new force to save the world! The world of Ninjago is in terrible danger. An army of skeletons has invaded from the underworld, under the command of the evil Lord Garmadon. Their goal: capture the Four Weapons of Spinjitzu, artifacts so powerful it is said no one being can wield them all at once. Now Garmadon’s brother, the heroic Sensei Wu, must gather four young men and train them in the ways of the ancient art of Spinjitzu. These four – Kai, Jay, Zane and Cole – must become ninja and stand against the dark power of Garmadon and his evil skeleton army. If they fail, the four weapons will be lost and Ninjago doomed forever.', ']]>', 'Amazon.com', 'The two-part adventure', 'Ninjago: Masters of Spinjitzu', \"is based on a line of toys Lego introduced in 2011. Kai, a young blacksmith, is eager--too eager--to forge a great sword. He initially snubs the unassuming Sensei Wu, the master of Spinjitzu martial arts. When Kai's sister Nya is kidnapped by Samukai and his skeleton army from the Underworld, Wu realizes the evil Garmadon is using Samukai to find four legendary weapons that will give him enormous power. Wu trains Kai to join his student-warriors, Jay, Zane, and Cole, and keep Garmadon from seizing power.\", 'Masters of Spinjitzu', \"is a lightweight, product-based adventure, but it's not a terribly original one. The training sequence, which pits Kai against a series of armed mechanical devices, borrows heavily from\", 'Kung Fu Panda', '. Other elements recall', 'Naruto', 'and', 'Teenage Mutant Ninja Turtles', ', and the filmmakers blithely mix Chinese, Japanese, and Western elements. But little kids who love their Lego toys will probably overlook these shortcoming and enjoy the adventure, which is obviously designed to kick off a series. Parents should be prepared to field requests for the many toys that appear in', 'Masters of Spinjitzu', '. (Unrated; suitable for ages 5 and older: cartoon violence)', '--Charles Solomon']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25195594', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Animated', 'Run time': '44 minutes', 'Release date': 'March 27, 2012', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nOur 5 year old grandson can't get enough of the Ninjago series.  I wish all of season 3 would be available in the USA, but apparently it's not.  (Why can other countries get it and we can't? Bummer!)  One thing I, as a septuagenarian adult, like very much is that the characters have a moral compass, even though there is the usual cartoon mayhem.  Also, the oriental aesthetic is a refreshing change from the ordinary cartoon graphics.  Well done.\nFrom the grandparents of a 5 year old boy\nLEGO Ninjago: Masters of Spinjitzu: Season 2\nMichael Helmuth Hansen  (Director),     Trylle Vilstrup  (Director),     Vincent Tong  (Actor),     Kirby Morrow  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Musicals & Performing Arts\n['LEGO Ninjago: Masters of Spinjitzu Season Two', 'Since Lord Garmadon’s disappearance from the Underworld, Ninjago has been at peace; but when Garmadon’s son, Lloyd, releases the five ancient warring tribes of the Serpentine, the Ninja had to learn how to unlock their full potential in order to combat the growing threat. The Ninja also learned of a prophecy that one of them will become the Green Ninja – a warrior destined to defeat the Dark Lord in the ultimate battle of good versus evil. In the first season, the Ninjas unlocked their full elemental powers. Meanwhile, the Serpentine released the all-consuming snake known as the Great Devourer. In the climactic finale, the Ninja had to rely on Lord Garmadon and his ability to wield the Four Golden Weapons in order to destroy the Great Devourer and bring peace. In the end, the Ninja are heralded as heroes, but Lord Garmadon has disappeared with the very weapons he needed in order to turn Ninjago into his evil image.', ']]>']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Brian Drummond, IRENE SPARRE, John Novak, Mark Oliver, Trylle Vilstrup, Erik Wilstrup, Michael Adamthwaite, Martin Skov, Michael Helmuth Hansen, Vincent Tong, Mackenzie Gray, Kirby Morrow, Jillian Michaels, Kelly Metzger, Colin Murdock, Brent Miller, Torsten Jacobsen, Paul DobsonBrian Drummond, IRENE SPARRE, John Novak, Mark Oliver, Trylle Vilstrup, Erik Wilstrup, Michael Adamthwaite, Martin Skov, Michael Helmuth Hansen, Vincent Tong, Mackenzie Gray, Kirby Morrow, Jillian Michaels, Kelly Metzger, Colin Murdock, Brent Miller, Torsten Jacobsen…  See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '26337710', 'Director': 'Michael Helmuth Hansen, Trylle Vilstrup, Martin Skov', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '4 hours and 46 minutes', 'Release date': 'March 5, 2013', 'Actors': 'Vincent Tong, Kirby Morrow, Michael Adamthwaite, Brent Miller, Paul Dobson', 'Producers': 'IRENE SPARRE, Torsten Jacobsen, Erik Wilstrup', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nThis is a great fantasy series which grandparents can enjoy with their lego-obsessed grandsons, then go out and get some of the sets and build the vehicles etc.  Not lacking in moral content, either.  The boy is going to be Lloyd, the green ninja, this halloween.\nThis is a great fantasy series which grandparents can enjoy with their lego-obsessed ...\nLEGO Ninjago: The Complete First Season (DVD)\nVincent Tong  (Actor),     Kirby Morrow  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'LEGO Ninjago: Masters of Spinjitzu Season One', \"Since Lord Garmadon's disappearance from the Underworld, Ninjago has been at peace; but when Garmadon's son, Lloyd, releases the five ancient warring tribes of the Serpentine, the Ninja had to learn how to unlock their full potential in order to combat the growing threat. The Ninja also learned of a prophecy that one of them will become the Green Ninja – a warrior destined to defeat the Dark Lord in the ultimate battle of good versus evil. In the first season, the Ninjas unlocked their full elemental powers. Meanwhile, the Serpentine released the all-consuming snake known as the Great Devourer. In the climactic finale, the Ninja had to rely on Lord Garmadon and his ability to wield the Four Golden Weapons in order to destroy the Great Devourer and bring peace. In the end, the Ninja are heralded as heroes, but Lord Garmadon has disappeared with the very weapons he needed in order to turn Ninjago into his evil image.\", ']]>', 'Amazon.com', 'Ninjago', 'is an action TV series that\\'s based on the Lego toys and features the martial arts-inspired \"spinjitzu\": basically a combination of martial arts performed with weapons like swords, scythes, nunchucks, and shurikens combined with very fast spinning.', 'Ninjago: Masters of Spinjitzu, Season One', \"begins after the series pilot episode and follows ninjas Kai, Cole, Jay, and Zane as they study their craft with Sensei Wu. The four hope to unleash their inner potential in preparation for defending the world against the return of the Dark Lord Garmadon. Prophecy states that one ninja will rise above the others to become the Green Ninja, who is destined to defeat Garmadon. Unfortunately, the four young ninjas are poorly disciplined and more interested in video games (Lego's\", 'Ninjago', \", of course) and food fights than actual training. But when Garmadon's son Lloyd escapes from a boarding school for bad boys and accidentally releases an army of snakes, the ninjas suddenly have a reason to get serious about their training, as the snakes are a threat to the entire land of Ninjago. Sensei Wu is a wise teacher and the young ninjas develop their skills quickly, learning to use their four special weapons in a way that releases their elemental powers. But fate has a surprise for everyone when Lloyd is captured by the snakes and Sensei Wu informs the ninjas that they must rescue him. The question of which of the four ninjas will become the Green Ninja causes no end of bickering among the boys, even as they work together to rescue Lloyd and save Ninjago from the serpents. Interestingly, Kai's sister Nya also plays an unexpectedly important role in the mission to save Ninjago. The surprises just keep coming as five tribes of snakes band together in a quest to release an evil monster known as the Devourer, and eventually the ninjas find Lloyd training right alongside them. The action and suspense throughout this series is good, even if the ninjas often act like unruly prepubescent boys, and there are plenty of important life lessons woven throughout. (Ages 7 to 12)\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family, Animation, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Vincent Tong, IRENE SPARRE, Kirby Morrow, John Novak, Jillian Michaels, Erik Wilstrup, Colin Murdock, Michael Adamthwaite, Ian James Corlett, Torsten Jacobsen, Paul DobsonVincent Tong, IRENE SPARRE, Kirby Morrow, John Novak, Jillian Michaels, Erik Wilstrup, Colin Murdock, Michael Adamthwaite, Ian James Corlett, Torsten Jacobsen, Paul Dobson   See more', 'Language': 'Unqualified (Dolby Surround)', 'Runtime': '4 hours and 46 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 3.2 Ounces', 'Item model number': '25297567', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '4 hours and 46 minutes', 'Release date': 'June 26, 2012', 'Actors': 'Vincent Tong, Kirby Morrow, Michael Adamthwaite, Paul Dobson, Jillian Michaels', 'Producers': 'IRENE SPARRE, Torsten Jacobsen, Erik Wilstrup', 'Studio': 'Warner Home Video', 'Number of discs': '2'}\nSeasons one and two are the best, can be viewed over and over without losing their charm.  By far the best movie series Lego has produced.  Good action pace, good graphics, engaging story lines, fun characters - seasons one and two are winners.\nSeasons one and two are the best, can be viewed over and over without losing ...\nLEGO:NINJAGO:MASTERS SPINJITZU:REBTD: Season 3 Battle for New Ninjago City Season 3 Part 1\nVincent Tong  (Actor),     Kirby Morrow  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['LEGO Ninjago: Rebooted: Battle for New Ninjago City Season Three Part One (DVD)', 'Victory in the Final Battle between the Gold Ninja and the Overlord has ushered in a new era of peace and begun a technological renaissance. Time has passed and the Ninja have become obsolete in this new hi-tech world. Just when they think all is safe in Ninjago, they’re called back into action when the reclusive inventor Cyrus Borg warns them the Overlord has survived as a digital virus and is trapped within the Digiverse. The Ninja will learn the Overlord seeks to steal Lloyd’s golden power to enable him to escape his digital prison and reign as the great prophesized destructor, “The Golden Master”. And to aid his villainous plot, he’s created a new technological menace more powerful than any foe the Ninja have ever faced – Nindroids.', ']]>']\n{'Genre': 'Kids & Family, Animation, Action & Adventure', 'Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC, Widescreen', 'Contributor': 'Scott McNeil, Lee Tockar, Erik Wilstrup, Michael Adamthwaite, Jilian Michaels, Vincent Tong, Jennifer Hayward, Kirby Morrow, Alan Marriott, Kelly Metzger, Kathleen Barr, Brent Miller, Torsten Jacobsen, Paul DobsonScott McNeil, Lee Tockar, Erik Wilstrup, Michael Adamthwaite, Jilian Michaels, Vincent Tong, Jennifer Hayward, Kirby Morrow, Alan Marriott, Kelly Metzger, Kathleen Barr, Brent Miller, Torsten Jacobsen, Paul Dobson  See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'WHV1000490372DVD', 'Media Format': 'Multiple Formats, Animated, Color, Full Screen, NTSC, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'August 5, 2014', 'Actors': 'Vincent Tong, Kirby Morrow, Michael Adamthwaite, Brent Miller, Paul Dobson', 'Producers': 'Torsten Jacobsen, Erik Wilstrup', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nThe original 3 series were better, because the action was less confusing and there was more of a coherent story.  To the creators: Please go back to that thoughtful place where you carefully crafted the original series.\nThe original 3 series were better, because the action was less confusing and there ...\nTHE PALLISERS: 40TH ANNIVERSARY EDITION\nSusan Hampshire  (Actor),     Philip Latham  (Actor),     Hugh David  (Director),     Ronald Wilson  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['“In the grand tradition of', 'The Forsyte Saga', 'and', 'Upstairs, Downstairs', '” —', 'Time', 'magazine  “Powerfully addictive” —', 'Time', 'magazine “Chronicles the passion and politics of Victorian England” —', 'Los Angeles Times', 'This sprawling BBC saga follows an aristocratic family through three generations of power, wealth, intrigue, and scandal in Victorian England. Based on Anthony Trollope’s “political” novels and adapted by British author Simon Raven (', 'Alms for Oblivion', '), this classic PBS series has captivated audiences on both sides of the Atlantic.  Emmy', '®', 'winner Susan Hampshire (', 'The Forsyte Saga', ') stars as the beautiful and witty Lady Glencora, whose arranged marriage to rising politician Plantagenet Palliser (Philip Latham, “marvelous from beginning to end” —', 'The New York Times', ') endures public and private crises as the family ascends the social ladder. The outstanding cast also features Jeremy Irons (', 'The Borgias', '), Derek Jacobi (', 'The King’s Speech', '), Anthony Andrews (', 'Brideshead Revisited', '), Peter Vaughan (', 'The Remains of the Day', '), and Penelope Keith (', 'To the Manor Born', ').']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'NTSC, Subtitled', 'Contributor': 'Susan Hampshire, Philip Latham, Ronald Wilson, Hugh David, Peter Vaughan, Jeremy Irons, Penelope Keith, Derek Jacobi, Anthony AndrewsSusan Hampshire, Philip Latham, Ronald Wilson, Hugh David, Peter Vaughan, Jeremy Irons, Penelope Keith, Derek Jacobi, Anthony Andrews  See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.8 Ounces', 'Item model number': '27617990', 'Director': 'Hugh David, Ronald Wilson', 'Media Format': 'NTSC, Subtitled', 'Run time': '22 hours and 20 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Susan Hampshire, Philip Latham, Jeremy Irons, Derek Jacobi, Anthony Andrews', 'Subtitles': 'English', 'Studio': 'Acorn Media', 'Number of discs': '1'}\nOh, who can forget how much fun it was to watch this series when it first came out?  The Susan Hampshire interviews are interesting too.\nwho can forget how much fun it was to watch this series when it first ...",
  "profile": "The user maintains a strong preference for family-friendly animated series that blend action with moral lessons suitable for younger audiences. Their recent engagement with a popular children's DVD reinforces their commitment to content promoting character integrity and thoughtful storytelling, aligning with their values of cultural diversity and excitement, which they enjoy sharing with their grandchildren.\n\nAs a septuagenarian, the user prioritizes accessible, high-quality content that resonates across generations, emphasizing the importance of shared family experiences through engaging narratives. They appreciate rewatchable content that imparts foundational values, ensuring meaningful lessons for young viewers while still appealing to older generations. \n\nIn a recent purchase of a classic drama series, the user demonstrated an appreciation for content that offers rich storytelling and character development, reflecting their discerning taste. They fondly recall the enjoyment of watching series from their past, further showing their interest in narratives that captivate and educate. \n\nWhile acknowledging changes in programming over time, the user remains committed to discovering animations that foster family bonding and feature lively characters and exciting storylines. Their thoughtful approach to children's programming showcases an ongoing interest in content that entertains while imparting essential lessons.",
  "metrics": {
    "rouge1_f": 0.0781010719754977,
    "rouge2_f": 0.008429118773946361,
    "rougeL_f": 0.04211332312404288,
    "meteor": 0.02284073481906875,
    "bleu1": 1.2325235497033954e-07,
    "bleu2": 4.077297090740084e-08,
    "bleu3": 5.894742463157668e-09,
    "bleu4": 2.2440723588352795e-09,
    "bertscore_precision": 0.31482160091400146,
    "bertscore_recall": 0.49791574478149414,
    "bertscore_f1": 0.3857448697090149
  }
}