{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MINETAN BODY.SKIN Tan Booster Foam - Boosts Color Results for Deeper, Darker, Longer Lasting Results, 10.14 fl oz\nReview Date: 2021/07/20\nAverage Rating: 4.3\nProduct Details: {'Brand': 'MINETAN BODY.SKIN', 'Product Benefits': 'Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.   See more', 'Skin Tone': 'All', 'Material Feature': 'Certified Organic', 'Item Weight': '0.36 Kilograms', 'Product Dimensions': '21.26 x 21.26 x 87.4 inches; 12.7 Ounces', 'Item model number': 'MIH201905'}\nReview Text: I have been using Minetan products for a few years now almost exclusively, so it goes without saying that I love most of there products! This Minetan tan booster mousse has a light foamy texture and goes on clear. It definitely helps your sunless tanner last longer and is decently moisturizing.<br /><br />Honestly I do like this mousse, but I personally prefer Minetan tan extending lotion to this mousse. The mousse seams to me to have a little bit of stiffness and stickiness when I put it on my skin. I do still like the mousse, but I would take there lotion over this if given the choice. But still a good product! I think it’s more personal preference as I prefer the brands lotion tanning products to there mousse ones.\nReview Title: Great product!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "TINY BUDDHA Mindfulness Gift Set Includes Soothing Bath and Shower Gel, Relaxing Pillow Spray, Calming Essential Oil Roll-On, Lychee Flower Scented Candle and Daily Mindfulness Practice Guide\nTiny Buddha\n{'Brand': 'Tiny Buddha', 'Special Feature': 'Scented', 'Seasons': 'All Seasons', 'Item Volume': '1 Fluid Ounces', 'Unit Count': '12.00 Fl Oz', 'Package Dimensions': '8.35 x 8.07 x 2.52 inches; 1.45 Pounds', 'Manufacturer': 'KMI Brands'}\nWhile I really like this Tiny Buddha Mindfullness set, mine came completely soaked, so much that the box was falling apart. The culprit was the pillow spray that had leaked almost completely out since the lid wasn’t on securely. Which is a shame because I absolutely love pillow sprays and use them every single night, and this one smelled really good.<br /><br />That being said the rest of the set was just ok for me. The candle does smell good, but it is super tiny and only burned for a few hours before it was gone. The shower gel smells amazing, but didn’t lather as well as I hoped and the scent didn’t linger. And the essential oil roll on was alright, though it smelled kind of musty or something. I would have given this 4 stars if the pillow spray wasn’t leaked everywhere, but it was, so only 3 stars.\nPillow spray leaked everywhere, but it smelled really good\nMINETAN BODY.SKIN Tan Booster Foam - Boosts Color Results for Deeper, Darker, Longer Lasting Results, 10.14 fl oz\n{'Brand': 'MINETAN BODY.SKIN', 'Product Benefits': 'Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.   See more', 'Skin Tone': 'All', 'Material Feature': 'Certified Organic', 'Item Weight': '0.36 Kilograms', 'Product Dimensions': '21.26 x 21.26 x 87.4 inches; 12.7 Ounces', 'Item model number': 'MIH201905'}\nI have been using Minetan products for a few years now almost exclusively, so it goes without saying that I love most of there products! This Minetan tan booster mousse has a light foamy texture and goes on clear. It definitely helps your sunless tanner last longer and is decently moisturizing.<br /><br />Honestly I do like this mousse, but I personally prefer Minetan tan extending lotion to this mousse. The mousse seams to me to have a little bit of stiffness and stickiness when I put it on my skin. I do still like the mousse, but I would take there lotion over this if given the choice. But still a good product! I think it’s more personal preference as I prefer the brands lotion tanning products to there mousse ones.\nGreat product!",
  "profile": "**User Profile Summary:**\n\n- **Mindfulness Focus:** The user shows a strong interest in mindfulness and relaxation products that incorporate diverse aromatic elements, particularly scented products to enhance well-being.\n\n- **Aromatherapy Preference:** Maintains a strong affinity for pillow sprays, using them nightly to promote calmness and improve sleep quality.\n\n- **Quality Expectations:** Values product quality and performance, expressing disappointment when items do not meet durability and effectiveness standards (e.g., leaking packaging or short scent longevity).\n\n- **Scent Sensitivity:** Enjoys pleasant fragrances but is sensitive to musty or unpleasant scents, which significantly impacts their product satisfaction.\n\n- **Mixed Product Experiences:** Exhibits a balanced perspective on product efficacy; while appreciating good scents and innovative concepts, they are critical of practical issues like size and effectiveness (e.g., candle burn time).\n\n- **Moderate Satisfaction Rating:** This critical evaluation leads to a lower than expected satisfaction rating, reinforcing the importance of consistent quality across product components.\n\n- **Tanning Product Enthusiasm:** Recently, the user expressed enjoyment of tanning products, specifically showcasing a preference for moisturizing products over foam alternatives, indicating they value texture and personal comfort in skincare routines. Overall, they have a history of appreciating quality and effectiveness, suggesting a discerning approach to beauty and wellness products.",
  "metrics": {
    "rouge1_f": 0.23975720789074353,
    "rouge2_f": 0.021308980213089797,
    "rougeL_f": 0.10622154779969652,
    "meteor": 0.12050989612577205,
    "bleu1": 0.11082548316693777,
    "bleu2": 0.028668753877310525,
    "bleu3": 0.004671898310478257,
    "bleu4": 0.0018877572660257972,
    "bertscore_precision": 0.3801918029785156,
    "bertscore_recall": 0.4342707395553589,
    "bertscore_f1": 0.4054358899593353
  }
}