{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: TINY BUDDHA Mindfulness Gift Set Includes Soothing Bath and Shower Gel, Relaxing Pillow Spray, Calming Essential Oil Roll-On, Lychee Flower Scented Candle and Daily Mindfulness Practice Guide\nReview Date: 2021/06/16\nStore: Tiny Buddha\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Tiny Buddha', 'Special Feature': 'Scented', 'Seasons': 'All Seasons', 'Item Volume': '1 Fluid Ounces', 'Unit Count': '12.00 Fl Oz', 'Package Dimensions': '8.35 x 8.07 x 2.52 inches; 1.45 Pounds', 'Manufacturer': 'KMI Brands'}\nReview Text: While I really like this Tiny Buddha Mindfullness set, mine came completely soaked, so much that the box was falling apart. The culprit was the pillow spray that had leaked almost completely out since the lid wasn’t on securely. Which is a shame because I absolutely love pillow sprays and use them every single night, and this one smelled really good.<br /><br />That being said the rest of the set was just ok for me. The candle does smell good, but it is super tiny and only burned for a few hours before it was gone. The shower gel smells amazing, but didn’t lather as well as I hoped and the scent didn’t linger. And the essential oil roll on was alright, though it smelled kind of musty or something. I would have given this 4 stars if the pillow spray wasn’t leaked everywhere, but it was, so only 3 stars.\nReview Title: Pillow spray leaked everywhere, but it smelled really good\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "TINY BUDDHA Mindfulness Gift Set Includes Soothing Bath and Shower Gel, Relaxing Pillow Spray, Calming Essential Oil Roll-On, Lychee Flower Scented Candle and Daily Mindfulness Practice Guide\nTiny Buddha\n{'Brand': 'Tiny Buddha', 'Special Feature': 'Scented', 'Seasons': 'All Seasons', 'Item Volume': '1 Fluid Ounces', 'Unit Count': '12.00 Fl Oz', 'Package Dimensions': '8.35 x 8.07 x 2.52 inches; 1.45 Pounds', 'Manufacturer': 'KMI Brands'}\nWhile I really like this Tiny Buddha Mindfullness set, mine came completely soaked, so much that the box was falling apart. The culprit was the pillow spray that had leaked almost completely out since the lid wasn’t on securely. Which is a shame because I absolutely love pillow sprays and use them every single night, and this one smelled really good.<br /><br />That being said the rest of the set was just ok for me. The candle does smell good, but it is super tiny and only burned for a few hours before it was gone. The shower gel smells amazing, but didn’t lather as well as I hoped and the scent didn’t linger. And the essential oil roll on was alright, though it smelled kind of musty or something. I would have given this 4 stars if the pillow spray wasn’t leaked everywhere, but it was, so only 3 stars.\nPillow spray leaked everywhere, but it smelled really good",
  "profile": "**User Profile Summary:**\n\n- **Mindfulness Focus:** The user demonstrates an interest in mindfulness and relaxation products, particularly those that include diverse aromatic elements such as scented products.\n  \n- **Preference for Aromatherapy:** Strong affinity for pillow sprays; they utilize them nightly, indicating a preference for calming scents to enhance sleep quality.\n\n- **Quality Expectations:** User values product quality and performance, showing disappointment with items that fail to meet expectations—particularly regarding durability (e.g., leaking packaging) and effectiveness (e.g., scent longevity in bath products).\n\n- **Scent Sensitivity:** Enjoys pleasant fragrances but is sensitive to musty or undesirable scents, impacting their overall product satisfaction.\n\n- **Mixed Product Experiences:** Exhibits a balanced view of product efficacy, appreciating good scents and concepts while being critical of practical issues like size and effectiveness of certain items (e.g., candle burn time).\n\n- **Moderate Satisfaction Rating:** The mixed feelings lead to a lower than expected rating (3 stars), highlighting the importance of consistent quality across product components.",
  "metrics": {
    "rouge1_f": 0.23195876288659792,
    "rouge2_f": 0.015544041450777207,
    "rougeL_f": 0.10824742268041238,
    "meteor": 0.14257017635396013,
    "bleu1": 0.1835726433114368,
    "bleu2": 0.0429724619237455,
    "bleu3": 0.008536549027620167,
    "bleu4": 0.003809206899868017,
    "bertscore_precision": 0.39649271965026855,
    "bertscore_recall": 0.4131830930709839,
    "bertscore_f1": 0.40466585755348206
  }
}