{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Oreola Fish Line Hair Extensions Real Human Hair Natural Black Wire Hair Extensions Straight Hairpiece for Women #1B 20inch 120G\nReview Date: 2021/07/21\nStore: Oreola\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Oreola', 'Color': '#1B Natural Black', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '7.87 x 3.94 x 1.97 inches; 8 Ounces', 'Manufacturer': 'Oreola'}\nReview Text: The hair itself is actually gorgeous on this Oreola Halo hair extensions. It’s very high quality and the color is not one monotone color, but instead multiple colors and is blended together beautifully. I have a bit of experience with these types of wigs and I find them the easiest for me for quick application. Once you get the hang of putting these on you can do it pretty quick, just watch lots of tutorials on utube and you will be a pro in no time!<br /><br />The only critique I have is that I wish the hair were just a bit thicker. It’s gorgeous hair and it’s nice and long and easy to work with, but it’s just not very thick. Which kind of limits who can use it. If you have short hair that’s above chin length then this will not work for you. But overall it’s still great quality and I’m happy with it!\nReview Title: Beautiful hair and well made\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "TINY BUDDHA Mindfulness Gift Set Includes Soothing Bath and Shower Gel, Relaxing Pillow Spray, Calming Essential Oil Roll-On, Lychee Flower Scented Candle and Daily Mindfulness Practice Guide\nTiny Buddha\n{'Brand': 'Tiny Buddha', 'Special Feature': 'Scented', 'Seasons': 'All Seasons', 'Item Volume': '1 Fluid Ounces', 'Unit Count': '12.00 Fl Oz', 'Package Dimensions': '8.35 x 8.07 x 2.52 inches; 1.45 Pounds', 'Manufacturer': 'KMI Brands'}\nWhile I really like this Tiny Buddha Mindfullness set, mine came completely soaked, so much that the box was falling apart. The culprit was the pillow spray that had leaked almost completely out since the lid wasn’t on securely. Which is a shame because I absolutely love pillow sprays and use them every single night, and this one smelled really good.<br /><br />That being said the rest of the set was just ok for me. The candle does smell good, but it is super tiny and only burned for a few hours before it was gone. The shower gel smells amazing, but didn’t lather as well as I hoped and the scent didn’t linger. And the essential oil roll on was alright, though it smelled kind of musty or something. I would have given this 4 stars if the pillow spray wasn’t leaked everywhere, but it was, so only 3 stars.\nPillow spray leaked everywhere, but it smelled really good\nMINETAN BODY.SKIN Tan Booster Foam - Boosts Color Results for Deeper, Darker, Longer Lasting Results, 10.14 fl oz\n{'Brand': 'MINETAN BODY.SKIN', 'Product Benefits': 'Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.Suits all skin types & tones for those wanting to boost the results from their self tan with illuminating results.   See more', 'Skin Tone': 'All', 'Material Feature': 'Certified Organic', 'Item Weight': '0.36 Kilograms', 'Product Dimensions': '21.26 x 21.26 x 87.4 inches; 12.7 Ounces', 'Item model number': 'MIH201905'}\nI have been using Minetan products for a few years now almost exclusively, so it goes without saying that I love most of there products! This Minetan tan booster mousse has a light foamy texture and goes on clear. It definitely helps your sunless tanner last longer and is decently moisturizing.<br /><br />Honestly I do like this mousse, but I personally prefer Minetan tan extending lotion to this mousse. The mousse seams to me to have a little bit of stiffness and stickiness when I put it on my skin. I do still like the mousse, but I would take there lotion over this if given the choice. But still a good product! I think it’s more personal preference as I prefer the brands lotion tanning products to there mousse ones.\nGreat product!\nOreola Fish Line Hair Extensions Real Human Hair Natural Black Wire Hair Extensions Straight Hairpiece for Women #1B 20inch 120G\nOreola\n{'Brand': 'Oreola', 'Color': '#1B Natural Black', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '7.87 x 3.94 x 1.97 inches; 8 Ounces', 'Manufacturer': 'Oreola'}\nThe hair itself is actually gorgeous on this Oreola Halo hair extensions. It’s very high quality and the color is not one monotone color, but instead multiple colors and is blended together beautifully. I have a bit of experience with these types of wigs and I find them the easiest for me for quick application. Once you get the hang of putting these on you can do it pretty quick, just watch lots of tutorials on utube and you will be a pro in no time!<br /><br />The only critique I have is that I wish the hair were just a bit thicker. It’s gorgeous hair and it’s nice and long and easy to work with, but it’s just not very thick. Which kind of limits who can use it. If you have short hair that’s above chin length then this will not work for you. But overall it’s still great quality and I’m happy with it!\nBeautiful hair and well made",
  "profile": "**User Profile Summary:**\n\n- **Mindfulness Focus:** The user continues to demonstrate a strong interest in mindfulness and relaxation products that incorporate diverse aromatic elements, especially scented products to enhance well-being.\n\n- **Aromatherapy Preference:** Maintains a nightly routine of using pillow sprays to promote calmness and improve sleep quality.\n\n- **Quality Expectations:** Expects high product quality and performance, expressing disappointment with durability and effectiveness issues, such as leaking packaging or short scent longevity.\n\n- **Scent Sensitivity:** Sensitive to musty or unpleasant fragrances, which significantly impacts overall product satisfaction.\n\n- **Mixed Product Experiences:** Holds a balanced perspective on efficacy and is critical about practical issues like product size and effectiveness, including candle burn time.\n\n- **Moderate Satisfaction Rating:** This critical evaluation leads to lower satisfaction ratings, emphasizing the importance of consistent quality across all components.\n\n- **Tanning Product Enthusiasm:** Recently expressed enjoyment of tanning products, favoring moisturizing options over foams, which showcases a preference for texture and comfort in skincare.\n\n- **Hair Extensions Interest:** The user appreciates high-quality hair extensions, demonstrating discernment regarding thickness and application ease. They value well made products and are willing to navigate practical challenges to achieve satisfactory results, reinforcing their discerning approach to beauty and wellness products overall.",
  "metrics": {
    "rouge1_f": 0.21160409556313992,
    "rouge2_f": 0.027366020524515394,
    "rougeL_f": 0.09556313993174062,
    "meteor": 0.08728092765514778,
    "bleu1": 0.04191460948020971,
    "bleu2": 0.013414465098332513,
    "bleu3": 0.001979362772565004,
    "bleu4": 0.0007610532259637218,
    "bertscore_precision": 0.36105847358703613,
    "bertscore_recall": 0.43856996297836304,
    "bertscore_f1": 0.3960574269294739
  }
}