{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/03/06\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Mark Schwahn'], 'Starring': ['Alexandra Park', 'Tom Austen', 'Elizabeth Hurley'], 'Studio': ['Lionsgate']}\nReview Text: What a wonderful show:  truly a great cast which. With the exception of Elizabeth Hurley, I never seen any of the other cast members before The Royals. But am enjoying them so immensely.  Of course, it being fiction, should be viewed in that light.  Perhaps that's less easy for a Briton, I don't know.  But for me, it is a riveting story of fully developed characters, with flaws and triumphant assets both serving the storyline well.  I adore the princess for her hard edge, snarky wit and sharp edges as much as I adore her soft heart and outstanding emotionally charged dialogue.  I've always loved Elizabeth Hurley and this role allows her to show us a range she's rarely been given the chance to show.  I say bravo, Ms. Hurley.  Well done.  I could go on about Jasper, Liam, Cyrus and Robert as well as the secondary players.  But instead of turning this review into a love letter (left in a book in the library of course) I'll end by saying JUST WATCH IT.  if you become addicted, worry not.  I'm sure there will be a royals anon meeting coming to your area soon... lol.\nReview Title: GREAT SHOW FOR TOO MANY REASONS TO LIST\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Billy Ray'], 'Producers': ['Billy Ray', 'Alixandre Wiltin', 'Chris Keyser', 'David Stern', 'Joshua D. Maurer', 'Scott Hornbacher'], 'Starring': ['Matt Bomer', 'Kelsey Grammer', 'Lily Collins'], 'Studio': ['Amazon Studios']}\nI truly hope there are more installments on the way.  The screen-tellling of F. Scott Fitzgerald's final (unfinished) book electrifies the viewer with both the heights of hope and the depths of despair.  The Last Tycoon is part telling of a time when the U.S. was in an ugly position in the world: the juxtaposition of Hooverville's and the glittering dreams of all things possible.  All of the relationship amongst players in the cast can be compared to that of Matt Bomer & Kelsey Grammer.  Mr. Bomer & Mr. Grammer, play their roles to perfection showing a deeper relationship and understanding than what is shown on the screen.<br />Anyone who had read about (or remembers hearing about) the time before WWII will understand the dichotomy of the characters: some &#34;never say die&#34; others always wondering why, this is truly a must see.  Add this to the list of successes of Amazon's Original Productions (or what I prefer to call &#34;amazonment&#34;), I can't wait for the next installment.  Thank you, once again, for a cinematically beautiful, intelligently written and well cast show.\nFive stars isn't enough for this beautiful story\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Mark Schwahn'], 'Starring': ['Alexandra Park', 'Tom Austen', 'Elizabeth Hurley'], 'Studio': ['Lionsgate']}\nLOVE LOVE LOVE this show.\nA fantastic show, wish there were more shows like this on TV.  But then again, Amazon's Originals keep me more than busy\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Mark Schwahn'], 'Starring': ['Alexandra Park', 'Tom Austen', 'Elizabeth Hurley'], 'Studio': ['Lionsgate']}\nWhat a wonderful show:  truly a great cast which. With the exception of Elizabeth Hurley, I never seen any of the other cast members before The Royals. But am enjoying them so immensely.  Of course, it being fiction, should be viewed in that light.  Perhaps that's less easy for a Briton, I don't know.  But for me, it is a riveting story of fully developed characters, with flaws and triumphant assets both serving the storyline well.  I adore the princess for her hard edge, snarky wit and sharp edges as much as I adore her soft heart and outstanding emotionally charged dialogue.  I've always loved Elizabeth Hurley and this role allows her to show us a range she's rarely been given the chance to show.  I say bravo, Ms. Hurley.  Well done.  I could go on about Jasper, Liam, Cyrus and Robert as well as the secondary players.  But instead of turning this review into a love letter (left in a book in the library of course) I'll end by saying JUST WATCH IT.  if you become addicted, worry not.  I'm sure there will be a royals anon meeting coming to your area soon... lol.\nGREAT SHOW FOR TOO MANY REASONS TO LIST",
  "profile": "**Updated User Profile Summary:**\n\n- **Ratings Trend:** The user maintains a strong preference for high-quality productions, consistently rating them at 4.5 and above, demonstrating a commitment to excellence in storytelling.\n\n- **Content Appreciation:** They are particularly drawn to narratives with emotional depth and complex themes, expressing admiration for character-driven plots that explore intricate relationships, especially those reflecting hope and despair.\n\n- **Focus on Characterization:** The user appreciates fully developed characters with both flaws and strengths, valuing performances that showcase a range of emotions and depth, as evidenced by their recent praise for a show that highlights a nuanced cast.\n\n- **Production Quality:** They favor well-crafted screenplays and original productions from streaming platforms, often highlighting their enjoyment of unique storytelling and high production values.\n\n- **Enthusiasm for Future Content:** The user expresses a strong desire for sequels or new installments of beloved narratives, indicating a commitment to engaging with ongoing character arcs.\n\n- **Educational Elements:** Their preference for historical context in narratives suggests an interest in educational aspects integrated into entertainment, enhancing their overall viewing experience.\n\n- **Recent Interaction:** A recent review reflects their continued engagement with original series, where they awarded a perfect rating and articulated their admiration for the emotional depth and well-developed characters, reinforcing their sophisticated taste in storytelling and character dynamics.\n\nOverall, the user demonstrates a discerning eye for quality content that combines emotional and historical resonance in a captivating narrative framework.",
  "metrics": {
    "rouge1_f": 0.20640569395017794,
    "rouge2_f": 0.028537455410225926,
    "rougeL_f": 0.09015421115065243,
    "meteor": 0.07380391046404175,
    "bleu1": 0.038598176268769074,
    "bleu2": 0.012953509042797658,
    "bleu3": 0.004052191769376893,
    "bleu4": 0.0012755939802342898,
    "bertscore_precision": 0.35261762142181396,
    "bertscore_recall": 0.4329025149345398,
    "bertscore_f1": 0.38865727186203003
  }
}