{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/04/23\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Mark Schwahn'], 'Starring': ['Elizabeth Hurley', 'Max Brown', 'William Moseley'], 'Studio': ['Lionsgate']}\nReview Text: Brilliantly written, contemporary yet hardens the dark ages.  With men as hot as the women - eye candy for both.  And the stories intertwine, create a tapestry you don't how quite how it will turn out.  As much as I ADORE Elizabeth Hurley as Queen, princess Eleanor and &#34;knight Jasper&#34; send shivers up my spine.  Letter in books (using a real royal tale) and all those elements give the viewer the sense viewing the monarchy in the first person, fro a historical perspective.<br /><br />Since The titles seem to be lines from Hamlet, I wish the writer would do more with that.  A dolphin sculpture in a pond to depict the Queen, of Willy Shakes subtly made fun. not disrespectful, but historical.\nReview Title: It's not a documentary, and much pokes fun while remaining respectful of the monarchy.  Note the characters and their changes,\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Billy Ray'], 'Producers': ['Billy Ray', 'Alixandre Wiltin', 'Chris Keyser', 'David Stern', 'Joshua D. Maurer', 'Scott Hornbacher'], 'Starring': ['Matt Bomer', 'Kelsey Grammer', 'Lily Collins'], 'Studio': ['Amazon Studios']}\nI truly hope there are more installments on the way.  The screen-tellling of F. Scott Fitzgerald's final (unfinished) book electrifies the viewer with both the heights of hope and the depths of despair.  The Last Tycoon is part telling of a time when the U.S. was in an ugly position in the world: the juxtaposition of Hooverville's and the glittering dreams of all things possible.  All of the relationship amongst players in the cast can be compared to that of Matt Bomer & Kelsey Grammer.  Mr. Bomer & Mr. Grammer, play their roles to perfection showing a deeper relationship and understanding than what is shown on the screen.<br />Anyone who had read about (or remembers hearing about) the time before WWII will understand the dichotomy of the characters: some &#34;never say die&#34; others always wondering why, this is truly a must see.  Add this to the list of successes of Amazon's Original Productions (or what I prefer to call &#34;amazonment&#34;), I can't wait for the next installment.  Thank you, once again, for a cinematically beautiful, intelligently written and well cast show.\nFive stars isn't enough for this beautiful story\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Mark Schwahn'], 'Starring': ['Alexandra Park', 'Tom Austen', 'Elizabeth Hurley'], 'Studio': ['Lionsgate']}\nLOVE LOVE LOVE this show.\nA fantastic show, wish there were more shows like this on TV.  But then again, Amazon's Originals keep me more than busy\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Mark Schwahn'], 'Starring': ['Alexandra Park', 'Tom Austen', 'Elizabeth Hurley'], 'Studio': ['Lionsgate']}\nWhat a wonderful show:  truly a great cast which. With the exception of Elizabeth Hurley, I never seen any of the other cast members before The Royals. But am enjoying them so immensely.  Of course, it being fiction, should be viewed in that light.  Perhaps that's less easy for a Briton, I don't know.  But for me, it is a riveting story of fully developed characters, with flaws and triumphant assets both serving the storyline well.  I adore the princess for her hard edge, snarky wit and sharp edges as much as I adore her soft heart and outstanding emotionally charged dialogue.  I've always loved Elizabeth Hurley and this role allows her to show us a range she's rarely been given the chance to show.  I say bravo, Ms. Hurley.  Well done.  I could go on about Jasper, Liam, Cyrus and Robert as well as the secondary players.  But instead of turning this review into a love letter (left in a book in the library of course) I'll end by saying JUST WATCH IT.  if you become addicted, worry not.  I'm sure there will be a royals anon meeting coming to your area soon... lol.\nGREAT SHOW FOR TOO MANY REASONS TO LIST\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jocelyn Moorhouse'], 'Producers': ['Sue Maslin'], 'Starring': ['Kate Winslet', 'Liam Hemsworth', 'Judy Davis'], 'Studio': ['Amazon Studios']}\nI'm trying to stay up on the reviews of movies which truly rivet me.  The Dressmaker - a film I'd likely pass by had it not been for Kate Winslet and Judy Davis being in the movie - was the best movie I've viewed so far in 2017.  It's backdrop is so depressing: a dusty forgotten town in the Australian outback from 1926 - 1951.  But from the presence of Kate arriving in town with one minute of film panning up to her face where we see her ruby red lips take a long drag of a cigarette is the &#34;tell&#34; that this is a movie like no other.  I haven't read the book and knew nothing of the unfolding of the story.  The cinematographer's use of juxtaposition (haute couture - brilliant color against the dreary town's dusty beige; the metamorphosis of Gertrude and so many other scenes I could point to. I won't say more - no spoiler review here.  Other than to say, this is a deep movie, with many subtleties of the prison's people make, regardless of their surroundings and all in their own mind.  Watch it for a fun romp into vintage 1950's couture or for a story of revenge or for the interplay between characters and the passage of time.  But watch it!\nGreat story, GREAT actors, well written and well played.  Do yourself a favor and watch this movie!\nThe Girl on the Train\nSuspense, Drama, Downbeat, Mysterious\n['Rachel, devastated by her recent divorce, spends her daily commute fantasizing about the seemingly perfect couple who live in a house that her train passes every day.']\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Tate Taylor'], 'Producers': ['Marc Platt', 'Jared LeBoff'], 'Starring': ['Lisa Kudrow', 'Justin Theroux', 'Emily Blunt']}\nI've never written a review for a movie - but only b/c so few are 'worthy' of more time than a rating.  This movie...amazed me in its complexity of sadness, contradiction, addiction and the truth.  I watched this as a random view on an early winter's morning.  Even though I was able to with the movie unfold without interruption, it wasn't until half-way through that I understood the various characters and their relationship to each other in the cast.  I won't spoil the ending,  I'd just say next time you have some down tie alone - make a cup of tea and experience this &#34;Nocturne&#34; - no, &#34;funeral dirge&#34; rhythm of a movie. With a riveting plot and unexpected resolution.\nWow!  amazing cast, told an amazing story\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'Español', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español', 'Français', 'Português'], 'Directors': ['Mark Schwahn'], 'Starring': ['Elizabeth Hurley', 'Max Brown', 'William Moseley'], 'Studio': ['Lionsgate']}\nBrilliantly written, contemporary yet hardens the dark ages.  With men as hot as the women - eye candy for both.  And the stories intertwine, create a tapestry you don't how quite how it will turn out.  As much as I ADORE Elizabeth Hurley as Queen, princess Eleanor and &#34;knight Jasper&#34; send shivers up my spine.  Letter in books (using a real royal tale) and all those elements give the viewer the sense viewing the monarchy in the first person, fro a historical perspective.<br /><br />Since The titles seem to be lines from Hamlet, I wish the writer would do more with that.  A dolphin sculpture in a pond to depict the Queen, of Willy Shakes subtly made fun. not disrespectful, but historical.\nIt's not a documentary, and much pokes fun while remaining respectful of the monarchy.  Note the characters and their changes,",
  "profile": "**Updated User Profile Summary:**\n\n- **Ratings Trend:** The user consistently favors high-quality productions, regularly awarding ratings of 4.5 and above, emphasizing their commitment to excellence in storytelling.\n\n- **Content Appreciation:** They are drawn to narratives filled with emotional depth and complexity, particularly those involving character-driven plots that explore intricate relationships marked by hope and despair.\n\n- **Focus on Characterization:** The user values fully developed characters with a broad emotional range. Their recent feedback highlights admiration for nuanced portrayals that enhance the overall storytelling experience.\n\n- **Production Quality:** They prefer original productions with well-crafted screenplays and high production values. They enjoy unique storytelling alongside captivating visual engagement.\n\n- **Enthusiasm for Future Content:** The user expresses a strong desire for sequels or new installments of beloved narratives, emphasizing a commitment to ongoing character arcs.\n\n- **Educational Elements:** They appreciate narratives with historical context, as they believe these elements enrich their entertainment experience.\n\n- **Recent Interaction:** In their latest review, the user praised a production for its brilliant writing and intertwining storylines that create a complex tapestry. They value both emotional resonance and historical perspectives, reflecting a sophisticated taste. Their admiration for strong performances and the intricate depiction of character changes underscores their preference for narratives that mix humor with respect for serious themes.\n\nOverall, the user showcases a discerning eye for quality content that marries emotional depth with engaging character dynamics within captivating narratives.",
  "metrics": {
    "rouge1_f": 0.13956550362080317,
    "rouge2_f": 0.013183915622940013,
    "rougeL_f": 0.06451612903225806,
    "meteor": 0.0438562885462221,
    "bleu1": 0.001642930521015808,
    "bleu2": 0.0003759160199496341,
    "bleu3": 0.00012667647199714898,
    "bleu4": 4.1387916207727296e-05,
    "bertscore_precision": 0.358217716217041,
    "bertscore_recall": 0.47423288226127625,
    "bertscore_f1": 0.40814101696014404
  }
}