{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Gone in 60 Seconds\nReview Date: 2021/01/22\nStore: Nicolas Cage  (Actor),     Angelina Jolie  (Actor),     Dominic Sena  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Academy Award(R)-winners Nicolas Cage (1996 Best Actor, LEAVING LAS VEGAS; ADAPTATION, MATCHSTICK MEN) and sexy Angelina Jolie (1999 Best Supporting Actress, GIRL INTERRUPTED; LARA CROFT TOMB RAIDER) ride an unstoppable wave of speed and adrenaline in this hot, egdy action hit from high-octane producer Jerry Bruckheimer (PIRATES OF THE CARIBBEAN: THE CURSE OF THE BLACK PEARL, PEARL HARBOR). Legendary car booster Randall \"Memphis\" Raines (Cage) thought he\\'d left the fast lane behind -- until he\\'s forced out of retirement in a do-or-die effort to save his kid brother (Giovanni Ribisi, LOST IN TRANSLATION, TV\\'s FRIENDS) from the wrath of an evil mobster! But with speed to burn and attitude to spare, Memphis hastily reassembles his old crew -- a rogues\\' gallery including Academy Award-winner Robert Duvall (1983 Best Actor, TENDER MERCIES; OPEN RANGE) -- and floors it in a full-throttle race to pull off the ulimate car heist: 50 exotic beauties in 24 hours -- and the cops are already on to them! Directed by Dominic Sena and written by Scott Rosenberg, GONE IN 60 SECONDS is an action-packed thrill ride that comes out fast and never slows down.', 'Amazon.com', 'Kip Raines (Giovanni Ribisi) is a cocky young car thief working with a crew to steal 50\\xa0cars for a very bad man whose nickname is \"The Carpenter.\" Being young and cocky, Kip messes up, so it\\'s up to his big brother, Randall \"Memphis\" Raines (Nicolas Cage), to come out of car thief retirement and save him. With a cast that includes Robert Duvall, Angelina Jolie, Delroy Lindo, Cage, and Ribisi, it would be easy to say this story wastes all their talents--which it does, but that\\'s not the point. This is a Jerry Bruckheimer film. A good story and complex characters would only get in the way of the action scenes and slow the movie down. No,', 'Gone in 60\\xa0Seconds', \"(based on the cult 1974 film of the same name) is not about the stars as much as it's about cars. Fast cars. Rare cars. Wrecked cars. All cars. Too bad director Dominic Sena (\", 'Kalifornia', \") doesn't come across as more of a gearhead; he seems less interested in fast cars than fast cuts. But is this movie fun? Absolutely, and it's fun\", 'because', \"it's so stupid. With pointless car chases and hackneyed dialogue in one of the most predictable plots of the year,\", 'Gone in 60\\xa0Seconds', \"is a comic film that's\", 'not quite', 'a parody of itself, but darn close.', '--Andy Spletzer']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MFR717951008572#VG', 'Director': 'Dominic Sena', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 7 minutes', 'Release date': 'December 5, 2000', 'Actors': 'Nicolas Cage, Angelina Jolie, Robert Duvall, Giovanni Ribisi', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1), Unqualified', 'Studio': 'TOUCHSTONE PICTURES', 'Number of discs': '1'}\nReview Text: Arrived just as described\nReview Title: DVD\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "HOCUS POCUS\nBette Midler  (Actor),     Sarah Jessica Parker  (Actor),     Kenny Ortega  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['In Disney\\'s HOCUS POCUS, Academy Award(R) nominee Bette Midler (Best Actress, 1991, FOR THE BOYS), stars with Sarah Jessica Parker (SEX AND THE CITY) and Kathy Najimy (THE WEDDING PLANNER) as three wild witches who return from seventeenth-century Salem for a night of zany fun and comic chaos. After they\\'re conjured up by unsuspecting pranksters, the tricky trio sets out to cast a spell on the town and reclaim their youth. But first they must outwit three feisty kids determined to foil their scheme! Filled with bewitching laughs and magic, this hilarious film is perfect for the whole family!|Producer David Kirschner came up with the idea for the movie one night while he and his young daughter were sitting outside and his neighbor\\'s black cat strayed by. Kirschner began to unspool a narrative of how the cat was once a boy who was changed into a feline 300 years ago by three witches.|Actress Kathy Najimy described her character Mary as \"Eddie Haskell as a witch,\" referring to the character on the classic TV series \"Leave It To Beaver.\" \"She sucks up to Winifred [Bette Midler\\'s character] every chance she gets. She wants to be part of the power club and Winifred\\'s got the power.\"|To create the costumes, designer Mary Vogt read many historical books about Salem, Massachusetts. \"I even read diaries of women who were hanged as witches,\" she says.']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'NTSC, Subtitled', 'Contributor': 'Stephanie Faracy, Sean Murray, Sarah Jessica Parker, D.A. Pawley, Bette Midler, Thora Birch, Don Yesso, Neil Cuthbert, Amanda Shepherd, Steve Voboril, Doug Jones, Kathy Najimy, Kathleen Freeman, Kenny Ortega, Tobias Jelinek, Norbert Weisser, Larry Bagby, Karyn Malchus, Vinessa Shaw, Mick Garris, Ezra Sutton, Omri Katz, Charles RocketStephanie Faracy, Sean Murray, Sarah Jessica Parker, D.A. Pawley, Bette Midler, Thora Birch, Don Yesso, Neil Cuthbert, Amanda Shepherd, Steve Voboril, Doug Jones, Kathy Najimy, Kathleen Freeman, Kenny Ortega, Tobias Jelinek, Norbert Weisser, Larry Bagby, Karyn Malc…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'French, English, Spanish', 'Item model number': 'D149900D', 'Director': 'Kenny Ortega', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 36 minutes', 'Release date': 'July 31, 2018', 'Actors': 'Bette Midler, Sarah Jessica Parker, Kathy Najimy, Omri Katz, Thora Birch', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Mick Garris, Neil Cuthbert', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie and great price\nHocus Pocus DVD\nA Quiet Place\nEmily Blunt  (Actor),     John Krasinski  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['If they hear you, they hunt you. In this terrifyingly suspenseful thriller, a family must navigate their lives in silence to avoid mysterious creatures that hunt by sound. Knowing that even the slightest whisper or footstep can bring death, Evelyn (Emily Blunt) and Lee (John Krasinski) Abbott are determined to find a way to protect their children at all costs while they desperately search for a way to fight back. Hailed by critics and audiences around the world, experience the must-see movie of the year.']\n{'Genre': 'Horror', 'Format': 'Subtitled, NTSC', 'Contributor': 'Emily Blunt, John Krasinski', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 2.05 Ounces', 'Item model number': 'D59197733D', 'Media Format': 'Subtitled, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 10, 2018', 'Actors': 'Emily Blunt, John Krasinski', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French, Portuguese', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nJust as described\nDvd\nThe Great Outdoors [DVD]\nDan Aykroyd  (Actor),     John Candy  (Actor),     Howard Deutch  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['When an unannounced, uninvited and unwelcome family of fun-loving misfits converge upon a lakeside resort to join their relatives for a summer of relaxation, the result is anything but restful in this raucous comedy starring Dan Aykroyd and John Candy.It\\'s a vacationer\\'s worst nightmare, as wheeler-dealer Aykroyd, his sexually repressed wife and eerie twin daughters \"join\" the easygoing Candy and his straight-laced clan for a season of \"fun\" in the sun. Unfortunately, the only thing these two in-laws have in common is their intense dislike for each other. Soon, it\\'s brother-in-law against brother-in-law in an uproarious and hilarious fight to the finish to see which one really knows how to enjoy The Great Outdoors.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert ProskyAnnette Bening, Stephanie Faracy, Lucy Deakins, Arne Schmidt, Dan Aykroyd, John Hughes, John Candy, Chris Young, Howard Deutch, Robert Prosky  See more', 'Initial release date': '2006-02-14', 'Language': 'Unqualified, Spanish (Dolby Surround), French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.54 Ounces', 'Item model number': 'MFR025192022821#N', 'Director': 'Howard Deutch', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 31 minutes', 'Release date': 'February 14, 2006', 'Actors': 'Dan Aykroyd, John Candy, Annette Bening, Chris Young, Stephanie Faracy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Arne Schmidt, John Hughes', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nJust as described\nDvd\nMama [DVD]\nJessica Chastain  (Actor),     Nikolaj Coster-Waldau  (Actor),     Andy Muschietti  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Product Description', \"Guillermo del Toro, the Academy Award®-nominated writer of Pan's Labyrinth, presents this supernatural thriller that tells the haunting tale of two little girls who disappeared into the woods the day that their parents were killed. When the young sisters are found alive in a decrepit cabin, their uncle (Nikolaj Coster-Waldau, Game of Thrones) and his girlfriend (Oscar® nominee Jessica Chastain, Zero Dark Thirty) take them in. As they try to introduce the children to a normal life, Annabel (Chastain) begins to wonder if the traumatized girls are the only guests they have welcomed into their home.\", 'Bonus Content:', 'Feature Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'Feature Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'Original Short with Introduction by Guillermo del Toro', 'Original Short with Introduction by Guillermo del Toro', 'Deleted Scenes with Optional Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'Deleted Scenes with Optional Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'The Birth of Mama', 'The Birth of Mama', ']]>', 'Amazon.com', \"When he's not making gargantuan movies about giant robots and/or comic book hell-beasts, Guillermo del Toro as a producer has fostered a movement toward dreamy, fairy-tale horror (\", 'The Orphanage', ',', \"Don't Be Afraid of the Dark\", '), where primally Grimm scenarios reach some unusually bittersweet resolutions.', 'Mama', \", del Toro's 2013 production, continues this winning storybook streak, driven by a fiercely against-type performance by Jessica Chastain and an impressive number of uneasy frights. (How many times can a little girl ferally scuttling around the edges of the frame be scary? Quite a few, actually.) Beginning with a literal Once Upon a Time, director-cowriter Andrés Muschietti's film concerns a pair of young girls left stranded in a creepy cabin in the woods after a family tragedy. When they are miraculously found intact five years later, they credit their survival to a mysterious mother figure. As their reluctant new riot girl guardian (Chastain) soon discovers, this protective entity has a murderous case of separation anxiety. Muschietti's project (devised with his sister Barbara) had its genesis as a widely YouTubed three-minute short film, and the elongation seams do occasionally show, particularly in the third act, when characters begin appearing for the express purpose of being munched. Still, even if it doesn't all hang together,\", 'Mama', \"has no shortage of champion scary moments, expertly designed for maximum freak-out. (An early scene involving a supernatural game of tug of war hits just the right mark between nervous laughter and serious goose bump territory.) After seeing what lurks under Chastain's bed, don't be surprised if you cultivate some serious dust bunnies of your own.\", '--Andrew Wright']\n{'Genre': 'Horror, Mystery & Suspense/Thrillers, Mystery & Suspense', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Andy Muschietti, Daniel Kash, Jane Moffat, Guillermo del Toro, Jessica Chastain, Megan Charpentier, Javier Botet, Neil Cross, Nikolaj Coster-Waldau, J. Miles Dale, Isabelle Nelisse, Barbara MuschiettiAndy Muschietti, Daniel Kash, Jane Moffat, Guillermo del Toro, Jessica Chastain, Megan Charpentier, Javier Botet, Neil Cross, Nikolaj Coster-Waldau, J. Miles Dale, Isabelle Nelisse, Barbara Muschietti   See more', 'Initial release date': '2013-05-07', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '26353999', 'Director': 'Andy Muschietti', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 7, 2013', 'Actors': 'Jessica Chastain, Nikolaj Coster-Waldau, Megan Charpentier, Isabelle Nelisse, Daniel Kash', 'Subtitles': 'Spanish, French', 'Producers': 'J. Miles Dale, Barbara Muschietti, Guillermo del Toro', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Neil Cross, Andy Muschietti, Barbara Muschietti', 'Number of discs': '1'}\nCame packed well an worked proper.\nDVD\nThe Warrant\nNeal McDonough  (Actor),     Steven R. McQueen  (Actor),     Brent Christy  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Westerns\n[\"All-star, action--packed Western! Sheriff John Breaker and his son, Cal, reunite after the Civil War to track down a fellow veteran, now a notorious gang leader. Their mission turns dangerous when they find themselves caught between their former friend's outlaw gang and the vigilantes who are taking the law into their own hands. Starring Neal McDonough (Yellowstone, Captain America), Casper Van Dien (Starship Troopers, Tarzan), Steven R. McQueen (The Vampire Diaries, Chicago Fire), and Annabeth Gish (X-Files, The Haunting of Hill House).\", 'Language: English Genre: Action Discs: 1 Format: DVD + Digital Subtitles: English Subtitles Run Time: 1 hour 30 minutes Region Code: DVD Region 1 Color: Color']\n{'Genre': 'Westerns', 'Format': 'NTSC', 'Contributor': 'Steven R. McQueen, Brent Christy, Annabeth Gish, Neal McDonough', 'Runtime': '1 hour and 30 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'D70777D', 'Director': 'Brent Christy', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'March 3, 2020', 'Actors': 'Neal McDonough, Steven R. McQueen, Annabeth Gish', 'Studio': 'Imagicomm', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMovie played trough, the packaging was good\nDVD\nHatfields & McCoys\nKevin Costner  (Actor, Producer),     Bill Paxton  (Actor),     Kevin Reynolds  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Bonded by their oath to the same flag, two confederate soldiers, “Devil” Anse Hatfield (Kevin Costner) and Randall McCoy (Bill Paxton), return home seeking peace after tireless months of battle. Their expectations are quickly shattered when a murder based on misunderstandings and an illicit love affair trigger warfare between former comrades and their clans. This historic feud teeters on the brink of an all out civil war as friends and neighbors join opposing sides in a rivalry that would ultimately shape American History.', 'Amazon.com', 'The legendary 19th-century battle between two West Virginia clans that came to define the term', 'feud', 'gets a lengthy and frequently dramatic retelling in', 'Hatfields & McCoys', \", a six-hour miniseries driven by leads Kevin Costner and Bill Paxton as the warring family patriarchs. Both actors lend considerable gravitas to the sprawling story, which begins with Costner's Devil Anse Hatfield going AWOL during the Civil War, setting in motion a growing animosity with former friend Randolph McCoy (Paxton) that blossoms into full-blown violence over a property dispute between the families. Bloodshed begets bloodshed, due in part to a series of miscommunications, long-simmering grievances, and acts of outright foolishness, several of which are the work of hot-blooded Hatfield relative Jim Vance (Tom Berenger). What emerges from the final work is a portrait of generational murder as a sort of Biblical virus, with the sins of the fathers wreaking untold havoc on their children, including a pair of young Hatfield-McCoy lovers (Lindsay Pulsipher and Matt Barr) whose romance considerably exacerbates tensions. The latter subplot is probably the sole weak element in the miniseries, detracting from the tragic forward momentum of the familial conflict and solid turns by all concerned, including Powers Boothe as Costner's sage older brother and Jena Malone and the always-welcome Mare Winningham as women on the McCoy side. A major ratings hit and multiple Emmy nominee for The History Channel, which made its dramatic project debut with the miniseries,\", 'Hatfields & McCoys', 'is a compelling historical drama for both Western fans and non-genre followers alike. The DVD includes a modest, electronic press kit-style making-of featurette as well as a music video for the song \"I Know These Hills,\" sung by Costner and his band, Modern West.', '--Paul Gaita']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '25343068', 'Director': 'Kevin Reynolds', 'Media Format': 'Dolby, Subtitled, Widescreen, NTSC, AC-3', 'Run time': '4 hours and 50 minutes', 'Release date': 'July 31, 2012', 'Actors': 'Kevin Costner, Bill Paxton, Matt Barr, Tom Berenger, Powers Boothe', 'Subtitles': 'English', 'Producers': 'Kevin Costner, Herb Nanas, Darrell Fetty', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nGreat DVD worked well an was packaged good\nDVD\nJohn Wick [DVD]\nKeanu Reeves  (Actor),     Willem Dafoe  (Actor),     David Leitch  (Director),     Chad Stahelski  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['From Summit Entertainment and the producer of CLASH OF THE TITANS and THE TOWN comes a tale of adrenaline-fueled revenge and redemption. When a retired hit man is forced back into action by a sadistic young thug, he hunts down his adversaries with the skill and ruthlessness that made him an underworld legend.']\n{'Genre': 'Action', 'Format': 'DVD, Color, Widescreen, NTSC', 'Contributor': 'Basil Iwanyk, Willem Dafoe, Michael Nyqvist, Chad Stahelski, Bridget Moynahan, David Leitch, Adrianne Palicki, Eva Longoria, 87Eleven, Keanu ReevesBasil Iwanyk, Willem Dafoe, Michael Nyqvist, Chad Stahelski, Bridget Moynahan, David Leitch, Adrianne Palicki, Eva Longoria, 87Eleven, Keanu Reeves  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 41 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.4 x 5.3 x 7.5 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT46572DVD', 'Director': 'David Leitch, Chad Stahelski', 'Media Format': 'DVD, Color, Widescreen, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'February 3, 2015', 'Actors': 'Keanu Reeves, Willem Dafoe, Bridget Moynahan, Michael Nyqvist, Adrianne Palicki', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Eva Longoria, Basil Iwanyk', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nVery interesting DVD\nDVD\nNicktoons - Halloween - Tales of Fright\nTom Kenny  (Actor),     Carolyn Lawrence  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Nicktoons tales of fright. Year: 2002 Original Language: English.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Animated', 'Contributor': 'Jason Marsden, Mary Jo Catlett, Bill Fagerbakke, Susan Boyajian, Daran Norris, Dionne Quan, Rodger Bumpass, Gary Leroi Gray, Clancy Brown, Tara Strong, Mr. Lawrence, Carolyn Lawrence, Susan Blakeslee, Grey DeLisle, Tom KennyJason Marsden, Mary Jo Catlett, Bill Fagerbakke, Susan Boyajian, Daran Norris, Dionne Quan, Rodger Bumpass, Gary Leroi Gray, Clancy Brown, Tara Strong, Mr. Lawrence, Carolyn Lawrence, Susan Blakeslee, Grey DeLisle, Tom Kenny   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 48 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2238073', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Animated', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 26, 2003', 'Actors': 'Tom Kenny, Carolyn Lawrence, Clancy Brown, Daran Norris, Susan Blakeslee', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe dvd came on time packaged well an was a hit at my house\nDVD\nBook of Eli, The / I Am Legend (DVD) (DBFE)\nRated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Book of Eli, The / I Am Legend (DVD) (DBFE)', 'Bundle and save! THE BOOK OF ELI: A lone warrior (Denzel Washington) wanders the post-apocalyptic desert that was once America, battling lawlessness to realize his hope of a better future. I AM LEGEND: Robert Neville is a brilliant scientist, but even he could not contain the terrible virus that was unstoppable. Neville is now the last human survivor in what is left of the world.', ']]>']\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Color, Multiple Formats, DVD, NTSC', 'Contributor': 'BOOK OF ELI / I AM LEGEND', 'Language': 'English', 'Studio': 'WarnerBrothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': 'WHV1000336604DVD', 'Media Format': 'Color, Multiple Formats, DVD, NTSC', 'Release date': 'November 13, 2012', 'Country of Origin': 'USA', 'Number of discs': '1'}\nArrived just as described\nDVD\nIt: Special Edition (DVD)\nJaeden Lieberher  (Actor),     Bill Skarsgård  (Actor),     Andy Muschietti  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n['It: Special Edition (DVD)', ']]>']\n{'Genre': 'Horror, Mystery & Suspense/Thrillers, Mystery & Suspense', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Sophia Lillis, Bill Skarsgård, Dave Neustadter, Roy Lee, Doug Davison, Jack Dylan Grazer, Richard Brener, Barbara Muschietti, David Neustadter, Chase Palmer, David Katzenberg, Toby Emmerich, Jeremy Ray Taylor, Marty P. Ewing, Cary Joji Fukunaga, Finn Wolfhard, Andy Muschietti, Niija Kuykendall, Gary Dauberman, Walter Hamada, Jon Silk, Nicholas Hamilton, Dan Lin, Jaeden Lieberher, Seth Grahame-Smith, Chosen Jacobs, Wyatt Oleff, Cary Fukunaga, Stephen KingSophia Lillis, Bill Skarsgård, Dave Neustadter, Roy Lee, Doug Davison, Jack Dylan Grazer, Richard Brener, Barbara Muschietti, David Neustadter, Chase Palmer, David Katzenberg, Toby Emmerich, Jeremy Ray Taylor, Marty P. Ewing, Cary Joji Fukunaga, Finn Wolfhard, Andy Mus…  See more', 'Initial release date': '2018-06-28', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1 EX)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'B077HP64BH', 'Director': 'Andy Muschietti', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '2 hours', 'Release date': 'June 28, 2018', 'Actors': 'Jaeden Lieberher, Bill Skarsgård, Wyatt Oleff, Jeremy Ray Taylor, Sophia Lillis', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French, English', 'Producers': 'Dave Neustadter, Roy Lee, David Neustadter, Walter Hamada, Dan Lin', 'Studio': 'Studio Distribution Services', 'Writers': 'Chase Palmer, Cary Fukunaga, Cary Joji Fukunaga, Gary Dauberman', 'Country of Origin': 'USA', 'Number of discs': '2'}\nArrived on time an as described\nDVD\nGone in 60 Seconds\nNicolas Cage  (Actor),     Angelina Jolie  (Actor),     Dominic Sena  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Academy Award(R)-winners Nicolas Cage (1996 Best Actor, LEAVING LAS VEGAS; ADAPTATION, MATCHSTICK MEN) and sexy Angelina Jolie (1999 Best Supporting Actress, GIRL INTERRUPTED; LARA CROFT TOMB RAIDER) ride an unstoppable wave of speed and adrenaline in this hot, egdy action hit from high-octane producer Jerry Bruckheimer (PIRATES OF THE CARIBBEAN: THE CURSE OF THE BLACK PEARL, PEARL HARBOR). Legendary car booster Randall \"Memphis\" Raines (Cage) thought he\\'d left the fast lane behind -- until he\\'s forced out of retirement in a do-or-die effort to save his kid brother (Giovanni Ribisi, LOST IN TRANSLATION, TV\\'s FRIENDS) from the wrath of an evil mobster! But with speed to burn and attitude to spare, Memphis hastily reassembles his old crew -- a rogues\\' gallery including Academy Award-winner Robert Duvall (1983 Best Actor, TENDER MERCIES; OPEN RANGE) -- and floors it in a full-throttle race to pull off the ulimate car heist: 50 exotic beauties in 24 hours -- and the cops are already on to them! Directed by Dominic Sena and written by Scott Rosenberg, GONE IN 60 SECONDS is an action-packed thrill ride that comes out fast and never slows down.', 'Amazon.com', 'Kip Raines (Giovanni Ribisi) is a cocky young car thief working with a crew to steal 50\\xa0cars for a very bad man whose nickname is \"The Carpenter.\" Being young and cocky, Kip messes up, so it\\'s up to his big brother, Randall \"Memphis\" Raines (Nicolas Cage), to come out of car thief retirement and save him. With a cast that includes Robert Duvall, Angelina Jolie, Delroy Lindo, Cage, and Ribisi, it would be easy to say this story wastes all their talents--which it does, but that\\'s not the point. This is a Jerry Bruckheimer film. A good story and complex characters would only get in the way of the action scenes and slow the movie down. No,', 'Gone in 60\\xa0Seconds', \"(based on the cult 1974 film of the same name) is not about the stars as much as it's about cars. Fast cars. Rare cars. Wrecked cars. All cars. Too bad director Dominic Sena (\", 'Kalifornia', \") doesn't come across as more of a gearhead; he seems less interested in fast cars than fast cuts. But is this movie fun? Absolutely, and it's fun\", 'because', \"it's so stupid. With pointless car chases and hackneyed dialogue in one of the most predictable plots of the year,\", 'Gone in 60\\xa0Seconds', \"is a comic film that's\", 'not quite', 'a parody of itself, but darn close.', '--Andy Spletzer']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MFR717951008572#VG', 'Director': 'Dominic Sena', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 7 minutes', 'Release date': 'December 5, 2000', 'Actors': 'Nicolas Cage, Angelina Jolie, Robert Duvall, Giovanni Ribisi', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1), Unqualified', 'Studio': 'TOUCHSTONE PICTURES', 'Number of discs': '1'}\nArrived just as described\nDVD",
  "profile": "**Updated User Profile Summary:**\n\n- **Interest in Family-Friendly Films**: The user continues to prioritize family-friendly films, particularly those infused with humor and magical elements, indicative of a preference for light-hearted viewing experiences.\n\n- **Exploration of Action and Crime Genres**: Their recent interaction reveals an engagement with action films, particularly those with high-paced narratives, suggesting a growing appreciation for adrenaline-fueled storytelling.\n\n- **Broadened Genre Exploration**: In addition to action, drama, and horror, the user enjoys films that incorporate elements of comedy, suspense, and excitement, demonstrating an expanding taste for diverse cinematic experiences.\n\n- **Appreciation for Classic and Iconic Content**: The user maintains a fondness for nostalgic films featuring renowned actors, emphasizing their preference for timeless stories and strong performances.\n\n- **Quality and Affordability**: They remain discerning in their film selections, preferring reputable productions and high-quality content, as seen in their choices of well-rated DVDs.\n\n- **Engaging Narratives**: With a strong interest in imaginative storytelling that evokes emotions, the user appreciates both whimsical and intense narratives.\n\n- **Growing Engagement with Horror**: Their interest in horror films indicates a further diversification of their viewing habits, incorporating more suspenseful and thrilling elements.\n\n- **Continued Enjoyment of Animated Family Content**: The user’s appreciation for animated films signals a consistent desire for playful and engaging narratives suitable for younger audiences.\n\nOverall, the user's preferences continue to evolve, balancing a love for family-oriented titles while increasingly embracing thrilling action and suspenseful narratives.",
  "metrics": {
    "rouge1_f": 0.06331561140647655,
    "rouge2_f": 0.004352030947775629,
    "rougeL_f": 0.03431609473175447,
    "meteor": 0.017103539944095855,
    "bleu1": 1.320152349521934e-08,
    "bleu2": 3.653358461936533e-09,
    "bleu3": 5.134748123102541e-10,
    "bleu4": 1.9265789515961002e-10,
    "bertscore_precision": 0.3506712317466736,
    "bertscore_recall": 0.5111067891120911,
    "bertscore_f1": 0.4159550368785858
  }
}