{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ransom (Special Edition)\nReview Date: 2008/10/15\nStore: Mel Gibson  (Actor),     Rene Russo  (Actor),     Piotr Sobocinski  (Director),     Ron Howard  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: [\"In this action-thriller, Academy Award(R)-winning superstar Mel Gibson (Best Director, BRAVEHEART, 1995) is Tom Mullen, a wealthy executive whose charmed life is suddenly shattered when his young son is abducted and held for ransom by a gang of ruthless criminals! That's when Mullen defies the experts and takes matters into his own hands ... boldly turning the tables on the kidnappers in a last-chance effort to rescue the boy! A critically acclaimed smash from Academy Award(R)-winning director Ron Howard (A BEAUTIFUL MIND, 2001) that features Rene Russo (THE THOMAS CROWN AFFAIR) and Gary Sinise (THE HUMAN STAIN) in an excellent supporting cast -- you'll find RANSOM pays off big with unpredictable twists and unstoppable excitement!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Color, NTSC, Special Edition, Anamorphic, Subtitled, Dolby, Widescreen', 'Contributor': 'Dan Hedaya, Delroy Lindo, Piotr Sobocinski, Rene Russo, Mel Gibson, Lili Taylor, Brawley Nolte, Liev Schreiber, Alexander Ignon, Nancy Ticotin, Michael Gaston, Gary Sinise, Jose Zuniga, Richard Price, Evan Handler, Ron Howard, Donnie Wahlberg, Paul GuilfoyleDan Hedaya, Delroy Lindo, Piotr Sobocinski, Rene Russo, Mel Gibson, Lili Taylor, Brawley Nolte, Liev Schreiber, Alexander Ignon, Nancy Ticotin, Michael Gaston, Gary Sinise, Jose Zuniga, Richard Price, Evan Handler, Ron Howard, Donnie Wahlberg, Paul Guilfoyle   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR786936232981#VG', 'Director': 'Piotr Sobocinski, Ron Howard', 'Media Format': 'Color, NTSC, Special Edition, Anamorphic, Subtitled, Dolby, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'March 23, 2004', 'Actors': 'Mel Gibson, Rene Russo, Brawley Nolte, Paul Guilfoyle, Gary Sinise', 'Subtitles': 'Spanish', 'Studio': 'Touchstone Home Entertainment', 'Writers': 'Richard Price, Alexander Ignon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Ok, not too many times does a movie come along and have me wondering what the heck is going on.<br /><br />RANSOM took me by surprise. Yes, it's a contrived \"we have your kid, you want him back, you pay\" plot and storyline. But, it's how it is played out that makes this movie good entertainment.<br /><br />Now, no \"fictional\" movie is ever going to depict real life. But, suspend the \"reality\" for the movie and you go along for a wild ride. Tom Mullen (Gibson) is an airline executive, built the company from the ground-up, and will do anything to protect it. Kate (Russo) is his wife, who obviously has seen the ups and downs of their life, but has honored her \"for better for worse\" marriage vows. Then, they have a talented and bright child Sean (Brawley Nolte) who isn't too neglected and seems to have adequate child/parent time with each parent.<br /><br />In what we should expect to happen, does indeed happen, the child is taken for ransom. But, it's in the how and the who that really grips us. He is taken from a public place which shows the kidnappers as thumbing their nose under everyone, and shows us we are too complacent in our feelings of security in public places, even during the day.<br /><br />Det. Jimmy Shaker (Sinise) is the ring-leader, and I think his identity coming out sooner is to me part of the whole riddle and scheme of the movie, after all, he has no motive....well he does, but we will get to that later. He seems to be functionally insane. He can function in public, do his job and then he's a psycho on top of it all. How else can you do what he did??<br /><br />After a botched \"money drop\" attempt, Mullen finds himself in a situation where he ponders \"would paying the money really insure my son's safe return\"? And he's right. We know it wouldn't. And he attempts to convince his wife that it's not about the money, it's about getting their son back alive. Once the kidnapper has their money, they have no reassurance if the boy will come back alive, which is the whole point behind paying the ransom, now isn't it?<br /><br />So... since it's all about money, why not turn it into a bounty? Which is what Mullen does. Who wouldn't turn in someone they know for $2 million? Which is what he is counting on, and Shaker didn't. Now Shaker has to keep calm (which he can't do, since his scheme is coming apart at the seems along with everyone he's around) and he's going beserk, while everyone else is trying to abandon the plan.<br /><br />And Shaker doesn't like people \"bailing\" on him. Can anyone say \"psycho\"?<br /><br />Shaker decides to give in, and gives the child back alive, killing all his co-horts in the process. But, it's when his greed gets the better of him he gets found out. Had he followed the plan, likely he would have been sipping margaritas in Mexico, but he had to have to money early and pays the ultimate price. Apparently his meds didn't kick in to save his brain or his life.<br /><br />Yes, Mel Gibson might have over-acted as the father. But since it's fiction who are we to argue with that? I did enjoy the balcony scene where for a moment we thought he was going to jump. After all, he thought he'd killed his son. I was hoping he wouldn't jump, then again Shaker wouldn't have won either, but it didn't happen, which was a good thing.<br /><br />Rene Russo was wonderful as the mother, she had a more realistic charm  in the role, but likely wouldn't have faired as well against Sinise.<br /><br />Gary Sinise was wonderful in the movie as far as the crazy bad guy. He stands out more so in the movie since you're wondering what the heck set this guy off. He can play bad guys just as well as good guys (which is why I just love him in CSI: NY).<br /><br />As Shaker is talking/rambling on, we realize one thing, the motive. He wonderfully explains his motive--he saw criminals everyday getting off by buying their way out of trouble. Mullen had recently done so with the Jackie Brown deal. Since Mullen didn't mind paying to stay out of jail/prison, then why not pay to get his son back?<br /><br />Brawley Nolte did a wonderful job as Sean, and it does tug at your heartstrings to see how he was treated and then when he recognizes his kidnapper's voice.<br /><br />Donnie Wahlberg did a wonderful job as the only friend the kid seemed to have in the whole ordeal, and made him a promise that was eventually carried out.<br /><br />The rest of the cast were wonderful, and I wish I could remember all the actors in this movie.<br /><br />The FBI were portrayed as neutral, they were trying to help the Mullens get their son back, while the father decided to take things into his own hands.  At least it stayed away from \"the FBI saved the day\" plot. The movie played out on it's own, and could have been directed by anyone. The cast seemed to compliment each other.<br /><br />If you have DVR (and you're not paying any extra to record it), record it from a movie channel once, if you like buy it; if not, then save the money, and delete.<br /><br />I for one, am going to get the DVD.\nReview Title: Wow!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Scarecrow and Mrs. King: Season 1\nJackson, Kate  (Actor, Director),     Bruce Boxleitner  (Actor),     Bole, Cliff  (Director),     Brinckerhoff, Burt  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Scarecrow & Mrs. King: The Complete First Season (DVD)', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'Scarecrow and Mrs. King', 'proves there was life for Kate Jackson after', \"Charlie's Angels\", '--and for Bruce Boxleitner before', 'Babylon 5', '. Jackson\\'s divorcée, Amanda King, a pretty lady with an \\'80s perm, lives outside D.C. with her sons, Jamie and Phillip. At a train station, she meets Boxleitner\\'s Lee \"Scarecrow\" Stetson, who convinces her to do a \"life or death\" favor. The delivery to the man in the red hat doesn\\'t go as planned, but King ends up cracking the case and a new team ensues. Scarecrow\\'s boss, Billy (Mel Stewart), thinks a housewife will make a perfect decoy, though fellow agent Francine (Martha Smith) has her doubts. As she says about her colleague, \"His methods might be unorthodox, but Scarecrow always delivers.\" Unfortunately for the apprentice agent, she can\\'t tell anyone about her new career, not even her mother, Dotty (Beverly Garland, great value), who looks after the boys when she takes on assignments, offering different excuses every time. In Scarecrow, however, Amanda finds a friend as well as a partner--and a possible love interest, to judge from their longing glances.', 'If', 'Scarecrow and Mrs. King', 'bears comparison with', 'Remington Steele', \", the cases that deal with the domestic arena help to set it apart, with perpetrators ranging from cooking-show hosts to cosmetics titans. The more dramatic episodes don't work as well, mostly because they feel like retreads from\", 'The Rockford Files', \"(executive producer Juanita Bartlett has written for both programs). Also, Jackson is a deft comic actress, but her crying scenes don't quite convince. Still, it's a minor complaint about a light entertainment that wasn't aiming for documentary realism. Plus, it's the chemistry between the leads that led to three more seasons--and Boxleitner's\", 'GQ', \"good looks certainly didn't hurt.\", '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense', 'Format': 'Multiple Formats, Full Screen, Color, Subtitled, NTSC', 'Contributor': 'Neufeld Jr., Sigmund, Bruce Boxleitner, McEveety, Vincent, Sgarro, Nicholas, Hayers, Sidney, Bole, Cliff, Paul Stout, Hiatt, Michael, Duckwall, Dennis C., Holcomb, Rod, Patterson (III), John, Scott, Oz, Mayberry, Russ, Kolbe, Winrich, Mel Stewart, Wiard, William, Frawley, James, Beverly Garland, Sweeney, Bob, Greg Morton, Martha Smith, Jackson, Kate, Harris, Harry, Brinckerhoff, Burt, Laidman, Harvey S., Mackenzie, WillNeufeld Jr., Sigmund, Bruce Boxleitner, McEveety, Vincent, Sgarro, Nicholas, Hayers, Sidney, Bole, Cliff, Paul Stout, Hiatt, Michael, Duckwall, Dennis C., Holcomb, Rod, Patterson (III), John, Scott, Oz, Mayberry, Russ, Kolbe, Winrich, Mel Stewart, Wiard, William, Frawley, James, Bev…  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.75 inches; 4 Ounces', 'Item model number': '6638801', 'Director': 'Bole, Cliff, Brinckerhoff, Burt, Duckwall, Dennis C., Frawley, James, Harris, Harry', 'Media Format': 'Multiple Formats, Full Screen, Color, Subtitled, NTSC', 'Run time': '16 hours and 6 minutes', 'Release date': 'March 9, 2010', 'Actors': 'Jackson, Kate, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Studio': 'Warner Home Video', 'Number of discs': '5'}\nI see I am not the only one out there that wants to see this series again.<br /><br />Thank God for that.<br /><br />I grew up watching this series. My mom liked it and she and I would watch every episode when it originally aired, particularly the one where Lee and Amanda finally got married. I don't have a DVR or enough time in the day to hunt and search for the episodes, which many times air out of order. Can we get this on DVD?<br /><br />Here is a really, super smart idea.<br /><br />Anyone ready for this one?<br /><br />Take pre-orders. Release the ENTIRE SHOW on DVD, then send it out to those who have pre-ordered it. That makes a lot of sense. Why am I seeing some new series, which haven't been on but even 1-2 seasons, before they are out on DVD.<br /><br />Sopranos? NIP/TUCK? These series are still being aired with new episodes weekly. I know they are popular, but come on, this show was good too.<br /><br />How hard can this be? There are a lot of people that like the series, and want to see it again. There was a time I had to wait 2 years in between the time it was on one station in syndication before it came back on another station.<br /><br />AS OF 3/9/2010....<br /><br />This series has been released on DVD. The earlier review was written 3 years ago. I had actually forgot I had written a review of this until I went to review it and it gave me the option to EDIT, and EDIT I shall.<br /><br />I still give it 5 stars. The network and production company did great by it, or as best as they could; given it's age. It has been over 20 years since it has been on and I bet the original tape/film is not as good as it once was, but it isn't as bad as it could be either.<br /><br />But don't look for extras--out takes, commentaries, promo commercials or even a \"behind the scenes\"; because it isn't on this wonderful 5 disc set. I say wonderful because the packaging is awesome. It is one jewel case with single sided DVDs which take no more room than at best 2 DVDs on the shelf, which goes into a cardboard sleeve. It comes with a booklet to explain each episode and the characters. The DVD artwork is good. The DVDs are clearly marked and the \"menu\" screen is simple. You can play ALL episodes at once or select individual ones.<br /><br />As far as the quality, it might not have been digitally remastered as you can literally see the \"scratches\" in the file. The DVDs play without skipping and the episodes are just as wonderful as I remember them being.<br /><br />If you love the series, here it is. I can not wait for the rest of the seasons and hope they are as quickly released as Nash Bridges has been.\nScarecrow & Mrs King Needs To Be (IS FINALLY) On DVD\nCSI: Miami: Season 1\nDavid Caruso  (Actor),     Emily Procter  (Actor),     Bryan Spicer  (Director),     Charles Correll  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', 'David Caruso, Emily Procter, Kim Delaney. From the creators of the original hit series comes this action-packed spinoff featuring the same brain-busting crimes to solve, set in the steamy streets of South Florida. 25 episodes on 7 DVDs. 2002-03/color/18 hrs/NR/widescreen.', 'Amazon.com', 'As Lt. Horatio Caine (David Caruso) notes in episode 4 (\"Just One Kiss\"), \"The evidence, as always, will speak for itself.\" In other words,', 'CSI: Miami', 'follows the same super-successful formula as', 'CSI: Crime Scene Investigation', '. Fortunately, this instantly popular spin-off established its own unique identity from the start. Like', 'CSI', ', the Dade County criminalists of', 'CSI: Miami', \"solve murders using forensic science. Unlike the Vegas crew, however, they're cops with the power to arrest, their coroner (Alexx Woods) talks to dead people, and almost everybody speaks Spanish. Sometimes their crime scene is a swamp, sometimes a resort hotel. Either way, the skies are always sunny--the gators always biting. Real-life Florida resident Caruso is joined by Khandi Alexander (\", 'NewsRadio', ') as Woods, Emily Procter (', 'The West Wing', ') as ballistics expert Calleigh Duquesne, Adam Rodriguez (', 'Roswell', ') as underwater recovery expert Eric Delko, and featured player Rory Cochrane as Tim \"Speed\" Speedle. Cochrane (', 'Dazed and Confused', ') wouldn\\'t become a full-fledged cast member until the 12th episode (\"Entrance Wound\"). Meanwhile, Kim Delaney (Caruso\\'s former', 'NYPD Blue', 'cast mate) wouldn\\'t join until the first (\"Golden Parachute\"), but left after the 10th (\"A Horrible Mind\"), reportedly due to a lack of chemistry with Caruso.', 'Just as', 'CSI', 'has made the most of its location with stories about showgirls and casino owners, so has', 'CSI: Miami', 'exploited its surroundings for all they\\'re worth. Pilot episode \"Cross-Jurisdictions\" (a crossover with', 'CSI', '), for instance, was loosely based on the murder of Miami-based designer Gianni Versace. Other notable episodes include \"Camp Fear\" with', 'Joan of Arcadia', '\\'s Amber Tamblyn as a detention camp cadet and \"Dead Woman Walking\" with Karen Sillas (', 'Under Suspicion', ') as a victim of radiation poisoning. Like its parent program,', 'CSI: Miami', 'quickly became a ratings powerhouse and was followed by', 'CSI: New York', 'in 2004.', '--Kathleen C. Fennessy']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Box set, Anamorphic, Color, Closed-captioned, Dolby, NTSC, Widescreen', 'Contributor': 'Boti Bliss, Bryan Spicer, Deran Sarafian, David Caruso, Rory Cochrane, David Grossman, Greg Yaitanes, Adam Rodriguez, Jeannot Szwarc, Khandi Alexander, Eva LaRue, Daniel Attias, Omar Benson Miller, Jonathan Togo, Christian Clemenson, Sofia Milos, Emily Procter, Rex Linn, Charles Correll, Joe ChappelleBoti Bliss, Bryan Spicer, Deran Sarafian, David Caruso, Rory Cochrane, David Grossman, Greg Yaitanes, Adam Rodriguez, Jeannot Szwarc, Khandi Alexander, Eva LaRue, Daniel Attias, Omar Benson Miller, Jonathan Togo, Christian Clemenson, Sofia Milos, Emily Procter, Rex L…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '7', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1.5 inches; 1 Pounds', 'Item model number': '2238093', 'Director': 'Bryan Spicer, Charles Correll, Daniel Attias, David Grossman, Deran Sarafian', 'Media Format': 'Multiple Formats, Box set, Anamorphic, Color, Closed-captioned, Dolby, NTSC, Widescreen', 'Run time': '18 hours and 13 minutes', 'Release date': 'June 29, 2004', 'Actors': 'David Caruso, Emily Procter, Adam Rodriguez, Rex Linn, Jonathan Togo', 'Subtitles': 'None', 'Studio': 'Paramount', 'Number of discs': '7'}\nLiving in Las Vegas, the last thing I wanted to see was a show about this city on television. Having lived here most of my life, I didn't see anything interesting about it.<br /><br />So, when CSI: Crime Scene Investigation came along, I decided to give it a try and see what it had to offer. Maybe it would be interesting, after all I enjoyed Profiler until it was cancelled; and this was similiar, yet only to a point.<br /><br />30 minutes into CSI: Crime Scene Investigation, I fell asleep. And, each time I would watch the episodes, I'd nod off. After a few times, I gave it up. (Nothing personal to the cast, but they were not that interesting).<br /><br />But to each their own. If one likes it and another doesn't; it doesn't make it a wrong choice, just personal choices and certainly you shouldn't be comparing the way something is done in one city to what is done in another. We are all looking for something different when we watch TV, and that fuels the choices we make.<br /><br />In 2002, another CSI was coming out, this time with David Caruso as the lead actor and set in Miami. I was thinking Miami Vice with David Caruso; not a pretty sight, but worth a try.<br /><br />Tried it I did, and got hooked (so hooked I own season 1-4 on DVD) and watch it whenever time permits.<br /><br />Here I am, now 5 years later, looking forward to getting season 5 on DVD (I have to wait until Christmas cause someone in my family decided it'd be funny to give it to me as a gift).<br /><br />I find the characters compelling and more approachable, the kind of people you'd call for help.<br /><br />Yes (biting my own tongue), that even includes Caruso's \"Horatio Caine\"; one of the best characters on the series. Tough when he has to be, compassionate where it warrants, never once forgetting about the families that are left behind. That to me is his only concern, and that is where it should be. It's that commitment I am attracted to.<br /><br />Yes, he threatens dirtbags (oh my favorite parts of the episodes), but think about this, you would want Caine on your side to find your loved one's killer and would want him to do everything he could to ensure justice was done. No, you wouldn't like it if you were guilty of a crime, who would?<br /><br />He's good with women and children, having perhaps too much of a protective instinct, which is lacking in today's society. Maybe that's why some people dislike his character. (Note: Caine's father killed his mother when he was younger, so there might be a reason for his attitude).<br /><br />His tricks or nuances are his way of letting those around him know that he is always thinking, thinking about ways to get one step ahead of the killer and bring him/her to justice. Not to mention those little \"nuances\" make the suspect nervous, if you're guilty he will make you squirm.<br /><br />The science is at times gruesome, then again, murder isn't pretty. We seem to forget that.<br /><br />Alexx talking to the victims reminds us that these were once people too, that they had families, they were not just something that was discarded as trash.<br /><br />We forget too often after people are dead that they were here and touched someone's life. We forget that they were someone's mother, father, daughter, son, brother, sister. They started out their day planning in some cases to come home to all of us, but fate intervened.<br /><br />Alexx reminds us of this, and I personally like it. We need to be reminded of the consequences of greed, corruption and personal desires.<br /><br />As far as Calleigh, Eric, Speed (who I miss in the series) and the rest of the CSI: Miami team, they are a diverse group that reminds us how workplace politics play a crucial role in how outcomes are determined; they have dedicated their lives to putting criminals behind bars and finding closure for the families.<br /><br />Some of the stories are interesting, some make you think, and others are about par for the course when it comes to reality.<br /><br />If you like it, you like it, there is no explaining it; you either have it on DVD or are planning to get it.<br /><br />If you don't like it, no one is making you watch it or buy it, so leave it alone (clothing is clothing, I can dress like a model by buying certain clothes at Walmart). Don't waste your money, you're better off getting something you do like.<br /><br />If you don't like the acting, don't watch it. This is after all--FICTION. The telling of a story that's purpose is to entertain.<br /><br />And, I plan to keep watching as long as it's on.\nQuit Picking At It, Like It or Leave It\nCSI: Miami: Season 2\nDavid Caruso  (Actor),     Emily Procter  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Actors: Adam Rodriguez, David Caruso, Emily Procter, Khandi Alexander, Rory Cochrane Special Features: Widescreen Format. Language: English Year: 2003 Runtime: 1020 minutes.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Emily Procter, David Caruso, Rory Cochrane, Adam Rodriguez, Khandi Alexander', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Number Of Discs': '7', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1.5 inches; 13.6 Ounces', 'Item model number': '2238150', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Run time': '17 hours and 23 minutes', 'Release date': 'December 19, 2017', 'Actors': 'David Caruso, Emily Procter, Adam Rodriguez, Khandi Alexander, Rory Cochrane', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '7'}\nBelieve it or not, this was the first season I bought of this series, don't ask me why.<br /><br />I liked CSI: Miami when it first came on, but this season really stood out. So much so that when I got the DVD I finished the season in 3 days. So, naturally I had to buy seasons 1 & 3, then 4.<br /><br />This is one stand-out series.\nFirst Season I Owned\nRansom (Special Edition)\nMel Gibson  (Actor),     Rene Russo  (Actor),     Piotr Sobocinski  (Director),     Ron Howard  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"In this action-thriller, Academy Award(R)-winning superstar Mel Gibson (Best Director, BRAVEHEART, 1995) is Tom Mullen, a wealthy executive whose charmed life is suddenly shattered when his young son is abducted and held for ransom by a gang of ruthless criminals! That's when Mullen defies the experts and takes matters into his own hands ... boldly turning the tables on the kidnappers in a last-chance effort to rescue the boy! A critically acclaimed smash from Academy Award(R)-winning director Ron Howard (A BEAUTIFUL MIND, 2001) that features Rene Russo (THE THOMAS CROWN AFFAIR) and Gary Sinise (THE HUMAN STAIN) in an excellent supporting cast -- you'll find RANSOM pays off big with unpredictable twists and unstoppable excitement!\"]\n{'Genre': 'Drama', 'Format': 'Color, NTSC, Special Edition, Anamorphic, Subtitled, Dolby, Widescreen', 'Contributor': 'Dan Hedaya, Delroy Lindo, Piotr Sobocinski, Rene Russo, Mel Gibson, Lili Taylor, Brawley Nolte, Liev Schreiber, Alexander Ignon, Nancy Ticotin, Michael Gaston, Gary Sinise, Jose Zuniga, Richard Price, Evan Handler, Ron Howard, Donnie Wahlberg, Paul GuilfoyleDan Hedaya, Delroy Lindo, Piotr Sobocinski, Rene Russo, Mel Gibson, Lili Taylor, Brawley Nolte, Liev Schreiber, Alexander Ignon, Nancy Ticotin, Michael Gaston, Gary Sinise, Jose Zuniga, Richard Price, Evan Handler, Ron Howard, Donnie Wahlberg, Paul Guilfoyle   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR786936232981#VG', 'Director': 'Piotr Sobocinski, Ron Howard', 'Media Format': 'Color, NTSC, Special Edition, Anamorphic, Subtitled, Dolby, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'March 23, 2004', 'Actors': 'Mel Gibson, Rene Russo, Brawley Nolte, Paul Guilfoyle, Gary Sinise', 'Subtitles': 'Spanish', 'Studio': 'Touchstone Home Entertainment', 'Writers': 'Richard Price, Alexander Ignon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOk, not too many times does a movie come along and have me wondering what the heck is going on.<br /><br />RANSOM took me by surprise. Yes, it's a contrived \"we have your kid, you want him back, you pay\" plot and storyline. But, it's how it is played out that makes this movie good entertainment.<br /><br />Now, no \"fictional\" movie is ever going to depict real life. But, suspend the \"reality\" for the movie and you go along for a wild ride. Tom Mullen (Gibson) is an airline executive, built the company from the ground-up, and will do anything to protect it. Kate (Russo) is his wife, who obviously has seen the ups and downs of their life, but has honored her \"for better for worse\" marriage vows. Then, they have a talented and bright child Sean (Brawley Nolte) who isn't too neglected and seems to have adequate child/parent time with each parent.<br /><br />In what we should expect to happen, does indeed happen, the child is taken for ransom. But, it's in the how and the who that really grips us. He is taken from a public place which shows the kidnappers as thumbing their nose under everyone, and shows us we are too complacent in our feelings of security in public places, even during the day.<br /><br />Det. Jimmy Shaker (Sinise) is the ring-leader, and I think his identity coming out sooner is to me part of the whole riddle and scheme of the movie, after all, he has no motive....well he does, but we will get to that later. He seems to be functionally insane. He can function in public, do his job and then he's a psycho on top of it all. How else can you do what he did??<br /><br />After a botched \"money drop\" attempt, Mullen finds himself in a situation where he ponders \"would paying the money really insure my son's safe return\"? And he's right. We know it wouldn't. And he attempts to convince his wife that it's not about the money, it's about getting their son back alive. Once the kidnapper has their money, they have no reassurance if the boy will come back alive, which is the whole point behind paying the ransom, now isn't it?<br /><br />So... since it's all about money, why not turn it into a bounty? Which is what Mullen does. Who wouldn't turn in someone they know for $2 million? Which is what he is counting on, and Shaker didn't. Now Shaker has to keep calm (which he can't do, since his scheme is coming apart at the seems along with everyone he's around) and he's going beserk, while everyone else is trying to abandon the plan.<br /><br />And Shaker doesn't like people \"bailing\" on him. Can anyone say \"psycho\"?<br /><br />Shaker decides to give in, and gives the child back alive, killing all his co-horts in the process. But, it's when his greed gets the better of him he gets found out. Had he followed the plan, likely he would have been sipping margaritas in Mexico, but he had to have to money early and pays the ultimate price. Apparently his meds didn't kick in to save his brain or his life.<br /><br />Yes, Mel Gibson might have over-acted as the father. But since it's fiction who are we to argue with that? I did enjoy the balcony scene where for a moment we thought he was going to jump. After all, he thought he'd killed his son. I was hoping he wouldn't jump, then again Shaker wouldn't have won either, but it didn't happen, which was a good thing.<br /><br />Rene Russo was wonderful as the mother, she had a more realistic charm  in the role, but likely wouldn't have faired as well against Sinise.<br /><br />Gary Sinise was wonderful in the movie as far as the crazy bad guy. He stands out more so in the movie since you're wondering what the heck set this guy off. He can play bad guys just as well as good guys (which is why I just love him in CSI: NY).<br /><br />As Shaker is talking/rambling on, we realize one thing, the motive. He wonderfully explains his motive--he saw criminals everyday getting off by buying their way out of trouble. Mullen had recently done so with the Jackie Brown deal. Since Mullen didn't mind paying to stay out of jail/prison, then why not pay to get his son back?<br /><br />Brawley Nolte did a wonderful job as Sean, and it does tug at your heartstrings to see how he was treated and then when he recognizes his kidnapper's voice.<br /><br />Donnie Wahlberg did a wonderful job as the only friend the kid seemed to have in the whole ordeal, and made him a promise that was eventually carried out.<br /><br />The rest of the cast were wonderful, and I wish I could remember all the actors in this movie.<br /><br />The FBI were portrayed as neutral, they were trying to help the Mullens get their son back, while the father decided to take things into his own hands.  At least it stayed away from \"the FBI saved the day\" plot. The movie played out on it's own, and could have been directed by anyone. The cast seemed to compliment each other.<br /><br />If you have DVR (and you're not paying any extra to record it), record it from a movie channel once, if you like buy it; if not, then save the money, and delete.<br /><br />I for one, am going to get the DVD.\nWow!!",
  "profile": "**Updated User Profile Summary**\n\n- **Content Preference**: The user shows a robust interest in nostalgic TV series, particularly those that blend adventure, romance, comedy, and espionage themes. They continue to explore crime dramas, emphasizing character-driven narratives.\n- **Nostalgia Factor**: They enjoy revisiting shows from the late 1970s and 1980s and are increasingly drawn to newer spin-offs that evoke nostalgia.\n- **Format Preference**: The user prefers physical media (DVDs) for easy access, specifically seeking well-packaged collections with enriching content.\n- **Quality Expectations**: They value the preservation of original series quality, readily accepting typical imperfections in older productions while prioritizing enjoyable viewing experiences.\n- **Community Engagement**: Active in discussions about classic shows on DVD, the user appreciates compelling characters and strong storytelling, sharing insights and recommendations.\n- **Rating Behavior**: Generally, they provide high ratings for emotionally and thematically resonant content, prioritizing personal enjoyment over technical aspects and encouraging individual viewing choices.\n\nThe recent acquisition of a crime drama indicates a deepening engagement with the genre, highlighting their ongoing interest in classic narratives. Their enjoyment of immersive binge-watching experiences further reinforces their commitment to exploring captivating and well-crafted stories, maintaining a focus on thrilling plots and character depth.",
  "metrics": {
    "rouge1_f": 0.045174537987679675,
    "rouge2_f": 0.0045651677699155456,
    "rougeL_f": 0.026009582477754964,
    "meteor": 0.0135124774792042,
    "bleu1": 1.397214761358761e-10,
    "bleu2": 5.3168219308704104e-11,
    "bleu3": 1.9709258426637304e-11,
    "bleu4": 5.680091053047591e-12,
    "bertscore_precision": 0.3458562195301056,
    "bertscore_recall": 0.500718355178833,
    "bertscore_f1": 0.4091230034828186
  }
}