{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NCIS: Season 7 [DVD]\nReview Date: 2010/06/30\nStore: David McCallum  (Actor),     Cote de Pablo  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Action & Adventure/Television, Television', 'Format': 'AC-3, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Sean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael WeatherlySean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael Weatherly   See more', 'Language': 'English', 'Number Of Discs': '6'}\nReview Text: Ok, now this review might sound strange, BUT.....<br /><br />I am a late comer to NCIS, for several reasons. Over May, feeling a little under the weather and getting tired of all the stuff I already had on DVD, I bought seasons 1-6...I had only watched the shows in re-runs on USA and had occasionally watched some episodes of season 7 online (I had to cancel my TV service).<br /><br />WOW....is all I can say. From the pilot (Yankee White) in season 1 to the episode Aaliyah (season 6); this cast/crew has my attention. And, I guess they're going to keep it for a while. The fact it is character driven, to me as a viewer, is more important than story-driven. It's the people we as viewers attach ourselves to, who we learn to love/hate each week. Who we connect with, some for different reasons.<br /><br />I've had a hate/love relationship with Mark Harmon and his characters through his many projects. Who could forget he played Ted Bundy?<br /><br />Each character has their own place in our hearts....and this is in no particular order.<br /><br />As Leroy Jethro Gibbs, Mark Harmon has got my attention. His team is his family, often he gives into their \"wild ideas\", but he manages to keep them focused, and cares about them; such as seen in season 7's \"Flesh and Blood\" where at the end, he and DiNozzo share a steak and drink a beer almost like a father & son to show that blood isn't the only thing that connects people as family. Our family are the people we allow into our world, to share our lives with.<br /><br />Moving on to Ziva David; she's an enigma of sorts. She was a trained assassin, but has come to be such an asset of the team and has provided an interesting glimpse into how our American culture is still mis-understood. She has good instincts, a good heart and I believe she cares about the team as her family, such as in the season 7, episode 1 \"Truth or Consequences\"; she was prepared to die, she didn't want McGee or DiNozzo to risk their lives for her; though down the road she apologized to DiNozzo and appreciates his efforts in trying to watch out for her, meaning she is learning to adapt, showing we can change what we have turned into.<br /><br />Timothy McGee has truly come a long way since being a \"probie\" in seasons 1-2; as far as partners go, I prefer the McGee/DiNozzo pairing. McGee has stepped out from the \"geeky\" kid he was and can hold his own, thanks to DiNozzo's tricks and taunts. He is still the brains, but he has developed a personality and has the heart of a lion. The little brother who can dish it out as well, if not sometimes, better than taking it.<br /><br />Abby is still Abby, lol. What can be said about her we don't know. Don't let her clothes fool you. She's excellent in her field. The \"little\" sister of the family, who displayed such emotion when Ziva was rescued, we thought this was a family. Abby is the perpetual ray of sunshine who, even though science might tell her one thing, is prepared to see the other side.<br /><br />Moving on to Dr. Donald \"Ducky\" Mallard. Where do I start with him? He's the kindly grandfather or uncle in the whole mix and shows us that he has the best/worst job of the team. He sees the worst in humanity with the bodies brought before him, but he always teaches us that the dead do talk to us, though not the way we're used to. He shows care and compassion when doing his job, and he is an essential part of the team. He is thorough in his job and even gives Jethro a few good zings to keep him in place. Ducky reminds us there is always something we don't know and if we're in doubt, keep looking. His stories keep us entertained, but provide some kind of lesson in there.<br /><br />Director Vance...while a good guy in this, I don't hold to having the \"boss\" in the mix. He's good, don't get me wrong. I wouldn't be him for the world. Sorry, no knock on the actor, but seriously, most of us don't like our bosses. So he is in the worst position possible, though he tries to make the best of it. And, amazingly he surprises us most of the time. But still, don't like too much of the bureaucrats' involvement.<br /><br />Let's not forget, one of the key members of this team, and next to Gibbs...last, but not least...<br /><br />NCIS Very Special (Senior) Agent Anthony DiNozzo. Yes, I know he's a goof-ball to some, but have you ever really observed him? He's the \"perfect\" guy (at least for this girl, lol)...he has a steady and not too shabby job, a sense of humor, an unparalleled dedication to his co-workers, good looks (very easy on the eyes), romantic, charming..and when he gets down to business, absolutely the best investigator on the team, again, next to Gibbs.<br /><br />DiNozzo is the eternal \"frat boy\", but at the same time, I don't think I would get on his bad side. While he might hide behind the face of a clown, DiNozzo has \"been there, done that\" and it's his sense of humor that holds the balance to sanity with the demands of his job. He's seen the worst of the worst, and the job is stressful, so his goofiness is key to \"keeping it together\". He can be a bit unconventional, but if he were like Gibbs, he'd be....well Gibbs. DiNozzo also has a soft and kind heart, though he wants to hide it; particularly in \"Flesh and Blood\" where he paid his father's bill & \"Obsession\" where his obsession to find the woman led him to call her, and the team was able to figure out what happened. DiNozzo stayed with her until she died, proving he is human after all.<br /><br />He too has grown up since the first season, but not at the rate he should have, lol. Then again, would we want him to change? I know I don't. And trust me, I was schooled in coming around to being a \"DiNozzo Girl\". He is who is his, he does his job and if that satisfies Gibbs, we don't question Gibbs.<br /><br />All in all, this isn't just another \"crime procedural/drama\". This show goes ABOVE that level. I still love CSI: NY and CSI: Miami, just not as much as NCIS. Gibbs, Ziva, McGee, Abby, Ducky and Tony DiNozzo have become part of our culture and part of our family.<br /><br />They're still going good at 7 seasons, and at this rate....here is to 7 more (and hopefully more).<br /><br />I'm glad I only have to wait two months to get it....otherwise we'd have a rule coming up on that one. I can hold off on CSI: NY and Miami (and in that order). But, mess with my NCIS...might have to invoke a GIBBS RULE.<br /><br />ADDED on 9/8/2010:<br /><br />As of note; the two-part \"starter\" episodes of JAG (Ice Queen & Meltdown are what I call a \"starter-pilot\") they are still \"Official\" \"JAG\" episodes as \"NCIS\" goes...Yankee White can be considered the Pilot as well. Some series do that. Yankee White is still considered as \"Episode 1\" :)...just as the NCIS: LA Pilot or \"starter\" episodes are still NCIS :)<br /><br />And, I have had no performance issues with the DVDs and I own all 7 seasons.\nReview Title: NCIS, best show out there :) **MIGHT CONTAIN SPOILERS**\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Scarecrow and Mrs. King: Season 1\nJackson, Kate  (Actor, Director),     Bruce Boxleitner  (Actor),     Bole, Cliff  (Director),     Brinckerhoff, Burt  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Scarecrow & Mrs. King: The Complete First Season (DVD)', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'Scarecrow and Mrs. King', 'proves there was life for Kate Jackson after', \"Charlie's Angels\", '--and for Bruce Boxleitner before', 'Babylon 5', '. Jackson\\'s divorcée, Amanda King, a pretty lady with an \\'80s perm, lives outside D.C. with her sons, Jamie and Phillip. At a train station, she meets Boxleitner\\'s Lee \"Scarecrow\" Stetson, who convinces her to do a \"life or death\" favor. The delivery to the man in the red hat doesn\\'t go as planned, but King ends up cracking the case and a new team ensues. Scarecrow\\'s boss, Billy (Mel Stewart), thinks a housewife will make a perfect decoy, though fellow agent Francine (Martha Smith) has her doubts. As she says about her colleague, \"His methods might be unorthodox, but Scarecrow always delivers.\" Unfortunately for the apprentice agent, she can\\'t tell anyone about her new career, not even her mother, Dotty (Beverly Garland, great value), who looks after the boys when she takes on assignments, offering different excuses every time. In Scarecrow, however, Amanda finds a friend as well as a partner--and a possible love interest, to judge from their longing glances.', 'If', 'Scarecrow and Mrs. King', 'bears comparison with', 'Remington Steele', \", the cases that deal with the domestic arena help to set it apart, with perpetrators ranging from cooking-show hosts to cosmetics titans. The more dramatic episodes don't work as well, mostly because they feel like retreads from\", 'The Rockford Files', \"(executive producer Juanita Bartlett has written for both programs). Also, Jackson is a deft comic actress, but her crying scenes don't quite convince. Still, it's a minor complaint about a light entertainment that wasn't aiming for documentary realism. Plus, it's the chemistry between the leads that led to three more seasons--and Boxleitner's\", 'GQ', \"good looks certainly didn't hurt.\", '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense', 'Format': 'Multiple Formats, Full Screen, Color, Subtitled, NTSC', 'Contributor': 'Neufeld Jr., Sigmund, Bruce Boxleitner, McEveety, Vincent, Sgarro, Nicholas, Hayers, Sidney, Bole, Cliff, Paul Stout, Hiatt, Michael, Duckwall, Dennis C., Holcomb, Rod, Patterson (III), John, Scott, Oz, Mayberry, Russ, Kolbe, Winrich, Mel Stewart, Wiard, William, Frawley, James, Beverly Garland, Sweeney, Bob, Greg Morton, Martha Smith, Jackson, Kate, Harris, Harry, Brinckerhoff, Burt, Laidman, Harvey S., Mackenzie, WillNeufeld Jr., Sigmund, Bruce Boxleitner, McEveety, Vincent, Sgarro, Nicholas, Hayers, Sidney, Bole, Cliff, Paul Stout, Hiatt, Michael, Duckwall, Dennis C., Holcomb, Rod, Patterson (III), John, Scott, Oz, Mayberry, Russ, Kolbe, Winrich, Mel Stewart, Wiard, William, Frawley, James, Bev…  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.75 inches; 4 Ounces', 'Item model number': '6638801', 'Director': 'Bole, Cliff, Brinckerhoff, Burt, Duckwall, Dennis C., Frawley, James, Harris, Harry', 'Media Format': 'Multiple Formats, Full Screen, Color, Subtitled, NTSC', 'Run time': '16 hours and 6 minutes', 'Release date': 'March 9, 2010', 'Actors': 'Jackson, Kate, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Studio': 'Warner Home Video', 'Number of discs': '5'}\nI see I am not the only one out there that wants to see this series again.<br /><br />Thank God for that.<br /><br />I grew up watching this series. My mom liked it and she and I would watch every episode when it originally aired, particularly the one where Lee and Amanda finally got married. I don't have a DVR or enough time in the day to hunt and search for the episodes, which many times air out of order. Can we get this on DVD?<br /><br />Here is a really, super smart idea.<br /><br />Anyone ready for this one?<br /><br />Take pre-orders. Release the ENTIRE SHOW on DVD, then send it out to those who have pre-ordered it. That makes a lot of sense. Why am I seeing some new series, which haven't been on but even 1-2 seasons, before they are out on DVD.<br /><br />Sopranos? NIP/TUCK? These series are still being aired with new episodes weekly. I know they are popular, but come on, this show was good too.<br /><br />How hard can this be? There are a lot of people that like the series, and want to see it again. There was a time I had to wait 2 years in between the time it was on one station in syndication before it came back on another station.<br /><br />AS OF 3/9/2010....<br /><br />This series has been released on DVD. The earlier review was written 3 years ago. I had actually forgot I had written a review of this until I went to review it and it gave me the option to EDIT, and EDIT I shall.<br /><br />I still give it 5 stars. The network and production company did great by it, or as best as they could; given it's age. It has been over 20 years since it has been on and I bet the original tape/film is not as good as it once was, but it isn't as bad as it could be either.<br /><br />But don't look for extras--out takes, commentaries, promo commercials or even a \"behind the scenes\"; because it isn't on this wonderful 5 disc set. I say wonderful because the packaging is awesome. It is one jewel case with single sided DVDs which take no more room than at best 2 DVDs on the shelf, which goes into a cardboard sleeve. It comes with a booklet to explain each episode and the characters. The DVD artwork is good. The DVDs are clearly marked and the \"menu\" screen is simple. You can play ALL episodes at once or select individual ones.<br /><br />As far as the quality, it might not have been digitally remastered as you can literally see the \"scratches\" in the file. The DVDs play without skipping and the episodes are just as wonderful as I remember them being.<br /><br />If you love the series, here it is. I can not wait for the rest of the seasons and hope they are as quickly released as Nash Bridges has been.\nScarecrow & Mrs King Needs To Be (IS FINALLY) On DVD\nCSI: Miami: Season 1\nDavid Caruso  (Actor),     Emily Procter  (Actor),     Bryan Spicer  (Director),     Charles Correll  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', 'David Caruso, Emily Procter, Kim Delaney. From the creators of the original hit series comes this action-packed spinoff featuring the same brain-busting crimes to solve, set in the steamy streets of South Florida. 25 episodes on 7 DVDs. 2002-03/color/18 hrs/NR/widescreen.', 'Amazon.com', 'As Lt. Horatio Caine (David Caruso) notes in episode 4 (\"Just One Kiss\"), \"The evidence, as always, will speak for itself.\" In other words,', 'CSI: Miami', 'follows the same super-successful formula as', 'CSI: Crime Scene Investigation', '. Fortunately, this instantly popular spin-off established its own unique identity from the start. Like', 'CSI', ', the Dade County criminalists of', 'CSI: Miami', \"solve murders using forensic science. Unlike the Vegas crew, however, they're cops with the power to arrest, their coroner (Alexx Woods) talks to dead people, and almost everybody speaks Spanish. Sometimes their crime scene is a swamp, sometimes a resort hotel. Either way, the skies are always sunny--the gators always biting. Real-life Florida resident Caruso is joined by Khandi Alexander (\", 'NewsRadio', ') as Woods, Emily Procter (', 'The West Wing', ') as ballistics expert Calleigh Duquesne, Adam Rodriguez (', 'Roswell', ') as underwater recovery expert Eric Delko, and featured player Rory Cochrane as Tim \"Speed\" Speedle. Cochrane (', 'Dazed and Confused', ') wouldn\\'t become a full-fledged cast member until the 12th episode (\"Entrance Wound\"). Meanwhile, Kim Delaney (Caruso\\'s former', 'NYPD Blue', 'cast mate) wouldn\\'t join until the first (\"Golden Parachute\"), but left after the 10th (\"A Horrible Mind\"), reportedly due to a lack of chemistry with Caruso.', 'Just as', 'CSI', 'has made the most of its location with stories about showgirls and casino owners, so has', 'CSI: Miami', 'exploited its surroundings for all they\\'re worth. Pilot episode \"Cross-Jurisdictions\" (a crossover with', 'CSI', '), for instance, was loosely based on the murder of Miami-based designer Gianni Versace. Other notable episodes include \"Camp Fear\" with', 'Joan of Arcadia', '\\'s Amber Tamblyn as a detention camp cadet and \"Dead Woman Walking\" with Karen Sillas (', 'Under Suspicion', ') as a victim of radiation poisoning. Like its parent program,', 'CSI: Miami', 'quickly became a ratings powerhouse and was followed by', 'CSI: New York', 'in 2004.', '--Kathleen C. Fennessy']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Box set, Anamorphic, Color, Closed-captioned, Dolby, NTSC, Widescreen', 'Contributor': 'Boti Bliss, Bryan Spicer, Deran Sarafian, David Caruso, Rory Cochrane, David Grossman, Greg Yaitanes, Adam Rodriguez, Jeannot Szwarc, Khandi Alexander, Eva LaRue, Daniel Attias, Omar Benson Miller, Jonathan Togo, Christian Clemenson, Sofia Milos, Emily Procter, Rex Linn, Charles Correll, Joe ChappelleBoti Bliss, Bryan Spicer, Deran Sarafian, David Caruso, Rory Cochrane, David Grossman, Greg Yaitanes, Adam Rodriguez, Jeannot Szwarc, Khandi Alexander, Eva LaRue, Daniel Attias, Omar Benson Miller, Jonathan Togo, Christian Clemenson, Sofia Milos, Emily Procter, Rex L…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '7', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1.5 inches; 1 Pounds', 'Item model number': '2238093', 'Director': 'Bryan Spicer, Charles Correll, Daniel Attias, David Grossman, Deran Sarafian', 'Media Format': 'Multiple Formats, Box set, Anamorphic, Color, Closed-captioned, Dolby, NTSC, Widescreen', 'Run time': '18 hours and 13 minutes', 'Release date': 'June 29, 2004', 'Actors': 'David Caruso, Emily Procter, Adam Rodriguez, Rex Linn, Jonathan Togo', 'Subtitles': 'None', 'Studio': 'Paramount', 'Number of discs': '7'}\nLiving in Las Vegas, the last thing I wanted to see was a show about this city on television. Having lived here most of my life, I didn't see anything interesting about it.<br /><br />So, when CSI: Crime Scene Investigation came along, I decided to give it a try and see what it had to offer. Maybe it would be interesting, after all I enjoyed Profiler until it was cancelled; and this was similiar, yet only to a point.<br /><br />30 minutes into CSI: Crime Scene Investigation, I fell asleep. And, each time I would watch the episodes, I'd nod off. After a few times, I gave it up. (Nothing personal to the cast, but they were not that interesting).<br /><br />But to each their own. If one likes it and another doesn't; it doesn't make it a wrong choice, just personal choices and certainly you shouldn't be comparing the way something is done in one city to what is done in another. We are all looking for something different when we watch TV, and that fuels the choices we make.<br /><br />In 2002, another CSI was coming out, this time with David Caruso as the lead actor and set in Miami. I was thinking Miami Vice with David Caruso; not a pretty sight, but worth a try.<br /><br />Tried it I did, and got hooked (so hooked I own season 1-4 on DVD) and watch it whenever time permits.<br /><br />Here I am, now 5 years later, looking forward to getting season 5 on DVD (I have to wait until Christmas cause someone in my family decided it'd be funny to give it to me as a gift).<br /><br />I find the characters compelling and more approachable, the kind of people you'd call for help.<br /><br />Yes (biting my own tongue), that even includes Caruso's \"Horatio Caine\"; one of the best characters on the series. Tough when he has to be, compassionate where it warrants, never once forgetting about the families that are left behind. That to me is his only concern, and that is where it should be. It's that commitment I am attracted to.<br /><br />Yes, he threatens dirtbags (oh my favorite parts of the episodes), but think about this, you would want Caine on your side to find your loved one's killer and would want him to do everything he could to ensure justice was done. No, you wouldn't like it if you were guilty of a crime, who would?<br /><br />He's good with women and children, having perhaps too much of a protective instinct, which is lacking in today's society. Maybe that's why some people dislike his character. (Note: Caine's father killed his mother when he was younger, so there might be a reason for his attitude).<br /><br />His tricks or nuances are his way of letting those around him know that he is always thinking, thinking about ways to get one step ahead of the killer and bring him/her to justice. Not to mention those little \"nuances\" make the suspect nervous, if you're guilty he will make you squirm.<br /><br />The science is at times gruesome, then again, murder isn't pretty. We seem to forget that.<br /><br />Alexx talking to the victims reminds us that these were once people too, that they had families, they were not just something that was discarded as trash.<br /><br />We forget too often after people are dead that they were here and touched someone's life. We forget that they were someone's mother, father, daughter, son, brother, sister. They started out their day planning in some cases to come home to all of us, but fate intervened.<br /><br />Alexx reminds us of this, and I personally like it. We need to be reminded of the consequences of greed, corruption and personal desires.<br /><br />As far as Calleigh, Eric, Speed (who I miss in the series) and the rest of the CSI: Miami team, they are a diverse group that reminds us how workplace politics play a crucial role in how outcomes are determined; they have dedicated their lives to putting criminals behind bars and finding closure for the families.<br /><br />Some of the stories are interesting, some make you think, and others are about par for the course when it comes to reality.<br /><br />If you like it, you like it, there is no explaining it; you either have it on DVD or are planning to get it.<br /><br />If you don't like it, no one is making you watch it or buy it, so leave it alone (clothing is clothing, I can dress like a model by buying certain clothes at Walmart). Don't waste your money, you're better off getting something you do like.<br /><br />If you don't like the acting, don't watch it. This is after all--FICTION. The telling of a story that's purpose is to entertain.<br /><br />And, I plan to keep watching as long as it's on.\nQuit Picking At It, Like It or Leave It\nCSI: Miami: Season 2\nDavid Caruso  (Actor),     Emily Procter  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Actors: Adam Rodriguez, David Caruso, Emily Procter, Khandi Alexander, Rory Cochrane Special Features: Widescreen Format. Language: English Year: 2003 Runtime: 1020 minutes.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Emily Procter, David Caruso, Rory Cochrane, Adam Rodriguez, Khandi Alexander', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Number Of Discs': '7', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1.5 inches; 13.6 Ounces', 'Item model number': '2238150', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Run time': '17 hours and 23 minutes', 'Release date': 'December 19, 2017', 'Actors': 'David Caruso, Emily Procter, Adam Rodriguez, Khandi Alexander, Rory Cochrane', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '7'}\nBelieve it or not, this was the first season I bought of this series, don't ask me why.<br /><br />I liked CSI: Miami when it first came on, but this season really stood out. So much so that when I got the DVD I finished the season in 3 days. So, naturally I had to buy seasons 1 & 3, then 4.<br /><br />This is one stand-out series.\nFirst Season I Owned\nRansom (Special Edition)\nMel Gibson  (Actor),     Rene Russo  (Actor),     Piotr Sobocinski  (Director),     Ron Howard  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"In this action-thriller, Academy Award(R)-winning superstar Mel Gibson (Best Director, BRAVEHEART, 1995) is Tom Mullen, a wealthy executive whose charmed life is suddenly shattered when his young son is abducted and held for ransom by a gang of ruthless criminals! That's when Mullen defies the experts and takes matters into his own hands ... boldly turning the tables on the kidnappers in a last-chance effort to rescue the boy! A critically acclaimed smash from Academy Award(R)-winning director Ron Howard (A BEAUTIFUL MIND, 2001) that features Rene Russo (THE THOMAS CROWN AFFAIR) and Gary Sinise (THE HUMAN STAIN) in an excellent supporting cast -- you'll find RANSOM pays off big with unpredictable twists and unstoppable excitement!\"]\n{'Genre': 'Drama', 'Format': 'Color, NTSC, Special Edition, Anamorphic, Subtitled, Dolby, Widescreen', 'Contributor': 'Dan Hedaya, Delroy Lindo, Piotr Sobocinski, Rene Russo, Mel Gibson, Lili Taylor, Brawley Nolte, Liev Schreiber, Alexander Ignon, Nancy Ticotin, Michael Gaston, Gary Sinise, Jose Zuniga, Richard Price, Evan Handler, Ron Howard, Donnie Wahlberg, Paul GuilfoyleDan Hedaya, Delroy Lindo, Piotr Sobocinski, Rene Russo, Mel Gibson, Lili Taylor, Brawley Nolte, Liev Schreiber, Alexander Ignon, Nancy Ticotin, Michael Gaston, Gary Sinise, Jose Zuniga, Richard Price, Evan Handler, Ron Howard, Donnie Wahlberg, Paul Guilfoyle   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR786936232981#VG', 'Director': 'Piotr Sobocinski, Ron Howard', 'Media Format': 'Color, NTSC, Special Edition, Anamorphic, Subtitled, Dolby, Widescreen', 'Run time': '2 hours and 1 minute', 'Release date': 'March 23, 2004', 'Actors': 'Mel Gibson, Rene Russo, Brawley Nolte, Paul Guilfoyle, Gary Sinise', 'Subtitles': 'Spanish', 'Studio': 'Touchstone Home Entertainment', 'Writers': 'Richard Price, Alexander Ignon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOk, not too many times does a movie come along and have me wondering what the heck is going on.<br /><br />RANSOM took me by surprise. Yes, it's a contrived \"we have your kid, you want him back, you pay\" plot and storyline. But, it's how it is played out that makes this movie good entertainment.<br /><br />Now, no \"fictional\" movie is ever going to depict real life. But, suspend the \"reality\" for the movie and you go along for a wild ride. Tom Mullen (Gibson) is an airline executive, built the company from the ground-up, and will do anything to protect it. Kate (Russo) is his wife, who obviously has seen the ups and downs of their life, but has honored her \"for better for worse\" marriage vows. Then, they have a talented and bright child Sean (Brawley Nolte) who isn't too neglected and seems to have adequate child/parent time with each parent.<br /><br />In what we should expect to happen, does indeed happen, the child is taken for ransom. But, it's in the how and the who that really grips us. He is taken from a public place which shows the kidnappers as thumbing their nose under everyone, and shows us we are too complacent in our feelings of security in public places, even during the day.<br /><br />Det. Jimmy Shaker (Sinise) is the ring-leader, and I think his identity coming out sooner is to me part of the whole riddle and scheme of the movie, after all, he has no motive....well he does, but we will get to that later. He seems to be functionally insane. He can function in public, do his job and then he's a psycho on top of it all. How else can you do what he did??<br /><br />After a botched \"money drop\" attempt, Mullen finds himself in a situation where he ponders \"would paying the money really insure my son's safe return\"? And he's right. We know it wouldn't. And he attempts to convince his wife that it's not about the money, it's about getting their son back alive. Once the kidnapper has their money, they have no reassurance if the boy will come back alive, which is the whole point behind paying the ransom, now isn't it?<br /><br />So... since it's all about money, why not turn it into a bounty? Which is what Mullen does. Who wouldn't turn in someone they know for $2 million? Which is what he is counting on, and Shaker didn't. Now Shaker has to keep calm (which he can't do, since his scheme is coming apart at the seems along with everyone he's around) and he's going beserk, while everyone else is trying to abandon the plan.<br /><br />And Shaker doesn't like people \"bailing\" on him. Can anyone say \"psycho\"?<br /><br />Shaker decides to give in, and gives the child back alive, killing all his co-horts in the process. But, it's when his greed gets the better of him he gets found out. Had he followed the plan, likely he would have been sipping margaritas in Mexico, but he had to have to money early and pays the ultimate price. Apparently his meds didn't kick in to save his brain or his life.<br /><br />Yes, Mel Gibson might have over-acted as the father. But since it's fiction who are we to argue with that? I did enjoy the balcony scene where for a moment we thought he was going to jump. After all, he thought he'd killed his son. I was hoping he wouldn't jump, then again Shaker wouldn't have won either, but it didn't happen, which was a good thing.<br /><br />Rene Russo was wonderful as the mother, she had a more realistic charm  in the role, but likely wouldn't have faired as well against Sinise.<br /><br />Gary Sinise was wonderful in the movie as far as the crazy bad guy. He stands out more so in the movie since you're wondering what the heck set this guy off. He can play bad guys just as well as good guys (which is why I just love him in CSI: NY).<br /><br />As Shaker is talking/rambling on, we realize one thing, the motive. He wonderfully explains his motive--he saw criminals everyday getting off by buying their way out of trouble. Mullen had recently done so with the Jackie Brown deal. Since Mullen didn't mind paying to stay out of jail/prison, then why not pay to get his son back?<br /><br />Brawley Nolte did a wonderful job as Sean, and it does tug at your heartstrings to see how he was treated and then when he recognizes his kidnapper's voice.<br /><br />Donnie Wahlberg did a wonderful job as the only friend the kid seemed to have in the whole ordeal, and made him a promise that was eventually carried out.<br /><br />The rest of the cast were wonderful, and I wish I could remember all the actors in this movie.<br /><br />The FBI were portrayed as neutral, they were trying to help the Mullens get their son back, while the father decided to take things into his own hands.  At least it stayed away from \"the FBI saved the day\" plot. The movie played out on it's own, and could have been directed by anyone. The cast seemed to compliment each other.<br /><br />If you have DVR (and you're not paying any extra to record it), record it from a movie channel once, if you like buy it; if not, then save the money, and delete.<br /><br />I for one, am going to get the DVD.\nWow!!\nVegas: Season 1, Vol. 1\nTony Curtis  (Actor),     Judy Landers  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Handsome, fun loving, private eye, Dan Tanna, drives around Las Vegas in his vintage Thunderbird solving private cases but is also on retainer to a wealthy casino owner to keep crime out of his hotels. He is helped by his smart and sexy assistant, a sexy and not too smart chorus girl who takes messages for him, and his enthusiastic, yet inept, legman.']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Judy Landers, Phyllis Davis, Tony Curtis, Greg Morris, Robert Urich, Bart Braverman, Naomi Stevens', 'Language': 'Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '5821858', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '9 hours and 28 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Tony Curtis, Judy Landers, Robert Urich, Bart Braverman, Naomi Stevens', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '3'}\nOk first of all....<br /><br />Yes, I feel we got cheated on price & quanitity. 11 episodes at the price of what some full seasons go for. That is the economy, and times we live in. And, it really sucks since we as the consumers suffer as a result. Unfortunately, we the viewers asked for this, so we have to take some responsibility. I have learned to cut out certain things in order to still afford my entertainment...<br /><br />BUT....<br /><br />And, remember, this is my opinion.....not a fact...<br /><br />Buying something like this, the price depends on how bad you really want it....how available it is anywhere else, the quality and the integrity of the merchant. What does owning this series mean to you? It is, in it's own way, a collectible. So that should be taken into consideration.<br /><br />Also, there might be some copyright issues to work out to get all of it on DVD. Let's face it, we all know about the mountains of paperwork required for cars & homes....and we aren't fully informed about what goes into producing older shows, from studios perhaps no longer in business or producers long deceased.<br /><br />An interesting fact, this is produced by CBS entertainment; and correct me if I am wrong--this series aired on ABC when it ran from 1978-1981. I was 2 at the time, but I remember Aaron Spelling being the ABC king with much of his series, even into the early 80's--Love Boat, TJ Hooker, Fantasy Island.....<br /><br />That could be an issue as well.<br /><br />However, this is to review the product itself.<br /><br />For me, yes, $25.99 (which is what I was charged) is well worth it. This series is over 30 years old, never found it's own audience as it followed behind Charlie's Angels. So it was destined to fail by the Powers That Be (PTB). Still, the people who remember it from back then or it's limited run in re-runs appreciate the fact that even some of it is available. I know I do.<br /><br />The DVDs are a great quality, given what the studios have to work with. And even on an HDTV with an HD upgradable DVD player, from a distance they look no worse than newer DVDs. There were no problems with skips, jumps or freezing. The case is around the same size as a standard DVD, which makes storage easy...especially if you have a lot of DVDs.They are snapped into place, so there are no issues with them popping out and moving, though with the shipping services that is not always guaranteed, but mine survived the postal service.<br /><br />All in all, if you want the series and have the money, pick it up. And while it isn't always visually accurate (driving scenes especially) it does what it was meant to do--entertain.\nShort Lived on the Screen,  Long Lived in our Hearts\nNash Bridges: Season 3\nJohnson, Don  (Actor),     Marin, Cheech  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['Nash Bridges', \"(Don Johnson) is a high-action drama about a San Francisco police investigator who deserves his reputation as a topnotch cop, but who's not always so successful when it comes to his personal life. As a member of the elite Special Investigations Unit, Nash relies on his streetwise instincts, keen sense of humor and charm to work his magic on the streets of San Francisco.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Marin, Cheech, Gammon, James, Johnson, Don, Gomez, Jaime, Perry, Jeff', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 0.01 Ounces', 'Item model number': '143134', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '17 hours and 39 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Johnson, Don, Marin, Cheech, Perry, Jeff, Gomez, Jaime, Gammon, James', 'Studio': 'Paramount', 'Number of discs': '1'}\nOk let me be clear about this....I love this series. It dominated my Friday nights from 1996-2001. BUT, this is not what I remembered and we should get a price break on it; however; this is to RATE the item. And, I HATE rating it like I do, cause I loved this series.<br /><br />So, here goes...<br /><br />If I were to rate it based on the action & storylines I remember--I'd be 5 stars.<br /><br />If I were to rate it based on the lack of the music or music changes from the original CBS airings--It'd be NO STARS.<br /><br />Now, I am usually an easy-going person. But, when I want the COMPLETE SERIES or the COMPLETE SEASON, I want it complete & unaltered. That is not what I got. One episode for example--REVELATIONS; is a mess. One of my most favorite episodes of this season and truthfully, the \"new\" ending really sucks.<br /><br />At the end as Nash was driving away in the 'Cuda, you heard Van Morrison's \"Into The Mystic\". I know because I had to call the production office to find the name of the song.<br /><br />Alas, it was replaced by something else and less meaningful. Same as the episode \"Sacraments\"--the song at the end (in the original airing) was Eric Clapton's \"My Father's Eyes\"; again replaced with something less meaningful and to me, degrades the series and what it accomplished. I haven't seen the entire season, but I would bet most of the really great music has been altered. That is what made this series what it was at times--the music.<br /><br />If I were not so dedicated to the series, and didn't want to waste my time recording it on DVR and transferring it to my own DVDS, I would stop ordering future seasons. I am half tempted to do so.....BUT...I asked for it on DVD and as my mother said \"be careful what you wish for\" as well as \"having a thing isn't so pleasing as wanting\"....so I will have to deal with it. I would encourage people who remember the series for what it was to contact Paramount and voice your displeasure, as I intend to do. I thought seasons 1 & 2 were \"over-sights\", clearly it is not.<br /><br />The good things? The packaging is still good--plastic case designed to hold multiple discs, a real space-saving design. The item arrived in great shape and when promised. But don't expect any special features.<br /><br />Overall, I will give it 3 stars; though I hope CBS can quit *crewing up a good thing. If it's the money deal, I would pay more for what I want & remember as opposed to cheap for cheap :)\nThe series is still good--music sucks\nNCIS: Season 7 [DVD]\nDavid McCallum  (Actor),     Cote de Pablo  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'AC-3, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Sean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael WeatherlySean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael Weatherly   See more', 'Language': 'English', 'Number Of Discs': '6'}\nOk, now this review might sound strange, BUT.....<br /><br />I am a late comer to NCIS, for several reasons. Over May, feeling a little under the weather and getting tired of all the stuff I already had on DVD, I bought seasons 1-6...I had only watched the shows in re-runs on USA and had occasionally watched some episodes of season 7 online (I had to cancel my TV service).<br /><br />WOW....is all I can say. From the pilot (Yankee White) in season 1 to the episode Aaliyah (season 6); this cast/crew has my attention. And, I guess they're going to keep it for a while. The fact it is character driven, to me as a viewer, is more important than story-driven. It's the people we as viewers attach ourselves to, who we learn to love/hate each week. Who we connect with, some for different reasons.<br /><br />I've had a hate/love relationship with Mark Harmon and his characters through his many projects. Who could forget he played Ted Bundy?<br /><br />Each character has their own place in our hearts....and this is in no particular order.<br /><br />As Leroy Jethro Gibbs, Mark Harmon has got my attention. His team is his family, often he gives into their \"wild ideas\", but he manages to keep them focused, and cares about them; such as seen in season 7's \"Flesh and Blood\" where at the end, he and DiNozzo share a steak and drink a beer almost like a father & son to show that blood isn't the only thing that connects people as family. Our family are the people we allow into our world, to share our lives with.<br /><br />Moving on to Ziva David; she's an enigma of sorts. She was a trained assassin, but has come to be such an asset of the team and has provided an interesting glimpse into how our American culture is still mis-understood. She has good instincts, a good heart and I believe she cares about the team as her family, such as in the season 7, episode 1 \"Truth or Consequences\"; she was prepared to die, she didn't want McGee or DiNozzo to risk their lives for her; though down the road she apologized to DiNozzo and appreciates his efforts in trying to watch out for her, meaning she is learning to adapt, showing we can change what we have turned into.<br /><br />Timothy McGee has truly come a long way since being a \"probie\" in seasons 1-2; as far as partners go, I prefer the McGee/DiNozzo pairing. McGee has stepped out from the \"geeky\" kid he was and can hold his own, thanks to DiNozzo's tricks and taunts. He is still the brains, but he has developed a personality and has the heart of a lion. The little brother who can dish it out as well, if not sometimes, better than taking it.<br /><br />Abby is still Abby, lol. What can be said about her we don't know. Don't let her clothes fool you. She's excellent in her field. The \"little\" sister of the family, who displayed such emotion when Ziva was rescued, we thought this was a family. Abby is the perpetual ray of sunshine who, even though science might tell her one thing, is prepared to see the other side.<br /><br />Moving on to Dr. Donald \"Ducky\" Mallard. Where do I start with him? He's the kindly grandfather or uncle in the whole mix and shows us that he has the best/worst job of the team. He sees the worst in humanity with the bodies brought before him, but he always teaches us that the dead do talk to us, though not the way we're used to. He shows care and compassion when doing his job, and he is an essential part of the team. He is thorough in his job and even gives Jethro a few good zings to keep him in place. Ducky reminds us there is always something we don't know and if we're in doubt, keep looking. His stories keep us entertained, but provide some kind of lesson in there.<br /><br />Director Vance...while a good guy in this, I don't hold to having the \"boss\" in the mix. He's good, don't get me wrong. I wouldn't be him for the world. Sorry, no knock on the actor, but seriously, most of us don't like our bosses. So he is in the worst position possible, though he tries to make the best of it. And, amazingly he surprises us most of the time. But still, don't like too much of the bureaucrats' involvement.<br /><br />Let's not forget, one of the key members of this team, and next to Gibbs...last, but not least...<br /><br />NCIS Very Special (Senior) Agent Anthony DiNozzo. Yes, I know he's a goof-ball to some, but have you ever really observed him? He's the \"perfect\" guy (at least for this girl, lol)...he has a steady and not too shabby job, a sense of humor, an unparalleled dedication to his co-workers, good looks (very easy on the eyes), romantic, charming..and when he gets down to business, absolutely the best investigator on the team, again, next to Gibbs.<br /><br />DiNozzo is the eternal \"frat boy\", but at the same time, I don't think I would get on his bad side. While he might hide behind the face of a clown, DiNozzo has \"been there, done that\" and it's his sense of humor that holds the balance to sanity with the demands of his job. He's seen the worst of the worst, and the job is stressful, so his goofiness is key to \"keeping it together\". He can be a bit unconventional, but if he were like Gibbs, he'd be....well Gibbs. DiNozzo also has a soft and kind heart, though he wants to hide it; particularly in \"Flesh and Blood\" where he paid his father's bill & \"Obsession\" where his obsession to find the woman led him to call her, and the team was able to figure out what happened. DiNozzo stayed with her until she died, proving he is human after all.<br /><br />He too has grown up since the first season, but not at the rate he should have, lol. Then again, would we want him to change? I know I don't. And trust me, I was schooled in coming around to being a \"DiNozzo Girl\". He is who is his, he does his job and if that satisfies Gibbs, we don't question Gibbs.<br /><br />All in all, this isn't just another \"crime procedural/drama\". This show goes ABOVE that level. I still love CSI: NY and CSI: Miami, just not as much as NCIS. Gibbs, Ziva, McGee, Abby, Ducky and Tony DiNozzo have become part of our culture and part of our family.<br /><br />They're still going good at 7 seasons, and at this rate....here is to 7 more (and hopefully more).<br /><br />I'm glad I only have to wait two months to get it....otherwise we'd have a rule coming up on that one. I can hold off on CSI: NY and Miami (and in that order). But, mess with my NCIS...might have to invoke a GIBBS RULE.<br /><br />ADDED on 9/8/2010:<br /><br />As of note; the two-part \"starter\" episodes of JAG (Ice Queen & Meltdown are what I call a \"starter-pilot\") they are still \"Official\" \"JAG\" episodes as \"NCIS\" goes...Yankee White can be considered the Pilot as well. Some series do that. Yankee White is still considered as \"Episode 1\" :)...just as the NCIS: LA Pilot or \"starter\" episodes are still NCIS :)<br /><br />And, I have had no performance issues with the DVDs and I own all 7 seasons.\nNCIS, best show out there :) **MIGHT CONTAIN SPOILERS**",
  "profile": "**Updated User Profile Summary**\n\n- **Content Preference**: The user has a strong affinity for nostalgic TV series, especially those featuring adventure, romance, comedy, and espionage themes. They continue to explore character-driven crime dramas while expressing a fondness for shows from the late 1970s and 1980s, with a recent positive encounter in a long-running crime procedural series that reinforces their interest in character dynamics over plot mechanics.\n\n- **Nostalgia Factor**: Their ongoing emotional connection to nostalgic storytelling has been strengthened by recent viewing experiences, although they maintain reservations about changes made in classic content.\n\n- **Format Preference**: The user prefers physical media (DVDs), valuing comprehensive collections that present original series in their intended quality without alterations, ensuring an authentic viewing experience.\n\n- **Quality Expectations**: They appreciate the preservation of original storytelling elements, with a strong aversion to alterations that disrupt the integrity of character arcs or musical scores.\n\n- **Community Engagement**: Actively participating in discussions about classic shows, they enjoy sharing insights and recommendations, emphasizing deep character development and the importance of family dynamics within series narratives.\n\n- **Rating Behavior**: Generally, they provide high ratings for emotionally resonant content and have expressed strong appreciation for series that prioritize relatable characters, reflecting a commitment to authentic storytelling and the nostalgic experience.",
  "metrics": {
    "rouge1_f": 0.03468849729429721,
    "rouge2_f": 0.005274115197779319,
    "rougeL_f": 0.020535590398223946,
    "meteor": 0.00992843359763786,
    "bleu1": 3.8637288694457716e-16,
    "bleu2": 1.598615802613106e-16,
    "bleu3": 4.256622018316715e-17,
    "bleu4": 1.2363436261211302e-17,
    "bertscore_precision": 0.3481559455394745,
    "bertscore_recall": 0.5186681151390076,
    "bertscore_f1": 0.41664138436317444
  }
}