{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: CAISHA by PRETTYSHOP Hair Donut Up Do Hair Ring Hairstyler Bun Maker Bridal Hairpiece Hair Styling Tool Brown DK2\nReview Date: 2018/04/26\nStore: CAISHA\nProduct Description: ['Synthetic fiber hair styler. Diameter: 3,6\" (9cm); Weight: 0.1 lb (45g). . . .']\nAverage Rating: 3.5\nProduct Details: {'Color': 'brown #DK2', 'Material': 'Synthetic', 'Brand': 'CAISHA', 'Item Dimensions LxWxH': '9.45 x 7.09 x 1.97 inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.45 x 7.09 x 1.97 inches; 1.41 Ounces', 'Item model number': 'DKxx', 'UPC': '885860274224 716670803819', 'Manufacturer': 'Generic'}\nReview Text: More golden in color and it losses shape after a few wears\nReview Title: Its okay. More gold then photo\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Clip in Hair Extensions - Platinum Blonde - Straight - 18in / 46cm - Full Head - 8 Pcs 120g - Japanese Heat Resistant Synthetic Hairpiece - Looks and Feels like Real Hair\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '18 x 38.98 x 0.39 inches; 4.23 Ounces', 'Item model number': 'SCIHLST20920', 'UPC': '799632432838'}\nfantastic value for fake hair.  perfect color. True pale blonde platinum with white like highlights. Great if you bleach your hair!<br />Very soft. doesnt tangle. blends into your own hair very well. Easy to put on and off. Keep the bag and put them in it when not in use.<br />Make sure you straighten your own hair first before you put these in because these are SUPER straight!\nfantastic value for fake hair\nElegant Hair - 17\" PONYTAIL Clip in Hair Piece CURLY Platinum Blonde #16/60 REVERSIBLE Claw Clip 220g\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '17 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16.93 x 3.94 x 1.97 inches; 5.64 Ounces', 'UPC': '799632434306'}\nFantastic! I own the 22inch hair version as well. Both are great but the 22inch one  can weight heavy on the head after 6 to 8 hours (and i suffer from migraines so I have to be careful about that) . this 17inch one is lighter but still VERY full. can wear it all day at work with no issues.<br />Very curly! very beautiful! Looks real!\nThis is elegant HAIR!\nCAISHA by PRETTYSHOP Hair Donut Up Do Hair Ring Hairstyler Bun Maker Bridal Hairpiece Hair Styling Tool Brown DK2\nCAISHA\n['Synthetic fiber hair styler. Diameter: 3,6\" (9cm); Weight: 0.1 lb (45g). . . .']\n{'Color': 'brown #DK2', 'Material': 'Synthetic', 'Brand': 'CAISHA', 'Item Dimensions LxWxH': '9.45 x 7.09 x 1.97 inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.45 x 7.09 x 1.97 inches; 1.41 Ounces', 'Item model number': 'DKxx', 'UPC': '885860274224 716670803819', 'Manufacturer': 'Generic'}\nMore golden in color and it losses shape after a few wears\nIts okay. More gold then photo",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Preferences**: The user maintains a strong interest in hair extensions, particularly synthetic options that closely mimic real hair. They have shown a preference for both straight and curly styles, likely seeking versatility in their looks.\n\n- **Color and Aesthetic**: The user favors platinum blonde shades with highlights but has recently expanded their interest to include browns, especially golden tones. This indicates a growing exploration of color while still prioritizing aesthetic alignment with their overall style.\n\n- **Product Characteristics**: They prioritize high-quality, easy-to-apply extensions that blend seamlessly with natural hair. Recent purchases suggest an interest in lighter, comfortable options that maintain appearance and fullness over time.\n\n- **Value for Money**: The user appreciates products that offer excellent value. A recent experience with a less satisfactory purchase underscores their expectation for high-quality items at reasonable prices.\n\n- **Care Instructions**: The user remains focused on practical care guidelines, favoring instructions that promote the longevity and effective maintenance of their products.\n\nOverall, this user exhibits a consistent preference for functional, aesthetically pleasing hair extensions and styling tools that are comfortable to wear and easy to maintain. Their recent interest in different color shades reflects a willingness to explore new styles while adhering to their quality and realism standards. The mixed review of a recent product highlights their discerning taste and focus on value.",
  "metrics": {
    "rouge1_f": 0.2323232323232323,
    "rouge2_f": 0.030405405405405407,
    "rougeL_f": 0.10101010101010101,
    "meteor": 0.10670595993254496,
    "bleu1": 0.11318073005419159,
    "bleu2": 0.01292157112642391,
    "bleu3": 0.0029131106213061146,
    "bleu4": 0.0013844420530164047,
    "bertscore_precision": 0.3444788455963135,
    "bertscore_recall": 0.40578922629356384,
    "bertscore_f1": 0.37262895703315735
  }
}