{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: [DASHING DIVA–Nails with Big Stone]Premium Magic Press Super Slim Fit-Better Than Rose+Twinkle Corsage241/42GMC(2Different Designs 30strips+30strips in 12sizes)\nReview Date: 2021/02/08\nStore: Dashing Diva\nAverage Rating: 4.1\nProduct Details: {'Size': '33 Piece Set', 'Brand': 'Dashing Diva', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Item Form': 'Gel', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.43 x 3.35 x 1.85 inches; 2.65 Ounces', 'Item model number': '8809657105388'}\nReview Text: It's just a weak press on nail. Does not flex and form close to your own nail. Lifts very easily and will snag and pop off. Okay if you have maybe a photo shoot and your not a hand model. But don't expect to use your hand or nails without these popping off within mins of application.\nReview Title: Thought it was like flexible nail gel. No. It's a press on nail.\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Clip in Hair Extensions - Platinum Blonde - Straight - 18in / 46cm - Full Head - 8 Pcs 120g - Japanese Heat Resistant Synthetic Hairpiece - Looks and Feels like Real Hair\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '18 x 38.98 x 0.39 inches; 4.23 Ounces', 'Item model number': 'SCIHLST20920', 'UPC': '799632432838'}\nfantastic value for fake hair.  perfect color. True pale blonde platinum with white like highlights. Great if you bleach your hair!<br />Very soft. doesnt tangle. blends into your own hair very well. Easy to put on and off. Keep the bag and put them in it when not in use.<br />Make sure you straighten your own hair first before you put these in because these are SUPER straight!\nfantastic value for fake hair\nElegant Hair - 17\" PONYTAIL Clip in Hair Piece CURLY Platinum Blonde #16/60 REVERSIBLE Claw Clip 220g\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '17 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16.93 x 3.94 x 1.97 inches; 5.64 Ounces', 'UPC': '799632434306'}\nFantastic! I own the 22inch hair version as well. Both are great but the 22inch one  can weight heavy on the head after 6 to 8 hours (and i suffer from migraines so I have to be careful about that) . this 17inch one is lighter but still VERY full. can wear it all day at work with no issues.<br />Very curly! very beautiful! Looks real!\nThis is elegant HAIR!\nCAISHA by PRETTYSHOP Hair Donut Up Do Hair Ring Hairstyler Bun Maker Bridal Hairpiece Hair Styling Tool Brown DK2\nCAISHA\n['Synthetic fiber hair styler. Diameter: 3,6\" (9cm); Weight: 0.1 lb (45g). . . .']\n{'Color': 'brown #DK2', 'Material': 'Synthetic', 'Brand': 'CAISHA', 'Item Dimensions LxWxH': '9.45 x 7.09 x 1.97 inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.45 x 7.09 x 1.97 inches; 1.41 Ounces', 'Item model number': 'DKxx', 'UPC': '885860274224 716670803819', 'Manufacturer': 'Generic'}\nMore golden in color and it losses shape after a few wears\nIts okay. More gold then photo\nMagnetic Eyelashes False Lashes with Magnets Top and Bottom Magnetic Lashes Resuable Lashes 2 Pair / 8pcs Natural Style\nCuckoo\n{'Brand': 'Cuckoo', 'Material': 'synthetic fibers', 'Item Dimensions LxWxH': '5.12 x 4.3 x 0.9 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Product Dimensions': '5.12 x 4.3 x 0.9 inches; 2.4 Ounces'}\nThe magnet is strong. I bought the two paid sandwich style. I tried the videos, and the hacks that say cut them ...I tried applying with special lash tweezers... Nothing works to get them close to the lash lid. The magnetic is strong so I'm sure it won't fall off, but it's so strong that when you start to move the under lash toward your eye with the upper lash laying on top of your lashes, the magnetic pulls and moves is soil quickly that it always ends up locked half way through your natural lashes. And I'm a contact wearer...so it's not like I have  fear of putting stuff near my eyes. These probably will work well with lash liners. The lashes themselves look nicely constructed. It's just the application as intended is impossible.\nThe lashes look beautiful but you'll never get them on\nENTRANCED STYLES Straight Black Wig with Bangs for Women Fashion Long Straight Wig Heat Resistant Bangs Synthetic Wig 20 Inch Natural Looking Daily Party Cosplay Wig\nENTRANCED STYLES\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'ENTRANCED STYLES', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 6.1 x 2 inches; 3.99 Ounces', 'UPC': '778992677189'}\nThere are better options out there. This had a weird part. The flesh color looks like layers of beige mesh for the scalp and it kind of shimmers like pantyhose? Super straight part so to fix your need alot of plucking but with that trange scalp material, I don't think it's worth it for me.  The scalp pokes out at the edges because there is not enough hair on top. Wefts are shown. Bangs are thin and would need alot of styling to look good.\nNot that great. Underwhelmed.\nS-noilite Secret Wire in Human Hair Extensions 100% Real Remy Hair Extension Invisible String 16\" 90g One Piece Double Drawn Fish Line Extensions for Women Gifts #60 Platinum Blonde\nS-noilite\n{'Package Dimensions': '12.4 x 7.56 x 0.59 inches; 4.23 Ounces'}\nSo they came packed nicely but not in the s-noilite package. No logo. Just staples to a cardboard slip and wrapped in a pink bag. The hair feels nice. However, I bought the same one twice. First one was brassy in color. I was ordering the #60 in platinum. The thick version. Alot of hair. But totally brassy. So I saw the price drop so I was like okay I'll try again see if they get the color right. Nope. Still brassy and the second one was not the thick halo version. No more then 50grams. Both have double thick wires which don't hide well compared to other companies. The thin version they sent on the second ordee  had clips as well. Why doesn't the thick version have clips? It would help so the ends stay close to the head. The wire was also short. So not happy based on color, difference in style sent even though I ordered same style twiced, and not package from s-noilite. My seller was us fashion outlet. I'd be sceptical to purchase from them if they are the only seller.\nBought twice and neither was right color nor brand\n[DASHING DIVA–Nails with Big Stone]Premium Magic Press Super Slim Fit-Better Than Rose+Twinkle Corsage241/42GMC(2Different Designs 30strips+30strips in 12sizes)\nDashing Diva\n{'Size': '33 Piece Set', 'Brand': 'Dashing Diva', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Item Form': 'Gel', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.43 x 3.35 x 1.85 inches; 2.65 Ounces', 'Item model number': '8809657105388'}\nIt's just a weak press on nail. Does not flex and form close to your own nail. Lifts very easily and will snag and pop off. Okay if you have maybe a photo shoot and your not a hand model. But don't expect to use your hand or nails without these popping off within mins of application.\nThought it was like flexible nail gel. No. It's a press on nail.",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Preferences**: The user has a strong interest in high-quality hair extensions, specifically synthetic and real hair options, with a focus on quality, appearance, and fit after previous disappointments.\n\n- **Color and Aesthetic**: They favor platinum blonde shades and have begun exploring golden brown tones, indicating an evolving aesthetic while facing challenges with color accuracy in recent purchases.\n\n- **Product Characteristics**: The user places significant emphasis on the reliability and compatibility of hair extensions with their natural hair. Experiences with color discrepancies and inconsistent quality have heightened their scrutiny of product options.\n\n- **Value for Money**: The user values quality and consistency and has expressed dissatisfaction with products that do not meet expected features, influencing their purchasing decisions.\n\n- **Care Instructions**: They seek effective care tips to enhance the longevity and maintenance of their hair products, aligning with their commitment to quality.\n\n- **Makeup Preferences**: The user is interested in makeup but tends to prioritize user-friendly options, especially regarding application techniques like false eyelashes.\n\n- **Nail Product Experiences**: Their recent experience with press-on nails revealed frustration with product performance, highlighting a desire for products that are flexible and durable. This reflects a broader preference for user-friendly, high-quality cosmetic solutions that offer reliability and good value.\n\nOverall, the user continues to favor functional, high-quality products in hair, makeup, and nails that are easy to use and dependable while remaining open to new styles and colors.",
  "metrics": {
    "rouge1_f": 0.17185185185185184,
    "rouge2_f": 0.019287833827893175,
    "rougeL_f": 0.08148148148148149,
    "meteor": 0.06285185470810518,
    "bleu1": 0.011096449478523375,
    "bleu2": 0.0027896046015327964,
    "bleu3": 0.0004090509639704096,
    "bleu4": 0.00015676709734838997,
    "bertscore_precision": 0.355160117149353,
    "bertscore_recall": 0.45061948895454407,
    "bertscore_f1": 0.39723536372184753
  }
}