{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: ENTRANCED STYLES Straight Black Wig with Bangs for Women Fashion Long Straight Wig Heat Resistant Bangs Synthetic Wig 20 Inch Natural Looking Daily Party Cosplay Wig\nReview Date: 2020/10/29\nStore: ENTRANCED STYLES\nAverage Rating: 4.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'ENTRANCED STYLES', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 6.1 x 2 inches; 3.99 Ounces', 'UPC': '778992677189'}\nReview Text: There are better options out there. This had a weird part. The flesh color looks like layers of beige mesh for the scalp and it kind of shimmers like pantyhose? Super straight part so to fix your need alot of plucking but with that trange scalp material, I don't think it's worth it for me.  The scalp pokes out at the edges because there is not enough hair on top. Wefts are shown. Bangs are thin and would need alot of styling to look good.\nReview Title: Not that great. Underwhelmed.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Clip in Hair Extensions - Platinum Blonde - Straight - 18in / 46cm - Full Head - 8 Pcs 120g - Japanese Heat Resistant Synthetic Hairpiece - Looks and Feels like Real Hair\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '18 x 38.98 x 0.39 inches; 4.23 Ounces', 'Item model number': 'SCIHLST20920', 'UPC': '799632432838'}\nfantastic value for fake hair.  perfect color. True pale blonde platinum with white like highlights. Great if you bleach your hair!<br />Very soft. doesnt tangle. blends into your own hair very well. Easy to put on and off. Keep the bag and put them in it when not in use.<br />Make sure you straighten your own hair first before you put these in because these are SUPER straight!\nfantastic value for fake hair\nElegant Hair - 17\" PONYTAIL Clip in Hair Piece CURLY Platinum Blonde #16/60 REVERSIBLE Claw Clip 220g\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '17 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16.93 x 3.94 x 1.97 inches; 5.64 Ounces', 'UPC': '799632434306'}\nFantastic! I own the 22inch hair version as well. Both are great but the 22inch one  can weight heavy on the head after 6 to 8 hours (and i suffer from migraines so I have to be careful about that) . this 17inch one is lighter but still VERY full. can wear it all day at work with no issues.<br />Very curly! very beautiful! Looks real!\nThis is elegant HAIR!\nCAISHA by PRETTYSHOP Hair Donut Up Do Hair Ring Hairstyler Bun Maker Bridal Hairpiece Hair Styling Tool Brown DK2\nCAISHA\n['Synthetic fiber hair styler. Diameter: 3,6\" (9cm); Weight: 0.1 lb (45g). . . .']\n{'Color': 'brown #DK2', 'Material': 'Synthetic', 'Brand': 'CAISHA', 'Item Dimensions LxWxH': '9.45 x 7.09 x 1.97 inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.45 x 7.09 x 1.97 inches; 1.41 Ounces', 'Item model number': 'DKxx', 'UPC': '885860274224 716670803819', 'Manufacturer': 'Generic'}\nMore golden in color and it losses shape after a few wears\nIts okay. More gold then photo\nMagnetic Eyelashes False Lashes with Magnets Top and Bottom Magnetic Lashes Resuable Lashes 2 Pair / 8pcs Natural Style\nCuckoo\n{'Brand': 'Cuckoo', 'Material': 'synthetic fibers', 'Item Dimensions LxWxH': '5.12 x 4.3 x 0.9 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Product Dimensions': '5.12 x 4.3 x 0.9 inches; 2.4 Ounces'}\nThe magnet is strong. I bought the two paid sandwich style. I tried the videos, and the hacks that say cut them ...I tried applying with special lash tweezers... Nothing works to get them close to the lash lid. The magnetic is strong so I'm sure it won't fall off, but it's so strong that when you start to move the under lash toward your eye with the upper lash laying on top of your lashes, the magnetic pulls and moves is soil quickly that it always ends up locked half way through your natural lashes. And I'm a contact wearer...so it's not like I have  fear of putting stuff near my eyes. These probably will work well with lash liners. The lashes themselves look nicely constructed. It's just the application as intended is impossible.\nThe lashes look beautiful but you'll never get them on\nENTRANCED STYLES Straight Black Wig with Bangs for Women Fashion Long Straight Wig Heat Resistant Bangs Synthetic Wig 20 Inch Natural Looking Daily Party Cosplay Wig\nENTRANCED STYLES\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'ENTRANCED STYLES', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 6.1 x 2 inches; 3.99 Ounces', 'UPC': '778992677189'}\nThere are better options out there. This had a weird part. The flesh color looks like layers of beige mesh for the scalp and it kind of shimmers like pantyhose? Super straight part so to fix your need alot of plucking but with that trange scalp material, I don't think it's worth it for me.  The scalp pokes out at the edges because there is not enough hair on top. Wefts are shown. Bangs are thin and would need alot of styling to look good.\nNot that great. Underwhelmed.",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Preferences**: The user retains a strong interest in hair extensions, particularly synthetic options that mimic real hair, though their experience with a recent wig indicates a more discerning approach to quality and appearance. They continue to prefer both straight and curly styles.\n\n- **Color and Aesthetic**: The user is exploring color diversity, favoring platinum blonde shades with highlights while beginning to incorporate golden brown tones. Their willingness to experiment reflects a desire for cohesion in evolving aesthetics.\n\n- **Product Characteristics**: They prioritize high-quality, easy-to-apply products that blend well with natural hair. Recent interactions reveal frustration with certain synthetic wigs, particularly regarding their appearance and need for alterations, highlighting a preference for comfortable, natural-looking extensions.\n\n- **Value for Money**: The user values great quality and effective design, as evidenced by their latest experience with a wig that did not meet expectations in terms of appearance and ease of use, reinforcing their discerning taste.\n\n- **Care Instructions**: The user continues to seek practical care guidelines that promote longevity and ease of maintenance for their products.\n\n- **Makeup Preferences**: While they display a general interest in makeup, recent challenges with application techniques for false eyelashes underscore the need for user-friendly options that complement their look.\n\nOverall, the user prefers functional, aesthetically pleasing hair and makeup products that are high-quality, easy to use, and offer good value. They are open to exploring new styles and colors but maintain high standards for their selections.",
  "metrics": {
    "rouge1_f": 0.22839506172839505,
    "rouge2_f": 0.020618556701030927,
    "rougeL_f": 0.09259259259259259,
    "meteor": 0.08909177619483741,
    "bleu1": 0.046332455106599967,
    "bleu2": 0.008508492534615084,
    "bleu3": 0.001415675816174547,
    "bleu4": 0.0005779325395411008,
    "bertscore_precision": 0.36477217078208923,
    "bertscore_recall": 0.44768208265304565,
    "bertscore_f1": 0.4019967019557953
  }
}