{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mulberry: The Complete Series (DVD)\nReview Date: 2015/01/23\nStore: Geraldine McEwan  (Actor),     Karl Howman  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', 'Mulberry: The Complete Series (DVD)', 'Wanted: young person to render general domestic assistance. According to Bert and Alice, the two surly servants who work for the formidable Miss Farnaby (Geraldine McEwan), the notice should read: \"Wanted: masochist to be at the beck and call of cantankerous old trout.\" Fortunately, Mulberry has never met Bert or Alice. In fact, no one knows where he comes from. Out of the blue, he just turns up one day at the family mansion, without a single qualification to his name, and sweet-talks his way into the job. Suddenly, the dull old house is not dull anymore and Miss Farnaby\\'s life will never be the same again. But who is the mysterious man in black, and what does he want with Mulberry?', ']]>', 'Amazon.com', 'Both morbid and joyful, British sitcom', 'Mulberry', 'begins when a quirky young man with a penchant for floral waistcoats named Mulberry (Karl Howman,', 'Brush Strokes', ') shows up on the doorstep of a sullen, surly old woman named Mrs. Farnaby (Geraldine McEwan,', 'The Magdalene Sisters', ',', 'Mapp & Lucia', \"). The irrepressible Mulberry proceeds to unsettle the servants--Bert (Tony Selby) and Alice (Lill Roughley in the first season, Mary Healey in the second)--as he puckishly lures Mrs. Farnaby into a fuller, happier life. But unbeknownst to Mrs. Farnaby, Mulberry harbors a secret: He's the son of Death and Springtime (talk about mixed marriages) and he's been sent by his father (John Bennet) to carry the old woman over the threshold--not a typical premise for a comedy. This DVD set has both seasons; season 1 is occupied with the unveiling of Mulberry's secret and the drawing-out of Farnaby, while the second finds a surprising richness of material in the set-up, ranging from Mulberry having a near-death experience of his own to Alice considering running away with another man. Despite the recurring presence of Death, the show is really about taking pleasure in life and making your own choices. Howman's zaniness could have grown tiresome were it not countered by McEwan's deliciously dour presence (though a TV interview with the pair, included as an extra, reveals her to be a sweetheart in person). As Farnaby softens, Mulberry calms down, maintaining a careful balance. An odd but likable show, cut off by the BBC just as it found itself in full bloom. Co-created by Bob Larbey, creator of\", 'As Time Goes By', '.', '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Geraldine McEwan, Karl Howman', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1), English (Dolby Digital 1.0)', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.4 x 5.3 x 0.6 inches; 3 Ounces', 'Item model number': '2262229', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '6 hours and 17 minutes', 'Release date': 'June 13, 2006', 'Actors': 'Geraldine McEwan, Karl Howman', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nReview Text: One of my favorite English comedy/series\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Dawn of the Planet of the Apes\nAndy Serkis  (Actor),     Jason Clarke  (Actor),     Matt Reeves  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Gary Oldman, Andy Serkis, Jason Clarke and Keri Russell star in this thrilling next chapter of the Planet of the Apes. It is 2026, and humanity has been pushed to near extinction by a deadly virus. When a group of survivors desperate to find a new source of power travel into the woods near San Francisco, they discover a highly evolved community of intelligent apes led by Caesar (Andy Serkis). The two species form a fragile peace but dissention grows and the groups find themselves hurtling toward all-out war.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '2288819', 'Director': 'Matt Reeves', 'Media Format': 'Color, Subtitled, Widescreen, DTS Surround Sound, NTSC, Dubbed, Multiple Formats, Dolby', 'Run time': '2 hours and 10 minutes', 'Release date': 'December 2, 2014', 'Actors': 'Andy Serkis, Jason Clarke, Gary Oldman, Keri Russell, Toby Kebbell', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Mark Bomback, Rick Jaffa, Amanda Silver', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFair\nTwo Stars\nDead Like Me: The Complete Series (Ellen Muth, Mandy Patinkin, Laura Harris, Callum Blue)\nEllen Muth  (Actor),     Mandy Patinkin  (Actor),     n/a  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Eighteen-year-old Georgia Lass, a college drop-out working at a temp agency, gets a wake-up call when she suddenly dies in a freak accident. After discovering life after death, George returns to Earth and joins a team of grim reapers under the guidance of head reaper Rube. They look just like everyone else but as grim reapers they appear physically different to the living than they did when they were alive. Through death, George finds a new perspective on life and the after-life.', \"SPECIAL FEATURES: Deleted Scenes and Featurette's\", 'INCLUDES BONUS \"Life After Death\" movie', 'SEASON 1: DISC 1: Pilot Dead Girl Walking Curious George', 'DISC 2: Reapercussions Reaping Havoc My Room Reaper Madness', 'DISC 3: A Cook Sunday Mornings Business Unfinished The Bicycle Thief DISC 4: Nighthawks Vacation Rest in Peace Deleted Scenes, The Music of Dead Like Me, Featurette', 'SEASON 2: DISC 1: Send in the Clown The Ledger Ghost Story The Shallow End', 'DISC 2: Hurry In Escrow Rites of Passage The Escape Artist', 'DISC 3: Be Still My Heart Death Defying Ashes to Ashes Forget Me Not', \"DISC 4: Last Call Always Haunted Featurette's and Deleted Scenes\", 'DISC 5: DEAD LIKE ME MOVIE: Life After Death']\n{'Genre': 'Music Videos & Concerts', 'Format': 'Multiple Formats, NTSC, Box set, Full Screen', 'Contributor': 'N/a, Ellen Muth, Laura Harris, Jasmine Guy, Mandy Patinkin, Callum Blue', 'Number Of Discs': '9', 'Runtime': '24 hours and 39 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.9 x 5.5 x 2.6 inches; 1.2 Pounds', 'Media Format': 'Multiple Formats, NTSC, Box set, Full Screen', 'Run time': '24 hours and 39 minutes', 'Release date': 'August 16, 2016', 'Actors': 'Ellen Muth, Mandy Patinkin, Laura Harris, Callum Blue, Jasmine Guy', 'Studio': 'Tgg Direct', 'Number of discs': '9'}\nBest price on this series.\nFive Stars\nVillage of the Damned/Children of the Damned (DVD) (Multi-Title)\nWolf Rilla  (Director, Writer),     Anton M. Leader  (Director),     Stirling Silliphant  (Actor),     George Sanders  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Product Description', 'Village of the Damned/Children of the Damned (DVD) (Multi-Title)', 'We have met the enemies, and they are our children. Well, perhaps not our children, and that’s the problem: They are the offspring of aliens who secretly impregnated human women! That’s the riveting premise of Village of the Damned, a science-fiction classic rife with paranoia and set in England’s tiny Midwich. There, the glowing-eyed humanoids develop at an alarming rate and use astonishing powers of mind to assert their supremacy. Woe to parents or anyone who defies them. Yet one intrepid soul (George Sanders) does. It’s “yesterday Midwich, tomorrow the world” in the sequel, Children of the Damned. Unusually gifted youngsters who may be a leap forward in human evolution are brought from around the globe to England for scientific study – and then the terror hits with full force. Children, behave!', ']]>', 'Amazon.com', \"What's scarier than scary kids?\", 'Village of the Damned', \"is the definitive scary-kid classic, a truly unsettling film drawn from John Wyndham's novel\", 'The Midwich Cuckoos', '. The brilliant opening sequence depicts the sudden and temporary paralysis of a small English hamlet, which is followed by the town\\'s women becoming mysteriously pregnant. The spawn of this occurrence are a dozen eerie, blond-headed children, who are either gifted, evil, or \"the world\\'s new people.\" A splendid outing, not least in the way it catches parental anxiety about this small new stranger in one\\'s home. (It was remade by John Carpenter in 1995.)', 'Children of the Damned', \"follows up with a story about six more creepy kids, brought from all over the globe to huddle in a old church in London. An excellent opening half-hour gets bogged down in the movie's global-political ambitions (it's very much a cold war offering), but it has its share of shivery moments--the sight of the six youngsters striding down a London street as though they controlled the world is a chiller. But where's the blond hair? The two films are different in tone;\", 'Village', 'feels like a fifties sci-fi offering, with an old-school star (George Sanders) and classical style;', 'Children', 'is a film of the sixties, with hipper techniques, urban setting, and young actors Ian Hendry and Alan Badel. But both have those damned kids.', '--Robert Horton']\n{'Genre': 'Horror', 'Format': 'Closed-captioned, Dubbed, NTSC, Black & White, Subtitled, Widescreen, Dolby', 'Contributor': 'Michael Gwynne, Ian Hendry, Alfred Burke, Barbara Shelley, Alan Badel, Ronald Kinnoch, George Sanders, Wolf Rilla, Barbara Ferris, Ben Arbeid, Anton M. Leader, Stirling Silliphant, John Wyndham, John BrileyMichael Gwynne, Ian Hendry, Alfred Burke, Barbara Shelley, Alan Badel, Ronald Kinnoch, George Sanders, Wolf Rilla, Barbara Ferris, Ben Arbeid, Anton M. Leader, Stirling Silliphant, John Wyndham, John Briley   See more', 'Language': 'Unqualified, French (Dolby Digital 1.0), English (Mono)', 'Runtime': '2 hours and 47 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '12569691827', 'Director': 'Wolf Rilla, Anton M. Leader', 'Media Format': 'Closed-captioned, Dubbed, NTSC, Black & White, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 47 minutes', 'Release date': 'September 13, 2005', 'Actors': 'Stirling Silliphant, George Sanders, Barbara Shelley, Michael Gwynne, Ian Hendry', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Producers': 'Ronald Kinnoch, Ben Arbeid', 'Studio': 'WarnerBrothers', 'Writers': 'Wolf Rilla, Ronald Kinnoch, John Wyndham, John Briley', 'Number of discs': '1'}\nGood Halloween movies\nFour Stars\nAddams Family/Addams Family Values Double Feature (DVD)\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Addams Family/Addams Family Values Double Feature (DVD)', ']]>']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '3 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '382544', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '3 hours and 13 minutes', 'Release date': 'January 1, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nGood\nFour Stars\nDisney's The Kid\nBruce Willis  (Actor),     Spencer Breslin  (Actor),     Jon Turteltaub  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'International superstar Bruce Willis (UNBREAKABLE, THE SIXTH SENSE), along with Lily Tomlin (9 TO 5, TEA WITH MUSSOLINI), Emily Mortimer (SCREAM 3, NOTTING HILL), and newcomer Spencer Breslin star in the hilarious and heartwarming comedy DISNEY\\'S THE KID. Successful, high-powered Russ Duritz (Willis) has spent all of his incredibly empty life forgetting the child he used to be -- until one day, he meets him face-to-face! Thinking this kid is a hallucination, Russ does everything he can to make him go away. But 8-year-old Rusty (Breslin), who\\'s anything but happy that he grows up to be a loser without real meaning in his life, can\\'t leave -- at least not yet. At once funny and charming, DISNEY\\'S THE KID is a magical comedy that\\'s filled with adult-sized laughs.|Screenwriter Audrey Wells says she knew immediately when she saw Spencer Breslin that he was the perfect kid. \"The kid spoke five words, and they weren\\'t even words in the script, he just walked on stage and said \\'hello\\' and I knew he was the one,\" says Wells.|\"I was in the frozen food section of a supermarket when my mom told me I got the part,\" says the movie\\'s young star, Spencer Breslin. \"I couldn\\'t believe it! I just started screaming, \\'I\\'m going to be in a Bruce Willis movie!\\' People must have thought I was crazy, but I didn\\'t care!\"', 'Amazon.com', \"Russ Duritz (Bruce Willis) is an ultracynical, 40-year-old L.A. image consultant who fashions bogus façades for scumbag clients. Oblivious to his own need for a makeover, he's a tyrant in the office (to the chagrin of his sarcastic assistant, played to perfection by Lily Tomlin), and he's emotionally unavailable to the morally centered woman (Emily Mortimer) who senses goodness beneath Russ's hardened veneer. Not a moment too soon, a pudgy kid (Spencer Breslin) mysteriously appears in Russ's life, revealing himself to be Rusty Duritz--that is, Russ's 8-year-old self, arriving by some magic to put the adult Russ's life into beneficial perspective. This variation on\", 'A Christmas Carol', 'has Rusty guiding Russ on a tour of his past to reveal how he became a loveless, hard-shelled loser. It takes a bit of smarmy chicken-soup psychology to explain it all, but', 'The Kid', \"is an otherwise charming and involving fantasy, suggesting that perhaps we'd all benefit from a bit of counseling by our younger selves. Written with admirable restraint by Audrey Wells (who brought a similar appeal to\", 'The Truth About Cats and Dogs', ') and directed by Jon Turteltaub (', 'Cool Runnings', \"), the movie doesn't force its supernatural elements or attempt to explain Rusty's existence. It's just a fable for our modern age and a reminder to embrace the better angels of our nature. Delivered with an easy blend of humor and sentiment, that message makes\", 'The Kid', \"an unexpected pleasure. (Look closely for Matthew Perry as Willis's shaggy-haired client.)\", '--Jeff Shannon', 'Additional Features', \"Spencer Breslin may not steal every scene he's in as the title role of\", 'The Kid', ', but he does steal every bit of the hilarious commentary on the DVD. The extras focus on young Breslin, first with a 20-minute featurette with behind-the scenes footage of Spencer from his casting to the film\\'s wrap. The witty and playful director Jon Turteltaub reverses an old axiom stating he loves working with kids, especially Spencer. He illustrates this--and Spencer\\'s unabashed enthusiasm--by sharing the commentary duties with him, and the result is a 108-minute record that\\'s funnier than the film. Spencer asks questions out of the blue (\"Jon, does my DVD player come with a remote?\"), repeats Turteltaub\\'s technical information with perfect irony, embarrasses the director on continuity errors, and munches on an occasional pickle. For anyone who falls for Spencer\\'s charms in the film (it\\'s hard not to), the DVD commentary is a must, and a new standard in laughs per commentary.', '--Doug Thomas', 'See more']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 104 min', 'Director': 'Jon Turteltaub', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Bruce Willis, Spencer Breslin, Emily Mortimer, Lily Tomlin, Chi McBride', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Audrey Wells', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGood\nFive Stars\nThe Haunted Mansion (Full Screen Edition)\nEddie Murphy  (Actor),     Terence Stamp  (Actor),     Rob Minkoff  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"From the studio that brought you PIRATES OF THE CARIBBEAN ... here's the fright-filled comedy adventure loaded with hair-raising laughs and eye-popping special effects! Eddie Murphy (DADDY DAY CARE) stars as a real estate agent whose family comes face-to-face with 999 grim, grinning ghosts in the creepy old Gracey Manor! Now with the help of supernatural psychic Madame Leota (Jennifer Tilly, LIAR, LIAR) they must hilariously battle to break the mansion of its age-old curse ... and do it before the clock strikes 13!\"]\n{'Genre': 'Comedy', 'Format': 'Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Heather Juergensen, Nathaniel Parker, Rob Minkoff, Dina Waters, Aree Davis, Marc John Jefferies, David Berenbaum, Jim Doughan, Eddie Murphy, Terence Stamp, Rachel Harris, Jennifer Tilly, Steve Hytner, Wallace ShawnHeather Juergensen, Nathaniel Parker, Rob Minkoff, Dina Waters, Aree Davis, Marc John Jefferies, David Berenbaum, Jim Doughan, Eddie Murphy, Terence Stamp, Rachel Harris, Jennifer Tilly, Steve Hytner, Wallace Shawn  See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WD03209200DVD', 'Director': 'Rob Minkoff', 'Media Format': 'Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 28 minutes', 'Release date': 'April 20, 2004', 'Actors': 'Eddie Murphy, Terence Stamp, Nathaniel Parker, Jennifer Tilly, Wallace Shawn', 'Subtitles': 'Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'David Berenbaum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGood\nFour Stars\nCasper\nChauncey Leopardi  (Actor),     Spencer Vrooman  (Actor),     Brad Silberling  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['From director Brad Silberling and Steven Spielberg\\'s Amblin Entertainment comes a live-action fun house ride filled with laughter, excitement and ghostly surprises. \"Ghost therapist\" Dr. James Harvey (Bill Pullman) and his daughter Kat (Christina Ricci) arrive at drafty, old Whipstaff Manor. Its greedy owner, Carrigan Crittendon (Cathy Moriarty), has hired Dr. Harvey to exorcise the house\\'s apparitions: a friendly but lonely young ghost named Casper, who\\'s just looking for a friend, and his outrageous uncles Stretch, Stinkie and Fatso (The Ghostly Trio). If the plan works, she and Dibs (Eric Idle), her partner-in-slime, can get their hands on the manor\\'s fabled treasure. Meanwhile, Casper has found a kindred spirit in Kat, but The Ghostly Trio will not tolerate \"fleshies\" in their house. With hilarious antics and dazzling special effects from many of the creators of Who Framed Roger Rabbit and Jurassic Park, Casper is a mile-a-minute adventure comedy for the whole family.Bonus Content:', \"Casper's Treasures Game\", \"Casper's Treasures Game\", 'Spelling Lab Game', 'Spelling Lab Game', \"Casper's Cartoon Classic: Penguin For Your Thoughts\", \"Casper's Cartoon Classic: Penguin For Your Thoughts\", \"Casper's Spooky Safety Tips\", \"Casper's Spooky Safety Tips\", \"Casper's Scary Kitchen\", \"Casper's Scary Kitchen\", 'Feature Commentary with Director Brad Silberling', 'Feature Commentary with Director Brad Silberling', 'Revealing Casper', 'Revealing Casper', 'Deleted Scene #91: Lucky Enough to be a Ghost', 'Deleted Scene #91: Lucky Enough to be a Ghost', 'Photo & Poster Gallery', 'Photo & Poster Gallery']\n{'Genre': 'Casper (1995), Science Fiction & Fantasy, Kids & Family/7-9 Years, Kids & Family, Casper the friendly ghost, DVD Movie, Steven Spielberg, Blu-ray Movie, Comedy, Action & Adventure, Kids & Family/10-12 YearsCasper (1995), Science Fiction & Fantasy, Kids & Family/7-9 Years, Kids & Family, Casper the friendly ghost, DVD Movie, Steven Spielberg, Blu-ray Movie, Comedy, Action & Adventure, Kids & Family/10-12 Years   See more', 'Format': 'Multiple Formats, Anamorphic, Animated, Closed-captioned, Color, Dolby, Dubbed, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, Anamorphic, Animated, Closed-captioned, Color, Dolby, Dubbed, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen   See more', 'Contributor': 'Cathy Moriarty, Don Novello, Fred Rogers, Spencer Vrooman, Bill Pullman, Joe Alaskey, Doug Bruckner, Chauncey Leopardi, Brad Garrett, Christina Ricci, Joe Nipote, Malachi Pearson, Rodney Dangerfield, Eric Idle, Brad Silberling, Ernestine Mercer, Terry Murphy, Ben SteinCathy Moriarty, Don Novello, Fred Rogers, Spencer Vrooman, Bill Pullman, Joe Alaskey, Doug Bruckner, Chauncey Leopardi, Brad Garrett, Christina Ricci, Joe Nipote, Malachi Pearson, Rodney Dangerfield, Eric Idle, Brad Silberling, Ernestine Mercer, Terry Murphy, Ben Stein   See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified, English (DTS ES)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': 'MHV61023794DVD', 'Director': 'Brad Silberling', 'Media Format': 'Multiple Formats, Anamorphic, Animated, Closed-captioned, Color, Dolby, Dubbed, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Chauncey Leopardi, Spencer Vrooman, Malachi Pearson, Cathy Moriarty, Eric Idle', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nGood\nFour Stars\nThe Adventures of Ichabod and Mr. Toad\nBing Crosby  (Actor),     Basil Rathbone  (Actor),     Jack Kinney  (Director),     Claude Geronimi  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"In the tradition of grand animated classics, Disney's 11th animated masterpiece, THE ADVENTURES OF ICHABOD AND MR. TOAD, presents two unforgettable children's classics. Through award-winning (Golden Globe, Best Cinematography, 1950) Disney animation wizardry, THE WIND IN THE WILLOWS and THE LEGEND OF SLEEPY HOLLOW come together in one fabulous adventure -- in its original theatrical format. Hang on for a wild motorcar ride with J. Thaddeus Toad as he drives his friends Mole, Rat and Angus MacBadger into a worried frenzy! Then meet the spindly Ichabod Crane, who dreams of sweeping beautiful Katrina Van Tassel off her feet, despite opposition from town bully Brom Bones, who also has his eye on Katrina. The comic rivalry introduces Ichabod to the legend of the Headless Horseman, resulting in a heart-thumping climax! Wonderfully narrated by Basil Rathbone and Bing Crosby, THE ADVENTURES OF ICHABOD AND MR. TOAD brims with high-spirited adventure, brilliant animation and captivating music you'll want to share with your family again and again.\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 4 Ounces', 'Director': 'Jack Kinney, Claude Geronimi, James Algar', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 8 minutes', 'Release date': 'October 3, 2000', 'Actors': \"Bing Crosby, Basil Rathbone, Eric Blore, J. Pat O'Malley, John McLeish\", 'Language': 'English (Dolby Digital 2.0 Mono), French, Unqualified, Spanish', 'Studio': 'Walt Disney Video', 'Writers': 'Erdman Penner, Harry Reeves, Homer Brightman, Joe Rinaldi, Ted Sears', 'Number of discs': '1'}\nGood\nFive Stars\nHoles (Full Screen Edition)\nSigourney Weaver  (Actor),     Jon Voight  (Actor),     Andrew Davis  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"The award-winning bestseller comes to life in this phenomenally fun, adventure-filled movie starring Emmy Award-winner Shia LaBeouf (Outstanding Performer In A Children's Series, Disney Channel's EVEN STEVENS, 2000). Dogged by bad luck stemming from an ancient family curse, young Stanley Yelnats (LaBeouf) is sent to Camp Green Lake, a very weird place that's not green and doesn't have a lake. Once there, he's thrown headlong into the adventure of his life when he and his colorful campmates -- Squid, Armpit, Zigzag, Magnet, X-Ray, and Zero -- must dig a hole a day to keep the warden at bay. But why? Through it all, Stanley and company must forge fast friendships as they try to unearth the mystery of what's really going on in the middle of nowhere. Filled with humor and heartwarming messages of friendship and teamwork, HOLES is a treasure everyone will dig.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen', 'Contributor': 'Dule Hill, Byron Cotton, Patricia Arquette, Jon Voight, Scott Plank, Miguel Castro, Eartha Kitt, Tim Blake Nelson, Shia LaBeouf, Henry Winkler, Nathan Davis, Khleo Thomas, Jake M. Smith, Zane Holtz, Louis Sachar, Max Kasch, Siobhan Fallon Hogan, Brenden Jefferson, Andrew Davis, Sigourney WeaverDule Hill, Byron Cotton, Patricia Arquette, Jon Voight, Scott Plank, Miguel Castro, Eartha Kitt, Tim Blake Nelson, Shia LaBeouf, Henry Winkler, Nathan Davis, Khleo Thomas, Jake M. Smith, Zane Holtz, Louis Sachar, Max Kasch, Siobhan Fallon Hogan, Brenden Jefferson, Andrew Da…  See more', 'Language': 'French (Dolby Digital 2.0), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MFR786936225495#VG', 'Director': 'Andrew Davis', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 57 minutes', 'Release date': 'September 23, 2003', 'Actors': 'Sigourney Weaver, Jon Voight, Tim Blake Nelson, Shia LaBeouf, Khleo Thomas', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish', 'Studio': 'Walt Disney Home Entertainment', 'Writers': 'Louis Sachar', 'Number of discs': '1'}\nGood\nFive Stars\nJurassic Park Ultimate Trilogy\nSam Neill  (Actor),     Jeff Goldblum  (Actor),     Joe Johnston  (Director),     Steven Spielberg  (Director, Producer)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Experience one of the biggest movie trilogies of all time like never before with the', 'Jurassic Park', 'Ultimate Trilogy', '! “You won’t believe your eyes” (Rolling Stone) when dinosaurs once again roam the Earth in an amazing theme park on a remote island. From Academy Award®-winning directors Steven Spielberg (', 'Jurassic Park', ',', 'The Lost World: Jurassic Park', ') and Joe Johnston (', 'Jurassic Park III', '), the action-packed adventures find man up against prehistoric predators in the ultimate battle for survival. Featuring visually stunning imagery and groundbreaking filmmaking that has been hailed as “a triumph of special effects artistry” (Roger Ebert, Chicago Sun-Times), this epic trilogy is sheer movie-making magic that was 65 million years in the making. “Welcome to Jurassic Park.”']\n{'Genre': 'Science Fiction & Fantasy, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & AdventureScience Fiction & Fantasy, DVD Movie, Mystery & Suspense/Thrillers, Blu-ray Movie, Mystery & Suspense, Action & Adventure  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Gerald R. Molen, Richard Attenborough, Vanessa Lee Chester, Peter Buchman, Joseph Mazzello, Steven Spielberg, Vince Vaughn, Samuel L. Jackson, Peter Stormare, Thomas F. Duffy, Bob Peck, Harvey Jason, Richard Schiff, Miguel Sandoval, Jeff Goldblum, Jim Taylor, William H. Macy, Gary Rydstrom, John Diehl, Kathleen Kennedy, Wayne Knight, Michael Crichton, Laura Dern, Gary Summers, Colin Wilson, Tea Leoni, Ron Judkins, Trevor Morgan, David Koepp, Shawn Murphy, Arliss Howard, Bruce A. Young, Larry Franco, Sam Neill, Richard Hymns, Martin Ferrero, Ariana Richards, Alessandro Nivola, Julianne Moore, Alexander Payne, Joe Johnston, Pete Postlethwaite, Michael Jeter, BD WongGerald R. Molen, Richard Attenborough, Vanessa Lee Chester, Peter Buchman, Joseph Mazzello, Steven Spielberg, Vince Vaughn, Samuel L. Jackson, Peter Stormare, Thomas F. Duffy, Bob Peck, Harvey Jason, Richard Schiff, Miguel Sandoval, Jeff Goldblum, Jim Taylor,…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '5 hours and 49 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 11.2 Ounces', 'Item model number': '17355734', 'Director': 'Joe Johnston, Steven Spielberg', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 49 minutes', 'Release date': 'October 25, 2011', 'Actors': 'Sam Neill, Jeff Goldblum, Laura Dern, Julianne Moore, William H. Macy', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Steven Spielberg, Kathleen Kennedy, Larry Franco, Gerald R. Molen, Colin Wilson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Peter Buchman, Alexander Payne, Michael Crichton, Jim Taylor, David Koepp', 'Number of discs': '5'}\nGood\nFive Stars\nBuena Vista Home Video, Hocus Pocus\nBette Midler  (Actor),     Thora Birch  (Actor),     Kenny Ortega  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['You\\'re in for a devil of a time when three outlandishly wild witches -- Bette Midler (BEACHES, BIG BUSINESS), Sarah Jessica Parker (HONEYMOON IN VEGAS), and Kathy Najimy (SISTER ACT) -- return from 17th-century Salem after they\\'re accidentally conjured up by some unsuspecting pranksters! It\\'s a night full of zany fun and comic chaos once the tricky 300-year-old trio sets out to cast a spell on the town and reclaim their youth -- but first they must get their act together and outwit three kids and a talking cat! Loaded with bewitching laughs, HOCUS POCUS is an outrageously wild comedy that\\'s sure to entertain everyone!|Producer David Kirschner came up with the idea for the movie one night while he and his young daughter were sitting outside and his neighbor\\'s black cat strayed by. Kirschner began to unspool a narrative of how the cat was once a boy who was changed into a feline 300 years ago by three witches.|Actress Kathy Najimy described her character Mary as \"Eddie Haskell as a witch,\" referring to the character on the classic TV series \"Leave It To Beaver.\" \"She sucks up to Winifred [Bette Midler\\'s character] every chance she gets. She wants to be part of the power club and Winifred\\'s got the power.\"|To create the costumes, designer Mary Vogt read many historical books about Salem, Massachusetts. \"I even read diaries of women who were hanged as witches,\" she says.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Letterboxed', 'Contributor': 'Stephanie Faracy, Sean Murray, Sarah Jessica Parker, Bette Midler, Thora Birch, Neil Cuthbert, Doug Jones, Kathy Najimy, Kathleen Freeman, Kenny Ortega, Vinessa Shaw, Mick Garris, Omri Katz, Charles RocketStephanie Faracy, Sean Murray, Sarah Jessica Parker, Bette Midler, Thora Birch, Neil Cuthbert, Doug Jones, Kathy Najimy, Kathleen Freeman, Kenny Ortega, Vinessa Shaw, Mick Garris, Omri Katz, Charles Rocket   See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.58 x 5.44 x 7.46 inches; 2.4 Ounces', 'Item model number': '1775800', 'Director': 'Kenny Ortega', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 4, 2002', 'Actors': 'Bette Midler, Thora Birch, Kathy Najimy, Sarah Jessica Parker, Stephanie Faracy', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Mick Garris, Neil Cuthbert', 'Number of discs': '1'}\nGood\nFive Stars\nMALEFICENT\nAngelina Jolie  (Actor),     Sharlto Copley  (Actor),     Robert Stromberg  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Explore the untold story of Disney\\'s most iconic villain in this wickedly fun twist on the classic SLEEPING BEAUTY. In an unforgiving mood after a neighboring kingdom threatens her forest, Maleficent (Angelina Jolie) places an irrevocable curse on the king\\'s newborn daughter, the Princess Aurora. But as the child grows, Maleficent finds herself becoming fond of the girl. And as the conflict between the two realms intensifies, Maleficent realizes that Aurora may hold the key to peace in the land. Journey beyond the fairy tale in this soaring adventure that is \"visually arresting, brilliantly designed\" (Andrew Barker, Variety).']\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Full Screen, Dolby, Dubbed, NTSC', 'Contributor': 'Angelina Jolie, Sam Riley, Juno Temple, Imelda Staunton, Sharlto Copley, Elle Fanning, Lesley Manville, Robert StrombergAngelina Jolie, Sam Riley, Juno Temple, Imelda Staunton, Sharlto Copley, Elle Fanning, Lesley Manville, Robert Stromberg  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '11020800', 'Director': 'Robert Stromberg', 'Media Format': 'Multiple Formats, Full Screen, Dolby, Dubbed, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Angelina Jolie, Sharlto Copley, Elle Fanning, Sam Riley, Imelda Staunton', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGood\nFive Stars\nMulberry: The Complete Series (DVD)\nGeraldine McEwan  (Actor),     Karl Howman  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'Mulberry: The Complete Series (DVD)', 'Wanted: young person to render general domestic assistance. According to Bert and Alice, the two surly servants who work for the formidable Miss Farnaby (Geraldine McEwan), the notice should read: \"Wanted: masochist to be at the beck and call of cantankerous old trout.\" Fortunately, Mulberry has never met Bert or Alice. In fact, no one knows where he comes from. Out of the blue, he just turns up one day at the family mansion, without a single qualification to his name, and sweet-talks his way into the job. Suddenly, the dull old house is not dull anymore and Miss Farnaby\\'s life will never be the same again. But who is the mysterious man in black, and what does he want with Mulberry?', ']]>', 'Amazon.com', 'Both morbid and joyful, British sitcom', 'Mulberry', 'begins when a quirky young man with a penchant for floral waistcoats named Mulberry (Karl Howman,', 'Brush Strokes', ') shows up on the doorstep of a sullen, surly old woman named Mrs. Farnaby (Geraldine McEwan,', 'The Magdalene Sisters', ',', 'Mapp & Lucia', \"). The irrepressible Mulberry proceeds to unsettle the servants--Bert (Tony Selby) and Alice (Lill Roughley in the first season, Mary Healey in the second)--as he puckishly lures Mrs. Farnaby into a fuller, happier life. But unbeknownst to Mrs. Farnaby, Mulberry harbors a secret: He's the son of Death and Springtime (talk about mixed marriages) and he's been sent by his father (John Bennet) to carry the old woman over the threshold--not a typical premise for a comedy. This DVD set has both seasons; season 1 is occupied with the unveiling of Mulberry's secret and the drawing-out of Farnaby, while the second finds a surprising richness of material in the set-up, ranging from Mulberry having a near-death experience of his own to Alice considering running away with another man. Despite the recurring presence of Death, the show is really about taking pleasure in life and making your own choices. Howman's zaniness could have grown tiresome were it not countered by McEwan's deliciously dour presence (though a TV interview with the pair, included as an extra, reveals her to be a sweetheart in person). As Farnaby softens, Mulberry calms down, maintaining a careful balance. An odd but likable show, cut off by the BBC just as it found itself in full bloom. Co-created by Bob Larbey, creator of\", 'As Time Goes By', '.', '--Bret Fetzer']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Geraldine McEwan, Karl Howman', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1), English (Dolby Digital 1.0)', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.4 x 5.3 x 0.6 inches; 3 Ounces', 'Item model number': '2262229', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '6 hours and 17 minutes', 'Release date': 'June 13, 2006', 'Actors': 'Geraldine McEwan, Karl Howman', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nOne of my favorite English comedy/series\nFive Stars",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Five Stars",
    "text": "One of my favorite English comedy/series",
    "images": [],
    "asin": "B000EMG91S",
    "parent_asin": "B000EMG91S",
    "user_id": "AGF7IICPBJT7TEDM3IAIQ6BRCPVQ",
    "timestamp": "2015-01-23 19:52:09",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Mulberry: The Complete Series (DVD)",
    "average_rating": 4.8,
    "rating_number": 302,
    "features": [],
    "description": [
      "Product Description",
      "Mulberry: The Complete Series (DVD)",
      "Wanted: young person to render general domestic assistance. According to Bert and Alice, the two surly servants who work for the formidable Miss Farnaby (Geraldine McEwan), the notice should read: \"Wanted: masochist to be at the beck and call of cantankerous old trout.\" Fortunately, Mulberry has never met Bert or Alice. In fact, no one knows where he comes from. Out of the blue, he just turns up one day at the family mansion, without a single qualification to his name, and sweet-talks his way into the job. Suddenly, the dull old house is not dull anymore and Miss Farnaby's life will never be the same again. But who is the mysterious man in black, and what does he want with Mulberry?",
      "]]>",
      "Amazon.com",
      "Both morbid and joyful, British sitcom",
      "Mulberry",
      "begins when a quirky young man with a penchant for floral waistcoats named Mulberry (Karl Howman,",
      "Brush Strokes",
      ") shows up on the doorstep of a sullen, surly old woman named Mrs. Farnaby (Geraldine McEwan,",
      "The Magdalene Sisters",
      ",",
      "Mapp & Lucia",
      "). The irrepressible Mulberry proceeds to unsettle the servants--Bert (Tony Selby) and Alice (Lill Roughley in the first season, Mary Healey in the second)--as he puckishly lures Mrs. Farnaby into a fuller, happier life. But unbeknownst to Mrs. Farnaby, Mulberry harbors a secret: He's the son of Death and Springtime (talk about mixed marriages) and he's been sent by his father (John Bennet) to carry the old woman over the threshold--not a typical premise for a comedy. This DVD set has both seasons; season 1 is occupied with the unveiling of Mulberry's secret and the drawing-out of Farnaby, while the second finds a surprising richness of material in the set-up, ranging from Mulberry having a near-death experience of his own to Alice considering running away with another man. Despite the recurring presence of Death, the show is really about taking pleasure in life and making your own choices. Howman's zaniness could have grown tiresome were it not countered by McEwan's deliciously dour presence (though a TV interview with the pair, included as an extra, reveals her to be a sweetheart in person). As Farnaby softens, Mulberry calms down, maintaining a careful balance. An odd but likable show, cut off by the BBC just as it found itself in full bloom. Co-created by Bob Larbey, creator of",
      "As Time Goes By",
      ".",
      "--Bret Fetzer"
    ],
    "price": 29.98,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51XCXYVBBRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51XCXYVBBRL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Geraldine McEwan  (Actor),     Karl Howman  (Actor)    Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "BBC",
      "All BBC Titles"
    ],
    "details": {
      "Genre": "Comedy",
      "Format": "Multiple Formats, Closed-captioned, Color, NTSC",
      "Contributor": "Geraldine McEwan, Karl Howman",
      "Language": "English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1), English (Dolby Digital 1.0)",
      "Number Of Discs": "2",
      "Aspect Ratio": "1.33:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Package Dimensions": "7.4 x 5.3 x 0.6 inches; 3 Ounces",
      "Item model number": "2262229",
      "Media Format": "Multiple Formats, Closed-captioned, Color, NTSC",
      "Run time": "6 hours and 17 minutes",
      "Release date": "June 13, 2006",
      "Actors": "Geraldine McEwan, Karl Howman",
      "Studio": "BBC Home Entertainment",
      "Number of discs": "2"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}