{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Empty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nReview Date: 2020/09/09\nStore: Cherry\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nReview Text: nice set of spray bottles!! I used it to mix/dilute bleach and other chemical products that needed to be in new, unrecycled bottles. sprayer works fine, although one of them did leak when i turned the bottle upside down. not sure if that would happen with all the bottles, or just this one sprayer that i received. if you have other \"plastic\" spray bottles around your house, it will be easy to forget that this one is GLASS, so just be careful.\nReview Title: nice set of glass bottles!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "EMMOR Long Ombre Brown Wig for Women - 23 Inch Natural Synthetic Straight Hair Middle Part With Air Bang Wigs Dark Root, Party Cosplay Daily Use\nEMMOR\n{'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.72 x 2.2 inches; 11.68 Ounces', 'Item model number': 'femlc169-1'}\nnice color, nice texture, soft. comes with 2 nylon hair caps. great value for price.\nnice wig, great price.\nSELF/ish Men's Face Scrub | Exfoliating Facial Cleanser | Deep Cleansing | Effective Shave Prep & Beard Exfoliator for Men | Natural Ingredients | 3.4fl oz\nMELARQT\n{'Brand': 'MELARQT', 'Item Form': 'Scrub', 'Skin Type': 'Acne Prone', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Natural', 'Package Dimensions': '6.26 x 2.09 x 2.01 inches; 4.73 Ounces', 'Department': 'Men', 'UPC': '810042384002'}\nmy fifteen year old has been using this (along with the daily facial cleanser) and it has helped clear the acne on his forehead. he gives it 5 stars!\nhelps with teenage boy acne\nEmpty Clear Glass Spray Bottles 2-PACK,Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Special Feature': 'Mist Spray', 'Package Dimensions': '10 x 6.5 x 3.4 inches; 1.4 Pounds', 'UPC': '791523234156'}\nnice spray bottles.... just remember...it's glass, so be careful!\nnice bottles!\nEmpty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nnice set of spray bottles!! I used it to mix/dilute bleach and other chemical products that needed to be in new, unrecycled bottles. sprayer works fine, although one of them did leak when i turned the bottle upside down. not sure if that would happen with all the bottles, or just this one sprayer that i received. if you have other \"plastic\" spray bottles around your house, it will be easy to forget that this one is GLASS, so just be careful.\nnice set of glass bottles!!",
  "profile": "**User Summary:**\n\nThe user maintains a strong preference for high-quality, value-oriented products across personal grooming categories, with a notable focus on hair care and skincare. Their interest in modern wigs with natural textures underscores a blend of aesthetics and practicality, favoring synthetic options for both daily use and special occasions while being budget-conscious.\n\nRecently, the user has further embraced skincare, highlighting a holistic approach to personal grooming. Their purchase of targeted skincare products reveals a commitment to effective self-care and the integration of quality routines. \n\nThe user's acquisition of refillable spray bottles exemplifies their dedication to practicality and sustainability, alongside an expanding interest in versatile household items and DIY solutions, including essential oils and cleaning products. This recent interaction reflects their ongoing pursuit of quality and convenience in both personal care and home management.\n\nIn their latest review, the user expressed satisfaction with their new glass spray bottles, particularly valuing their utility for various purposes. However, they noted a minor issue with one of the sprayers leaking, indicating a preference for thorough product evaluation and performance reliability. Overall, the user's behavior illustrates a steadfast commitment to quality, sustainability, and comprehensive solutions in their personal and household needs.",
  "metrics": {
    "rouge1_f": 0.21996615905245345,
    "rouge2_f": 0.02376910016977929,
    "rougeL_f": 0.09475465313028765,
    "meteor": 0.09010156049957042,
    "bleu1": 0.0664096734424878,
    "bleu2": 0.01690535147936951,
    "bleu3": 0.0031374523196564695,
    "bleu4": 0.0013531228388104965,
    "bertscore_precision": 0.3223390579223633,
    "bertscore_recall": 0.3826267719268799,
    "bertscore_f1": 0.3499050736427307
  }
}