{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/01/14\nAverage Rating: 3.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Craig McMahon'], 'Producers': ['Craig McMahon', 'Cecil Chambers', 'Nathan Hill'], 'Starring': ['Sarah Oh'], 'Studio': ['Attic Underground Cinema']}\nReview Text: There were so many random moments in this film that distracted me because they had nothing to do with the main story line or they were incomplete thoughts. This wasn't a very good cut and the camera work could have been much wider.\nReview Title: lol sad\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Stuart Hackshaw'], 'Producers': ['Rajiv Whabi', 'Paul Mills'], 'Starring': ['Alex Childs', 'Richard Brimblecomb', 'Judith Eveson'], 'Studio': ['Oakwood Films']}\nThey sort of followed the general plot of the short story. However, they failed to describe how the main character was being repressed by her husband. That was a HUGE component in the text. Wasn't the room supposed to be converted from an old nursery? I didn't get that feeling. And, they certainly didn't build the connection between her increased writing and the emergence of her apparent illness. Just because the text is short does not mean the movie should have less. It certainly felt that way. Who ever converted the text for screen definitely should have stood their ground on keeping true to the meaning of the text. Maybe a student indie film will pick up the text and do it some justice.\nKind of a let down if you've read the story already.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Joey Soloway', 'Andrea Arnold', 'Nisha Ganatra', 'Silas Howard', 'Jim Frohna', 'Stacie Passon', 'Marta Cunningham', 'Allison Liddi-Brown', 'Marielle Heller', 'So Yong Kim'], 'Producers': ['Joey Soloway', 'Nisha Ganatra', 'Andrea Sperling', 'Victor Hsu', 'Bridget Bedard', 'Rick Rosenthal', 'Jennifer Corey'], 'Starring': ['Jeffrey Tambor', 'Gaby Hoffmann', 'Jay Duplass'], 'Studio': ['Amazon Studios']}\nThe players and the plots are top notch. There's not one dull moment or scene without a purpose and things just seem to unravel.\nOne of the best series I have ever seen.\n{'Content advisory': ['Violence', 'frightening scenes', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christian James'], 'Producers': ['Richard Kerrigan (Producer)', 'Daniel Pickering (Exec Prod)'], 'Starring': ['Dan Palmer', 'Tamaryn Payne', 'Antonia Bernath'], 'Studio': [\"Uncork'd Entertainment\"]}\nI get that this is not the more common heavily animated film. And for that, I'm thankful. The story was fun! There were moments where characters were innovatively extended by use of inanimate objects. The characters were kept to a minimum which was nice. There weren't many uneven moments where I thought, &#34;why is this person even here?&#34; Also, the whole thing was funny. If you're someone with a short attention span who needs something like Yo-Gabba-Gabba or the Transformers series to justify a decent film, this will be disappointing. On the other end of the stick, this movie isn't some intellectual nose-picker. That said, the film is just fun!\nThe film is just fun!\n{'Content advisory': ['Violence', 'frightening scenes', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sergio Mimica-Gezzan'], 'Producers': ['Aidan Elliott', 'Mark Huffam'], 'Starring': ['Mike Coulter', 'Sarah Armstrong', 'Steven Waddington'], 'Studio': ['Shout! Factory']}\nAll I can say is that I was not concerned about who may live or die in this film. They made two character out to have some hidden rivalry and never did anything with it. These guys had almost two hours and wasted it. This movie is a great example of how to take an interesting plot and ruin it. I actually want my money back.\nHow to take an interesting plot and ruin it:\n{'Subtitles': ['None available'], 'Directors': ['Sophia Cacciola', 'Michael J. Epstein'], 'Producers': ['Sophia Cacciola', 'Michael J. Epstein'], 'Starring': ['Jade Sylvan', 'Molly Carlisle', 'Molly DeVon'], 'Studio': ['Brink']}\nwell this was just a beginners project? The script dialog was inconsistent with the setting and characters. That actors made strange and irrelevant choices. The director made even stranger choices. Not sure why they shot the calmer moments at 60fps if this is supposed to have 1970s vibe to it. I think I could only handle 10 minutes before giving up.\nThe script dialog was inconsistent with the setting and characters.\n{'Subtitles': ['None available'], 'Directors': ['Amanda Tapping', 'Nick Willing', 'Martin Wood', 'Andy Mikita'], 'Producers': [\"Matthew O'Connor\", 'Nick Willing', 'Robert Halmi Sr', 'Jim Reeve', 'Robert Halmi Jr', 'Grant Rosenberg', \"Michael O'Connor\", 'Tia Bhul', 'Tom Parkhouse'], 'Starring': ['Tom York', 'Sonya Cassidy', 'Sonita Henry'], 'Studio': ['ContentFilm']}\nSave the suspense and watch the last five minutes of the final episode. Your natural reaction should summarize the entire season because it's as random as an episode of Squidbillies. Also, the special effects get played out like a holiday meme.\nSave the suspense and watch the last five minutes of the final episode.\nIp Man 3 (English Subtitled)\nInternational, Historical, Electrifying, Outlandish\n[\"Martial arts master Ip springs into action when his son's school is threatened by a shady American, then defends his status as wing chun champion.\"]\n{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['中文'], 'Subtitles': ['English'], 'Directors': ['Wilson Yip'], 'Producers': ['Isabella Chang', 'Kaishuai Feng', 'Jian-Xiang Shi', 'Alvina Wong', 'Edmond Wong', 'Raymond Pak-Ming Wong'], 'Starring': ['Donnie Yen', 'Mike Tyson', 'Max Zhang']}\nDonnie Yen barely shows any emotion. The film goes nowhere, and it's half the story line that caries most crappy martial arts films, which is some foreigner or idiot trying to screw over China. I spent the last hour trying to figure out what the hell I just watched.\nglad I was drunk\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nima Nourizadeh'], 'Producers': ['Anthony Bregman', 'Kevin Frakes', 'Raj Brinder Singh', 'David Alpert', 'Britton Rizzio'], 'Starring': ['Jesse Eisenberg', 'Kristen Stewart', 'Topher Grace'], 'Studio': ['Lions Gate Films Inc.']}\nWay too many plot holes.\nplot holes everywhere\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Craig McMahon'], 'Producers': ['Craig McMahon', 'Cecil Chambers', 'Nathan Hill'], 'Starring': ['Sarah Oh'], 'Studio': ['Attic Underground Cinema']}\nThere were so many random moments in this film that distracted me because they had nothing to do with the main story line or they were incomplete thoughts. This wasn't a very good cut and the camera work could have been much wider.\nlol sad",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Engagement:** The user remains focused on adaptations of literary works, advocating for fidelity to original narratives. Recent experiences further amplify their frustration with narrative coherence, leading to significant disappointment in films that diverge.\n\n- **Expectation of Depth:** A strong preference for thoughtful character exploration and cohesive storytelling persists. The latest review reveals profound dissatisfaction with narratives perceived as fragmented or lacking depth, showcasing the user's critical lens.\n\n- **Critical Analysis:** Their discerning critical approach has intensified, especially in response to films failing to manage themes and character dynamics effectively. A recent experience marked by incoherent storytelling has sharpened their scrutiny of overall narrative quality.\n\n- **Preference for Authenticity:** The user's tolerance for adaptations has decreased, particularly when inconsistencies and superficial elements emerge, reinforcing their demand for quality execution and narrative integrity.\n\n- **Cinema Appreciation:** While the user enjoys creative and humorous indie films, they firmly believe that entertainment value should not come at the expense of storytelling quality. Recent frustrating experiences further highlight their high standards.\n\n- **Rating Tendencies:** Their ratings are strongly influenced by narrative coherence and character depth, as demonstrated by a notably low rating following a recent interaction. This exemplifies their commitment to rigorous storytelling standards.\n\nOverall, the user displays a critical and thorough approach to media consumption, prioritizing narrative integrity, character depth, and a commitment to high-quality execution.",
  "metrics": {
    "rouge1_f": 0.12550937245313773,
    "rouge2_f": 0.011428571428571429,
    "rougeL_f": 0.06193969030154849,
    "meteor": 0.03838009528851244,
    "bleu1": 0.0028668852442255872,
    "bleu2": 0.0007965101431414656,
    "bleu3": 0.00012625710533311214,
    "bleu4": 5.031147533389801e-05,
    "bertscore_precision": 0.3378549814224243,
    "bertscore_recall": 0.4423956871032715,
    "bertscore_f1": 0.38312196731567383
  }
}