{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ip Man 3 (English Subtitled)\nReview Date: 2016/04/25\nCategories: International, Historical, Electrifying, Outlandish\nProduct Description: [\"Martial arts master Ip springs into action when his son's school is threatened by a shady American, then defends his status as wing chun champion.\"]\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['中文'], 'Subtitles': ['English'], 'Directors': ['Wilson Yip'], 'Producers': ['Isabella Chang', 'Kaishuai Feng', 'Jian-Xiang Shi', 'Alvina Wong', 'Edmond Wong', 'Raymond Pak-Ming Wong'], 'Starring': ['Donnie Yen', 'Mike Tyson', 'Max Zhang']}\nReview Text: Donnie Yen barely shows any emotion. The film goes nowhere, and it's half the story line that caries most crappy martial arts films, which is some foreigner or idiot trying to screw over China. I spent the last hour trying to figure out what the hell I just watched.\nReview Title: glad I was drunk\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Stuart Hackshaw'], 'Producers': ['Rajiv Whabi', 'Paul Mills'], 'Starring': ['Alex Childs', 'Richard Brimblecomb', 'Judith Eveson'], 'Studio': ['Oakwood Films']}\nThey sort of followed the general plot of the short story. However, they failed to describe how the main character was being repressed by her husband. That was a HUGE component in the text. Wasn't the room supposed to be converted from an old nursery? I didn't get that feeling. And, they certainly didn't build the connection between her increased writing and the emergence of her apparent illness. Just because the text is short does not mean the movie should have less. It certainly felt that way. Who ever converted the text for screen definitely should have stood their ground on keeping true to the meaning of the text. Maybe a student indie film will pick up the text and do it some justice.\nKind of a let down if you've read the story already.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Joey Soloway', 'Andrea Arnold', 'Nisha Ganatra', 'Silas Howard', 'Jim Frohna', 'Stacie Passon', 'Marta Cunningham', 'Allison Liddi-Brown', 'Marielle Heller', 'So Yong Kim'], 'Producers': ['Joey Soloway', 'Nisha Ganatra', 'Andrea Sperling', 'Victor Hsu', 'Bridget Bedard', 'Rick Rosenthal', 'Jennifer Corey'], 'Starring': ['Jeffrey Tambor', 'Gaby Hoffmann', 'Jay Duplass'], 'Studio': ['Amazon Studios']}\nThe players and the plots are top notch. There's not one dull moment or scene without a purpose and things just seem to unravel.\nOne of the best series I have ever seen.\n{'Content advisory': ['Violence', 'frightening scenes', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christian James'], 'Producers': ['Richard Kerrigan (Producer)', 'Daniel Pickering (Exec Prod)'], 'Starring': ['Dan Palmer', 'Tamaryn Payne', 'Antonia Bernath'], 'Studio': [\"Uncork'd Entertainment\"]}\nI get that this is not the more common heavily animated film. And for that, I'm thankful. The story was fun! There were moments where characters were innovatively extended by use of inanimate objects. The characters were kept to a minimum which was nice. There weren't many uneven moments where I thought, &#34;why is this person even here?&#34; Also, the whole thing was funny. If you're someone with a short attention span who needs something like Yo-Gabba-Gabba or the Transformers series to justify a decent film, this will be disappointing. On the other end of the stick, this movie isn't some intellectual nose-picker. That said, the film is just fun!\nThe film is just fun!\n{'Content advisory': ['Violence', 'frightening scenes', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sergio Mimica-Gezzan'], 'Producers': ['Aidan Elliott', 'Mark Huffam'], 'Starring': ['Mike Coulter', 'Sarah Armstrong', 'Steven Waddington'], 'Studio': ['Shout! Factory']}\nAll I can say is that I was not concerned about who may live or die in this film. They made two character out to have some hidden rivalry and never did anything with it. These guys had almost two hours and wasted it. This movie is a great example of how to take an interesting plot and ruin it. I actually want my money back.\nHow to take an interesting plot and ruin it:\n{'Subtitles': ['None available'], 'Directors': ['Sophia Cacciola', 'Michael J. Epstein'], 'Producers': ['Sophia Cacciola', 'Michael J. Epstein'], 'Starring': ['Jade Sylvan', 'Molly Carlisle', 'Molly DeVon'], 'Studio': ['Brink']}\nwell this was just a beginners project? The script dialog was inconsistent with the setting and characters. That actors made strange and irrelevant choices. The director made even stranger choices. Not sure why they shot the calmer moments at 60fps if this is supposed to have 1970s vibe to it. I think I could only handle 10 minutes before giving up.\nThe script dialog was inconsistent with the setting and characters.\n{'Subtitles': ['None available'], 'Directors': ['Amanda Tapping', 'Nick Willing', 'Martin Wood', 'Andy Mikita'], 'Producers': [\"Matthew O'Connor\", 'Nick Willing', 'Robert Halmi Sr', 'Jim Reeve', 'Robert Halmi Jr', 'Grant Rosenberg', \"Michael O'Connor\", 'Tia Bhul', 'Tom Parkhouse'], 'Starring': ['Tom York', 'Sonya Cassidy', 'Sonita Henry'], 'Studio': ['ContentFilm']}\nSave the suspense and watch the last five minutes of the final episode. Your natural reaction should summarize the entire season because it's as random as an episode of Squidbillies. Also, the special effects get played out like a holiday meme.\nSave the suspense and watch the last five minutes of the final episode.\nIp Man 3 (English Subtitled)\nInternational, Historical, Electrifying, Outlandish\n[\"Martial arts master Ip springs into action when his son's school is threatened by a shady American, then defends his status as wing chun champion.\"]\n{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['中文'], 'Subtitles': ['English'], 'Directors': ['Wilson Yip'], 'Producers': ['Isabella Chang', 'Kaishuai Feng', 'Jian-Xiang Shi', 'Alvina Wong', 'Edmond Wong', 'Raymond Pak-Ming Wong'], 'Starring': ['Donnie Yen', 'Mike Tyson', 'Max Zhang']}\nDonnie Yen barely shows any emotion. The film goes nowhere, and it's half the story line that caries most crappy martial arts films, which is some foreigner or idiot trying to screw over China. I spent the last hour trying to figure out what the hell I just watched.\nglad I was drunk",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Engagement:** The user remains interested in adaptations of literary works with a strong emphasis on fidelity to the source material. However, recent frustrations with narrative coherence have increased their disappointment in certain films.\n\n- **Expectation of Depth:** There is a noticeable rigidity in the user's preference for in-depth character exploration and cohesive storytelling. Their recent review reflects a dissatisfaction with superficial narratives that lack substance.\n\n- **Critical Analysis:** The user’s discerning perspective is underscored by a critical stance toward films that mismanage themes and character dynamics. Their recent experience with incoherent storytelling has sharpened their scrutiny in this area.\n\n- **Preference for Authenticity:** While the user favors fidelity to original narratives, their tolerance for adaptations has diminished, especially following engagements perceived as lacking narrative quality.\n\n- **Cinema Appreciation:** The user enjoys indie films with creativity and humor but maintains high standards for execution. A recent subpar viewing experience illustrates their firm belief that quality should not be sacrificed for entertainment value.\n\n- **Rating Tendencies:** The user's ratings are heavily influenced by their narrative expectations; a notably low rating from a recent interaction underscores their insistence on coherent storytelling and character depth.\n\nOverall, the user adopts a rigorous and critical approach to media consumption, prioritizing execution quality, narrative integrity, and depth in character exploration.",
  "metrics": {
    "rouge1_f": 0.13165013525698827,
    "rouge2_f": 0.016260162601626018,
    "rougeL_f": 0.06853020739404869,
    "meteor": 0.041172471103724406,
    "bleu1": 0.004716608177294675,
    "bleu2": 0.0016019741976417954,
    "bleu3": 0.000519425044037155,
    "bleu4": 0.000166476180139257,
    "bertscore_precision": 0.33934494853019714,
    "bertscore_recall": 0.4470518231391907,
    "bertscore_f1": 0.38582247495651245
  }
}