{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Eyebrow Tattoo Pen, Waterproof brow Pencil, Microblading Brow Pen, Natural Looking, Long Lasting (1# Light Brown)\nReview Date: 2021/07/25\nStore: EINHOOM\nAverage Rating: 2.7\nProduct Details: {'Brand': 'EINHOOM', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Product Benefits': 'Smoothening', 'Skin Type': 'All', 'Package Dimensions': '4.8 x 0.79 x 0.75 inches; 0.32 Ounces'}\nReview Text: I really like this a lot. It gives my eyebrows a very natural full look. However it is very flawed. The tip dries out quickly and it takes a long time to get it full and wet again. It seriously takes 20 minutes to do my brows with this. I wish it wasn’t like that because it’s perfect in every other way - stays in place, easy to remove…\nReview Title: Great when it works\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Beautify Professional Large Lockable Acrylic Vanity Makeup & Cosmetic Storage Display Case with Frame (Rose Gold)\nBeautify\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '11.8 x 6.3 x 7.5 inches; 2.8 Pounds'}\nI love this case it is so beautiful and I can fit everything but my eyeshadow pallets in it. I should note the bottom portion is large enough. I just prefer to put my brushes and sponges in it. I wish the black compartments were just a bit wider. Despite me loving this so much, I wouldn’t purchase this again. It’s too expensive. The arcrylic is thin, the metal is cheap, handle is plastic, and it’s difficult to get things to aglin. I fear this won’t hold up for more than a year or two.\nI love it, but poor quality\nLORMAY Silicone Makeup Brush Set(7pcs, Mint Green)\nLORMAY\n['Set contains:', '7 pieces of silicone makeup brushes', 'Product Highlights:', '1. Silicone brushes have become popular in the last five years. Unlike hair brushes, silicone brushes are easy to clean, easy to dry. They can be used repeatedly and have a long service life. 2. Silicone brushes can significantly reduce the consumption of makeup. We know that hair brushes easily soak up expensive beauty products. This is a waste.However, silicone brushes can minimize waste, as they do not soak up any fluids. 3. Silicone brushes are perfect for applying face masks, gels, creams, or liquid-like beauty products. 4. Silicone brushes are portable and easy to use, whether you are on the go, at home, or in the office. 5. 5. The big brush is used to apply facial mask and foundation makeup. The small brushes are used for the eye shadow, eyeliner, eyebrow, and lip makeup. 6. Silicone material is nontoxic and odorless, which meets FDA standards for quality, safety, and efficacy.', 'Tips:', '1. Clean these brushes with a small amount of soap or makeup remover and rinse them under lukewarm water. 2. Keep away from sharp objects like tweezers or brow scissors.', 'About LORMAY:', 'LORMAY is a professional beauty & personal care product supplier, focusing on supplying all kinds of high-quality, stylish and attractive makeup brushes and cosmetics. We devote ourselves to improving customers online shopping experience. Absolutely100% MONEY BACK guarantee if you are not satisfied.']\n{'Brand': 'LORMAY', 'Material': 'Silicone', 'Item Form': 'Wand', 'Number of Pieces': '7', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Item Dimensions LxWxH': '7.9 x 3.9 x 0.5 inches', 'Item Weight': '0.11 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.9 x 3.9 x 0.5 inches; 1.76 Ounces', 'UPC': '724190551905'}\nThis aren’t the greatest thing in the world, but that is just the nature of silicone brushes. However, this is an excellent value and totally worth purchasing. I use the larger ones to mix gels and lotions together. I tried using them to apply lotion and clay masks but I get better coverage with my fingers and I don’t have to worry about cleaning anything off. The other ones work fine for makeup application, I just prefer traditional brushes. I can being of use with cream, gel, or getting the last of a product out. Also, for the price these are really good quality.\nNice product\nMakeup Brushes 12PCs- CLOWII Professional Premium Birch Handle Makeup Brush Foundation Concealer Brush Set of 12 with 1 Makeup Cleaner(Black)\nCLOWII\n{'Brand': 'CLOWII', 'Recommended Uses For Product': 'For Concealing, For Foundation', 'Material': 'Silicone, Wool', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '12', 'Age Range (Description)': 'Adult', 'Handle Material': 'Silicone', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '8.03 x 4.41 x 1.69 inches; 9.59 Ounces', 'UPC': '741818684043'}\nI love the quality of these brushes. I get excellent results with them and the are so comfortable to use. The only thing I don’t like is the silver name stamped into the handles- really ruins the whole look. That’s such a trivia reason but I’m not sure I would have bought these if I saw that.\nLove them\nEyebrow Tattoo Pen, Waterproof brow Pencil, Microblading Brow Pen, Natural Looking, Long Lasting (1# Light Brown)\nEINHOOM\n{'Brand': 'EINHOOM', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Product Benefits': 'Smoothening', 'Skin Type': 'All', 'Package Dimensions': '4.8 x 0.79 x 0.75 inches; 0.32 Ounces'}\nI really like this a lot. It gives my eyebrows a very natural full look. However it is very flawed. The tip dries out quickly and it takes a long time to get it full and wet again. It seriously takes 20 minutes to do my brows with this. I wish it wasn’t like that because it’s perfect in every other way - stays in place, easy to remove…\nGreat when it works",
  "profile": "**User Summary:**\n\n- **Aesthetic Preference:** The user continues to prioritize beauty and design in their product selections, favoring elegant styles. Recently, they expressed appreciation for products that enhance natural beauty, yet they remain sensitive to functional flaws that detract from the overall aesthetic, such as issues with product usability.\n\n- **Functionality Focus:** They value high-quality tools that deliver effective results and emphasize comfort and ease of use. Their willingness to engage with various materials indicates a practical approach in their quest for performance, though they recognize that functionality should align closely with aesthetic appeal.\n\n- **Quality Concerns:** The user maintains a discerning eye on product quality, highlighting the importance of both functionality and aesthetics. Their recent experience with a brow product, while ultimately positive in achieving a natural look, revealed significant usability flaws, such as a drying tip that complicates the application process.\n\n- **Price Sensitivity:** They exhibit a consistent awareness of budget considerations, often assessing products based on value for money. Despite some shortcomings in their latest purchase, they still demonstrated satisfaction with product performance relative to its cost.\n\n- **Overall Satisfaction:** The user has shown moderate satisfaction with their purchases, acknowledging both strengths and weaknesses. Their balanced perspective underscores a persistent quest for beauty tools that harmoniously blend aesthetic appeal, comfort, and functionality while remaining within budget.",
  "metrics": {
    "rouge1_f": 0.17365853658536584,
    "rouge2_f": 0.011730205278592375,
    "rougeL_f": 0.08195121951219513,
    "meteor": 0.07491867046742268,
    "bleu1": 0.020985231439474082,
    "bleu2": 0.0050256427163105155,
    "bleu3": 0.000798179091372989,
    "bleu4": 0.00031838756467831577,
    "bertscore_precision": 0.3764553666114807,
    "bertscore_recall": 0.47767773270606995,
    "bertscore_f1": 0.4210686683654785
  }
}