{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: BeautyGARDE MAGIC Charcoal Facial Cleanser - detoxifying and anti-pollution face cleanser, Nonie Creme\nReview Date: 2021/10/13\nStore: BeautyGARDE\nAverage Rating: 2.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 2.13 x 7.75 inches; 4.8 Ounces', 'Item model number': '1201', 'UPC': '856365007242'}\nReview Text: This product felt thick and oily on my skin. I definitely feel after and I had to stop using it. The silicone scrubber is also pretty useless.\nReview Title: Oily\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Beautify Professional Large Lockable Acrylic Vanity Makeup & Cosmetic Storage Display Case with Frame (Rose Gold)\nBeautify\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '11.8 x 6.3 x 7.5 inches; 2.8 Pounds'}\nI love this case it is so beautiful and I can fit everything but my eyeshadow pallets in it. I should note the bottom portion is large enough. I just prefer to put my brushes and sponges in it. I wish the black compartments were just a bit wider. Despite me loving this so much, I wouldn’t purchase this again. It’s too expensive. The arcrylic is thin, the metal is cheap, handle is plastic, and it’s difficult to get things to aglin. I fear this won’t hold up for more than a year or two.\nI love it, but poor quality\nLORMAY Silicone Makeup Brush Set(7pcs, Mint Green)\nLORMAY\n['Set contains:', '7 pieces of silicone makeup brushes', 'Product Highlights:', '1. Silicone brushes have become popular in the last five years. Unlike hair brushes, silicone brushes are easy to clean, easy to dry. They can be used repeatedly and have a long service life. 2. Silicone brushes can significantly reduce the consumption of makeup. We know that hair brushes easily soak up expensive beauty products. This is a waste.However, silicone brushes can minimize waste, as they do not soak up any fluids. 3. Silicone brushes are perfect for applying face masks, gels, creams, or liquid-like beauty products. 4. Silicone brushes are portable and easy to use, whether you are on the go, at home, or in the office. 5. 5. The big brush is used to apply facial mask and foundation makeup. The small brushes are used for the eye shadow, eyeliner, eyebrow, and lip makeup. 6. Silicone material is nontoxic and odorless, which meets FDA standards for quality, safety, and efficacy.', 'Tips:', '1. Clean these brushes with a small amount of soap or makeup remover and rinse them under lukewarm water. 2. Keep away from sharp objects like tweezers or brow scissors.', 'About LORMAY:', 'LORMAY is a professional beauty & personal care product supplier, focusing on supplying all kinds of high-quality, stylish and attractive makeup brushes and cosmetics. We devote ourselves to improving customers online shopping experience. Absolutely100% MONEY BACK guarantee if you are not satisfied.']\n{'Brand': 'LORMAY', 'Material': 'Silicone', 'Item Form': 'Wand', 'Number of Pieces': '7', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Item Dimensions LxWxH': '7.9 x 3.9 x 0.5 inches', 'Item Weight': '0.11 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.9 x 3.9 x 0.5 inches; 1.76 Ounces', 'UPC': '724190551905'}\nThis aren’t the greatest thing in the world, but that is just the nature of silicone brushes. However, this is an excellent value and totally worth purchasing. I use the larger ones to mix gels and lotions together. I tried using them to apply lotion and clay masks but I get better coverage with my fingers and I don’t have to worry about cleaning anything off. The other ones work fine for makeup application, I just prefer traditional brushes. I can being of use with cream, gel, or getting the last of a product out. Also, for the price these are really good quality.\nNice product\nMakeup Brushes 12PCs- CLOWII Professional Premium Birch Handle Makeup Brush Foundation Concealer Brush Set of 12 with 1 Makeup Cleaner(Black)\nCLOWII\n{'Brand': 'CLOWII', 'Recommended Uses For Product': 'For Concealing, For Foundation', 'Material': 'Silicone, Wool', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '12', 'Age Range (Description)': 'Adult', 'Handle Material': 'Silicone', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '8.03 x 4.41 x 1.69 inches; 9.59 Ounces', 'UPC': '741818684043'}\nI love the quality of these brushes. I get excellent results with them and the are so comfortable to use. The only thing I don’t like is the silver name stamped into the handles- really ruins the whole look. That’s such a trivia reason but I’m not sure I would have bought these if I saw that.\nLove them\nEyebrow Tattoo Pen, Waterproof brow Pencil, Microblading Brow Pen, Natural Looking, Long Lasting (1# Light Brown)\nEINHOOM\n{'Brand': 'EINHOOM', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Product Benefits': 'Smoothening', 'Skin Type': 'All', 'Package Dimensions': '4.8 x 0.79 x 0.75 inches; 0.32 Ounces'}\nI really like this a lot. It gives my eyebrows a very natural full look. However it is very flawed. The tip dries out quickly and it takes a long time to get it full and wet again. It seriously takes 20 minutes to do my brows with this. I wish it wasn’t like that because it’s perfect in every other way - stays in place, easy to remove…\nGreat when it works\nKISSIO 4D Silk Fiber Lash Mascara Waterproof,Thrive Mascara,Voluptuous Volume,Intense Length,Long Lasting,No Smudging,No Clumping,Cruelty Free,Black\nKISSIO\n{'Color': 'Black', 'Brand': 'KISSIO', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Package Information': 'Tube', 'Package Dimensions': '5.08 x 1.14 x 1.1 inches; 1.13 Ounces'}\nI freaking love this. It produced long voluminous lashes that look 100 percent natural. It is completely waterproof and stays in place all day - even with my oily skin. It takes very little effort to remove it - just a bit extra cleanser. I’m very upset that this is sold out because I was about to buy 3. I seriously love this.\nHoly Grail\nMAEPEOR Matte Powder Waterproof and Long Lasting Pressed Powder with Full Coverage and Smooths Skin for All Skin Tone (Light 01, 0.4oz)\nMAEPEOR\n{'Brand': 'MAEPEOR', 'Item Form': 'Powder', 'Finish Type': 'Matte', 'Skin Type': 'Acne Prone,All Skin Types', 'Coverage': 'Lightweight,Buildable Coverage,Full', 'Product Dimensions': '1.97 x 0.39 x 0.2 inches; 2.33 Ounces'}\nThere is very little coverage to this product. It does help with shine but there are many products that are better. I use this to set my lipstick. The compact and sponge is nice. It’s too bad this couldn’t perform better.\nLittle Coverage\nBeautyGARDE MAGIC Charcoal Facial Cleanser - detoxifying and anti-pollution face cleanser, Nonie Creme\nBeautyGARDE\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 2.13 x 7.75 inches; 4.8 Ounces', 'Item model number': '1201', 'UPC': '856365007242'}\nThis product felt thick and oily on my skin. I definitely feel after and I had to stop using it. The silicone scrubber is also pretty useless.\nOily",
  "profile": "**User Summary:**\n\n- **Aesthetic Preference:** The user continues to place high importance on beauty and design in product selections, favoring elegant styles that enhance natural beauty. They seek products that provide a natural look while also being visually appealing.\n\n- **Functionality Focus:** They are committed to high-quality tools that deliver effective results, revealing a strong preference for products that blend aesthetic qualities with usability. They remain particularly sensitive to functional flaws and effectiveness.\n\n- **Quality Concerns:** The user exhibits a discerning eye for product quality, seeking a balance between functionality and aesthetics. Their latest review indicates dissatisfaction with a recent purchase, highlighting issues with the product's texture and effectiveness, reinforcing their critical perspective towards subpar performance.\n\n- **Price Sensitivity:** They are budget-conscious, carefully assessing value for money. While expressing disappointment with some recent purchases, their overall enthusiasm suggests they remain willing to invest in products that meet their aesthetic and functional expectations.\n\n- **Overall Satisfaction:** The user maintains a blend of appreciation and critique, demonstrating strong satisfaction with products enhancing beauty and functionality. However, their recent interactions underline a heightened vigilance against products that fail to meet their quality and performance standards, reinforcing their quest for effective beauty tools that harmonize aesthetic appeal, comfort, and efficacy.",
  "metrics": {
    "rouge1_f": 0.14153846153846153,
    "rouge2_f": 0.01078582434514638,
    "rougeL_f": 0.06769230769230769,
    "meteor": 0.054208703508507754,
    "bleu1": 0.004168239333727201,
    "bleu2": 0.0012169171135827802,
    "bleu3": 0.0005604698112252515,
    "bleu4": 0.0002892949243164451,
    "bertscore_precision": 0.36215341091156006,
    "bertscore_recall": 0.47887080907821655,
    "bertscore_f1": 0.4124130606651306
  }
}