{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sleepy Hollow (1999)\nReview Date: 2019/06/26\nStore: Johnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Sleepy Hollow (DVD)', 'Master storyteller Tim Burton (Batman, Edward Scissorhands) weaves an ee rie, enchanting version of this classic tale of horror. John ny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderou s Headless Horseman. Christina Ricci is Katrina V an Tassel, the beautif ul and mysterious girl with secret ties to the supernatural terror.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Christopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael GoughChristopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael Gough  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370409DVD', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 25 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: ❤\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hostiles\nRosamund Pike  (Actor),     Jesse Plemons  (Actor),     Scott Cooper  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.']\n{'Genre': 'Adventure', 'Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund PikeChristian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund Pike   See more', 'Language': 'English', 'Runtime': '2 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'B079ZT1TYC', 'Director': 'Scott Cooper', 'Media Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'April 24, 2018', 'Actors': 'Rosamund Pike, Jesse Plemons, Ben Foster, Stephen Lang, Adam Beach', 'Subtitles': 'Spanish', 'Producers': 'Ken Kao, Scott Cooper, John Lesher', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt's very good .\nGreat\n{'Subtitles': ['None available'], 'Directors': ['David Hayter'], 'Producers': ['Steven Hoban'], 'Starring': ['Jason Momoa', 'Lucas Till', 'Merritt Patterson'], 'Studio': ['Anderson Digital']}\nLove it\n3❤\nHorror Double Feature (Hellraiser / Hellbound: Hellraiser 2)\nAndrew Robinson  (Actor),     Ashley Laurence  (Actor),     Clive Barker  (Director),     Tony Randel  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Prepare to go to hell and back again in this double feature installment of one of the most iconic horror franchises of all time from horror master Clive Barker! See how it all began in the classic original HELLRAISER where Pinhead is introduced to the world, and the equally brilliant HELLBOUND sequel that proves there are no limits! HELLRAISER (1987, 94 Mins.): From horror master Clive Barker comes this chilling nightmare featuring the first appearance of the hideous, demonic Pinhead. When Kirsty Cotton’s family moves into their ancestral home, they are terrorized by the resurrected corpse of her uncle, who requires the flesh of murdered innocent victims in order to become whole and alive again. A creepy, thrillingly perverse tale straddling heaven and hell, extreme pleasure and unbearable pain, HELLRAISER will haunt your dreams. HELLBOUND: HELLRAISER 2 (1988, 99 Mins.): In 1988, it emerged as the shocking follow-up to the film that redefined the face of horror. Two decades later, it remains the most brutally original sequel in horror film history. Clare Higgins, Ashley Laurence and Kenneth Cranham co-star in this hit sequel from executive producer Clive Barker that experiences the flesh like no other. The time to play has come again: Surrender yourself to the infernal labyrinth of HELLBOUND: HELLRAISER II.']\n{'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '25507355', 'Director': 'Clive Barker, Tony Randel', 'Media Format': 'Dolby, Color, Widescreen, Multiple Formats, NTSC', 'Run time': '3 hours and 13 minutes', 'Release date': 'September 4, 2012', 'Actors': 'Andrew Robinson, Ashley Laurence, Clare Higgins, Sean Chapman', 'Studio': 'Image Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\n❤❤❤❤❤❤❤\n❤\nThe Last of the Mohicans\nDaniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Starring Daniel Day Lewis and Wes Studi. Includes deleted footage. (1992) Running time: 117 minutes.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '2200', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Mark Mann, Michael Mann, Hunt Lowry, Ned Dowd', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\n❤❤❤❤❤❤❤❤❤❤❤\n❤❤\nEDWARD SCISSORHANDS\nJohnny Depp  (Actor),     Winona Ryder  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Celebrate the 25th anniversary of this beloved masterpiece starring Johnny Depp and directed by Tim Burton. Depp delivers the performance that launched his career, as Edward, an irresistibly charming creation with razor-sharp metal hands and a heart of gold. Edward's lonely life in a Gothic castle changes forever when he meets a kindhearted Avon Lady (Dianne Wiest), who takes him to a pastel paradise known as Suburbia. Thanks to his fantastic talents, Edward becomes a neighborhood sensation, but when he falls in love with Kim (Winona Ryder), he must go to extraordinary lengths to protect her.\"]\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Linda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susan J. Blommaert, O-Lan Jones, Robert Oliveri, Alan ArkinLinda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susa…   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2307933', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 13, 2015', 'Actors': 'Johnny Depp, Winona Ryder, Dianne Wiest, Anthony Michael Hall, Kathy Baker', 'Dubbed': 'French', 'Subtitles': 'Spanish, English', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Caroline Thompson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove Johnny\n❤❤\nSleepy Hollow (1999)\nJohnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Sleepy Hollow (DVD)', 'Master storyteller Tim Burton (Batman, Edward Scissorhands) weaves an ee rie, enchanting version of this classic tale of horror. John ny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderou s Headless Horseman. Christina Ricci is Katrina V an Tassel, the beautif ul and mysterious girl with secret ties to the supernatural terror.', ']]>']\n{'Genre': 'Horror, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Christopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael GoughChristopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael Gough  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370409DVD', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 25 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nLove it\n❤",
  "profile": "**User Profile Summary:**\n\n**Media Preferences:**\n- Enjoys a diverse mix of action, adventure, fantasy, and horror genres, particularly those with strong narratives and emotional stakes. The user's recent engagement with a classic horror-fantasy film further showcases a fondness for whimsical storytelling intertwined with deep emotional themes.\n- Values high-quality storytelling and is drawn to well-rated productions, emphasizing impactful narratives. The user's appreciation for works directed by iconic filmmakers like Tim Burton signifies a taste for unique stylistic approaches and rich character development.\n- Shows a preference for films featuring notable actors, reflecting a respect for established talent while maintaining an openness to exploring acclaimed productions.\n\n**Interaction Patterns:**\n- Tends to rate products highly, especially those that resonate emotionally, showcasing a discerning approach to cinema.\n- Engages with content combining emotional depth with genre-specific elements, reinforcing a desire for significant cinematic experiences.\n\n**Overall Trends:**\n- Likely enjoys both mainstream and critically acclaimed films, along with iconic titles exploring themes of love, struggle, and moral complexities. Recent interactions indicate a deepening appreciation for horror with emotional nuances, particularly works by Tim Burton featuring prominent actors.\n- Demonstrates a thoughtful approach to media selection influenced by personal experiences and recommendations, emphasizing a dedication to quality in film.",
  "metrics": {
    "rouge1_f": 0.0905752753977968,
    "rouge2_f": 0.006127450980392157,
    "rougeL_f": 0.046511627906976744,
    "meteor": 0.02640406907815133,
    "bleu1": 0.00011133000345499854,
    "bleu2": 3.0360971845943348e-05,
    "bleu3": 1.0849647371117208e-05,
    "bleu4": 3.6509365233070877e-06,
    "bertscore_precision": 0.335665762424469,
    "bertscore_recall": 0.44384056329727173,
    "bertscore_f1": 0.38224726915359497
  }
}