{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Alice Through the Looking Glass\nReview Date: 2019/06/30\nStore: Johnny Depp  (Actor),     Helena Bonham Carter  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Disney invites you to step through the looking glass and join Alice, the Mad Hatter, Cheshire Cat and the Red Queen on a wild ride back to Wonderland! The adventure begins when Alice embarks on a daring quest to save her dear friend the Hatter (Johnny Depp). Plunging back into the whimsical, topsy-turvy world of Wonderland with all her old companions and a host of zany new ones, Alice must take on Time himself to right a past wrong, find her muchness... and remember that nothing is impossible.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Matt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen FryMatt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen Fry   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936850901', 'Director': 'James Bobin', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 18, 2016', 'Actors': 'Johnny Depp, Helena Bonham Carter, Sacha Baron Cohen, Anne Hathaway, Mia Wasikowska', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Based On Characters Created By Lewis Carroll, Written By Linda Woolverton', 'Number of discs': '1'}\nReview Text: Love the movie. It come earlier then thought.\nReview Title: Wonderful movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hostiles\nRosamund Pike  (Actor),     Jesse Plemons  (Actor),     Scott Cooper  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.']\n{'Genre': 'Adventure', 'Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Contributor': 'Christian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund PikeChristian Bale, Scott Cooper, Stephen Lang, Ken Kao, Jesse Plemons, John Lesher, Ben Foster, Peter Mullan, Paul Anderson, Adam Beach, Waypoint Entertainment, Wes Studi, Timothée Chalamet, Scott Wilson, Rosamund Pike   See more', 'Language': 'English', 'Runtime': '2 hours and 14 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'B079ZT1TYC', 'Director': 'Scott Cooper', 'Media Format': 'Dolby, NTSC, AC-3, Widescreen, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'April 24, 2018', 'Actors': 'Rosamund Pike, Jesse Plemons, Ben Foster, Stephen Lang, Adam Beach', 'Subtitles': 'Spanish', 'Producers': 'Ken Kao, Scott Cooper, John Lesher', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt's very good .\nGreat\n{'Subtitles': ['None available'], 'Directors': ['David Hayter'], 'Producers': ['Steven Hoban'], 'Starring': ['Jason Momoa', 'Lucas Till', 'Merritt Patterson'], 'Studio': ['Anderson Digital']}\nLove it\n3❤\nHorror Double Feature (Hellraiser / Hellbound: Hellraiser 2)\nAndrew Robinson  (Actor),     Ashley Laurence  (Actor),     Clive Barker  (Director),     Tony Randel  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Prepare to go to hell and back again in this double feature installment of one of the most iconic horror franchises of all time from horror master Clive Barker! See how it all began in the classic original HELLRAISER where Pinhead is introduced to the world, and the equally brilliant HELLBOUND sequel that proves there are no limits! HELLRAISER (1987, 94 Mins.): From horror master Clive Barker comes this chilling nightmare featuring the first appearance of the hideous, demonic Pinhead. When Kirsty Cotton’s family moves into their ancestral home, they are terrorized by the resurrected corpse of her uncle, who requires the flesh of murdered innocent victims in order to become whole and alive again. A creepy, thrillingly perverse tale straddling heaven and hell, extreme pleasure and unbearable pain, HELLRAISER will haunt your dreams. HELLBOUND: HELLRAISER 2 (1988, 99 Mins.): In 1988, it emerged as the shocking follow-up to the film that redefined the face of horror. Two decades later, it remains the most brutally original sequel in horror film history. Clare Higgins, Ashley Laurence and Kenneth Cranham co-star in this hit sequel from executive producer Clive Barker that experiences the flesh like no other. The time to play has come again: Surrender yourself to the infernal labyrinth of HELLBOUND: HELLRAISER II.']\n{'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '25507355', 'Director': 'Clive Barker, Tony Randel', 'Media Format': 'Dolby, Color, Widescreen, Multiple Formats, NTSC', 'Run time': '3 hours and 13 minutes', 'Release date': 'September 4, 2012', 'Actors': 'Andrew Robinson, Ashley Laurence, Clare Higgins, Sean Chapman', 'Studio': 'Image Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\n❤❤❤❤❤❤❤\n❤\nThe Last of the Mohicans\nDaniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Starring Daniel Day Lewis and Wes Studi. Includes deleted footage. (1992) Running time: 117 minutes.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '2200', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Mark Mann, Michael Mann, Hunt Lowry, Ned Dowd', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\n❤❤❤❤❤❤❤❤❤❤❤\n❤❤\nEDWARD SCISSORHANDS\nJohnny Depp  (Actor),     Winona Ryder  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Celebrate the 25th anniversary of this beloved masterpiece starring Johnny Depp and directed by Tim Burton. Depp delivers the performance that launched his career, as Edward, an irresistibly charming creation with razor-sharp metal hands and a heart of gold. Edward's lonely life in a Gothic castle changes forever when he meets a kindhearted Avon Lady (Dianne Wiest), who takes him to a pastel paradise known as Suburbia. Thanks to his fantastic talents, Edward becomes a neighborhood sensation, but when he falls in love with Kim (Winona Ryder), he must go to extraordinary lengths to protect her.\"]\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Linda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susan J. Blommaert, O-Lan Jones, Robert Oliveri, Alan ArkinLinda Perry, Tim Burton, Kathy Baker, Johnny Depp, John McMahon, Marti Greenberg, Winona Ryder, Biff Yeager, Conchata Ferrell, Dick Anthony Williams, Bryan Larkin, Anthony Michael Hall, Vincent Price, Caroline Thompson, Caroline Aaron, Dianne Wiest, John Davidson, Susa…   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2307933', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 13, 2015', 'Actors': 'Johnny Depp, Winona Ryder, Dianne Wiest, Anthony Michael Hall, Kathy Baker', 'Dubbed': 'French', 'Subtitles': 'Spanish, English', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Caroline Thompson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove Johnny\n❤❤\nSleepy Hollow (1999)\nJohnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Sleepy Hollow (DVD)', 'Master storyteller Tim Burton (Batman, Edward Scissorhands) weaves an ee rie, enchanting version of this classic tale of horror. John ny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderou s Headless Horseman. Christina Ricci is Katrina V an Tassel, the beautif ul and mysterious girl with secret ties to the supernatural terror.', ']]>']\n{'Genre': 'Horror, Mystery & Suspense/Thrillers', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Christopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael GoughChristopher Walken, Marc Pickering, Casper Van Dien, Tim Burton, Johnny Depp, Richard Griffiths, Miranda Richardson, Lisa Marie, Christina Ricci, Ian McDiarmid, Michael Gambon, Jeffrey Jones, Michael Gough  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'PTCA1000370409DVD', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '2 hours and 25 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nLove it\n❤\nDark Shadows\nJohnny Depp  (Actor, Producer),     Michelle Pfeiffer  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Dark Shadows (DVD)', \"Continuing their creative and commercially incandescent partnership (Charlie and the Chocolate Factory, Sleepy Hollow, Edward Scissorhands), superstar Johnny Depp and macabre movie master Tim Burton reunite yet again in this silver screen adaptation of the cult classic supernatural soap opera that follows the life and loves of New England vampire Barnabas Collins. Also starring Michelle Pfeiffer (Batman Returns), Eva Green (Camelot), Helena Bonham Carter (Harry Potter) and Australian newcomer Bella Heathcote as a young woman who finds herself inexplicably entwined in the vampire's fated love story two centuries earlier, DARK SHADOWS brings to light Depp's vampire from 1752 into the lava lamped vamp camp of 1972!\", ']]>']\n{'Genre': 'Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Eva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski, Richard D. Zanuck, Bella HeathcoteEva Green, David Kennedy, Tim Burton, Johnny Depp, Tim Headington, Bruce Berman, Seth Grahame-Smith, John August, Chloë Grace Moretz, Graham King, Helena Bonham Carter, Michelle Pfeiffer, Jonny Lee Miller, Chris Lebenzon, Jackie Earle Haley, Christi Dembrowski,…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'D279680D', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Johnny Depp, Michelle Pfeiffer, Helena Bonham Carter, Eva Green, Jackie Earle Haley', 'Subtitles': 'French, Spanish', 'Producers': 'Johnny Depp, Richard D. Zanuck, Graham King, Christi Dembrowski, David Kennedy', 'Studio': 'WarnerBrothers', 'Writers': 'Seth Grahame-Smith, John August', 'Number of discs': '1'}\nLove it\n❤\nSuicide Squad (DVD)\nWill Smith  (Actor),     Jared Leto  (Actor),     David Ayer  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Suicide Squad: Special Edition (DVD)', 'It feels good to be bad… Assemble a team of the world’s most dangerous, incarcerated Super Villains, provide them with the most powerful arsenal at the government’s disposal, and send them off on a mission to defeat an enigmatic, insuperable entity. U.S. intelligence officer Amanda Waller has determined only a secretly convened group of disparate, despicable individuals with next to nothing to lose will do. However, once they realize they weren’t picked to succeed but chosen for their patent culpability when they inevitably fail, will the Suicide Squad resolve to die trying, or decide it’s every man for himself?', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Charles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin WilsonCharles Roven, David Ayer, Adewale Akinnuoye-Agbaje, Richard Suckle, Jay Hernandez, Joel Kinnaman, Jai Courtney, Geoff Johns, Cara Delevingne, Will Smith, Ike Barinholtz, Jared Leto, Viola Davis, Deborah Snyder, Margot Robbie, Zack Snyder, Scott Eastwood, Colin Wilson   See more', 'Initial release date': '2016-12-13', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'D575439D', 'Director': 'David Ayer', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '2 hours and 3 minutes', 'Release date': 'December 13, 2016', 'Actors': 'Will Smith, Jared Leto, Margot Robbie, Joel Kinnaman, Viola Davis', 'Subtitles': 'French, Spanish, English', 'Producers': 'Zack Snyder, Charles Roven, Richard Suckle, Deborah Snyder, Colin Wilson', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Studio Distribution Services', 'Writers': 'David Ayer', 'Number of discs': '2'}\nGood movie\nCool\nThe Expendables 3\nSylvester Stallone  (Actor, Producer),     Jason Statham  (Actor),     Patrick Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Third film in the EXPENDABLES franchise.']\n{'Genre': 'Action', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny LernerKevin King Templeton, Avi Lerner, Dolph Lundgren, Terry Crews, Milla Jovovich, Jason Statham, Jet Li, Arnold Schwarzenegger, Les Weldon, Sylvester Stallone, Jackie Chan, Nicolas Cage, Wesley Snipes, Randy Couture, Patrick Hughes, Danny Lerner  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Item model number': 'LGT46268DVD', 'Director': 'Patrick Hughes', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 50 minutes', 'Release date': 'November 25, 2014', 'Actors': 'Sylvester Stallone, Jason Statham, Jackie Chan, Dolph Lundgren, Nicolas Cage', 'Subtitles': 'English, Spanish', 'Producers': 'Sylvester Stallone, Kevin King Templeton, Les Weldon, Danny Lerner, Avi Lerner', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nCool\n😎\nHacksaw Ridge [DVD]\nAndrew Garfield  (Actor),     Vince Vaughn  (Actor),     Mel Gibson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product Description', 'The amazing true life story of Desmond Doss, the first conscientious objector ever to be awarded the Medal of Honor. A 7th Day Adventist who believed WWII was a just cause- even though killing was not- Doss was the only American soldier to serve on the front lines without a weapon, and single-handedly saved the lives of 75 men.', 'Review', 'Special Features Include:Deleted ScenesVeterans Day Greeting with Mel Gibson --Lionsgate']\n{'Genre': 'Action', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Luke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian OliverLuke Bracey, Mel Gibson, William Johnson, Teresa Palmer, Rachel Griffiths, Andrew Garfield, Vince Vaughn, Tyler Thompson, Terry Benedict, Bill Mechanic, Sam Worthington, Cross Creek Pictures, David Permut, Hugo Weaving, Paul Currie, Bruce Davey, Brian Oliver  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 19 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '43449040', 'Director': 'Mel Gibson', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'February 21, 2017', 'Actors': 'Andrew Garfield, Vince Vaughn, Rachel Griffiths, Hugo Weaving, Sam Worthington', 'Subtitles': 'Spanish', 'Producers': 'William Johnson, Brian Oliver, Paul Currie, Tyler Thompson, David Permut', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove\n😎\nAlice Through the Looking Glass\nJohnny Depp  (Actor),     Helena Bonham Carter  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney invites you to step through the looking glass and join Alice, the Mad Hatter, Cheshire Cat and the Red Queen on a wild ride back to Wonderland! The adventure begins when Alice embarks on a daring quest to save her dear friend the Hatter (Johnny Depp). Plunging back into the whimsical, topsy-turvy world of Wonderland with all her old companions and a host of zany new ones, Alice must take on Time himself to right a past wrong, find her muchness... and remember that nothing is impossible.']\n{'Genre': 'Action/Adventure', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Matt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen FryMatt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen Fry   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936850901', 'Director': 'James Bobin', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 18, 2016', 'Actors': 'Johnny Depp, Helena Bonham Carter, Sacha Baron Cohen, Anne Hathaway, Mia Wasikowska', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Based On Characters Created By Lewis Carroll, Written By Linda Woolverton', 'Number of discs': '1'}\nLove the movie. It come earlier then thought.\nWonderful movie",
  "profile": "**Updated User Profile Summary:**\n\n**Media Preferences:**\n- The user maintains a diverse taste in film, enjoying genres such as action, adventure, fantasy, and horror, with a strong preference for emotionally rich narratives that incorporate whimsical elements. Their fondness for horror-comedy films with well-developed characters and unique directorial styles is evident. Recent engagements highlight a burgeoning interest in films that blend humor with darker themes, particularly those exploring complex moral issues and real-life heroism.\n\n**Interaction Patterns:**\n- The user consistently rates films that evoke strong emotional responses highly, demonstrating a commitment to impactful storytelling. Their latest interactions reflect an affinity for movies that feature charismatic performances and morally intricate characters, further emphasizing their desire for meaningful cinematic experiences.\n\n**Overall Trends:**\n- The user's film selections range from mainstream hits to critically acclaimed works, often focused on themes of love, sacrifice, and moral dilemmas. Their ongoing interest in action-adventure narratives supports their dedication to quality storytelling, marked by a balance of entertainment and emotional depth. This thoughtful engagement with diverse films underscores a consistent pursuit of memorable cinematic experiences that resonate long after viewing.",
  "metrics": {
    "rouge1_f": 0.048500319081046586,
    "rouge2_f": 0.002554278416347382,
    "rougeL_f": 0.026802807913209954,
    "meteor": 0.013359973039333685,
    "bleu1": 1.0891079274658158e-09,
    "bleu2": 1.747891860663531e-10,
    "bleu3": 3.504607144446621e-11,
    "bleu4": 1.5710649189690205e-11,
    "bertscore_precision": 0.3232892155647278,
    "bertscore_recall": 0.4662964344024658,
    "bertscore_f1": 0.38184231519699097
  }
}