{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Joseph [VHS]\nReview Date: 2003/05/13\nStore: Ben Kingsley  (Actor),     Paul Mercurio  (Actor),     Roger Young  (Director)    &                   0                  more   Rated:    NR    Format: VHS Tape\nCategories: Movies & TV, Christian Video, Feature Films\nProduct Description: ['The story of a young man?s amazing journey from a slave prison to the very inner sanctum of Egypt?s Pharaoh']\nAverage Rating: 4.5\nProduct Details: {'Format': 'Closed-captioned, Color, NTSC', 'Contributor': 'Monica Bellucci, Lionel Chetwynd, Martin Landau, Kelly Miracco, Laura Fattori, Luca Bernabei, Gloria Carlin, Gerald Rafshoon, Stefano Dionisi, Heinrich Krauss, Valéria Cavalli, Paul Mercurio, Dominique Sanda, Ben Kingsley, Alice Krige, Roger Young, James Carrington, Warren Clarke, Lorenzo Minoli, Lesley Ann WarrenMonica Bellucci, Lionel Chetwynd, Martin Landau, Kelly Miracco, Laura Fattori, Luca Bernabei, Gloria Carlin, Gerald Rafshoon, Stefano Dionisi, Heinrich Krauss, Valéria Cavalli, Paul Mercurio, Dominique Sanda, Ben Kingsley, Alice Krige, Roger Young, James Carrington, Warren Clarke…   See more', 'Number Of Discs': '2', 'Runtime': '3 hours and 5 minutes', 'Publication Date': 'September 24, 1996', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 4.2 x 2 inches; 12.8 Ounces', 'Director': 'Roger Young', 'Run time': '3 hours and 5 minutes', 'Release date': 'September 24, 1996', 'Date First Available': 'December 7, 2006', 'Actors': 'Ben Kingsley, Paul Mercurio, Martin Landau, Lesley Ann Warren, Alice Krige', 'Studio': 'Turner Home Ent', 'Producers': 'Gerald Rafshoon, Heinrich Krauss, Laura Fattori, Lorenzo Minoli, Luca Bernabei', 'Writers': 'James Carrington, Lionel Chetwynd'}\nReview Text: Having just seen this movie for the first time last night, I have to say that in spite of the very white actors in a culture that would clearly be darker in appearance, this movie in writing, production, and acting overcame that one glaring inconsistency with accuracy and with beauty.<br />Bible in hand, we marveled to see that this story followed the actual biblical account with astounding accuracy almost never seen in biblical productions.  Entirely enjoyable and a marvelously acted piece, my entire family loved this movie.  We had been expecting another biblical mish mash eliciting merely yawns, but were startled to see such a wonderful movie.<br />Martin Landau (Jacob) gave a fantastic performance, as did Ben Kingsley(Potiphar), Paul Mercurio(Joseph) (which bumps STRICTLY BALLROOM out of #1 on my Paul Mercurio list of favorite performances), Leslie-Anne Down was good as Potiphar's wife, and the 11 brothers of Joseph were fabulous.  The supporting cast was excellent.<br />The sensitive and well rounded way in which this story was handled was fresh, creative, yet took no liberties in veering from the original story.  Although it is not as spectacular in production as THE TEN COMMANDMENTS and other such movies, this movie was more like it &quot;really&quot; would have happened complete with humanity in all of its misery and magnificence.<br />I can not speak highly enough of this movie.  What a pleasant surprise.  We even got a chuckle out of it now and then!\nReview Title: AMAZING!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Strictly Ballroom [DVD]\nPaul Mercurio  (Actor),     Tara Morice  (Actor),     Baz Luhrmann  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Product Description', \"From Baz Lurhrmann -- the director of the award-winning hits ROMEO & JULIET and MOULIN ROUGE! -- comes STRICTLY BALLROOM ... the hilariously funny romantic comedy that's sure to leave you laughing, cheering, and feeling great! It's the magical story of a championship ballroom dancer who's breaking all the rules, and his ugly duckling dancing partner. Together they make their dreams come true! Now celebrating its glorious 10th Anniversary -- you're sure to enjoy this exhaustively funny comedy as it dances and soars its way straight into your heart. Critics everywhere fell madly in love with this big-screen treat -- and so will you!\", 'Set Contains:', \"The 10th-anniversary DVD of Baz Luhrmann's\", 'Strictly Ballroom', \"does everything it can to associate itself with the director's 2001 musical\", 'Moulin Rouge', \", from its cover art to its red-curtain animated menus. The commentary track, by Luhrmann, Catherine Martin (Luhrmann's wife and the Oscar(r)-winning production designer for\", 'Moulin Rouge', '), and choreographer John \"Cha Cha\" O\\'Connell, is rather broad, often covering general points about the movie or about', 'Moulin Rouge', 'instead of the specific scene that is playing. Trivia tidbits include the decision to cast actors rather than dancers (Paul Mercurio being a notable exception) and how the health department tried to shut down the film. The DVD also includes Maria Stratford\\'s 1986 documentary \"From Samba to Slow Fox,\" a 30-minute examination of the Australian ballroom-dancing scene (mirrored in', 'Strictly Ballroom', \"'s faux-documentary opening), and five short Luhrmann-narrated featurettes, the most interesting of which present backstage photos and international promotional art.\", '--David Horiuchi']\n{'Format': \"Anamorphic, Closed-captioned, Color, DVD, Collector's Edition, NTSC\", 'Contributor': 'Peter Whitford, Gia Carides, Craig Pearce, Bill Hunter, Pat Thomson, Andrew Bovell, Leonie Page, Sonia Kruger, Barry Otto, John Hannan, Baz Luhrmann, Pip Mushin, Paul Mercurio, Tara Morice, Kris McQuadePeter Whitford, Gia Carides, Craig Pearce, Bill Hunter, Pat Thomson, Andrew Bovell, Leonie Page, Sonia Kruger, Barry Otto, John Hannan, Baz Luhrmann, Pip Mushin, Paul Mercurio, Tara Morice, Kris McQuade   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.16 Ounces', 'Director': 'Baz Luhrmann', 'Media Format': \"Anamorphic, Closed-captioned, Color, DVD, Collector's Edition, NTSC\", 'Run time': '1 hour and 34 minutes', 'Release date': 'March 19, 2002', 'Actors': 'Paul Mercurio, Tara Morice, Bill Hunter, Pat Thomson, Gia Carides', 'Subtitles': 'Spanish, French', 'Studio': 'Miramax', 'Writers': 'Andrew Bovell, Baz Luhrmann, Craig Pearce', 'Number of discs': '1'}\nThe first time we ever saw STRICTLY BALLROOM, my husband and I were at the video store looking at the used videos for sale.  The cover looked so racy that we just passed it by wanting to see it first, before wasting our money on another sleazy canned dancing movie. (Had we seen Romeo and Juliet or Moulin Rouge first, we probably would never have looked twice at it).<br />After renting a copy and seeing it, we were so thrilled that we raced down to the store to grab the copy for sale, but it was gone.<br />The very beginning of this movie is fresh, new, and brilliantly put together.  The humor in the movie has the zaniness of British humor with the hard edged Aussie flair.  From the very first few minutes, we found ourselves laughing, clapping, and feeling overall wonderful about the beautifully done story that many can relate to.<br />A struggling &quot;invisible girl&quot; rather ignored and looked down upon takes a risk and ends up with the self-confident hero.  The costuming is gorgeous, the dance scenes beautiful, and the characters are PERFECTLY done - very different and lots of fun.<br />This movie is certainly a family movie-despite the racy cover.  What we particularly loved about this movie was that FRAN, the lead character ended up on top, but did not have to become a sleaze to do it.  She keeps her modesty and class and still comes out ahead.  The movie is pretty wholesomely done (be warned that there are a few swear words and one implied scene with a few characters-however very tame).<br />Dance scenes are not like so many other dance movies which are rather annoying.  On the contrary, they make you feel like you are involved.  All kinds of people, with all kinds of abilities dance in the movie- not just the stars.<br />I watch this movie several times a year, as does my mom who hesitated to buy a copy when I told her about it.  It is reminiscent of quirky Hyacinth Bucket character types (from BBC'c KEEPING UP APPEARANCES) with many new originals added.<br />This Aussie film is not only a delight, but the characters are believable, and many who we know find themselves watching it over and over again- greatly brightens one's mood.  I'm purchasing the DVD soon to replace the video, now worn.<br />SIDE NOTE:  I find it rather interesting that Paul Mercurio, who is a definite delight as the male lead and extremely appealing, does not like this film and wants to distance himself from the whole dancing thing (although he danced for some time before his role in the movie).  It is too bad, because this movie is one of the best movies of all time.  A TRUE CLASSIC.\nNON SLEAZY SURPRISE\nJoseph [VHS]\nBen Kingsley  (Actor),     Paul Mercurio  (Actor),     Roger Young  (Director)    &                   0                  more   Rated:    NR    Format: VHS Tape\nMovies & TV, Christian Video, Feature Films\n['The story of a young man?s amazing journey from a slave prison to the very inner sanctum of Egypt?s Pharaoh']\n{'Format': 'Closed-captioned, Color, NTSC', 'Contributor': 'Monica Bellucci, Lionel Chetwynd, Martin Landau, Kelly Miracco, Laura Fattori, Luca Bernabei, Gloria Carlin, Gerald Rafshoon, Stefano Dionisi, Heinrich Krauss, Valéria Cavalli, Paul Mercurio, Dominique Sanda, Ben Kingsley, Alice Krige, Roger Young, James Carrington, Warren Clarke, Lorenzo Minoli, Lesley Ann WarrenMonica Bellucci, Lionel Chetwynd, Martin Landau, Kelly Miracco, Laura Fattori, Luca Bernabei, Gloria Carlin, Gerald Rafshoon, Stefano Dionisi, Heinrich Krauss, Valéria Cavalli, Paul Mercurio, Dominique Sanda, Ben Kingsley, Alice Krige, Roger Young, James Carrington, Warren Clarke…   See more', 'Number Of Discs': '2', 'Runtime': '3 hours and 5 minutes', 'Publication Date': 'September 24, 1996', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 4.2 x 2 inches; 12.8 Ounces', 'Director': 'Roger Young', 'Run time': '3 hours and 5 minutes', 'Release date': 'September 24, 1996', 'Date First Available': 'December 7, 2006', 'Actors': 'Ben Kingsley, Paul Mercurio, Martin Landau, Lesley Ann Warren, Alice Krige', 'Studio': 'Turner Home Ent', 'Producers': 'Gerald Rafshoon, Heinrich Krauss, Laura Fattori, Lorenzo Minoli, Luca Bernabei', 'Writers': 'James Carrington, Lionel Chetwynd'}\nHaving just seen this movie for the first time last night, I have to say that in spite of the very white actors in a culture that would clearly be darker in appearance, this movie in writing, production, and acting overcame that one glaring inconsistency with accuracy and with beauty.<br />Bible in hand, we marveled to see that this story followed the actual biblical account with astounding accuracy almost never seen in biblical productions.  Entirely enjoyable and a marvelously acted piece, my entire family loved this movie.  We had been expecting another biblical mish mash eliciting merely yawns, but were startled to see such a wonderful movie.<br />Martin Landau (Jacob) gave a fantastic performance, as did Ben Kingsley(Potiphar), Paul Mercurio(Joseph) (which bumps STRICTLY BALLROOM out of #1 on my Paul Mercurio list of favorite performances), Leslie-Anne Down was good as Potiphar's wife, and the 11 brothers of Joseph were fabulous.  The supporting cast was excellent.<br />The sensitive and well rounded way in which this story was handled was fresh, creative, yet took no liberties in veering from the original story.  Although it is not as spectacular in production as THE TEN COMMANDMENTS and other such movies, this movie was more like it &quot;really&quot; would have happened complete with humanity in all of its misery and magnificence.<br />I can not speak highly enough of this movie.  What a pleasant surprise.  We even got a chuckle out of it now and then!\nAMAZING!",
  "profile": "**User Profile Summary:**\n\nThe user exhibits a strong preference for engaging, upbeat films that blend comedy with heartwarming narratives, particularly those featuring relatable characters overcoming challenges. They value wholesome content and appreciate character development and modest storytelling, often gravitating towards films that evoke joy and inspiration. Their recent review of a biblical drama highlights their appreciation for authenticity in storytelling, as well as their enjoyment of well-acted narratives that stay true to their source material.\n\nThis user enjoys dance-centric films but prefers ones that emphasize genuine portrayals of diverse talents, avoiding clichés. Their affinity for films directed by notable filmmakers suggests a keen interest in unique storytelling styles, while their tendency to rewatch favorite films indicates a desire for comfort and familiarity. They also have a taste for timeless storytelling, enjoying both newer and classic films, which aligns with their focus on quality over trends.\n\nIn addition, the user likely places a high value on shared viewing experiences, recommending enjoyable films to others. Their cinematic preferences reflect a deep love for feel-good cinema that resonates personally, emphasizing genuine emotion, character depth, and a balanced portrayal of complexities in human experiences. Overall, the user’s profile showcases a passion for emotionally resonant films that inspire and entertain.",
  "metrics": {
    "rouge1_f": 0.11446153846153846,
    "rouge2_f": 0.0024645717806531116,
    "rougeL_f": 0.05292307692307692,
    "meteor": 0.03711279953243717,
    "bleu1": 0.0003646690451398302,
    "bleu2": 0.0001008045206157575,
    "bleu3": 1.595613407904477e-05,
    "bleu4": 6.355043026121127e-06,
    "bertscore_precision": 0.3331001400947571,
    "bertscore_recall": 0.4868749678134918,
    "bertscore_f1": 0.3955683708190918
  }
}