{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/05/27\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Richard Shaw'], 'Producers': ['Richard Shaw', 'L.A. Marzulli'], 'Starring': ['L.A. Marzulli', 'Roger Leir']}\nReview Text: I really was not expecting this DVD to be that great after reading reviews and thinking about the subject matter.  When I watched it, however I was pleasantly surprised at how good this was.<br /><br />LA Marzulli is an excellent interviewer who listens to the people he interviews, and does not interrupt and try to railroad interviews like some others that drive me up the wall.<br /><br />The subject matter is quite fascinating and a variety of topics too which also made it easy to watch.  Only a few times did I start to zone out when they got into the minute details of metal structure of mysterious things inserted into people after *alien abductions*.  I just was not in the scientific mood to get into the details, whereas some days I am.<br /><br />I almost skipped this and the other first two thinking that number four would be more recent and the only one I needed to watch, but I am so glad I didn't in the end.  This one was one of the most enjoyable of the collection so far, and I am glad I watched it.\nReview Title: Much Better Than I Expected\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Strictly Ballroom [DVD]\nPaul Mercurio  (Actor),     Tara Morice  (Actor),     Baz Luhrmann  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Product Description', \"From Baz Lurhrmann -- the director of the award-winning hits ROMEO & JULIET and MOULIN ROUGE! -- comes STRICTLY BALLROOM ... the hilariously funny romantic comedy that's sure to leave you laughing, cheering, and feeling great! It's the magical story of a championship ballroom dancer who's breaking all the rules, and his ugly duckling dancing partner. Together they make their dreams come true! Now celebrating its glorious 10th Anniversary -- you're sure to enjoy this exhaustively funny comedy as it dances and soars its way straight into your heart. Critics everywhere fell madly in love with this big-screen treat -- and so will you!\", 'Set Contains:', \"The 10th-anniversary DVD of Baz Luhrmann's\", 'Strictly Ballroom', \"does everything it can to associate itself with the director's 2001 musical\", 'Moulin Rouge', \", from its cover art to its red-curtain animated menus. The commentary track, by Luhrmann, Catherine Martin (Luhrmann's wife and the Oscar(r)-winning production designer for\", 'Moulin Rouge', '), and choreographer John \"Cha Cha\" O\\'Connell, is rather broad, often covering general points about the movie or about', 'Moulin Rouge', 'instead of the specific scene that is playing. Trivia tidbits include the decision to cast actors rather than dancers (Paul Mercurio being a notable exception) and how the health department tried to shut down the film. The DVD also includes Maria Stratford\\'s 1986 documentary \"From Samba to Slow Fox,\" a 30-minute examination of the Australian ballroom-dancing scene (mirrored in', 'Strictly Ballroom', \"'s faux-documentary opening), and five short Luhrmann-narrated featurettes, the most interesting of which present backstage photos and international promotional art.\", '--David Horiuchi']\n{'Format': \"Anamorphic, Closed-captioned, Color, DVD, Collector's Edition, NTSC\", 'Contributor': 'Peter Whitford, Gia Carides, Craig Pearce, Bill Hunter, Pat Thomson, Andrew Bovell, Leonie Page, Sonia Kruger, Barry Otto, John Hannan, Baz Luhrmann, Pip Mushin, Paul Mercurio, Tara Morice, Kris McQuadePeter Whitford, Gia Carides, Craig Pearce, Bill Hunter, Pat Thomson, Andrew Bovell, Leonie Page, Sonia Kruger, Barry Otto, John Hannan, Baz Luhrmann, Pip Mushin, Paul Mercurio, Tara Morice, Kris McQuade   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.16 Ounces', 'Director': 'Baz Luhrmann', 'Media Format': \"Anamorphic, Closed-captioned, Color, DVD, Collector's Edition, NTSC\", 'Run time': '1 hour and 34 minutes', 'Release date': 'March 19, 2002', 'Actors': 'Paul Mercurio, Tara Morice, Bill Hunter, Pat Thomson, Gia Carides', 'Subtitles': 'Spanish, French', 'Studio': 'Miramax', 'Writers': 'Andrew Bovell, Baz Luhrmann, Craig Pearce', 'Number of discs': '1'}\nThe first time we ever saw STRICTLY BALLROOM, my husband and I were at the video store looking at the used videos for sale.  The cover looked so racy that we just passed it by wanting to see it first, before wasting our money on another sleazy canned dancing movie. (Had we seen Romeo and Juliet or Moulin Rouge first, we probably would never have looked twice at it).<br />After renting a copy and seeing it, we were so thrilled that we raced down to the store to grab the copy for sale, but it was gone.<br />The very beginning of this movie is fresh, new, and brilliantly put together.  The humor in the movie has the zaniness of British humor with the hard edged Aussie flair.  From the very first few minutes, we found ourselves laughing, clapping, and feeling overall wonderful about the beautifully done story that many can relate to.<br />A struggling &quot;invisible girl&quot; rather ignored and looked down upon takes a risk and ends up with the self-confident hero.  The costuming is gorgeous, the dance scenes beautiful, and the characters are PERFECTLY done - very different and lots of fun.<br />This movie is certainly a family movie-despite the racy cover.  What we particularly loved about this movie was that FRAN, the lead character ended up on top, but did not have to become a sleaze to do it.  She keeps her modesty and class and still comes out ahead.  The movie is pretty wholesomely done (be warned that there are a few swear words and one implied scene with a few characters-however very tame).<br />Dance scenes are not like so many other dance movies which are rather annoying.  On the contrary, they make you feel like you are involved.  All kinds of people, with all kinds of abilities dance in the movie- not just the stars.<br />I watch this movie several times a year, as does my mom who hesitated to buy a copy when I told her about it.  It is reminiscent of quirky Hyacinth Bucket character types (from BBC'c KEEPING UP APPEARANCES) with many new originals added.<br />This Aussie film is not only a delight, but the characters are believable, and many who we know find themselves watching it over and over again- greatly brightens one's mood.  I'm purchasing the DVD soon to replace the video, now worn.<br />SIDE NOTE:  I find it rather interesting that Paul Mercurio, who is a definite delight as the male lead and extremely appealing, does not like this film and wants to distance himself from the whole dancing thing (although he danced for some time before his role in the movie).  It is too bad, because this movie is one of the best movies of all time.  A TRUE CLASSIC.\nNON SLEAZY SURPRISE\nJoseph [VHS]\nBen Kingsley  (Actor),     Paul Mercurio  (Actor),     Roger Young  (Director)    &                   0                  more   Rated:    NR    Format: VHS Tape\nMovies & TV, Christian Video, Feature Films\n['The story of a young man?s amazing journey from a slave prison to the very inner sanctum of Egypt?s Pharaoh']\n{'Format': 'Closed-captioned, Color, NTSC', 'Contributor': 'Monica Bellucci, Lionel Chetwynd, Martin Landau, Kelly Miracco, Laura Fattori, Luca Bernabei, Gloria Carlin, Gerald Rafshoon, Stefano Dionisi, Heinrich Krauss, Valéria Cavalli, Paul Mercurio, Dominique Sanda, Ben Kingsley, Alice Krige, Roger Young, James Carrington, Warren Clarke, Lorenzo Minoli, Lesley Ann WarrenMonica Bellucci, Lionel Chetwynd, Martin Landau, Kelly Miracco, Laura Fattori, Luca Bernabei, Gloria Carlin, Gerald Rafshoon, Stefano Dionisi, Heinrich Krauss, Valéria Cavalli, Paul Mercurio, Dominique Sanda, Ben Kingsley, Alice Krige, Roger Young, James Carrington, Warren Clarke…   See more', 'Number Of Discs': '2', 'Runtime': '3 hours and 5 minutes', 'Publication Date': 'September 24, 1996', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 4.2 x 2 inches; 12.8 Ounces', 'Director': 'Roger Young', 'Run time': '3 hours and 5 minutes', 'Release date': 'September 24, 1996', 'Date First Available': 'December 7, 2006', 'Actors': 'Ben Kingsley, Paul Mercurio, Martin Landau, Lesley Ann Warren, Alice Krige', 'Studio': 'Turner Home Ent', 'Producers': 'Gerald Rafshoon, Heinrich Krauss, Laura Fattori, Lorenzo Minoli, Luca Bernabei', 'Writers': 'James Carrington, Lionel Chetwynd'}\nHaving just seen this movie for the first time last night, I have to say that in spite of the very white actors in a culture that would clearly be darker in appearance, this movie in writing, production, and acting overcame that one glaring inconsistency with accuracy and with beauty.<br />Bible in hand, we marveled to see that this story followed the actual biblical account with astounding accuracy almost never seen in biblical productions.  Entirely enjoyable and a marvelously acted piece, my entire family loved this movie.  We had been expecting another biblical mish mash eliciting merely yawns, but were startled to see such a wonderful movie.<br />Martin Landau (Jacob) gave a fantastic performance, as did Ben Kingsley(Potiphar), Paul Mercurio(Joseph) (which bumps STRICTLY BALLROOM out of #1 on my Paul Mercurio list of favorite performances), Leslie-Anne Down was good as Potiphar's wife, and the 11 brothers of Joseph were fabulous.  The supporting cast was excellent.<br />The sensitive and well rounded way in which this story was handled was fresh, creative, yet took no liberties in veering from the original story.  Although it is not as spectacular in production as THE TEN COMMANDMENTS and other such movies, this movie was more like it &quot;really&quot; would have happened complete with humanity in all of its misery and magnificence.<br />I can not speak highly enough of this movie.  What a pleasant surprise.  We even got a chuckle out of it now and then!\nAMAZING!\nRoswell - The Complete Second Season\nShiri Appleby  (Actor),     Jason Behr  (Actor),     Allan Kroeker  (Director),     Bill L. Norton  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product description', 'Roswell - Season 2', 'Amazon.com', 'Season 2 of the cult science-fiction series', 'Roswell', \"opens on a promisingly positive note, with the rescue of alien teen Michael (Brendan Fehr) by Max (Jason Behr) and his pals, but as soon as things settled down, new challenges threaten their existence. That was par for the course on this imaginative program, which hit its stride in its sophomore year (2000-2001) with a tighter blend of thoughtful youth drama and otherworldly action. The season's chief threats to aliens Max, Michael, Isabel (Katherine Heigl of\", \"Grey's Anatomy\", '), and newcomer Tess (Emilie De Ravin of', 'Lost', '), and Earthlings Liz (Shiri Appleby), Maria (Majandra Delfino), and Alex (Colin Hanks) are Vanessa Whitaker (Gretchen Egolf), a congresswoman with a very sinister secret agenda, and Brody Davis (Desmond Askew), the new curator of Roswell\\'s UFO Museum, who harbors an equally unpleasant plan for the friends. The struggle between human and alien forces, both good and evil, to uncover the truth about Max and his companions leads to a pair of shocking events--a death among the group, and in the season finale, Max, Michael, and Isabel\\'s possible return to their home planet. Other highlights from season 2 include the imaginative period piece \"Summer of \\'47,\" with the series regulars assuming the roles of townspeople and government officials at the time of the original alleged UFO crash; the two-parter \"Meet the Dupes\" and \"Max in the City,\" which poses the alien quartet against their physically identical doubles (with extremely different personalities); and \"A Roswell Christmas Carol,\" which offers an unsentimental retake on the Dickens story.', 'As with the first-season set, supplemental features are surprisingly abundant for a relatively minor show; commentary is included on three of the 21 episodes (two by executive producer Ron Moore), while the featurette \"Here with Me\" has the writers, producers, and cast offering their opinions on the season. There\\'s also another installment of the \"Shiri and Majandra Show,\" with more lighthearted reminiscences from the actresses, as well as two additional featurettes on the program\\'s score and the process of transforming a storyboarded scene into filmed action. A five-minute montage of clips set to music called \"A Little Something Extra for the Fans\" is the lightest of all the extras (and fans should note that many of the music cues featured in the original broadcasts have been replaced in this set), but', 'Roswell', 'aficionados will undoubtedly be happy with everything they get.', '--Paul Gaita']\n{'Genre': 'Science Fiction', 'Format': 'Box set, Closed-captioned, Color, Dolby, Subtitled, Widescreen, NTSC, Dubbed', 'Contributor': 'Garrett M. Brown, Brendan Fehr, Nick Wechsler, Jefery Levy, John Doe, Bill L. Norton, William Sadler, Emilie de Ravin, David Grossman, Jason Behr, Katherine Heigl, James A. Contner, Majandra Delfino, James Whitmore Jr., Shiri Appleby, Allan Kroeker, Mary Ellen Trainor, Colin Hanks, Bruce Seth Green, Frederick King KellerGarrett M. Brown, Brendan Fehr, Nick Wechsler, Jefery Levy, John Doe, Bill L. Norton, William Sadler, Emilie de Ravin, David Grossman, Jason Behr, Katherine Heigl, James A. Contner, Majandra Delfino, James Whitmore Jr., Shiri Appleby, Allan Kroeker, Mary Ellen Trainor, Coli…  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.75 inches; 1.1 Pounds', 'Director': 'Allan Kroeker, Bill L. Norton, Bruce Seth Green, David Grossman, Frederick King Keller', 'Media Format': 'Box set, Closed-captioned, Color, Dolby, Subtitled, Widescreen, NTSC, Dubbed', 'Run time': '15 hours and 24 minutes', 'Release date': 'October 5, 2004', 'Actors': 'Shiri Appleby, Jason Behr, Katherine Heigl, Majandra Delfino, Brendan Fehr', 'Dubbed': 'English', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nWhen Roswell was on TV, the first season was wonderful, the second season was, well, worrisome.  When it got to the idiocy of Max and Tess and a baby, well, I stopped watching the show.  It infuriated me that they could desecrate such a decent storyline with such mucky inconsistent lousy sci fi writing.  The team of writers played too much handball with the characters' personalities.<br /><br />When I got to see this collection of shows again one after the other, I could see the inconsistencies and overall bad writing shifts even more glaringly.  It was not until I saw the show's finale that I even wanted to own the last two seasons.<br /><br />Having said that, would I still buy this series again?  The answer is YES if nothing else for the spectacular Christmas episode.  Next to Blind Date (and a few others from season one), it was one of the series' best episodes.  Seems like a full length movie even though it is just about 40 minutes long.<br /><br />The rest of this season is unnecessarily dark, in my opinion.  The plots zig zag and contradict themselves through the season, leaving some ends completely loose that never get explained or resolved.  The writing is too choppy, almost like they were trying to achieve certain things with each episode (more sex, wider audience, better ratings, etc) rather than let the original writers flow with the show, which is what made it so good to begin with.<br /><br />Few shows do well over a several seasons, but the struggling character developement in the second season of Roswell is what carries it through.  It seems like they constantly changed writers because of the gross fluctuations in out-of-character behavior through the second season.  The writing styles of the scripts varied so much that it made the season like an annoying bumpy road that you just wish would be smooth.<br /><br />The best episode of this season which echoes the first season that so many fans loved the show for is the Christmas episode.  That is one of the very few Christmas episodes of any show that we hold dear and want to watch every Christmas.  It was deep, meaningful and the characters gave us a glimpse of what made them to dear to fans in the first season.<br /><br />There are a couple of other episodes in this season that are enjoyable, but there are many that are the kind of dark writing that completely ruined Buffy, which was delightful in the beginning as well, but mutated the show completely.<br /><br />Is this season worth owning?  Yes.  Despite all that I do not enjoy about it, the characters are still strong enough to warrant following the series all of the way through to the end.  The quirky mannerisms and personalities of the characters somehow manage to hang on through all of this and keep us endeared to them through the season.<br /><br />To put it in the words of my mother who is seeing the series for the first time, and is working through season 2, \"Each episode is so dark and sometimes so disoriented that you just want to stop watching it, but then you just have to see what happens to the characters, so you watch one more episode.\"<br /><br />The fact that the series ended in the same manner that it began makes it worth while.  The last few episodes bring us back to the type of show that Roswell started out to be.<br /><br />I call the Second Season of Roswell, the \"tunnel season\".  It is dark, you really don't want to be there, but hope that there will be light at the end keeps you walking through instead of giving up.<br /><br />The music changes are barely noticeable unless you are addicted to particular songs and watched videos of the TV shows repeatedly.  I think that they did a great job of substituting the music in the DVD's so far.  The show still is just as good as it was when it was on television.  In fact, I find the music less intrusive than on the TV show.<br /><br />I do wish that the DVD's were packed into a case that you could secure them in, they fall out constantly, and that is frustrating for everyone I know that has any of the seasons in this series.\nI Would Buy This Only For the Christmas Episode\nEnd of the Spear [DVD]\nLouie Leonardo  (Actor),     Chad Allen  (Actor),     Jim Hanon  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['\"End of the Spear\" is the remarkable journey of a savage Amazon tribesman who becomes family to the son of a North American man he kills. Mincayani (Louie Leonardo) is a Waodani warrior who leads the raid that kills Steve Saint\\'s father and four other missionaries. Through a suspenseful series of events Steve Saint (Chase Ellison) is able to visit Mincayani\\'s tribe. Steve tries to learn which warriors killed his father, but has to leave with his question unanswered. Steve returns to the Waodani as an adult (Chad Allen). Together Mincayani and Steve confront the true meaning of the life and death of Steve\\'s father, and the other men who were killed.']\n{'Aspect Ratio': '2.35:1, 1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 3.52 Ounces', 'Item model number': '024543245704', 'Director': 'Jim Hanon', 'Media Format': 'AC-3, Color, Dolby, Dubbed, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'June 13, 2006', 'Actors': 'Louie Leonardo, Chad Allen, Jack Guzman, Christina Souza, Chase Ellison', 'Dubbed': 'English', 'Subtitles': 'English, Spanish, French', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Studio': '20th Century Fox', 'Writers': 'Bart Gavigan, Bill Ewing, Jim Hanon', 'Number of discs': '1'}\nEND OF THE SPEAR is about what sounds like a relatively mundane story. Five US citizens set out to Ecuador to try to befriend what at that time was considered to be the most violent tribe on the planet at the time. It appeared that the US citizen were making progress when suddenly the tribe went ballistic on them and murdered them in cold blood.<br /><br />It was in 1956 and the news blared across the world. Most older people will remember that story well. There was a large photo spread and coverage in LIFE MAGAZINE and it was quite the talk of the world for a while.<br /><br />After these men were murdered, some of the wives of the murdered men went to live (touting their young children) with the tribe as a sort of an oxymoron- to get something out of their husband's lives being given up- so that they would not have died in vain.<br /><br />Eventually, the tribe had a huge transformation and they are completely different people today.<br /><br />Sounds kind of boring - at least it did to me- why would I want to see such a story? I mean these men knew what they were getting in to (4 or 5 other men were murdered in the previous decade so they knew what they were up against), I was puzzled as to the big shock of the murders..........<br /><br />END OF THE SPEAR is the story told from the more compassionate and youthful perspective of Steve Saint, son of Nate Saint, one of the murdered US citizens. Instead of the dry statistical account of the situation, suddenly I found myself experiencing the entire event as if Nate Saint was my father and I was his son.<br /><br />This story is told from the perspective of the Waodani tribe who open themselves up with a childlikeness that's both beautiful and disarming.<br /><br />When asked in a filmed documentary to describe what their lives were like before the murders (I was fortunate to see some interviews on television before the movie came out- you can see them and more in the documentary BEYOND THE GATES OF SPLENDOR), they list the lifestyle of unending murders that plagued their people almost to the point of extinction. Accounts of each murder in the history of each tribe member is reenacted with animation and detail- every person in the tribe lost many family members due to the constant stream of cold blooded killing.<br /><br />When a man in a family died, it was customary to bury the youngest child or child of choice by the father or mother with the dead or dying man ALIVE. One could only imagine how each child would die a frightening and painfully slow death. (knowing that before you see the movie might be helpful).<br /><br />To break that cycle, one of the tribe's girls runs away to outsiders so that she will not have to die that way with her father who clamors for her company in his grave.<br /><br />This escaped girl moves in with Rachel Saint and other women there (Rachel is Nate's sister) and learns English and how to live in the new culture which was so foreign to her.<br /><br />It was some time later that the five men came to make friends with the tribe. They intended to teach them that there was another way to live besides constant murder and death. Several tribe members came to meet the men and wanted to see their sister Dayume (played by Christina Souza). The language barrier made the situation frustrating. When one of the natives lied out of fear when he returned to the tribe, this led to the murder of the men.<br /><br />Mincaya (full name Mincayani- played by Louie Leonardo) was the man who murdered Nate Saint. After befriending Mincaya, Steve (both Nate and Steve are played by Chad Allen whom you might remember from Dr. Quinn, and Our House TV series) has to deal with the fury and confusion of suddenly finding out that his friend is the one that brought him the most pain.<br /><br />I have written a more extensive review at Epinions(dot)com of this movie with in depth information about the movie, background and cast if you are interested in reading it.<br /><br />Suffice it to say that after many bad movies telling stories of similar nature, I was expecting this movie to be substandard.  I was shocked at how moving and intense it really is.<br /><br />The critic reviews were completely unfounded and everyone we talked to outside the theater after the viewing said the same thing- and they were from VERY diverse backgrounds.  Different religions, different perspectives, different political persuasions.....I was intrigued by the way that this movie affected everyone we talked to that went.<br /><br />I can not recommend this film highly enough- and the fact that this little tribe of people gave up their time and privacy because they were concerned about the US becoming what they used to be due to violence says volumes.<br /><br />This movie is not like any other movie I have ever seen.  I would highly recommend viewing the documentary (Beyond the Gates of Splendor) before you see the movie as it enhances the movie even more.  If you can not see it, however, the movie stands very well on its own.<br /><br />We were able to rent the documentary at a local Movie Gallery.\nI NEVER Spend Full Price On Movies, But I Did TWICE For This One\nDavie & Golimyr\nJohn Schneider  (Actor),     Nathan Smith  (Director),     Chris Smith  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Inspired by the Story of David and Goliath! When the ferocious Giant Golimyr threatens the peaceful village of the Zites, King Sullic sends a proclamation throughout the land calling for a champion to vanquish the foe. To the King\\'s dismay, the only champion who rises to their aid is young Davie, a peaceful pear grower whose only defense is a sling, a sheep and his faith. Set within the imaginative fantasy world of renowned artist James C. Christensen and based on the biblical story of David and Goliath this stop-motion animated adventure is bursting with visual wonders. From sneeze-powered windmills to a colossal ship made of stone, join Davie and his wooly sidekick Chops as they discover \"a little Faith can do Giant things\" .']\n{'Genre': \"Children's\", 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Darin McDaniel, Chris Smith, Nathan Smith, John Schneider', 'Language': 'Unqualified', 'Runtime': '45 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Nathan Smith, Chris Smith, Darin McDaniel', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '45 minutes', 'Release date': 'March 4, 2008', 'Actors': 'John Schneider', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nWhen I first saw this DVD I was not sure what to think.  It seems that every time someone tries to make over a traditional story, they tend to do a substandard job and I end up disappointed.<br /><br />With Davie and Golimyr I am still not sure what to think.  The story just left me asking one question- \"Why?\"<br /><br />Why did they go to all this effort to take a really good story and chop it, dice it, slice it, and add all kinds of other stuff to it, when it was really a great story to begin with?  Why not just start fresh?<br /><br />What this ended up being was like a merging of THE NEVERHOOD, KRYANDIA, GUMBY, WALLACE AND GROMMIT, with a splash of the biblical story of David facing the giant Goliath to add a bit of flavor.<br /><br />This story takes place in a totally fanciful background.  It is about a king of a bizarre fantasy land of Zites.  There is a giant threatening the peaceful land (his name, of course, is Golimyr) and the only one who comes forward to defeat this giant is Davie- who grows pears and has a flying sheep named Chops.<br /><br />The movie is filled with total fantasty characters who are half strange looking robots, combinations of bits and pieces of things- like a guy with a castle on his head, odd combinations of rocks made into a ship, and a windmill that is powered by sneezes, a flying sheep......<br /><br />Davie learns through a pear that his faith can grow from being small and he can live a fruitful life, and he vanquishes the giant.<br /><br />I am having a hard time reviewing this movie, because on one hand, it is very colorful and the animation is really beautiful and bright and detailed.  However, on the other hand, this movie annoyed me.<br /><br />When I played this for my entire family, the reactions were varied.  The story is told in rhyme, and the tale is supposed to be entertaining with all kinds of crazy odd things and bizarre characters.<br /><br />The film has such good potential- and they spent so much time with it, that I feel sad that I did not enjoy this movie.  My family ranges in age from 9 to adult and none of us really was jumping up and down with glee at this movie.<br /><br />I think what bothers me is that they attempted to jump on the back of a really good solid story with fabulous potential to keep the attention of an audience and they altered it SO much that they ruined it.<br /><br />If they had taken this story and started fresh with a similar theme but called it a title completely unrelated to the biblical story, perhaps it might not have been so annoying.<br /><br />Each character was so strange and such a mish mash of oddities that they distracted from the story.  We all spent so much time trying to figure out the point of why so many things in this movie were strange that we really did not enjoy it as much as we could have.<br /><br />The flying sheep was rather stupid, Golimyr had to be hit twice with a stone before he was conquered- the characters were all so intricate and unrelated to the story that I found that we spent so much time trying to figure out how it all fit together, that we missed what was being said by the narrator.<br /><br />The story being told in rhyme was a good idea, but it was overshadowed by the overstimulation of the characters- so much was going on with each character that it seemed like a mass of confusion. Being talked at in rhyme, being stimulated by gorgeous color and 3D animation, seeing characters that were so \"out there\" that they did not make any sense, trying to figure out how this related to the original biblical story, and trying to see how this all fit together, was like sensory overload and it tended to make us all burn out and not even care by the end.<br /><br />Honestly, I feel that if they started fresh and used their creativity to introduce the same concepts WITHOUT depending upon the biblical story which is familiar to many, I think that this might have been a bigger success.<br /><br />I was irritated by the many changes that they made in the original story which is far more interesting and fun to explore, yet tried to keep close to the same title.<br /><br />In the real story, David is not even remembered or revered by his family- so much so that when Samuel comes to anoint a king, no one even remembers that he is there- all the other brothers are brought forward first.  His world of living almost estranged from his family with the sheep gives the impression that he had a lonely life- and time to develop character.  Then the mockery when he comes forward to go after the giant of his brothers who are still jealous of him.  The sheer miraculous way that he stands on the faith of his God who taught him to survive impossible odds while being in the fields is what kills the giant- not the stone......<br /><br />This story on the DVD has very little of this flavor to it.  It is so focused on fantasy that is loses the beauty of the underdog conquering and the poignancy of being disliked/undervalued by your own family and yet living to triumph.<br /><br />The effect was like trying to make a 12 oz glass of milk less fattening by adding a gallon of water to it and still calling it milk.<br /><br />I am rating this 3 stars because it does have beautiful colors, some discussion of faith in it, and a slight resemblance to the story it claims to be inspired by.<br /><br />It is not a terrible movie, but it just did not thrill any of us very much either.  Too much crowded into on small span of time, they seemed to lose and powerful focus.<br /><br />Perhaps in the future they can make another movie that might turn out better.  This was a good try anyway.  Hats off to their efforts.\nWhy Not Just Use a Fresh Idea?\niVideo French: Video Learning for the Igeneration\nFormat: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n[\"Live-action language learning video series of traveler's essentials designed for your iPod, iPhone, or other portable media player. See and hear the words and phrases spoken as well as real conversations -- all with English and target language subtitles to enhance learning wherever you are. Includes grammar and cultural notes.\"]\n{'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Language': 'French, English', 'Runtime': '2 hours', 'Product Dimensions': '5.25 x 1 x 7.75 inches; 2.88 Ounces', 'Media Format': 'NTSC', 'Run time': '2 hours', 'Release date': 'February 1, 2008', 'Studio': 'Penton Overseas Inc', 'Number of discs': '1'}\niVideo French is a DVD in a plastic case which does not have anywhere to store it once you have opened it up- the original case it comes in is too flimsy, so you had better be sure you have another hard case to store it in if you order this.<br /><br />When it first comes up on the screen (I ran this in a DVD player on a TV), this is what you will see:<br /><br />INTRODUCTION<br /><br />1.  Greetings<br />Basic words and phrases.  A man and woman take turns pronouncing each word twice while the English is on top and the French spelling is on bottom of the screen.  You have the option to repeat the section if you like on screen.  This is followed by a simple conversation between the man and woman, with English on top of screen and French on the bottom.<br /><br />Special topic of formal and informal pronouns and verbs.  Explains the simple differences.<br /><br />2.  Introductions<br />How to introduce yourself and meet others.  Two women say the simple words = again same format as before which is carried through the DVD.<br />A short conversation illustrates how two people meet each other.<br /><br />Special Topic<br />Gender and Grammar - simple explanation of the gender of simple words.<br /><br />3.  Do You Speak French<br />A man and woman use simple words of description which might help to determine speed, and other words that would be helpful to communicate if you want to find someone who speaks English because you can not understand much French. Bathroom words are included here.  Also phrases are included to help you understand if someone is trying to tell you that they don't speak English at all or just a little. Also words to help you tell someone to slow down a bit if they are talking too quickly.<br /><br />This section is quite long compared to the previous sections.  A lot of information is covered here so it will be necessary to repeat this quite a few times.<br /><br />A simple conversation happens between the young man and woman to help find someone that speaks English and find out some basic important information.  (Bathroom)<br /><br />SPECIAL TOPIC<br />French verbs and verb forms are briefly covered here.  This is VERY basic.<br /><br />4.  Directions<br />ASking for and understanding directions.  Two women will lead you through simple words and phrases to help you find out how to get somewhere and how to find something. This section is pretty well laid out for most things that you might need to address if you are trying to get directions.  The two women stage a conversation of someone who is lost and needs direction from the hotel to a park.<br /><br />SPECIAL TOPIC<br />Finding conveniences.  The terms are different for things that we know in the US.  Directions are given using landmarks and numbers so be aware of this.<br /><br />5.  Meeding, Wanting, Having<br />Terms and phrases to tell someone what you need or have.  There are some verbs shown in their base form and some phrases with the verbs already put into the proper form for the speaker.  Family terms and more restroom phrases included here.  This section is on the longer side as well.  A man and woman have a conversation which you can fill in the blanks to tell someone what you need, want, or have.  It allows you to learn the basics.<br /><br />SPECIAL TOPIC<br />Plurals and how to make them.  This is very simple and basic.<br /><br />REVIEW 1<br /><br />Phrases from all five lessons are taken and you have some time to think of them on your own, they will then tell you the answer and allow you to practice.  The viewer is not urged to continue on in lessons until the first five chapters have been mastered.<br /><br />There are no people visible here, just the words show on the screen to allow you to think more clearly without distraction.<br /><br />6. Travel<br />Airports, cars, passports, trains, and taxis.  Words that you need to know to allow you to take transportation.  The conversation that is in this section allows you to discuss your documentation that you need to present in order to travel.<br /><br />SPECIAL TOPIC<br />Travel Time, how to talk about time.<br /><br />7. Hotel<br />Vocabulary you need for lodging.  Words and phrases to get reservations and such for lodging.  Conversation shows how to check in for a reservation using your full name.<br /><br />SPECIAL TOPIC<br />Type of lodging that you will find in France.  Discussion of different manners of lodging- looking them up on the internet first- not much info here.<br /><br />8. Restaurants<br />Some words relating to food and eating out.  The conversation between two women is a dining out situation in a restaurant with a waitress.<br /><br />SPECIAL TOPIC<br />Restaurant bills and tips.<br /><br />9. Shopping<br />Essentials for finding souvenirs and words and phrases so you can do basic shopping.  Conversation is a man and woman shopping for souvenirs to bring home to family.<br /><br />SPECIAL TOPIC<br />Currency- how to understand Euro and credit cards.  Very brief.<br /><br />10. Emergency & Pharmacy<br />Basic emergency terms. Theft, medical emergency, and loss words are in this section. You can also find more words of this type on the audio appendix.  Conversation is between man and woman but they are both acting out different conversations- one is a heart attack and the other is a stolen purse.<br /><br />SPECIAL TOPIC<br />Medical and Law Enforcement.  Differences between France and US approach.<br /><br />REVIEW 2<br /><br />Same process as the first review section.<br /><br />Credits<br />Lesson Menu<br /><br />WHAT IS THIS PROGRAM LIKE?<br /><br />Nice music reminiscent of Mr Rogers Neighborhood- rolling piano music- comes on and you are given a brief introduction of what to expect when you use the program.<br /><br />There is an audio appendix and a self-print guide that you can print out via computer.<br /><br />COMMENTS<br /><br />You can not use the search button to speed forward through the lessons- you have to listen to each lesson completely through if you want to repeat it.  That is rather frustrating.  I would prefer to be able to forward through the lesson to get to words that I wanted to review.<br /><br />Also, another thing about this program is that the people that act out the words and conversations are kind of stiff and not as fun to watch with as the Spanish program is.  It is a decent program for those who want to quickly learn French enough to survive in France for a trip.<br /><br />The other advantage is that this program can be used on an Ipod.  Supposedly it can be used on MP3 too, but I have not been able to do it, so I am going to say it does not work. If I figure out how to do it, I will update this review, if possible.<br /><br />I wish that this program came with a case, but I think that it is a decent introductory program to learn VERY BASIC essentials of French.<br /><br />If you are looking for something more substantial, then I would look for something else like Rosetta Stone program or other more foundational French programs.<br /><br />There is very scanty information on things as far as understanding the language, and I think that it is primarily repetition and learning of basic things trusting that it is going to be correct enough to get you through a trip.  If you want to learn how to translate words and such- this program will not help you.<br /><br />I have given it 4 stars.  It is good for what it is, but I am not WOWed by it.<br /><br />I like the fact that you can use it on portable media so you can take it with you while you travel.\nA Great Way To Become Familiar with French\n{'Subtitles': ['None available'], 'Directors': ['Richard Shaw'], 'Producers': ['Richard Shaw', 'L.A. Marzulli'], 'Starring': ['L.A. Marzulli', 'Roger Leir']}\nI really was not expecting this DVD to be that great after reading reviews and thinking about the subject matter.  When I watched it, however I was pleasantly surprised at how good this was.<br /><br />LA Marzulli is an excellent interviewer who listens to the people he interviews, and does not interrupt and try to railroad interviews like some others that drive me up the wall.<br /><br />The subject matter is quite fascinating and a variety of topics too which also made it easy to watch.  Only a few times did I start to zone out when they got into the minute details of metal structure of mysterious things inserted into people after *alien abductions*.  I just was not in the scientific mood to get into the details, whereas some days I am.<br /><br />I almost skipped this and the other first two thinking that number four would be more recent and the only one I needed to watch, but I am so glad I didn't in the end.  This one was one of the most enjoyable of the collection so far, and I am glad I watched it.\nMuch Better Than I Expected",
  "profile": "The user maintains a strong affinity for emotionally resonant narratives in science fiction and fantasy that prioritize character development, often critiquing adaptations of traditional stories that excessively alter core themes and emotional depth. Their disappointment in such adaptations reflects a desire for narratives that preserve the essence of original sources while evoking nostalgia and showcasing character growth.\n\nIn a recent interaction, the user positively reviewed a documentary, initially skeptical due to its subject matter and prior reviews. They praised the interviewer's approach, noting the engaging and varied topics presented, which enhanced their viewing experience. The user expressed an appreciation for quality interviews that respect the flow of conversation and avoid interruptions, highlighting a critical view on narrative execution and coherence across all storytelling mediums. Although they did find some details tedious at times, their overall enjoyment showcases an openness to diverse narratives when executed effectively.\n\nThis behavior illustrates the user's nuanced approach to content, emphasizing originality, authenticity, and artistic qualities like engaging presentation. Their feedback consistently conveys a critical perspective on narrative fidelity, reflecting profound human experiences and complex relationships, regardless of the medium.",
  "metrics": {
    "rouge1_f": 0.03340234644582471,
    "rouge2_f": 0.003037415435592986,
    "rougeL_f": 0.018771566597653555,
    "meteor": 0.009379100941049082,
    "bleu1": 1.359272221806557e-19,
    "bleu2": 4.921073263384228e-20,
    "bleu3": 6.61183141936854e-21,
    "bleu4": 2.4265334075705086e-21,
    "bertscore_precision": 0.3180539011955261,
    "bertscore_recall": 0.5186944603919983,
    "bertscore_f1": 0.3943187892436981
  }
}