{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/06/18\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Nankin', 'Allan Kroeker', 'Andy Wolk', 'Allan Arkush', 'Larry Shaw', 'Omar Madha', 'Scott Stewart', 'Mairzee Almas', 'Félix Enríquez Alcalá', 'Todd Slavkin'], 'Starring': ['Grant Bowler', 'Julie Benz', 'Tony Curran'], 'Studio': ['Syfy']}\nReview Text: Great show\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "2CELLOS (Sulic & Hauser) Live at Arena Zagreb\n2CELLOS (Sulic & Hauser)  (Actor),     Kristijan Burlovic  (Director)    Rated:    G    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['2CELLOS new DVD, Live at Arena Zagreb, is an exhilarating live performance filmed in their Croatian homeland to a sold-out audience of over 25,000 fans. Accompanied by the Zagreb Philharmonic Orchestra, the concert includes songs from their self titled debut album as well as their internationally acclaimed second release, IN2ITION. The DVD features 2CELLOS\\' massive YouTube hits, \"Smooth Criminal\" and \"Welcome to the Jungle,\" along with a trio of their popular renditions of AC/DC songs \"Back in Black,\" \"You Shook Me All Night Long\" and \"Highway to Hell.\" Rounding out the set are their unique covers of songs from Jimi Hendrix, Coldplay, U2, Red Hot Chili Peppers, Nirvana and Sting plus classical repertoire that showcases their unsurpassed virtuosity. Also included is a bonus Behind-the- Scenes feature. Track listing:1.Benedictus (Live)2.Elegie in C Minor, Op. 24 (Live)3.Gabriel\\'s Oboe (Live)4.Oblivion (Live)5.Welcome to the Jungle (Live)6.Purple Haze (Live)7.Resistance (Live)8.Californication (Live)9.With Or Without You (Live)10.Where The Streets Have No Name (Live)11.Viva La Vida (Live)12.Human Nature (Live)13.Smooth Criminal (Live)14.You Shook Me All Night Long (Live)15.Highway to Hell (Live)16.Back In Black (Live)17.When I Come Around (Live)18.Smells Like Teen Spirit (Live)19.Fields of Gold (Live)20.Hurt (Live)21.End Credits22.Live at Arena Zagreb: Behind the Scenes']\n{'Genre': 'Classical', 'Format': 'Multiple Formats, Color, PAL, Import, Classical', 'Contributor': '2CELLOS (Sulic & Hauser), Kristijan Burlovic', 'Language': 'Italian (Dolby Digital 5.1), Czech (DTS 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': 'Unknown', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '3.07 x 0.67 x 7.48 inches; 2.68 Ounces', 'Director': 'Kristijan Burlovic', 'Media Format': 'Multiple Formats, Color, PAL, Import, Classical', 'Run time': '1 hour and 19 minutes', 'Release date': 'November 5, 2013', 'Actors': '2CELLOS (Sulic & Hauser)', 'Subtitles': 'Italian', 'Studio': 'Sony', 'Number of discs': '1'}\nI found 2 Cellos music on Youtube, or rather my son found it for me.  I like this music very much and bought this to enjoy them more.\nVery nice\nQuantum of Solace (Blu-Ray + DVD Combo)\nDaniel Craig  (Actor),     Mathieu Amalric  (Actor),     Marc Forster  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Betrayed by Vesper, the woman he loved, 007 fights the urge to make his latest mission personal. Pursuing his determination to uncover the truth, Bond and M (JUDI DENCH) interrogate Mr. White (JESPER CHRISTENSEN) who reveals the organization which blackmailed Vesper is far more complex and dangerous than anyone had imagined.Forensic intelligence links an Mi6 traitor to a bank account in Haiti where a case of mistaken identity introduces Bond to the beautiful but feisty Camille (OLGA KURYLENKO), a woman who has her own vendetta. Camille leads Bond straight to Dominic Greene (MATHIEU AMALRIC), a ruthless business man and major force within the mysterious organization.On a mission that leads him to Austria, Italy and South America, Bond discovers that Greene, conspiring to take total control of one of the world's most important natural resources, is forging a deal with the exiled General Medrano (JOAQUIN COSIO). Using his associates in the organization, and manipulating his powerful contacts within the CIA and the British government, Greene promises to overthrow the existing regime in a Latin American country, giving the General control of the country in exchange for a seemingly barren piece of land.In a minefield of treachery, murder and deceit, Bond allies with old friends in a battle to uncover the truth. As he gets closer to finding the man responsible for the betrayal of Vesper, 007 must keep one step ahead of the CIA, the terrorists and even M, to unravel Greene's sinister plan and stop his organization.\"]\n{'Format': 'Multiple Formats, Blu-ray, Widescreen, Color, Dolby, DTS Surround Sound, Dubbed', 'Contributor': 'Olga Kurylenko, Tim Pigott-Smith, Mathieu Amalric, Giancarlo Giannini, Gemma Arterton, Anatole Taubman, Judi Dench, Joaquín Cosio, Jesper Christensen, David Harbour, Jeffrey Wright, Rory Kinnear, Marc Forster, Daniel CraigOlga Kurylenko, Tim Pigott-Smith, Mathieu Amalric, Giancarlo Giannini, Gemma Arterton, Anatole Taubman, Judi Dench, Joaquín Cosio, Jesper Christensen, David Harbour, Jeffrey Wright, Rory Kinnear, Marc Forster, Daniel Craig  See more', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD)', 'Runtime': '1 hour and 46 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.3 x 0.5 x 6.7 inches; 1.6 Ounces', 'Director': 'Marc Forster', 'Media Format': 'Multiple Formats, Blu-ray, Widescreen, Color, Dolby, DTS Surround Sound, Dubbed', 'Run time': '1 hour and 46 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Daniel Craig, Mathieu Amalric, Giancarlo Giannini, Judi Dench, Olga Kurylenko', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '2'}\nGreat movie.  Daniel Craig makes an excellent James Bond.  Great deal getting a combo pack too.  I hope Craig makes more Bond flicks.\nGreat\nCasino Royale (Blu-ray + DVD)\nDaniel Craig  (Actor),     Eva Green  (Actor),     Martin Campbell  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"James Bond's first 007 mission takes him to Madagascar, where he is to spy on a terrorist Mollaka. Not everything goes as planned and Bond decides to investigate, independently of the MI6 agency, in order to track down the rest of the terrorist cell. Following a lead to the Bahamas, he encounters Dimitrios and his girlfriend, Solange. He learns that Dimitrios is involved with Le Chiffre, banker to the world's terrorist organizations. Secret Service intelligence reveals that Le Chiffre is planning to raise money in a high-stakes poker game in Montenegro at Le Casino Royale. MI6 assigns 007 to play against him, knowing that if Le Chiffre loses, it will destroy his organization. 'M' places Bond under the watchful eye of the beguiling Vesper Lynd. At first skeptical of what value Vesper can provide, Bond's interest in her deepens as they brave danger together--and even torture at the hands of Le Chiffre. In Montenegro, Bond allies himself with Matthis, MI6's local field agent, and Felix Leiter, who is representing the interests of the CIA. The marathon game proceeds with dirty tricks and violence, raising the stakes beyond blood money and reaching a terrifying climax.\"]\n{'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen', 'Contributor': 'Eva Green, Jesper Christensen, Mads Mikkelsen, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Jeffrey Wright, Caternia Murino, Isaach De Bankolé, Judi Dench, Daniel CraigEva Green, Jesper Christensen, Mads Mikkelsen, Giancarlo Giannini, Ivana Milicevic, Simon Abkarian, Martin Campbell, Jeffrey Wright, Caternia Murino, Isaach De Bankolé, Judi Dench, Daniel Craig  See more', 'Language': 'English (DTS 5.1), French (Mono), Spanish (Mono)', 'Runtime': '2 hours and 24 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.3 x 0.5 x 6.7 inches; 2.4 Ounces', 'Director': 'Martin Campbell', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen', 'Run time': '2 hours and 24 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Daniel Craig, Eva Green, Judi Dench, Mads Mikkelsen, Jeffrey Wright', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nGreat movie.  Daniel Craig makes an excellent James Bond.  Great deal getting a combo pack too.  I hope Craig makes more Bond flicks.\nGreat\nSkyfall\nDaniel Craig  (Actor),     Judi Dench  (Actor),     Sam Mendes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"Daniel Craig is back as James Bond 007 in Skyfall, the 23rd adventure in the longest-running film franchise of all time. In Skyfall, Bond's loyalty to M is tested as her past comes back to haunt her. As MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Javier Bardem, Sam Mendes, Albert Finney, Naomie Harris, Rory Kinnear, Judi Dench, Ralph Fiennes, Berenice Marlohe, Ben Whishaw, Daniel CraigJavier Bardem, Sam Mendes, Albert Finney, Naomie Harris, Rory Kinnear, Judi Dench, Ralph Fiennes, Berenice Marlohe, Ben Whishaw, Daniel Craig  See more', 'Language': 'English', 'Runtime': '2 hours and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '948197', 'Director': 'Sam Mendes', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 23 minutes', 'Release date': 'February 12, 2013', 'Actors': 'Daniel Craig, Judi Dench, Javier Bardem, Ralph Fiennes, Naomie Harris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish, Bambara', 'Studio': 'Twentieth Century Fox', 'Number of discs': '1'}\nGreat movie.  Daniel Craig makes an excellent James Bond.  Great deal getting a combo pack too.  I hope Craig makes more Bond flicks.\nGreat\nThe Prince\nSuspense, Action, Compelling, Intense\n['HD. The past catches up to a retired assassin who is forced to get back in the violence game after his daughter is kidnapped.']\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian A. Miller'], 'Producers': ['Randall Emmett', 'George Furla', 'Adam Goldwork'], 'Starring': ['Jason Patric', 'Bruce Willis', 'John Cusack']}\nGood flick, although I prefer the leading stars to be &#34;good&#34; guys.\nFour Stars\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Nankin', 'Allan Kroeker', 'Andy Wolk', 'Allan Arkush', 'Larry Shaw', 'Omar Madha', 'Scott Stewart', 'Mairzee Almas', 'Félix Enríquez Alcalá', 'Todd Slavkin'], 'Starring': ['Grant Bowler', 'Julie Benz', 'Tony Curran'], 'Studio': ['Syfy']}\nGreat show\nFive Stars",
  "profile": "**User Profile Summary**\n\n- **Music Preference**: The user maintains a strong appreciation for classical crossover genres, particularly cello performances. They enjoy unique interpretations and high-energy performances, with a keen interest in live music experiences.\n\n- **Content Consumption**: The user engages predominantly with music through online platforms, especially YouTube, while also expanding their interests into film. Their recent purchases indicate a preference for series and films featuring intense themes, compelling narratives, and high production value. They are particularly drawn to suspenseful and action-packed content.\n\n- **Family Influence**: Family involvement continues to play a significant role in music and film discovery, fostering collaborative interests in both entertainment domains.\n\n- **Purchase Motivation**: The user is motivated by a desire to support favorite artists and actors while seeking value in bundled deals. Their recent acquisitions suggest a growing preference for shows with morally complex characters and immersive storytelling.\n\n- **Overall Attitude**: The user exhibits enthusiastic engagement with music and film, as reflected in their high ratings and positive reviews. They appreciate quality performances and the emotional impact of storytelling, with an inclination towards narratives that feature intense themes. Their recent reviews suggest a nuanced appreciation for shows that combine emotional depth with engaging plotlines, highlighting their investment in immersive entertainment experiences across both music and film mediums.",
  "metrics": {
    "rouge1_f": 0.0989888238424694,
    "rouge2_f": 0.006393180607352158,
    "rougeL_f": 0.045769026077700906,
    "meteor": 0.029101140222100336,
    "bleu1": 9.229642871338421e-05,
    "bleu2": 2.3488012881085534e-05,
    "bleu3": 3.8068863713633608e-06,
    "bleu4": 1.5340818183879447e-06,
    "bertscore_precision": 0.3261559009552002,
    "bertscore_recall": 0.4687421917915344,
    "bertscore_f1": 0.3846607208251953
  }
}