{
  "user_id": "AHRUV3HZFPZEPRWEMSYMVBAJXFFQ",
  "summary": "=== Purchase Information ===\nProduct Title: Workman's Friend Ultimate Hand Care Bundle\nReview Date: 2020/02/12\nStore: WORKMAN'S FRIEND\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '9 x 4.5 x 2.3 inches; 1.3 Pounds', 'UPC': '023857030709'}\nReview Text: These have very little odor. They include a lot of currently popular natural ingredients along with a few ingredients not favored by those most into that kind of thing.<br /><br />Barrier<br /><br />It isn't quite like a protective glove. Probably does help with protection for a limited time, not a whole day of work with your hands, during which it gets absorbed, wiped away, worked out by other substances and so on. Takes a couple minutes to soak in, but it's not very greasy once it does.<br /><br />Active ingredient: dimethicone.<br />Inactive ingredients: deionized water, stearic acid, propylene glycol, glyceryl stearate, isopropyl palmitate, Ricinus communis (castor) seed oil, cyclopentasiloxane, phenoxyethanol, ethylhexyglycerin, sodium hydroxide, mineral oil, Simmondsia chinensis (jojoba) seed oil, xanthan gum, disodium EDTA, acrylates copolymer, Aloe barbadensis leaf extract.<br /><br />Hand cleaner<br /><br />Looks like it has plenty of charcoal, it's so dark, but more of the grit--and it's very gritty--is from pumice than charcoal. Does't foam, cleans surprisingly well anyway, moisturizes a little.<br /><br />Ingredients: aloe leaf juice, pumice, glycerin, sunflower seed oil, sorbitol, carbon [that's the charcoal], grape seed oil, lanolin oil, vitamin E acetate, xanthan gum, carbomer, 2-phenoxyethanol, ethylhexylglycerin, sodium hydroxide.<br /><br />Hand cream<br /><br />Not a heavy-duty cream but has some nice stuff in it that's thought to help with skin health, moisturizes for a while.<br /><br />Ingredients: water, glycerin, stearic acid, dimethicone, sunflower seed oil, cetearyl alcohol, ceteareth-20, allantoin, petrolatum, hydroxyethylcellulose, aloe vera, Symphytum officinale (comfrey) rhizome/root extract, Calendula officinalis oil, tocopherol, diazolidinyl urea, iodopropynyl butylcarbamate, acrylates/C10-30 alkyl acrylate crosspolymer, sodium hydroxide.<br /><br />Workman's Friend is a brand about two years old based in Texas. The hand cream and soap are made in the US, the barrier is made in Canada.\nReview Title: Ingredients\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Type:A - Aluminum Free Deodorant for Men – Trailblazer- Unscented, Spice & Forest – Sweat Activated Technology, Natural Ingredients, Non-Toxic, Paraben Free, Non-Irritating, 2.8 Ounce (3 Pack)\nReview Date: 2020/02/18\nStore: type:A\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Type:A', 'Item Form': 'Cream', 'Scent': 'Unscented', 'Unit Count': '3.00 Count', 'Item Volume': '2.8 Fluid Ounces', 'Package Dimensions': '6.8 x 5 x 0.5 inches; 9.59 Ounces'}\nReview Text: Type:A considers this a hybrid of natural and synthetic that's more effective than purely natural deodorants. The emphasis is on safe ingredients.<br /><br />This is the first deodorant I've tried with a cream-extrusion applicator. Took a few tries to figure out how much to use. After that it seems to work pretty well, though it's hard to tell if it's better than others I've tried. Goes on fairly dry feeling.<br /><br />As with others, it seems to me the scented ones create a better overall effect than the unscented. Masking helps.<br /><br />The Evergreen Forest (Adventurer) scent is very much what the name implies, much like pine sap, fairly strong when going on, not as noticeable later. I love that smell, but I've heard some don't.<br /><br />Modern Spice (Maverick) is indeed spicy. I mainly smell something cinnamony, but there's no cinnamon in it. Maybe the balsam. There's also eucalyptus, patchouli, vanilla, cedar and peppermint.<br /><br />The Fragrance-Free (Minimalist) does have a scent, no doubt due to some of the plant ingredients. It's a dull earthy, slightly spicy scent.<br /><br />Here are the ingredients for each:<br /><br />Adventurer: diisopropyl adipate, glycerin (organic, vegetable derived), beeswax, dimethicone, heptyl undecylenate, Maranta arundinacea (arrowroot) root powder, sodium bicarbonate, Zea mays (corn) starch, triethyl citrate, sorbitan oleate, Copernicia cerifera (carnauba) wax, glyceryl stearate, Cocos nucifera (coconut) oil (organic), tapioca starch, Aloe barbadensis (aloe vera) leaf extract (organic), Thuja occidentalis (northern white cedar) leaf oil, Thuja plicata (western red cedar) wood oil, Abies sibirica (siberian fir) oil, Eucalyptus globulus (eucalyptus) leaf oil, Pogostemon cablin (patchouli) oil, Pelargonium graveolens (geranium) oil, Lavandula hybrida (lavandin) oil, Canarium luzonicum (elemi) gum nonvolatiles, raspberry ketone, Mentha piperita (peppermint) oil, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.<br /><br />Maverick: diisopropyl adipate, glycerin (organic, vegetable derived), beeswax, dimethicone, heptyl undecylenate, Maranta arundinacea (arrowroot) root powder, sodium bicarbonate, Zea mays (corn) starch, triethyl citrate, sorbitan oleate, Copernicia cerifera (carnauba) wax, glyceryl stearate, Cocos nucifera (coconut) oil (organic), tapioca starch, Aloe barbadensis (aloe vera) leaf extract, Eucalyptus globulus (eucalyptus) leaf oil, Pogostemon cablin (patchouli) leaf extract, vanillin, Myroxylon pereirae (Peru balsam) oil, Vetiveria zizanoides (vetiver) root oil, Juniperis virginiana (Virginia red cedar) oil, Mentha piperita (peppermint) oil, Cistus ladaniferus (rock rose) oil, Dipteryx odorata [tonka bean] seed extract, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.<br /><br />Minimalist: diisopropyl adipate, glycerin (organic, vegetable derived), dimethicone, beeswax, heptyl undecylenate, sodium bicarbonate, Maranta arundinacea (arrowroot) powder, sorbitan oleate, Zea mays (corn) starch, Copernicia cerifera (carnauba) wax, triethyl citrate, glyceryl stearate, Cocos nucifera (coconut) oil (organic), zeolite, tapioca starch, Aloe barbadensis (aloe vera) leaf extract, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.\nReview Title: Ingredients for all three currently offered in this listing\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cleancult Soap Dispenser with Pump, 12oz Frosted Glass Refillable Bottle with Non-Slip Grip, Pre filled with Natural Liquid Handsoap, Lavender Scent, Eco Friendly\nReview Date: 2020/02/28\nStore: Cleancult\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '11 x 6 x 5 inches; 2.15 Pounds', 'UPC': '733447759506'}\nReview Text: The frosted glass looks good. The color of the plastic and silicone parts is darker than in photos, though. Judging from the website it's supposed to be off-white, actually called \"classic linen,\" but the ones they sent out seem to be more beige. If that doesn't suit, there's also a \"midnight blue\" color available, which is a sort of medium gray blue judging from the photos (which may or may not be reliable).<br /><br />Or you can take the silicone skirt off this--it's made so it's removable, good for occasional cleaning--and replace the push top with whatever color you want. It's a standard size. I think it looks better without the skirt even with the beige top. Just be careful not to break the bottle. It feels pretty sturdy.<br /><br />The scent of the soap is lavender with citrus. (Not coconut--that's in the photo because it's where some of the saponified oil comes from.)<br /><br />It washes well, doesn't leave any noticeable residue for me, though I suppose the aloe juice is intended to moisturize some.<br /><br />It comes oddly over-packaged but in cardboard that can be recycled or biodegraded.<br /><br />The ingredients given at the website are:<br /><br />Saponified coconut oil, saponified olive oil, potassium soap, aloe juice, citric acid, sodium chloride (table salt), natural essential oil blend, vitamin E.<br /><br />It's not clear why potassium soap is listed separately from the saponified oils, since that's what potassium soap is, oils turned into soap by the addition of potassium hydroxide (potash).\nReview Title: Color, ingredients\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Keratin Secrets Keratin Infused Shampoo and Conditioner Duo 12 Ounce\nReview Date: 2020/03/18\nStore: Keratin Secrets\nAverage Rating: 3.4\nProduct Details: {'Item Form': 'Liquid', 'Brand': 'Keratin Secrets', 'Hair Type': 'All,Color Treated', 'Number of Items': '2', 'Unit Count': '2.00 Count', 'Package Dimensions': '8.31 x 4.41 x 3.9 inches; 12 Ounces', 'Item model number': 'KS SHAMPOO COND DUO 12OZ', 'UPC': '853031008282'}\nReview Text: A lot of the early reviews for this are going to be negative because they shipped the way-too-thick conditioner with a pump-top that doesn't work with it. They should have made it less thick, or shipped it in a wide-mouth jar you could scoop it out of like face cream, but since they didn't, the easiest thing is to switch the lids. The pump-top works fine on the shampoo. The press-open top on the conditioner is still a bother, but turning it upside down and rapping it on something to drive the conditioner to the opening does work. Don't break it.<br /><br />Supposing they'll fix this, how's the shampoo and conditioner?<br /><br />Well, speaking of face cream, the first thing I noticed was the unusual fragrance. Unusual for shampoo and conditioner, I mean. It reminds me of some face and other skin creams, sweet and vaguely flowery. It's light and pleasant enough, though some men may want something more traditional for them. And possibly those with extra-sensitive noses may be able to detect the garlic in the shampoo. (Yes, garlic. There are actually garlic shampoos, with a lot more garlic than here, some of which claim not to smell like garlic.) No garlic in the conditioner.<br /><br />The shampoo is thick and lathers well and cleans well.<br /><br />The ultra-thick conditioner, once you manage to get it on your hair, is fine, leaves my hair soft and combable.<br /><br />The ingredients (given below) look fairly conventional for the most part, a mix of synthetic and natural. For the shampoo, the collagen is the 17th ingredient by weight, so under 6% (probably far less), and the keratin is 28th, under 4% (probably far less). For the conditioner, the keratin is the 12th ingredient, meaning it could be as much as 8% (though again probably far less). For all I know that's plenty for what they're supposed to do.<br /><br />There's a lot of plant stuff in the shampoo, some only given in Latin, so here's the translation of the rest. Besides the acai, Matricaria (German chamomile), echinacea, garlic, lemon, sage, and spirulina, the shampoo has:<br /><br />Argania spinosa = argan<br />Symphytum officinale = comfrey<br />Trigonella foenum-graecum = fenugreek<br />Quercus alba = white oak<br />Viola tricolor = viola, or Johnny jumpup<br /><br />The conditioner also has some argan and acai, and adds:<br /><br />Fucus vesiculosus = bladderwrack (a seaweed)<br /><br />Some people prefer not to have the amodimethicone, here in both the shampoo and conditioner, a silicone some say is hard to rinse out, though others praise it for its conditioning effects particularly with bleached hair and for its limited buildup.<br /><br />Similarly, there's dimethicone in the conditioner, which some find to build up over time, while others don't seem to notice any trouble with that and enjoy its conditioning and emollient qualities.<br /><br />The silicone quaternium-16 is supposed to be a good silicone for rinsing out.<br /><br />For the conditioner, keep in mind that cetearyl alcohol, cetyl alcohol, and stearyl alcohol are fatty substances, not at all like the alcohol used for drinking or rubbing. They won't dry out your hair, just the opposite.<br /><br />Shampoo: Water, disodium laureth sulfosuccinate, glycerin, acrylates copolymer, cocamidopropyl hydroxysultaine, sodium cocoyl isethionate, fragrance, cocamidopropyl betaine, sodium cocoamphoacetate, guar hydroxypropyltrimonium chloride, panthenol, glycol distearate, laureth-4, lauryl glucoside, sodium lauryl glucose carboxylate, sodium cocoyl glutamate, hydrolyzed collagen, amodimethicone, trideceth-12, cetrimonium chloride, silicone quaternium-16, undeceth-11, butyloctanol, undeceth-5, Argania spinosa kernel oil, Euterpe oleracea (Acai) fruit extract, polyquaternium-70, hydrolyzed keratin, propylene glycol, Chamomilla recutita (Matricaria) flower extract, Symphytum officinale leaf extract, Echinacea purpurea extract, Trigonella foenum-graecum fruit extract, Allium sativum (garlic) bulb extract, citrus limon (lemon) fruit extract, propolis extract, Salvia officinalis (sage) leaf extract, Spirulina maxima extract, Quercus alba bark extract, Viola tricolor extract, citric acid, phenoxyethanol, ethylhexylglycerin, tetrasodium EDTA, benzyl salicylate, coumarin, hexyl cinnamal, hydroxyisohexyl 3-cyclohexene carboxaldehyde, linalool, butylphenyl methylpropional, alpha-isomethyl ionone.<br /><br />Conditioner: Water, cetearyl alcohol, cetyl alcohol, stearyl alcohol, glycerin, polyquaternium-11, panthenol, amodimethicone, centrimonium bromide, butylene glycol, Fucus vesiculosus extract, hydrolyzed keratin, dimethicone, tocopheryl acetate, Argania spinosa kernel oil, Euterpe oleracea (Acai) fruit extract, polyquaternium-70, disodium EDTA, fragrance, phenoxyethanol, ethylhexylglycerin, benzyl salicylate, coumarin, hexyl cinnamal, hydroxyisohexyl 3-cyclohexene carboxaldehyde, linalool, butylphenyl methylpropional, alpha-isomethyl ionone.<br /><br />Each bottle came wrapped in plastic. The shampoo had strapping tape over the top. They were put together in a paper box also wrapped in plastic. No way they'd leak out in transit.\nReview Title: Step 1: switch the lids; Lots of ingredients and plant stuff in the shampoo\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Native Deodorant - Natural Deodorant For Women and Men - 3 Pack - Aluminum Free, Free of Parabens and Sulfates - Vegan, Contains Probiotics - Linen & Cotton Flower, Peony & Jasmine Tea, Sweet Almond & Honey\nReview Date: 2020/04/01\nStore: Native\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Native', 'Item Form': 'Balm', 'Scent': 'Jasmine', 'Number of Items': '3', 'Unit Count': '7.95 Ounce', 'Package Dimensions': '8.4 x 6.7 x 1.6 inches; 15.2 Ounces', 'UPC': '812154032857'}\nReview Text: There's been some distress recently over supposed fakes or the ingredients being changed, but it appears they aren't fake and haven't changed.<br /><br />I checked in the Wayback Machine, and the ingredients for the one I checked (Coconut & Vanilla) were the same at the Native website on January 2, 2019 as they are now.<br /><br />The confusion is that there are two different versions, one regular and one called \"sensitive,\" for several of the same scents (including Coconut & Vanilla), and they have very different basic ingredient lists. I've verified this at the Native website.<br /><br />Here's the basic ingredient list for the regular versions. (Some fragrance ingredients are also added for all but the unscented.)<br /><br />Caprylic/capric triglyceride, tapioca starch, ozokerite, sodium bicarbonate, magnesium hydroxide, Cocos nucifera (coconut) oil, cyclodextrin, Butyrospermium parkii (shea) butter, dextrose (glucose), Lactobacillus acidophilus.<br /><br />Here's the list for the sensitive versions:<br /><br />Caprylic/capric triglyceride, arrowroot powder, stearyl alcohol, baking soda, shea butter, coconut oil, hydrogenated castor oil, polyglycerol-3 beeswax, jojoba esters, L. acidophilus, maltodextrin, glyceryl caprylate, glyceryl undecylenate, tocopherol (vitamin E).<br /><br />I got the regular version of Peony & Jasmine Tea, Sweet Almond & Honey, and Linen & Cotton Flower. Those are sold as women's scents at the Native website, and they are quite sweet and flowery. The peony one is less strong than the other two scent-wise.<br /><br />They work fine, as these things go, pretty good for deodorizing, not designed to be anti-wet.<br /><br />They go on fairly dry, not very sticky (make sure you're dry first).<br /><br />Doesn't take a lot. No problem with stains.\nReview Title: No fakes: Two different basic ingredient lists, one regular, one \"sensitive\"\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Clipper Set, GIDIBII Luxury 18 in 1 Stainless Steel Nail Clipper Kit, Manicure Pedicure Care Tools with Portable Travel Case\nReview Date: 2020/04/10\nStore: GIDIBII\nAverage Rating: 4.4\nProduct Details: {'Brand': 'GIDIBII', 'Blade Material': 'Stainless Steel', 'Item Dimensions LxWxH': '5.8 x 3.8 x 0.8 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.8 x 3.8 x 0.8 inches; 11.99 Ounces', 'Item model number': 'Manicure Set', 'UPC': '799445199218', 'Manufacturer': 'GIDIBII'}\nReview Text: There are a couple complaints about the case, but it's actually one of the better features of this kit, attractive, nicely padded, secure, with a place for everything, though it's a test of dexterity to get some of the tools out of their place. Just keep everything where it belongs and it closes easily with a snap.<br /><br />The tools are mostly fine. They're adequately sturdy. The scissors are a little thin and flexible for tough cuts, but they're supposed to be for trimming facial hair, for which they're fine.<br /><br />The fit and finish of a few of the tools isn't the best. A couple of the nail clippers have a little overbite, where one blade doesn't perfectly align with the other, which can make for messier cuts. And a couple of the blades on the callus removers are pitted a little.<br /><br />On the whole, it's an adequate kit for nail and foot care and grooming.<br /><br />Made in China.\nReview Title: OK\nRating: 4.0\n--------------------------------------------------",
  "reference": "Workman's Friend Ultimate Hand Care Bundle\nWORKMAN'S FRIEND\n{'Package Dimensions': '9 x 4.5 x 2.3 inches; 1.3 Pounds', 'UPC': '023857030709'}\nThese have very little odor. They include a lot of currently popular natural ingredients along with a few ingredients not favored by those most into that kind of thing.<br /><br />Barrier<br /><br />It isn't quite like a protective glove. Probably does help with protection for a limited time, not a whole day of work with your hands, during which it gets absorbed, wiped away, worked out by other substances and so on. Takes a couple minutes to soak in, but it's not very greasy once it does.<br /><br />Active ingredient: dimethicone.<br />Inactive ingredients: deionized water, stearic acid, propylene glycol, glyceryl stearate, isopropyl palmitate, Ricinus communis (castor) seed oil, cyclopentasiloxane, phenoxyethanol, ethylhexyglycerin, sodium hydroxide, mineral oil, Simmondsia chinensis (jojoba) seed oil, xanthan gum, disodium EDTA, acrylates copolymer, Aloe barbadensis leaf extract.<br /><br />Hand cleaner<br /><br />Looks like it has plenty of charcoal, it's so dark, but more of the grit--and it's very gritty--is from pumice than charcoal. Does't foam, cleans surprisingly well anyway, moisturizes a little.<br /><br />Ingredients: aloe leaf juice, pumice, glycerin, sunflower seed oil, sorbitol, carbon [that's the charcoal], grape seed oil, lanolin oil, vitamin E acetate, xanthan gum, carbomer, 2-phenoxyethanol, ethylhexylglycerin, sodium hydroxide.<br /><br />Hand cream<br /><br />Not a heavy-duty cream but has some nice stuff in it that's thought to help with skin health, moisturizes for a while.<br /><br />Ingredients: water, glycerin, stearic acid, dimethicone, sunflower seed oil, cetearyl alcohol, ceteareth-20, allantoin, petrolatum, hydroxyethylcellulose, aloe vera, Symphytum officinale (comfrey) rhizome/root extract, Calendula officinalis oil, tocopherol, diazolidinyl urea, iodopropynyl butylcarbamate, acrylates/C10-30 alkyl acrylate crosspolymer, sodium hydroxide.<br /><br />Workman's Friend is a brand about two years old based in Texas. The hand cream and soap are made in the US, the barrier is made in Canada.\nIngredients\nType:A - Aluminum Free Deodorant for Men – Trailblazer- Unscented, Spice & Forest – Sweat Activated Technology, Natural Ingredients, Non-Toxic, Paraben Free, Non-Irritating, 2.8 Ounce (3 Pack)\ntype:A\n{'Brand': 'Type:A', 'Item Form': 'Cream', 'Scent': 'Unscented', 'Unit Count': '3.00 Count', 'Item Volume': '2.8 Fluid Ounces', 'Package Dimensions': '6.8 x 5 x 0.5 inches; 9.59 Ounces'}\nType:A considers this a hybrid of natural and synthetic that's more effective than purely natural deodorants. The emphasis is on safe ingredients.<br /><br />This is the first deodorant I've tried with a cream-extrusion applicator. Took a few tries to figure out how much to use. After that it seems to work pretty well, though it's hard to tell if it's better than others I've tried. Goes on fairly dry feeling.<br /><br />As with others, it seems to me the scented ones create a better overall effect than the unscented. Masking helps.<br /><br />The Evergreen Forest (Adventurer) scent is very much what the name implies, much like pine sap, fairly strong when going on, not as noticeable later. I love that smell, but I've heard some don't.<br /><br />Modern Spice (Maverick) is indeed spicy. I mainly smell something cinnamony, but there's no cinnamon in it. Maybe the balsam. There's also eucalyptus, patchouli, vanilla, cedar and peppermint.<br /><br />The Fragrance-Free (Minimalist) does have a scent, no doubt due to some of the plant ingredients. It's a dull earthy, slightly spicy scent.<br /><br />Here are the ingredients for each:<br /><br />Adventurer: diisopropyl adipate, glycerin (organic, vegetable derived), beeswax, dimethicone, heptyl undecylenate, Maranta arundinacea (arrowroot) root powder, sodium bicarbonate, Zea mays (corn) starch, triethyl citrate, sorbitan oleate, Copernicia cerifera (carnauba) wax, glyceryl stearate, Cocos nucifera (coconut) oil (organic), tapioca starch, Aloe barbadensis (aloe vera) leaf extract (organic), Thuja occidentalis (northern white cedar) leaf oil, Thuja plicata (western red cedar) wood oil, Abies sibirica (siberian fir) oil, Eucalyptus globulus (eucalyptus) leaf oil, Pogostemon cablin (patchouli) oil, Pelargonium graveolens (geranium) oil, Lavandula hybrida (lavandin) oil, Canarium luzonicum (elemi) gum nonvolatiles, raspberry ketone, Mentha piperita (peppermint) oil, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.<br /><br />Maverick: diisopropyl adipate, glycerin (organic, vegetable derived), beeswax, dimethicone, heptyl undecylenate, Maranta arundinacea (arrowroot) root powder, sodium bicarbonate, Zea mays (corn) starch, triethyl citrate, sorbitan oleate, Copernicia cerifera (carnauba) wax, glyceryl stearate, Cocos nucifera (coconut) oil (organic), tapioca starch, Aloe barbadensis (aloe vera) leaf extract, Eucalyptus globulus (eucalyptus) leaf oil, Pogostemon cablin (patchouli) leaf extract, vanillin, Myroxylon pereirae (Peru balsam) oil, Vetiveria zizanoides (vetiver) root oil, Juniperis virginiana (Virginia red cedar) oil, Mentha piperita (peppermint) oil, Cistus ladaniferus (rock rose) oil, Dipteryx odorata [tonka bean] seed extract, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.<br /><br />Minimalist: diisopropyl adipate, glycerin (organic, vegetable derived), dimethicone, beeswax, heptyl undecylenate, sodium bicarbonate, Maranta arundinacea (arrowroot) powder, sorbitan oleate, Zea mays (corn) starch, Copernicia cerifera (carnauba) wax, triethyl citrate, glyceryl stearate, Cocos nucifera (coconut) oil (organic), zeolite, tapioca starch, Aloe barbadensis (aloe vera) leaf extract, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.\nIngredients for all three currently offered in this listing\nCleancult Soap Dispenser with Pump, 12oz Frosted Glass Refillable Bottle with Non-Slip Grip, Pre filled with Natural Liquid Handsoap, Lavender Scent, Eco Friendly\nCleancult\n{'Package Dimensions': '11 x 6 x 5 inches; 2.15 Pounds', 'UPC': '733447759506'}\nThe frosted glass looks good. The color of the plastic and silicone parts is darker than in photos, though. Judging from the website it's supposed to be off-white, actually called \"classic linen,\" but the ones they sent out seem to be more beige. If that doesn't suit, there's also a \"midnight blue\" color available, which is a sort of medium gray blue judging from the photos (which may or may not be reliable).<br /><br />Or you can take the silicone skirt off this--it's made so it's removable, good for occasional cleaning--and replace the push top with whatever color you want. It's a standard size. I think it looks better without the skirt even with the beige top. Just be careful not to break the bottle. It feels pretty sturdy.<br /><br />The scent of the soap is lavender with citrus. (Not coconut--that's in the photo because it's where some of the saponified oil comes from.)<br /><br />It washes well, doesn't leave any noticeable residue for me, though I suppose the aloe juice is intended to moisturize some.<br /><br />It comes oddly over-packaged but in cardboard that can be recycled or biodegraded.<br /><br />The ingredients given at the website are:<br /><br />Saponified coconut oil, saponified olive oil, potassium soap, aloe juice, citric acid, sodium chloride (table salt), natural essential oil blend, vitamin E.<br /><br />It's not clear why potassium soap is listed separately from the saponified oils, since that's what potassium soap is, oils turned into soap by the addition of potassium hydroxide (potash).\nColor, ingredients\nKeratin Secrets Keratin Infused Shampoo and Conditioner Duo 12 Ounce\nKeratin Secrets\n{'Item Form': 'Liquid', 'Brand': 'Keratin Secrets', 'Hair Type': 'All,Color Treated', 'Number of Items': '2', 'Unit Count': '2.00 Count', 'Package Dimensions': '8.31 x 4.41 x 3.9 inches; 12 Ounces', 'Item model number': 'KS SHAMPOO COND DUO 12OZ', 'UPC': '853031008282'}\nA lot of the early reviews for this are going to be negative because they shipped the way-too-thick conditioner with a pump-top that doesn't work with it. They should have made it less thick, or shipped it in a wide-mouth jar you could scoop it out of like face cream, but since they didn't, the easiest thing is to switch the lids. The pump-top works fine on the shampoo. The press-open top on the conditioner is still a bother, but turning it upside down and rapping it on something to drive the conditioner to the opening does work. Don't break it.<br /><br />Supposing they'll fix this, how's the shampoo and conditioner?<br /><br />Well, speaking of face cream, the first thing I noticed was the unusual fragrance. Unusual for shampoo and conditioner, I mean. It reminds me of some face and other skin creams, sweet and vaguely flowery. It's light and pleasant enough, though some men may want something more traditional for them. And possibly those with extra-sensitive noses may be able to detect the garlic in the shampoo. (Yes, garlic. There are actually garlic shampoos, with a lot more garlic than here, some of which claim not to smell like garlic.) No garlic in the conditioner.<br /><br />The shampoo is thick and lathers well and cleans well.<br /><br />The ultra-thick conditioner, once you manage to get it on your hair, is fine, leaves my hair soft and combable.<br /><br />The ingredients (given below) look fairly conventional for the most part, a mix of synthetic and natural. For the shampoo, the collagen is the 17th ingredient by weight, so under 6% (probably far less), and the keratin is 28th, under 4% (probably far less). For the conditioner, the keratin is the 12th ingredient, meaning it could be as much as 8% (though again probably far less). For all I know that's plenty for what they're supposed to do.<br /><br />There's a lot of plant stuff in the shampoo, some only given in Latin, so here's the translation of the rest. Besides the acai, Matricaria (German chamomile), echinacea, garlic, lemon, sage, and spirulina, the shampoo has:<br /><br />Argania spinosa = argan<br />Symphytum officinale = comfrey<br />Trigonella foenum-graecum = fenugreek<br />Quercus alba = white oak<br />Viola tricolor = viola, or Johnny jumpup<br /><br />The conditioner also has some argan and acai, and adds:<br /><br />Fucus vesiculosus = bladderwrack (a seaweed)<br /><br />Some people prefer not to have the amodimethicone, here in both the shampoo and conditioner, a silicone some say is hard to rinse out, though others praise it for its conditioning effects particularly with bleached hair and for its limited buildup.<br /><br />Similarly, there's dimethicone in the conditioner, which some find to build up over time, while others don't seem to notice any trouble with that and enjoy its conditioning and emollient qualities.<br /><br />The silicone quaternium-16 is supposed to be a good silicone for rinsing out.<br /><br />For the conditioner, keep in mind that cetearyl alcohol, cetyl alcohol, and stearyl alcohol are fatty substances, not at all like the alcohol used for drinking or rubbing. They won't dry out your hair, just the opposite.<br /><br />Shampoo: Water, disodium laureth sulfosuccinate, glycerin, acrylates copolymer, cocamidopropyl hydroxysultaine, sodium cocoyl isethionate, fragrance, cocamidopropyl betaine, sodium cocoamphoacetate, guar hydroxypropyltrimonium chloride, panthenol, glycol distearate, laureth-4, lauryl glucoside, sodium lauryl glucose carboxylate, sodium cocoyl glutamate, hydrolyzed collagen, amodimethicone, trideceth-12, cetrimonium chloride, silicone quaternium-16, undeceth-11, butyloctanol, undeceth-5, Argania spinosa kernel oil, Euterpe oleracea (Acai) fruit extract, polyquaternium-70, hydrolyzed keratin, propylene glycol, Chamomilla recutita (Matricaria) flower extract, Symphytum officinale leaf extract, Echinacea purpurea extract, Trigonella foenum-graecum fruit extract, Allium sativum (garlic) bulb extract, citrus limon (lemon) fruit extract, propolis extract, Salvia officinalis (sage) leaf extract, Spirulina maxima extract, Quercus alba bark extract, Viola tricolor extract, citric acid, phenoxyethanol, ethylhexylglycerin, tetrasodium EDTA, benzyl salicylate, coumarin, hexyl cinnamal, hydroxyisohexyl 3-cyclohexene carboxaldehyde, linalool, butylphenyl methylpropional, alpha-isomethyl ionone.<br /><br />Conditioner: Water, cetearyl alcohol, cetyl alcohol, stearyl alcohol, glycerin, polyquaternium-11, panthenol, amodimethicone, centrimonium bromide, butylene glycol, Fucus vesiculosus extract, hydrolyzed keratin, dimethicone, tocopheryl acetate, Argania spinosa kernel oil, Euterpe oleracea (Acai) fruit extract, polyquaternium-70, disodium EDTA, fragrance, phenoxyethanol, ethylhexylglycerin, benzyl salicylate, coumarin, hexyl cinnamal, hydroxyisohexyl 3-cyclohexene carboxaldehyde, linalool, butylphenyl methylpropional, alpha-isomethyl ionone.<br /><br />Each bottle came wrapped in plastic. The shampoo had strapping tape over the top. They were put together in a paper box also wrapped in plastic. No way they'd leak out in transit.\nStep 1: switch the lids; Lots of ingredients and plant stuff in the shampoo\nNative Deodorant - Natural Deodorant For Women and Men - 3 Pack - Aluminum Free, Free of Parabens and Sulfates - Vegan, Contains Probiotics - Linen & Cotton Flower, Peony & Jasmine Tea, Sweet Almond & Honey\nNative\n{'Brand': 'Native', 'Item Form': 'Balm', 'Scent': 'Jasmine', 'Number of Items': '3', 'Unit Count': '7.95 Ounce', 'Package Dimensions': '8.4 x 6.7 x 1.6 inches; 15.2 Ounces', 'UPC': '812154032857'}\nThere's been some distress recently over supposed fakes or the ingredients being changed, but it appears they aren't fake and haven't changed.<br /><br />I checked in the Wayback Machine, and the ingredients for the one I checked (Coconut & Vanilla) were the same at the Native website on January 2, 2019 as they are now.<br /><br />The confusion is that there are two different versions, one regular and one called \"sensitive,\" for several of the same scents (including Coconut & Vanilla), and they have very different basic ingredient lists. I've verified this at the Native website.<br /><br />Here's the basic ingredient list for the regular versions. (Some fragrance ingredients are also added for all but the unscented.)<br /><br />Caprylic/capric triglyceride, tapioca starch, ozokerite, sodium bicarbonate, magnesium hydroxide, Cocos nucifera (coconut) oil, cyclodextrin, Butyrospermium parkii (shea) butter, dextrose (glucose), Lactobacillus acidophilus.<br /><br />Here's the list for the sensitive versions:<br /><br />Caprylic/capric triglyceride, arrowroot powder, stearyl alcohol, baking soda, shea butter, coconut oil, hydrogenated castor oil, polyglycerol-3 beeswax, jojoba esters, L. acidophilus, maltodextrin, glyceryl caprylate, glyceryl undecylenate, tocopherol (vitamin E).<br /><br />I got the regular version of Peony & Jasmine Tea, Sweet Almond & Honey, and Linen & Cotton Flower. Those are sold as women's scents at the Native website, and they are quite sweet and flowery. The peony one is less strong than the other two scent-wise.<br /><br />They work fine, as these things go, pretty good for deodorizing, not designed to be anti-wet.<br /><br />They go on fairly dry, not very sticky (make sure you're dry first).<br /><br />Doesn't take a lot. No problem with stains.\nNo fakes: Two different basic ingredient lists, one regular, one \"sensitive\"\nNail Clipper Set, GIDIBII Luxury 18 in 1 Stainless Steel Nail Clipper Kit, Manicure Pedicure Care Tools with Portable Travel Case\nGIDIBII\n{'Brand': 'GIDIBII', 'Blade Material': 'Stainless Steel', 'Item Dimensions LxWxH': '5.8 x 3.8 x 0.8 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.8 x 3.8 x 0.8 inches; 11.99 Ounces', 'Item model number': 'Manicure Set', 'UPC': '799445199218', 'Manufacturer': 'GIDIBII'}\nThere are a couple complaints about the case, but it's actually one of the better features of this kit, attractive, nicely padded, secure, with a place for everything, though it's a test of dexterity to get some of the tools out of their place. Just keep everything where it belongs and it closes easily with a snap.<br /><br />The tools are mostly fine. They're adequately sturdy. The scissors are a little thin and flexible for tough cuts, but they're supposed to be for trimming facial hair, for which they're fine.<br /><br />The fit and finish of a few of the tools isn't the best. A couple of the nail clippers have a little overbite, where one blade doesn't perfectly align with the other, which can make for messier cuts. And a couple of the blades on the callus removers are pitted a little.<br /><br />On the whole, it's an adequate kit for nail and foot care and grooming.<br /><br />Made in China.\nOK",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Workman's Friend Ultimate Hand Care Bundle\nReview Date: 2020/02/12\nStore: WORKMAN'S FRIEND\nAverage Rating: 4.5\nProduct Details: {'Package Dimensions': '9 x 4.5 x 2.3 inches; 1.3 Pounds', 'UPC': '023857030709'}\nReview Text: These have very little odor. They include a lot of currently popular natural ingredients along with a few ingredients not favored by those most into that kind of thing.<br /><br />Barrier<br /><br />It isn't quite like a protective glove. Probably does help with protection for a limited time, not a whole day of work with your hands, during which it gets absorbed, wiped away, worked out by other substances and so on. Takes a couple minutes to soak in, but it's not very greasy once it does.<br /><br />Active ingredient: dimethicone.<br />Inactive ingredients: deionized water, stearic acid, propylene glycol, glyceryl stearate, isopropyl palmitate, Ricinus communis (castor) seed oil, cyclopentasiloxane, phenoxyethanol, ethylhexyglycerin, sodium hydroxide, mineral oil, Simmondsia chinensis (jojoba) seed oil, xanthan gum, disodium EDTA, acrylates copolymer, Aloe barbadensis leaf extract.<br /><br />Hand cleaner<br /><br />Looks like it has plenty of charcoal, it's so dark, but more of the grit--and it's very gritty--is from pumice than charcoal. Does't foam, cleans surprisingly well anyway, moisturizes a little.<br /><br />Ingredients: aloe leaf juice, pumice, glycerin, sunflower seed oil, sorbitol, carbon [that's the charcoal], grape seed oil, lanolin oil, vitamin E acetate, xanthan gum, carbomer, 2-phenoxyethanol, ethylhexylglycerin, sodium hydroxide.<br /><br />Hand cream<br /><br />Not a heavy-duty cream but has some nice stuff in it that's thought to help with skin health, moisturizes for a while.<br /><br />Ingredients: water, glycerin, stearic acid, dimethicone, sunflower seed oil, cetearyl alcohol, ceteareth-20, allantoin, petrolatum, hydroxyethylcellulose, aloe vera, Symphytum officinale (comfrey) rhizome/root extract, Calendula officinalis oil, tocopherol, diazolidinyl urea, iodopropynyl butylcarbamate, acrylates/C10-30 alkyl acrylate crosspolymer, sodium hydroxide.<br /><br />Workman's Friend is a brand about two years old based in Texas. The hand cream and soap are made in the US, the barrier is made in Canada.\nReview Title: Ingredients\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Type:A - Aluminum Free Deodorant for Men – Trailblazer- Unscented, Spice & Forest – Sweat Activated Technology, Natural Ingredients, Non-Toxic, Paraben Free, Non-Irritating, 2.8 Ounce (3 Pack)\nReview Date: 2020/02/18\nStore: type:A\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Type:A', 'Item Form': 'Cream', 'Scent': 'Unscented', 'Unit Count': '3.00 Count', 'Item Volume': '2.8 Fluid Ounces', 'Package Dimensions': '6.8 x 5 x 0.5 inches; 9.59 Ounces'}\nReview Text: Type:A considers this a hybrid of natural and synthetic that's more effective than purely natural deodorants. The emphasis is on safe ingredients.<br /><br />This is the first deodorant I've tried with a cream-extrusion applicator. Took a few tries to figure out how much to use. After that it seems to work pretty well, though it's hard to tell if it's better than others I've tried. Goes on fairly dry feeling.<br /><br />As with others, it seems to me the scented ones create a better overall effect than the unscented. Masking helps.<br /><br />The Evergreen Forest (Adventurer) scent is very much what the name implies, much like pine sap, fairly strong when going on, not as noticeable later. I love that smell, but I've heard some don't.<br /><br />Modern Spice (Maverick) is indeed spicy. I mainly smell something cinnamony, but there's no cinnamon in it. Maybe the balsam. There's also eucalyptus, patchouli, vanilla, cedar and peppermint.<br /><br />The Fragrance-Free (Minimalist) does have a scent, no doubt due to some of the plant ingredients. It's a dull earthy, slightly spicy scent.<br /><br />Here are the ingredients for each:<br /><br />Adventurer: diisopropyl adipate, glycerin (organic, vegetable derived), beeswax, dimethicone, heptyl undecylenate, Maranta arundinacea (arrowroot) root powder, sodium bicarbonate, Zea mays (corn) starch, triethyl citrate, sorbitan oleate, Copernicia cerifera (carnauba) wax, glyceryl stearate, Cocos nucifera (coconut) oil (organic), tapioca starch, Aloe barbadensis (aloe vera) leaf extract (organic), Thuja occidentalis (northern white cedar) leaf oil, Thuja plicata (western red cedar) wood oil, Abies sibirica (siberian fir) oil, Eucalyptus globulus (eucalyptus) leaf oil, Pogostemon cablin (patchouli) oil, Pelargonium graveolens (geranium) oil, Lavandula hybrida (lavandin) oil, Canarium luzonicum (elemi) gum nonvolatiles, raspberry ketone, Mentha piperita (peppermint) oil, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.<br /><br />Maverick: diisopropyl adipate, glycerin (organic, vegetable derived), beeswax, dimethicone, heptyl undecylenate, Maranta arundinacea (arrowroot) root powder, sodium bicarbonate, Zea mays (corn) starch, triethyl citrate, sorbitan oleate, Copernicia cerifera (carnauba) wax, glyceryl stearate, Cocos nucifera (coconut) oil (organic), tapioca starch, Aloe barbadensis (aloe vera) leaf extract, Eucalyptus globulus (eucalyptus) leaf oil, Pogostemon cablin (patchouli) leaf extract, vanillin, Myroxylon pereirae (Peru balsam) oil, Vetiveria zizanoides (vetiver) root oil, Juniperis virginiana (Virginia red cedar) oil, Mentha piperita (peppermint) oil, Cistus ladaniferus (rock rose) oil, Dipteryx odorata [tonka bean] seed extract, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.<br /><br />Minimalist: diisopropyl adipate, glycerin (organic, vegetable derived), dimethicone, beeswax, heptyl undecylenate, sodium bicarbonate, Maranta arundinacea (arrowroot) powder, sorbitan oleate, Zea mays (corn) starch, Copernicia cerifera (carnauba) wax, triethyl citrate, glyceryl stearate, Cocos nucifera (coconut) oil (organic), zeolite, tapioca starch, Aloe barbadensis (aloe vera) leaf extract, zinc citrate, water, bisabolol, titanium dioxide, silver chloride.\nReview Title: Ingredients for all three currently offered in this listing\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cleancult Soap Dispenser with Pump, 12oz Frosted Glass Refillable Bottle with Non-Slip Grip, Pre filled with Natural Liquid Handsoap, Lavender Scent, Eco Friendly\nReview Date: 2020/02/28\nStore: Cleancult\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '11 x 6 x 5 inches; 2.15 Pounds', 'UPC': '733447759506'}\nReview Text: The frosted glass looks good. The color of the plastic and silicone parts is darker than in photos, though. Judging from the website it's supposed to be off-white, actually called \"classic linen,\" but the ones they sent out seem to be more beige. If that doesn't suit, there's also a \"midnight blue\" color available, which is a sort of medium gray blue judging from the photos (which may or may not be reliable).<br /><br />Or you can take the silicone skirt off this--it's made so it's removable, good for occasional cleaning--and replace the push top with whatever color you want. It's a standard size. I think it looks better without the skirt even with the beige top. Just be careful not to break the bottle. It feels pretty sturdy.<br /><br />The scent of the soap is lavender with citrus. (Not coconut--that's in the photo because it's where some of the saponified oil comes from.)<br /><br />It washes well, doesn't leave any noticeable residue for me, though I suppose the aloe juice is intended to moisturize some.<br /><br />It comes oddly over-packaged but in cardboard that can be recycled or biodegraded.<br /><br />The ingredients given at the website are:<br /><br />Saponified coconut oil, saponified olive oil, potassium soap, aloe juice, citric acid, sodium chloride (table salt), natural essential oil blend, vitamin E.<br /><br />It's not clear why potassium soap is listed separately from the saponified oils, since that's what potassium soap is, oils turned into soap by the addition of potassium hydroxide (potash).\nReview Title: Color, ingredients\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Keratin Secrets Keratin Infused Shampoo and Conditioner Duo 12 Ounce\nReview Date: 2020/03/18\nStore: Keratin Secrets\nAverage Rating: 3.4\nProduct Details: {'Item Form': 'Liquid', 'Brand': 'Keratin Secrets', 'Hair Type': 'All,Color Treated', 'Number of Items': '2', 'Unit Count': '2.00 Count', 'Package Dimensions': '8.31 x 4.41 x 3.9 inches; 12 Ounces', 'Item model number': 'KS SHAMPOO COND DUO 12OZ', 'UPC': '853031008282'}\nReview Text: A lot of the early reviews for this are going to be negative because they shipped the way-too-thick conditioner with a pump-top that doesn't work with it. They should have made it less thick, or shipped it in a wide-mouth jar you could scoop it out of like face cream, but since they didn't, the easiest thing is to switch the lids. The pump-top works fine on the shampoo. The press-open top on the conditioner is still a bother, but turning it upside down and rapping it on something to drive the conditioner to the opening does work. Don't break it.<br /><br />Supposing they'll fix this, how's the shampoo and conditioner?<br /><br />Well, speaking of face cream, the first thing I noticed was the unusual fragrance. Unusual for shampoo and conditioner, I mean. It reminds me of some face and other skin creams, sweet and vaguely flowery. It's light and pleasant enough, though some men may want something more traditional for them. And possibly those with extra-sensitive noses may be able to detect the garlic in the shampoo. (Yes, garlic. There are actually garlic shampoos, with a lot more garlic than here, some of which claim not to smell like garlic.) No garlic in the conditioner.<br /><br />The shampoo is thick and lathers well and cleans well.<br /><br />The ultra-thick conditioner, once you manage to get it on your hair, is fine, leaves my hair soft and combable.<br /><br />The ingredients (given below) look fairly conventional for the most part, a mix of synthetic and natural. For the shampoo, the collagen is the 17th ingredient by weight, so under 6% (probably far less), and the keratin is 28th, under 4% (probably far less). For the conditioner, the keratin is the 12th ingredient, meaning it could be as much as 8% (though again probably far less). For all I know that's plenty for what they're supposed to do.<br /><br />There's a lot of plant stuff in the shampoo, some only given in Latin, so here's the translation of the rest. Besides the acai, Matricaria (German chamomile), echinacea, garlic, lemon, sage, and spirulina, the shampoo has:<br /><br />Argania spinosa = argan<br />Symphytum officinale = comfrey<br />Trigonella foenum-graecum = fenugreek<br />Quercus alba = white oak<br />Viola tricolor = viola, or Johnny jumpup<br /><br />The conditioner also has some argan and acai, and adds:<br /><br />Fucus vesiculosus = bladderwrack (a seaweed)<br /><br />Some people prefer not to have the amodimethicone, here in both the shampoo and conditioner, a silicone some say is hard to rinse out, though others praise it for its conditioning effects particularly with bleached hair and for its limited buildup.<br /><br />Similarly, there's dimethicone in the conditioner, which some find to build up over time, while others don't seem to notice any trouble with that and enjoy its conditioning and emollient qualities.<br /><br />The silicone quaternium-16 is supposed to be a good silicone for rinsing out.<br /><br />For the conditioner, keep in mind that cetearyl alcohol, cetyl alcohol, and stearyl alcohol are fatty substances, not at all like the alcohol used for drinking or rubbing. They won't dry out your hair, just the opposite.<br /><br />Shampoo: Water, disodium laureth sulfosuccinate, glycerin, acrylates copolymer, cocamidopropyl hydroxysultaine, sodium cocoyl isethionate, fragrance, cocamidopropyl betaine, sodium cocoamphoacetate, guar hydroxypropyltrimonium chloride, panthenol, glycol distearate, laureth-4, lauryl glucoside, sodium lauryl glucose carboxylate, sodium cocoyl glutamate, hydrolyzed collagen, amodimethicone, trideceth-12, cetrimonium chloride, silicone quaternium-16, undeceth-11, butyloctanol, undeceth-5, Argania spinosa kernel oil, Euterpe oleracea (Acai) fruit extract, polyquaternium-70, hydrolyzed keratin, propylene glycol, Chamomilla recutita (Matricaria) flower extract, Symphytum officinale leaf extract, Echinacea purpurea extract, Trigonella foenum-graecum fruit extract, Allium sativum (garlic) bulb extract, citrus limon (lemon) fruit extract, propolis extract, Salvia officinalis (sage) leaf extract, Spirulina maxima extract, Quercus alba bark extract, Viola tricolor extract, citric acid, phenoxyethanol, ethylhexylglycerin, tetrasodium EDTA, benzyl salicylate, coumarin, hexyl cinnamal, hydroxyisohexyl 3-cyclohexene carboxaldehyde, linalool, butylphenyl methylpropional, alpha-isomethyl ionone.<br /><br />Conditioner: Water, cetearyl alcohol, cetyl alcohol, stearyl alcohol, glycerin, polyquaternium-11, panthenol, amodimethicone, centrimonium bromide, butylene glycol, Fucus vesiculosus extract, hydrolyzed keratin, dimethicone, tocopheryl acetate, Argania spinosa kernel oil, Euterpe oleracea (Acai) fruit extract, polyquaternium-70, disodium EDTA, fragrance, phenoxyethanol, ethylhexylglycerin, benzyl salicylate, coumarin, hexyl cinnamal, hydroxyisohexyl 3-cyclohexene carboxaldehyde, linalool, butylphenyl methylpropional, alpha-isomethyl ionone.<br /><br />Each bottle came wrapped in plastic. The shampoo had strapping tape over the top. They were put together in a paper box also wrapped in plastic. No way they'd leak out in transit.\nReview Title: Step 1: switch the lids; Lots of ingredients and plant stuff in the shampoo\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Native Deodorant - Natural Deodorant For Women and Men - 3 Pack - Aluminum Free, Free of Parabens and Sulfates - Vegan, Contains Probiotics - Linen & Cotton Flower, Peony & Jasmine Tea, Sweet Almond & Honey\nReview Date: 2020/04/01\nStore: Native\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Native', 'Item Form': 'Balm', 'Scent': 'Jasmine', 'Number of Items': '3', 'Unit Count': '7.95 Ounce', 'Package Dimensions': '8.4 x 6.7 x 1.6 inches; 15.2 Ounces', 'UPC': '812154032857'}\nReview Text: There's been some distress recently over supposed fakes or the ingredients being changed, but it appears they aren't fake and haven't changed.<br /><br />I checked in the Wayback Machine, and the ingredients for the one I checked (Coconut & Vanilla) were the same at the Native website on January 2, 2019 as they are now.<br /><br />The confusion is that there are two different versions, one regular and one called \"sensitive,\" for several of the same scents (including Coconut & Vanilla), and they have very different basic ingredient lists. I've verified this at the Native website.<br /><br />Here's the basic ingredient list for the regular versions. (Some fragrance ingredients are also added for all but the unscented.)<br /><br />Caprylic/capric triglyceride, tapioca starch, ozokerite, sodium bicarbonate, magnesium hydroxide, Cocos nucifera (coconut) oil, cyclodextrin, Butyrospermium parkii (shea) butter, dextrose (glucose), Lactobacillus acidophilus.<br /><br />Here's the list for the sensitive versions:<br /><br />Caprylic/capric triglyceride, arrowroot powder, stearyl alcohol, baking soda, shea butter, coconut oil, hydrogenated castor oil, polyglycerol-3 beeswax, jojoba esters, L. acidophilus, maltodextrin, glyceryl caprylate, glyceryl undecylenate, tocopherol (vitamin E).<br /><br />I got the regular version of Peony & Jasmine Tea, Sweet Almond & Honey, and Linen & Cotton Flower. Those are sold as women's scents at the Native website, and they are quite sweet and flowery. The peony one is less strong than the other two scent-wise.<br /><br />They work fine, as these things go, pretty good for deodorizing, not designed to be anti-wet.<br /><br />They go on fairly dry, not very sticky (make sure you're dry first).<br /><br />Doesn't take a lot. No problem with stains.\nReview Title: No fakes: Two different basic ingredient lists, one regular, one \"sensitive\"\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Clipper Set, GIDIBII Luxury 18 in 1 Stainless Steel Nail Clipper Kit, Manicure Pedicure Care Tools with Portable Travel Case\nReview Date: 2020/04/10\nStore: GIDIBII\nAverage Rating: 4.4\nProduct Details: {'Brand': 'GIDIBII', 'Blade Material': 'Stainless Steel', 'Item Dimensions LxWxH': '5.8 x 3.8 x 0.8 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.8 x 3.8 x 0.8 inches; 11.99 Ounces', 'Item model number': 'Manicure Set', 'UPC': '799445199218', 'Manufacturer': 'GIDIBII'}\nReview Text: There are a couple complaints about the case, but it's actually one of the better features of this kit, attractive, nicely padded, secure, with a place for everything, though it's a test of dexterity to get some of the tools out of their place. Just keep everything where it belongs and it closes easily with a snap.<br /><br />The tools are mostly fine. They're adequately sturdy. The scissors are a little thin and flexible for tough cuts, but they're supposed to be for trimming facial hair, for which they're fine.<br /><br />The fit and finish of a few of the tools isn't the best. A couple of the nail clippers have a little overbite, where one blade doesn't perfectly align with the other, which can make for messier cuts. And a couple of the blades on the callus removers are pitted a little.<br /><br />On the whole, it's an adequate kit for nail and foot care and grooming.<br /><br />Made in China.\nReview Title: OK\nRating: 4.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe person exhibits a preference for products with natural or non-toxic ingredients, favoring brands that prioritize eco-friendliness and health-conscious formulations. They consistently rate products with moderate to high effectiveness, indicating a slight tolerance for quality variances as long as the ingredients align with their values. The individual shows a pronounced inclination towards unscented options, although they enjoy certain natural scents, particularly in deodorants.\n\nTheir purchase history reveals a dual focus on personal care (hand care, deodorant, soap) and grooming (nail clippers). There is a noticeable pattern of sensitivity to product texture and application ease, suggesting a desire for user-friendly designs. Additionally, they display a price-sensitive nature but are willing to invest in premium products, primarily when derived from reputable brands.\n\nOverall, the core preferences reflect a commitment to sustainability and ingredient transparency, alongside a pragmatic approach to functionality and usability in personal care products.",
  "target_interaction": {
    "rating": 4.0,
    "title": "California Love from Armenia: Ingredients (includes a sulfate)",
    "text": "A small amount of this lathers and cleans well. Rinses away easily, doesn't seem to dry my scalp or leave my hair unruly.<br /><br />The scent is distinctly fruity, in keeping with the muscat (grape) theme, sweet but not cloying, with some citrus. I like it.<br /><br />250ml is about 8-1/2 fluid ounces, so don't expect a large container.<br /><br />The description says this has no sulfates, but the first ingredient is one. Sodium laureth sulfate, or SLES, isn't SLS, which some are trying to avoid, but it's still a sulfate, a milder one, that a few may find to be an irritant.<br /><br />Cocamidopropyl betaine was once believed to be an allergen, but it turned out it was impurities from the manufacturing process, hopefully avoided here.<br /><br />Ingredients (with corrected spellings): Sodium laureth sulfate, cocamidopropyl betaine, glycol distearate, cocodiethanolamide, trimethylcetylammonium chloride, polyquaternium-16, keratin, sodium benzoate, fragrance, citric acid.<br /><br />Manufactured in May, 2020.<br /><br />Made in Armenia.",
    "images": [],
    "asin": "B08JFF4PLP",
    "parent_asin": "B08JFF4PLP",
    "user_id": "AHRUV3HZFPZEPRWEMSYMVBAJXFFQ",
    "timestamp": "2021-01-02 01:36:00.956000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Bold Men, Shampoo 250 ml- Mens Daily Shampoo (California Love)",
    "average_rating": 4.3,
    "rating_number": 17,
    "features": [],
    "description": [],
    "price": 9.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/311EFY+mt9L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/311EFY+mt9L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61GslX63ojL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51tZ24H2wbL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51tZ24H2wbL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81b7c73CdvL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Bu9t2pKHL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Bu9t2pKHL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81qAgxpotbL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61lLpH4PaJL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/61lLpH4PaJL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/91tbCj7niEL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51nTI6qVHpL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51nTI6qVHpL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81vr7LxxSAL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51YSDjQhzgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51YSDjQhzgL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81y9y35Ft7L._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "BOLD MEN",
    "categories": [],
    "details": {
      "Brand": "BOLD MEN",
      "Item Form": "Liquid",
      "Hair Type": "Coarse, Curly",
      "Age Range (Description)": "Adult",
      "Liquid Volume": "250 Milliliters",
      "Product Dimensions": "1.97 x 1.97 x 7.48 inches; 10.23 Ounces",
      "UPC": "793611800601"
    },
    "bought_together": null
  }
}