{
  "user_id": "AGQMAOHZFQX3JMJIEND3IFN65L5Q",
  "summary": "=== Purchase Information ===\nProduct Title: Korean Face Mask - Korean Skin Care - Sano Silk Mask - All In One Pore Minimizer Anti Aging Facial Mask is the Best of K Beauty\nReview Date: 2018/07/01\nStore: Sano Naturals\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Sano Naturals', 'Scent': 'Silk', 'Skin Type': 'All', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.4 x 4.7 x 0.7 inches; 0.81 Ounces', 'UPC': '653981768157'}\nReview Text: First time user and I liked it alot. I do go to a spa to get facials regularly but it gets harder when you becomes extremely busy. I hope I could use this mask for the weeks I cannot make a trip to my spa.\nReview Title: First time user and I liked it alot\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nReview Date: 2021/09/10\nStore: Auban\nProduct Description: ['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nReview Text: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light<br /><br />Well, the first thing I noticed when I got it was that I accidentally ordered a \"Large\" cap instead of a smaller one.<br />Disappointed but I gave it a try. However, once I tried it on, I realized it might be actually better for an intended use as it could be comfortably worn while sleeping even down to cover the eyes.<br /><br />Personally, I ordered this to wear to keep my hair warm to enhance benefit of leave in conditioner (after I take a shower, put leave in conditioners and dry hair. )<br /><br />The best thing about this one is that it is such light weight that I even forgot I was wearing one while working on my computer (like you don't really feel it every second like some other thick bonnet with a tight band).<br /><br />To wear it for a long period of time, comfortableness is the most important thing to consider in my opinion and for such regard, this one gets 5 from me.<br /><br />For its durability, I will update my review accordingly if this bonnet gets torn apart easily.\nReview Title: Lightweight, comfortable to wear and even a bit stylish ? to wear around home.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vegan Face Foaming Cleanser by ATHÉ Authentic Pink Vita Foaming Cleanser 6.08oz, 180ml | Athe Foaming Cleanser | Energy of Pink Vitamin and the Peeling Effect of Konjac Jelly | Vegan Face Foaming Cleanser | Vegan Deep Cleansing | Kbeauty\nReview Date: 2021/10/13\nStore: ATHÉ\nAverage Rating: 4.7\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'Sensitive', 'Brand': 'ATHÉ', 'Material Feature': 'Natural, Vegan', 'Age Range (Description)': 'Adult'}\nReview Text: Foam is my favorite type of cleanser for all face/hand/body.<br />I especially love a gel to foam type as I feel that cleans deep into the skin.<br />So now, this is a bit different from others in that you have to invest at least 3-5 mins to use it properly. But I think that’s what makes this work so great.<br /><br />Now when you put the pink gel on your face, don’t rub it too much. Just try to gently spread the gel fast. Then just wait without re-touching them. You will feel a bit of tingling sensation and can see it turns to lots of foams.<br />Then you can wash them off with warm water, and feel a soft and clean face of yours!<br />I might be biased as I love foaming cleansers to begin with, and this one has no unpleasant smell with a pretty pink color.<br />If you have never tried foaming cleanser like this, please give this a try and follow instructions closely to see the desired effect!\nReview Title: My absolute favorite!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Terre De Mars Resonance Facial Oil, Certified Organic, Plumping and Nourishing Oil for Men and Women, Infused With Coffee and Evening Primrose Oil to Protect and Illuminate Skin, Perfect for All Skin Types, Made in France, Vegan and Cruelty Free (1 FL Oz)\nReview Date: 2021/10/21\nAverage Rating: 4.4\nProduct Details: {'Brand': 'TERRE DE MARS', 'Item Form': 'Oil', 'Active Ingredients': 'caffeine,squalane', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '1.34 x 1.34 x 4.25 inches; 2.89 Ounces'}\nReview Text: As I have oily combination skin, I don't usually use oil on my face and only use them to massage my neck or sometimes face (when it's drier condition depending on my hormonal cycle.)<br />Thus, I am not that expert on facial oil. I think this is about the 5th different oils I have tried and one thing I like about this oil is that it smells like something from my facial at spa. While I don't like any fragrance for my skin care products, this one didn't bother me ( probably because this reminds me of being at spa I guess.)<br />This oil isn't too light so it's good to massage in that if oil is too light and dry out too quickly, it's hard to use as massage oil in my case.<br />Overall, a decent one in my opinion but again I haven't had much experience with facial oils so I cannot confidently say this one is better than others in all aspects.\nReview Title: Good weight oil that makes skin barrier.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A24 Cleansing Oil - Makeup Remover, Deep Cleansing, Non-Stripping, 99.75% Natural Ingredients, Vegan Formula, Ideal for All Skin Types… (Cleansing Oil to Foam)\nReview Date: 2021/10/24\nStore: A24\nProduct Description: ['A24 Oil to Foam Cleansing Oil is a product that combines “oil and moisture balance” and “powerful cleansing”. When it comes into contact with water, it is a cleansing oil that changes from a light oil texture to a dense foam texture. Its unique transforming texture will result in a thoroughly cleansed and balanced skin to enhance efficacy of the skin care products to follow. 6 premium plant based oils are a powerful lipid soluble antioxidant to soften, moisturize and nourish the skin. It also helps remove dirt and impurities deep within pores.']\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'A24', 'Scent': 'Aloe Vera', 'Material Feature': 'Hypoallergenic', 'Package Dimensions': '7.2 x 1.7 x 1.7 inches; 8.47 Ounces', 'Manufacturer': 'A24'}\nReview Text: I requested this cleansing oil due to its claim on natural ingredients (99.75%).<br />First of all, I have an oily combination skin type that gets sensitive depending on my hormonal cycle. So naturally I have been hesitant to use any oil type skin care products on my face.<br />But I have learned that using an oily skin cleanser will not produce more oil on your skin, instead, a good oil cleanser is designed to balance and remove everything but skin's moisture.<br />So I have been searching for one to try out. Since this one is my first cleansing oil, I don’t have any experience with other cleansing oils to compare this with. So my impression about this is as a general cleansing product whether oil or otherwise.<br />The bottom line is that I liked how it worked on removing make-ups and how my skin felt afterwards. It didn’t feel heavy on my oily skin and felt soft and clean after washing my face  following this.\nReview Title: Very mild and worked out great for my oily sensitive skin.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: April22 Face Cleanser with Castile Soap\nReview Date: 2021/10/27\nStore: April22\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Oily', 'Brand': 'April22', 'Scent': 'Chocolate', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.06 x 2.05 x 2.01 inches; 7.16 Ounces', 'UPC': '850029198000'}\nReview Text: The first time using castile soap, and it feels quite different from other foaming cleansers I have used. Usually foam gives you that creamy, soft feeling while washing your hands/face. Instead, I felt everything from my skin being sucked out by this castile soap and leaves clean but rather matte feeling ( not saying it dried out my skin, but feels like nothing is left behind kind of way). . But after a min or so, the skin feels quite soft. I only got this as an extra soap on my sink for an extra bath rather than as a regular face cleanser.<br />The most important factor I always consider for my review is cost effectiveness and for the price I got (it’s $5.99 at the time of delivery), I cannot complain.<br />It’s going to stay on my wash stand as an extra cleanser.\nReview Title: Unique foaming soap, that is a cost effective choice  IMO.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: beplain Cicaful Calming Pads (60counts) | Centella Hydrating & Soothing Toner Pad | Gentle Facial Peels & Resurfacing Treatment | Daily Exfoliating For Sensitive, Acne Prone Skin | Be Plain\nReview Date: 2021/11/01\nStore: Be Plain\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '3.15 x 3.07 x 2.52 inches; 9.14 Ounces'}\nReview Text: I have tried many toner pads and this one stands out for its cost effectiveness in terms of quantity (and also quality based on its product detail page) vs price (especially the 20% off coupon offered at the time of this review).<br />The bottom line is this one seems like a decent quality calming pad that can be used not only for wiping impurities off your face like normal pads but also for calming and moisturizing skin by leaving them on your face for a while.<br /><br />However, I wouldn’t go far as gentle enough for extremely sensitive skin.<br />I have an oily combination skin that gets rather sensitive depending on my menstrual cycle.<br />Now after I first tried this pad by wiping my face (to test the first impression), I felt a tingling-like sensation and my skin felt a bit uncomfortable. Well, my skin’s sensitivity was a bit at peak due to my magic cycle, but still my skin doesn't usually respond this way to gentle skin care products.<br />I will have to wait and try after my cycle ends, but for now, this one isn’t really on top of my toner list.\nReview Title: A decent, cost effective toner pad that didn’t work for me.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SKINESQUE Wake Up and Makeup Prep facial Sheet Mask antiaging detox moisturizing Nicinamicide essence korean skin care, 30 sheet masks per container\nReview Date: 2021/11/22\nStore: SKINESQUE\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '5 x 4.2 x 2.8 inches; 1.22 Pounds', 'UPC': '855501006224'}\nReview Text: I have heard of this type of sheet mask, when it became popular as ‘1 Minute Mask’ in S.Korea a couple of years ago. I have heard many good reviews on similar ones but I have always remained a bit skeptical.<br /><br />But when this showed up on my recommended page, I was tempted to try them myself.<br />Well, this actually exceeded my expectations (which was quite low to be honest).<br /><br />First, it’s conveniently packaged into a container that you can simply pull it out of with a tweezer.<br />This mask cools down your skin after washing your face, and prep the face well for makeup.<br />If you are in a hurry in the morning to get ready, this will definitely come handy as you can skip all your skin care routines with 3 min masks.<br />You can also use it when you have to get ready for a night out and you want to prep your skin the best you can in a short amount of time for makeup.<br />If you have enough time, you can leave it around 10 mins or so, as it didn’t dry my skin out when I left it on my face a bit longer than suggested 3 mins either.<br />Of course, it won’t give your skin drastic results like $10 per sheet skin mask would, but this one is perfect for a quick fix for sure. Especially for less than $0.90 per sheet?  I would say its cost performance definitely deserves a good rating!<br /><br />Only issue I have with this mask is that I noticed the essence leaked a bit around the container when I opened the package (hence 4 stars instead of 5).\nReview Title: Cost effective, convenient way to prep your skin in a hurry.\nRating: 4.0\n--------------------------------------------------",
  "reference": "Korean Face Mask - Korean Skin Care - Sano Silk Mask - All In One Pore Minimizer Anti Aging Facial Mask is the Best of K Beauty\nSano Naturals\n{'Brand': 'Sano Naturals', 'Scent': 'Silk', 'Skin Type': 'All', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.4 x 4.7 x 0.7 inches; 0.81 Ounces', 'UPC': '653981768157'}\nFirst time user and I liked it alot. I do go to a spa to get facials regularly but it gets harder when you becomes extremely busy. I hope I could use this mask for the weeks I cannot make a trip to my spa.\nFirst time user and I liked it alot\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nAuban\n['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\n{'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light<br /><br />Well, the first thing I noticed when I got it was that I accidentally ordered a \"Large\" cap instead of a smaller one.<br />Disappointed but I gave it a try. However, once I tried it on, I realized it might be actually better for an intended use as it could be comfortably worn while sleeping even down to cover the eyes.<br /><br />Personally, I ordered this to wear to keep my hair warm to enhance benefit of leave in conditioner (after I take a shower, put leave in conditioners and dry hair. )<br /><br />The best thing about this one is that it is such light weight that I even forgot I was wearing one while working on my computer (like you don't really feel it every second like some other thick bonnet with a tight band).<br /><br />To wear it for a long period of time, comfortableness is the most important thing to consider in my opinion and for such regard, this one gets 5 from me.<br /><br />For its durability, I will update my review accordingly if this bonnet gets torn apart easily.\nLightweight, comfortable to wear and even a bit stylish ? to wear around home.\nVegan Face Foaming Cleanser by ATHÉ Authentic Pink Vita Foaming Cleanser 6.08oz, 180ml | Athe Foaming Cleanser | Energy of Pink Vitamin and the Peeling Effect of Konjac Jelly | Vegan Face Foaming Cleanser | Vegan Deep Cleansing | Kbeauty\nATHÉ\n{'Item Form': 'Cream', 'Skin Type': 'Sensitive', 'Brand': 'ATHÉ', 'Material Feature': 'Natural, Vegan', 'Age Range (Description)': 'Adult'}\nFoam is my favorite type of cleanser for all face/hand/body.<br />I especially love a gel to foam type as I feel that cleans deep into the skin.<br />So now, this is a bit different from others in that you have to invest at least 3-5 mins to use it properly. But I think that’s what makes this work so great.<br /><br />Now when you put the pink gel on your face, don’t rub it too much. Just try to gently spread the gel fast. Then just wait without re-touching them. You will feel a bit of tingling sensation and can see it turns to lots of foams.<br />Then you can wash them off with warm water, and feel a soft and clean face of yours!<br />I might be biased as I love foaming cleansers to begin with, and this one has no unpleasant smell with a pretty pink color.<br />If you have never tried foaming cleanser like this, please give this a try and follow instructions closely to see the desired effect!\nMy absolute favorite!\nTerre De Mars Resonance Facial Oil, Certified Organic, Plumping and Nourishing Oil for Men and Women, Infused With Coffee and Evening Primrose Oil to Protect and Illuminate Skin, Perfect for All Skin Types, Made in France, Vegan and Cruelty Free (1 FL Oz)\n{'Brand': 'TERRE DE MARS', 'Item Form': 'Oil', 'Active Ingredients': 'caffeine,squalane', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '1.34 x 1.34 x 4.25 inches; 2.89 Ounces'}\nAs I have oily combination skin, I don't usually use oil on my face and only use them to massage my neck or sometimes face (when it's drier condition depending on my hormonal cycle.)<br />Thus, I am not that expert on facial oil. I think this is about the 5th different oils I have tried and one thing I like about this oil is that it smells like something from my facial at spa. While I don't like any fragrance for my skin care products, this one didn't bother me ( probably because this reminds me of being at spa I guess.)<br />This oil isn't too light so it's good to massage in that if oil is too light and dry out too quickly, it's hard to use as massage oil in my case.<br />Overall, a decent one in my opinion but again I haven't had much experience with facial oils so I cannot confidently say this one is better than others in all aspects.\nGood weight oil that makes skin barrier.\nA24 Cleansing Oil - Makeup Remover, Deep Cleansing, Non-Stripping, 99.75% Natural Ingredients, Vegan Formula, Ideal for All Skin Types… (Cleansing Oil to Foam)\nA24\n['A24 Oil to Foam Cleansing Oil is a product that combines “oil and moisture balance” and “powerful cleansing”. When it comes into contact with water, it is a cleansing oil that changes from a light oil texture to a dense foam texture. Its unique transforming texture will result in a thoroughly cleansed and balanced skin to enhance efficacy of the skin care products to follow. 6 premium plant based oils are a powerful lipid soluble antioxidant to soften, moisturize and nourish the skin. It also helps remove dirt and impurities deep within pores.']\n{'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'A24', 'Scent': 'Aloe Vera', 'Material Feature': 'Hypoallergenic', 'Package Dimensions': '7.2 x 1.7 x 1.7 inches; 8.47 Ounces', 'Manufacturer': 'A24'}\nI requested this cleansing oil due to its claim on natural ingredients (99.75%).<br />First of all, I have an oily combination skin type that gets sensitive depending on my hormonal cycle. So naturally I have been hesitant to use any oil type skin care products on my face.<br />But I have learned that using an oily skin cleanser will not produce more oil on your skin, instead, a good oil cleanser is designed to balance and remove everything but skin's moisture.<br />So I have been searching for one to try out. Since this one is my first cleansing oil, I don’t have any experience with other cleansing oils to compare this with. So my impression about this is as a general cleansing product whether oil or otherwise.<br />The bottom line is that I liked how it worked on removing make-ups and how my skin felt afterwards. It didn’t feel heavy on my oily skin and felt soft and clean after washing my face  following this.\nVery mild and worked out great for my oily sensitive skin.\nApril22 Face Cleanser with Castile Soap\nApril22\n{'Item Form': 'Oil', 'Skin Type': 'Oily', 'Brand': 'April22', 'Scent': 'Chocolate', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.06 x 2.05 x 2.01 inches; 7.16 Ounces', 'UPC': '850029198000'}\nThe first time using castile soap, and it feels quite different from other foaming cleansers I have used. Usually foam gives you that creamy, soft feeling while washing your hands/face. Instead, I felt everything from my skin being sucked out by this castile soap and leaves clean but rather matte feeling ( not saying it dried out my skin, but feels like nothing is left behind kind of way). . But after a min or so, the skin feels quite soft. I only got this as an extra soap on my sink for an extra bath rather than as a regular face cleanser.<br />The most important factor I always consider for my review is cost effectiveness and for the price I got (it’s $5.99 at the time of delivery), I cannot complain.<br />It’s going to stay on my wash stand as an extra cleanser.\nUnique foaming soap, that is a cost effective choice  IMO.\nbeplain Cicaful Calming Pads (60counts) | Centella Hydrating & Soothing Toner Pad | Gentle Facial Peels & Resurfacing Treatment | Daily Exfoliating For Sensitive, Acne Prone Skin | Be Plain\nBe Plain\n{'Package Dimensions': '3.15 x 3.07 x 2.52 inches; 9.14 Ounces'}\nI have tried many toner pads and this one stands out for its cost effectiveness in terms of quantity (and also quality based on its product detail page) vs price (especially the 20% off coupon offered at the time of this review).<br />The bottom line is this one seems like a decent quality calming pad that can be used not only for wiping impurities off your face like normal pads but also for calming and moisturizing skin by leaving them on your face for a while.<br /><br />However, I wouldn’t go far as gentle enough for extremely sensitive skin.<br />I have an oily combination skin that gets rather sensitive depending on my menstrual cycle.<br />Now after I first tried this pad by wiping my face (to test the first impression), I felt a tingling-like sensation and my skin felt a bit uncomfortable. Well, my skin’s sensitivity was a bit at peak due to my magic cycle, but still my skin doesn't usually respond this way to gentle skin care products.<br />I will have to wait and try after my cycle ends, but for now, this one isn’t really on top of my toner list.\nA decent, cost effective toner pad that didn’t work for me.\nSKINESQUE Wake Up and Makeup Prep facial Sheet Mask antiaging detox moisturizing Nicinamicide essence korean skin care, 30 sheet masks per container\nSKINESQUE\n{'Package Dimensions': '5 x 4.2 x 2.8 inches; 1.22 Pounds', 'UPC': '855501006224'}\nI have heard of this type of sheet mask, when it became popular as ‘1 Minute Mask’ in S.Korea a couple of years ago. I have heard many good reviews on similar ones but I have always remained a bit skeptical.<br /><br />But when this showed up on my recommended page, I was tempted to try them myself.<br />Well, this actually exceeded my expectations (which was quite low to be honest).<br /><br />First, it’s conveniently packaged into a container that you can simply pull it out of with a tweezer.<br />This mask cools down your skin after washing your face, and prep the face well for makeup.<br />If you are in a hurry in the morning to get ready, this will definitely come handy as you can skip all your skin care routines with 3 min masks.<br />You can also use it when you have to get ready for a night out and you want to prep your skin the best you can in a short amount of time for makeup.<br />If you have enough time, you can leave it around 10 mins or so, as it didn’t dry my skin out when I left it on my face a bit longer than suggested 3 mins either.<br />Of course, it won’t give your skin drastic results like $10 per sheet skin mask would, but this one is perfect for a quick fix for sure. Especially for less than $0.90 per sheet?  I would say its cost performance definitely deserves a good rating!<br /><br />Only issue I have with this mask is that I noticed the essence leaked a bit around the container when I opened the package (hence 4 stars instead of 5).\nCost effective, convenient way to prep your skin in a hurry.",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Korean Face Mask - Korean Skin Care - Sano Silk Mask - All In One Pore Minimizer Anti Aging Facial Mask is the Best of K Beauty\nReview Date: 2018/07/01\nStore: Sano Naturals\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Sano Naturals', 'Scent': 'Silk', 'Skin Type': 'All', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.4 x 4.7 x 0.7 inches; 0.81 Ounces', 'UPC': '653981768157'}\nReview Text: First time user and I liked it alot. I do go to a spa to get facials regularly but it gets harder when you becomes extremely busy. I hope I could use this mask for the weeks I cannot make a trip to my spa.\nReview Title: First time user and I liked it alot\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nReview Date: 2021/09/10\nStore: Auban\nProduct Description: ['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nReview Text: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light<br /><br />Well, the first thing I noticed when I got it was that I accidentally ordered a \"Large\" cap instead of a smaller one.<br />Disappointed but I gave it a try. However, once I tried it on, I realized it might be actually better for an intended use as it could be comfortably worn while sleeping even down to cover the eyes.<br /><br />Personally, I ordered this to wear to keep my hair warm to enhance benefit of leave in conditioner (after I take a shower, put leave in conditioners and dry hair. )<br /><br />The best thing about this one is that it is such light weight that I even forgot I was wearing one while working on my computer (like you don't really feel it every second like some other thick bonnet with a tight band).<br /><br />To wear it for a long period of time, comfortableness is the most important thing to consider in my opinion and for such regard, this one gets 5 from me.<br /><br />For its durability, I will update my review accordingly if this bonnet gets torn apart easily.\nReview Title: Lightweight, comfortable to wear and even a bit stylish ? to wear around home.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vegan Face Foaming Cleanser by ATHÉ Authentic Pink Vita Foaming Cleanser 6.08oz, 180ml | Athe Foaming Cleanser | Energy of Pink Vitamin and the Peeling Effect of Konjac Jelly | Vegan Face Foaming Cleanser | Vegan Deep Cleansing | Kbeauty\nReview Date: 2021/10/13\nStore: ATHÉ\nAverage Rating: 4.7\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'Sensitive', 'Brand': 'ATHÉ', 'Material Feature': 'Natural, Vegan', 'Age Range (Description)': 'Adult'}\nReview Text: Foam is my favorite type of cleanser for all face/hand/body.<br />I especially love a gel to foam type as I feel that cleans deep into the skin.<br />So now, this is a bit different from others in that you have to invest at least 3-5 mins to use it properly. But I think that’s what makes this work so great.<br /><br />Now when you put the pink gel on your face, don’t rub it too much. Just try to gently spread the gel fast. Then just wait without re-touching them. You will feel a bit of tingling sensation and can see it turns to lots of foams.<br />Then you can wash them off with warm water, and feel a soft and clean face of yours!<br />I might be biased as I love foaming cleansers to begin with, and this one has no unpleasant smell with a pretty pink color.<br />If you have never tried foaming cleanser like this, please give this a try and follow instructions closely to see the desired effect!\nReview Title: My absolute favorite!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Terre De Mars Resonance Facial Oil, Certified Organic, Plumping and Nourishing Oil for Men and Women, Infused With Coffee and Evening Primrose Oil to Protect and Illuminate Skin, Perfect for All Skin Types, Made in France, Vegan and Cruelty Free (1 FL Oz)\nReview Date: 2021/10/21\nAverage Rating: 4.4\nProduct Details: {'Brand': 'TERRE DE MARS', 'Item Form': 'Oil', 'Active Ingredients': 'caffeine,squalane', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '1.34 x 1.34 x 4.25 inches; 2.89 Ounces'}\nReview Text: As I have oily combination skin, I don't usually use oil on my face and only use them to massage my neck or sometimes face (when it's drier condition depending on my hormonal cycle.)<br />Thus, I am not that expert on facial oil. I think this is about the 5th different oils I have tried and one thing I like about this oil is that it smells like something from my facial at spa. While I don't like any fragrance for my skin care products, this one didn't bother me ( probably because this reminds me of being at spa I guess.)<br />This oil isn't too light so it's good to massage in that if oil is too light and dry out too quickly, it's hard to use as massage oil in my case.<br />Overall, a decent one in my opinion but again I haven't had much experience with facial oils so I cannot confidently say this one is better than others in all aspects.\nReview Title: Good weight oil that makes skin barrier.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A24 Cleansing Oil - Makeup Remover, Deep Cleansing, Non-Stripping, 99.75% Natural Ingredients, Vegan Formula, Ideal for All Skin Types… (Cleansing Oil to Foam)\nReview Date: 2021/10/24\nStore: A24\nProduct Description: ['A24 Oil to Foam Cleansing Oil is a product that combines “oil and moisture balance” and “powerful cleansing”. When it comes into contact with water, it is a cleansing oil that changes from a light oil texture to a dense foam texture. Its unique transforming texture will result in a thoroughly cleansed and balanced skin to enhance efficacy of the skin care products to follow. 6 premium plant based oils are a powerful lipid soluble antioxidant to soften, moisturize and nourish the skin. It also helps remove dirt and impurities deep within pores.']\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'A24', 'Scent': 'Aloe Vera', 'Material Feature': 'Hypoallergenic', 'Package Dimensions': '7.2 x 1.7 x 1.7 inches; 8.47 Ounces', 'Manufacturer': 'A24'}\nReview Text: I requested this cleansing oil due to its claim on natural ingredients (99.75%).<br />First of all, I have an oily combination skin type that gets sensitive depending on my hormonal cycle. So naturally I have been hesitant to use any oil type skin care products on my face.<br />But I have learned that using an oily skin cleanser will not produce more oil on your skin, instead, a good oil cleanser is designed to balance and remove everything but skin's moisture.<br />So I have been searching for one to try out. Since this one is my first cleansing oil, I don’t have any experience with other cleansing oils to compare this with. So my impression about this is as a general cleansing product whether oil or otherwise.<br />The bottom line is that I liked how it worked on removing make-ups and how my skin felt afterwards. It didn’t feel heavy on my oily skin and felt soft and clean after washing my face  following this.\nReview Title: Very mild and worked out great for my oily sensitive skin.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: April22 Face Cleanser with Castile Soap\nReview Date: 2021/10/27\nStore: April22\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Oily', 'Brand': 'April22', 'Scent': 'Chocolate', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.06 x 2.05 x 2.01 inches; 7.16 Ounces', 'UPC': '850029198000'}\nReview Text: The first time using castile soap, and it feels quite different from other foaming cleansers I have used. Usually foam gives you that creamy, soft feeling while washing your hands/face. Instead, I felt everything from my skin being sucked out by this castile soap and leaves clean but rather matte feeling ( not saying it dried out my skin, but feels like nothing is left behind kind of way). . But after a min or so, the skin feels quite soft. I only got this as an extra soap on my sink for an extra bath rather than as a regular face cleanser.<br />The most important factor I always consider for my review is cost effectiveness and for the price I got (it’s $5.99 at the time of delivery), I cannot complain.<br />It’s going to stay on my wash stand as an extra cleanser.\nReview Title: Unique foaming soap, that is a cost effective choice  IMO.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: beplain Cicaful Calming Pads (60counts) | Centella Hydrating & Soothing Toner Pad | Gentle Facial Peels & Resurfacing Treatment | Daily Exfoliating For Sensitive, Acne Prone Skin | Be Plain\nReview Date: 2021/11/01\nStore: Be Plain\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '3.15 x 3.07 x 2.52 inches; 9.14 Ounces'}\nReview Text: I have tried many toner pads and this one stands out for its cost effectiveness in terms of quantity (and also quality based on its product detail page) vs price (especially the 20% off coupon offered at the time of this review).<br />The bottom line is this one seems like a decent quality calming pad that can be used not only for wiping impurities off your face like normal pads but also for calming and moisturizing skin by leaving them on your face for a while.<br /><br />However, I wouldn’t go far as gentle enough for extremely sensitive skin.<br />I have an oily combination skin that gets rather sensitive depending on my menstrual cycle.<br />Now after I first tried this pad by wiping my face (to test the first impression), I felt a tingling-like sensation and my skin felt a bit uncomfortable. Well, my skin’s sensitivity was a bit at peak due to my magic cycle, but still my skin doesn't usually respond this way to gentle skin care products.<br />I will have to wait and try after my cycle ends, but for now, this one isn’t really on top of my toner list.\nReview Title: A decent, cost effective toner pad that didn’t work for me.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SKINESQUE Wake Up and Makeup Prep facial Sheet Mask antiaging detox moisturizing Nicinamicide essence korean skin care, 30 sheet masks per container\nReview Date: 2021/11/22\nStore: SKINESQUE\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '5 x 4.2 x 2.8 inches; 1.22 Pounds', 'UPC': '855501006224'}\nReview Text: I have heard of this type of sheet mask, when it became popular as ‘1 Minute Mask’ in S.Korea a couple of years ago. I have heard many good reviews on similar ones but I have always remained a bit skeptical.<br /><br />But when this showed up on my recommended page, I was tempted to try them myself.<br />Well, this actually exceeded my expectations (which was quite low to be honest).<br /><br />First, it’s conveniently packaged into a container that you can simply pull it out of with a tweezer.<br />This mask cools down your skin after washing your face, and prep the face well for makeup.<br />If you are in a hurry in the morning to get ready, this will definitely come handy as you can skip all your skin care routines with 3 min masks.<br />You can also use it when you have to get ready for a night out and you want to prep your skin the best you can in a short amount of time for makeup.<br />If you have enough time, you can leave it around 10 mins or so, as it didn’t dry my skin out when I left it on my face a bit longer than suggested 3 mins either.<br />Of course, it won’t give your skin drastic results like $10 per sheet skin mask would, but this one is perfect for a quick fix for sure. Especially for less than $0.90 per sheet?  I would say its cost performance definitely deserves a good rating!<br /><br />Only issue I have with this mask is that I noticed the essence leaked a bit around the container when I opened the package (hence 4 stars instead of 5).\nReview Title: Cost effective, convenient way to prep your skin in a hurry.\nRating: 4.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThe individual's purchase history reveals a strong inclination towards skincare products with a preference for K-beauty items. They consistently favor lightweight and comfortable products, such as facial masks and hair bonnets, highlighting usability and practicality in their reviews. The user also exhibits a significant appreciation for effective cleansing methods, particularly foaming cleansers and oils that provide deep cleansing without over-drying, catering to their sensitive and oily skin. Ratings indicate a tendency to value products with good cost performance, as seen in their remarks about value for money and occasional emphasis on discounts or promotions. \n\nNatural and vegan formulations are also prevalent in the individual’s choices, reflecting a preference for cruelty-free products. While quality is prioritized, there is a balanced sensitivity to pricing, suggesting they lean towards economical options without compromising on effectiveness. Overall, their core preferences are: a focus on natural, high-quality skincare solutions, convenience for busy lifestyles, and a strong inclination towards products that promote both cosmetics and skincare efficacy.",
  "target_interaction": {
    "rating": 3.0,
    "title": "It tears easily.  Nope from me.",
    "text": "This is probably about the 100th brand I have tried for an eye mask if I exaggerate a bit.<br />I use under eye patches almost everyday, sometimes twice a day not only for under eye but also for my neck lines and forehead.<br />So I am not kidding when I say I have tried 10s of different brands of under eye patches from Amazon.<br />To be honest, under eye patches are for a rather temporary fix, in that you have to use them everyday or for a long period to have more permanent effects. But that’s how all skin care products work in my opinion. I use it to reduce very fine lines under my eyes (you can’t really see it unless you look in the mirror closely but it bugs me), and prevent my neck and forehead lines from getting worse (and hopefully to improve).<br />This one didn’t stay well at all on my neck, and I felt it dried out too quickly.<br />FYI, I don’t have dark circles, so my rate of effectiveness is solely for fine lines and such.<br />For my neck lines, I think most eye patches are at par in terms of quality, to be honest. Of course, from time to time, there are brands with quite inferior quality to others. I wouldn’t know about this one, as it kept falling off.<br />The last straw was that it just ripped apart when I tried to move the slipped mask back to the intended spot. It was annoying. After a couple of times, I just took it all off from my face.<br />The bottom line is that this product doesn’t have any price advantage to overlook its rather inferior quality compared to similar quality eye masks in this price range either.<br />I got so many other eye masks right now, I am not going to use this one unless I run out of eye masks between shipments or something (highly unlikely though).<br />Overall, 2.5/5 from me based on my experience of trying this mask for the very first time, and I won’t be recommending this.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71S+qSu1GHL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71S+qSu1GHL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71S+qSu1GHL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71TbqPZeaTL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71TbqPZeaTL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71TbqPZeaTL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71oPkdzivPL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71oPkdzivPL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71oPkdzivPL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/81f3zUXvbNL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/81f3zUXvbNL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/81f3zUXvbNL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B08CPF22H2",
    "parent_asin": "B08CPF22H2",
    "user_id": "AGQMAOHZFQX3JMJIEND3IFN65L5Q",
    "timestamp": "2021-11-30 13:18:44.176000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Gold Collagen Under Eye Patches Mask for dark circles and puffiness by Levitural - Golden Eye Bags Treatment - Mother's Day Gift for Women",
    "average_rating": 4.2,
    "rating_number": 61,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41i9SA4dTXL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41i9SA4dTXL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61oQ5LaJUDL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51hdfh69yoL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51hdfh69yoL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81mmmMzaWSL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512yjqHFy+L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/512yjqHFy+L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71EkQFamr1L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51BcRSCxBQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51BcRSCxBQL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81aU05eOOqL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Z+Md-jdWL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Z+Md-jdWL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71xeh6I7YHL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "LV Levitural",
    "categories": [],
    "details": {
      "Brand": "LV Levitural",
      "Item Form": "Mask",
      "Product Benefits": "Moisturizing,Hydration",
      "Scent": "Rose",
      "Skin Type": "Dry",
      "Package Dimensions": "3.25 x 3.25 x 1.6 inches; 5.61 Ounces",
      "UPC": "766234785310"
    },
    "bought_together": null
  }
}