{
  "user_id": "AEKZVUWFM4AVGF2JGBGPVRKKIUHA",
  "summary": "=== Purchase Information ===\nProduct Title: Everyday Beauty Glow Day Cream, Gel-to-Oil Rich Moisturizer to Minimize Signs of Aging, Reduce Redness, Dullness, and Fatigue for a Healthy Glow, 1 oz. Jar\nReview Date: 2022/08/21\nStore: Everyday Beauty\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Everyday Beauty', 'Scent': 'Rose', 'Unit Count': '1.0 Ounce', 'Number of Items': '1', 'Item Volume': '1 Fluid Ounces', 'Package Dimensions': '2.56 x 2.52 x 1.93 inches; 4.66 Ounces', 'UPC': '700463002381', 'Manufacturer': 'Cosmetic Solutions, LLC'}\nReview Text: I really like the feel of gel moisturizers when they go onto my face. There’s something about them that is super absorbent, yet extremely moisturizing. This particular cream/gel is exactly the same way. Did not leave a sticky/greasy feel/look at all on my face, it actually absorbed very quickly. It has a slight fragrant smell, nothing too extreme and it is did not irritate my skin at all. I have very sensitive skin and have to be careful about which products I use. It’s kept my face completely moisturized & glowing throughout the day.<br />My ONLY Issue with this product is the price. It’s a bit much for something that I need to use twice daily.<br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review was selected by ME & ONLY ME. The product or item is ALWAYS something that is needed and will be used in my Home🏡 & Yard 🌱🍃, or for my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST FOR ME 💁🏻‍♀️.\nReview Title: It’s more of a GEL moisturizer than a CREAM👍⭐️\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: seedling Heated Eye Mask for Dry Eyes, Eye Compress Moist Heat, Silk sleep mask for dry eye relief, Plant Extract Warm Compress for Eyes, Stye Eye Therapy Mask (Blue)\nReview Date: 2022/08/31\nStore: Seedling\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Seedling', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '1 Count', 'Item Dimensions LxWxH': '9.2 x 4.2 x 0.6 inches', 'Product Dimensions': '9.2 x 4.2 x 0.6 inches; 5.61 Ounces', 'Item model number': 'M', 'Manufacturer': 'seedling', 'Country of Origin': 'China'}\nReview Text: I have trouble every so often with my tear ducts clogging. If you’ve ever had them clogged before than you know the discomfort that comes with it. I’ve actually had a tube put in my right tear duct to clear a blockage and that is dreadful to go through. It has been recommended that I use warm/hot (not scolding) compress to help keep my tear ducts draining. I’m trying this mask to save time. It’s easier than standing at the sink and constantly warming up a wash cloths with the faucet. It’s definitely relaxing and I can feel how it is going to help me. I wear eye mask when I sleep so I’m already used to having a cover over my eyes.\nReview Title: Recommended to prevent my tear ducts clogging again👍⭐️\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Summer's Eve Spa Set for Women | Gift Box | Women's Post Shave Hydrating Serum, 1oz Tube | Cleansing Feminine Wash, 12oz Bottle\nReview Date: 2022/09/06\nStore: Summer's Eve\nProduct Description: [\"Give a special someone or pamper yourself and experience Daily Intimate Beauty with the Summer's Eve Spa gift set containing a Luxurious Cleansing Wash and an Intimate Serum. The Summer's Eve Spa Luxurious Cleansing Wash has a calming chamomile fragrance blended with essential oils. The creamy, pearly feminine wash is hypoallergenic and gynecologist tested, safe and gentle enough to use every day. Free from dyes and parabens, the wash cleanses and leaves the skin feeling pampered. Indulge in relaxation and renewal every day. The Summer's Eve Spa after shave Skin Serum was created for your most delicate intimate areas to comfortably hydrate, smooth and soften. Specifically designed to soothe delicate, freshly shaven or waxed intimate skin. 9 out of 10 women say the serum soothed skin after shaving. The serum is infused with vitamin E, coconut oil and aloe. Elevate your intimate care routine with the cleansing wash and luxurious serum from our Summer’s Eve Spa Kit for Women Gift Set.\"]\nAverage Rating: 4.2\nProduct Details: {'Item Form': 'Serum', 'Scent': 'Spa', 'Brand': \"Summer's Eve\", 'Skin Type': 'All', 'Active Ingredients': 'Lactic_acid', 'Product Dimensions': '8.87 x 2.22 x 9.32 inches; 1.34 Pounds', 'UPC': '041608002324', 'Manufacturer': 'Prestige Consumer Healthcare', 'Country of Origin': 'USA'}\nReview Text: I’ve been using Summer’s Eve Feminine Products for years. They have never caused me any irritation and always kept me feeling clean and refreshed. With this being a new product of theirs, of course I needed to try it right away.<br />Minimal scent with the Wash and Fragrance FREE for the serum. I use the wash I as I always have with the other Summer’s Eve I have. I like that this is PH-Balanced. I use the serum on my bikini area after I’ve 🪒 shaved.<br /><br />I have nothing but positive things to say about all Summer’s Eve products. I think all woman should care for their intimate areas carefully and these products are the best for that.\nReview Title: I have ALWAYS used Summer’s Eve⭐️👍\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stride Foot Cream Smoothes Rough Cracked Heels & Dry Skin –– Dematologist-Developed, Intensely Moisturizing Foot Cream with Aloe Vera, Coconut oil and Green tea\nReview Date: 2022/09/10\nStore: Stride\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Stride', 'Scent': 'Coconut', 'Active Ingredients': 'Coconut oil,green tea,vitamin e', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Package Dimensions': '3 x 3 x 2 inches; 3.99 Ounces', 'UPC': '860006643317'}\nReview Text: I definitely like the way this cream makes my feet 👣 feel. I am a particular person that does not like to have dry skin or calluses on my 👣 feet. It’s important that I have a lotion that makes my feet 👣 soft and smooth. This also has a somewhat cooling feeling to it which is nice. Occasionally in the middle of the night my feet 👣 will start getting very warm/hot and it’s very uncomfortable. Twice now I’ve been able to apply this cream and it soothes and cools my feet 👣 making them comfortable enough to be able to sleep.<br /><br />EXPIRATION DATE: 06/11/2024<br />I always check for expiration dates prior to using. This expiration date tells me the product hasn’t been sitting somewhere, but was recently produced for distribution.\nReview Title: Soothes my feels 👣\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AIIR Diamond Shampoo - Fragrance Free Shampoo for Color Treated Hair, Sulfate Free Shampoo, Organic Shampoo - Cleansing and Moisturizing Color Safe Shampoo, Hair Repair - 8 oz\nReview Date: 2022/09/17\nStore: AIIR\nAverage Rating: 4.2\nProduct Details: {'Brand': 'AIIR', 'Item Form': 'Liquid', 'Hair Type': 'Color Treated', 'Scent': 'Unscented', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.42 x 3.11 x 2.36 inches; 8 Ounces', 'UPC': '787790270065'}\nReview Text: Like that this is Fragrance Free. A gentle shampoo that thoroughly cleans my hair. Usually shampoos that throughly clean away build up will strip my hair of the natural oils and this definitely does not. It is for “COLOR TREATED” hair.<br />I also use this shampoo in combination with [[ASIN:B09TQ29M5H AIIR Diamond Hair Conditioner]]. The combination of both together leaves my hair feeling cleaning, smooth and soft. No frizzing at all.<br />It is a bit pricey, however, for a professional brand product, is does as described, and they are all priced around the same for 8oz.<br /><br />THOROUGHLY SEALED: ✅<br />One thing that is important to me is how manufacturers seal & ship their products. This was THOROUGHLY sealed as you can see from the pictures. 👍👍👍👍👍<br /><br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review was selected by ME & ONLY ME. The product or item is ALWAYS something that is needed and will be used in my Home🏡 & Yard 🌱🍃, or for my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST FOR ME 💁🏻‍♀️.\nReview Title: Left my hair Soft, Smooth & CLEANED⭐️👍\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hair Removal Device\nReview Date: 2022/10/05\nStore: Ulike\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '11.1 x 8.46 x 3.82 inches; 3.31 Pounds', 'Item model number': 'UI04', 'UPC': '768461548188'}\nReview Text: This device comes in a very nice case for storage. The protective glasses 👓 even come in a very nice case. The directions are quite detailed so there is no need for me to discuss that in this review. If you purchase this device you’ll see.<br /><br />Operating an IPL device is pretty simple if you follow the directions. It’s choosing the level, making sure you don’t miss a spot and having the patience/commitment to follow through with it to get the results you want.<br /><br />I have seen reviews under many IPL hair removal devices that says they used it for a month and they didn’t see any results. Well, it does take time. Like I said, if you are committed, patience and consistent, then any IPL device will work. This particular device recommends using ONCE a week for 12 weeks, and then once a month there after for maintenance. Most people want to see results by snapping their fingers, and that just isn’t going to happen, even if you do go to a professional, and have it done, it takes time. My advice, if you are not in the mood to take the time, don’t have the patience and or not going to be committed, then don’t get one of these devices because you would be wasting your money.<br /><br />It took about 4 weeks or 4 treatments before I really started to notice results. First noticed the hair on the underarms because it had become finer, thinner, softer hair that was growing. My bikini 👙 area had spots that the hair didn’t grow back but other spots where it was finer, thinner & softer hair. Even though I had spots with NO HAIR growing back, I still go over all the areas regardless. My left armpit has no hair growing at this time, but I still do a treatment. Once I get to the proper weeks since I first started the treatments, then and only then I will 🛑 treating areas where no hair grows.<br /><br />My legs 🦵🏼 have been frustrating but it’s definitely working. The problem is that I miss areas each time I do a treatment. There’s no way of getting the entire leg each time. I have come up with a pattern I do that helps me the best. I start at my ankle and go around my leg 🦵🏼 in a circle ⭕️ while spiraling 🌀 up my leg. I found that going up and down is when I was missing the most. Doing a spiral has helped me tremendously.<br /><br />On the days I am scheduled to do another treatment, I shave 🪒 the areas that I’m going to treat. I also exfoliate the areas using  [[ASIN:B099HDG45M Revealer Skin Exfoliator]]. Then about an half hour after I shave 🪒, I start me treatments. KEEP YOUR LEGS DRY, CLEAN AND NO LOTIONS/OILS ETC. NOTHING.<br />ALWAYS WEAR THE PROTECTIVE 👓 GLASSES!<br />Since I shave my underarms first, I start there. Underarms takes about 2 minutes each. Then I do my bikini 👙 area and then onto my legs. If I think I forgot a spot I do go back and do it, but I really try to pay attention so I don’t. Once complete I either apply [[ASIN:B0B1N8Z7BR Reviver Skin Soothing Gel]] or [[ASIN:B073WVKRBN USDA Certified Jojoba Oil]]. Both are soothing, but sometimes I feel I need a decent moisturizer and Jojoba Oil is my go to for that.<br /><br />Well, that’s how I do each treatment. I also put in my schedule/calendar📅 when I’m supposed to do my next treatment. It is time consuming, but the results are so worth it. Think off all the money you are going to save by NOT having to buy EXPENSIVE RAZORS 🪒 anymore. Not to mention the time saved in the shower 🚿.<br /><br />HOPE THIS HELPS others understand a little of how it works. 👍I feel very comfortable using this device and knew going into it, this is a commitment and requires patience.\nReview Title: I❤️the cooling tip on this device👍⭐️\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anti Wrinkles Face Neck Device, Vibration Face Massager, Triple Action Portable wrinkles remover for Skin Care, Improve, Tightening, Firm and Smooth\nReview Date: 2022/11/04\nStore: Ihelol\nProduct Description: ['【Warm Tips】When charging, charging indication will turn on and flash if there is not enough power. If it is fully charged, it will stop flashing and stay always on (Not available while charging! Does not work when charging! ) After turning on, be sure that remove the protective cover, touches the sensor and let massage head touches your skin. then the device starts vibrating.']\nAverage Rating: 3.4\nProduct Details: {'Power Source': 'Battery Powered', 'Brand': 'Ihelol', 'Special Feature': 'Heat', 'Is Cordless?': 'Yes', 'Product Grade': 'Home', 'Package Dimensions': '6.22 x 4.21 x 2.32 inches; 8.15 Ounces', 'Item model number': 'SKIN 11', 'UPC': '613965481632', 'Manufacturer': 'Ihelol'}\nReview Text: The lights, vibration, and warmth feel wonderfully on my neck and face. The vibration combined with the lights helps make my skin look alive and healthy, after just two weeks.<br /><br />HOW I USE:<br />1 - I cleanse my neck and face as I would on any day. When I say cleanse, that means washing and using toner.<br />2 - I apply [[ASIN:B073WVKRBN USDA Grade Jojoba Oil]] on my face and neck as the moisturizer I want to use with this device.<br />3 - with my neck I start at the collarbone and move up to my chin and on the back of my neck, I move up to my hairline.<br />4 - on my face I start in the middle and move outwards toward my hairline.<br /><br />The vibration starts once you pick one of the gears below and the device head is touching your skin. Also, your hand must touch one of the sensing \"rings\" on either side.<br /><br />First Gear (Green):<br />Promotes skin surface microcirculation<br />Fights edema<br />Calms skin<br /><br />Second Gear (Red):<br />Improves blood circulation<br />Eliminates wrinkles<br />Restores natural skin color<br /><br />Third Gear (Blue):<br />Tightens loose skin<br />Promotes collagen synthesis.<br />Suitable for oily and sensitive skin<br /><br />I use it for about 10 minutes on my neck and face, daily.<br /><br />GREAT PRICE & PRODUCT that is a definite match👍.<br />(The product is well made, exactly what is advertised, and is priced as it should be in MY OPINION.)<br /><br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review, I selected. The product or item is ALWAYS something that is needed and now is being used in my Home🏡 , Yard 🌱🍃, by my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST BY ME 💁🏻‍♀️.\nReview Title: Only been using for two weeks but so far…\nRating: 5.0\n--------------------------------------------------",
  "reference": "Everyday Beauty Glow Day Cream, Gel-to-Oil Rich Moisturizer to Minimize Signs of Aging, Reduce Redness, Dullness, and Fatigue for a Healthy Glow, 1 oz. Jar\nEveryday Beauty\n{'Brand': 'Everyday Beauty', 'Scent': 'Rose', 'Unit Count': '1.0 Ounce', 'Number of Items': '1', 'Item Volume': '1 Fluid Ounces', 'Package Dimensions': '2.56 x 2.52 x 1.93 inches; 4.66 Ounces', 'UPC': '700463002381', 'Manufacturer': 'Cosmetic Solutions, LLC'}\nI really like the feel of gel moisturizers when they go onto my face. There’s something about them that is super absorbent, yet extremely moisturizing. This particular cream/gel is exactly the same way. Did not leave a sticky/greasy feel/look at all on my face, it actually absorbed very quickly. It has a slight fragrant smell, nothing too extreme and it is did not irritate my skin at all. I have very sensitive skin and have to be careful about which products I use. It’s kept my face completely moisturized & glowing throughout the day.<br />My ONLY Issue with this product is the price. It’s a bit much for something that I need to use twice daily.<br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review was selected by ME & ONLY ME. The product or item is ALWAYS something that is needed and will be used in my Home🏡 & Yard 🌱🍃, or for my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST FOR ME 💁🏻‍♀️.\nIt’s more of a GEL moisturizer than a CREAM👍⭐️\nseedling Heated Eye Mask for Dry Eyes, Eye Compress Moist Heat, Silk sleep mask for dry eye relief, Plant Extract Warm Compress for Eyes, Stye Eye Therapy Mask (Blue)\nSeedling\n{'Brand': 'Seedling', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '1 Count', 'Item Dimensions LxWxH': '9.2 x 4.2 x 0.6 inches', 'Product Dimensions': '9.2 x 4.2 x 0.6 inches; 5.61 Ounces', 'Item model number': 'M', 'Manufacturer': 'seedling', 'Country of Origin': 'China'}\nI have trouble every so often with my tear ducts clogging. If you’ve ever had them clogged before than you know the discomfort that comes with it. I’ve actually had a tube put in my right tear duct to clear a blockage and that is dreadful to go through. It has been recommended that I use warm/hot (not scolding) compress to help keep my tear ducts draining. I’m trying this mask to save time. It’s easier than standing at the sink and constantly warming up a wash cloths with the faucet. It’s definitely relaxing and I can feel how it is going to help me. I wear eye mask when I sleep so I’m already used to having a cover over my eyes.\nRecommended to prevent my tear ducts clogging again👍⭐️\nSummer's Eve Spa Set for Women | Gift Box | Women's Post Shave Hydrating Serum, 1oz Tube | Cleansing Feminine Wash, 12oz Bottle\nSummer's Eve\n[\"Give a special someone or pamper yourself and experience Daily Intimate Beauty with the Summer's Eve Spa gift set containing a Luxurious Cleansing Wash and an Intimate Serum. The Summer's Eve Spa Luxurious Cleansing Wash has a calming chamomile fragrance blended with essential oils. The creamy, pearly feminine wash is hypoallergenic and gynecologist tested, safe and gentle enough to use every day. Free from dyes and parabens, the wash cleanses and leaves the skin feeling pampered. Indulge in relaxation and renewal every day. The Summer's Eve Spa after shave Skin Serum was created for your most delicate intimate areas to comfortably hydrate, smooth and soften. Specifically designed to soothe delicate, freshly shaven or waxed intimate skin. 9 out of 10 women say the serum soothed skin after shaving. The serum is infused with vitamin E, coconut oil and aloe. Elevate your intimate care routine with the cleansing wash and luxurious serum from our Summer’s Eve Spa Kit for Women Gift Set.\"]\n{'Item Form': 'Serum', 'Scent': 'Spa', 'Brand': \"Summer's Eve\", 'Skin Type': 'All', 'Active Ingredients': 'Lactic_acid', 'Product Dimensions': '8.87 x 2.22 x 9.32 inches; 1.34 Pounds', 'UPC': '041608002324', 'Manufacturer': 'Prestige Consumer Healthcare', 'Country of Origin': 'USA'}\nI’ve been using Summer’s Eve Feminine Products for years. They have never caused me any irritation and always kept me feeling clean and refreshed. With this being a new product of theirs, of course I needed to try it right away.<br />Minimal scent with the Wash and Fragrance FREE for the serum. I use the wash I as I always have with the other Summer’s Eve I have. I like that this is PH-Balanced. I use the serum on my bikini area after I’ve 🪒 shaved.<br /><br />I have nothing but positive things to say about all Summer’s Eve products. I think all woman should care for their intimate areas carefully and these products are the best for that.\nI have ALWAYS used Summer’s Eve⭐️👍\nStride Foot Cream Smoothes Rough Cracked Heels & Dry Skin –– Dematologist-Developed, Intensely Moisturizing Foot Cream with Aloe Vera, Coconut oil and Green tea\nStride\n{'Brand': 'Stride', 'Scent': 'Coconut', 'Active Ingredients': 'Coconut oil,green tea,vitamin e', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Package Dimensions': '3 x 3 x 2 inches; 3.99 Ounces', 'UPC': '860006643317'}\nI definitely like the way this cream makes my feet 👣 feel. I am a particular person that does not like to have dry skin or calluses on my 👣 feet. It’s important that I have a lotion that makes my feet 👣 soft and smooth. This also has a somewhat cooling feeling to it which is nice. Occasionally in the middle of the night my feet 👣 will start getting very warm/hot and it’s very uncomfortable. Twice now I’ve been able to apply this cream and it soothes and cools my feet 👣 making them comfortable enough to be able to sleep.<br /><br />EXPIRATION DATE: 06/11/2024<br />I always check for expiration dates prior to using. This expiration date tells me the product hasn’t been sitting somewhere, but was recently produced for distribution.\nSoothes my feels 👣\nAIIR Diamond Shampoo - Fragrance Free Shampoo for Color Treated Hair, Sulfate Free Shampoo, Organic Shampoo - Cleansing and Moisturizing Color Safe Shampoo, Hair Repair - 8 oz\nAIIR\n{'Brand': 'AIIR', 'Item Form': 'Liquid', 'Hair Type': 'Color Treated', 'Scent': 'Unscented', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.42 x 3.11 x 2.36 inches; 8 Ounces', 'UPC': '787790270065'}\nLike that this is Fragrance Free. A gentle shampoo that thoroughly cleans my hair. Usually shampoos that throughly clean away build up will strip my hair of the natural oils and this definitely does not. It is for “COLOR TREATED” hair.<br />I also use this shampoo in combination with [[ASIN:B09TQ29M5H AIIR Diamond Hair Conditioner]]. The combination of both together leaves my hair feeling cleaning, smooth and soft. No frizzing at all.<br />It is a bit pricey, however, for a professional brand product, is does as described, and they are all priced around the same for 8oz.<br /><br />THOROUGHLY SEALED: ✅<br />One thing that is important to me is how manufacturers seal & ship their products. This was THOROUGHLY sealed as you can see from the pictures. 👍👍👍👍👍<br /><br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review was selected by ME & ONLY ME. The product or item is ALWAYS something that is needed and will be used in my Home🏡 & Yard 🌱🍃, or for my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST FOR ME 💁🏻‍♀️.\nLeft my hair Soft, Smooth & CLEANED⭐️👍\nHair Removal Device\nUlike\n{'Package Dimensions': '11.1 x 8.46 x 3.82 inches; 3.31 Pounds', 'Item model number': 'UI04', 'UPC': '768461548188'}\nThis device comes in a very nice case for storage. The protective glasses 👓 even come in a very nice case. The directions are quite detailed so there is no need for me to discuss that in this review. If you purchase this device you’ll see.<br /><br />Operating an IPL device is pretty simple if you follow the directions. It’s choosing the level, making sure you don’t miss a spot and having the patience/commitment to follow through with it to get the results you want.<br /><br />I have seen reviews under many IPL hair removal devices that says they used it for a month and they didn’t see any results. Well, it does take time. Like I said, if you are committed, patience and consistent, then any IPL device will work. This particular device recommends using ONCE a week for 12 weeks, and then once a month there after for maintenance. Most people want to see results by snapping their fingers, and that just isn’t going to happen, even if you do go to a professional, and have it done, it takes time. My advice, if you are not in the mood to take the time, don’t have the patience and or not going to be committed, then don’t get one of these devices because you would be wasting your money.<br /><br />It took about 4 weeks or 4 treatments before I really started to notice results. First noticed the hair on the underarms because it had become finer, thinner, softer hair that was growing. My bikini 👙 area had spots that the hair didn’t grow back but other spots where it was finer, thinner & softer hair. Even though I had spots with NO HAIR growing back, I still go over all the areas regardless. My left armpit has no hair growing at this time, but I still do a treatment. Once I get to the proper weeks since I first started the treatments, then and only then I will 🛑 treating areas where no hair grows.<br /><br />My legs 🦵🏼 have been frustrating but it’s definitely working. The problem is that I miss areas each time I do a treatment. There’s no way of getting the entire leg each time. I have come up with a pattern I do that helps me the best. I start at my ankle and go around my leg 🦵🏼 in a circle ⭕️ while spiraling 🌀 up my leg. I found that going up and down is when I was missing the most. Doing a spiral has helped me tremendously.<br /><br />On the days I am scheduled to do another treatment, I shave 🪒 the areas that I’m going to treat. I also exfoliate the areas using  [[ASIN:B099HDG45M Revealer Skin Exfoliator]]. Then about an half hour after I shave 🪒, I start me treatments. KEEP YOUR LEGS DRY, CLEAN AND NO LOTIONS/OILS ETC. NOTHING.<br />ALWAYS WEAR THE PROTECTIVE 👓 GLASSES!<br />Since I shave my underarms first, I start there. Underarms takes about 2 minutes each. Then I do my bikini 👙 area and then onto my legs. If I think I forgot a spot I do go back and do it, but I really try to pay attention so I don’t. Once complete I either apply [[ASIN:B0B1N8Z7BR Reviver Skin Soothing Gel]] or [[ASIN:B073WVKRBN USDA Certified Jojoba Oil]]. Both are soothing, but sometimes I feel I need a decent moisturizer and Jojoba Oil is my go to for that.<br /><br />Well, that’s how I do each treatment. I also put in my schedule/calendar📅 when I’m supposed to do my next treatment. It is time consuming, but the results are so worth it. Think off all the money you are going to save by NOT having to buy EXPENSIVE RAZORS 🪒 anymore. Not to mention the time saved in the shower 🚿.<br /><br />HOPE THIS HELPS others understand a little of how it works. 👍I feel very comfortable using this device and knew going into it, this is a commitment and requires patience.\nI❤️the cooling tip on this device👍⭐️\nAnti Wrinkles Face Neck Device, Vibration Face Massager, Triple Action Portable wrinkles remover for Skin Care, Improve, Tightening, Firm and Smooth\nIhelol\n['【Warm Tips】When charging, charging indication will turn on and flash if there is not enough power. If it is fully charged, it will stop flashing and stay always on (Not available while charging! Does not work when charging! ) After turning on, be sure that remove the protective cover, touches the sensor and let massage head touches your skin. then the device starts vibrating.']\n{'Power Source': 'Battery Powered', 'Brand': 'Ihelol', 'Special Feature': 'Heat', 'Is Cordless?': 'Yes', 'Product Grade': 'Home', 'Package Dimensions': '6.22 x 4.21 x 2.32 inches; 8.15 Ounces', 'Item model number': 'SKIN 11', 'UPC': '613965481632', 'Manufacturer': 'Ihelol'}\nThe lights, vibration, and warmth feel wonderfully on my neck and face. The vibration combined with the lights helps make my skin look alive and healthy, after just two weeks.<br /><br />HOW I USE:<br />1 - I cleanse my neck and face as I would on any day. When I say cleanse, that means washing and using toner.<br />2 - I apply [[ASIN:B073WVKRBN USDA Grade Jojoba Oil]] on my face and neck as the moisturizer I want to use with this device.<br />3 - with my neck I start at the collarbone and move up to my chin and on the back of my neck, I move up to my hairline.<br />4 - on my face I start in the middle and move outwards toward my hairline.<br /><br />The vibration starts once you pick one of the gears below and the device head is touching your skin. Also, your hand must touch one of the sensing \"rings\" on either side.<br /><br />First Gear (Green):<br />Promotes skin surface microcirculation<br />Fights edema<br />Calms skin<br /><br />Second Gear (Red):<br />Improves blood circulation<br />Eliminates wrinkles<br />Restores natural skin color<br /><br />Third Gear (Blue):<br />Tightens loose skin<br />Promotes collagen synthesis.<br />Suitable for oily and sensitive skin<br /><br />I use it for about 10 minutes on my neck and face, daily.<br /><br />GREAT PRICE & PRODUCT that is a definite match👍.<br />(The product is well made, exactly what is advertised, and is priced as it should be in MY OPINION.)<br /><br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review, I selected. The product or item is ALWAYS something that is needed and now is being used in my Home🏡 , Yard 🌱🍃, by my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST BY ME 💁🏻‍♀️.\nOnly been using for two weeks but so far…",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Everyday Beauty Glow Day Cream, Gel-to-Oil Rich Moisturizer to Minimize Signs of Aging, Reduce Redness, Dullness, and Fatigue for a Healthy Glow, 1 oz. Jar\nReview Date: 2022/08/21\nStore: Everyday Beauty\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Everyday Beauty', 'Scent': 'Rose', 'Unit Count': '1.0 Ounce', 'Number of Items': '1', 'Item Volume': '1 Fluid Ounces', 'Package Dimensions': '2.56 x 2.52 x 1.93 inches; 4.66 Ounces', 'UPC': '700463002381', 'Manufacturer': 'Cosmetic Solutions, LLC'}\nReview Text: I really like the feel of gel moisturizers when they go onto my face. There’s something about them that is super absorbent, yet extremely moisturizing. This particular cream/gel is exactly the same way. Did not leave a sticky/greasy feel/look at all on my face, it actually absorbed very quickly. It has a slight fragrant smell, nothing too extreme and it is did not irritate my skin at all. I have very sensitive skin and have to be careful about which products I use. It’s kept my face completely moisturized & glowing throughout the day.<br />My ONLY Issue with this product is the price. It’s a bit much for something that I need to use twice daily.<br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review was selected by ME & ONLY ME. The product or item is ALWAYS something that is needed and will be used in my Home🏡 & Yard 🌱🍃, or for my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST FOR ME 💁🏻‍♀️.\nReview Title: It’s more of a GEL moisturizer than a CREAM👍⭐️\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: seedling Heated Eye Mask for Dry Eyes, Eye Compress Moist Heat, Silk sleep mask for dry eye relief, Plant Extract Warm Compress for Eyes, Stye Eye Therapy Mask (Blue)\nReview Date: 2022/08/31\nStore: Seedling\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Seedling', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '1 Count', 'Item Dimensions LxWxH': '9.2 x 4.2 x 0.6 inches', 'Product Dimensions': '9.2 x 4.2 x 0.6 inches; 5.61 Ounces', 'Item model number': 'M', 'Manufacturer': 'seedling', 'Country of Origin': 'China'}\nReview Text: I have trouble every so often with my tear ducts clogging. If you’ve ever had them clogged before than you know the discomfort that comes with it. I’ve actually had a tube put in my right tear duct to clear a blockage and that is dreadful to go through. It has been recommended that I use warm/hot (not scolding) compress to help keep my tear ducts draining. I’m trying this mask to save time. It’s easier than standing at the sink and constantly warming up a wash cloths with the faucet. It’s definitely relaxing and I can feel how it is going to help me. I wear eye mask when I sleep so I’m already used to having a cover over my eyes.\nReview Title: Recommended to prevent my tear ducts clogging again👍⭐️\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Summer's Eve Spa Set for Women | Gift Box | Women's Post Shave Hydrating Serum, 1oz Tube | Cleansing Feminine Wash, 12oz Bottle\nReview Date: 2022/09/06\nStore: Summer's Eve\nProduct Description: [\"Give a special someone or pamper yourself and experience Daily Intimate Beauty with the Summer's Eve Spa gift set containing a Luxurious Cleansing Wash and an Intimate Serum. The Summer's Eve Spa Luxurious Cleansing Wash has a calming chamomile fragrance blended with essential oils. The creamy, pearly feminine wash is hypoallergenic and gynecologist tested, safe and gentle enough to use every day. Free from dyes and parabens, the wash cleanses and leaves the skin feeling pampered. Indulge in relaxation and renewal every day. The Summer's Eve Spa after shave Skin Serum was created for your most delicate intimate areas to comfortably hydrate, smooth and soften. Specifically designed to soothe delicate, freshly shaven or waxed intimate skin. 9 out of 10 women say the serum soothed skin after shaving. The serum is infused with vitamin E, coconut oil and aloe. Elevate your intimate care routine with the cleansing wash and luxurious serum from our Summer’s Eve Spa Kit for Women Gift Set.\"]\nAverage Rating: 4.2\nProduct Details: {'Item Form': 'Serum', 'Scent': 'Spa', 'Brand': \"Summer's Eve\", 'Skin Type': 'All', 'Active Ingredients': 'Lactic_acid', 'Product Dimensions': '8.87 x 2.22 x 9.32 inches; 1.34 Pounds', 'UPC': '041608002324', 'Manufacturer': 'Prestige Consumer Healthcare', 'Country of Origin': 'USA'}\nReview Text: I’ve been using Summer’s Eve Feminine Products for years. They have never caused me any irritation and always kept me feeling clean and refreshed. With this being a new product of theirs, of course I needed to try it right away.<br />Minimal scent with the Wash and Fragrance FREE for the serum. I use the wash I as I always have with the other Summer’s Eve I have. I like that this is PH-Balanced. I use the serum on my bikini area after I’ve 🪒 shaved.<br /><br />I have nothing but positive things to say about all Summer’s Eve products. I think all woman should care for their intimate areas carefully and these products are the best for that.\nReview Title: I have ALWAYS used Summer’s Eve⭐️👍\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stride Foot Cream Smoothes Rough Cracked Heels & Dry Skin –– Dematologist-Developed, Intensely Moisturizing Foot Cream with Aloe Vera, Coconut oil and Green tea\nReview Date: 2022/09/10\nStore: Stride\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Stride', 'Scent': 'Coconut', 'Active Ingredients': 'Coconut oil,green tea,vitamin e', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Package Dimensions': '3 x 3 x 2 inches; 3.99 Ounces', 'UPC': '860006643317'}\nReview Text: I definitely like the way this cream makes my feet 👣 feel. I am a particular person that does not like to have dry skin or calluses on my 👣 feet. It’s important that I have a lotion that makes my feet 👣 soft and smooth. This also has a somewhat cooling feeling to it which is nice. Occasionally in the middle of the night my feet 👣 will start getting very warm/hot and it’s very uncomfortable. Twice now I’ve been able to apply this cream and it soothes and cools my feet 👣 making them comfortable enough to be able to sleep.<br /><br />EXPIRATION DATE: 06/11/2024<br />I always check for expiration dates prior to using. This expiration date tells me the product hasn’t been sitting somewhere, but was recently produced for distribution.\nReview Title: Soothes my feels 👣\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AIIR Diamond Shampoo - Fragrance Free Shampoo for Color Treated Hair, Sulfate Free Shampoo, Organic Shampoo - Cleansing and Moisturizing Color Safe Shampoo, Hair Repair - 8 oz\nReview Date: 2022/09/17\nStore: AIIR\nAverage Rating: 4.2\nProduct Details: {'Brand': 'AIIR', 'Item Form': 'Liquid', 'Hair Type': 'Color Treated', 'Scent': 'Unscented', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.42 x 3.11 x 2.36 inches; 8 Ounces', 'UPC': '787790270065'}\nReview Text: Like that this is Fragrance Free. A gentle shampoo that thoroughly cleans my hair. Usually shampoos that throughly clean away build up will strip my hair of the natural oils and this definitely does not. It is for “COLOR TREATED” hair.<br />I also use this shampoo in combination with [[ASIN:B09TQ29M5H AIIR Diamond Hair Conditioner]]. The combination of both together leaves my hair feeling cleaning, smooth and soft. No frizzing at all.<br />It is a bit pricey, however, for a professional brand product, is does as described, and they are all priced around the same for 8oz.<br /><br />THOROUGHLY SEALED: ✅<br />One thing that is important to me is how manufacturers seal & ship their products. This was THOROUGHLY sealed as you can see from the pictures. 👍👍👍👍👍<br /><br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review was selected by ME & ONLY ME. The product or item is ALWAYS something that is needed and will be used in my Home🏡 & Yard 🌱🍃, or for my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST FOR ME 💁🏻‍♀️.\nReview Title: Left my hair Soft, Smooth & CLEANED⭐️👍\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hair Removal Device\nReview Date: 2022/10/05\nStore: Ulike\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '11.1 x 8.46 x 3.82 inches; 3.31 Pounds', 'Item model number': 'UI04', 'UPC': '768461548188'}\nReview Text: This device comes in a very nice case for storage. The protective glasses 👓 even come in a very nice case. The directions are quite detailed so there is no need for me to discuss that in this review. If you purchase this device you’ll see.<br /><br />Operating an IPL device is pretty simple if you follow the directions. It’s choosing the level, making sure you don’t miss a spot and having the patience/commitment to follow through with it to get the results you want.<br /><br />I have seen reviews under many IPL hair removal devices that says they used it for a month and they didn’t see any results. Well, it does take time. Like I said, if you are committed, patience and consistent, then any IPL device will work. This particular device recommends using ONCE a week for 12 weeks, and then once a month there after for maintenance. Most people want to see results by snapping their fingers, and that just isn’t going to happen, even if you do go to a professional, and have it done, it takes time. My advice, if you are not in the mood to take the time, don’t have the patience and or not going to be committed, then don’t get one of these devices because you would be wasting your money.<br /><br />It took about 4 weeks or 4 treatments before I really started to notice results. First noticed the hair on the underarms because it had become finer, thinner, softer hair that was growing. My bikini 👙 area had spots that the hair didn’t grow back but other spots where it was finer, thinner & softer hair. Even though I had spots with NO HAIR growing back, I still go over all the areas regardless. My left armpit has no hair growing at this time, but I still do a treatment. Once I get to the proper weeks since I first started the treatments, then and only then I will 🛑 treating areas where no hair grows.<br /><br />My legs 🦵🏼 have been frustrating but it’s definitely working. The problem is that I miss areas each time I do a treatment. There’s no way of getting the entire leg each time. I have come up with a pattern I do that helps me the best. I start at my ankle and go around my leg 🦵🏼 in a circle ⭕️ while spiraling 🌀 up my leg. I found that going up and down is when I was missing the most. Doing a spiral has helped me tremendously.<br /><br />On the days I am scheduled to do another treatment, I shave 🪒 the areas that I’m going to treat. I also exfoliate the areas using  [[ASIN:B099HDG45M Revealer Skin Exfoliator]]. Then about an half hour after I shave 🪒, I start me treatments. KEEP YOUR LEGS DRY, CLEAN AND NO LOTIONS/OILS ETC. NOTHING.<br />ALWAYS WEAR THE PROTECTIVE 👓 GLASSES!<br />Since I shave my underarms first, I start there. Underarms takes about 2 minutes each. Then I do my bikini 👙 area and then onto my legs. If I think I forgot a spot I do go back and do it, but I really try to pay attention so I don’t. Once complete I either apply [[ASIN:B0B1N8Z7BR Reviver Skin Soothing Gel]] or [[ASIN:B073WVKRBN USDA Certified Jojoba Oil]]. Both are soothing, but sometimes I feel I need a decent moisturizer and Jojoba Oil is my go to for that.<br /><br />Well, that’s how I do each treatment. I also put in my schedule/calendar📅 when I’m supposed to do my next treatment. It is time consuming, but the results are so worth it. Think off all the money you are going to save by NOT having to buy EXPENSIVE RAZORS 🪒 anymore. Not to mention the time saved in the shower 🚿.<br /><br />HOPE THIS HELPS others understand a little of how it works. 👍I feel very comfortable using this device and knew going into it, this is a commitment and requires patience.\nReview Title: I❤️the cooling tip on this device👍⭐️\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anti Wrinkles Face Neck Device, Vibration Face Massager, Triple Action Portable wrinkles remover for Skin Care, Improve, Tightening, Firm and Smooth\nReview Date: 2022/11/04\nStore: Ihelol\nProduct Description: ['【Warm Tips】When charging, charging indication will turn on and flash if there is not enough power. If it is fully charged, it will stop flashing and stay always on (Not available while charging! Does not work when charging! ) After turning on, be sure that remove the protective cover, touches the sensor and let massage head touches your skin. then the device starts vibrating.']\nAverage Rating: 3.4\nProduct Details: {'Power Source': 'Battery Powered', 'Brand': 'Ihelol', 'Special Feature': 'Heat', 'Is Cordless?': 'Yes', 'Product Grade': 'Home', 'Package Dimensions': '6.22 x 4.21 x 2.32 inches; 8.15 Ounces', 'Item model number': 'SKIN 11', 'UPC': '613965481632', 'Manufacturer': 'Ihelol'}\nReview Text: The lights, vibration, and warmth feel wonderfully on my neck and face. The vibration combined with the lights helps make my skin look alive and healthy, after just two weeks.<br /><br />HOW I USE:<br />1 - I cleanse my neck and face as I would on any day. When I say cleanse, that means washing and using toner.<br />2 - I apply [[ASIN:B073WVKRBN USDA Grade Jojoba Oil]] on my face and neck as the moisturizer I want to use with this device.<br />3 - with my neck I start at the collarbone and move up to my chin and on the back of my neck, I move up to my hairline.<br />4 - on my face I start in the middle and move outwards toward my hairline.<br /><br />The vibration starts once you pick one of the gears below and the device head is touching your skin. Also, your hand must touch one of the sensing \"rings\" on either side.<br /><br />First Gear (Green):<br />Promotes skin surface microcirculation<br />Fights edema<br />Calms skin<br /><br />Second Gear (Red):<br />Improves blood circulation<br />Eliminates wrinkles<br />Restores natural skin color<br /><br />Third Gear (Blue):<br />Tightens loose skin<br />Promotes collagen synthesis.<br />Suitable for oily and sensitive skin<br /><br />I use it for about 10 minutes on my neck and face, daily.<br /><br />GREAT PRICE & PRODUCT that is a definite match👍.<br />(The product is well made, exactly what is advertised, and is priced as it should be in MY OPINION.)<br /><br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review, I selected. The product or item is ALWAYS something that is needed and now is being used in my Home🏡 , Yard 🌱🍃, by my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST BY ME 💁🏻‍♀️.\nReview Title: Only been using for two weeks but so far…\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe analysis of purchase behavior reveals a consumer with a clear preference for skincare products that prioritize gentle formulations, absorbency, and multi-functionality. They consistently favor gel-based or soothing products with moisturizing properties, indicating a strong inclination towards items that address specific needs, such as anti-aging and hydration. This preference is evident in the positive sentiments surrounding gel moisturizers, eye masks, and serums offering hydration and soothing effects.\n\nThemes of self-care and personal grooming emerge, as the consumer invests in products for intimate care, foot care, and hair management, underscoring a holistic approach to personal wellness. Quality is a crucial factor; the consumer demonstrates a tendency to choose well-reviewed, premium brands but is also conscious of pricing, exhibiting price sensitivity, particularly when compelled to use products like moisturizers frequently.\n\nThe reviews reflect a thorough and knowledgeable approach to product use, highlighting commitment to consistent and proper application for favorable results. This consumer values ease of use and effective solutions, favoring products with calming scents and gentle ingredients to cater to sensitive skin.\n\nOverall, the core preferences suggest a focus on effective skincare, an appreciation for quality, a willingness to invest in self-care, and a mindful approach to price versus necessity.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Nice alternative to retinol👍⭐️",
    "text": "Lightweight and has no fragrance. I have sensitive skin and had no irritation when using this product. It can be used in the AM and PM because there’s no sensitivity to the sun.<br /><br />I cleaned my face, used toner, and then applied the cream. I only used a fingertip size to cover my face and neck.<br /><br />Retinol products tend to irritate my skin, and having this as an alternative has done wonders for my skin. It keeps my skin moisturized.<br /><br />EXPIRATION DATE: 10/25/2024<br />I always check for expiration dates before using, ESPECIALLY with any facial/body products. This expiration date tells me the product hasn’t been sitting somewhere but has been manufactured recently for distribution.<br /><br />DISCLAIMER:<br />📝Yes, I am a VINE 🗣VOICE member. EVERY product that I review, I selected. The product or item is ALWAYS something that is needed and now is being used in my Home🏡 , Yard 🌱🍃, by my FAMILY 👨‍👩‍👧‍👦& Pets🦮🐾🐈‍⬛, or JUST BY ME 💁🏻‍♀️.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/619hKFRc8BL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/619hKFRc8BL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/619hKFRc8BL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61ULgSW0XeL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61ULgSW0XeL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61ULgSW0XeL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61X6-g2BOSL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61X6-g2BOSL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61X6-g2BOSL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61zVfn+iP1L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61zVfn+iP1L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61zVfn+iP1L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71+wy0YFhbL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71+wy0YFhbL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71+wy0YFhbL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71-BoL0C76L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71-BoL0C76L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71-BoL0C76L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B0B18CG44R",
    "parent_asin": "B0B18CG44R",
    "user_id": "AEKZVUWFM4AVGF2JGBGPVRKKIUHA",
    "timestamp": "2022-11-12 19:55:00.696000",
    "helpful_vote": 2,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "TINAZANA Vegan Bakuchiol Comforting Cream For Replenish and Soothe Senitive Dry Skin, Skin Care, Highly Moisturizing Recovery Cream, 100% Vegan Formula, Bacuchiol, Share Butter, Colorless, Fragrance-free 2.7Oz (80ml)",
    "average_rating": 4.4,
    "rating_number": 31,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41K++HM7x0L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41K++HM7x0L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51pfRJAN7SL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41uEWBv-dPL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41uEWBv-dPL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61DRJw9A3rL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31FSTep1OnL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31FSTep1OnL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/514uCBHlgvL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31XksG3rd2L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31XksG3rd2L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/51RpaVds9VL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41d97E2dExL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41d97E2dExL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/518sGQR5rRL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31jTLofXM+L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31jTLofXM+L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/51gfiRS8LrL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41+uhI19d+L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41+uhI19d+L.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/51FpPZwnuvL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41jFBRtpDtL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41jFBRtpDtL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/51e+vi+r1hL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31E8WHCwgtL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31E8WHCwgtL.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/51N7erLGN9L._SL1000_.jpg"
      }
    ],
    "videos": [
      {
        "title": "TINAZANA Brand Video",
        "url": "https://www.amazon.com/vdp/04a02f044068417e8367bd2547230f80?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "TINAZANA",
    "categories": [],
    "details": {
      "Brand": "TINAZANA",
      "Active Ingredients": "retinol",
      "Unit Count": "2.82 Ounce",
      "Number of Items": "1",
      "Material Type Free": "Emulsifier Free,Fragrance-free",
      "Product Dimensions": "2.64 x 2.64 x 2.01 inches; 1.5 Pounds"
    },
    "bought_together": null
  }
}