{
  "user_id": "AE6TDCUOKCSCRL5ZHWKEL7QHOA3A",
  "summary": "=== Purchase Information ===\nProduct Title: Panasonic EW-DL82 Sonic Vibration Rechargeable Electric Toothbrush, White\nReview Date: 2014/07/09\nStore: Panasonic\nProduct Description: ['Sonic vibration rechargeable toothbrush. Clinically proven to reduce stains.']\nAverage Rating: 3.4\nProduct Details: {'Brand': 'Panasonic', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Item Firmness Description': 'Soft', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.2 x 1 x 8.3 inches; 3.2 Ounces', 'Item model number': 'EW-DL82-W', 'Batteries': '1 Lithium Ion batteries required.', 'UPC': '885170124196', 'Manufacturer': 'Panasonic - Beauty'}\nReview Text: Update:  I am lowering my rating to 3 stars because of the difficulty and expense of finding and buying replacement heads.  I couldn't find any for quite some time.  I've since found some online, not on Amazon, but from a low of $19.99 (but out of stock) to more than $25 for a single head.  The difficulty and cost makes buying this brush too impractical, which is too bad because I like the unit.<br />~~~~~~~<br /><br />The toothbrush I reviewed is the similar model, EW-DE92.  I was taken to this page when I tried to post my review.<br /><br />First, and most important, I love the way this brush cleans my teeth.  Using the \"white\" mode, they feel nice and fresh and thoroughly cleansed.  According to the owner's guide, some people can feel that slight electric charge, the ionic feature, when using the brush, and I am one of those people.  However, it is extremely mild and not the least unpleasant.<br /><br />I like that there are various settings on this brush although I use \"white\" most often.  The gum brush may be useful but I don't use it as routinely as suggested because it just doesn't feel like it is doing much for me.  I do like to use the little pointy rubber head but again, not as often as the regular head.  I do like the tongue cleaner on this brush.<br /><br />Which brings me to one of the drawbacks.  I cannot seem to find replacement heads for this product.  I looked on Amazon and I went to the Panasonic site with no success.  I went to the same model toothbrush on both sites and there are no links to the replacement heads.  I wanted to order some in advance so I would have then when needed.  Perhaps this is a new model and replacement heads will become widely available, but this toothbrush is expensive to begin with, and much more so if heads cannot be found.<br /><br />Compared to my basic but rechargeable Philips Sonicare toothbrush, this one is nicer to hold because the handle is much slimmer.  The Sonicare seems to have a more robust brushing action, but this one seems to get my teeth just as clean, perhaps marginally cleaner.<br /><br />The charger seems to work well.  I took the brush on a 10-day trip and chanced not taking the charger with me, and I had no loss of power during that trip.  It seems to hold its charge quite well.<br /><br />But there is a downside to the charger too.  According to the manual again, the lithium battery lasts about 3 years.  When the battery is dead, I am supposed to \"Contact an authorized service center for repair.\"  Now that is just not practical and probably not cheap, and this toothbrush costs too much to not be able to replace the battery without service costs.<br /><br />One more drawback is the storage of the various heads.  This set comes with a little stand to store the heads, but none of the heads have a protective cover and the storage stand does not have a cover, so the heads are sitting out in the bathroom air, something I don't like at all.  The travel case holds the handle and one head but not the extra heads.  My cheaper Sonicare has a plastic cap that comes with each head to protect it.<br /><br />While I think this is a very good toothbrush, the drawbacks need to be fixed before I would consider getting another one.  At current prices, this one costs more than twice my Sonicare, and while this one has more bells and whistles, I don't believe the price difference is justified.\nReview Title: Great brush, some drawbacks\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bloom Krans Vulva Harmony Moisturizer: Organic Vulva Cream for Intimate Feminine Care & Health including Dryness & Itch Relief (Estrogen Free, Dye Free, Fragrance Free, Steroid Free) - 2.25 Oz (Aloe Free - 1 Pack)\nReview Date: 2018/08/28\nStore: Bloom Krans\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Bloom Krans', 'Item Form': 'Cream', 'Unit Count': '2.2 Ounce', 'Number of Items': '1', 'Use for': 'Whole Body'}\nReview Text: What this is not:  it is not a hormone replacement therapy, and you can't expect the same results as if it were.  It is, however, a nice collection of organic oils and beeswax which combines to make a semisolid much lighter in feel than petroleum jelly but not a liquid.  You need only a little dab - using too much could get messy.  It softens at body temperature but doesn't turn into an oily liquid.  It is quite nice and refreshing.  It's an odd greenish color.<br /><br />But the product is a bit confusing to me.  It is for external vaginal use only.  I don't know about you, but at what point is my vagina external instead of internal?  It seems pretty internal to me.  That makes it of limited use to postmenopausal women like me.  Soothing and comforting, yes, but not really what most postmenopausal women need.\nReview Title: Nice But of Limited Use for Us Old Ladies\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TRESemmé Botanique Shampoo and Conditioner Four Pack, Nourish & Replenish, 88 oz\nReview Date: 2018/12/08\nStore: TRESemmé\nAverage Rating: 4.6\nProduct Details: {'Material Type Free': 'paraben free,dye free', 'Item Form': 'Liquid', 'Brand': 'TRESemmé', 'Scent': 'prafum', 'Special Ingredients': 'Coconut-oil,Aloe-vera', 'Product Dimensions': '14.75 x 9.88 x 3.56 inches; 6.8 Pounds', 'UPC': '022400002248'}\nReview Text: This 4-pack of shampoo and conditioner should keep you supplied for quite awhile, but that doesn't matter if you find you don't like it.  I like it quite a bit.  The shampoo cleanses well and the conditioner (surprise!) conditions.  However it doesn't make my hair feel too stripped nor does it feel too greasy/oily after using both shampoo and conditioner, and my hair doesn't feel too dirty too fast, as with some conditioners.  The shampoo is clear and the conditioner is creamy.  This is a readily available brand, not a fancy salon brand, but it works well for me, and has no parabens, dyes, or silicones.\nReview Title: Works Well, Lovely Tropical Scent\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 100 pcs Compressed Facial Mask Women DIY Beauty Facial Cotton Paper Compress Masque Disposable Dry Sheet Mask for Skin Face Care\nReview Date: 2019/04/25\nStore: Evoio\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Evoio', 'Item Form': 'Sheet', 'Scent': 'Cotton Paper', 'Skin Type': 'Dry', 'Unit Count': '100.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.29 x 4.41 x 2.87 inches; 5.96 Ounces'}\nReview Text: For DIY face masques, these are not quite as good as I hoped but better than I expected.  They come in a little compressed \"tablet,\" about the size and shape on an antacid tablet, but grow when liquid is added.  They are a bit hard to unfold, but once unfolded, they are a generous size.  However, they lose a point because the product page in one place says they are made of cotton, and in another, says they are made of bamboo.  These are made in China, and there is no clarification on the package that I can find.  So I don't have a clue what these are made of.<br /><br />They are not quite as soft as the ones that come with their own serum that I've tried.  But they are fairly sturdy.  You can rip them if you start ripping in a corner, but they don't rip as easily as I would have thought.<br /><br />So these are acceptable dry face masques, but their product page and labeling needs some improvement.\nReview Title: Cotton or Bamboo?\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nReview Date: 2019/06/08\nStore: Temer\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nReview Text: This 2.5% retinol serum has good ingredients in it, and it seems to work as well for me as other, more expensive serums I've used.  If I'm reading correctly, it is made in Canada.  And it's not tested on animals, which is great.  (I do wish the product page images could be magnified, because they are quite hard to read, as is the fine print on the actual product.)<br /><br />I appreciate that this is honestly packaged, with no extra useless space to make the product seem bigger.  It comes in a dark glass bottle with a glass, rubber-bulb dropper, very easy to use without getting too much.<br /><br />Although I took a bit of a chance on this product because I couldn't read everything on the product page, it turns out to be a good, straightforward product that doesn't rely on fancy packaging to raise prices.\nReview Title: Very Nice, Straightforward Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LDR by Baysyx - Restorative Glow Hydro Boost Moisturizer | Nourishing Hydration Cream with Collagen Stimulation | Fortified with Hyaluronic Acid | Made in The USA from Natural Ingredients (1.7 Oz)\nReview Date: 2019/09/11\nStore: LDR\nAverage Rating: 3.6\nProduct Details: {'Brand': 'LDR', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '6.3 x 1.2 x 1.1 inches; 1.7 Ounces', 'UPC': '725835779579', 'Manufacturer': 'LDR'}\nReview Text: This light cream has a lovely, not-too-heavy scent, and smooths onto my skin quite easily.  There is no draggy feeling as with heavier creams.  And that is both a plus and a negative.  While I like this for daytime because it doesn't feel greasy, it does not feel hydrating enough for night time, at least not for my old skin.  I like that this product is made in the USA, and that it is cruelty free, although \"cruelty free\" claims need to be taken with a grain of salt.<br /><br />The pump bottle works well, and keeps air out of the product, but there is no over-cap or anything, so this is best left on the counter.  Putting it in a travel bag could cause a mess.<br /><br />Although I like this for a day cream, I can't find that it contains any sun protection, so if you are going to spend any time in the sun, you'll need a separate product.<br /><br />This seems a good product, but in my opinion, it is not outstanding, doesn't really differentiate itself from dozens of other products in all price ranges.\nReview Title: Light Cream, Good for Day Use\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Splendora Sugar Lip Scrub - Peach - (20g / 0.7oz.)\nReview Date: 2020/01/23\nStore: Splendora\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Splendora', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Dimensions': '1.73 x 1.73 x 1.34 inches; 0.7 Ounces', 'UPC': '736640550444'}\nReview Text: If I had realized that this product was made in China, where cosmetic products sold there must be tested on animals by law, I wouldn't have taken it.  But I saw that nowhere on the product page.  I try to avoid products made there because I don't agree with that.  Other than that, this is a decent but not great lip scrub.  Good luck getting a pea-sized amount to your lips because it is so crumbly that you will lose a good part of it on the way.  Or at least I did.  It does scrub reasonably well, but did not entirely eliminate the roughness on my winter-chapped lips.  It did help smooth them though.  It smells good, but I'm certainly not going to try to eat the residue, as the instructions say you can.  At the current listing, it does seem a bit overpriced for something which is basically large-grained sugar with some oil thrown in for good measure.\nReview Title: Made in China, Otherwise, Just Okay\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Makeup Removal Towel (Pack of 5) Bamboo Fiber Cleansing Facial Soft Gentle Face Cloth Suitable for All Skin Type\nReview Date: 2020/02/11\nStore: Qurly\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Qurly', 'Skin Type': 'All', 'Unit Count': '1.00 Count', 'Number of Items': '5', 'Age Range (Description)': 'All Ages', 'Package Dimensions': '7.9 x 5.1 x 1.9 inches; 8.01 Ounces', 'UPC': '669203787530'}\nReview Text: I've been using some bamboo cloth makeup pads, and I like those, but I thought I'd give these cloths, more like washcloths, a try.  And I'm very pleased with them.  Their larger size makes them more convenient to use.  There are two layers of cloth, sewn together very well.  Because I don't usually use a lot of makeup, I can use one side for removing my makeup and use the other side for cleansing my face with the normal cleanser.  They do get stained if you remove a lot of makeup, and you are not supposed to bleach them,  according to the product page.  So I expect these will discolor over time.  But I've been handwashing them with soap after I clean my face, right at the bathroom basin, and that seems to have kept any staining at bay.  After I wash them out, I hang them on a hook near my shower to dry, and they have not gotten that awful \"spoiled\" bacteria smell after they dry.  For my face, I like these better than either washcloths or the cloth makeup pads I've been using.\nReview Title: Large to Do a Good Job, Really Effective\nRating: 5.0\n--------------------------------------------------",
  "reference": "Panasonic EW-DL82 Sonic Vibration Rechargeable Electric Toothbrush, White\nPanasonic\n['Sonic vibration rechargeable toothbrush. Clinically proven to reduce stains.']\n{'Brand': 'Panasonic', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Item Firmness Description': 'Soft', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.2 x 1 x 8.3 inches; 3.2 Ounces', 'Item model number': 'EW-DL82-W', 'Batteries': '1 Lithium Ion batteries required.', 'UPC': '885170124196', 'Manufacturer': 'Panasonic - Beauty'}\nUpdate:  I am lowering my rating to 3 stars because of the difficulty and expense of finding and buying replacement heads.  I couldn't find any for quite some time.  I've since found some online, not on Amazon, but from a low of $19.99 (but out of stock) to more than $25 for a single head.  The difficulty and cost makes buying this brush too impractical, which is too bad because I like the unit.<br />~~~~~~~<br /><br />The toothbrush I reviewed is the similar model, EW-DE92.  I was taken to this page when I tried to post my review.<br /><br />First, and most important, I love the way this brush cleans my teeth.  Using the \"white\" mode, they feel nice and fresh and thoroughly cleansed.  According to the owner's guide, some people can feel that slight electric charge, the ionic feature, when using the brush, and I am one of those people.  However, it is extremely mild and not the least unpleasant.<br /><br />I like that there are various settings on this brush although I use \"white\" most often.  The gum brush may be useful but I don't use it as routinely as suggested because it just doesn't feel like it is doing much for me.  I do like to use the little pointy rubber head but again, not as often as the regular head.  I do like the tongue cleaner on this brush.<br /><br />Which brings me to one of the drawbacks.  I cannot seem to find replacement heads for this product.  I looked on Amazon and I went to the Panasonic site with no success.  I went to the same model toothbrush on both sites and there are no links to the replacement heads.  I wanted to order some in advance so I would have then when needed.  Perhaps this is a new model and replacement heads will become widely available, but this toothbrush is expensive to begin with, and much more so if heads cannot be found.<br /><br />Compared to my basic but rechargeable Philips Sonicare toothbrush, this one is nicer to hold because the handle is much slimmer.  The Sonicare seems to have a more robust brushing action, but this one seems to get my teeth just as clean, perhaps marginally cleaner.<br /><br />The charger seems to work well.  I took the brush on a 10-day trip and chanced not taking the charger with me, and I had no loss of power during that trip.  It seems to hold its charge quite well.<br /><br />But there is a downside to the charger too.  According to the manual again, the lithium battery lasts about 3 years.  When the battery is dead, I am supposed to \"Contact an authorized service center for repair.\"  Now that is just not practical and probably not cheap, and this toothbrush costs too much to not be able to replace the battery without service costs.<br /><br />One more drawback is the storage of the various heads.  This set comes with a little stand to store the heads, but none of the heads have a protective cover and the storage stand does not have a cover, so the heads are sitting out in the bathroom air, something I don't like at all.  The travel case holds the handle and one head but not the extra heads.  My cheaper Sonicare has a plastic cap that comes with each head to protect it.<br /><br />While I think this is a very good toothbrush, the drawbacks need to be fixed before I would consider getting another one.  At current prices, this one costs more than twice my Sonicare, and while this one has more bells and whistles, I don't believe the price difference is justified.\nGreat brush, some drawbacks\nBloom Krans Vulva Harmony Moisturizer: Organic Vulva Cream for Intimate Feminine Care & Health including Dryness & Itch Relief (Estrogen Free, Dye Free, Fragrance Free, Steroid Free) - 2.25 Oz (Aloe Free - 1 Pack)\nBloom Krans\n{'Brand': 'Bloom Krans', 'Item Form': 'Cream', 'Unit Count': '2.2 Ounce', 'Number of Items': '1', 'Use for': 'Whole Body'}\nWhat this is not:  it is not a hormone replacement therapy, and you can't expect the same results as if it were.  It is, however, a nice collection of organic oils and beeswax which combines to make a semisolid much lighter in feel than petroleum jelly but not a liquid.  You need only a little dab - using too much could get messy.  It softens at body temperature but doesn't turn into an oily liquid.  It is quite nice and refreshing.  It's an odd greenish color.<br /><br />But the product is a bit confusing to me.  It is for external vaginal use only.  I don't know about you, but at what point is my vagina external instead of internal?  It seems pretty internal to me.  That makes it of limited use to postmenopausal women like me.  Soothing and comforting, yes, but not really what most postmenopausal women need.\nNice But of Limited Use for Us Old Ladies\nTRESemmé Botanique Shampoo and Conditioner Four Pack, Nourish & Replenish, 88 oz\nTRESemmé\n{'Material Type Free': 'paraben free,dye free', 'Item Form': 'Liquid', 'Brand': 'TRESemmé', 'Scent': 'prafum', 'Special Ingredients': 'Coconut-oil,Aloe-vera', 'Product Dimensions': '14.75 x 9.88 x 3.56 inches; 6.8 Pounds', 'UPC': '022400002248'}\nThis 4-pack of shampoo and conditioner should keep you supplied for quite awhile, but that doesn't matter if you find you don't like it.  I like it quite a bit.  The shampoo cleanses well and the conditioner (surprise!) conditions.  However it doesn't make my hair feel too stripped nor does it feel too greasy/oily after using both shampoo and conditioner, and my hair doesn't feel too dirty too fast, as with some conditioners.  The shampoo is clear and the conditioner is creamy.  This is a readily available brand, not a fancy salon brand, but it works well for me, and has no parabens, dyes, or silicones.\nWorks Well, Lovely Tropical Scent\n100 pcs Compressed Facial Mask Women DIY Beauty Facial Cotton Paper Compress Masque Disposable Dry Sheet Mask for Skin Face Care\nEvoio\n{'Brand': 'Evoio', 'Item Form': 'Sheet', 'Scent': 'Cotton Paper', 'Skin Type': 'Dry', 'Unit Count': '100.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.29 x 4.41 x 2.87 inches; 5.96 Ounces'}\nFor DIY face masques, these are not quite as good as I hoped but better than I expected.  They come in a little compressed \"tablet,\" about the size and shape on an antacid tablet, but grow when liquid is added.  They are a bit hard to unfold, but once unfolded, they are a generous size.  However, they lose a point because the product page in one place says they are made of cotton, and in another, says they are made of bamboo.  These are made in China, and there is no clarification on the package that I can find.  So I don't have a clue what these are made of.<br /><br />They are not quite as soft as the ones that come with their own serum that I've tried.  But they are fairly sturdy.  You can rip them if you start ripping in a corner, but they don't rip as easily as I would have thought.<br /><br />So these are acceptable dry face masques, but their product page and labeling needs some improvement.\nCotton or Bamboo?\n1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nTemer\n{'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nThis 2.5% retinol serum has good ingredients in it, and it seems to work as well for me as other, more expensive serums I've used.  If I'm reading correctly, it is made in Canada.  And it's not tested on animals, which is great.  (I do wish the product page images could be magnified, because they are quite hard to read, as is the fine print on the actual product.)<br /><br />I appreciate that this is honestly packaged, with no extra useless space to make the product seem bigger.  It comes in a dark glass bottle with a glass, rubber-bulb dropper, very easy to use without getting too much.<br /><br />Although I took a bit of a chance on this product because I couldn't read everything on the product page, it turns out to be a good, straightforward product that doesn't rely on fancy packaging to raise prices.\nVery Nice, Straightforward Product\nLDR by Baysyx - Restorative Glow Hydro Boost Moisturizer | Nourishing Hydration Cream with Collagen Stimulation | Fortified with Hyaluronic Acid | Made in The USA from Natural Ingredients (1.7 Oz)\nLDR\n{'Brand': 'LDR', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '6.3 x 1.2 x 1.1 inches; 1.7 Ounces', 'UPC': '725835779579', 'Manufacturer': 'LDR'}\nThis light cream has a lovely, not-too-heavy scent, and smooths onto my skin quite easily.  There is no draggy feeling as with heavier creams.  And that is both a plus and a negative.  While I like this for daytime because it doesn't feel greasy, it does not feel hydrating enough for night time, at least not for my old skin.  I like that this product is made in the USA, and that it is cruelty free, although \"cruelty free\" claims need to be taken with a grain of salt.<br /><br />The pump bottle works well, and keeps air out of the product, but there is no over-cap or anything, so this is best left on the counter.  Putting it in a travel bag could cause a mess.<br /><br />Although I like this for a day cream, I can't find that it contains any sun protection, so if you are going to spend any time in the sun, you'll need a separate product.<br /><br />This seems a good product, but in my opinion, it is not outstanding, doesn't really differentiate itself from dozens of other products in all price ranges.\nLight Cream, Good for Day Use\nSplendora Sugar Lip Scrub - Peach - (20g / 0.7oz.)\nSplendora\n{'Brand': 'Splendora', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Dimensions': '1.73 x 1.73 x 1.34 inches; 0.7 Ounces', 'UPC': '736640550444'}\nIf I had realized that this product was made in China, where cosmetic products sold there must be tested on animals by law, I wouldn't have taken it.  But I saw that nowhere on the product page.  I try to avoid products made there because I don't agree with that.  Other than that, this is a decent but not great lip scrub.  Good luck getting a pea-sized amount to your lips because it is so crumbly that you will lose a good part of it on the way.  Or at least I did.  It does scrub reasonably well, but did not entirely eliminate the roughness on my winter-chapped lips.  It did help smooth them though.  It smells good, but I'm certainly not going to try to eat the residue, as the instructions say you can.  At the current listing, it does seem a bit overpriced for something which is basically large-grained sugar with some oil thrown in for good measure.\nMade in China, Otherwise, Just Okay\nMakeup Removal Towel (Pack of 5) Bamboo Fiber Cleansing Facial Soft Gentle Face Cloth Suitable for All Skin Type\nQurly\n{'Brand': 'Qurly', 'Skin Type': 'All', 'Unit Count': '1.00 Count', 'Number of Items': '5', 'Age Range (Description)': 'All Ages', 'Package Dimensions': '7.9 x 5.1 x 1.9 inches; 8.01 Ounces', 'UPC': '669203787530'}\nI've been using some bamboo cloth makeup pads, and I like those, but I thought I'd give these cloths, more like washcloths, a try.  And I'm very pleased with them.  Their larger size makes them more convenient to use.  There are two layers of cloth, sewn together very well.  Because I don't usually use a lot of makeup, I can use one side for removing my makeup and use the other side for cleansing my face with the normal cleanser.  They do get stained if you remove a lot of makeup, and you are not supposed to bleach them,  according to the product page.  So I expect these will discolor over time.  But I've been handwashing them with soap after I clean my face, right at the bathroom basin, and that seems to have kept any staining at bay.  After I wash them out, I hang them on a hook near my shower to dry, and they have not gotten that awful \"spoiled\" bacteria smell after they dry.  For my face, I like these better than either washcloths or the cloth makeup pads I've been using.\nLarge to Do a Good Job, Really Effective",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Panasonic EW-DL82 Sonic Vibration Rechargeable Electric Toothbrush, White\nReview Date: 2014/07/09\nStore: Panasonic\nProduct Description: ['Sonic vibration rechargeable toothbrush. Clinically proven to reduce stains.']\nAverage Rating: 3.4\nProduct Details: {'Brand': 'Panasonic', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Item Firmness Description': 'Soft', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.2 x 1 x 8.3 inches; 3.2 Ounces', 'Item model number': 'EW-DL82-W', 'Batteries': '1 Lithium Ion batteries required.', 'UPC': '885170124196', 'Manufacturer': 'Panasonic - Beauty'}\nReview Text: Update:  I am lowering my rating to 3 stars because of the difficulty and expense of finding and buying replacement heads.  I couldn't find any for quite some time.  I've since found some online, not on Amazon, but from a low of $19.99 (but out of stock) to more than $25 for a single head.  The difficulty and cost makes buying this brush too impractical, which is too bad because I like the unit.<br />~~~~~~~<br /><br />The toothbrush I reviewed is the similar model, EW-DE92.  I was taken to this page when I tried to post my review.<br /><br />First, and most important, I love the way this brush cleans my teeth.  Using the \"white\" mode, they feel nice and fresh and thoroughly cleansed.  According to the owner's guide, some people can feel that slight electric charge, the ionic feature, when using the brush, and I am one of those people.  However, it is extremely mild and not the least unpleasant.<br /><br />I like that there are various settings on this brush although I use \"white\" most often.  The gum brush may be useful but I don't use it as routinely as suggested because it just doesn't feel like it is doing much for me.  I do like to use the little pointy rubber head but again, not as often as the regular head.  I do like the tongue cleaner on this brush.<br /><br />Which brings me to one of the drawbacks.  I cannot seem to find replacement heads for this product.  I looked on Amazon and I went to the Panasonic site with no success.  I went to the same model toothbrush on both sites and there are no links to the replacement heads.  I wanted to order some in advance so I would have then when needed.  Perhaps this is a new model and replacement heads will become widely available, but this toothbrush is expensive to begin with, and much more so if heads cannot be found.<br /><br />Compared to my basic but rechargeable Philips Sonicare toothbrush, this one is nicer to hold because the handle is much slimmer.  The Sonicare seems to have a more robust brushing action, but this one seems to get my teeth just as clean, perhaps marginally cleaner.<br /><br />The charger seems to work well.  I took the brush on a 10-day trip and chanced not taking the charger with me, and I had no loss of power during that trip.  It seems to hold its charge quite well.<br /><br />But there is a downside to the charger too.  According to the manual again, the lithium battery lasts about 3 years.  When the battery is dead, I am supposed to \"Contact an authorized service center for repair.\"  Now that is just not practical and probably not cheap, and this toothbrush costs too much to not be able to replace the battery without service costs.<br /><br />One more drawback is the storage of the various heads.  This set comes with a little stand to store the heads, but none of the heads have a protective cover and the storage stand does not have a cover, so the heads are sitting out in the bathroom air, something I don't like at all.  The travel case holds the handle and one head but not the extra heads.  My cheaper Sonicare has a plastic cap that comes with each head to protect it.<br /><br />While I think this is a very good toothbrush, the drawbacks need to be fixed before I would consider getting another one.  At current prices, this one costs more than twice my Sonicare, and while this one has more bells and whistles, I don't believe the price difference is justified.\nReview Title: Great brush, some drawbacks\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bloom Krans Vulva Harmony Moisturizer: Organic Vulva Cream for Intimate Feminine Care & Health including Dryness & Itch Relief (Estrogen Free, Dye Free, Fragrance Free, Steroid Free) - 2.25 Oz (Aloe Free - 1 Pack)\nReview Date: 2018/08/28\nStore: Bloom Krans\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Bloom Krans', 'Item Form': 'Cream', 'Unit Count': '2.2 Ounce', 'Number of Items': '1', 'Use for': 'Whole Body'}\nReview Text: What this is not:  it is not a hormone replacement therapy, and you can't expect the same results as if it were.  It is, however, a nice collection of organic oils and beeswax which combines to make a semisolid much lighter in feel than petroleum jelly but not a liquid.  You need only a little dab - using too much could get messy.  It softens at body temperature but doesn't turn into an oily liquid.  It is quite nice and refreshing.  It's an odd greenish color.<br /><br />But the product is a bit confusing to me.  It is for external vaginal use only.  I don't know about you, but at what point is my vagina external instead of internal?  It seems pretty internal to me.  That makes it of limited use to postmenopausal women like me.  Soothing and comforting, yes, but not really what most postmenopausal women need.\nReview Title: Nice But of Limited Use for Us Old Ladies\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TRESemmé Botanique Shampoo and Conditioner Four Pack, Nourish & Replenish, 88 oz\nReview Date: 2018/12/08\nStore: TRESemmé\nAverage Rating: 4.6\nProduct Details: {'Material Type Free': 'paraben free,dye free', 'Item Form': 'Liquid', 'Brand': 'TRESemmé', 'Scent': 'prafum', 'Special Ingredients': 'Coconut-oil,Aloe-vera', 'Product Dimensions': '14.75 x 9.88 x 3.56 inches; 6.8 Pounds', 'UPC': '022400002248'}\nReview Text: This 4-pack of shampoo and conditioner should keep you supplied for quite awhile, but that doesn't matter if you find you don't like it.  I like it quite a bit.  The shampoo cleanses well and the conditioner (surprise!) conditions.  However it doesn't make my hair feel too stripped nor does it feel too greasy/oily after using both shampoo and conditioner, and my hair doesn't feel too dirty too fast, as with some conditioners.  The shampoo is clear and the conditioner is creamy.  This is a readily available brand, not a fancy salon brand, but it works well for me, and has no parabens, dyes, or silicones.\nReview Title: Works Well, Lovely Tropical Scent\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 100 pcs Compressed Facial Mask Women DIY Beauty Facial Cotton Paper Compress Masque Disposable Dry Sheet Mask for Skin Face Care\nReview Date: 2019/04/25\nStore: Evoio\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Evoio', 'Item Form': 'Sheet', 'Scent': 'Cotton Paper', 'Skin Type': 'Dry', 'Unit Count': '100.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.29 x 4.41 x 2.87 inches; 5.96 Ounces'}\nReview Text: For DIY face masques, these are not quite as good as I hoped but better than I expected.  They come in a little compressed \"tablet,\" about the size and shape on an antacid tablet, but grow when liquid is added.  They are a bit hard to unfold, but once unfolded, they are a generous size.  However, they lose a point because the product page in one place says they are made of cotton, and in another, says they are made of bamboo.  These are made in China, and there is no clarification on the package that I can find.  So I don't have a clue what these are made of.<br /><br />They are not quite as soft as the ones that come with their own serum that I've tried.  But they are fairly sturdy.  You can rip them if you start ripping in a corner, but they don't rip as easily as I would have thought.<br /><br />So these are acceptable dry face masques, but their product page and labeling needs some improvement.\nReview Title: Cotton or Bamboo?\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nReview Date: 2019/06/08\nStore: Temer\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nReview Text: This 2.5% retinol serum has good ingredients in it, and it seems to work as well for me as other, more expensive serums I've used.  If I'm reading correctly, it is made in Canada.  And it's not tested on animals, which is great.  (I do wish the product page images could be magnified, because they are quite hard to read, as is the fine print on the actual product.)<br /><br />I appreciate that this is honestly packaged, with no extra useless space to make the product seem bigger.  It comes in a dark glass bottle with a glass, rubber-bulb dropper, very easy to use without getting too much.<br /><br />Although I took a bit of a chance on this product because I couldn't read everything on the product page, it turns out to be a good, straightforward product that doesn't rely on fancy packaging to raise prices.\nReview Title: Very Nice, Straightforward Product\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LDR by Baysyx - Restorative Glow Hydro Boost Moisturizer | Nourishing Hydration Cream with Collagen Stimulation | Fortified with Hyaluronic Acid | Made in The USA from Natural Ingredients (1.7 Oz)\nReview Date: 2019/09/11\nStore: LDR\nAverage Rating: 3.6\nProduct Details: {'Brand': 'LDR', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '6.3 x 1.2 x 1.1 inches; 1.7 Ounces', 'UPC': '725835779579', 'Manufacturer': 'LDR'}\nReview Text: This light cream has a lovely, not-too-heavy scent, and smooths onto my skin quite easily.  There is no draggy feeling as with heavier creams.  And that is both a plus and a negative.  While I like this for daytime because it doesn't feel greasy, it does not feel hydrating enough for night time, at least not for my old skin.  I like that this product is made in the USA, and that it is cruelty free, although \"cruelty free\" claims need to be taken with a grain of salt.<br /><br />The pump bottle works well, and keeps air out of the product, but there is no over-cap or anything, so this is best left on the counter.  Putting it in a travel bag could cause a mess.<br /><br />Although I like this for a day cream, I can't find that it contains any sun protection, so if you are going to spend any time in the sun, you'll need a separate product.<br /><br />This seems a good product, but in my opinion, it is not outstanding, doesn't really differentiate itself from dozens of other products in all price ranges.\nReview Title: Light Cream, Good for Day Use\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Splendora Sugar Lip Scrub - Peach - (20g / 0.7oz.)\nReview Date: 2020/01/23\nStore: Splendora\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Splendora', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Dimensions': '1.73 x 1.73 x 1.34 inches; 0.7 Ounces', 'UPC': '736640550444'}\nReview Text: If I had realized that this product was made in China, where cosmetic products sold there must be tested on animals by law, I wouldn't have taken it.  But I saw that nowhere on the product page.  I try to avoid products made there because I don't agree with that.  Other than that, this is a decent but not great lip scrub.  Good luck getting a pea-sized amount to your lips because it is so crumbly that you will lose a good part of it on the way.  Or at least I did.  It does scrub reasonably well, but did not entirely eliminate the roughness on my winter-chapped lips.  It did help smooth them though.  It smells good, but I'm certainly not going to try to eat the residue, as the instructions say you can.  At the current listing, it does seem a bit overpriced for something which is basically large-grained sugar with some oil thrown in for good measure.\nReview Title: Made in China, Otherwise, Just Okay\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Makeup Removal Towel (Pack of 5) Bamboo Fiber Cleansing Facial Soft Gentle Face Cloth Suitable for All Skin Type\nReview Date: 2020/02/11\nStore: Qurly\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Qurly', 'Skin Type': 'All', 'Unit Count': '1.00 Count', 'Number of Items': '5', 'Age Range (Description)': 'All Ages', 'Package Dimensions': '7.9 x 5.1 x 1.9 inches; 8.01 Ounces', 'UPC': '669203787530'}\nReview Text: I've been using some bamboo cloth makeup pads, and I like those, but I thought I'd give these cloths, more like washcloths, a try.  And I'm very pleased with them.  Their larger size makes them more convenient to use.  There are two layers of cloth, sewn together very well.  Because I don't usually use a lot of makeup, I can use one side for removing my makeup and use the other side for cleansing my face with the normal cleanser.  They do get stained if you remove a lot of makeup, and you are not supposed to bleach them,  according to the product page.  So I expect these will discolor over time.  But I've been handwashing them with soap after I clean my face, right at the bathroom basin, and that seems to have kept any staining at bay.  After I wash them out, I hang them on a hook near my shower to dry, and they have not gotten that awful \"spoiled\" bacteria smell after they dry.  For my face, I like these better than either washcloths or the cloth makeup pads I've been using.\nReview Title: Large to Do a Good Job, Really Effective\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThe individual demonstrates a preference for practical, effective personal care products that balance quality with value. Consistently, they exhibit sentiments reflecting satisfaction with items that deliver significant functional benefits, such as efficient cleaning or moisturizing properties. However, they commonly express concern regarding availability and cost of replacements, indicating a sensitivity to ongoing product maintenance expenses, particularly in the dental and skincare categories.\n\nRecurring themes in their purchases include a focus on products that promote personal hygiene, beauty, and skin health. The buyer seems to appreciate organic or cruelty-free options, as evidenced by their choices in moisturizers and creams, revealing a preference for natural ingredients. Notably, while they display a willingness to invest in higher-priced items, there is also a critical lens on the value proposition, particularly when products do not meet expectations or when necessary components, like replacement heads, become difficult to source.\n\nQuality preferences highlight a liking for straightforward, well-packaged products that are easy to use. Despite some positive sentiments towards performance, they often rate items around the midpoint, suggesting that while products may meet initial expectations, they frequently feel that drawbacks exist that prevent them from being fully satisfied. Overall, they favor reliable, accessible, and functional beauty and personal care products, with a critical eye on their overall value and sustainability in the long term.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Delicious Scent, Very Soothing",
    "text": "The tangerine scent of this lip balm is wonderful.  And I love how it feels on my lips.  The ingredients are good and there are no animal ingredients and no animal testing.  I wish more companies were like that.  My lips have been especially dry this winter, perhaps due to a new medication, and this balm softens them and lasts fairly well.  It is a softer product than some balms, especially those petroleum-based ones.  It doesn't drag across your lips but glides on nicely.  The diameter is wider than some others, so it takes only one swipe across each lip.  Quite a nice product.",
    "images": [],
    "asin": "B07Z3NRMBS",
    "parent_asin": "B07Z3NRMBS",
    "user_id": "AE6TDCUOKCSCRL5ZHWKEL7QHOA3A",
    "timestamp": "2020-02-14 16:01:10.910000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Pharmacopia Tangerine-Flavored Lip Balm - Set of 2, 0.25oz - Nourishing Herbal Lip Elixir with 100% Natural and Certified Organic Ingredients",
    "average_rating": 4.4,
    "rating_number": 37,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41dTRMUTXKL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41dTRMUTXKL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/716CKFhZxlL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41X4y0bx0aL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41X4y0bx0aL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71XlYj5BhgL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51dft6kEmLL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51dft6kEmLL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/91iD2nyvcQL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51AdOrh4HZL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51AdOrh4HZL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/91sV+abqdNL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Our Point of View on Pharmacopia Hotel Body Wash Set",
        "url": "https://www.amazon.com/vdp/08fc99f9f012424ab3e83dee1f07bbd8?ref=dp_vse_rvc_0",
        "user_id": "/shop/influencer-20a38664"
      }
    ],
    "store": "Pharmacopia",
    "categories": [],
    "details": {
      "Brand": "Pharmacopia",
      "Item Form": "Balm",
      "Finish Type": "Natural",
      "Skin Type": "Dry",
      "Product Benefits": "Hydrating,Soothing,Nourishing",
      "Package Dimensions": "3.6 x 1.7 x 0.7 inches; 0.25 Ounces",
      "UPC": "087819800366"
    },
    "bought_together": null
  }
}