{
  "user_id": "AE2IGWDKOWONDB3FQFX3STYGWCNQ",
  "summary": "=== Purchase Information ===\nProduct Title: Women's Pleated Scarves Pashmina Shawl Wraps for Wedding Bride Bridesmaid Gifts (Black)\nReview Date: 2020/07/30\nStore: HOMELEX\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '12 x 10.7 x 0.8 inches; 7.2 Ounces', 'Department': 'Womens', 'UPC': '782903598692'}\nReview Text: So happy I added this to my headscarf collection. I got the black one but am definitely eyeing up the champagne, brown, and yellow! The fabric is so soft and I love the pleated design. It's pretty long, which allows so many styles to be worn! It could even work as a scarf around your neck! Very versatile.\nReview Title: Beautiful & Versatile\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Laloirelle Age Defy Face Oil - Virgin Marula Oil, Rosehip Oil Infused with Organic Reishi Mushroom, Ginseng, Cordyceps Mushroom - Organic Facial Oil for Anti Aging, Wrinkles, Acne Scars, Dry Skin (1oz)\nReview Date: 2020/10/09\nStore: Laloirelle\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Laloirelle', 'Item Form': 'Oil', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Face', 'Package Dimensions': '5.67 x 2.4 x 2.32 inches; 4.52 Ounces', 'Item model number': 'AD30'}\nReview Text: I'm a fan of this face oil. I find that I can only really use it as part of my nighttime skincare routine, as the finish is...well...oily. I have another face oil that I use in the morning that has more of a matte finish so I'm not shining all throughout the day. That being said, this oil is not bad. It just leaves you very shiny!<br /><br />It has a great floral smell and just 2-3 drops is enough to cover your face/neck.\nReview Title: Dewy Moisturizing Finish\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Laloirelle Luminous Face Oil - Organic Pomegranate Oil, Cacao Oil Infused W/Brightening White Peony Root, Marigold Flower, Lotus Leaf - Glowing Skin That Feels Hydrated, Plump and Firm - 1.0 fl oz\nReview Date: 2020/10/09\nStore: Laloirelle\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Laloirelle', 'Scent': 'Pomegranate', 'Item Form': 'Oil', 'Unit Count': '1.00 Fl Oz', 'Use for': 'Face', 'Package Dimensions': '5.67 x 2.36 x 2.32 inches; 4.55 Ounces'}\nReview Text: Oof! I just can't get over the smell of this one. It could be a scent that others may find pleasurable, but not me. I can't find a specific smell it reminds me of...but think a deep nutty smell mixed with the smell of old leather? The scent dissipates a bit after you rub it into your skin, but it lingers just enough to bother me. But if you are a fan of those deep, woodsy, older scents, this might be for you.<br /><br />I will say, it soaks extremely well into the skin, leaving you with a really nice matte finish that most other oils aren't capable of.\nReview Title: Scent Is Not For Me\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Laloirelle Age Renewal Serum - Phyto-Biotics Stem Cells, Botanical Hyaluronic Acid, Retinol, Multi-Vitamin, Herbal Infusion - Organic serum for anti-aging, hydration, wrinkles, all skin types (1oz)\nReview Date: 2020/10/16\nStore: Laloirelle\nAverage Rating: 4.5\nProduct Details: {'Skin Type': 'All', 'Scent': 'Aloe', 'Brand': 'Laloirelle', 'Item Form': 'Serum', 'Material Feature': 'Organic', 'Package Dimensions': '5.79 x 2.36 x 2.32 inches; 4.73 Ounces'}\nReview Text: I'm so impressed by this natural serum. From the ingredients ... to the consistency & coverage. My skin soaks this right up in my nighttime skincare routine. The scent is amazing with bright floral notes. It's a win for me.\nReview Title: Smells Amazing / Great Ingredients\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MAD | Cosmetic's Makeup Remover Cleansing Towelettes, Daily cleansing face wipes to remove waterproof mascara, alcohol free , with Vitamin E 25 count\nReview Date: 2020/11/04\nStore: JUST FOR TOTS BY MAD\nAverage Rating: 3.3\nProduct Details: {'Brand': 'JUST FOR TOTS BY MAD', 'Skin Type': 'Oily', 'Unit Count': '25.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.3 x 7.87 x 1.97 inches; 7.16 Ounces', 'UPC': '685757511926'}\nReview Text: These are okay. They are definitely not heavy duty enough if you wear a lot of makeup. I occasionally throw on a little concealer or foundation before remote meetings on ZOOM, so these wipes work for me. However it still takes me about 4 wipes to get that small amount of makeup off.<br /><br />I don't mind the scent, but I don't love it either.<br />Overall, I wouldn't brag about these wipes or go out of my way to recommend them, they're just okay.\nReview Title: Not The Worst...Not The Best\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Short Afro Kinky Curly Headband Wig Ombre Wigs Headband Wig Head Wrap Wigs 2 in 1 Headband Wigs Mix Orange Turban Afro High Puff Wigs Synthetic Scarf Wigs\nReview Date: 2020/11/29\nStore: INSTASTYLE\nAverage Rating: 3.9\nProduct Details: {'Material': 'High Temperature Fiber', 'Hair Type': 'Curly, Kinky', 'Style': 'Chic', 'Brand': 'INSTASTYLE', 'Age Range (Description)': 'Adult'}\nReview Text: This is cute. To me it gives the look of \"threw my hair up to run to the store\". Or just a quick updo. I guess you could dress it up with the hoop earrings it came with...But it's cute! The hair does have a slightly synthetic look to it...but it is synthetic, so what do you expect?\nReview Title: Cute\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Roller Massager Gel Eye Mask, Cooler Skin Roller for Face & Eye Cold Freezer Therapy Instant Pain Relief Reduce Puffy Dark Circles Migraines Stress Relief\nReview Date: 2021/03/07\nStore: CONSGIJI\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '7.83 x 3.54 x 2.36 inches; 11.11 Ounces', 'UPC': '046432534331'}\nReview Text: I really love this eye mask. I keep mine in the freezer and have used it before virtual meetings or just before going out for the day to reduce the puffiness under my eyes. While the puffiness isn't 100% just magically gone, the mask definitely helps. It's also great for just putting you at ease for a bit. The roller, however, I am not the biggest fan of. For some reason when I cool it in the freezer, the roller literally freezes and no longer rolls unless I'm *really* applying pressure. I guess the roller is meant to be used on your back or legs, not your face. But overall, pretty satisfied!\nReview Title: Not Bad! Love the Eye Mask\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kidskin- Foaming Body Wash with Tea Tree Oil- Helps Combat Body and Foot Odor and Stubborn Body Acne and Skin Issues - Cruelty Free, Gluten Free, Paraben Free, Sulfate Free, Unscented, and Vegan- Made in USA\nReview Date: 2021/03/26\nStore: Kidskin\nProduct Description: ['Kidskin Foaming Body Wash with Tea Tree Oil is designed exclusively for teens, tweens, pre teens, and boys and girls to work as an effective, yet gentle body wash. Natural ingredients like Allantoin and Bisabolol nourish beyond surface level, and penetrate into the lower levels of the skin for the deepest hydration possible, while active ingredient tea tree oil works to fight body acne and skin issues teens are commonly prone to. Unlike shower bars and other soaps, our products are designed to soothe problematic and compromised skin. With 100% Natural ingredients that are paraben, sulfate, fragrance, and gluten free, the Kidskin Foaming Body Wash with Tea Tree Oil is gentle enough for every day use. Our mission is to provide teens (like our own!) with a body wash that leaves them feeling fresh and confident so they can focus on what really matters- every day. Ingredients: Water (Aqua), Cocamidopropyl Betaine, Sodium Cocoyl Glutamate, Disodium Cocoyl Glutamate, Musa Sapientum (Banana) Extract, Polysorbate-20, Sodium Lauroyl Sarcosinate, ^ Glycerin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Sea Salt (Sodium Chloride), Tetrasodium EDTA, Citric Acid, Allantoin, Bisabolol']\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Bar, Foam', 'Skin Type': 'Sensitive', 'Brand': 'Kidskin', 'Scent': 'Tea Tree', 'Material Feature': 'Cruelty Free', 'Package Dimensions': '7.83 x 2.83 x 2.24 inches; 8 Ounces', 'Item model number': '4012', 'UPC': '880628401263', 'Manufacturer': 'Kidskin'}\nReview Text: I just wish this had more of a Tea Tree scent! I use Tea Tree Oil on my face and hair & love the benefits of it while equally loving the scent. I find that this particular body wash doesn't have the scent I love. My very first thought upon using it was that it smelled like a dog shampoo. And I don't mean that to be negative, as I still use it and continue to. It just smells more chemical than herbal, for my particular sense of smell. But I do like that it squeezes out as a lather and is super convenient to use in the shower. I wouldn't order it again but can see why someone else would! I say, give it a shot and see what you think.\nReview Title: Wish it smelled more like tea tree oil\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: O!GETi Vitamin C Foam Cleanser | Foaming Facial Cleanser, Perfect Pore Cleansing Foam, Face Wash for Dry & Sensitive Skin, Sebum Reducing, Moisture Control & Minimizing Pores, Korean Skin Care, Gift for Women, Paraben-free, 4.23 Oz (120g)\nReview Date: 2021/05/21\nStore: O!GETi\nAverage Rating: 4.5\nProduct Details: {'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'O!GETi', 'Scent': 'Tangerine', 'Material Feature': 'Natural'}\nReview Text: This cleanser is so smooth and silky on my face. It has a *very* faint citrusy scent, which I like as it's not overbearing at all. I am using this every morning before I put on my moisturizer and spf and have no complaints! Great ingredients list as well.\nReview Title: No Complaints!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SENGTERM Satin Bonnet Adjustable Sleep cap Double Layered Hair Bonnet Silky Cap for Women Curly Natural Long Hair (L, Black)\nReview Date: 2021/05/24\nStore: SENGTERM\nAverage Rating: 4.7\nProduct Details: {'Package Dimensions': '8 x 6 x 0.55 inches; 1.41 Ounces', 'UPC': '756166797512'}\nReview Text: This is a decent bonnet. The strap is about half the size of the actual space its allotted in the picture (the size of the logo tag), so it can defintey tangle inside. I haven't had that issue yet, but it's just something I noticed. It doesnt leave a mark on the forehead overnight, which is good. I will use this as my \"errands bonnet\".\nReview Title: No Marks, Small Elastic\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cordless Water Flosser for Teeth Cleaning, AZ Smile 5 Modes Portable Oral Irrigator for Teeth, Gums, Braces, Dental Care with 8 Tips and Travel Bag, Rechargeable Teeth Cleaner Pick for Home Travel\nReview Date: 2021/12/23\nStore: AZ Smile\nAverage Rating: 4.6\nProduct Details: {'Brand': 'AZ Smile', 'Special Feature': 'Multiple Pressure Settings, Multiple Tips', 'Unit Count': '1.00 Count', 'Material': 'Acrylonitrile Butadiene Styrene', 'Specification Met': 'Etl', 'Package Dimensions': '10.12 x 3.7 x 3.62 inches; 1.32 Pounds', 'Item model number': 'AZ-35-11-BK', 'Manufacturer': 'AZ Smile'}\nReview Text: This water flosser is particularly large, so if you have limited counter space...keep that in mind. It comes with several different flosser heads, which is great. I have very sensitive teeth, so I have to make sure I put in warm (almost hot) water, or it will have my teeth aching for hours! The pressure is very strong, even just on normal. I go between using Normal & Soft to get the job done. I think the design is fine, the flosser attachment rotates, however I just rotate the entire body in my hand. The rotating flosser seems pretty unnecessary. Overall, a decent flosser.\nReview Title: Large w/ a Powerful Stream\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Grown Alchemist Anti-Pollution Primer (50ml / 1.69oz)\nReview Date: 2022/05/04\nStore: Grown Alchemist\nProduct Description: ['GROWN ALCHEMIST ANTI – POLLUTION PRIMER. A revolutionary lightweight detoxifying, silicone-free gel-primer absorbs instantly creating the ultimate protected, smooth surface; hydration levels are visibly boosted, the skin’s natural healthy barrier function is noticeably strengthened while wrinkles and pores are blurred to create healthy, flawless-looking skin. BIOACTIVE INGREDIENTS. Offering a blend of Bioactive Ingredients including: Anti-Pollution Shield Complex - A potent formula, Prebiotic-Peptide, Gel-Primer Base Complex offers a silicone-free base with skin hydrating properties and Ganoderma Mushroom Extract inhibits oxidation and inflammation which assists in the detoxification of skin cells. THE GROWN ALCHEMIST DIFFERENCE. Providing the most advanced natural cosmetic products, everything is formulated with the purest and highest quality active ingredients supported by scientific research and clinical results. Developed by a multidisciplinary team of skin scientists and nutritionists, GA has developed a unique, natural and holistic beauty system, combining both topical and ingestible skincare. SCIENTIFICALLY-INNOVATIVE FORMULAS. Grown Alchemist formulates products that represent a new evolution in skincare. Scientifically–innovative formulas are capable of influencing the way the body repairs and regenerates the skin. Through a holistic scientific approach, GA identifies the mechanisms that regulate the aging process of the body and skin. RELEASING YOUR TRUE BEAUTY. Grown Alchemist continues to challenge the status quo in the world of beauty, formulating ground-breaking anti-aging results. Founders Keston and Jeremy have stayed true to their promise to create advanced natural products that improve the health of skin cells, optimizing their function and ultimately, releasing your true beauty.']\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Grown Alchemist', 'Product Benefits': 'Hydrating', 'Coverage': 'Lightweight', 'Skin Type': 'All', 'Package Information': 'Tube', 'Language': 'English', 'Product Dimensions': '3.94 x 1.57 x 1.97 inches; 1.76 Ounces', 'Item model number': '9340800005494', 'Manufacturer': 'Grown Alchemist'}\nReview Text: This primer reminds me of aloe vera...to give you a sense of its consistency. It smooths onto the skin very nicely and leaves my face moisturized and ready for product. Some days I don't use primer, just because I'm rushing...and I'll say I don't necessarily notice a huge difference between using this and not. My makeup typically goes on similarly with or without this. So is this primer necessary? Not for me. But does it work? Absolutely..and it's lightweight!\nReview Title: Great!!\nRating: 5.0\n--------------------------------------------------",
  "reference": "Women's Pleated Scarves Pashmina Shawl Wraps for Wedding Bride Bridesmaid Gifts (Black)\nHOMELEX\n{'Package Dimensions': '12 x 10.7 x 0.8 inches; 7.2 Ounces', 'Department': 'Womens', 'UPC': '782903598692'}\nSo happy I added this to my headscarf collection. I got the black one but am definitely eyeing up the champagne, brown, and yellow! The fabric is so soft and I love the pleated design. It's pretty long, which allows so many styles to be worn! It could even work as a scarf around your neck! Very versatile.\nBeautiful & Versatile\nLaloirelle Age Defy Face Oil - Virgin Marula Oil, Rosehip Oil Infused with Organic Reishi Mushroom, Ginseng, Cordyceps Mushroom - Organic Facial Oil for Anti Aging, Wrinkles, Acne Scars, Dry Skin (1oz)\nLaloirelle\n{'Brand': 'Laloirelle', 'Item Form': 'Oil', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Face', 'Package Dimensions': '5.67 x 2.4 x 2.32 inches; 4.52 Ounces', 'Item model number': 'AD30'}\nI'm a fan of this face oil. I find that I can only really use it as part of my nighttime skincare routine, as the finish is...well...oily. I have another face oil that I use in the morning that has more of a matte finish so I'm not shining all throughout the day. That being said, this oil is not bad. It just leaves you very shiny!<br /><br />It has a great floral smell and just 2-3 drops is enough to cover your face/neck.\nDewy Moisturizing Finish\nLaloirelle Luminous Face Oil - Organic Pomegranate Oil, Cacao Oil Infused W/Brightening White Peony Root, Marigold Flower, Lotus Leaf - Glowing Skin That Feels Hydrated, Plump and Firm - 1.0 fl oz\nLaloirelle\n{'Brand': 'Laloirelle', 'Scent': 'Pomegranate', 'Item Form': 'Oil', 'Unit Count': '1.00 Fl Oz', 'Use for': 'Face', 'Package Dimensions': '5.67 x 2.36 x 2.32 inches; 4.55 Ounces'}\nOof! I just can't get over the smell of this one. It could be a scent that others may find pleasurable, but not me. I can't find a specific smell it reminds me of...but think a deep nutty smell mixed with the smell of old leather? The scent dissipates a bit after you rub it into your skin, but it lingers just enough to bother me. But if you are a fan of those deep, woodsy, older scents, this might be for you.<br /><br />I will say, it soaks extremely well into the skin, leaving you with a really nice matte finish that most other oils aren't capable of.\nScent Is Not For Me\nLaloirelle Age Renewal Serum - Phyto-Biotics Stem Cells, Botanical Hyaluronic Acid, Retinol, Multi-Vitamin, Herbal Infusion - Organic serum for anti-aging, hydration, wrinkles, all skin types (1oz)\nLaloirelle\n{'Skin Type': 'All', 'Scent': 'Aloe', 'Brand': 'Laloirelle', 'Item Form': 'Serum', 'Material Feature': 'Organic', 'Package Dimensions': '5.79 x 2.36 x 2.32 inches; 4.73 Ounces'}\nI'm so impressed by this natural serum. From the ingredients ... to the consistency & coverage. My skin soaks this right up in my nighttime skincare routine. The scent is amazing with bright floral notes. It's a win for me.\nSmells Amazing / Great Ingredients\nMAD | Cosmetic's Makeup Remover Cleansing Towelettes, Daily cleansing face wipes to remove waterproof mascara, alcohol free , with Vitamin E 25 count\nJUST FOR TOTS BY MAD\n{'Brand': 'JUST FOR TOTS BY MAD', 'Skin Type': 'Oily', 'Unit Count': '25.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.3 x 7.87 x 1.97 inches; 7.16 Ounces', 'UPC': '685757511926'}\nThese are okay. They are definitely not heavy duty enough if you wear a lot of makeup. I occasionally throw on a little concealer or foundation before remote meetings on ZOOM, so these wipes work for me. However it still takes me about 4 wipes to get that small amount of makeup off.<br /><br />I don't mind the scent, but I don't love it either.<br />Overall, I wouldn't brag about these wipes or go out of my way to recommend them, they're just okay.\nNot The Worst...Not The Best\nShort Afro Kinky Curly Headband Wig Ombre Wigs Headband Wig Head Wrap Wigs 2 in 1 Headband Wigs Mix Orange Turban Afro High Puff Wigs Synthetic Scarf Wigs\nINSTASTYLE\n{'Material': 'High Temperature Fiber', 'Hair Type': 'Curly, Kinky', 'Style': 'Chic', 'Brand': 'INSTASTYLE', 'Age Range (Description)': 'Adult'}\nThis is cute. To me it gives the look of \"threw my hair up to run to the store\". Or just a quick updo. I guess you could dress it up with the hoop earrings it came with...But it's cute! The hair does have a slightly synthetic look to it...but it is synthetic, so what do you expect?\nCute\nIce Roller Massager Gel Eye Mask, Cooler Skin Roller for Face & Eye Cold Freezer Therapy Instant Pain Relief Reduce Puffy Dark Circles Migraines Stress Relief\nCONSGIJI\n{'Package Dimensions': '7.83 x 3.54 x 2.36 inches; 11.11 Ounces', 'UPC': '046432534331'}\nI really love this eye mask. I keep mine in the freezer and have used it before virtual meetings or just before going out for the day to reduce the puffiness under my eyes. While the puffiness isn't 100% just magically gone, the mask definitely helps. It's also great for just putting you at ease for a bit. The roller, however, I am not the biggest fan of. For some reason when I cool it in the freezer, the roller literally freezes and no longer rolls unless I'm *really* applying pressure. I guess the roller is meant to be used on your back or legs, not your face. But overall, pretty satisfied!\nNot Bad! Love the Eye Mask\nKidskin- Foaming Body Wash with Tea Tree Oil- Helps Combat Body and Foot Odor and Stubborn Body Acne and Skin Issues - Cruelty Free, Gluten Free, Paraben Free, Sulfate Free, Unscented, and Vegan- Made in USA\nKidskin\n['Kidskin Foaming Body Wash with Tea Tree Oil is designed exclusively for teens, tweens, pre teens, and boys and girls to work as an effective, yet gentle body wash. Natural ingredients like Allantoin and Bisabolol nourish beyond surface level, and penetrate into the lower levels of the skin for the deepest hydration possible, while active ingredient tea tree oil works to fight body acne and skin issues teens are commonly prone to. Unlike shower bars and other soaps, our products are designed to soothe problematic and compromised skin. With 100% Natural ingredients that are paraben, sulfate, fragrance, and gluten free, the Kidskin Foaming Body Wash with Tea Tree Oil is gentle enough for every day use. Our mission is to provide teens (like our own!) with a body wash that leaves them feeling fresh and confident so they can focus on what really matters- every day. Ingredients: Water (Aqua), Cocamidopropyl Betaine, Sodium Cocoyl Glutamate, Disodium Cocoyl Glutamate, Musa Sapientum (Banana) Extract, Polysorbate-20, Sodium Lauroyl Sarcosinate, ^ Glycerin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Sea Salt (Sodium Chloride), Tetrasodium EDTA, Citric Acid, Allantoin, Bisabolol']\n{'Item Form': 'Bar, Foam', 'Skin Type': 'Sensitive', 'Brand': 'Kidskin', 'Scent': 'Tea Tree', 'Material Feature': 'Cruelty Free', 'Package Dimensions': '7.83 x 2.83 x 2.24 inches; 8 Ounces', 'Item model number': '4012', 'UPC': '880628401263', 'Manufacturer': 'Kidskin'}\nI just wish this had more of a Tea Tree scent! I use Tea Tree Oil on my face and hair & love the benefits of it while equally loving the scent. I find that this particular body wash doesn't have the scent I love. My very first thought upon using it was that it smelled like a dog shampoo. And I don't mean that to be negative, as I still use it and continue to. It just smells more chemical than herbal, for my particular sense of smell. But I do like that it squeezes out as a lather and is super convenient to use in the shower. I wouldn't order it again but can see why someone else would! I say, give it a shot and see what you think.\nWish it smelled more like tea tree oil\nO!GETi Vitamin C Foam Cleanser | Foaming Facial Cleanser, Perfect Pore Cleansing Foam, Face Wash for Dry & Sensitive Skin, Sebum Reducing, Moisture Control & Minimizing Pores, Korean Skin Care, Gift for Women, Paraben-free, 4.23 Oz (120g)\nO!GETi\n{'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'O!GETi', 'Scent': 'Tangerine', 'Material Feature': 'Natural'}\nThis cleanser is so smooth and silky on my face. It has a *very* faint citrusy scent, which I like as it's not overbearing at all. I am using this every morning before I put on my moisturizer and spf and have no complaints! Great ingredients list as well.\nNo Complaints!\nSENGTERM Satin Bonnet Adjustable Sleep cap Double Layered Hair Bonnet Silky Cap for Women Curly Natural Long Hair (L, Black)\nSENGTERM\n{'Package Dimensions': '8 x 6 x 0.55 inches; 1.41 Ounces', 'UPC': '756166797512'}\nThis is a decent bonnet. The strap is about half the size of the actual space its allotted in the picture (the size of the logo tag), so it can defintey tangle inside. I haven't had that issue yet, but it's just something I noticed. It doesnt leave a mark on the forehead overnight, which is good. I will use this as my \"errands bonnet\".\nNo Marks, Small Elastic\nCordless Water Flosser for Teeth Cleaning, AZ Smile 5 Modes Portable Oral Irrigator for Teeth, Gums, Braces, Dental Care with 8 Tips and Travel Bag, Rechargeable Teeth Cleaner Pick for Home Travel\nAZ Smile\n{'Brand': 'AZ Smile', 'Special Feature': 'Multiple Pressure Settings, Multiple Tips', 'Unit Count': '1.00 Count', 'Material': 'Acrylonitrile Butadiene Styrene', 'Specification Met': 'Etl', 'Package Dimensions': '10.12 x 3.7 x 3.62 inches; 1.32 Pounds', 'Item model number': 'AZ-35-11-BK', 'Manufacturer': 'AZ Smile'}\nThis water flosser is particularly large, so if you have limited counter space...keep that in mind. It comes with several different flosser heads, which is great. I have very sensitive teeth, so I have to make sure I put in warm (almost hot) water, or it will have my teeth aching for hours! The pressure is very strong, even just on normal. I go between using Normal & Soft to get the job done. I think the design is fine, the flosser attachment rotates, however I just rotate the entire body in my hand. The rotating flosser seems pretty unnecessary. Overall, a decent flosser.\nLarge w/ a Powerful Stream\nGrown Alchemist Anti-Pollution Primer (50ml / 1.69oz)\nGrown Alchemist\n['GROWN ALCHEMIST ANTI – POLLUTION PRIMER. A revolutionary lightweight detoxifying, silicone-free gel-primer absorbs instantly creating the ultimate protected, smooth surface; hydration levels are visibly boosted, the skin’s natural healthy barrier function is noticeably strengthened while wrinkles and pores are blurred to create healthy, flawless-looking skin. BIOACTIVE INGREDIENTS. Offering a blend of Bioactive Ingredients including: Anti-Pollution Shield Complex - A potent formula, Prebiotic-Peptide, Gel-Primer Base Complex offers a silicone-free base with skin hydrating properties and Ganoderma Mushroom Extract inhibits oxidation and inflammation which assists in the detoxification of skin cells. THE GROWN ALCHEMIST DIFFERENCE. Providing the most advanced natural cosmetic products, everything is formulated with the purest and highest quality active ingredients supported by scientific research and clinical results. Developed by a multidisciplinary team of skin scientists and nutritionists, GA has developed a unique, natural and holistic beauty system, combining both topical and ingestible skincare. SCIENTIFICALLY-INNOVATIVE FORMULAS. Grown Alchemist formulates products that represent a new evolution in skincare. Scientifically–innovative formulas are capable of influencing the way the body repairs and regenerates the skin. Through a holistic scientific approach, GA identifies the mechanisms that regulate the aging process of the body and skin. RELEASING YOUR TRUE BEAUTY. Grown Alchemist continues to challenge the status quo in the world of beauty, formulating ground-breaking anti-aging results. Founders Keston and Jeremy have stayed true to their promise to create advanced natural products that improve the health of skin cells, optimizing their function and ultimately, releasing your true beauty.']\n{'Brand': 'Grown Alchemist', 'Product Benefits': 'Hydrating', 'Coverage': 'Lightweight', 'Skin Type': 'All', 'Package Information': 'Tube', 'Language': 'English', 'Product Dimensions': '3.94 x 1.57 x 1.97 inches; 1.76 Ounces', 'Item model number': '9340800005494', 'Manufacturer': 'Grown Alchemist'}\nThis primer reminds me of aloe vera...to give you a sense of its consistency. It smooths onto the skin very nicely and leaves my face moisturized and ready for product. Some days I don't use primer, just because I'm rushing...and I'll say I don't necessarily notice a huge difference between using this and not. My makeup typically goes on similarly with or without this. So is this primer necessary? Not for me. But does it work? Absolutely..and it's lightweight!\nGreat!!",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Women's Pleated Scarves Pashmina Shawl Wraps for Wedding Bride Bridesmaid Gifts (Black)\nReview Date: 2020/07/30\nStore: HOMELEX\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '12 x 10.7 x 0.8 inches; 7.2 Ounces', 'Department': 'Womens', 'UPC': '782903598692'}\nReview Text: So happy I added this to my headscarf collection. I got the black one but am definitely eyeing up the champagne, brown, and yellow! The fabric is so soft and I love the pleated design. It's pretty long, which allows so many styles to be worn! It could even work as a scarf around your neck! Very versatile.\nReview Title: Beautiful & Versatile\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Laloirelle Age Defy Face Oil - Virgin Marula Oil, Rosehip Oil Infused with Organic Reishi Mushroom, Ginseng, Cordyceps Mushroom - Organic Facial Oil for Anti Aging, Wrinkles, Acne Scars, Dry Skin (1oz)\nReview Date: 2020/10/09\nStore: Laloirelle\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Laloirelle', 'Item Form': 'Oil', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Face', 'Package Dimensions': '5.67 x 2.4 x 2.32 inches; 4.52 Ounces', 'Item model number': 'AD30'}\nReview Text: I'm a fan of this face oil. I find that I can only really use it as part of my nighttime skincare routine, as the finish is...well...oily. I have another face oil that I use in the morning that has more of a matte finish so I'm not shining all throughout the day. That being said, this oil is not bad. It just leaves you very shiny!<br /><br />It has a great floral smell and just 2-3 drops is enough to cover your face/neck.\nReview Title: Dewy Moisturizing Finish\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Laloirelle Luminous Face Oil - Organic Pomegranate Oil, Cacao Oil Infused W/Brightening White Peony Root, Marigold Flower, Lotus Leaf - Glowing Skin That Feels Hydrated, Plump and Firm - 1.0 fl oz\nReview Date: 2020/10/09\nStore: Laloirelle\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Laloirelle', 'Scent': 'Pomegranate', 'Item Form': 'Oil', 'Unit Count': '1.00 Fl Oz', 'Use for': 'Face', 'Package Dimensions': '5.67 x 2.36 x 2.32 inches; 4.55 Ounces'}\nReview Text: Oof! I just can't get over the smell of this one. It could be a scent that others may find pleasurable, but not me. I can't find a specific smell it reminds me of...but think a deep nutty smell mixed with the smell of old leather? The scent dissipates a bit after you rub it into your skin, but it lingers just enough to bother me. But if you are a fan of those deep, woodsy, older scents, this might be for you.<br /><br />I will say, it soaks extremely well into the skin, leaving you with a really nice matte finish that most other oils aren't capable of.\nReview Title: Scent Is Not For Me\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Laloirelle Age Renewal Serum - Phyto-Biotics Stem Cells, Botanical Hyaluronic Acid, Retinol, Multi-Vitamin, Herbal Infusion - Organic serum for anti-aging, hydration, wrinkles, all skin types (1oz)\nReview Date: 2020/10/16\nStore: Laloirelle\nAverage Rating: 4.5\nProduct Details: {'Skin Type': 'All', 'Scent': 'Aloe', 'Brand': 'Laloirelle', 'Item Form': 'Serum', 'Material Feature': 'Organic', 'Package Dimensions': '5.79 x 2.36 x 2.32 inches; 4.73 Ounces'}\nReview Text: I'm so impressed by this natural serum. From the ingredients ... to the consistency & coverage. My skin soaks this right up in my nighttime skincare routine. The scent is amazing with bright floral notes. It's a win for me.\nReview Title: Smells Amazing / Great Ingredients\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MAD | Cosmetic's Makeup Remover Cleansing Towelettes, Daily cleansing face wipes to remove waterproof mascara, alcohol free , with Vitamin E 25 count\nReview Date: 2020/11/04\nStore: JUST FOR TOTS BY MAD\nAverage Rating: 3.3\nProduct Details: {'Brand': 'JUST FOR TOTS BY MAD', 'Skin Type': 'Oily', 'Unit Count': '25.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.3 x 7.87 x 1.97 inches; 7.16 Ounces', 'UPC': '685757511926'}\nReview Text: These are okay. They are definitely not heavy duty enough if you wear a lot of makeup. I occasionally throw on a little concealer or foundation before remote meetings on ZOOM, so these wipes work for me. However it still takes me about 4 wipes to get that small amount of makeup off.<br /><br />I don't mind the scent, but I don't love it either.<br />Overall, I wouldn't brag about these wipes or go out of my way to recommend them, they're just okay.\nReview Title: Not The Worst...Not The Best\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Short Afro Kinky Curly Headband Wig Ombre Wigs Headband Wig Head Wrap Wigs 2 in 1 Headband Wigs Mix Orange Turban Afro High Puff Wigs Synthetic Scarf Wigs\nReview Date: 2020/11/29\nStore: INSTASTYLE\nAverage Rating: 3.9\nProduct Details: {'Material': 'High Temperature Fiber', 'Hair Type': 'Curly, Kinky', 'Style': 'Chic', 'Brand': 'INSTASTYLE', 'Age Range (Description)': 'Adult'}\nReview Text: This is cute. To me it gives the look of \"threw my hair up to run to the store\". Or just a quick updo. I guess you could dress it up with the hoop earrings it came with...But it's cute! The hair does have a slightly synthetic look to it...but it is synthetic, so what do you expect?\nReview Title: Cute\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ice Roller Massager Gel Eye Mask, Cooler Skin Roller for Face & Eye Cold Freezer Therapy Instant Pain Relief Reduce Puffy Dark Circles Migraines Stress Relief\nReview Date: 2021/03/07\nStore: CONSGIJI\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '7.83 x 3.54 x 2.36 inches; 11.11 Ounces', 'UPC': '046432534331'}\nReview Text: I really love this eye mask. I keep mine in the freezer and have used it before virtual meetings or just before going out for the day to reduce the puffiness under my eyes. While the puffiness isn't 100% just magically gone, the mask definitely helps. It's also great for just putting you at ease for a bit. The roller, however, I am not the biggest fan of. For some reason when I cool it in the freezer, the roller literally freezes and no longer rolls unless I'm *really* applying pressure. I guess the roller is meant to be used on your back or legs, not your face. But overall, pretty satisfied!\nReview Title: Not Bad! Love the Eye Mask\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kidskin- Foaming Body Wash with Tea Tree Oil- Helps Combat Body and Foot Odor and Stubborn Body Acne and Skin Issues - Cruelty Free, Gluten Free, Paraben Free, Sulfate Free, Unscented, and Vegan- Made in USA\nReview Date: 2021/03/26\nStore: Kidskin\nProduct Description: ['Kidskin Foaming Body Wash with Tea Tree Oil is designed exclusively for teens, tweens, pre teens, and boys and girls to work as an effective, yet gentle body wash. Natural ingredients like Allantoin and Bisabolol nourish beyond surface level, and penetrate into the lower levels of the skin for the deepest hydration possible, while active ingredient tea tree oil works to fight body acne and skin issues teens are commonly prone to. Unlike shower bars and other soaps, our products are designed to soothe problematic and compromised skin. With 100% Natural ingredients that are paraben, sulfate, fragrance, and gluten free, the Kidskin Foaming Body Wash with Tea Tree Oil is gentle enough for every day use. Our mission is to provide teens (like our own!) with a body wash that leaves them feeling fresh and confident so they can focus on what really matters- every day. Ingredients: Water (Aqua), Cocamidopropyl Betaine, Sodium Cocoyl Glutamate, Disodium Cocoyl Glutamate, Musa Sapientum (Banana) Extract, Polysorbate-20, Sodium Lauroyl Sarcosinate, ^ Glycerin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Sea Salt (Sodium Chloride), Tetrasodium EDTA, Citric Acid, Allantoin, Bisabolol']\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Bar, Foam', 'Skin Type': 'Sensitive', 'Brand': 'Kidskin', 'Scent': 'Tea Tree', 'Material Feature': 'Cruelty Free', 'Package Dimensions': '7.83 x 2.83 x 2.24 inches; 8 Ounces', 'Item model number': '4012', 'UPC': '880628401263', 'Manufacturer': 'Kidskin'}\nReview Text: I just wish this had more of a Tea Tree scent! I use Tea Tree Oil on my face and hair & love the benefits of it while equally loving the scent. I find that this particular body wash doesn't have the scent I love. My very first thought upon using it was that it smelled like a dog shampoo. And I don't mean that to be negative, as I still use it and continue to. It just smells more chemical than herbal, for my particular sense of smell. But I do like that it squeezes out as a lather and is super convenient to use in the shower. I wouldn't order it again but can see why someone else would! I say, give it a shot and see what you think.\nReview Title: Wish it smelled more like tea tree oil\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: O!GETi Vitamin C Foam Cleanser | Foaming Facial Cleanser, Perfect Pore Cleansing Foam, Face Wash for Dry & Sensitive Skin, Sebum Reducing, Moisture Control & Minimizing Pores, Korean Skin Care, Gift for Women, Paraben-free, 4.23 Oz (120g)\nReview Date: 2021/05/21\nStore: O!GETi\nAverage Rating: 4.5\nProduct Details: {'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'O!GETi', 'Scent': 'Tangerine', 'Material Feature': 'Natural'}\nReview Text: This cleanser is so smooth and silky on my face. It has a *very* faint citrusy scent, which I like as it's not overbearing at all. I am using this every morning before I put on my moisturizer and spf and have no complaints! Great ingredients list as well.\nReview Title: No Complaints!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SENGTERM Satin Bonnet Adjustable Sleep cap Double Layered Hair Bonnet Silky Cap for Women Curly Natural Long Hair (L, Black)\nReview Date: 2021/05/24\nStore: SENGTERM\nAverage Rating: 4.7\nProduct Details: {'Package Dimensions': '8 x 6 x 0.55 inches; 1.41 Ounces', 'UPC': '756166797512'}\nReview Text: This is a decent bonnet. The strap is about half the size of the actual space its allotted in the picture (the size of the logo tag), so it can defintey tangle inside. I haven't had that issue yet, but it's just something I noticed. It doesnt leave a mark on the forehead overnight, which is good. I will use this as my \"errands bonnet\".\nReview Title: No Marks, Small Elastic\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cordless Water Flosser for Teeth Cleaning, AZ Smile 5 Modes Portable Oral Irrigator for Teeth, Gums, Braces, Dental Care with 8 Tips and Travel Bag, Rechargeable Teeth Cleaner Pick for Home Travel\nReview Date: 2021/12/23\nStore: AZ Smile\nAverage Rating: 4.6\nProduct Details: {'Brand': 'AZ Smile', 'Special Feature': 'Multiple Pressure Settings, Multiple Tips', 'Unit Count': '1.00 Count', 'Material': 'Acrylonitrile Butadiene Styrene', 'Specification Met': 'Etl', 'Package Dimensions': '10.12 x 3.7 x 3.62 inches; 1.32 Pounds', 'Item model number': 'AZ-35-11-BK', 'Manufacturer': 'AZ Smile'}\nReview Text: This water flosser is particularly large, so if you have limited counter space...keep that in mind. It comes with several different flosser heads, which is great. I have very sensitive teeth, so I have to make sure I put in warm (almost hot) water, or it will have my teeth aching for hours! The pressure is very strong, even just on normal. I go between using Normal & Soft to get the job done. I think the design is fine, the flosser attachment rotates, however I just rotate the entire body in my hand. The rotating flosser seems pretty unnecessary. Overall, a decent flosser.\nReview Title: Large w/ a Powerful Stream\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Grown Alchemist Anti-Pollution Primer (50ml / 1.69oz)\nReview Date: 2022/05/04\nStore: Grown Alchemist\nProduct Description: ['GROWN ALCHEMIST ANTI – POLLUTION PRIMER. A revolutionary lightweight detoxifying, silicone-free gel-primer absorbs instantly creating the ultimate protected, smooth surface; hydration levels are visibly boosted, the skin’s natural healthy barrier function is noticeably strengthened while wrinkles and pores are blurred to create healthy, flawless-looking skin. BIOACTIVE INGREDIENTS. Offering a blend of Bioactive Ingredients including: Anti-Pollution Shield Complex - A potent formula, Prebiotic-Peptide, Gel-Primer Base Complex offers a silicone-free base with skin hydrating properties and Ganoderma Mushroom Extract inhibits oxidation and inflammation which assists in the detoxification of skin cells. THE GROWN ALCHEMIST DIFFERENCE. Providing the most advanced natural cosmetic products, everything is formulated with the purest and highest quality active ingredients supported by scientific research and clinical results. Developed by a multidisciplinary team of skin scientists and nutritionists, GA has developed a unique, natural and holistic beauty system, combining both topical and ingestible skincare. SCIENTIFICALLY-INNOVATIVE FORMULAS. Grown Alchemist formulates products that represent a new evolution in skincare. Scientifically–innovative formulas are capable of influencing the way the body repairs and regenerates the skin. Through a holistic scientific approach, GA identifies the mechanisms that regulate the aging process of the body and skin. RELEASING YOUR TRUE BEAUTY. Grown Alchemist continues to challenge the status quo in the world of beauty, formulating ground-breaking anti-aging results. Founders Keston and Jeremy have stayed true to their promise to create advanced natural products that improve the health of skin cells, optimizing their function and ultimately, releasing your true beauty.']\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Grown Alchemist', 'Product Benefits': 'Hydrating', 'Coverage': 'Lightweight', 'Skin Type': 'All', 'Package Information': 'Tube', 'Language': 'English', 'Product Dimensions': '3.94 x 1.57 x 1.97 inches; 1.76 Ounces', 'Item model number': '9340800005494', 'Manufacturer': 'Grown Alchemist'}\nReview Text: This primer reminds me of aloe vera...to give you a sense of its consistency. It smooths onto the skin very nicely and leaves my face moisturized and ready for product. Some days I don't use primer, just because I'm rushing...and I'll say I don't necessarily notice a huge difference between using this and not. My makeup typically goes on similarly with or without this. So is this primer necessary? Not for me. But does it work? Absolutely..and it's lightweight!\nReview Title: Great!!\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:\nThis individual demonstrates a consistent appreciation for products that blend functionality with versatility, particularly in fashion accessories and skincare. A strong preference for high-quality materials is evident, as indicated by their satisfaction with the softness of fabrics and effectiveness in skincare products, often rating items around 4.0 and above. They show a clear inclination towards products that enhance their beauty routines, specifically organic and natural ingredients, while also being attentive to scent, preferring pleasant fragrances.\n\nThe buyer exhibits a sensitivity to product quality, notably noting finishes and performance, as seen in their skincare oil assessments. However, there are instances where they show moderate dissatisfaction with certain scents, indicating a nuanced palate. This buyer appears to prioritize products that offer multi-functional use, as highlighted by their interest in a diverse range of cosmetics, from face oils to hair accessories.\n\nPricing trends suggest a willingness to invest in higher-quality items but with careful consideration, especially towards personal care products. Overall, core preferences revolve around high-quality, versatile products, effective skincare solutions, and enjoyable scents, with a preference for organic and natural formulations.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Confusing Application, but Great Ingredients",
    "text": "I'm a bit confused by this. Sometimes when you pump, just the pink side comes out...then white. Then sometimes they both come out together in one pump. Are you supposed to smooth the pink on, then white? Both at the same time? Does it matter? Not too sure. However this has a very faint feminine scent to it and leaves my skin feeling deeply moisturized. I only use at night, as it is a bit too heavy for day use (for me). But it has undeniably amazing ingredients! I'll be sad when I'm all out of this!",
    "images": [],
    "asin": "B0B4JPGX8P",
    "parent_asin": "B0B4JPGX8P",
    "user_id": "AE2IGWDKOWONDB3FQFX3STYGWCNQ",
    "timestamp": "2022-08-26 15:16:19.702000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Elli K Essential Sincerity From AZ Time Reverse Double Ampoule – Made in USA - Double Layering Serum – Repairing & Deep Hydrating – Oil and Cream Formula for Healthy and Smooth Skin, (2.02 fl.oz.)",
    "average_rating": 3.7,
    "rating_number": 28,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31HikBR7yBL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31HikBR7yBL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61sT51Yl+KL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51xogTbgpeL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51xogTbgpeL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71RdFyhAqhL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51zP8HjVaQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51zP8HjVaQL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71+CDLZtKNL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61Tpwk01rYL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/61Tpwk01rYL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/819SmaxxOML._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512RKXZ1EoL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/512RKXZ1EoL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/710WGH2B5ML._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51K-VySV43L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51K-VySV43L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/716bB+zGYIL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51f+H29zDuL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51f+H29zDuL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71qh03sjOlL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "My skin look and feels nice but..",
        "url": "https://www.amazon.com/vdp/04ca62f9844e461eb8b0ce73c04fcb2f?ref=dp_vse_rvc_0",
        "user_id": "AG2BHBTR4XMCK2OHDTRSZ6OCM6JA"
      },
      {
        "title": "Essential Sincerity From AZ Time Reverse Double Ampoule",
        "url": "https://www.amazon.com/vdp/0d5ffcc2436f419180ed31d6e71308e8?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "Elli K Essential Sincerity From AZ",
        "url": "https://www.amazon.com/vdp/02cd3cc04d124bc3a1a3f1193dd830b5?ref=dp_vse_rvc_2",
        "user_id": ""
      },
      {
        "title": "one step color corrector ",
        "url": "https://www.amazon.com/vdp/08a5438999884f93b6de6860db563bbd?ref=dp_vse_rvc_3",
        "user_id": ""
      },
      {
        "title": "HONEST Review of Stila One Step Correct - Watch Before Buying",
        "url": "https://www.amazon.com/vdp/0646a7fa6fdb44a3839431e5916ab58d?ref=dp_vse_rvc_4",
        "user_id": "/shop/jasonalex28"
      }
    ],
    "store": "ELLI K",
    "categories": [],
    "details": {
      "Skin Type": "Sensitive",
      "Product Benefits": "Hydrating,Anti-aging",
      "Use for": "Face",
      "Scent": "Banana",
      "Brand": "ELLI K",
      "Package Dimensions": "5.24 x 1.93 x 1.73 inches; 5.29 Ounces",
      "UPC": "841960174819"
    },
    "bought_together": null
  }
}