{
  "user_id": "AEOBB7VMAUNZ6ETYINJLQ222ED4Q",
  "summary": "=== Purchase Information ===\nProduct Title: Bold Lash Effect Mascara- Best for Length & Volume & Sensitive Eyes- Water Resistant & Smudge Proof - Clump Free - NO Parabens or SLS! (Black)\nReview Date: 2016/01/22\nAverage Rating: 3.5\nProduct Details: {'Special Feature': 'Smudge Proof, Water Resistant', 'Specialty': 'Paraben Free', 'Unit Count': '1.00 Count', 'Package Information': 'Tube', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.4 x 0.8 x 0.8 inches; 0.32 Ounces', 'UPC': '013189194316'}\nReview Text: This is the second product I've used for Mia Adora cosmetics. The first Mia Adora product I've used is their tattoo effect liquid eyeliner pen, which I highly recommend. This mascara is a beautiful true black. Often times mascara will dry to a much lighter shade after application, this isn't so with this product. This doesn't flake off like my other mascara that I was using up until I got this. The description says it's for short thin lashes, but it works nicely on my lashes which are pretty long. Often times I find that mascaras can't cover the entire length of my lashes without flaking off at the ends. This works just as well as a forty five dollar mascara that I once splurged on. Over the decade that I've been using mascara I've come to the conclusion that the super expensive mascara seem to work the same as regular priced mascara. Also a huge plus for me is that this mascara doesn't run when my eyes water from the cold winter winds. I have very sensitive skin and eyes, so far I have not noticed any sensitivity or other adverse reactions. Very happy with this mascara. I'm certainly falling in love Mia Adora cosmetics! Disclaimer: I received this item at a discounted price in exchange for my honest and unbiased review. All views expressed above are 100% my own.\nReview Title: Lovely lashes!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Healing Clay Mud Mask for Deep Pore Cleansing - Best Face Mask for Acne, Oily Skin & Blackheads - Reduces Wrinkles & Minimizes Pores - Organic and Natural Skin Cleanser & Therapeutic Spa Mask – 2oz\nReview Date: 2016/01/29\nStore: Derma-nu Miracle Skin Remedies\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Derma-nu Miracle Skin Remedies', 'Item Form': 'Clay', 'Product Benefits': 'Cleansing', 'Scent': 'Coconut', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 4 inches; 2.56 Ounces', 'UPC': '787421301601'}\nReview Text: I'll start off this review by telling you about my incredibly problematic skin. First off I have been suffering with mild acne for the past eight years. Recently I have developed terrible long lasting cystic acne break outs on my face, neck, chest, and back. If you suffer from this awfully painful form of acne you know that when a break out stops the evidence does not disappear, but instead leaves a huge dark mark or large indented scar ( and when you're really unlucky it will leave a combination of both). I have been using Dead Sea mud masks about twice every week which has been helping, but I was in need for something stronger. This is definitely stronger than your run of the mill Dead Sea mud mask. I have pretty sensitive skin and this honestly aggravates my skin a little and leaves it ruddy and burning, so this product may not be suitable for extremely sensitive skin. Please also notice that the jar only contains 2 ounces of product which will go by very fast, especially if used on more than just the face.<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the  &#34;YES&#34; vote button. I am always looking forward to improving  my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: My skin might be too sensitive for this product\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Moroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nReview Date: 2016/02/02\nStore: Pure Body Naturals\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nReview Text: Wonderful experience so far! I dye my hair crazy colors about every month. Once in a while I will bleach my locks so the color shows up brighter and lasts longer. This causes some pretty extensive damage. This shampoo is fantastic because it helps heal and restore my strands! The shampoo also doesn't strip off my color! This is very important to me because I always want my dye job to be vivid and last as long as possible. I was worried that the argan oil would make my hair greasy but it doesn't! I naturally have pretty oily hair and it doesn't seem to have any negative impact on that. It makes my hair super soft not oily!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the  &#34;YES&#34; vote button. I am always looking forward to improving  my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: Works well for my hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ultimate Smile Professional At-Home Teeth Whitening Kit\nReview Date: 2016/02/14\nStore: Ultimate Smile\nAverage Rating: 3.2\nProduct Details: {'Package Dimensions': '7.7 x 6.2 x 1.7 inches; 5.6 Ounces', 'UPC': '700580626118', 'Manufacturer': 'Ultimate Smile'}\nReview Text: This is a very nice little tooth whitening kit! It is so great that it comes with two tubes of whitener, so I know this will last a very long time! I noticed a significant difference after the first use, and my teeth are already pretty white and bright! I love that this comes with a case for the trays, my old kit did not have one and I had to use a plastic bag. This kit is way more organized than most, I really like the design it is simple and doesn't contribute a lot to clutter. I have included a photo from my I boxing of the whitener kit. Very happy with this product!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &quot;YES&quot; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: Fantastic little kit!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: African Black Soap - Face & Body Wash - All Natural Soap for Acne, Eczema, Psoriasis - with Shea Butter and Coconut Oil - 12 OZ by Cleopatra's Choice\nReview Date: 2016/02/16\nStore: Cleopatra's Choice\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Bar', 'Brand': \"Cleopatra's Choice\", 'Scent': 'Coconut', 'Material Feature': 'Natural', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.3 x 3.2 x 3.2 inches; 12 Ounces', 'UPC': '687927091160'}\nReview Text: I absolutely love this African black soap! This is such a great value, this is a huge amount of African black soap. African black soap is always pretty pricey where I live so I'm very glad I can buy such a good amount here from Cleopatra's choice! I use African black soap as a facial and all over cleanser. Another thing I use African black soap for is cleaning my makeup brushes and sponges. I find that African black soap cleans even better than cleansers I have purchased specifically for cleaning make up brushes. I know it works well because it makes white makeup sponges look brand new! The only issue I had with this product is that the packaging didn't really hold up in transit, it arrived with a huge dent on it, though it may have happened before transit because nothing in the package could have made this mark. I have included a photo of the damage below. This in no way changes or reduces the products effectiveness. Happy with my purchase!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &#34;YES&#34; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: I love African black soap!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yalmeh Naturals Eye Bright Gel\nReview Date: 2016/02/23\nStore: Yalmeh Peerless Beauty\nProduct Description: [\"Yalmeh Glory Eye Bright Gel ranks as a superior Anti Aging product for all your skin. It is extremely effective at eliminating dark circles and wrinkles. It is also efficient for puffiness and loss of tone. SAFE, ALL NATURAL INGREDIENTS- Yalmeh Glory Eye Bright Gel contains all natural ingredients, no toxic chemicals or cancer causing additives - no mineral oil, sulfates or alcohol ,propylene glycol or paraben. We do not test our products on animals NEVER-EVER. This is the BEST EYE GEL and is an effective natural solution for all types of skin. And, it lasts forever - a little goes a long way. And what matters most, however, is that the Yalmeh Glory Eye Gel works incredibly well. You will feel better both inside and out. THIS EYE GEL is 100% natural & 75% organic Click the 'Add to Cart' button at the top of this page NOW - Your Eyes Will Thank You.\"]\nAverage Rating: 3.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.4 x 0.4 x 0.4 inches; 0.35 Ounces', 'Item model number': 'GEBG-Y005', 'UPC': '640671981439 885612923240', 'Manufacturer': 'SETAF'}\nReview Text: Always a fan of this brand, I have purchased a few of their products over the past year. The gel has a nice light texture and isn't sticky at all. My eye area is soothed after I use this ( I use it morning and night). I apply the gel to my clean eye area daily and follow with a denser eye cream at night. I'm a college student that experiences many late nights. These late nights have a habit of causing me dark circles ( so not cute, haha! Makes it very obvious I stayed up all night to write that last minute paper) this has certainly been helping lighten and brighten my under eye area! It disappears into the skin almost instantly, so applying eye makeup and foundation over it is no problem. I actually think it makes my make up look better, it acts as sort of an eye primer. Loving this eye gel so far, will revise if anything changes!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &#34;YES&#34; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: Great eye gel\nRating: 5.0\n--------------------------------------------------",
  "reference": "Bold Lash Effect Mascara- Best for Length & Volume & Sensitive Eyes- Water Resistant & Smudge Proof - Clump Free - NO Parabens or SLS! (Black)\n{'Special Feature': 'Smudge Proof, Water Resistant', 'Specialty': 'Paraben Free', 'Unit Count': '1.00 Count', 'Package Information': 'Tube', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.4 x 0.8 x 0.8 inches; 0.32 Ounces', 'UPC': '013189194316'}\nThis is the second product I've used for Mia Adora cosmetics. The first Mia Adora product I've used is their tattoo effect liquid eyeliner pen, which I highly recommend. This mascara is a beautiful true black. Often times mascara will dry to a much lighter shade after application, this isn't so with this product. This doesn't flake off like my other mascara that I was using up until I got this. The description says it's for short thin lashes, but it works nicely on my lashes which are pretty long. Often times I find that mascaras can't cover the entire length of my lashes without flaking off at the ends. This works just as well as a forty five dollar mascara that I once splurged on. Over the decade that I've been using mascara I've come to the conclusion that the super expensive mascara seem to work the same as regular priced mascara. Also a huge plus for me is that this mascara doesn't run when my eyes water from the cold winter winds. I have very sensitive skin and eyes, so far I have not noticed any sensitivity or other adverse reactions. Very happy with this mascara. I'm certainly falling in love Mia Adora cosmetics! Disclaimer: I received this item at a discounted price in exchange for my honest and unbiased review. All views expressed above are 100% my own.\nLovely lashes!\nHealing Clay Mud Mask for Deep Pore Cleansing - Best Face Mask for Acne, Oily Skin & Blackheads - Reduces Wrinkles & Minimizes Pores - Organic and Natural Skin Cleanser & Therapeutic Spa Mask – 2oz\nDerma-nu Miracle Skin Remedies\n{'Brand': 'Derma-nu Miracle Skin Remedies', 'Item Form': 'Clay', 'Product Benefits': 'Cleansing', 'Scent': 'Coconut', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 4 inches; 2.56 Ounces', 'UPC': '787421301601'}\nI'll start off this review by telling you about my incredibly problematic skin. First off I have been suffering with mild acne for the past eight years. Recently I have developed terrible long lasting cystic acne break outs on my face, neck, chest, and back. If you suffer from this awfully painful form of acne you know that when a break out stops the evidence does not disappear, but instead leaves a huge dark mark or large indented scar ( and when you're really unlucky it will leave a combination of both). I have been using Dead Sea mud masks about twice every week which has been helping, but I was in need for something stronger. This is definitely stronger than your run of the mill Dead Sea mud mask. I have pretty sensitive skin and this honestly aggravates my skin a little and leaves it ruddy and burning, so this product may not be suitable for extremely sensitive skin. Please also notice that the jar only contains 2 ounces of product which will go by very fast, especially if used on more than just the face.<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the  &#34;YES&#34; vote button. I am always looking forward to improving  my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nMy skin might be too sensitive for this product\nMoroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nPure Body Naturals\n{'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nWonderful experience so far! I dye my hair crazy colors about every month. Once in a while I will bleach my locks so the color shows up brighter and lasts longer. This causes some pretty extensive damage. This shampoo is fantastic because it helps heal and restore my strands! The shampoo also doesn't strip off my color! This is very important to me because I always want my dye job to be vivid and last as long as possible. I was worried that the argan oil would make my hair greasy but it doesn't! I naturally have pretty oily hair and it doesn't seem to have any negative impact on that. It makes my hair super soft not oily!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the  &#34;YES&#34; vote button. I am always looking forward to improving  my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nWorks well for my hair\nUltimate Smile Professional At-Home Teeth Whitening Kit\nUltimate Smile\n{'Package Dimensions': '7.7 x 6.2 x 1.7 inches; 5.6 Ounces', 'UPC': '700580626118', 'Manufacturer': 'Ultimate Smile'}\nThis is a very nice little tooth whitening kit! It is so great that it comes with two tubes of whitener, so I know this will last a very long time! I noticed a significant difference after the first use, and my teeth are already pretty white and bright! I love that this comes with a case for the trays, my old kit did not have one and I had to use a plastic bag. This kit is way more organized than most, I really like the design it is simple and doesn't contribute a lot to clutter. I have included a photo from my I boxing of the whitener kit. Very happy with this product!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &quot;YES&quot; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nFantastic little kit!\nAfrican Black Soap - Face & Body Wash - All Natural Soap for Acne, Eczema, Psoriasis - with Shea Butter and Coconut Oil - 12 OZ by Cleopatra's Choice\nCleopatra's Choice\n{'Item Form': 'Bar', 'Brand': \"Cleopatra's Choice\", 'Scent': 'Coconut', 'Material Feature': 'Natural', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.3 x 3.2 x 3.2 inches; 12 Ounces', 'UPC': '687927091160'}\nI absolutely love this African black soap! This is such a great value, this is a huge amount of African black soap. African black soap is always pretty pricey where I live so I'm very glad I can buy such a good amount here from Cleopatra's choice! I use African black soap as a facial and all over cleanser. Another thing I use African black soap for is cleaning my makeup brushes and sponges. I find that African black soap cleans even better than cleansers I have purchased specifically for cleaning make up brushes. I know it works well because it makes white makeup sponges look brand new! The only issue I had with this product is that the packaging didn't really hold up in transit, it arrived with a huge dent on it, though it may have happened before transit because nothing in the package could have made this mark. I have included a photo of the damage below. This in no way changes or reduces the products effectiveness. Happy with my purchase!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &#34;YES&#34; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nI love African black soap!\nYalmeh Naturals Eye Bright Gel\nYalmeh Peerless Beauty\n[\"Yalmeh Glory Eye Bright Gel ranks as a superior Anti Aging product for all your skin. It is extremely effective at eliminating dark circles and wrinkles. It is also efficient for puffiness and loss of tone. SAFE, ALL NATURAL INGREDIENTS- Yalmeh Glory Eye Bright Gel contains all natural ingredients, no toxic chemicals or cancer causing additives - no mineral oil, sulfates or alcohol ,propylene glycol or paraben. We do not test our products on animals NEVER-EVER. This is the BEST EYE GEL and is an effective natural solution for all types of skin. And, it lasts forever - a little goes a long way. And what matters most, however, is that the Yalmeh Glory Eye Gel works incredibly well. You will feel better both inside and out. THIS EYE GEL is 100% natural & 75% organic Click the 'Add to Cart' button at the top of this page NOW - Your Eyes Will Thank You.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.4 x 0.4 x 0.4 inches; 0.35 Ounces', 'Item model number': 'GEBG-Y005', 'UPC': '640671981439 885612923240', 'Manufacturer': 'SETAF'}\nAlways a fan of this brand, I have purchased a few of their products over the past year. The gel has a nice light texture and isn't sticky at all. My eye area is soothed after I use this ( I use it morning and night). I apply the gel to my clean eye area daily and follow with a denser eye cream at night. I'm a college student that experiences many late nights. These late nights have a habit of causing me dark circles ( so not cute, haha! Makes it very obvious I stayed up all night to write that last minute paper) this has certainly been helping lighten and brighten my under eye area! It disappears into the skin almost instantly, so applying eye makeup and foundation over it is no problem. I actually think it makes my make up look better, it acts as sort of an eye primer. Loving this eye gel so far, will revise if anything changes!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &#34;YES&#34; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nGreat eye gel",
  "prompt": "Based on this purchase history, analyze and summarize this person's genuine preferences and patterns in under 256 words. Think step by step:\n\n    1. First, identify consistent patterns in ratings and sentiments\n    2. Next, observe common themes across product purposes and use cases\n    3. Then, note recurring quality preferences and price sensitivity patterns\n    4. Finally, synthesize these observations into core preferences\n\n    Remember to:\n    - Focus only on keywords and  trends supported by multiple interactions\n    - Avoid repeating specific product names or details\n    - Base conclusions strictly on the provided purchase data\n\n    Here's the purchase data:\n\n    === Purchase Information ===\nProduct Title: Bold Lash Effect Mascara- Best for Length & Volume & Sensitive Eyes- Water Resistant & Smudge Proof - Clump Free - NO Parabens or SLS! (Black)\nReview Date: 2016/01/22\nAverage Rating: 3.5\nProduct Details: {'Special Feature': 'Smudge Proof, Water Resistant', 'Specialty': 'Paraben Free', 'Unit Count': '1.00 Count', 'Package Information': 'Tube', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.4 x 0.8 x 0.8 inches; 0.32 Ounces', 'UPC': '013189194316'}\nReview Text: This is the second product I've used for Mia Adora cosmetics. The first Mia Adora product I've used is their tattoo effect liquid eyeliner pen, which I highly recommend. This mascara is a beautiful true black. Often times mascara will dry to a much lighter shade after application, this isn't so with this product. This doesn't flake off like my other mascara that I was using up until I got this. The description says it's for short thin lashes, but it works nicely on my lashes which are pretty long. Often times I find that mascaras can't cover the entire length of my lashes without flaking off at the ends. This works just as well as a forty five dollar mascara that I once splurged on. Over the decade that I've been using mascara I've come to the conclusion that the super expensive mascara seem to work the same as regular priced mascara. Also a huge plus for me is that this mascara doesn't run when my eyes water from the cold winter winds. I have very sensitive skin and eyes, so far I have not noticed any sensitivity or other adverse reactions. Very happy with this mascara. I'm certainly falling in love Mia Adora cosmetics! Disclaimer: I received this item at a discounted price in exchange for my honest and unbiased review. All views expressed above are 100% my own.\nReview Title: Lovely lashes!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Healing Clay Mud Mask for Deep Pore Cleansing - Best Face Mask for Acne, Oily Skin & Blackheads - Reduces Wrinkles & Minimizes Pores - Organic and Natural Skin Cleanser & Therapeutic Spa Mask – 2oz\nReview Date: 2016/01/29\nStore: Derma-nu Miracle Skin Remedies\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Derma-nu Miracle Skin Remedies', 'Item Form': 'Clay', 'Product Benefits': 'Cleansing', 'Scent': 'Coconut', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 4 inches; 2.56 Ounces', 'UPC': '787421301601'}\nReview Text: I'll start off this review by telling you about my incredibly problematic skin. First off I have been suffering with mild acne for the past eight years. Recently I have developed terrible long lasting cystic acne break outs on my face, neck, chest, and back. If you suffer from this awfully painful form of acne you know that when a break out stops the evidence does not disappear, but instead leaves a huge dark mark or large indented scar ( and when you're really unlucky it will leave a combination of both). I have been using Dead Sea mud masks about twice every week which has been helping, but I was in need for something stronger. This is definitely stronger than your run of the mill Dead Sea mud mask. I have pretty sensitive skin and this honestly aggravates my skin a little and leaves it ruddy and burning, so this product may not be suitable for extremely sensitive skin. Please also notice that the jar only contains 2 ounces of product which will go by very fast, especially if used on more than just the face.<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the  &#34;YES&#34; vote button. I am always looking forward to improving  my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: My skin might be too sensitive for this product\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Moroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nReview Date: 2016/02/02\nStore: Pure Body Naturals\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nReview Text: Wonderful experience so far! I dye my hair crazy colors about every month. Once in a while I will bleach my locks so the color shows up brighter and lasts longer. This causes some pretty extensive damage. This shampoo is fantastic because it helps heal and restore my strands! The shampoo also doesn't strip off my color! This is very important to me because I always want my dye job to be vivid and last as long as possible. I was worried that the argan oil would make my hair greasy but it doesn't! I naturally have pretty oily hair and it doesn't seem to have any negative impact on that. It makes my hair super soft not oily!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the  &#34;YES&#34; vote button. I am always looking forward to improving  my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: Works well for my hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ultimate Smile Professional At-Home Teeth Whitening Kit\nReview Date: 2016/02/14\nStore: Ultimate Smile\nAverage Rating: 3.2\nProduct Details: {'Package Dimensions': '7.7 x 6.2 x 1.7 inches; 5.6 Ounces', 'UPC': '700580626118', 'Manufacturer': 'Ultimate Smile'}\nReview Text: This is a very nice little tooth whitening kit! It is so great that it comes with two tubes of whitener, so I know this will last a very long time! I noticed a significant difference after the first use, and my teeth are already pretty white and bright! I love that this comes with a case for the trays, my old kit did not have one and I had to use a plastic bag. This kit is way more organized than most, I really like the design it is simple and doesn't contribute a lot to clutter. I have included a photo from my I boxing of the whitener kit. Very happy with this product!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &quot;YES&quot; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: Fantastic little kit!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: African Black Soap - Face & Body Wash - All Natural Soap for Acne, Eczema, Psoriasis - with Shea Butter and Coconut Oil - 12 OZ by Cleopatra's Choice\nReview Date: 2016/02/16\nStore: Cleopatra's Choice\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Bar', 'Brand': \"Cleopatra's Choice\", 'Scent': 'Coconut', 'Material Feature': 'Natural', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.3 x 3.2 x 3.2 inches; 12 Ounces', 'UPC': '687927091160'}\nReview Text: I absolutely love this African black soap! This is such a great value, this is a huge amount of African black soap. African black soap is always pretty pricey where I live so I'm very glad I can buy such a good amount here from Cleopatra's choice! I use African black soap as a facial and all over cleanser. Another thing I use African black soap for is cleaning my makeup brushes and sponges. I find that African black soap cleans even better than cleansers I have purchased specifically for cleaning make up brushes. I know it works well because it makes white makeup sponges look brand new! The only issue I had with this product is that the packaging didn't really hold up in transit, it arrived with a huge dent on it, though it may have happened before transit because nothing in the package could have made this mark. I have included a photo of the damage below. This in no way changes or reduces the products effectiveness. Happy with my purchase!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &#34;YES&#34; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: I love African black soap!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yalmeh Naturals Eye Bright Gel\nReview Date: 2016/02/23\nStore: Yalmeh Peerless Beauty\nProduct Description: [\"Yalmeh Glory Eye Bright Gel ranks as a superior Anti Aging product for all your skin. It is extremely effective at eliminating dark circles and wrinkles. It is also efficient for puffiness and loss of tone. SAFE, ALL NATURAL INGREDIENTS- Yalmeh Glory Eye Bright Gel contains all natural ingredients, no toxic chemicals or cancer causing additives - no mineral oil, sulfates or alcohol ,propylene glycol or paraben. We do not test our products on animals NEVER-EVER. This is the BEST EYE GEL and is an effective natural solution for all types of skin. And, it lasts forever - a little goes a long way. And what matters most, however, is that the Yalmeh Glory Eye Gel works incredibly well. You will feel better both inside and out. THIS EYE GEL is 100% natural & 75% organic Click the 'Add to Cart' button at the top of this page NOW - Your Eyes Will Thank You.\"]\nAverage Rating: 3.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.4 x 0.4 x 0.4 inches; 0.35 Ounces', 'Item model number': 'GEBG-Y005', 'UPC': '640671981439 885612923240', 'Manufacturer': 'SETAF'}\nReview Text: Always a fan of this brand, I have purchased a few of their products over the past year. The gel has a nice light texture and isn't sticky at all. My eye area is soothed after I use this ( I use it morning and night). I apply the gel to my clean eye area daily and follow with a denser eye cream at night. I'm a college student that experiences many late nights. These late nights have a habit of causing me dark circles ( so not cute, haha! Makes it very obvious I stayed up all night to write that last minute paper) this has certainly been helping lighten and brighten my under eye area! It disappears into the skin almost instantly, so applying eye makeup and foundation over it is no problem. I actually think it makes my make up look better, it acts as sort of an eye primer. Loving this eye gel so far, will revise if anything changes!<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &#34;YES&#34; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!\nReview Title: Great eye gel\nRating: 5.0\n--------------------------------------------------\n\n    Structure your response as:\n   \n    SUMMARY:\n    [Final synthesis of preferences and patterns]",
  "raw_response": "SUMMARY:  \nThis individual demonstrates a preference for natural and organic beauty products that cater to sensitive skin. Their consistent ratings reveal a range of satisfaction, averaging around 3.5 to 4.0 stars, with positive sentiments about effective results and quality. There’s a noted inclination toward products that perform comparably to high-end alternatives, indicating a tendency for value-driven shopping rather than brand loyalty or excessive price sensitivity. Common themes in their purchases include effective makeup solutions, skincare aimed at treating specific concerns like acne and dark circles, and hair care that nourishes without compromising color treatment.\n\nQuality preferences lean toward functional, specialized products, with a balance between affordability and effectiveness. The consumer appreciates clear descriptions, user-friendly packaging, and products that improve quality of life without adverse reactions. Their reviews often highlight experiences with product performance during regular use and sensitivity, reinforcing their desire for reliability and effectiveness. Overall, the core preferences reflect a practical approach to beauty, combining a focus on natural ingredients with a critical eye for product performance and value.",
  "target_interaction": {
    "rating": 1.0,
    "title": ":(",
    "text": "I am not amazed by this product. Normally I enjoy products by this brand, but this scrub does not make the cut for me personally. The biggest problems I have with with this scrub are the unnatural dyes, they could've been left out there is no need for them. In my opinion the dye almost cheapens the perceived value of the product as the color is very bright and unnatural. It exfoliates very lightly. All in all I would not consider buying this product for myself again.<br />Disclaimer: The coupon code for this product was provided to me for evaluation purposes. My thinking here reflects all my own personal purchasing decision processes and reactions, and hopefully may help clarify if this product best fits your own needs and expectations.<br />If you find that my review would help others to make decisions on purchasing this product, please click on the &#34;YES&#34; vote button. I am always looking forward to improving my reviews, so that others just like you, can benefit from my personal experience with this product! Thank you all very much, I hope some of you find this review helpful in your buying decisions!",
    "images": [],
    "asin": "B01DGWYQCG",
    "parent_asin": "B01DGWYQCG",
    "user_id": "AEOBB7VMAUNZ6ETYINJLQ222ED4Q",
    "timestamp": "2016-04-26 01:53:42",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Exfoliating Grapefruit Body Scrub for Face and Body Exfoliating Scrub for Acne and Inflammation, 12 Ounce by Pure Body Naturals",
    "average_rating": 3.5,
    "rating_number": 217,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51oJF3F2TLL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51oJF3F2TLL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71n5MgWgGgL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51q+fPVnUiL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51q+fPVnUiL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71l114wB7XL._SL1312_.jpg"
      }
    ],
    "videos": [],
    "store": null,
    "categories": [],
    "details": {
      "Skin Type": "Dry",
      "Product Benefits": "Brightening",
      "Material Feature": "Natural",
      "Number of Items": "1",
      "Special Feature": "Exfoliating",
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "3.4 x 3 x 2.6 inches; 13.76 Ounces",
      "Item model number": "Grapefruit Facial Scrub",
      "UPC": "646437736305"
    },
    "bought_together": null
  }
}