{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: I Can Only Imagine\nReview Date: 2021/06/29\nStore: Dennis Quaid  (Actor),     J. Michael Finley  (Actor),     Jon Erwin  (Director),     Andrew Erwin  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"The inspiring and unknown true story behind MercyMe's beloved, chart topping song that brings ultimate hope to so many is a gripping reminder of the power of true forgiveness.\"]\nAverage Rating: 4.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '43206-9472', 'Director': 'Jon Erwin, Andrew Erwin', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 50 minutes', 'Release date': 'June 12, 2018', 'Actors': 'Dennis Quaid, J. Michael Finley, Cloris Leachman, Madeline Carroll, Trace Adkins', 'Subtitles': 'Spanish', 'Producers': 'Mickey Liddell, Daryl Lefever, Cindy Bond, Kevin Downes, Pete Shilaimon', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a really great movie ,it's definitely a must see movie.\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Tyler Perry's Boo 2! A Madea Halloween [DVD]\nTyler Perry  (Actor, Director, Producer),     Cassi Davis  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Madea and the gang are back for this hilarious sequel. Madea, Bam and Hattie venture to a haunted campground and the group must literally run for their lives when monsters, goblins and the bogeyman are unleashed.']\n{'Genre': 'Comedy', 'Format': 'AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Patrice Lovely, Ozzie Areu, Tyler Perry, Cassi Davis, Tyler Perry Company, The', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'B077V4S33Y', 'Director': 'Tyler Perry', 'Media Format': 'AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'January 30, 2018', 'Actors': 'Tyler Perry, Cassi Davis, Patrice Lovely', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish', 'Producers': 'Tyler Perry, Ozzie Areu', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nThis movie is just as good as the first one\nReally funny movie\nMile in His Shoes\nDean Cain  (Actor),     Luke Schroder  (Actor),     -  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Only a miracle can help baseball coach Arthur “Murph” Murphy (Dean Cain) and his losing minor league baseball team. As Murph sets out to recruit new talent for the team, he stumbles upon Mickey (Luke Schroder), a young farmer with an incredible pitcher’s arm. However, Mickey’s parents are reluctant to allow him to join the team because he has Asperger’s syndrome, a form of autism. Murph convinces Mickey’s parents that life in the minor league will benefit their unique son, but he doesn’t realize just how much his new recruit will help the team’s game and, more importantly, their spirit. Based on the novel “The Legend 0f Mickey Tussler” by Frank Nappi.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Luke Schroder, Dean Cain, -', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '8687026', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 10, 2012', 'Actors': 'Dean Cain, Luke Schroder', 'Studio': 'Nasser', 'Number of discs': '1'}\nSuch a good and heartfelt movie, everyone needs to watch and get and understanding and clarification on what the autistic children go through\nA movie everyone needs to see\nMask\nCher  (Actor),     Eric Stoltz  (Actor),     Peter Bogdanovich  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Acclaimed filmmaker Peter Bogdanovich directed this heartwarming and inspirational film based on the real-life story of Rocky Dennis (Eric Stoltz), a terribly disfigured but highly sensitive and intelligent teenager. Motivated by his loving mother, Rusty (Cher), and her boyfriend, Gar (Sam Elliott), Rocky ultimately overcomes pain, loneliness and prejudice to become a role model to his classmates and teachers alike.Bonus Content:', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich']\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie', 'Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more\", 'Contributor': 'Peter Bogdanovich, Cher, Eric Stoltz, Sam Elliott', 'Language': 'Unqualified, English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), English (DTS 5.1)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '1022788', 'Director': 'Peter Bogdanovich', 'Media Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen\", 'Run time': '2 hours and 7 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Cher, Eric Stoltz, Sam Elliott', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSuch a heartfelt good movie\nI love this movie, so sad but so good\nTyler Perry's The Single Moms Club [DVD + Digital]\nNia Long  (Actor),     Wendi McLendon-Covey  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Brought together by an incident at their children’s school, a group of single mothers from different walks of life bond and create a support group that helps them find comedy in the obstacles of life, as well as their inner strength to overcome their personal challenges.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, Widescreen, NTSC', 'Contributor': 'Nia Long, Lionsgate; Tyler Perry Company, The, Wendi McLendon-Covey, Amy Smart, Cocoa Brown, Ryan Eggold, Ozzie Areu, Tyler Perry, Matt Moore, Terry Crews, William LevyNia Long, Lionsgate; Tyler Perry Company, The, Wendi McLendon-Covey, Amy Smart, Cocoa Brown, Ryan Eggold, Ozzie Areu, Tyler Perry, Matt Moore, Terry Crews, William Levy  See more', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT45522DVD', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 51 minutes', 'Release date': 'July 22, 2014', 'Actors': 'Nia Long, Wendi McLendon-Covey, Amy Smart, Cocoa Brown, Ryan Eggold', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Producers': 'Tyler Perry, Ozzie Areu, Matt Moore', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie\nPerfect\nLilo & Stitch 2: Stitch Has a Glitch (Home Video)\nDakota Fanning  (Actor),     Chris Sanders  (Actor),     Tony Leondis  (Director),     Michael LaBash  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'The unforgettable story of Stitch and Lilo continues in Disney\\'s hilarious all-new movie LILO & STITCH 2. Your favorite characters return in this heartwarming comedy about bringing friends and family together even when they seem worlds apart. Before the other 625 experiments land in Hawaii, Stitch is living the good life. He helps Lilo follow in the footsteps of her mother as she prepares for the big island hula contest, but when Stitch gets a glitch, their perfect world goes haywire. Now it\\'s going to take Lilo, Nani, Jumba, and a whole lotta \"Ohana\" for them to save their funny little friend. With three classic Elvis Presley songs and exclusive bonus material, LILO & STITCH 2 is a whole new wave of fun and excitement for the entire family.', 'Amazon.com', 'Familial love proves all-powerful when Stitch gets a glitch that encourages bad behavior and threatens his relationship with Lilo in', 'Lilo and Stitch 2', '. Like the first', 'Lilo and Stitch', \", this straight-to-DVD sequel focuses primarily on Stitch, Lilo, and Lilo's sister Nani. Stitch's nightmares about misbehaving prove prophetic when he begins experiencing moments of uncontrollable badness. Unfortunately, Stitch's unruly actions always seem to interfere with Lilo's important preparations for the May Day hula competition--a competition that Lilo desperately wants to win in her mother's memory. Jumba goes to work creating a fusion chamber that will re-charge Stitch's molecules and purge his badness, but he can't seem to build one that works. In the end, it's Lilo's faith in herself and the power of Ohana that offer the only chance to cure Stitch and fill his goodness level to the top. (Ages 3-12)\", '--Tami Horiuchi', 'Review', '\"A funny and entertaining thrill-a-minute adventure for the whole family.\" --', 'Earl Dittman, Wireless Magazine', '\"A sharp, clever and entertaining animated adventure.\" --', 'Earl Dittman, Wirless Magazine', '\"Inspiring for the whole family.\" --', 'Ed Held, DVD Buz', '\"Sure to thrill fans of the original.\" --', 'Kirk Montgomery, NBC', 'See more']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Chris Sanders, Kunewa Mook, David Ogden Stiers, Screenplay By Tony Leondis & Michael LaBash And Al, Tia Carrere, Dakota Fanning, Michael LaBash, Jason Scott Lee, Kevin McDonald, Tony LeondisChris Sanders, Kunewa Mook, David Ogden Stiers, Screenplay By Tony Leondis & Michael LaBash And Al, Tia Carrere, Dakota Fanning, Michael LaBash, Jason Scott Lee, Kevin McDonald, Tony Leondis  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Czech (DTS 5.1), French, Unqualified, Spanish', 'Runtime': '1 hour and 8 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.6 inches; 2.72 Ounces', 'Item model number': '786936240139', 'Director': 'Tony Leondis, Michael LaBash', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 8 minutes', 'Release date': 'August 30, 2005', 'Actors': 'Dakota Fanning, Chris Sanders, Tia Carrere, David Ogden Stiers, Kevin McDonald', 'Subtitles': 'None', 'Studio': 'Walt Disney Home Entertainment', 'Writers': 'Screenplay By Tony Leondis & Michael LaBash And Al', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy daughter loves any and all stitch movies\nPerfect\nSling Blade [DVD + Digital]\nBilly Bob Thornton  (Actor, Director),     Dwight Yoakam  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n[\"25 Years after commiting an unthinkable crime, a quiet man named Karl(Thornton) finally returns home. Once there, he's befriended by a fatherless boy and his mother. But when his newfound peace is shattered by the mother's abusive boyfriend, Karl is suddenly placed on a collision course with his past! Also starring Robert Duvall, John Ritter and J.T. Walsh, this emotional powerhouse is an unforgettable experience for the eyes and ears as well as the heart.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Widescreen', 'Contributor': 'Robert Duvall, Jackie Stewart, Mickey Jones, Scott Stewart, Jim Jarmusch, Tom Kagy, John Ritter, Christy Ward, Dwight Yoakam, J.T. Walsh, Brent Briscoe, Lucas Black, Natalie Canerday, James Hampton, David L. Bushell, Brandon Rosser, Billy Bob ThorntonRobert Duvall, Jackie Stewart, Mickey Jones, Scott Stewart, Jim Jarmusch, Tom Kagy, John Ritter, Christy Ward, Dwight Yoakam, J.T. Walsh, Brent Briscoe, Lucas Black, Natalie Canerday, James Hampton, David L. Bushell, Brandon Rosser, Billy Bob Thornton  See more', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '031398138013', 'Director': 'Billy Bob Thornton', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Widescreen', 'Release date': 'April 26, 2011', 'Actors': 'Billy Bob Thornton, Dwight Yoakam, J.T. Walsh, John Ritter, Lucas Black', 'Dubbed': 'French', 'Producers': 'David L. Bushell, Brandon Rosser', 'Studio': 'Miramax Lionsgate', 'Number of discs': '1'}\nIt's hard to find this movie but it is so good and heartfelt\nHappy I found this movie at a reasonable price\nJack of the Red Hearts\nAnnasophia Robb  (Actor),     Famke Janssen  (Actor),     Janet Grillo  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Independently Distributed, Drama\n['Product Description', \"A streetwise teen, and casualty of the flawed foster care system, cons her way into a job by posing as an experienced caregiver for a family with an autistic child. At first in over her head, she ends up connecting with her new life in a way she never expected. Just as she's found redemption, her deceitful past catches up with her and she's forced to come to terms with who she really is.\", 'Review', \"'This is not 'Rain Man'; it's better. --Peter Keough, Boston Globe\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '82997', 'Director': 'Janet Grillo', 'Media Format': 'Color, Widescreen, NTSC, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Annasophia Robb, Famke Janssen, Taylor Richardson, Scott Cohen, Israel Broussard', 'Studio': 'Arc Entertainment', 'Number of discs': '1'}\nI love this movie, touches hearts and homes\nReally good  meaningful movie\nLeroy & Stitch\nDaveigh Chase  (Actor),     Chris Sanders  (Actor),     Tony Craig  (Director),     Bobs Gannaway  (Director, Writer)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', \"Here comes trouble! The adventure never stops as Lilo and Stitch face the challenge of their lives in Disney's hilarious, all-new movie LEROY & STITCH. As a reward for rounding up all 625 experiments, Lilo, Stitch, Jumba, and Pleakley have been placed around the galaxy in a spot where each of them thinks they truly belong. Their lives are all shook up when the dastardly Dr. Hamsterviel breaks out of prison and forces Jumba to create a new experiment -- Leroy, the evil twin of Stitch. To make matters worse, Hamsterviel soon clones the nasty little creature to form his own mischievous army. Now it's up to Lilo to gather Stitch and the rest of the gang from the far corners of outer space to battle the legion of Leroys. When the going gets rough, our friends discover that one place they all truly belong is together.\", 'Amazon.com', 'The Hawaiian word ohana means family, but encompasses both immediate family and individuals that play an integral part in one\\'s happiness and sense of well being. When Lilo says aloha (goodbye) to her good friends Stitch, Jumba and Pleakly after they\\'ve successfully completed their mission on earth, Lilo finds herself back on earth feeling lonely and bemoaning the difficulty of holding true to an aloha spirit that demands saying goodbye to one\\'s \"family\" members. Surprisingly, Stitch, Jumba and Pleakly also find themselves feeling strangely disconnected and alone even though they are finally in places in the galaxy where they truly belong. After Gantu helps Dr. Hamsterviel break out of prison, Dr. Hamsterviel prevails upon Jumba to create an experimental evil twin of Stitch called Leroy. When the newly appointed Captain Stitch is called upon to defeat an army of 600 Leroy clones, a bizarre twist reunites him with Jumba and Pleakly and the trio once again faces seemingly insurmountable odds. Can their efforts, combined with those of Lilo and Reuben, the sandwich-making experiment 625, possibly prevail against Gantu\\'s evil experimental army? This Disney Channel Premiere Presentation reunites the lovable Lilo and Stitch gang in another compelling story that reaffirms the aloha spirit and the importance of ohana. DVD extras include a never-before-seen episode from the', 'Lilo and Stitch', 'television series and an interactive flight simulator game. (Ages 3-12)', '--Tami Horiuchi']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Color, NTSC, Animated', 'Contributor': 'Zoe Caldwell, Chris Sanders, Tia Carrere, Jeff Bennett, Bobs Gannaway, Tony Craig, Rob Paulsen, Ving Rhames, David Ogden Stiers, Jess Winfield, Kevin Michael Richardson, Daveigh Chase, Liliana Mumy, Kevin McDonaldZoe Caldwell, Chris Sanders, Tia Carrere, Jeff Bennett, Bobs Gannaway, Tony Craig, Rob Paulsen, Ving Rhames, David Ogden Stiers, Jess Winfield, Kevin Michael Richardson, Daveigh Chase, Liliana Mumy, Kevin McDonald  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 12 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 0.8 Ounces', 'Item model number': 'WD04158300DVD', 'Director': 'Tony Craig, Bobs Gannaway', 'Media Format': 'Multiple Formats, Color, NTSC, Animated', 'Run time': '1 hour and 12 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Daveigh Chase, Chris Sanders, David Ogden Stiers, Kevin McDonald, Tia Carrere', 'Subtitles': 'English', 'Studio': 'Walt Disney Home Entertainment', 'Writers': 'Bobs Gannaway, Jess Winfield', 'Country of Origin': 'USA', 'Number of discs': '1'}\nNow my daughter has all her stitch movies she wanted\nReally good movie\nDiary of a Mad Black Woman (Full Screen Edition)\nKimberly Elise  (Actor),     Steve Harris  (Actor),     Darren Grant  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Kimberly Elise, Steve Harris, Tyler Perry. Helen McCarthy's lawyer-husband admits to having an affair and announces he wants a divorce. Her seemingly-perfect life and marriage crumble and she turns to her mom and Grandma Madea for help on how to stand on her own two feet. 2005/color/116 min/PG-13.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Darren Grant, Kimberly Elise, Tamara Taylor, Shemar Moore, Vickie Eng, Tiffany Evans, Lisa Marcos, Terrell Carter, Cicely Tyson, Steve Harris, Tyler Perry, Carol Mitchell-leon, Avery KnightDarren Grant, Kimberly Elise, Tamara Taylor, Shemar Moore, Vickie Eng, Tiffany Evans, Lisa Marcos, Terrell Carter, Cicely Tyson, Steve Harris, Tyler Perry, Carol Mitchell-leon, Avery Knight  See more', 'Language': 'English (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 56 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.58 x 5.34 x 7.5 inches; 1.6 Ounces', 'Item model number': '18026', 'Director': 'Darren Grant', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 28, 2005', 'Actors': 'Kimberly Elise, Steve Harris, Tyler Perry, Cicely Tyson, Shemar Moore', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Writers': 'Tyler Perry', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is the best movie in the entire world and everyone should watch this movie\nThe best movie ever\nWhere Hope Grows\nDanica McKellar  (Actor),     William Zabka  (Actor),     Chris Dowling  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Where Hope Grows is an inspiring story of finding redemption through friendship, hope and love. Calvin Campbell is a former professional baseball player, struggling with the curveballs life has thrown him. His life takes on a new meaning after meeting Produce, a young man with Down syndrome who works at the local grocery store. As their friendship develops, Calvin is reminded that sometimes hope can grow in the most unlikely of places.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Danica McKellar, William Zabka, Chris Dowling, Jose Cantillo, Attic Light Films; Godspeed Pictures; Produce Films; Stealth Tiger EntertainmentDanica McKellar, William Zabka, Chris Dowling, Jose Cantillo, Attic Light Films; Godspeed Pictures; Produce Films; Stealth Tiger Entertainment   See more', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Audio Description': 'English', 'Item model number': '47373', 'Director': 'Chris Dowling', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'August 25, 2015', 'Actors': 'Danica McKellar, William Zabka', 'Producers': 'Jose Cantillo', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a really good movie, it's a heart felt movie.\nSuch a good movie\nPure Country (DVD)\nGeorge Strait  (Actor),     Lesley Ann Warren  (Actor),     Christopher Cain  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Pure Country (DVD)', 'Country music superstar George Strait plays Dusty Chandler, a singerwho, after struggling for years singing in small honky-tonks, suddenlydiscovers that with success he has lost something important in hislife.After cutting his hair and shaving his beard, Dusty takes a job ona ranch where no one recognizes him, reconnects with people who muststruggle each day to survive--and finds love. Now, can he balance thelife he lost--and found again--with the lifelong dream he has attainedof being a country music star?', ']]>']\n{'Genre': 'Drama, Romance, Westerns', 'Format': 'Multiple Formats, Closed-captioned, Anamorphic, Color, Dolby, Full Screen, NTSC, Subtitled, WidescreenMultiple Formats, Closed-captioned, Anamorphic, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Rex McGee, John Doe, Jerry Weintraub, James Terry McIlvain, Christopher Cain, George Strait, Kyle Chandler, Molly McClure, R.J. Louis, Isabel Glasser, Lesley Ann Warren, Rory Calhoun, Toby MetcalfRex McGee, John Doe, Jerry Weintraub, James Terry McIlvain, Christopher Cain, George Strait, Kyle Chandler, Molly McClure, R.J. Louis, Isabel Glasser, Lesley Ann Warren, Rory Calhoun, Toby Metcalf  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': 'MFR085391259329#VG', 'Director': 'Christopher Cain', 'Media Format': 'Multiple Formats, Closed-captioned, Anamorphic, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'September 14, 2004', 'Actors': 'George Strait, Lesley Ann Warren, Isabel Glasser, Kyle Chandler, John Doe', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'R.J. Louis, Jerry Weintraub', 'Studio': 'Studio Distribution Services', 'Writers': 'Rex McGee', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of those movies you just have to have. I love this movie\nGreat movie\nI Can Only Imagine\nDennis Quaid  (Actor),     J. Michael Finley  (Actor),     Jon Erwin  (Director),     Andrew Erwin  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"The inspiring and unknown true story behind MercyMe's beloved, chart topping song that brings ultimate hope to so many is a gripping reminder of the power of true forgiveness.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '43206-9472', 'Director': 'Jon Erwin, Andrew Erwin', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 50 minutes', 'Release date': 'June 12, 2018', 'Actors': 'Dennis Quaid, J. Michael Finley, Cloris Leachman, Madeline Carroll, Trace Adkins', 'Subtitles': 'Spanish', 'Producers': 'Mickey Liddell, Daryl Lefever, Cindy Bond, Kevin Downes, Pete Shilaimon', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a really great movie ,it's definitely a must see movie.\nGreat movie",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Great movie",
    "text": "This is a really great movie ,it's definitely a must see movie.",
    "images": [],
    "asin": "B07BLJ4MD7",
    "parent_asin": "B07BLJ4MD7",
    "user_id": "AHPTMNP3Y4FGG7TX2SO6DQCVNHPQ",
    "timestamp": "2021-06-29 18:53:56.589000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "I Can Only Imagine",
    "average_rating": 4.9,
    "rating_number": 28240,
    "features": [],
    "description": [
      "The inspiring and unknown true story behind MercyMe's beloved, chart topping song that brings ultimate hope to so many is a gripping reminder of the power of true forgiveness."
    ],
    "price": 4.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/512dFqkOKpL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/512dFqkOKpL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/915svy4fGtL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Dennis Quaid  (Actor),     J. Michael Finley  (Actor),     Jon Erwin  (Director),     Andrew Erwin  (Director)    &                   1                  more   Rated:    PG    Format: DVD",
    "categories": [
      "Movies & TV",
      "Studio Specials",
      "Lionsgate Home Entertainment",
      "All Lionsgate Titles"
    ],
    "details": {
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG (Parental Guidance Suggested)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.72 Ounces",
      "Audio Description": "English",
      "Item model number": "43206-9472",
      "Director": "Jon Erwin, Andrew Erwin",
      "Media Format": "NTSC, Subtitled",
      "Run time": "1 hour and 50 minutes",
      "Release date": "June 12, 2018",
      "Actors": "Dennis Quaid, J. Michael Finley, Cloris Leachman, Madeline Carroll, Trace Adkins",
      "Subtitles": "Spanish",
      "Producers": "Mickey Liddell, Daryl Lefever, Cindy Bond, Kevin Downes, Pete Shilaimon",
      "Studio": "Lionsgate",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}