{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: John Carter of Mars\nReview Date: 2014/04/28\nStore: Traci Lords  (Actor),     Antonio Sabato Jr.  (Actor),     Mark Atkins  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"A classic story that inspired Jame's Cameron's Avatar. Based on the novel by Edgar Rice Burroughs , a US soldier finds himself inexplicably transported to Mars in the midst of a war between two alien races. Bonus Material: Making of Featurette and Gag Reel\"]\nAverage Rating: 3.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Mark Atkins', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 10, 2012', 'Actors': 'Traci Lords, Antonio Sabato Jr., Matt Lasky', 'Studio': 'Asylum Home Entertainment', 'Number of discs': '1'}\nReview Text: A pleasantly enjoyable Sci-Fi thriller, fast paced, great detail to scenery to a desolate planet. The two stars were in great shape, its amazing how fit they are in &#34;Hollywood&#34; even into their 40's. Worth a look.\nReview Title: great detail to scenery to a desolate planet\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Punisher: War Zone\nSuspense, Drama, Gritty, Serious\n['Continuing his crusade to punish violent criminals in America, former FBI agent Frank Castle arrives in New York to take on a scarred villain who plots to take control of the underworld.']\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lexi Alexander'], 'Producers': ['Gale Anne Hurd'], 'Starring': ['Ray Stevenson', 'Dominic West', 'Julie Benz']}\nFast paced enjoyable movie. Too much computer generated material for this old dog, otherwise a good flick. I recommend it.Thanks.\nAction Packed\nDevil's Pass\nHolly Goss  (Actor),     Matt Stokoe  (Actor),     Renny Harlin  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"In February of 1959, nine Russian hikers ventured into a remote area of the Ural Mountains. Two weeks later, all of them were found dead. What happened is a mystery that has baffled investigators and researchers for decades. It has become known as the Dyatlov Pass Incident. When five ambitious American college students are issued a grant to return to the site of the original events, they gear up with the belief that they can uncover and document the truth of what happened to the supposedly experienced hikers. But what they find is more shocking than anything they could have imagined. Retracing the steps of the Russians' ill-fated journey, the students are plagued by strange and increasingly terrifying phenomena that suggest that in spite of the desolate surroundings, they are not alone. The forces at work in the Dyatlov Pass Incident have been waiting for them. Based on a true story, director Renny Harlin's (Cliffhanger) DEVIL'S PASS is an edge-of-your-seat thriller that delivers nail-biting suspense right up to it's shocking final frame.\"]\n{'Genre': 'Horror', 'Format': 'NTSC, Widescreen', 'Contributor': 'Renny Harlin, Holly Goss, Matt Stokoe', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'IDFC9895DVD', 'Director': 'Renny Harlin', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'December 17, 2013', 'Actors': 'Holly Goss, Matt Stokoe', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe movie had an excellent plot and seemed to move along rather well until about two thirds through the movie, then it seems to lose its game plan and began rushing to the finale.  A three star revue in my opinion.\nSwedeish Horror\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Andrews', 'Jim Wynorski'], 'Producers': ['Daniel Gilboy', 'Dan Golden', 'Paul Hertzberg', 'Michael Par?', 'Kimberly A. Ray'], 'Starring': ['Michael Pare', 'Michelle Borth', 'Jerri Manthey'], 'Studio': ['Lionsgate']}\nNo doubt a believable project to a point, but yet as Sci-Fi movies go it was worth the 3 stars. Michael Pare, as usual works with an average script and without a net but still gives the audience its money worth.\nAction Packed\nJohn Carter of Mars\nTraci Lords  (Actor),     Antonio Sabato Jr.  (Actor),     Mark Atkins  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"A classic story that inspired Jame's Cameron's Avatar. Based on the novel by Edgar Rice Burroughs , a US soldier finds himself inexplicably transported to Mars in the midst of a war between two alien races. Bonus Material: Making of Featurette and Gag Reel\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Mark Atkins', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 10, 2012', 'Actors': 'Traci Lords, Antonio Sabato Jr., Matt Lasky', 'Studio': 'Asylum Home Entertainment', 'Number of discs': '1'}\nA pleasantly enjoyable Sci-Fi thriller, fast paced, great detail to scenery to a desolate planet. The two stars were in great shape, its amazing how fit they are in &#34;Hollywood&#34; even into their 40's. Worth a look.\ngreat detail to scenery to a desolate planet",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preferences:** Continues to enjoy suspenseful and dramatic narratives with a strong affinity for action-packed content centered on crime and justice themes. The user's interest in horror elements remains, now combined with an appreciation for Sci-Fi, particularly thrilling and visually striking plots.\n\n- **Content Preferences:** Values fast-paced storytelling that showcases darker themes, including violence and realism. The user remains critical of clichés and pacing issues, emphasizing a discerning taste for production quality. Their recent engagement with a Sci-Fi thriller highlights a balance between enjoyment of vibrant visuals and acknowledgment of narrative depth.\n\n- **Rating Trends:** Typically rates films around 4 stars but displays increased variability in recent ratings. A notable 5-star rating for a recent Sci-Fi thriller showcases the user's newfound appreciation for this genre, particularly when the film combines captivating visuals and strong pacing. Their previous 3-star rating underscored frustrations with rushed conclusions and script quality, reinforcing their demand for impactful storytelling.\n\n- **Language and Subtitles:** Prefers content in English and emphasizes the importance of accessibility through subtitles to ensure full engagement with narratives.\n\nOverall, this user demonstrates a robust affinity for thrilling, action-driven films that resonate with depth, while their recent interactions indicate an expanding appreciation for well-crafted Sci-Fi narratives blended with elements from other genres.",
  "metrics": {
    "rouge1_f": 0.20704845814977973,
    "rouge2_f": 0.017660044150110375,
    "rougeL_f": 0.08810572687224669,
    "meteor": 0.05792748337266681,
    "bleu1": 0.01784524233864037,
    "bleu2": 0.004807276012602191,
    "bleu3": 0.0007940899596247782,
    "bleu4": 0.00032305637664653336,
    "bertscore_precision": 0.358386754989624,
    "bertscore_recall": 0.4687979221343994,
    "bertscore_f1": 0.4062235951423645
  }
}