{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: San Francisco Story\nReview Date: 2014/07/07\nStore: Joel McCrea  (Actor),     Yvonne De Carlo  (Actor),     Robert Parrish  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"Yvonne de Carlo, Joel McCrea. Newspaper editor Jim Martin urges his wealthy friend Rick Nelson to come to San Francisco to help him clean up the corrupt 1850s government. Initially Rick isn't interested in being part of a vigilante group, but he changes his mind quickly when he falls in love with the girlfriend of a crooked politician. 1952/b&w/80 min/NR/fullscreen.\"]\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Westerns', 'Format': 'Multiple Formats, NTSC, Black & White', 'Contributor': 'Sidney Blackmer, Joel McCrea, Yvonne De Carlo, John Doucette, Florence Bates, Robert Parrish, Onslow Stevens, Robert FoulkSidney Blackmer, Joel McCrea, Yvonne De Carlo, John Doucette, Florence Bates, Robert Parrish, Onslow Stevens, Robert Foulk  See more', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5821000', 'Director': 'Robert Parrish', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 25, 2009', 'Actors': 'Joel McCrea, Yvonne De Carlo, Sidney Blackmer, Onslow Stevens, John Doucette', 'Studio': 'Shout! Factory / Timeless Media', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: A wonderful tale of old San Francisco, starring that cowboy great; Joel McCrea. Yvonne DeCarlo is always a nice distraction!  An evenly paced story that well worth your time if your a buff of the western genre as I am. 5 stars. Thanks.\nReview Title: A wonderful tale of old San Francisco\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Punisher: War Zone\nSuspense, Drama, Gritty, Serious\n['Continuing his crusade to punish violent criminals in America, former FBI agent Frank Castle arrives in New York to take on a scarred villain who plots to take control of the underworld.']\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lexi Alexander'], 'Producers': ['Gale Anne Hurd'], 'Starring': ['Ray Stevenson', 'Dominic West', 'Julie Benz']}\nFast paced enjoyable movie. Too much computer generated material for this old dog, otherwise a good flick. I recommend it.Thanks.\nAction Packed\nDevil's Pass\nHolly Goss  (Actor),     Matt Stokoe  (Actor),     Renny Harlin  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"In February of 1959, nine Russian hikers ventured into a remote area of the Ural Mountains. Two weeks later, all of them were found dead. What happened is a mystery that has baffled investigators and researchers for decades. It has become known as the Dyatlov Pass Incident. When five ambitious American college students are issued a grant to return to the site of the original events, they gear up with the belief that they can uncover and document the truth of what happened to the supposedly experienced hikers. But what they find is more shocking than anything they could have imagined. Retracing the steps of the Russians' ill-fated journey, the students are plagued by strange and increasingly terrifying phenomena that suggest that in spite of the desolate surroundings, they are not alone. The forces at work in the Dyatlov Pass Incident have been waiting for them. Based on a true story, director Renny Harlin's (Cliffhanger) DEVIL'S PASS is an edge-of-your-seat thriller that delivers nail-biting suspense right up to it's shocking final frame.\"]\n{'Genre': 'Horror', 'Format': 'NTSC, Widescreen', 'Contributor': 'Renny Harlin, Holly Goss, Matt Stokoe', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'IDFC9895DVD', 'Director': 'Renny Harlin', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'December 17, 2013', 'Actors': 'Holly Goss, Matt Stokoe', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe movie had an excellent plot and seemed to move along rather well until about two thirds through the movie, then it seems to lose its game plan and began rushing to the finale.  A three star revue in my opinion.\nSwedeish Horror\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Andrews', 'Jim Wynorski'], 'Producers': ['Daniel Gilboy', 'Dan Golden', 'Paul Hertzberg', 'Michael Par?', 'Kimberly A. Ray'], 'Starring': ['Michael Pare', 'Michelle Borth', 'Jerri Manthey'], 'Studio': ['Lionsgate']}\nNo doubt a believable project to a point, but yet as Sci-Fi movies go it was worth the 3 stars. Michael Pare, as usual works with an average script and without a net but still gives the audience its money worth.\nAction Packed\nJohn Carter of Mars\nTraci Lords  (Actor),     Antonio Sabato Jr.  (Actor),     Mark Atkins  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"A classic story that inspired Jame's Cameron's Avatar. Based on the novel by Edgar Rice Burroughs , a US soldier finds himself inexplicably transported to Mars in the midst of a war between two alien races. Bonus Material: Making of Featurette and Gag Reel\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Mark Atkins', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 10, 2012', 'Actors': 'Traci Lords, Antonio Sabato Jr., Matt Lasky', 'Studio': 'Asylum Home Entertainment', 'Number of discs': '1'}\nA pleasantly enjoyable Sci-Fi thriller, fast paced, great detail to scenery to a desolate planet. The two stars were in great shape, its amazing how fit they are in &#34;Hollywood&#34; even into their 40's. Worth a look.\ngreat detail to scenery to a desolate planet\nKnights of Bloodsteel\nNatassia Malthe  (Actor),     Christopher Jacot  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['In the faraway land of Mirabilis, the warlord Dragon-Eye has unleashed his terrifying forces to hunt down the source of all power, a legendary Crucible. With freedom hanging in the balance, a motley band of knights embarks on a dangerous mission to fight against the dreaded assassins, dragons and soldiers of Dragon-Eye and rescue their world from the clutches of evil once and for all.', 'Stills from', 'Knights of Bloodsteel', '(Click for larger image)']\n{'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Mackenzie Gray, Christopher Lloyd, Dru Viergever, Gwynyth Walsh, Peter Bryant, Gardiner Millar, Natassia Malthe, Christopher Jacot, Heather Doerksen, Julian Christopher, Adrian Hough, Mark GibbonMackenzie Gray, Christopher Lloyd, Dru Viergever, Gwynyth Walsh, Peter Bryant, Gardiner Millar, Natassia Malthe, Christopher Jacot, Heather Doerksen, Julian Christopher, Adrian Hough, Mark Gibbon  See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '2 hours and 55 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 55 minutes', 'Release date': 'September 15, 2009', 'Actors': 'Natassia Malthe, Christopher Jacot, Dru Viergever, Peter Bryant, Mark Gibbon', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nA fantasy sword entry that was average at best. Had some good actors playing the roles but didn't develop all that well. Tough staying interested. 3 stars.\nA fantasy sword entry that was average at best. Had some good actors playing the roles but ...\nThe Wings of Eagles\nJohn Wayne  (Actor),     Dan Dailey  (Actor),     John Ford  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, Warner Sale\n['Wings Of Eagles, The (DVD) (Commemorative Amaray)', 'John Wayne, Dan Dailey, and Maureen O\\'Hara star in one of John Ford\\'s most personal films, in which he pays tribute to a man he knew and admired in real life, pioneering World War I naval aviator Frank \"Spig\" Wead. Although Wead (Wayne) is instrumental in advancing the cause of American air power, he endures a troubled personal life, becoming estranged from his wife, Minnie (O\\'Hara) after the death of their baby. During a bout of drinking, he tumbles down the stairs of his home and is paralyzed. With the help of happy-go-lucky Navy mechanic \"Jughead\" Carson (Dailey), Wead regains some use of his legs and eventually restores meaning to his life. The film was shot on location at the Naval Air Station in Pensacola, Florida, using real Navy men as extras.', ']]>']\n{'Genre': 'Documentary, Military & War', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Contributor': \"Ward Bond, Dan Dailey, Charles Schnee, Ken Curtis, Edmund Lowe, Frank Wead, John Wayne, Kenneth Tobey, Frank Fenton, William Wister Haines, John Ford, James E Newcom, Maureen O'HaraWard Bond, Dan Dailey, Charles Schnee, Ken Curtis, Edmund Lowe, Frank Wead, John Wayne, Kenneth Tobey, Frank Fenton, William Wister Haines, John Ford, James E Newcom, Maureen O'Hara  See more\", 'Initial release date': '2007-05-22', 'Language': 'Unqualified, English (Mono)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 2.4 Ounces', 'Item model number': '79863', 'Director': 'John Ford', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'May 22, 2007', 'Actors': \"John Wayne, Dan Dailey, Maureen O'Hara, Ward Bond, Ken Curtis\", 'Subtitles': 'French, Spanish, English', 'Producers': 'Charles Schnee, James E Newcom', 'Studio': 'Studio Distribution Services', 'Writers': 'Frank Fenton, William Wister Haines, Frank Wead', 'Country of Origin': 'USA', 'Number of discs': '1'}\nJohn Wayne, what can you say, if your a fan then you know there's none better for entertaining on the screen. A biography of Frank &#34;Spig&#34; Wead, Naval Aviator directed by Rear Admiral John Ford, its exciting, fast paced and action pacted, just what we've come to expect in the &#34;Duke&#34;. A great supporting role by Dan Dailey. A treat that's worth a look. Thanks.\nif your a fan then you know there's none better for entertaining on the screen\nWomen's Blood Bath Wrestling\nAmy Lynn Best, Melantha Blackthorne, Sofiya Mina Smirnova  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n[\"The Hottest Women of Horror in Blood-Soaked Hand-to-Hand Combat! Featuring some of the most gorgeous actresses in the underground horror scene, Women's Blood Bath Wrestling is a free-for-all of epic, plasmic proportions! See them hold, kick, slap and grapple each other right into a giant pool of blood until they are all completely soaked in sin!\"]\n{'Genre': 'Horror', 'Format': 'NTSC', 'Contributor': 'Amy Lynn Best, Melantha Blackthorne, Sofiya Mina Smirnova', 'Language': 'English', 'Runtime': '1 hour and 10 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Media Format': 'NTSC', 'Run time': '1 hour and 10 minutes', 'Release date': 'March 20, 2012', 'Actors': 'Amy Lynn Best, Melantha Blackthorne, Sofiya Mina Smirnova', 'Studio': 'Kick Ass', 'Number of discs': '1'}\nI actually didn't expect much, but I'd seen Melantha Blackthorne in a couple of movies and she showed potential as an actress. This however is not one she should put on her resume.\nWomen's Wrestling?\nNo Mans Land-Rise of the Reeker\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['Wild, sleeper horror flic, a splendid time is guaranteed for all!']\n{'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Studio': 'LIONSGATE'}\nAn overall enjoyable entry into the realm of horror flick. A decent story, well paced and worth a look. Thanks.\nHorror Land?\nThe Portal\nJenna Zablocki  (Actor),     Michael Muhney  (Actor),     Serge Rodnunsky  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"At first she thought she'd encountered a rare strain of some exotic virus. However Dr. April Meadows discovers things aren't always what they seem. While investigating the case, she uncovers a mysterious painting, which seems to answer all of her questions - and begin of all of her problems.\"]\n{'Format': 'Multiple Formats, Color, Dolby, NTSC, Surround Sound, Widescreen', 'Contributor': 'Sandy Hackett, Michael Madsen, Nicholas Brandon, Michael Muhney, Mary Margaret Humes, Serge Rodnunsky, Stacey Keach, Jenna ZablockiSandy Hackett, Michael Madsen, Nicholas Brandon, Michael Muhney, Mary Margaret Humes, Serge Rodnunsky, Stacey Keach, Jenna Zablocki  See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 5.25 x 0.75 inches; 2.56 Ounces', 'Director': 'Serge Rodnunsky', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Surround Sound, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'August 14, 2012', 'Actors': 'Jenna Zablocki, Michael Muhney, Michael Madsen, Stacey Keach, Nicholas Brandon', 'Studio': 'Maverick', 'Number of discs': '1'}\nSorry not much I can say regarding this movie. I just couldn't get into it, seemed to switch gears and confuse, rather then entertain.\nPortal confusion\nSkull Heads\nRobin Sydney  (Actor),     Samantha Light  (Actor),     Charles Band  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['For generations, the strange, inbred Arkoff family has lived in their creepy Italian castle undisturbed by the outside world. Until one night when their sanctuary is invaded by a trio of treacherous art thieves and the Arkoffs must fight for their lives, aided only by the ancient protectors of the castleâ¦the deadly SKULL HEADS!']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Charles Band', 'Media Format': 'NTSC, Color, Multiple Formats', 'Run time': '1 hour and 20 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Robin Sydney, Samantha Light, Steve Kramer, Rane Jameson, Kim Argetsinger', 'Language': 'Unqualified (Stereo)', 'Studio': 'Full Moon Entertainment', 'Writers': 'August White', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAn interesting story with great possibilities, a great old castle, decent acting, all the ingredients for an old fashioned horror flick. Sadly, the &#34;Skull Heads&#34; themselves were pathetic, and the story finished more with a whimper than a shock. Overall 3 stars at best.\nHorror DVD\nThe Phantom\nRyan Carnes  (Actor),     Isabella Rossellini  (Actor),     Paolo Barzman  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Chris Moore (Ryan Carnes) is an urban daredevil who gets his kicks from racing across rooftops. When a secret organization approaches him with proof that he is actually the son of a legendary international crime fighter called The Phantom, he is thrust into a world he never knew existed- a world of exotic islands, secret lairs and a heritage that borders on royalty. Re-imagined and re-loaded, the classic superhero is upgraded for the 21st century with a new, state-of-the-art costume and a newly formed rivalry against some of the most techno-savvy villains to ever terrorize the world! It's explosive action and nonstop adventure from start to finish as The Phantom comes to life.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Paolo Barzman', 'Media Format': 'NTSC, Widescreen', 'Run time': '2 hours and 55 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Ryan Carnes, Isabella Rossellini, Cameron Goodman', 'Language': 'Unqualified', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\n&#34;The Phantom&#34;, one of my favorite comic books growing up.This lengthy version is quite enjoyable overall, worth 4 stars or more. Like many of today's movies, this one also left the door open for a sequel. My hope is that they will make future sequels. Worth a look.\nSuper Hero DVD\nSan Francisco Story\nJoel McCrea  (Actor),     Yvonne De Carlo  (Actor),     Robert Parrish  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Yvonne de Carlo, Joel McCrea. Newspaper editor Jim Martin urges his wealthy friend Rick Nelson to come to San Francisco to help him clean up the corrupt 1850s government. Initially Rick isn't interested in being part of a vigilante group, but he changes his mind quickly when he falls in love with the girlfriend of a crooked politician. 1952/b&w/80 min/NR/fullscreen.\"]\n{'Genre': 'Westerns', 'Format': 'Multiple Formats, NTSC, Black & White', 'Contributor': 'Sidney Blackmer, Joel McCrea, Yvonne De Carlo, John Doucette, Florence Bates, Robert Parrish, Onslow Stevens, Robert FoulkSidney Blackmer, Joel McCrea, Yvonne De Carlo, John Doucette, Florence Bates, Robert Parrish, Onslow Stevens, Robert Foulk  See more', 'Language': 'English', 'Runtime': '1 hour and 20 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5821000', 'Director': 'Robert Parrish', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '1 hour and 20 minutes', 'Release date': 'August 25, 2009', 'Actors': 'Joel McCrea, Yvonne De Carlo, Sidney Blackmer, Onslow Stevens, John Doucette', 'Studio': 'Shout! Factory / Timeless Media', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA wonderful tale of old San Francisco, starring that cowboy great; Joel McCrea. Yvonne DeCarlo is always a nice distraction!  An evenly paced story that well worth your time if your a buff of the western genre as I am. 5 stars. Thanks.\nA wonderful tale of old San Francisco",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preferences:** The user continues to favor suspenseful and dramatic narratives, particularly in crime and justice themes. Recent interactions reveal an appreciation for classic action-adventure films, indicating a nostalgia for traditional storytelling while maintaining interest in broader narratives.\n\n- **Content Preferences:** Fast-paced storytelling with dark themes remains a key interest. The user’s critical stance on production quality is evident, favoring coherent plots that provide engaging experiences. Their latest review showcased enjoyment in a Western narrative, further enhancing their exploration into the action-adventure genre while maintaining their standards.\n\n- **Rating Trends:** While the user typically rates films around 4 stars, they have shown an openness to high ratings for engaging narratives, evidenced by a recent 5-star review for a Western film. This reflects a discerning eye for quality storytelling across genres, particularly within action and adventure.\n\n- **Language and Subtitles:** A strong preference for English content persists, emphasizing comprehension as essential for enjoyment and effective engagement.\n\nOverall, the user seeks innovative films with robust character development and narrative depth, now increasingly open to classic films that resonate with their preferences in action and adventure, while continuing to uphold high standards for clarity and storytelling quality across all genres.",
  "metrics": {
    "rouge1_f": 0.07508044333214157,
    "rouge2_f": 0.007871198568872988,
    "rougeL_f": 0.04004290311047551,
    "meteor": 0.019158769158769157,
    "bleu1": 2.889936782243017e-07,
    "bleu2": 1.0031197907274857e-07,
    "bleu3": 1.431194893480508e-08,
    "bleu4": 5.411432294927395e-09,
    "bertscore_precision": 0.3290024399757385,
    "bertscore_recall": 0.48776212334632874,
    "bertscore_f1": 0.39295271039009094
  }
}