{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Archer: The Complete Season 4\nReview Date: 2015/10/22\nStore: H. Jon Benjamin  (Actor),     Judy Greer  (Actor),     Adam Reed  (Director),     Bryan Fordney  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: [\"Swing back into action with Sterling Archer -- the world's greatest spy -- and the agents of ISIS for another hilarious season of cocktails, carousing and animated awesomeness! Follow the team around the globe, from the mysterious Bermuda Triangle all the way to the Vatican, as they bicker, backstab and bumble their way through assassination plots, an ill-advised marriage, an unexpected pregnancy, and a venomous snake bite in a very, very bad place! Packed with terrorist threats, sexual shenanigans, and all things inappropriate, Archer Season Four comes fully loaded with outrageous top-secret extras!\"]\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '28928454', 'Director': 'Adam Reed, Bryan Fordney', 'Media Format': 'NTSC, Closed-captioned, Animated, Color, Dolby', 'Run time': '4 hours and 46 minutes', 'Release date': 'January 7, 2014', 'Actors': 'H. Jon Benjamin, Judy Greer, Amber Nash, Chris Parnell, Aisha Tyler', 'Subtitles': 'English, Spanish, French', 'Producers': 'Neal Holman, Floyd County', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: Great series.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Nine Lives of Christmas\nBrandon Routh  (Actor),     Kimberly Sustad  (Actor),     Mark Jean  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Zachary is a handsome bachelor who enjoys the liberties of being single. When a stray cat adopts Zach as his owner, Zach falls in love with the little guy in spite of the fact that he wants to stay away from responsibility. His new pet brings him into contact with Merilee White, a beautiful woman who is Zach s opposite. Through his new pet, Zach begins to see that being accountability-free isn t as fulfilling as he thought and that the wrong woman might just be the perfect match.']\n{'Genre': 'Drama/Television', 'Format': 'Widescreen, Dolby, Closed-captioned, NTSC, Color', 'Contributor': 'Mark Jean, Brandon Routh, Kimberly Sustad, Gregory Harrison', 'Language': 'English', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4479', 'Director': 'Mark Jean', 'Media Format': 'Widescreen, Dolby, Closed-captioned, NTSC, Color', 'Run time': '1 hour and 27 minutes', 'Release date': 'January 6, 2015', 'Actors': 'Brandon Routh, Kimberly Sustad, Gregory Harrison', 'Studio': 'Hallmark', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nRecipe for a Perfect Christmas\nCarly Pope  (Actor),     Christine Baranski  (Actor),     Sheldon Larry  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', 'First-time food critic JJ Jenner is a cute but bookish 24-year-old whose transformation from low-level magazine writer to coveted food columnist faces just one roadblock--her free-spirited, scene-stealing mother, who shows up unannounced for the holidays. Low on energy and patience, and desperate to get some work done, JJ sets her mom up with Alex, a sweet and ambitious young chef, in exchange for reviewing his struggling restaurant. When writer s block suddenly hits, JJ begins to recognize that her true feelings for Alex may be the problem. As Christmas nears, JJ learns that her mother is just as vulnerable and insecure as she is, and that love and family are worth risking everything for.Starring Carly Pope, Christine Baranski, and Bobby Cannavale.', 'Amazon.com', \"A charming holiday story about relationships, Lifetime's\", 'Recipe for a Perfect Christmas', 'stars the incomparable Christine Baranski (', 'The Good Wife', ',', 'Falling for Grace', '), paired with Carly Pope (', '24', ',', 'Outlaw', ') and Bobby Cannavale (', 'Cold Case', ',', 'Third Watch', '). For food critic J.J. Jenner, \"Christmas is nothing but high expectation and big disappointment,\" so getting a big promotion that will mean lots of extra work right at holiday time is nothing but good news. But when J.J.\\'s mother shows up unexpectedly and moves in for the holidays, J.J. is unable to get anything done and quickly becomes desperate to find something to occupy her mother and get her out of the apartment. Setting her mother up on date with a struggling restaurateur who will literally do anything to get J.J. to review his restaurant seems like the perfect solution, but things don\\'t work out quite like she\\'s planned. J.J. eventually finds herself not only completely distracted, but reexamining her attitude toward the holiday season, her rocky relationship with her mother, and even the extent of her dedication to her profession. Each character grows and changes through their interactions with one another, and in the end, all three find that they definitely have something unexpected to be thankful for this holiday season. A feel-good film along the lines of', 'Shopaholic', 'and', 'When in Rome', ',', 'Recipe for a Perfect Christmas', \"is a great choice for mother-daughter night or a girls' movie night around the holidays. (Ages 10 and older)\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Carly Pope, Christine Baranski, Bobby Cannavale, Sheldon Larry, JJ Jenner', 'Language': 'Unqualified', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.54 x 5.36 x 7.53 inches; 2.4 Ounces', 'Item model number': 'unknown', 'Director': 'Sheldon Larry', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'October 26, 2010', 'Actors': 'Carly Pope, Christine Baranski, Bobby Cannavale, JJ Jenner', 'Studio': 'A&E Home Video', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nUndercover Bridesmaid (Hallmark)\nGregory Harrison  (Actor),     Brooke Burns  (Actor),     Matthew Diamond  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n[\"Tanya Harsin (Brooke Burns) is miserable at her latest job defending Daisy (Nicole Paggi) the daughter of Jim Thompson, a Texas mogul (Gregory Harrison). Tanya has been hired to protect Daisy, who has been receiving death threats weeks before her wedding. Harsin struggles to blend in with the bubbly, girly bridesmaids; this is not her typical assignment. Between the aunt who is depleting the family scholarship fund, the playboy cousin with an inheritance at stake, a very angry business partner, and the groom with a wandering eye almost everyone at the wedding is a legitimate suspect, and this undercover bridesmaid must not lose control of her mission. But will Tanya manage to protect the bride when she's distracted by a handsome friend of the groom?\"]\n{'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Brooke Burns, Matthew Diamond, Gregory Harrison', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Director': 'Matthew Diamond', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Gregory Harrison, Brooke Burns', 'Studio': 'Sonar Entertainment', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nA Very Merry Mix-Up\nAlicia Witt  (Actor),     Scott Gibson  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Shop owner Alice Chapman (Alicia Witt) is nervous to meet her future in-laws at Christmas, especially because she is arriving ahead of her new fiance, Will Mitchum (Scott Gibson). Alice\\'s trip becomes more stressful when her luggage is lost and her phone is damaged, leaving her no way to find Will\\'s family! As fate would have it, she meets her future brother-in-law, Matt Mitchum (Mark Wiebe), at baggage claim and is happy to get a ride home with him. As Alice meets Matt\\'s doting family, mom Penny (Susan Hogan), dad Joe (Richard Fitzpatrick) and Grandpa Charles (Lawrence Dane), she falls in love with their festive holiday traditions and warm welcome to their home. And when unexpected romance comes calling as Christmas approaches, Alice must decide if her \"Merry Mix-Up\" will actually turn out to be her destiny.']\n{'Genre': 'Miscellaneous / Holiday / Pop Vocal', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Scott Gibson, Alicia Witt', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '29280063', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 14, 2014', 'Actors': 'Alicia Witt, Scott Gibson', 'Studio': 'CINEDIGM', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nA Christmas Kiss\nLaura Breckenridge  (Actor),     Elisabeth Rohm  (Actor),     John Stimpson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n[\"Wendy is an aspiring designer and assistant to her callous boss Priscilla. Unfortunately, Wendy's dreams of impressing her boss get complicated when she realizes that the mysterious man she kissed in a falling elevator is Priscilla's boyfriend, Adam. As the holidays approach and Adam and Wendy's friendship grows, Priscilla is forced to take drastic measures to make sure her engagement goes forward as planned. Will Wendy and Adam connect before it's too late.\"]\n{'Genre': 'Drama/Television', 'Format': 'Anamorphic, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Brendan Fehr, Elisabeth Rohm, Laura Breckenridge, John Stimpson', 'Language': 'English', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '25646003', 'Director': 'John Stimpson', 'Media Format': 'Anamorphic, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Laura Breckenridge, Elisabeth Rohm, Brendan Fehr', 'Studio': 'Marvista', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nArcher: Season 2\nGeorge Coe  (Actor),     H. Jon Benjamin  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Sterling Archer, the world’s most dangerous spy, and his snarky ISIS cohorts are back for another outrageously raunchy season of international espionage and hilarious inter-office intrigue! When he’s not busy foiling eco-terrorist threats, tracking down mysterious killers, or having sex in x-ray machines, the suave master-spy has his hands full with bikini-clad ninjas, Swiss nymphomaniacs, and paternity suits. Archer searches for the true identity of his father, battles breast cancer, and brings a sexy, ex-KGB agent home to meet his domineering mother. It’s all in a day’s work for the international man of mystery in this uproariously edgy animated farce.']\n{'Genre': 'Comedy/Television, Animation/Television', 'Format': 'Multiple Formats, AC-3, Color, Animated, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Aisha Tyler, George Coe, Archer, Amber Nash, Jessica Walter, Judy Greer, Chris Parnell, H. Jon Benjamin, Adam ReedAisha Tyler, George Coe, Archer, Amber Nash, Jessica Walter, Judy Greer, Chris Parnell, H. Jon Benjamin, Adam Reed  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.36 Ounces', 'Item model number': '12098995859', 'Media Format': 'Multiple Formats, AC-3, Color, Animated, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 46 minutes', 'Release date': 'December 27, 2011', 'Actors': 'George Coe, H. Jon Benjamin, Aisha Tyler, Jessica Walter, Chris Parnell', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nGreat series.\nFive Stars\nMarvel's Avengers: Age of Ultron\nRobert Downey Jr.  (Actor),     Chris Evans  (Actor),     Joss Whedon  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Marvel Studios unleashes the next global phenomenon in the Marvel Cinematic Universe -- MARVEL\\'S AVENGERS: AGE OF ULTRON. Good intentions wreak havoc when Tony Stark (Robert Downey Jr.) unwittingly creates Ultron (James Spader), a terrifying A.I. monster who vows to achieve \"world peace\" via mass extinction. Now Iron Man, Captain America (Chris Evans), Thor (Chris Hemsworth) and The Hulk (Mark Ruffalo) -- alongside Black Widow (Scarlett Johansson), Hawkeye (Jeremy Renner) and Nick Fury (Samuel L. Jackson) -- must reassemble to defeat Ultron and save mankind...if they can! This action-packed adventure is a mind-blowing blast!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Item model number': '35220145', 'Director': 'Joss Whedon', 'Media Format': 'AC-3, Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, 3D, Widescreen, Digital_copy', 'Run time': '2 hours', 'Release date': 'October 2, 2015', 'Actors': 'Robert Downey Jr., Chris Evans, Chris Hemsworth, Mark Ruffalo, Scarlett Johansson', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Studio': 'Walt Disney Studios Home Entertainment', 'Number of discs': '2'}\nAmazing movie.\nFive Stars\nThe Lord of the Rings: The Motion Picture Trilogy (Extended Edition Blu-ray)\nElijah Wood  (Actor),     Ian McKellen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"The Fellowship of the Ring; A meek hobbit of the Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron. The Two Towers: While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. The Return of the King: Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring. Peter Jackson directs these action adventure movies starring Elijah Wood, Viggo Mortensen, Ian McKellen, Sean Astin, Cate Blanchet and more. This special edition of The Lord of the Rings Trilogy includes extended edition of the movies on 15 Blu-Ray discs.\", 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Review', \"Jackson surpasses the expectations anyone might have had for him with The Fellowship of the Ring, the first installment of his trilogy devoted to J.R.R. Tolkien's masterwork. --Charlotte Observer, Lawrence ToppmanMoviegoers should be almost as entranced by the teeming, glorious landscapes and dark, bloody battlegrounds of Two Towers: astonishing midpoint of an epic movie fantasy journey for the ages. --Chicago Tribune, Michael Wilmington\", 'See more']\n{'Genre': 'Fantasy, Action & Adventure, Science Fiction', 'Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Contributor': 'Viggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando BloomViggo Mortensen, Christopher Lee, Andy Serkis, Peter Jackson, John Rhys-Davies, Cate Blanchett, Sean Bean, Ian McKellen, Elijah Wood, Sean Astin, Liv Tyler, Dominic Monaghan, Hugo Weaving, Billy Boyd, Orlando Bloom  See more', 'Initial release date': '2012-05-01', 'Language': 'Portuguese (Dolby Digital 5.1), English (DTS-HD Master Audio 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.72 Ounces', 'Item model number': '939705', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Box set, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 21 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Liv Tyler', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Studio Distribution Services', 'Number of discs': '15'}\nGreat movies.\nFive Stars\nThe Great Outdoors / Uncle Buck Double Feature [DVD]\nDan Aykroyd  (Actor),     John Candy  (Actor),     Howard Deutch  (Director),     John Hughes  (Director, Producer, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['The Great Outdoors: When an unannounced, uninvited and unwelcome family of fun-loving misfits converge upon a lakeside resort to join their relatives for a summer of relaxation, the result is anything but restful in this raucous comedy starring Dan Aykroyd and John Candy. It\\'s a vacationer\\'s worst nightmare, as wheeler-dealer Aykroyd, his sexually repressed wife and eerie twin daughters \"join\" the easygoing Candy and his straight-laced clan for a season of \"fun\" in the sun. Unfortunately, the only thing these two in-laws have in common is their intense dislike for each other. Soon, it\\'s brother-in-law against brother-in-law in an uproarious and hilarious fight to the finish to see which one really knows how to enjoy The Great Outdoors. Uncle Buck: John Candy stars in Uncle Buck, the outrageous comedy written and directed by John Hughes (The Breakfast Club). As an idle, good-natured bachelor, Uncle Buck is the last person you would think of to watch the kids. However, during a family crisis, he is suddenly left in charge of his nephew and nieces. Unaccustomed to suburban life, fun-loving Uncle Buck soon charms his younger relatives Miles and Maizy with his hefty cooking and his new way of doing the laundry. His carefree style does not impress everyone though - especially his rebellious teenage niece, Tia, and his impatient girlfriend, Chanice. With a little bit of luck and a lot of love, Uncle Buck manages to surprise everyone in this heartwarming family comedy.', 'Bonus Content:', 'Disc 1 - The Great Outdoors:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Annette Bening, Stephanie Faracy, Garrett M. Brown, Arne Schmidt, Dan Aykroyd, Amy Madigan, Chris Young, Howard Deutch, Jay Underwood, Jean Louisa Kelly, Lucy Deakins, Macaulay Culkin, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, Gaby Hoffman, Robert ProskyAnnette Bening, Stephanie Faracy, Garrett M. Brown, Arne Schmidt, Dan Aykroyd, Amy Madigan, Chris Young, Howard Deutch, Jay Underwood, Jean Louisa Kelly, Lucy Deakins, Macaulay Culkin, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, G…   See more', 'Initial release date': '2012-10-09', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.61 Ounces', 'Item model number': '25631065', 'Director': 'Howard Deutch, John Hughes', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 11 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Dan Aykroyd, John Candy, Jean Louisa Kelly, Annette Bening, Macaulay Culkin', 'Producers': 'Arne Schmidt, John Hughes, Tom Jacobson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movies.\nFive Stars\nRevenge of the Nerds: Panty Raid Edition\nRobert Carradine  (Actor),     Anthony Edwards  (Actor),     Jeff Kanew  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"Close friends Lewis and Gilbert are freshman at their new college. Unfortunately, they are also nerds to the extreme: horn-rimmed glasses, ill-fitting, mismatched clothes, intelligence galore, etc. Naturally, the curvaceous coeds, juvenile jocks and infantile frat brothers make their lives, and the lives of their fellow outcasts, a misery. But when the nerds decide to create their own fraternity, sexual and comedic hijinks ensue as the nerds seek vengeance against those who've done them wrong. Director Jeff Kanew Star Robert Carradine, Anthony Edwards, Curtis Armstrong Special Features: Widescreen, Commentary Featurettes, Bonus Shorts.\", 'Set Contains:', 'The deluxe edition of the 1984 college comedy', 'Revenge of the Nerds', \"comes equipped with a variety of special features that the film's cult fans will find essential. First, a running audio commentary by director Jeff Kanew and actors Robert Carradine, Timothy Busfield and Curtis Armstrong proves a delight: warm and silly memories by some very likeable, middle-age guys about working, scene-by-scene, on a goofy,\", 'Animal House', '-like movie in their younger years. The same four individuals, and others from the cast such as Ted McGinley (who played the villainous hunk Stan Gable), Julia Montgomery (Stan\\x92s girlfriend, Betty Childs), and Andrew Cassese (Wormser), reminisce in the featurette documentary \"I\\x92m a Nerd and I\\x92m Pretty Proud of It\" about how they landed their respective jobs on the film (seems like everyone read for Carradine\\x92s part) and how wild and crazy the actual shoot was in Tucson. What strikes one is how positive all those memories are. Even though some careers haven\\x92t exactly skyrocketed in the years since', 'Revenge', 'took off, the experience seems to have been very good for everyone at the time. Also included in the special features section is the original, Orson Welles-narrated theatrical trailer; a trailer for', 'Revenge of the Nerds II: Nerds In Paradise', '; and such deleted scenes as a romantic interlude between Gilbert (Anthony Edwards) and girlfriend Judy (Michelle Meyrink), and another starring Michael Lerner as Gilbert\\x92s racist uncle. A real rarity: the pilot for a truly forgettable television version of', 'Revenge of the Nerds', '.', '--Tom Keogh']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Anthony Edwards, Miguel Tejada-Flores, Brian Tochi, Julia Montgomery, Robert Carradine, Matt Salinger, Curtis Armstrong, Jeff Kanew, Timothy Busfield, Tim Metcalfe, Donald Gibb, Jeff Buhai, Larry B. Scott, Steve Zacharias, Michelle Meyrink, Ted McGinley, Andrew CasseseAnthony Edwards, Miguel Tejada-Flores, Brian Tochi, Julia Montgomery, Robert Carradine, Matt Salinger, Curtis Armstrong, Jeff Kanew, Timothy Busfield, Tim Metcalfe, Donald Gibb, Jeff Buhai, Larry B. Scott, Steve Zacharias, Michelle Meyrink, Ted McGinley, Andrew Cassese   See more', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'FOXS2268837DVD', 'Director': 'Jeff Kanew', 'Media Format': 'Multiple Formats, Color, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'March 6, 2007', 'Actors': 'Robert Carradine, Anthony Edwards, Timothy Busfield, Andrew Cassese, Curtis Armstrong', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Studio': '20th Century Fox Home Entertainment', 'Writers': 'Jeff Buhai, Miguel Tejada-Flores, Steve Zacharias, Tim Metcalfe', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nGirls Just Want to Have Fun\nSarah Jessica Parker  (Actor),     Helen Hunt  (Actor),     Alan Metter  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Sarah Jessica Parker and Helen Hunt star in the outrageous '80s comedy hit! Janey (Sarah Jessica Parker) is a shy good girl. Lynne (Helen Hunt) is a cool rock chick. But when the two friends scheme to get Janey on television's biggest after-school dance show, they find themselves on a wild adventure filled with cute boys, hot dancing, prudish nuns, mean rich kids, parents that just don't understand, and girls doing what they know best...just having fun. Shannen Doherty, Jonathan Silverman, and Lee Montgomery co-star in this fun-filled comedy that's totally packed with outrageous '80s fashions, music, dance moves, and more!\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Sarah Jessica Parker, Alan Metter, Shannen Doherty, Jonathan Silverman, Lee Montgomery, Helen Hunt, Terry McGovernSarah Jessica Parker, Alan Metter, Shannen Doherty, Jonathan Silverman, Lee Montgomery, Helen Hunt, Terry McGovern  See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '21164821', 'Director': 'Alan Metter', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 27, 2011', 'Actors': 'Sarah Jessica Parker, Helen Hunt, Shannen Doherty, Jonathan Silverman, Lee Montgomery', 'Studio': 'Image Entertainment', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nMr. Mom\nVarious  (Actor, Director)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'Mr. Mom (PS/RPKG/DVD)', ']]>', 'Amazon.com', \"When Jack Butler (Michael Keaton) loses his job at an auto factory, he expects to quickly find another. But instead, his wife Caroline (Teri Garr) starts working for an ad agency and Jack ends up taking care of the house and kids. He soon runs afoul of shopping etiquette, a voracious vacuum cleaner, and he can't even drop his kids off at school properly. He starts losing his pride and letting himself go. He stops shaving, drinks at all hours, and watches soap operas. And not only does a predatory divorcée (Ann Jillian) have her eye on him, Caroline's new boss (Martin Mull) has more than business on his mind. Will their marriage survive? What makes\", 'Mr. Mom', \"work isn't its role-reversal premise, but its clever off-the-main-plot scenes like the obstacle course at the company picnic, where a footrace with swim fins is set to a variation on the theme to\", 'Chariots of Fire', '; a poker game using discount coupons for money; or a traumatic, soap-opera-influenced dream Jack has when he realizes his life is going down the toilet. This is the first starring role for Michael Keaton, who went on to star in', 'Beetlejuice', 'and', 'Batman', '; he makes the most of both its comic and sentimental side. The script, incidentally, is written by John Hughes, who later went on to write and direct', 'The Breakfast Club', 'and', 'Home Alone', '.', '--Bret Fetzer']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified, French (Mono), Spanish (Stereo)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': 'FOXS124137DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Run time': '1 hour and 31 minutes', 'Release date': 'April 5, 2011', 'Actors': 'Various', 'Subtitles': 'Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nSixteen Candles\nMolly Ringwald  (Actor),     Anthony Michael Hall  (Actor),     John Hughes  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['One of the most iconic teen comedies of the 1980s, Sixteen Candles, returns in an all-new Flashback Edition with never-before-seen bonus features! Samantha Baker (Molly Ringwald) is ready to make the most of her sweet sixteenth birthday … if only someone in her family would remember it. She\\'s your average teen, enduring creepy freshmen, spoiled siblings, confused parents and the \"Big Blonde on Campus\" who stands between her and the boy of her dreams. From writer/director John Hughes (The Breakfast Club, Weird Science), Sixteen Candles is a warm-hearted coming-of-age comedy that helped define a generation!Bonus Content:', 'Celebrating Sixteen Candles', 'Celebrating Sixteen Candles']\n{'Genre': 'DVD Movie, Blu-ray Movie, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen, DTS Surround SoundMultiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen, DTS Surround Sound  See more', 'Contributor': 'Justin Henry, Liane Alexandra Curtis, Bobby Byrne, Molly Ringwald, Edward Andrews, Paul Dooley, Jami Gertz, Carlin Glynn, Cinnamon Idles, John Kapelos, Zelda Rubinstein, Steve Monarque, Tony Longo, Joan Cusack, Anthony Michael Hall, John Hughes, Ira Newborn, John Cusack, Marge Kotlisky, Carole Cook, Haviland MorrisJustin Henry, Liane Alexandra Curtis, Bobby Byrne, Molly Ringwald, Edward Andrews, Paul Dooley, Jami Gertz, Carlin Glynn, Cinnamon Idles, John Kapelos, Zelda Rubinstein, Steve Monarque, Tony Longo, Joan Cusack, Anthony Michael Hall, John Hughes, Ira Newborn, Joh…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), English (DTS 5.1)', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.47 Ounces', 'Item model number': '1102414', 'Director': 'John Hughes', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '1 hour and 33 minutes', 'Release date': 'September 16, 2008', 'Actors': 'Molly Ringwald, Anthony Michael Hall, Edward Andrews, Carole Cook, Liane Alexandra Curtis', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nOverboard\nKurt Russell  (Actor),     Goldie Hawn  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'A romantic comedy about a snooty millionaire who falls off her yacht and forgets her identity. Luckily there\\'s the grungy carpenter who she\\'s been looking down her nose at to \"remind\" her who she is his wife and the mother of their four children.', 'Amazon.com', 'Real-life couple Kurt Russell and Goldie Hawn star in this enjoyable 1987 comedy by Garry Marshall (', 'Pretty Woman', ') about an imperious heiress (Hawn) who loses her memory after a boating accident and is identified as the wife of a handyman (Russell). Russell\\'s character brings her \"home\" to his messy house and unruly kids, and the laughs follow as the aristocratic Hawn tries fitting in. Marshall delivers the comic goods, the leads are entertaining (Russell needs to do more comedy), and the supporting cast is made up of happily familiar faces, including Roddy McDowall, Edward Herrmann, and Marshall favorite Hector Elizondo in an unbilled bit.', '--Tom Keogh']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Letterboxed', 'Contributor': 'Lucinda Crosby, Ed Cree, Frank Buxton, Doris Hess, Edward Herrmann, Katherine Helmond, Russell, Bing, Michael G. Hagerty, Henry Alan Miller, Rushton, Jared, Wild, Jamie, Frank Campanella, Goldie Hawn, Kurt Russell, Mona Lyden, Roddy McDowall, Wiseman, Jeffrey, Brian Price, Williard, CarolLucinda Crosby, Ed Cree, Frank Buxton, Doris Hess, Edward Herrmann, Katherine Helmond, Russell, Bing, Michael G. Hagerty, Henry Alan Miller, Rushton, Jared, Wild, Jamie, Frank Campanella, Goldie Hawn, Kurt Russell, Mona Lyden, Roddy McDowall, Wiseman, Jeffrey, Br…  See more', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Audio Description': 'English', 'Item model number': '027616656629', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, Letterboxed', 'Run time': '1 hour and 46 minutes', 'Release date': '01M 6, 2015', 'Actors': 'Kurt Russell, Goldie Hawn, Ed Cree, Lucinda Crosby, Michael G. Hagerty', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nArcher: The Complete Season 4\nH. Jon Benjamin  (Actor),     Judy Greer  (Actor),     Adam Reed  (Director),     Bryan Fordney  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Swing back into action with Sterling Archer -- the world's greatest spy -- and the agents of ISIS for another hilarious season of cocktails, carousing and animated awesomeness! Follow the team around the globe, from the mysterious Bermuda Triangle all the way to the Vatican, as they bicker, backstab and bumble their way through assassination plots, an ill-advised marriage, an unexpected pregnancy, and a venomous snake bite in a very, very bad place! Packed with terrorist threats, sexual shenanigans, and all things inappropriate, Archer Season Four comes fully loaded with outrageous top-secret extras!\"]\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '28928454', 'Director': 'Adam Reed, Bryan Fordney', 'Media Format': 'NTSC, Closed-captioned, Animated, Color, Dolby', 'Run time': '4 hours and 46 minutes', 'Release date': 'January 7, 2014', 'Actors': 'H. Jon Benjamin, Judy Greer, Amber Nash, Chris Parnell, Aisha Tyler', 'Subtitles': 'English, Spanish, French', 'Producers': 'Neal Holman, Floyd County', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nGreat series.\nFive Stars",
  "profile": "The user demonstrates a distinct preference for heartwarming, family-oriented entertainment, balancing emotional depth with humor. Their recent purchase reflects a growing appreciation for animated series that, while often comedic, still encapsulate themes of personal connections and resilience. This aligns with their established taste for films and series celebrating friendship, identity, and self-discovery.\n\nTheir viewing habits indicate a commitment to uplifting storytelling, featuring relatable characters who navigate life’s challenges with wit and a lighthearted approach. The new interaction signifies an interest in adult animation that merges absurdity with engaging narratives, broadening their appreciation for humor in storytelling formats. \n\nThe user prioritizes narratives that blend levity with heartfelt themes, consistent with their established desire for transformative viewing experiences. They enjoy content that evokes joy while prompting reflections on personal growth and loyalty. Their profile reveals a well-rounded enjoyment of entertainment that celebrates emotional connections, laughter, and meaningful storytelling, particularly within the realms of both comedy and family dynamics. Overall, the user's evolving preferences suggest an openness to diverse comedic styles while maintaining their core appreciation for narratives that inspire and resonate emotionally.",
  "metrics": {
    "rouge1_f": 0.034643143544506816,
    "rouge2_f": 0.002246109417615915,
    "rougeL_f": 0.02020850040096231,
    "meteor": 0.009706917319086966,
    "bleu1": 9.972787824710083e-19,
    "bleu2": 3.5516608653882215e-19,
    "bleu3": 4.9777534942343045e-20,
    "bleu4": 1.8658232520233498e-20,
    "bertscore_precision": 0.31249144673347473,
    "bertscore_recall": 0.5118730068206787,
    "bertscore_f1": 0.3880709409713745
  }
}