{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: [miclan] Honey Nutrient Enriched Mask 10pcs - Mediheal Family Brand Facial Sheet Mask Full of Hydraiting Nutrients Skin with Honey and Propolis\nReview Date: 2020/07/10\nStore: miclan\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Miclan', 'Item Form': 'Sheet', 'Product Benefits': 'Moisturizing', 'Scent': 'Honey', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '8.15 x 4.21 x 1.5 inches; 11.99 Ounces'}\nReview Text: This is one of the good kind of masks...you know, the ones that feel sort of jelly like and thick.  It's not watery, but very moisturizing.  I don't recall it having a fragrance to it...frankly most of them don't have much fragrance.  This one is very nice.  It has the paper peel off backing which is extra too.  I would re-order these masks!\nReview Title: Very moisturizing...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "DERMAL 10 Combo Pack Premium Collagen Essence Full Face Facial Mask Sheet - The Ultimate Supreme Collection for Every Skin Condition Day to Day Skin Concerns - Silky Cellulose Mask Sheet\nDERMAL\n{'Brand': 'DERMAL', 'Item Form': 'Sheet', 'Scent': 'Rose', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '10 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.26 x 5 x 1.34 inches; 11.2 Ounces', 'UPC': '703856882157'}\nI like these masks for daily use, as they are somewhat moisturizing and no real fragrance that I can detect.  I like the variety of the pack and they are easy on my skin.  I did take off one star as they are not as moisturizing as a jelly type mask..these are more water-like...but they are nice in that they are collagen masks.  For the price they are nice.\nNice Daily Mask\nLAPCOS Good Morning Fresh Quick Masks (30 Count) Daily Sheet Masks for Beauty & Skin Care - Hydrating and Moisturizing Korean Face Mask with Witch Hazel, Aloe Vera & Cucumber\nLAPCOS\n{'Brand': 'LAPCOS', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating,Moisturizing', 'Scent': 'Cucumber', 'Skin Type': 'Normal', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5 x 4 x 3 inches; 1 Pounds', 'UPC': '818929024478'}\nI really like this product...from the packaging to the actual mask.  It's really good..the mask moisturizes really well and after just 10 minutes, it feels similar to a serum on my face after I take it off.  Stays moisturized.  And the packaging is awesome....love the little container they are stored in, and I like the tweezers that are included to take the mask out without contaminating with fingers and trying to pull out a single mask.  It's very well done all the way around.\nQuick Moisture!\n[miclan] Honey Nutrient Enriched Mask 10pcs - Mediheal Family Brand Facial Sheet Mask Full of Hydraiting Nutrients Skin with Honey and Propolis\nmiclan\n{'Brand': 'Miclan', 'Item Form': 'Sheet', 'Product Benefits': 'Moisturizing', 'Scent': 'Honey', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '8.15 x 4.21 x 1.5 inches; 11.99 Ounces'}\nThis is one of the good kind of masks...you know, the ones that feel sort of jelly like and thick.  It's not watery, but very moisturizing.  I don't recall it having a fragrance to it...frankly most of them don't have much fragrance.  This one is very nice.  It has the paper peel off backing which is extra too.  I would re-order these masks!\nVery moisturizing...",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** Enjoys hydrating and moisturizing facial masks, with a strong preference for daily use of sheet masks. Recent purchases emphasize nutrient-rich options, particularly with a focus on effective moisturizing properties akin to serum effects.\n  \n- **Usage Frequency:** Favors masks designed for daily application, reflecting a consistent and committed skincare routine and an ongoing quest for hydration and nourishment.\n\n- **Moisturizing Quality:** Highly values deep hydration, seeking products that provide substantial moisture, confirmed by recent positive experiences with thicker, jelly-like textures that enhance skin moisture retention.\n\n- **Scent Sensitivity:** While the user generally prefers minimal fragrance in products, they have shown an openness to mild natural scents, as evidenced by their enjoyment of a honey-scented mask that was not overpowering.\n\n- **Skin Compatibility:** Continues to prioritize gentle, sensitive skin-friendly products, ensuring that all items integrated into their regimen are comfortable and suitable for their skin type.\n\n- **Brand Values:** Strongly inclined toward cruelty-free brands, demonstrating a commitment to ethical beauty choices.\n\n- **Value Consciousness:** Focused on cost-effective skincare solutions that do not compromise on quality, as indicated by favorable experiences with affordable, yet high-performing products that meet their skincare needs.\n\nOverall, the user emphasizes effective, gentle skincare solutions suitable for daily use, reflecting an alignment with their values and preferences in hydration and ethical considerations.",
  "metrics": {
    "rouge1_f": 0.2614173228346457,
    "rouge2_f": 0.02843601895734597,
    "rougeL_f": 0.10393700787401576,
    "meteor": 0.11192195487560508,
    "bleu1": 0.13292551731433808,
    "bleu2": 0.03364211705155727,
    "bleu3": 0.014772200272682043,
    "bleu4": 0.008238591216385462,
    "bertscore_precision": 0.3907586932182312,
    "bertscore_recall": 0.45698773860931396,
    "bertscore_f1": 0.4212861657142639
  }
}