{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: LAPCOS Good Morning Fresh Quick Masks (30 Count) Daily Sheet Masks for Beauty & Skin Care - Hydrating and Moisturizing Korean Face Mask with Witch Hazel, Aloe Vera & Cucumber\nReview Date: 2020/06/22\nStore: LAPCOS\nAverage Rating: 4.3\nProduct Details: {'Brand': 'LAPCOS', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating,Moisturizing', 'Scent': 'Cucumber', 'Skin Type': 'Normal', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5 x 4 x 3 inches; 1 Pounds', 'UPC': '818929024478'}\nReview Text: I really like this product...from the packaging to the actual mask.  It's really good..the mask moisturizes really well and after just 10 minutes, it feels similar to a serum on my face after I take it off.  Stays moisturized.  And the packaging is awesome....love the little container they are stored in, and I like the tweezers that are included to take the mask out without contaminating with fingers and trying to pull out a single mask.  It's very well done all the way around.\nReview Title: Quick Moisture!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "DERMAL 10 Combo Pack Premium Collagen Essence Full Face Facial Mask Sheet - The Ultimate Supreme Collection for Every Skin Condition Day to Day Skin Concerns - Silky Cellulose Mask Sheet\nDERMAL\n{'Brand': 'DERMAL', 'Item Form': 'Sheet', 'Scent': 'Rose', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '10 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.26 x 5 x 1.34 inches; 11.2 Ounces', 'UPC': '703856882157'}\nI like these masks for daily use, as they are somewhat moisturizing and no real fragrance that I can detect.  I like the variety of the pack and they are easy on my skin.  I did take off one star as they are not as moisturizing as a jelly type mask..these are more water-like...but they are nice in that they are collagen masks.  For the price they are nice.\nNice Daily Mask\nLAPCOS Good Morning Fresh Quick Masks (30 Count) Daily Sheet Masks for Beauty & Skin Care - Hydrating and Moisturizing Korean Face Mask with Witch Hazel, Aloe Vera & Cucumber\nLAPCOS\n{'Brand': 'LAPCOS', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating,Moisturizing', 'Scent': 'Cucumber', 'Skin Type': 'Normal', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5 x 4 x 3 inches; 1 Pounds', 'UPC': '818929024478'}\nI really like this product...from the packaging to the actual mask.  It's really good..the mask moisturizes really well and after just 10 minutes, it feels similar to a serum on my face after I take it off.  Stays moisturized.  And the packaging is awesome....love the little container they are stored in, and I like the tweezers that are included to take the mask out without contaminating with fingers and trying to pull out a single mask.  It's very well done all the way around.\nQuick Moisture!",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Enjoys facial masks, specifically those that are hydrating and moisturizing, with a recent inclination towards daily sheet masks.\n- **Usage Frequency:** Prefers masks that can be used daily, reflecting a consistent skincare regimen. \n- **Moisturizing Quality:** Values products that deliver significant hydration, akin to serum-like effects, indicating a preference for enhanced moisturizing capabilities.\n- **Scent Sensitivity:** Generally prefers products with minimal fragrance; however, positive experiences with specific, light scents may suggest openness to mild, natural fragrances.\n- **Skin Compatibility:** Continues to prioritize gentle products suitable for sensitive skin, ensuring comfort in her skincare routine.\n- **Brand Values:** Strong inclination towards cruelty-free brands, reflecting an awareness of ethical considerations in product selection.\n- **Value Consciousness:** Maintains an emphasis on affordability without compromising on quality or effectiveness, as demonstrated in recent purchases.\n\nThe user appears to place significant importance on effective and gentle skincare solutions that integrate well into a daily regimen. Their recent positive experience highlights a preference for well-packaged products that facilitate easy use and maintain skin moisture levels, aligning with their overall values and needs in skincare.",
  "metrics": {
    "rouge1_f": 0.2584745762711865,
    "rouge2_f": 0.025531914893617016,
    "rougeL_f": 0.11016949152542373,
    "meteor": 0.12126111560226352,
    "bleu1": 0.17327348876711057,
    "bleu2": 0.03472534960607636,
    "bleu3": 0.006548921684162776,
    "bleu4": 0.0028469331548079775,
    "bertscore_precision": 0.4027841091156006,
    "bertscore_recall": 0.4565048813819885,
    "bertscore_f1": 0.4279652237892151
  }
}