{
  "interaction_number": 18,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Quartet\nReview Date: 2016/11/18\nStore: Billy Connolly  (Actor),     Maggie Smith  (Actor),     Dustin Hoffman  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Product Description', \"Beecham House is abuzz. The rumor circling the halls is that the home for retired musicians is soon to play host to a new resident. Word is, it's a star. For Reginald Paget (Tom Courtenay), Wilfred Bond (Billy Connolly) and Cecily Robson (Pauline Collins) this sort of talk is par for the course at the gossipy home. But they're in for a special shock when the new arrival turns out to be none other than their former singing partner, Jean Horton (Maggie Smith). Her subsequent career as a star soloist, and the ego that accompanied it, split up their long friendship and ended her marriage to Reggie, who takes the news of her arrival particularly hard. Can the passage of time heal old wounds? And will the famous quartet be able to patch up their differences in time for Beecham House's gala concert?\", 'Amazon.com', \"Oscar-winning actor Dustin Hoffman has never been one to zig when he can zag. Not only did he wait until he was in his mid-70s to direct his first feature film, but his crowd-pleasing adaptation of Ronald Harwood's 1999 play is a thoroughly British affair. Set at one of England's most scenic estates, the fictional Beecham House for Retired Musicians,\", 'Quartet', \"centers on four opera singers. Cecily (Pauline Collins), Wilfred (Billy Connolly), and Reginald (Tom Courtenay, who appeared in Harwood's\", 'The Dresser', \") are busy preparing for the annual Verdi Gala when word spreads about a famous new resident. After Reggie catches sight of the elegant figure, his excitement about the benefit gives way to sorrow: it's his ex-wife, Jean (\", 'Downton Abbey', \"'s Maggie Smith). If the amusingly acid-tongued Jean appears to have moved on--she's married twice since--Reggie hasn't, and still blames her for the failure of their brief marriage. Under the directorship of the supremely self-satisfied Cedric (Michael Gambon), the entire facility continues to rehearse for the concert, except Jean, who says she's retired from singing, though her former partners long to perform their acclaimed version of Verdi's\", 'Rigoletto', \". As they concentrate on persuading her to reconsider, the ice between Reggie and Jean starts to thaw just as Cissy's memory starts to fade, but priorities shift as old friends become reacquainted. If\", 'Quartet', \"doesn't offer many significant surprises, Hoffman skillfully honors the humor, the romance, and the wall-to-wall music--most played by veteran performers--of Harwood's warm-hearted script.\", '--Kathleen C. Fennessy']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Pauline Collins, Jamie Laurenson, Dario Suter, Dickon Stainer, Finola Dwyer, Tom Courtenay, Maggie Smith, Marc Schmidheiny, Billy Connolly, Dustin Hoffman, Stewart Mackinnon, Xavier Marchand, Michael GambonPauline Collins, Jamie Laurenson, Dario Suter, Dickon Stainer, Finola Dwyer, Tom Courtenay, Maggie Smith, Marc Schmidheiny, Billy Connolly, Dustin Hoffman, Stewart Mackinnon, Xavier Marchand, Michael Gambon   See more', 'Language': 'English', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Audio Description': 'English', 'Item model number': '26919975', 'Director': 'Dustin Hoffman', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Release date': 'June 18, 2013', 'Actors': 'Billy Connolly, Maggie Smith, Michael Gambon, Pauline Collins, Tom Courtenay', 'Dubbed': 'French', 'Producers': 'Marc Schmidheiny, Dickon Stainer, Dustin Hoffman, Finola Dwyer, Xavier Marchand', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Fantastic movie.  Great music.  Thoroughly enjoyed and have watched several times.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Frankenheimer'], 'Producers': ['Edward Lewis'], 'Starring': ['Burt Lancaster', 'Kirk Douglas', 'Fredric March'], 'Studio': ['WARNER HOME VIDEO']}\nSaw it years ago and with this viewing found it even more exciting and disturbing.  Very well acted and produced.\nThought provoking.\n{'Audio languages': ['English'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]'], 'Directors': ['Brian G. Hutton'], 'Producers': ['Elliott Kastner'], 'Starring': ['Richard Burton', 'Clint Eastwood', 'Mary Ure'], 'Studio': ['Warner Bros.']}\nVery exciting movie, very well done.  A movie I have seen before and will watch many more times.  Scenery spectacular.\nExcellent movie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]', 'Español [CC]'], 'Directors': ['Ben Bolt', 'Paul Seed'], 'Producers': ['Mark Crowdy'], 'Starring': ['Martin Clunes', 'Caroline Catz'], 'Studio': ['Acorn Media']}\nWe find the Doc Martin series very interesting and more importantly very intertaining.  We have to be careful about when we watch because we cannot quit until we have seen all of the episodes in the season.  End up staying up very late sometimes because we cannot bear not to know what comes next!\nReview of Season 5 Doc Martin\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]', 'Español [CC]'], 'Directors': ['Ben Bolt', 'Minkie Spiro'], 'Producers': ['Mark Crowdy'], 'Starring': ['Martin Clunes', 'Caroline Catz', 'Stephanie Cole']}\nLove it.  Never miss it and watch episodes repeatedly.  Great character development, and scenery is spectacular.  Stories in episodes so interesting and entertertaining.\nDoc Martin Season 4\n{'Content advisory': ['Violence', 'frightening scenes', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Fisher', 'Constantine Makris', 'Tawnia McKiernan', 'Jack Kenny', 'Stephen Surjik', 'Jace Alexander', 'Vincent Misiano', 'Michael W. Watkins', 'Millicent Shelton', 'Michael McMurray'], 'Starring': ['Eddie McClintock', 'Joanne Kelly', 'Saul Rubinek']}\nExcellent quality streaming.  Very enjoyable science fiction and entertaining stories.  Enjoyed very much and intend to watch other seasons as well as rewatching most episodes.\nWarehouse 13 Season 4\nTHAT MIDNIGHT KISS/TOAST OF NEW ORLEANS\nKathryn Grayson  (Actor),     Mario Lanza  (Actor),     Norman Taurog  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['That Midnight Kiss/Toast of New Orleans (DVD) (Multi-Title)', ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.8 Ounces', 'Item model number': 'WHV79530DVD', 'Director': 'Norman Taurog', 'Media Format': 'Closed-captioned, Full Screen, Color, Subtitled', 'Run time': '3 hours and 15 minutes', 'Release date': 'July 24, 2007', 'Actors': 'Kathryn Grayson, Mario Lanza, David Niven, Jose Iturbi, Ethel Barrymore', 'Subtitles': 'French, English', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nSaw these movies on TV and had to have them.  Very inspirational and enjoyable.\nFive Stars\nBest of Warner Bros. 50 Cartoon Collection: Looney Tunes\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Best of Warner Bros. 50 Cartoon Collection - Looney Tunes (DVD)', 'It’s always “wabbit” season now that the best Looney tunes Cartoons from the Warner Bros. vault are available in this wild two-disc collection! Reunite with Bugs Bunny, Elmer Fudd, Porky Pig, Tweety Bird, Sylvester, Daffy Duck and all the Looney tunes gang in an animated assortment of hits that have tickled the funny bones of cartoon lovers for generations. There’s something for everyone in this must-own collection of 50 Looney tunes classics that helped contribute to 90years of Warner Bros. cartoon magic. It’s a timeless anthology for fans of all ages that will have you laughing long before “Tha-That-That’s All, Folds!”', ']]>']\n{'Genre': 'Classics, Animation', 'Format': 'Multiple Formats, NTSC, Color, Animated, Full Screen', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '5 hours and 55 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 5.12 Ounces', 'Item model number': '358377', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Color, Animated, Full Screen', 'Run time': '5 hours and 55 minutes', 'Release date': 'June 25, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nGreatly appreciated Christmas gift.\nCartoon collection\nLooney Tunes:Spotlight Coll. Premiere Ed\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Looney Tunes: Spotlight Collection, The Premiere Edition (Dbl DVD)', \"They're the clown princes of animation. They're the international ambassadors of cartoon comedy. They're the fabulously funny friends you grew up with! And now, 28 of the very best animated shorts starring the very wackiest Warner Bros. cartoon characters have been rounded up on DVD for the first time ever in The Looney Tunes Premiere Collection! Just barely contained in two special edition discs, each specially selected short has been brilliantly restored and re-mastered to its original anvil-dropping, laughter-inducing glory! Featuring some of the very earliest, ground-breaking on-screen appearances of many all-time Looney Tunes favorites, it's an unprecedented animation celebration for cartoon-lovers eager to re-live the heady, hilarious, golden age of Warner Bros. animation! Sparkling with one unforgettable, landmark cartoon classic after another, there's Bugs Bunny's monstrously merry encounter with the tennis-shoe clad creature of Hair-Raising Hare. Wile E. Coyote and Roadrunner racing to cartoon immortality in Fast and Furryous. Oscar-winning animated gems, scenery-chewing Tazmanian Devils and much more! Plus, a dazzling array of totally Looney DVD bonus features!\", ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.5 inches; 6.4 Ounces', 'Item model number': '2232461', 'Director': 'Various', 'Media Format': 'Color, Closed-captioned, Animated, Multiple Formats, Subtitled, NTSC', 'Run time': '3 hours and 27 minutes', 'Release date': 'September 14, 2004', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nMuch loved Christmas gift by child and parents.\nCartoon collection\nHome Alone Collection\nCulkin, Macaulay  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', 'Home Alone', ':', \"Eight-year-old Kevin McCallister (Macaulay Culkin) has become the man of the house, overnight! Accidentally left behind when his family rushes off on a Christmas vacation, Kevin gets busy decorating the house for the holidays. But he's not decking the halls with tinsel and holly. Two bumbling burglars are trying to break in, and Kevin's rigging a bewildering battery of booby traps to welcome them!\", 'Home Alone 2', ':', \"Kevin McCallister (Macaulay Culkin) is back! But this time he's in New York City with enough cash and credit cards to turn the Big Apple into his own playground! But Kevin won't be alone for long. The notorious Wet Bandits, Harry and Marv (Joe Pesci and Daniel Stern), still smarting from their last encounter with Kevin, are bound for New York too, plotting a huge holiday heist. Kevin's ready to welcome them with a battery of booby traps the bumbling bandits will never forget!\", 'Home Alone 3:', \"Here's a perfect movie for kids, who never seem to tire of John Hughes's sure-fire slapstick formula. Working yet another variation on his mammoth 1990 hit, writer-producer Hughes (regarded by many as Hollywood's antichrist) strands a youngster in his own home with the chicken pox in this 1997 retelling. While his parents go to work, he sees a team of burglars invading the neighborhood houses; in fact, they're spies, looking for a toy containing a stolen microchip. The inevitability of the finale--one kid holding off four professionals with toys and garden tools--will do nothing to lessen the amusement of youngsters, who love to see the bad guys get creamed. Adults may pause at the sadistic nature of some of Hughes's pranks, but kids will eat up the image of one of their own outwitting all the adults.\", '--Marshall Fine', 'Home Alone 4:', \"It's tough being nine. Tougher still is spending Christmas with dad (Jason Beghe) at his new girlfriend Natalie's (Joanna Going) mansion even though it's loaded with all the techno-gadgets any kid could hope for! But this Christmas, Kevin (Michael Weinberg) is really in hot water again, and so are Marv (French Stewart) and his sidekick (Missi Pyle), who are trying to rob Natalie's house!\", \"With funnier and more high-tech, crime-stopping wizardry at his disposal than ever, Kevin just might finally put these crooks on ice forever - and keep his parents together while he's at it - in this uplifting, hilarious comedy the whole family is sure to love!\", 'Amazon.com', 'Review for', 'Home Alone:', 'Now and forever a favorite among kids, this 1990 comedy written by John Hughes (', 'The Breakfast Club', ') and directed by Chris Columbus (', 'Mrs. Doubtfire', \") ushered Macaulay Culkin onto the screen as a troubled 8-year-old who doesn't comfortably mesh with his large family. He's forced to grow a little after being accidentally left behind when his folks and siblings fly off to Paris. A good-looking boy, Culkin lights up the screen during several funny sequences, the most famous of which finds him screaming for joy when he realizes he's unsupervised in his own house. A bit wooden with dialogue, the then-little star's voice could grate on the nerves (especially in long, wise-child passages of pure bromide), but he unquestionably carries the film. Billie Bird and John Candy show up as two of the interesting strangers Culkin's character meets. Joe Pesci and Daniel Stern are entertainingly cartoonish as thieves, but the ensuing violence once the little hero decides to keep them out of his house is over-the-top.\", '--Tom Keogh', 'Review for', 'Home Alone 2: Lost in New York:', 'This somewhat unpleasant 1992 sequel to the blockbuster', 'Home Alone', \"revisits the first film's gimmick by stranding Macaulay Culkin's character in New York City while his family ends up somewhere else. Again, the little guy meets up with colorful people on the margins of society (including a pigeon woman played by Brenda Fricker) and again he gets into a prop-heavy battle with Joe Pesci and Daniel Stern. The latter sequence is even worse than the first film in terms of violence inflicted on the two villains (director Chris Columbus, who also made the first film, can't seem to emphasize the slapstick over the graphic effects of the fight). The best running joke finds a concierge (Tim Curry) at the swank hotel where Culkin is staying trying and failing to prove that the boy is on his own.\", '--Tom Keogh', 'Review for', 'Home Alone 3', ':', \"Here's a perfect movie for kids, who never seem to tire of John Hughes's sure-fire slapstick formula. Working yet another variation on his mammoth 1990 hit, writer-producer Hughes (regarded by many as Hollywood's antichrist) strands a youngster in his own home with the chicken pox in this 1997 retelling. While his parents go to work, he sees a team of burglars invading the neighborhood houses; in fact, they're spies, looking for a toy containing a stolen microchip. The inevitability of the finale--one kid holding off four professionals with toys and garden tools--will do nothing to lessen the amusement of youngsters, who love to see the bad guys get creamed. Adults may pause at the sadistic nature of some of Hughes's pranks, but kids will eat up the image of one of their own outwitting all the adults.\", '--Marshall Fine']\n{'Genre': 'Kids & Family, Mystery & Thrillers, Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Culkin, Macaulay', 'Language': 'Unqualified', 'Runtime': '6 hours and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.73 x 5.45 x 7.61 inches; 7.52 Ounces', 'Item model number': 'FOXS2289230DVD', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '6 hours and 54 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Culkin, Macaulay', 'Subtitles': 'English', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nThese movies make me laugh out loud.  I had to have them.\nHome Alone\nThe Odessa File\nJon Voight  (Actor),     Maximilian Schell  (Actor),     Ronald Neame  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['The year is 1963. The place: Hamburg, Germany. An elderly Jewish man commits suicide, leaving a diary which falls into the hands of a freelance newspaperman, Peter Miller (Jon Voight). The diary documents the unspeakable crimes of cruelty, torture and mass murder perpetrated by SS Captain Eduard Roschmann (Maximilian Schell), commandant of the notorious wartime deathcamp at Riga, Latvia. Miller launches a personal manhunt to track down Roschmann, an investigation that leads him into the very heart of Odessa, a powerful secret organization formed by the SS to protect and re-establish its fugitive members throughout the world. When Miller finds Roschmann, he learns that the former Nazi is now the leader of a weaponry complex of international, strategic consequence.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Full Screen, NTSC, Dolby, Color, Subtitled', 'Contributor': 'Jon Voight, Ronald Neame, Maximilian Schell', 'Language': 'English', 'Runtime': '2 hours and 8 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.43 Ounces', 'Item model number': '6885', 'Director': 'Ronald Neame', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Dolby, Color, Subtitled', 'Run time': '2 hours and 8 minutes', 'Release date': 'December 7, 2010', 'Actors': 'Jon Voight, Maximilian Schell', 'Studio': 'Image Entertainment', 'Number of discs': '1'}\nWonderful movie.  Love watching it over and over.\nThe Odessa File\nForce 10 From Navarone\nVarious  (Actor, Director)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Force 10 From Navarone (RPKG/DVD)', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Widescreen, Letterboxed', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': 'FOXS101210DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 11, 2011', 'Actors': 'Various', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nFabulous movie.  Delighted to own it.\nForce 10 from Navarone\nThe Guns of Navarone (Collector's Edition)\nGregory Peck  (Actor),     David Niven  (Actor),     J. Lee Thompson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Academy Award®-winners Gregory Peck (1962, Best Actor, To Kill A Mockingbird), David Niven (1958, Best Actor, Separate Tables), and Anthony Quinn (Best Supporting Actor, 1952, Viva Zapata!; 1956, Lust For Life) star as a team of Allied military specialists recruited for a dangerous but imperative mission: to infiltrate a Nazi-occupied fortress and disable two long-range field guns so that 2,000 trapped British soldiers may be rescued. Faced with an unforgiving sea voyage, hazardous terrain, and the possibility of a traitor among them, the team must overcome the impossible without losing their own lives. Adapted by screenwriter Carl Foreman from Alistair MacLean’s best-selling novel, THE GUNS OF NAVARONE was nominated for seven Oscars®, including Best Picture, and won for Best Special Effects (1961).', 'Amazon.com', \"This rousing, explosive 1961 WWII adventure, based on Alistair MacLean's thrilling novel, turns the war thriller into a deadly caper film. Gregory Peck heads a star-studded cast charged with a near impossible mission: destroy a pair of German guns nestled in a protective cave on the strategic Mediterranean island of Navarone, from where they can control a vital sea passage. As world famous mountain climber turned British army Captain Mallory, Peck leads a guerrilla force composed of the humanistic explosives expert, Miller (David Niven), the ruthless Greek patriot with a grudge, Stavros (Anthony Quinn), veteran special forces soldier Brown (Stanley Baker), and the cool, quiet young marksman Pappadimos (James Darren). This disparate collection of classic types must overcome internal conflicts, enemy attacks, betrayal, and capture to complete their mission. Director J. Lee Thompson sets a driving pace for this exciting (if familiar) military operation, a succession of close calls, pitched battles, and last-minute escapes as our heroes infiltrate the garrisoned town with the help of resistance leader Maria (Irene Papas) and plot their entry into the heavily guarded mountain fort. Carl Foreman's screenplay embraces MacLean's role call of clichés and delivers them with style, creating one of the liveliest mixes of espionage, combat, and good old-fashioned military derring-do put on film. In 1978, the sequel\", 'Force 10 from Navarone', 'was released, but MacLean fans will prefer to check out the action-packed thriller', 'Where Eagles Dare', '. --Sean Axmaker', 'Stills from', 'The Guns of Navarone', '(click for larger image)', 'Beyond', 'The Guns of Navarone', 'at Amazon.com', 'More Military & War Films', 'More Gregory Peck Films', 'More Classic Films']\n{'Genre': 'Adventure, War, Award Winning', 'Format': \"Multiple Formats, AC-3, Closed-captioned, Collector's Edition, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Closed-captioned, Collector's Edition, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more\", 'Contributor': 'Highroad Prods., Inc.; Open Road Films, Ltd., Carl Foreman, Bryan Forbes, Gia Scala, Anthony Quinn, Stanley Baker, James Darren, Anthony Quayle, Michael Trubshawe, James Robertson Justice, Allan Cuthbertson, J. Lee Thompson, Irene Papas, John Robertson-Justice, David Niven, Richard Harris, Gregory PeckHighroad Prods., Inc.; Open Road Films, Ltd., Carl Foreman, Bryan Forbes, Gia Scala, Anthony Quinn, Stanley Baker, James Darren, Anthony Quayle, Michael Trubshawe, James Robertson Justice, Allan Cuthbertson, J. Lee Thompson, Irene Papas, John Robertson-Justice, David…  See more', 'Language': 'English (Dolby Digital 5.1), Portuguese, French, Unqualified, Spanish', 'Runtime': '2 hours and 37 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Item model number': '16323', 'Director': 'J. Lee Thompson', 'Media Format': \"Multiple Formats, AC-3, Closed-captioned, Collector's Edition, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen\", 'Run time': '2 hours and 37 minutes', 'Release date': 'May 8, 2007', 'Actors': 'Gregory Peck, David Niven, Anthony Quinn, Stanley Baker, Anthony Quayle', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, Portuguese, French, Spanish', 'Producers': 'Carl Foreman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nLove this movie.  Delighgted to own it and have watched it several times.\nGuns of Navarone\nVon Ryan's Express\nLuther Adler  (Actor),     James Brolin  (Actor),     Mark Robson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['No description available for this title.']\n{'Genre': 'Action & Adventure', 'Format': 'Color, DVD, Widescreen', 'Contributor': 'Al Wyatt, James Brolin, Raffaella Carr, Adolfo Celi, Ivan Triesault, John Leyton, Michael St. Clair, Luther Adler, Buzz Henry, Vito Scotti, John van Dreelen, Edward Mulhare, Benito Prezia, Sergio Fantoni, Wolfgang Preiss, John Day, Gino Gottarelli, Barry Ford, Trevor Howard, Don Grant, James B. Sikking, Bard Stevens, Michael Goodliffe, Brian Gaffikin, Brad Dexter, Mark Robson, Michael Romanoff, Eric Micklewood, Richard Bakalyan, Frank SinatraAl Wyatt, James Brolin, Raffaella Carr, Adolfo Celi, Ivan Triesault, John Leyton, Michael St. Clair, Luther Adler, Buzz Henry, Vito Scotti, John van Dreelen, Edward Mulhare, Benito Prezia, Sergio Fantoni, Wolfgang Preiss, John Day, Gino Gottarelli, Barry Ford, Trevor Howard, Don…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 56 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '3347913', 'Director': 'Mark Robson', 'Media Format': 'Color, DVD, Widescreen', 'Run time': '1 hour and 56 minutes', 'Actors': 'Luther Adler, James Brolin, Raffaella Carr, Adolfo Celi, John Day', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish', 'Studio': 'FOX', 'Number of discs': '1'}\nGreat movie.  Have watched several times.  Thrilled to own it.\nVon Ryan's Express\nIndiana Jones and the Kingdom of the Crystal Skull (Single-Disc Edition)\nHarrison Ford  (Actor),     Cate Blanchett  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', 'Steven Spielberg and George Lucas bring you the greatest adventurer of all time in “a nonstop thrill ride” (Richard Corliss, TIME) that’s packed with “sensational, awe-inspiring spectacles” (Roger Ebert, Chicago Sun-Times).', 'Indiana Jones and the Kingdom of the Crystal Skull', 'finds Indy (Harrison Ford) trying to outrace a brilliant and beautiful agent (Cate Blanchett) for the mystical, all-powerful Crystal Skull of Akator. Teaming up with a rebellious young biker (Shia LaBeouf) and his spirited original love Marion (Karen Allen), Indy takes you on a breathtaking action-packed adventure in the exciting tradition of the classic', 'Indiana Jones', 'movies!', 'Amazon.com', 'Nearly 20 years after riding his last Crusade, Harrison Ford makes a welcome return as archaeologist/relic hunter Indiana Jones in', 'Indiana Jones and the Kingdom of the Crystal Skul', \"l, an action-packed fourth installment that's, in a nutshell, less memorable than the first three but great nostalgia for fans of the series. Producer George Lucas and screenwriter David Koepp (\", 'War of the Worlds', \") set the film during the cold war, as the Soviets--replacing Nazis as Indy's villains of choice and led by a sword-wielding Cate Blanchett with black bob and sunglasses--are in pursuit of a crystal skull, which has mystical powers related to a city of gold. After escaping from them in a spectacular opening action sequence, Indy is coerced to head to Peru at the behest of a young greaser (Shia LaBeouf) whose friend--and Indy's colleague--Professor Oxley (John Hurt) has been captured for his knowledge of the skull's whereabouts. Whatever secrets the skull holds are tertiary; its reveal is the weakest part of the movie, as the CGI effects that inevitably accompany it feel jarring next to the boulder-rolling world of Indy audiences knew and loved. There's plenty of comedy, delightful stunts--ants play a deadly role here--and the return of\", 'Raiders', \"love interest Karen Allen as Marion Ravenwood, once shrill but now softened, giving her ex-love bemused glances and eye-rolls as he huffs his way to save the day. Which brings us to Ford: bullwhip still in hand, he's a little creakier, a lot grayer, but still twice the action hero of anyone in film today. With all the anticipation and hype leading up to the film's release, perhaps no reunion is sweeter than that of Ford with the role that fits him as snugly as that fedora hat.\", '--Ellen A. Kim', 'Stills from', 'Indiana Jones and the Kingdom of the Crystal Skull', '(Click for larger image)']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.57 x 5.11 x 7.75 inches; 2.72 Ounces', 'Item model number': 'PRT341864DVD', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '2 hours and 2 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Harrison Ford, Cate Blanchett, Shia LaBeouf, Karen Allen, Ray Winstone', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Kathleen Kennedy, George Lucas', 'Language': 'Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'PARAMOUNT', 'Writers': 'David Koepp, George Lucas, Jeff Nathanson, Philip Kaufman', 'Number of discs': '1'}\nGiven as gift because I liked it so much.  Recipient agrees with me.  Great movie.\nKingdom of the Crystal Skull\nIndiana Jones: The Complete Adventure Collection (Raiders of the Lost Ark / Temple of Doom / Last Crusade / Kingdom of the Crystal Skull)\nHarrison Ford  (Actor),     Karen Allen  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', 'Indiana Jones and the Raiders of the Lost Ark', 'Indiana Jones (Harrison Ford) is no ordinary archeologist. When we first see him, he is somewhere in the Peruvian jungle in 1936, running a booby-trapped gauntlet (complete with an over-sized rolling boulder) to fetch a solid-gold idol. He loses this artifact to his chief rival, a French archeologist named Belloq (Paul Freeman), who then prepares to kill our hero. In the first of many serial-like escapes, Indy eludes Belloq by hopping into a convenient plane. So, then: is Indiana Jones afraid of anything? Yes, snakes. The next time we see Jones, he\\'s a soft-spoken, bespectacled professor. He is then summoned from his ivy-covered environs by Marcus Brody (Denholm Elliott) to find the long-lost Ark of the Covenant. The Nazis, it seems, are already searching for the Ark, which the mystical-minded Hitler hopes to use to make his stormtroopers invincible. But to find the Ark, Indy must first secure a medallion kept under the protection of Indy\\'s old friend Abner Ravenwood, whose daughter, Marion (Karen Allen), evidently has a \"history\" with Jones. Whatever their personal differences, Indy and Marion become partners in one action-packed adventure after another, ranging from wandering the snake pits of the Well of Souls to surviving the pyrotechnic unearthing of the sacred Ark. A joint project of Hollywood prodigies George Lucas and Steven Spielberg, with a script co-written by Lawrence Kasdan and Philip Kaufman, among others, Raiders of the Lost Ark is not so much a movie as a 115-minute thrill ride. Costing 22 million dollars (nearly three times the original estimate),', 'Raiders of the Lost Ark', 'reaped 200 million dollars during its first run. It was followed by', 'Indiana Jones and the Temple of Doom', '(1985) and', 'Indiana Jones and the Last Crusade', '(1989), as well as a short-lived TV-series \"prequel.\"', 'Indiana Jones and the Temple of Doom', 'The second of the George Lucas/Steven Spielberg', 'Indiana Jones', 'epics is set a year or so before the events in', 'Raiders of the Lost Ark', \"(1984). After a brief brouhaha involving a precious vial and a wild ride down a raging Himalyan river, Indy (Harrison Ford) gets down to the problem at hand: retrieving a precious gem and several kidnapped young boys on behalf of a remote East Indian village. His companions this time around include a dimbulbed, easily frightened nightclub chanteuse (Kate Capshaw), and a feisty 12-year-old kid named Short Round (Quan Ke Huy). Throughout, the plot takes second place to the thrills, which include a harrowing rollercoaster ride in an abandoned mineshaft and Indy's rescue of the heroine from a ritual sacrifice. There are also a couple of cute references to\", 'Raiders of the Lost Ark', \", notably a funny variation of Indy's shooting of the Sherpa warrior.\", 'Indiana Jones and the Last Crusade', 'The third installment in the widely beloved Spielberg/Lucas', 'Indiana Jones', \"saga begins with an introduction to a younger Indy (played by the late River Phoenix), who, through a fast-paced prologue, gives the audience insight into the roots of his taste for adventure, fear of snakes, and dogged determination to take historical artifacts out of the hands of bad guys and into the museums in which they belong. A grown-up Indy (Harrison Ford) reveals himself shortly afterward in a familiar classroom scene, teaching archeology to a disproportionate number of starry-eyed female college students in 1938. Once again, however, Mr. Jones is drawn away from his day job after an art collector (Julian Glover) approaches him with a proposition to find the much sought after Holy Grail. Circumstances reveal that there was another avid archeologist in search of the famed cup — Indiana Jones' father, Dr. Henry Jones (Sean Connery) — who had recently disappeared during his efforts. The junior and senior members of the Jones family find themselves in a series of tough situations in locales ranging from Venice to the most treacherous spots in the Middle East. Complicating the situation further is the presence of Elsa (Alison Doody), a beautiful and intelligent woman with one fatal flaw: she's an undercover Nazi agent. The search for the grail is a dangerous quest, and its discovery may prove fatal to those who seek it for personal gain.\", 'Indiana Jones and the Last Crusade', 'earned a then record-breaking $50 million in its first week of release.', 'Indiana Jones and the Kingdom of the Crystal Skull', 'Steven Spielberg and George Lucas bring you the greatest adventurer of all time in “a nonstop thrill ride” (Richard Corliss, TIME) that’s packed with “sensational, awe-inspiring spectacles” (Roger Ebert, Chicago Sun-Times).', 'Indiana Jones and the Kingdom of the Crystal Skull', 'finds Indy (Harrison Ford) trying to outrace a brilliant and beautiful agent (Cate Blanchett) for the mystical, all-powerful Crystal Skull of Akator. Teaming up with a rebellious young biker (Shia LaBeouf) and his spirited original love Marion (Karen Allen), Indy takes you on a breathtaking action-packed adventure in the exciting tradition of the classic', 'Indiana Jones', 'movies!', 'Amazon.com', 'Indiana Jones and the Raiders of the Lost Ark', 'It’s said that the original is the greatest, and there can be no more vivid proof than', 'Raiders of the Lost Ark', ', the first and indisputably best of the initial three Indiana Jones adventures cooked up by the dream team of Steven Spielberg and George Lucas. Expectations were high for this 1981 collaboration between the two men, who essentially invented the box office blockbuster with ‘70s efforts like', 'Jaws', 'and', 'Star Wars', ', and Spielberg (who directed) and Lucas (who co-wrote the story and executive produced) didn’t disappoint. This wildly entertaining film has it all: non-stop action, exotic locations, grand spectacle, a hero for the ages, despicable villains, a beautiful love interest, humor, horror… not to mention lots of snakes. And along with all the bits that are so familiar by now--Indy (Harrison Ford) running from the giant boulder in a cave, using his pistol instead of his trusty whip to take out a scimitar-wielding bad guy, facing off with a hissing cobra, and on and on--there’s real resonance in a potent storyline that brings together a profound religious-archaeological icon (the Ark of the Covenant, nothing less than \"a radio for speaking to God\") and the 20th century’s most infamous criminals (the Nazis). Now', 'that’s', 'entertainment.', '--Sam Graham', 'Indiana Jones and the Temple of Doom', 'It’s hard to imagine that a film with worldwide box office receipts topping $300 million worldwide could be labeled a disappointment, but some moviegoers considered', 'Indiana Jones and the Temple of Doom', ', the second installment in Steven Spielberg and George Lucas’ 1980s adventure trilogy, to be just that. That doesn’t mean it’s a bad effort; any collaboration between these two cinema giants (Spielberg directed, while Lucas provided the story and was executive producer) is bound to have more than its share of terrific moments, and', 'Temple of Doom', 'is no exception. But in exchanging the very real threat of Nazi Germany for the cartoonish Thuggee cult, it loses some of the heft of its predecessor (', 'Raiders of the Lost Ark', '); on the other hand, it’s also the darkest and most disturbing of the three films, what with multiple scenes of children enslaved, a heart pulled out of a man’s chest, and the immolation of a sacrificial victim, which makes it less fun than either', 'Raiders', 'or', 'The Last Crusade', ', notwithstanding a couple of riotous chase scenes and impressively grand sets. Many fans were also less than thrilled with the new love interest, a spoiled, querulous nightclub singer portrayed by Kate Capshaw, but a cute kid sidekick (\"Short Round,\" played by Ke Huy Quan) and, of course, the ever-reliable Harrison Ford as the cynical-but-swashbuckling hero more than make up for that character’s shortcomings.', 'A six-minute introduction by Lucas and Spielberg is the prime special feature, with both men candidly addressing the film’s good and bad points (Lucas points out that the second', 'Star Wars', 'film,', 'The Empire Strikes Back', ', was also the darkest of the original three; as for Spielberg, the fact that the leading lady would soon become his wife was the best part of the whole trip). Also good are \"The Creepy Crawlies,\" a mini-doc about the thousands of snakes, bugs, rats and other scary critters that populate the trilogy, and \"Travels with Indy,\" a look at some of the films’ cool locations. Storyboards and a photo gallery are included as well.', '--Sam Graham', 'Indiana Jones and the Last Crusade', 'Not as good as the first one, but better than the second. That’s been the consensus opinion regarding', 'Indiana Jones and the Last Crusade', ', the final installment in Steven Spielberg and George Lucas’ original adventure trilogy, throughout the nearly two decades since its 1989 theatrical release. It’s a fair assessment. After the relatively dark and disturbing', 'Temple of Doom', '(1984),', 'The Last Crusade', '(1989) recalls the sheer fun of', 'Raiders of the Lost Ark', '(1981). With its variety of colorful locations, multiple chase scenes (the opening sequence on a circus train, with River Phoenix as the young Indy, is one of the best of the series, as is the boat chase through the canals of Venice), and cloak-and-dagger vibe, it’s the closest in tone to a James Bond outing, which director Spielberg has noted was the inspiration for the trilogy in the first place; what’s more, it harkens back to', 'Raiders', \"in its choice of villains (i.e., the Nazis--Indy even comes face to face with Hitler at a rally in Berlin) and its quest for an antiquity of incalculable value and significance (the Holy Grail, the chalice said to have been the receptacle of Christ's blood as he hung on the cross). Add to that the presence of Sean Connery, playing Indy’s father and having a field day opposite Harrison Ford, and you’ve got a most welcome return to form.\", 'Special features include a six-minute introduction by Spielberg and Lucas, who discuss the grail as a metaphor for bringing Indy and his estranged father together and agree that', 'Crusade', 'is the funniest of the three films; \"Indy’s Women,\" an American Film Institute tribute with leading ladies Karen Allen, Kate Capshaw, and Alison Doody each discussing her character (Capshaw candidly describes', 'Temple of Doom', '’s Willie Scott as \"whiny, petulant, and annoying\"); \"Indy’s Friends and Enemies,\" a look at the films’ various villains and sidekicks; plus storyboards and photo galleries.', '--Sam Graham', 'Indiana Jones and the Kingdom of the Crystal Skull', 'Nearly 20 years after riding his last Crusade, Harrison Ford makes a welcome return as archaeologist/relic hunter Indiana Jones in', 'Indiana Jones and the Kingdom of the Crystal Skul', \"l, an action-packed fourth installment that's, in a nutshell, less memorable than the first three but great nostalgia for fans of the series. Producer George Lucas and screenwriter David Koepp (\", 'War of the Worlds', \") set the film during the cold war, as the Soviets--replacing Nazis as Indy's villains of choice and led by a sword-wielding Cate Blanchett with black bob and sunglasses--are in pursuit of a crystal skull, which has mystical powers related to a city of gold. After escaping from them in a spectacular opening action sequence, Indy is coerced to head to Peru at the behest of a young greaser (Shia LaBeouf) whose friend--and Indy's colleague--Professor Oxley (John Hurt) has been captured for his knowledge of the skull's whereabouts. Whatever secrets the skull holds are tertiary; its reveal is the weakest part of the movie, as the CGI effects that inevitably accompany it feel jarring next to the boulder-rolling world of Indy audiences knew and loved. There's plenty of comedy, delightful stunts--ants play a deadly role here--and the return of\", 'Raiders', \"love interest Karen Allen as Marion Ravenwood, once shrill but now softened, giving her ex-love bemused glances and eye-rolls as he huffs his way to save the day. Which brings us to Ford: bullwhip still in hand, he's a little creakier, a lot grayer, but still twice the action hero of anyone in film today. With all the anticipation and hype leading up to the film's release, perhaps no reunion is sweeter than that of Ford with the role that fits him as snugly as that fedora hat.\", '--Ellen A. Kim']\n{'Genre': 'Action & Adventure', 'Format': 'Color, Multiple Formats, Widescreen, Closed-captioned, NTSC', 'Contributor': 'Harrison Ford, Steven Spielberg, George Lucas, Karen Allen', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '8 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '1.3 x 5.4 x 7.7 inches; 0.01 Ounces', 'Item model number': '13966', 'Director': 'Steven Spielberg', 'Media Format': 'Color, Multiple Formats, Widescreen, Closed-captioned, NTSC', 'Run time': '8 hours and 1 minute', 'Release date': 'October 14, 2008', 'Actors': 'Harrison Ford, Karen Allen', 'Dubbed': 'English, Spanish, French', 'Subtitles': 'English, French, Spanish', 'Producers': 'George Lucas', 'Studio': 'Paramount', 'Writers': 'George Lucas', 'Number of discs': '5'}\nGreat set.  Had VHS tapes for two of them and got rid of.  Love the movies.\nIndiana Jones DVD\nHarry Potter and the Deathly Hallows, Part 2\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Characters & Series, Harry Potter, Harry Potter and the Deathly Hallows\n['Product Description', 'In the epic finale, the battle between the good and evil forces of the wizarding world escalates into an all-out war. The stakes have never been higher and no one is safe. But it is Harry who may be called upon to make the ultimate sacrifice as he draws closer to the climactic showdown with Lord Voldemort. It all ends here.', 'Amazon.com', 'The Deathly Hallows: Part 2', \"is the film all Harry Potter fans have waited 10 years to see, and the good news is that it's worth the hype--visually stunning, action packed, faithful to the book, and mature not just in its themes and emotion but in the acting by its cast, some of whom had spent half their lives making Harry Potter movies. Part 2 cuts right to the chase: Voldemort (Ralph Fiennes) has stolen the Elder Wand, one of the three objects required to give someone power over death (a.k.a. the Deathly Hallows), with the intent to hunt and kill Harry. Meanwhile, Harry's quest to destroy the rest of the Horcruxes (each containing a bit of Voldemort's soul) leads him first to a thrilling (and hilarious--love that Polyjuice Potion!) trip to Gringotts Bank, then back to Hogwarts, where a spectacular battle pitting the young students and professors (a showcase of the British thesps who have stolen every scene of the series: Maggie Smith's McGonagall, Jim Broadbent's Slughorn, David Thewlis's Lupin) against a dark army of Dementors, ogres, and Bellatrix Lestrange (Helena Bonham Carter, with far less crazy eyes to make this round). As predicted all throughout the saga, Harry also has his final showdown with Voldemort--neither can live while the other survives--though the physics of that predicament might need a set of crib notes to explain. But while each installment has become progressively grimmer, this finale is the most balanced between light and dark (the dark is\", 'quite', \"dark--several familiar characters die, with one significant death particularly grisly); the humor is sprinkled in at the most welcome times, thanks to the deft adaptation by Steve Kloves (who scribed all but one of the films from J.K. Rowling's books) and direction by four-time Potter director David Yates. The climactic kiss between Ron (Rupert Grint) and Hermione (Emma Watson), capping off a decade of romantic tension, is perfectly tuned to their idiosyncratic relationship, and Daniel Radcliffe has, over the last decade, certainly proven he was the right kid for the job all along. As Prof. Snape, the most perfect of casting choices in the best-cast franchise of all time, Alan Rickman breaks your heart. Only the epilogue (and the lack of chemistry between Harry and love Ginny Weasley, barely present here) stand a little shaky, but no matter: the most lucrative franchise in movie history to date has just reached its conclusion, and it's done so without losing its soul. --\", 'Ellen A. Kim']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 0.32 Ounces', 'Item model number': '1000156545', 'Director': 'David Yates', 'Media Format': 'Surround Sound, Multiple Formats, Dolby, Widescreen, NTSC', 'Run time': '145 minutes', 'Release date': 'November 11, 2011', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Helena Bonham Carter, Robbie Coltrane', 'Dubbed': 'Spanish', 'Subtitles': 'French, English, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nGreat series.\nHarry Potter\nTurner & Hooch\nTom Hanks  (Actor),     Mare Winningham  (Actor),     Roger Spottiswoode  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Academy Award(R)-winner Tom Hanks (Best Actor, 1995, FORREST GUMP) stars as Scott Turner, a compulsively neat detective whose tidy world goes to the dogs when he's forced to team up with the only witness to a crime -- a drooling slob of a junkyard dog named Hooch. Not exactly man's best friend, Hooch turns Turner's life upside down, wrecking Turner's home, career, and budding romance! It's a hilarious, nonstop test of wills between this mismatched duo, leading to the most unlikely friendship you've ever seen! TURNER & HOOCH thrilled audiences nationwide with its offbeat blend of humor and suspense -- this fast-paced box office megahit is loads of fun!\"]\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Subtitled, Color, Widescreen, NTSC', 'Contributor': 'Craig T. Nelson, Mary McCusker, Reginald VelJohnson, Clyde Kusatsu, Scott Paulin, Joel Bailey, Dennis Shryack, Michael Blodgett, Jim Cash, David Knell, J.C. Quinn, Tom Hanks, Mare Winningham, Ebbe Roe Smith, Elaine Renee Bush, Roger Spottiswoode, Kevin Scannell, Ernie Lively, Jack Epps Jr., Daniel Petrie Jr., John McIntireCraig T. Nelson, Mary McCusker, Reginald VelJohnson, Clyde Kusatsu, Scott Paulin, Joel Bailey, Dennis Shryack, Michael Blodgett, Jim Cash, David Knell, J.C. Quinn, Tom Hanks, Mare Winningham, Ebbe Roe Smith, Elaine Renee Bush, Roger Spottiswoode, Kevin Scannell, Ern…  See more', 'Language': 'French, Unqualified, English (Dolby Surround)', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MFR717951002747#VG', 'Director': 'Roger Spottiswoode', 'Media Format': 'Multiple Formats, Subtitled, Color, Widescreen, NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'April 2, 2002', 'Actors': 'Tom Hanks, Mare Winningham, Craig T. Nelson, Reginald VelJohnson, Scott Paulin', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Michael Blodgett, Dennis Shryack, Daniel Petrie Jr., Jim Cash, Jack Epps Jr.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie.\nFive Stars\nQuartet\nBilly Connolly  (Actor),     Maggie Smith  (Actor),     Dustin Hoffman  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', \"Beecham House is abuzz. The rumor circling the halls is that the home for retired musicians is soon to play host to a new resident. Word is, it's a star. For Reginald Paget (Tom Courtenay), Wilfred Bond (Billy Connolly) and Cecily Robson (Pauline Collins) this sort of talk is par for the course at the gossipy home. But they're in for a special shock when the new arrival turns out to be none other than their former singing partner, Jean Horton (Maggie Smith). Her subsequent career as a star soloist, and the ego that accompanied it, split up their long friendship and ended her marriage to Reggie, who takes the news of her arrival particularly hard. Can the passage of time heal old wounds? And will the famous quartet be able to patch up their differences in time for Beecham House's gala concert?\", 'Amazon.com', \"Oscar-winning actor Dustin Hoffman has never been one to zig when he can zag. Not only did he wait until he was in his mid-70s to direct his first feature film, but his crowd-pleasing adaptation of Ronald Harwood's 1999 play is a thoroughly British affair. Set at one of England's most scenic estates, the fictional Beecham House for Retired Musicians,\", 'Quartet', \"centers on four opera singers. Cecily (Pauline Collins), Wilfred (Billy Connolly), and Reginald (Tom Courtenay, who appeared in Harwood's\", 'The Dresser', \") are busy preparing for the annual Verdi Gala when word spreads about a famous new resident. After Reggie catches sight of the elegant figure, his excitement about the benefit gives way to sorrow: it's his ex-wife, Jean (\", 'Downton Abbey', \"'s Maggie Smith). If the amusingly acid-tongued Jean appears to have moved on--she's married twice since--Reggie hasn't, and still blames her for the failure of their brief marriage. Under the directorship of the supremely self-satisfied Cedric (Michael Gambon), the entire facility continues to rehearse for the concert, except Jean, who says she's retired from singing, though her former partners long to perform their acclaimed version of Verdi's\", 'Rigoletto', \". As they concentrate on persuading her to reconsider, the ice between Reggie and Jean starts to thaw just as Cissy's memory starts to fade, but priorities shift as old friends become reacquainted. If\", 'Quartet', \"doesn't offer many significant surprises, Hoffman skillfully honors the humor, the romance, and the wall-to-wall music--most played by veteran performers--of Harwood's warm-hearted script.\", '--Kathleen C. Fennessy']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Pauline Collins, Jamie Laurenson, Dario Suter, Dickon Stainer, Finola Dwyer, Tom Courtenay, Maggie Smith, Marc Schmidheiny, Billy Connolly, Dustin Hoffman, Stewart Mackinnon, Xavier Marchand, Michael GambonPauline Collins, Jamie Laurenson, Dario Suter, Dickon Stainer, Finola Dwyer, Tom Courtenay, Maggie Smith, Marc Schmidheiny, Billy Connolly, Dustin Hoffman, Stewart Mackinnon, Xavier Marchand, Michael Gambon   See more', 'Language': 'English', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Audio Description': 'English', 'Item model number': '26919975', 'Director': 'Dustin Hoffman', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Release date': 'June 18, 2013', 'Actors': 'Billy Connolly, Maggie Smith, Michael Gambon, Pauline Collins, Tom Courtenay', 'Dubbed': 'French', 'Producers': 'Marc Schmidheiny, Dickon Stainer, Dustin Hoffman, Finola Dwyer, Xavier Marchand', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFantastic movie.  Great music.  Thoroughly enjoyed and have watched several times.\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to demonstrate a strong affinity for classic action-adventure and comedic films that blend humor with engaging narratives. Their recent interaction with a heartfelt story about retired musicians highlights their ongoing appreciation for films that evoke nostalgia and feature rich character dynamics.\n\n- **Quality Appreciation:** The user maintains a dedication to high-quality cinema, as evidenced by their five-star rating of a film that encapsulates strong performances and emotionally resonant themes, reinforcing their preference for impactful storytelling and celebrated talent.\n\n- **Viewing Experience:** The user's tastes reflect a consistent enjoyment of multifaceted narratives that balance humor and drama, showcasing a preference for lighter cinematic explorations alongside cherished classics. Their latest interaction reflects an appreciation for films that celebrate friendship, personal growth, and the healing power of music.\n\n- **Language and Accessibility:** The user remains committed to English-language films while appreciating subtitles for enhanced understanding, enriching their viewing experience through diverse narratives.\n\n- **Overall Ratings:** With a trend of high ratings, the user's profile indicates a commitment to memorable cinematic experiences, emphasizing their appreciation for well-crafted storytelling that resonates on both emotional and entertaining levels. Their viewing choices continue to reflect a diverse range of genres while maintaining a strong focus on quality and depth.",
  "metrics": {
    "rouge1_f": 0.03229813664596274,
    "rouge2_f": 0.0032306163021868783,
    "rougeL_f": 0.01888198757763975,
    "meteor": 0.00872060700721191,
    "bleu1": 1.1730097243473536e-18,
    "bleu2": 3.670933115478684e-19,
    "bleu3": 1.0900197379265242e-19,
    "bleu4": 3.34337394010934e-20,
    "bertscore_precision": 0.3409503698348999,
    "bertscore_recall": 0.5231894254684448,
    "bertscore_f1": 0.4128536283969879
  }
}