{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Force 10 From Navarone\nReview Date: 2015/02/09\nStore: Various  (Actor, Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Force 10 From Navarone (RPKG/DVD)', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Widescreen, Letterboxed', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': 'FOXS101210DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 11, 2011', 'Actors': 'Various', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: Fabulous movie.  Delighted to own it.\nReview Title: Force 10 from Navarone\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Frankenheimer'], 'Producers': ['Edward Lewis'], 'Starring': ['Burt Lancaster', 'Kirk Douglas', 'Fredric March'], 'Studio': ['WARNER HOME VIDEO']}\nSaw it years ago and with this viewing found it even more exciting and disturbing.  Very well acted and produced.\nThought provoking.\n{'Audio languages': ['English'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]'], 'Directors': ['Brian G. Hutton'], 'Producers': ['Elliott Kastner'], 'Starring': ['Richard Burton', 'Clint Eastwood', 'Mary Ure'], 'Studio': ['Warner Bros.']}\nVery exciting movie, very well done.  A movie I have seen before and will watch many more times.  Scenery spectacular.\nExcellent movie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]', 'Español [CC]'], 'Directors': ['Ben Bolt', 'Paul Seed'], 'Producers': ['Mark Crowdy'], 'Starring': ['Martin Clunes', 'Caroline Catz'], 'Studio': ['Acorn Media']}\nWe find the Doc Martin series very interesting and more importantly very intertaining.  We have to be careful about when we watch because we cannot quit until we have seen all of the episodes in the season.  End up staying up very late sometimes because we cannot bear not to know what comes next!\nReview of Season 5 Doc Martin\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]', 'Español [CC]'], 'Directors': ['Ben Bolt', 'Minkie Spiro'], 'Producers': ['Mark Crowdy'], 'Starring': ['Martin Clunes', 'Caroline Catz', 'Stephanie Cole']}\nLove it.  Never miss it and watch episodes repeatedly.  Great character development, and scenery is spectacular.  Stories in episodes so interesting and entertertaining.\nDoc Martin Season 4\n{'Content advisory': ['Violence', 'frightening scenes', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Fisher', 'Constantine Makris', 'Tawnia McKiernan', 'Jack Kenny', 'Stephen Surjik', 'Jace Alexander', 'Vincent Misiano', 'Michael W. Watkins', 'Millicent Shelton', 'Michael McMurray'], 'Starring': ['Eddie McClintock', 'Joanne Kelly', 'Saul Rubinek']}\nExcellent quality streaming.  Very enjoyable science fiction and entertaining stories.  Enjoyed very much and intend to watch other seasons as well as rewatching most episodes.\nWarehouse 13 Season 4\nTHAT MIDNIGHT KISS/TOAST OF NEW ORLEANS\nKathryn Grayson  (Actor),     Mario Lanza  (Actor),     Norman Taurog  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['That Midnight Kiss/Toast of New Orleans (DVD) (Multi-Title)', ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.8 Ounces', 'Item model number': 'WHV79530DVD', 'Director': 'Norman Taurog', 'Media Format': 'Closed-captioned, Full Screen, Color, Subtitled', 'Run time': '3 hours and 15 minutes', 'Release date': 'July 24, 2007', 'Actors': 'Kathryn Grayson, Mario Lanza, David Niven, Jose Iturbi, Ethel Barrymore', 'Subtitles': 'French, English', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nSaw these movies on TV and had to have them.  Very inspirational and enjoyable.\nFive Stars\nBest of Warner Bros. 50 Cartoon Collection: Looney Tunes\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Best of Warner Bros. 50 Cartoon Collection - Looney Tunes (DVD)', 'It’s always “wabbit” season now that the best Looney tunes Cartoons from the Warner Bros. vault are available in this wild two-disc collection! Reunite with Bugs Bunny, Elmer Fudd, Porky Pig, Tweety Bird, Sylvester, Daffy Duck and all the Looney tunes gang in an animated assortment of hits that have tickled the funny bones of cartoon lovers for generations. There’s something for everyone in this must-own collection of 50 Looney tunes classics that helped contribute to 90years of Warner Bros. cartoon magic. It’s a timeless anthology for fans of all ages that will have you laughing long before “Tha-That-That’s All, Folds!”', ']]>']\n{'Genre': 'Classics, Animation', 'Format': 'Multiple Formats, NTSC, Color, Animated, Full Screen', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '5 hours and 55 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 5.12 Ounces', 'Item model number': '358377', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Color, Animated, Full Screen', 'Run time': '5 hours and 55 minutes', 'Release date': 'June 25, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nGreatly appreciated Christmas gift.\nCartoon collection\nLooney Tunes:Spotlight Coll. Premiere Ed\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Looney Tunes: Spotlight Collection, The Premiere Edition (Dbl DVD)', \"They're the clown princes of animation. They're the international ambassadors of cartoon comedy. They're the fabulously funny friends you grew up with! And now, 28 of the very best animated shorts starring the very wackiest Warner Bros. cartoon characters have been rounded up on DVD for the first time ever in The Looney Tunes Premiere Collection! Just barely contained in two special edition discs, each specially selected short has been brilliantly restored and re-mastered to its original anvil-dropping, laughter-inducing glory! Featuring some of the very earliest, ground-breaking on-screen appearances of many all-time Looney Tunes favorites, it's an unprecedented animation celebration for cartoon-lovers eager to re-live the heady, hilarious, golden age of Warner Bros. animation! Sparkling with one unforgettable, landmark cartoon classic after another, there's Bugs Bunny's monstrously merry encounter with the tennis-shoe clad creature of Hair-Raising Hare. Wile E. Coyote and Roadrunner racing to cartoon immortality in Fast and Furryous. Oscar-winning animated gems, scenery-chewing Tazmanian Devils and much more! Plus, a dazzling array of totally Looney DVD bonus features!\", ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.75 x 0.5 inches; 6.4 Ounces', 'Item model number': '2232461', 'Director': 'Various', 'Media Format': 'Color, Closed-captioned, Animated, Multiple Formats, Subtitled, NTSC', 'Run time': '3 hours and 27 minutes', 'Release date': 'September 14, 2004', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nMuch loved Christmas gift by child and parents.\nCartoon collection\nHome Alone Collection\nCulkin, Macaulay  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', 'Home Alone', ':', \"Eight-year-old Kevin McCallister (Macaulay Culkin) has become the man of the house, overnight! Accidentally left behind when his family rushes off on a Christmas vacation, Kevin gets busy decorating the house for the holidays. But he's not decking the halls with tinsel and holly. Two bumbling burglars are trying to break in, and Kevin's rigging a bewildering battery of booby traps to welcome them!\", 'Home Alone 2', ':', \"Kevin McCallister (Macaulay Culkin) is back! But this time he's in New York City with enough cash and credit cards to turn the Big Apple into his own playground! But Kevin won't be alone for long. The notorious Wet Bandits, Harry and Marv (Joe Pesci and Daniel Stern), still smarting from their last encounter with Kevin, are bound for New York too, plotting a huge holiday heist. Kevin's ready to welcome them with a battery of booby traps the bumbling bandits will never forget!\", 'Home Alone 3:', \"Here's a perfect movie for kids, who never seem to tire of John Hughes's sure-fire slapstick formula. Working yet another variation on his mammoth 1990 hit, writer-producer Hughes (regarded by many as Hollywood's antichrist) strands a youngster in his own home with the chicken pox in this 1997 retelling. While his parents go to work, he sees a team of burglars invading the neighborhood houses; in fact, they're spies, looking for a toy containing a stolen microchip. The inevitability of the finale--one kid holding off four professionals with toys and garden tools--will do nothing to lessen the amusement of youngsters, who love to see the bad guys get creamed. Adults may pause at the sadistic nature of some of Hughes's pranks, but kids will eat up the image of one of their own outwitting all the adults.\", '--Marshall Fine', 'Home Alone 4:', \"It's tough being nine. Tougher still is spending Christmas with dad (Jason Beghe) at his new girlfriend Natalie's (Joanna Going) mansion even though it's loaded with all the techno-gadgets any kid could hope for! But this Christmas, Kevin (Michael Weinberg) is really in hot water again, and so are Marv (French Stewart) and his sidekick (Missi Pyle), who are trying to rob Natalie's house!\", \"With funnier and more high-tech, crime-stopping wizardry at his disposal than ever, Kevin just might finally put these crooks on ice forever - and keep his parents together while he's at it - in this uplifting, hilarious comedy the whole family is sure to love!\", 'Amazon.com', 'Review for', 'Home Alone:', 'Now and forever a favorite among kids, this 1990 comedy written by John Hughes (', 'The Breakfast Club', ') and directed by Chris Columbus (', 'Mrs. Doubtfire', \") ushered Macaulay Culkin onto the screen as a troubled 8-year-old who doesn't comfortably mesh with his large family. He's forced to grow a little after being accidentally left behind when his folks and siblings fly off to Paris. A good-looking boy, Culkin lights up the screen during several funny sequences, the most famous of which finds him screaming for joy when he realizes he's unsupervised in his own house. A bit wooden with dialogue, the then-little star's voice could grate on the nerves (especially in long, wise-child passages of pure bromide), but he unquestionably carries the film. Billie Bird and John Candy show up as two of the interesting strangers Culkin's character meets. Joe Pesci and Daniel Stern are entertainingly cartoonish as thieves, but the ensuing violence once the little hero decides to keep them out of his house is over-the-top.\", '--Tom Keogh', 'Review for', 'Home Alone 2: Lost in New York:', 'This somewhat unpleasant 1992 sequel to the blockbuster', 'Home Alone', \"revisits the first film's gimmick by stranding Macaulay Culkin's character in New York City while his family ends up somewhere else. Again, the little guy meets up with colorful people on the margins of society (including a pigeon woman played by Brenda Fricker) and again he gets into a prop-heavy battle with Joe Pesci and Daniel Stern. The latter sequence is even worse than the first film in terms of violence inflicted on the two villains (director Chris Columbus, who also made the first film, can't seem to emphasize the slapstick over the graphic effects of the fight). The best running joke finds a concierge (Tim Curry) at the swank hotel where Culkin is staying trying and failing to prove that the boy is on his own.\", '--Tom Keogh', 'Review for', 'Home Alone 3', ':', \"Here's a perfect movie for kids, who never seem to tire of John Hughes's sure-fire slapstick formula. Working yet another variation on his mammoth 1990 hit, writer-producer Hughes (regarded by many as Hollywood's antichrist) strands a youngster in his own home with the chicken pox in this 1997 retelling. While his parents go to work, he sees a team of burglars invading the neighborhood houses; in fact, they're spies, looking for a toy containing a stolen microchip. The inevitability of the finale--one kid holding off four professionals with toys and garden tools--will do nothing to lessen the amusement of youngsters, who love to see the bad guys get creamed. Adults may pause at the sadistic nature of some of Hughes's pranks, but kids will eat up the image of one of their own outwitting all the adults.\", '--Marshall Fine']\n{'Genre': 'Kids & Family, Mystery & Thrillers, Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Culkin, Macaulay', 'Language': 'Unqualified', 'Runtime': '6 hours and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.73 x 5.45 x 7.61 inches; 7.52 Ounces', 'Item model number': 'FOXS2289230DVD', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '6 hours and 54 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Culkin, Macaulay', 'Subtitles': 'English', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nThese movies make me laugh out loud.  I had to have them.\nHome Alone\nThe Odessa File\nJon Voight  (Actor),     Maximilian Schell  (Actor),     Ronald Neame  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['The year is 1963. The place: Hamburg, Germany. An elderly Jewish man commits suicide, leaving a diary which falls into the hands of a freelance newspaperman, Peter Miller (Jon Voight). The diary documents the unspeakable crimes of cruelty, torture and mass murder perpetrated by SS Captain Eduard Roschmann (Maximilian Schell), commandant of the notorious wartime deathcamp at Riga, Latvia. Miller launches a personal manhunt to track down Roschmann, an investigation that leads him into the very heart of Odessa, a powerful secret organization formed by the SS to protect and re-establish its fugitive members throughout the world. When Miller finds Roschmann, he learns that the former Nazi is now the leader of a weaponry complex of international, strategic consequence.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Full Screen, NTSC, Dolby, Color, Subtitled', 'Contributor': 'Jon Voight, Ronald Neame, Maximilian Schell', 'Language': 'English', 'Runtime': '2 hours and 8 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.43 Ounces', 'Item model number': '6885', 'Director': 'Ronald Neame', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Dolby, Color, Subtitled', 'Run time': '2 hours and 8 minutes', 'Release date': 'December 7, 2010', 'Actors': 'Jon Voight, Maximilian Schell', 'Studio': 'Image Entertainment', 'Number of discs': '1'}\nWonderful movie.  Love watching it over and over.\nThe Odessa File\nForce 10 From Navarone\nVarious  (Actor, Director)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Force 10 From Navarone (RPKG/DVD)', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Widescreen, Letterboxed', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': 'FOXS101210DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 11, 2011', 'Actors': 'Various', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nFabulous movie.  Delighted to own it.\nForce 10 from Navarone",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to appreciate engaging narratives that balance humor with emotional depth. Their recent purchase reflects a sustained interest in action and adventure films, alongside their established affinity for lighthearted, family-oriented content. This indicates their versatility in exploring diverse storytelling that encapsulates both entertainment and meaningful themes.\n\n- **Quality Appreciation:** The user’s high rating for their latest acquisition underscores their consistent pursuit of high-quality productions. They value strong performances and thematic depth, reinforcing their sophisticated taste in cinema.\n\n- **Viewing Experience:** The balance between revisiting beloved classics and exploring new genres, such as action-adventure, remains strong. Their recent interaction suggests a deeper engagement with content that, while entertaining, also enriches their viewing experience through character development and thematic richness.\n\n- **Language and Accessibility:** The user’s preference for English-language films, complemented by a need for subtitles, continues to ensure accessibility and enjoyment in their viewing choices.\n\n- **Overall Ratings:** The user’s inclination towards high ratings showcases their ongoing engagement with content that merges nostalgia and humor with an increasing interest in complex themes, highlighting a diverse and evolving palate in their entertainment selections.",
  "metrics": {
    "rouge1_f": 0.0694921725849561,
    "rouge2_f": 0.0038211692777990066,
    "rougeL_f": 0.035891561664757536,
    "meteor": 0.020944683308883116,
    "bleu1": 5.243521761142149e-07,
    "bleu2": 1.2249046750947945e-07,
    "bleu3": 2.0505319828781405e-08,
    "bleu4": 8.398397034603256e-09,
    "bertscore_precision": 0.3342413306236267,
    "bertscore_recall": 0.48573505878448486,
    "bertscore_f1": 0.3959936499595642
  }
}