{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: TRESemmé Botanique Shampoo and Conditioner Four Pack, Nourish & Replenish, 88 oz\nReview Date: 2018/12/08\nStore: TRESemmé\nAverage Rating: 4.6\nProduct Details: {'Material Type Free': 'paraben free,dye free', 'Item Form': 'Liquid', 'Brand': 'TRESemmé', 'Scent': 'prafum', 'Special Ingredients': 'Coconut-oil,Aloe-vera', 'Product Dimensions': '14.75 x 9.88 x 3.56 inches; 6.8 Pounds', 'UPC': '022400002248'}\nReview Text: This 4-pack of shampoo and conditioner should keep you supplied for quite awhile, but that doesn't matter if you find you don't like it.  I like it quite a bit.  The shampoo cleanses well and the conditioner (surprise!) conditions.  However it doesn't make my hair feel too stripped nor does it feel too greasy/oily after using both shampoo and conditioner, and my hair doesn't feel too dirty too fast, as with some conditioners.  The shampoo is clear and the conditioner is creamy.  This is a readily available brand, not a fancy salon brand, but it works well for me, and has no parabens, dyes, or silicones.\nReview Title: Works Well, Lovely Tropical Scent\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Panasonic EW-DL82 Sonic Vibration Rechargeable Electric Toothbrush, White\nPanasonic\n['Sonic vibration rechargeable toothbrush. Clinically proven to reduce stains.']\n{'Brand': 'Panasonic', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Item Firmness Description': 'Soft', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.2 x 1 x 8.3 inches; 3.2 Ounces', 'Item model number': 'EW-DL82-W', 'Batteries': '1 Lithium Ion batteries required.', 'UPC': '885170124196', 'Manufacturer': 'Panasonic - Beauty'}\nUpdate:  I am lowering my rating to 3 stars because of the difficulty and expense of finding and buying replacement heads.  I couldn't find any for quite some time.  I've since found some online, not on Amazon, but from a low of $19.99 (but out of stock) to more than $25 for a single head.  The difficulty and cost makes buying this brush too impractical, which is too bad because I like the unit.<br />~~~~~~~<br /><br />The toothbrush I reviewed is the similar model, EW-DE92.  I was taken to this page when I tried to post my review.<br /><br />First, and most important, I love the way this brush cleans my teeth.  Using the \"white\" mode, they feel nice and fresh and thoroughly cleansed.  According to the owner's guide, some people can feel that slight electric charge, the ionic feature, when using the brush, and I am one of those people.  However, it is extremely mild and not the least unpleasant.<br /><br />I like that there are various settings on this brush although I use \"white\" most often.  The gum brush may be useful but I don't use it as routinely as suggested because it just doesn't feel like it is doing much for me.  I do like to use the little pointy rubber head but again, not as often as the regular head.  I do like the tongue cleaner on this brush.<br /><br />Which brings me to one of the drawbacks.  I cannot seem to find replacement heads for this product.  I looked on Amazon and I went to the Panasonic site with no success.  I went to the same model toothbrush on both sites and there are no links to the replacement heads.  I wanted to order some in advance so I would have then when needed.  Perhaps this is a new model and replacement heads will become widely available, but this toothbrush is expensive to begin with, and much more so if heads cannot be found.<br /><br />Compared to my basic but rechargeable Philips Sonicare toothbrush, this one is nicer to hold because the handle is much slimmer.  The Sonicare seems to have a more robust brushing action, but this one seems to get my teeth just as clean, perhaps marginally cleaner.<br /><br />The charger seems to work well.  I took the brush on a 10-day trip and chanced not taking the charger with me, and I had no loss of power during that trip.  It seems to hold its charge quite well.<br /><br />But there is a downside to the charger too.  According to the manual again, the lithium battery lasts about 3 years.  When the battery is dead, I am supposed to \"Contact an authorized service center for repair.\"  Now that is just not practical and probably not cheap, and this toothbrush costs too much to not be able to replace the battery without service costs.<br /><br />One more drawback is the storage of the various heads.  This set comes with a little stand to store the heads, but none of the heads have a protective cover and the storage stand does not have a cover, so the heads are sitting out in the bathroom air, something I don't like at all.  The travel case holds the handle and one head but not the extra heads.  My cheaper Sonicare has a plastic cap that comes with each head to protect it.<br /><br />While I think this is a very good toothbrush, the drawbacks need to be fixed before I would consider getting another one.  At current prices, this one costs more than twice my Sonicare, and while this one has more bells and whistles, I don't believe the price difference is justified.\nGreat brush, some drawbacks\nBloom Krans Vulva Harmony Moisturizer: Organic Vulva Cream for Intimate Feminine Care & Health including Dryness & Itch Relief (Estrogen Free, Dye Free, Fragrance Free, Steroid Free) - 2.25 Oz (Aloe Free - 1 Pack)\nBloom Krans\n{'Brand': 'Bloom Krans', 'Item Form': 'Cream', 'Unit Count': '2.2 Ounce', 'Number of Items': '1', 'Use for': 'Whole Body'}\nWhat this is not:  it is not a hormone replacement therapy, and you can't expect the same results as if it were.  It is, however, a nice collection of organic oils and beeswax which combines to make a semisolid much lighter in feel than petroleum jelly but not a liquid.  You need only a little dab - using too much could get messy.  It softens at body temperature but doesn't turn into an oily liquid.  It is quite nice and refreshing.  It's an odd greenish color.<br /><br />But the product is a bit confusing to me.  It is for external vaginal use only.  I don't know about you, but at what point is my vagina external instead of internal?  It seems pretty internal to me.  That makes it of limited use to postmenopausal women like me.  Soothing and comforting, yes, but not really what most postmenopausal women need.\nNice But of Limited Use for Us Old Ladies\nTRESemmé Botanique Shampoo and Conditioner Four Pack, Nourish & Replenish, 88 oz\nTRESemmé\n{'Material Type Free': 'paraben free,dye free', 'Item Form': 'Liquid', 'Brand': 'TRESemmé', 'Scent': 'prafum', 'Special Ingredients': 'Coconut-oil,Aloe-vera', 'Product Dimensions': '14.75 x 9.88 x 3.56 inches; 6.8 Pounds', 'UPC': '022400002248'}\nThis 4-pack of shampoo and conditioner should keep you supplied for quite awhile, but that doesn't matter if you find you don't like it.  I like it quite a bit.  The shampoo cleanses well and the conditioner (surprise!) conditions.  However it doesn't make my hair feel too stripped nor does it feel too greasy/oily after using both shampoo and conditioner, and my hair doesn't feel too dirty too fast, as with some conditioners.  The shampoo is clear and the conditioner is creamy.  This is a readily available brand, not a fancy salon brand, but it works well for me, and has no parabens, dyes, or silicones.\nWorks Well, Lovely Tropical Scent",
  "profile": "**User Profile Summary**\n\n- **Product Interest**: Continues to prefer rechargeable electric toothbrushes with advanced features such as sonic vibrations and multiple cleaning modes. Recently expanded interest to include personal care products, particularly those with soothing effects and health benefits, now noting a preference for hair care that is free from harsh chemicals.\n\n- **Performance**: Values effective results across personal care items, experiencing satisfaction from cleaning capabilities in dental hygiene and nourishing effects in hair care. The user appreciates products that enhance overall comfort and well-being.\n\n- **Design and Usability**: Maintains a preference for ergonomic and user-friendly designs, which continues to influence choices in both dental and personal care items.\n\n- **Replacement Parts**: Remains concerned about the availability and cost of essential replacement parts, indicating a consistent tendency towards practical and value-driven purchases across categories.\n\n- **Comparison with Competitors**: Approaches product comparisons critically, seeking high-quality options that offer good value without compromising on essential attributes, such as ingredient integrity and effectiveness.\n\n- **Durability and Serviceability**: Focuses on the long-term usability and effectiveness of products, implying a demand for reliability in both personal hygiene and hair care items.\n\n- **Storage Preferences**: Continues to emphasize hygiene in product storage, favoring items that include protective covers or are designed for clean use.\n\nOverall, the user seeks high-quality, functional products that prioritize performance, usability, affordability, and long-lasting effectiveness across all personal care domains.",
  "metrics": {
    "rouge1_f": 0.15594246782740348,
    "rouge2_f": 0.010614101592115238,
    "rougeL_f": 0.07115821347464042,
    "meteor": 0.05771663504111321,
    "bleu1": 0.009093563318584751,
    "bleu2": 0.0023084334657509,
    "bleu3": 0.00035506878084002946,
    "bleu4": 0.000139375484894084,
    "bertscore_precision": 0.38176506757736206,
    "bertscore_recall": 0.4743735194206238,
    "bertscore_f1": 0.4230605661869049
  }
}