{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Emilia Hypoallergenic Baby Lotion - Quick-Absorbing, Non-Greasy, Alcohol-Free Baby Body Oatmeal Cream With Natural Colloidal Oatmeal for Dry Skin Eczema - Provides 24 Hour Moisturization - 8.8 fl.oz.\nReview Date: 2020/09/15\nStore: Emilia\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Emilia', 'Item Form': 'Lotion', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 2.52 x 2.24 inches; 10.12 Ounces'}\nReview Text: Emilia Baby Body Lotion will really make your skin as soft as your babies! I just had to try it on myself because I have eczema and they said it is hypoallergenic. I can tell you that it doesn't irritate my skin ad the softness is really noticeable...and that you might not be able to notice on your baby because a babies skin is (usually) already soft. I am an adult that has allergies to a lot of things that show up in skin irritations, and I do not think that you can go wrong with buying this lotion. This is a great one for your newborn, baby, and the whole family. The only con would be if you don't like the smell of baby powder. It smells like a creamy baby powder, and I like it.\nReview Title: What a difference in softness!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Emilia Hypoallergenic Baby Lotion - Quick-Absorbing, Non-Greasy, Alcohol-Free Baby Body Oatmeal Cream With Natural Colloidal Oatmeal for Dry Skin Eczema - Provides 24 Hour Moisturization - 8.8 fl.oz.\nEmilia\n{'Brand': 'Emilia', 'Item Form': 'Lotion', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 2.52 x 2.24 inches; 10.12 Ounces'}\nEmilia Baby Body Lotion will really make your skin as soft as your babies! I just had to try it on myself because I have eczema and they said it is hypoallergenic. I can tell you that it doesn't irritate my skin ad the softness is really noticeable...and that you might not be able to notice on your baby because a babies skin is (usually) already soft. I am an adult that has allergies to a lot of things that show up in skin irritations, and I do not think that you can go wrong with buying this lotion. This is a great one for your newborn, baby, and the whole family. The only con would be if you don't like the smell of baby powder. It smells like a creamy baby powder, and I like it.\nWhat a difference in softness!",
  "profile": "**User Profile Summary:**\n\n- **Skin Sensitivity:** User has sensitive skin and experiences eczema, indicating a preference for hypoallergenic and gentle skincare products suitable for both themselves and their family.\n  \n- **Family-Centric Choices:** Purchases reflect a focus on products that are safe for newborns and babies, suggesting a strong consideration for family-oriented needs in their skincare selections.\n  \n- **Effectiveness Over Brand Preference:** User values the effectiveness of products, emphasizing noticeable results in skin softness rather than brand loyalty. They involve themselves in trying products that are typically marketed for infants.\n  \n- **Scent Consideration:** The user is receptive to specific scents, as they appreciate a creamy baby powder fragrance, which indicates they enjoy pleasant, mild aromas in skincare products.\n  \n- **Positive Reviews:** Exhibits a trend of giving high ratings when personal needs are met satisfactorily, particularly when addressing skin issues. \n\nOverall, the user prioritizes gentle, effective, family-friendly skincare solutions tailored to sensitive skin needs.",
  "metrics": {
    "rouge1_f": 0.24242424242424243,
    "rouge2_f": 0.022160664819944595,
    "rougeL_f": 0.11019283746556473,
    "meteor": 0.17648630324442674,
    "bleu1": 0.251561071029331,
    "bleu2": 0.06889456763749637,
    "bleu3": 0.03302061407206766,
    "bleu4": 0.01924776326196993,
    "bertscore_precision": 0.4310436248779297,
    "bertscore_recall": 0.44854798913002014,
    "bertscore_f1": 0.4396216571331024
  }
}