{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Empty Plastic Mini Fine Mist Spray Bottles Refillable Pump Bottle 3.4oz / 100ml Small Travel Size with Labels Funnels Cleaner\nReview Date: 2020/09/16\nStore: DURSI\nAverage Rating: 4.2\nProduct Details: {'Brand': 'DURSI', 'Material': 'Plastic', 'Capacity': '100 Milliliters', 'Item Dimensions LxWxH': '1.73 x 1.73 x 5.31 inches'}\nReview Text: These are FOUR (4) ounce containers! These are a little bigger than we expected. They will take up more room in a carry-on quart sized bag than I want. However, the bottles and everything that came with them work well as expected. I just wish that the seller would verify information before advertising. I took off only one star for the advertisement disappointment, but I kept the other four stars because the set works well for the size that they are.\nReview Title: They are a little bigger than advertised. I measured 4 ounces!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Emilia Hypoallergenic Baby Lotion - Quick-Absorbing, Non-Greasy, Alcohol-Free Baby Body Oatmeal Cream With Natural Colloidal Oatmeal for Dry Skin Eczema - Provides 24 Hour Moisturization - 8.8 fl.oz.\nEmilia\n{'Brand': 'Emilia', 'Item Form': 'Lotion', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 2.52 x 2.24 inches; 10.12 Ounces'}\nEmilia Baby Body Lotion will really make your skin as soft as your babies! I just had to try it on myself because I have eczema and they said it is hypoallergenic. I can tell you that it doesn't irritate my skin ad the softness is really noticeable...and that you might not be able to notice on your baby because a babies skin is (usually) already soft. I am an adult that has allergies to a lot of things that show up in skin irritations, and I do not think that you can go wrong with buying this lotion. This is a great one for your newborn, baby, and the whole family. The only con would be if you don't like the smell of baby powder. It smells like a creamy baby powder, and I like it.\nWhat a difference in softness!\nReusable Makeup Remover Cloth Towels Set - Remove mascara, exfoliate skin, clean your face - Eraser for you makeup! Wipe your face free only with warm water - MAKEUP BLUR (Leopard Print 9-Pack)\nMAKEUP BLUR\n{'Brand': 'MAKEUP BLUR', 'Material Feature': 'Reusable', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Package Dimensions': '6.1 x 3.7 x 1.8 inches; 1.59 Ounces', 'UPC': '081227858148'}\nThese amazingly do the job of wiping makeup off my face without any products but warm water! It's gentle on my skin too. They are so soft, thick, and I want a blanket made of this material! I just want to hug it because it feels so nice.\nSoft and Efficient!\nEmpty Plastic Mini Fine Mist Spray Bottles Refillable Pump Bottle 3.4oz / 100ml Small Travel Size with Labels Funnels Cleaner\nDURSI\n{'Brand': 'DURSI', 'Material': 'Plastic', 'Capacity': '100 Milliliters', 'Item Dimensions LxWxH': '1.73 x 1.73 x 5.31 inches'}\nThese are FOUR (4) ounce containers! These are a little bigger than we expected. They will take up more room in a carry-on quart sized bag than I want. However, the bottles and everything that came with them work well as expected. I just wish that the seller would verify information before advertising. I took off only one star for the advertisement disappointment, but I kept the other four stars because the set works well for the size that they are.\nThey are a little bigger than advertised. I measured 4 ounces!",
  "profile": "**User Profile Summary:**\n\n- **Skin Sensitivity:** The user has sensitive skin and experiences eczema, leading to a preference for hypoallergenic and gentle skincare products suitable for themselves and their family.\n\n- **Family-Centric Choices:** Their purchases reflect a focus on products that are safe for newborns and babies, indicating a strong consideration for family-oriented needs in skincare selections.\n\n- **Effectiveness Over Brand Preference:** The user prioritizes the effectiveness of products, seeking noticeable results in skin softness rather than brand loyalty. They are open to trying products typically marketed for infants, reinforcing their focus on gentle solutions.\n\n- **Scent Consideration:** They appreciate mild aromas, particularly creamy baby powder scents, which influences their skincare product choices.\n\n- **Positive Reviews:** The user tends to provide high ratings when their needs are met satisfactorily, especially concerning skin issues and product efficacy. Recently, they expressed a balanced approach to rating, considering both product performance and marketing accuracy.\n\n- **Practical Product Use:** The user is open to practical, travel-friendly solutions that align with their gentle skin care routine, highlighting a preference for reusable and functional items.\n\n- **Recent Interaction:** The user has embraced reusable cleansing products and expresses a strong appreciation for soft textures and comfort, indicating a desire for both practicality and sensory satisfaction in their skincare routine while remaining aware of product specifications.\n\nOverall, the user prioritizes gentle, effective, family-friendly skincare solutions tailored to sensitive skin needs while valuing product experience, practicality, and accuracy in marketing.",
  "metrics": {
    "rouge1_f": 0.21875000000000003,
    "rouge2_f": 0.014245014245014247,
    "rougeL_f": 0.09659090909090909,
    "meteor": 0.12473729200969037,
    "bleu1": 0.1409632140460549,
    "bleu2": 0.0413369632783694,
    "bleu3": 0.01665268649361688,
    "bleu4": 0.005002131128621524,
    "bertscore_precision": 0.4000956416130066,
    "bertscore_recall": 0.4621526598930359,
    "bertscore_f1": 0.42889097332954407
  }
}