{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/03/06\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nReview Text: I'm loving this series and all the angles. I'm also glad to really like the lead actor, Titus Welliver, in this role. This is a great role for him. So often you see him play a character that you just hate, but not this time - I LOVE Bosch. What a great detective! The added interest of his past makes him all the more intriguing and this series has captured my full attention.<br />Great job!\nReview Title: So far, so fabulous!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Straight from the Heart [DVD]\nRated:    Unrated    Format: DVD\nMovies & TV, Made-for-TV Movies, All Made-for-TV Movies\n['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'UN', 'Release Date:', '1-MAY-2007', 'Media Type:', 'DVD']\n{'Genre': 'Drama', 'Format': 'NTSC, DVD', 'Contributor': 'Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Media Format': 'NTSC, DVD', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 1, 2007', 'Studio': 'Good Times Video'}\nI hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br /><br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane and I wanted to be sure to order some clean-cut family type ones for visiting once I got there.<br /><br />I read all the reviews on this one and was not disappointed. As the others have said, the scenery, the actors, the warmth and beauty of it as well as the story made it all worthwhile.\nReally enjoyed it and would recommend\nThe Bucket List\nJack Nicholson  (Actor),     Morgan Freeman  (Actor),     Rob Reiner  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Bucket List, The (WS/FS/DVD)', \"Academy Award winners Jack Nicholson and Morgan Freeman star in this comedy drama, directed by Rob Reiner, a touching, no-holds-barred adventure that shows it's never too late to live life to its fullest--The Bucket List. One man was smart enough to go to college, but has worked his entire life as a mechanic; the other owns the hospital in which they are both patients. But these two men with little time left and even less to lose, discover that life can be deeply moving and definitely hilarious.\", ']]>']\n{'Genre': 'Action & Adventure/Crime, Comedy, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Contributor': 'Rowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob ReinerRowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob Reiner   See more', 'Language': 'Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0), French (Dolby Digital 4.0)', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 0.01 Ounces', 'Item model number': 'WARD024013D', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'June 10, 2008', 'Actors': 'Jack Nicholson, Morgan Freeman, Sean Hayes, Rob Morrow, Beverly Todd', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Jeffrey Stott, Craig Zadan, Travis Knox, Neil Meron, Alan Greisman', 'Studio': 'WarnerBrothers', 'Writers': 'Justin Zackham', 'Number of discs': '1'}\nI hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane.<br /><br />Yes, it's sad, but so are lots of things in life but this is a different kind of sadness. It's a sadness that also comes with great joy because it reached its full cycle and you felt that fulfillment. You also felt its purpose, and the love.<br /><br />I think for some to comment that it was 'predictable' miss the point. Much in life is predictable. For me, I don't care that some things are predictable; or simplified, or maybe not even 'realistic'. I can get reality in the day to day. To watch a movie is to become involved deeply with so many levels of the movie and to glean from it whatever message you are receiving at that time.<br /><br />I enjoyed Morgan's wife in the movie and the relationship he had with her. Of course she is going to get mad at him; be frustrated, concerned and then absolutely shocked and bewildered when he announced his plans. But, she also showed great trust, and love and knew that whatever he was needing to do, it's what he needed to do and let it go. Let him go. I enjoyed those intimate scenes. People need to see great strength and trust between two people.<br /><br />I also found myself hanging on the edge of my seat when Morgan was at the bar and the beautiful lady came up and sat next to him. I found myself thinking that if MORGAN (the actor - not even the character!) 'gave in', then I would change how I felt about him (however irrational since it was his character, not him). I held my breath in anticipation...<br />Now, whether Morgan had any say so on the outcome of that scene or whether that was how the script was written anyway, it made a world of difference to me. And if Morgan did have a say so, well, all the more reason why I esteem him so highly.<br /><br />I thought it was a wonderful movie and am so glad I got to see it.\nTwo of my favorites together for an unforgettable movie\nGran Torino\nClint Eastwood  (Actor, Director),     Brian Haley  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"A disgruntled Korean War vet, Walt Kowalski (Eastwood), sets out to reform his neighbor, a young Hmong teenager, who tried to steal Kowalski's prized possession: his 1972 Gran Torino.\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Clint Eastwood, Brian Haley, Christopher Carley, Geraldine Hughes', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nI hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip.<br />When I went to Amazon's DVD page, Gran Torino was showing and of course, since I'm a huge Clint Eastwood fan, it was my choice.<br />I'm stunned as to what to say and I can't really add anything that other reviewers have not already said. BTW, I concur completely with Robert Crawford's absolutely beautiful review as that says it all so well.<br /><br />The unfolding of the layers to this crotchety, bitter man is what is so special and yet at the same time so sad that this is what his sons will never know, never experience is one that hit the 'closest to home' for me and much of the sadness that I did feel in this movie. The loss. The waste.<br /><br />I also want to comment on how much I enjoyed the actress who played Sue - the girl next door. She was a fabulous actress and you adored her instantly. Conversely, I had a bit more of a difficult time 'believing' the character of the boy until much more into the movie.<br /><br />Clint is still so very handsome - one scene where he puts on a nice jacket and has a close shave and no matter his age, he's still 'got it'.<br /><br />Yes, the old man thought long and hard and came up with the winning solution to a very real and very gruesome problem. And along with that, he buried the demons haunting his heart and mind for all those years.<br /><br />The movie is sad? Yes, but the saddest part of all is that it's a reality that is a part of so many peoples' lives all the time.\nleft me feeling utterly distraught\nAugust Rush\nKirsten Sheridan  (Director),     Freddie Highmore  (Actor),     Keri Russell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', 'August Rush (WS/FS/DVD)', 'Separated by events they could not control but bound by love and by music, three people search for what they lost and what will make their lives complete ... each other. Keri Russell (Waitress, \"Felicity\"), Johathan Rhys Meyers (\"The Tudors\") and Freddie Highmore (Charlie and the Chocolate Family, Finding Neverland) star with Robin Williams in this amazing, heartwarming tale of two very different musicians who fall in love only to be torn apart, both unaware that they have a child, a musical prodigy who is trying to find them as much as they are trying to find each other, a boy destined for greatness as the rising young star August Rush.', ']]>', 'Amazon.com', 'Music has long been considered a universal language with the power to bring people together, but can the simple act of playing music possibly unite a child with a mother and father who live in two different cities and don\\'t even know of the child\\'s existence? Having shared one extraordinary night, classical cellist Lyla Novacek (Keri Russell) and Irish singer and songwriter Louis Connelly (Jonathan Rhys Meyers) were a union meant to be that was torn apart by circumstances and a protective father (William Sadler). After eleven years, both Lyla and Louis have given up performing only to find that they are unhappy and searching for a sense of fulfillment that will ultimately lead both artists back to music and performing. Evan (Freddie Highmore) is an 11-year old orphan who\\'s grown up hearing music in everything around him and is convinced that his real parents want him and will find him with the help of music. Driven by his innate musical genius and a powerful compulsion to perform before the world, Evan runs away from the orphanage and is initially taken in by a street man known as Wizard (Robin Williams) who encourages his musical talent and renames him August Rush and, later, by a local priest who arranges for August to receive a Julliard education. August is a child prodigy who excels beyond even the wildest expectations and earns the opportunity of a lifetime--a chance to perform in front of an enormous audience in New York\\'s Central Park. The question is; can his performance possibly reach the audience August really craves? While elements of this film are completely unbelievable (take August\\'s instant prowess on the guitar or his immediate and sophisticated grasp of musical notation and musical theory), the message of the universality of music and the notion that \"the music is all around us, all you have to do is listen\" is both compelling and powerful.', '--Tami Horiuchi']\n{'Genre': 'Musicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & AdventureMusicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & Adventure  See more', 'Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, WidescreenAC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen  See more', 'Contributor': \"Mykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louise Goodsill, Keri Russell, Robert Greenhut, Jania Simone Nash, Aaron Staton, Nick CastleMykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louis…  See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '76368', 'Director': 'Kirsten Sheridan', 'Media Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'March 11, 2008', 'Actors': 'Freddie Highmore, Keri Russell, Jonathan Rhys Meyers, Terrence Howard, Robin Williams', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Richard Barton Lewis, Robert Greenhut, Ralph Kamp, Louise Goodsill, Miky Lee', 'Studio': 'WarnerBrothers', 'Writers': 'Nick Castle, James V. Hart, Paul Castro', 'Number of discs': '1'}\nin hopeful anticipation of what was to come.<br /><br />I absolutely loved this movie and in fact paused it so I could call my daughter 2,000 miles away to tell her she MUST see this movie!<br /><br />The movie was magical. And many refer to it as a Fairy Tale and yet for me, personally, I viewed it as something very real, and THAT is what made it magical.<br />For I have experienced, or known of, many things that many may find unbelievable, or coincidental, or magical and yet they were the Orchestration (pun intended) beyond our own thinking.<br /><br />And that magical wonder; that purposeful Orchestration is there all the time..all we have to do is listen.\nMy heart was pounding and I gripped my armchair much of the time\nFrontline: Sick Around the World\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, TV News Programming\n['Four in five Americans say the healthcare system needs fundamental change. Can the U.S. learn anything from the rest of the world about how to run a healthcare system, or are these nations so culturally different that their solutions would not be acceptable? FRONTLINE correspondent T.R. Reid examines the healthcare systems of other advanced capitalist democracies to see what ideas might help the U.S. reform its broken healthcare system.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5070863', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'June 10, 2008', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nand then ran to the computer to see if I could get it on Amazon so I could share with anyone who is interested. It's a 'must see', truly.<br /><br />Other systems around the world work. Ours doesn't. Nothing's perfect, but see this and you'll see that there is a better way when we can all see the 'bigger picture' and remove agendas and be on board with what really matters.<br />When you do what is right, everyone benefits.\nA must see - saw on Public Television first\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'Bitsie Tulloch', 'Russell Hornsby'], 'Studio': ['NBC']}\nThis is a review for the entire Season 2 of Grimm. What began as just needing something to watch (and for free streaming) ended up as an absolute obsession.<br />In the beginning of Season 1, it took a few episodes before deciding if it was worth my time. Was David Giuntoli just another pretty face or did this show have any possibility?<br />First, let me tell you that as Season 1 wrapped up and I got wrapped up in Season 2, not only did the star, Nick, played by David Giuntoli prove to be a terrific actor - but the actors together do a superb job. I really like Hank, played by Russell Hornsby all the more once he was &#34;in the loop&#34; as to the real goings-on; and the development of the Captain's character was a nice turn of events. The character, Monroe, played by Silas W. Mitchell is the real maker of the show, because without him, it would be missing the element of humor and charm. And I love the addition of Rosalee! She's superb. The only character that's flawed is Juliette, who I found not only annoying, but her acting is sub-par and took away from the show. Everyone else made up for it though.<br />The writing, storyline, acting, makeup, special effects and scenery make this Season 2 of Grimm the best. I stayed up late last night to watch three in a row if that tells you anything!<br />(I do not recommend for children - let it be for adults only, in my opinion)\nWhat started as just needing something (free) to watch grew into an obsession and one of my all-time faves!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kristi Jacobson', 'Lori Silverbush'], 'Producers': ['Julie Goldman', 'Ryan Harrington', 'Kristi Jacobson', 'Lori Silverbush'], 'Starring': ['Jeff Bridges', 'Tom Colicchio'], 'Studio': ['Magnolia Pictures']}\nCompletely missed the mark - didn't show the real problems nor the real solutions and threw in enough truth to grab your emotions while enough political bulls*t to be a complete turnoff.<br />I would love to have a one-on-one conversation with Jeff Bridges to show him the real problems and some real solutions. The Government is not the answer, nor should it be. I agree that the Government is certainly a part of the PROBLEM - no doubt.<br />Becoming more self reliant and sustainable and returning to more the 'natural' human is where the answer lies. Read Michael Bunker's book, &#34;Surviving Off Off-Grid&#34; for starters.<br />I myself have taught a 2 hr class on sprouting - for ULTIMATE NUTRITION for only pennies a day, which can be done in any living situation. Victoria Boutenko (see her books here on Amazon), as an individual, has traveled the world over, to some of the most 3rd world countries where  people truly ARE starving, and where they have no resources and showed them how to grow the most NUTRITIOUS foods on the planet for very little cost and effort and to provide enough for their village - not just to survive and get by, but to THRIVE in good health and to be enough for them ALL.<br /><br />This movie missed the mark. While I do recommend that people see it to understand some things - though NOT the things mentioned in the movie - but to basically see the MISCONCEPTIONS and how things are being skewed, I do recommend that people know just how many people in this country are facing these issues. I simply see the issues as being completely different than what is presented in this film\nI would love to have a one-on-one conversation with Jeff Bridges to ...\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nI'm loving this series and all the angles. I'm also glad to really like the lead actor, Titus Welliver, in this role. This is a great role for him. So often you see him play a character that you just hate, but not this time - I LOVE Bosch. What a great detective! The added interest of his past makes him all the more intriguing and this series has captured my full attention.<br />Great job!\nSo far, so fabulous!",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user maintains a strong preference for family-friendly films that blend humor with deeper themes. They have developed an interest in thought-provoking documentaries addressing societal issues, and they have become more open to content with mature themes, focusing on authenticity in storytelling.\n\n- **Viewing Behavior:** Following a six-year hiatus, the user has resumed exploring films and has begun watching series that are engaging and emotionally resonant. This recent interaction highlights their enthusiasm for complex characters and narratives, specifically appreciating depth in storytelling, exemplified by their admiration for a lead actor's portrayal in a detective role.\n\n- **Shopping Motivation:** The user prioritizes heartfelt stories with emotional depth and enjoys sharing compelling titles with friends and family. They actively seek narratives that challenge misconceptions and foster critical thinking on social topics.\n\n- **Interaction Style:** Engagement remains passionate and reflective, showcasing a commitment to meaningful discussions about films and series that explore complex narratives. The user is dedicated to transformative storytelling that enlightens their social circles.\n\n- **Recommendation Inclination:** The user is eager to guide others, sharing diverse films and series that intertwine joy with depth. Their recent viewing has reinforced a preference for content that encourages critical engagement and authentic narratives, showcasing a growing appreciation for well-crafted characters and intricate plots.",
  "metrics": {
    "rouge1_f": 0.060282742064550546,
    "rouge2_f": 0.005337603416066186,
    "rougeL_f": 0.03467591357695385,
    "meteor": 0.018365392295872158,
    "bleu1": 1.5717371246798097e-08,
    "bleu2": 4.603709953407394e-09,
    "bleu3": 6.595281867797584e-10,
    "bleu4": 2.498674466589436e-10,
    "bertscore_precision": 0.34336113929748535,
    "bertscore_recall": 0.4882650673389435,
    "bertscore_f1": 0.4031889736652374
  }
}