{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nReview Date: 2021/09/14\nStore: Auban\nProduct Description: ['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nReview Text: [[VIDEOID:79b300b7fdf9282f8b15663042deabc9]] This is not what I would call a bonnet. This is more like a skull cap that satin lined. I wouldn’t wear this to protect my hair. I don’t know what it’s used for. Not big head friendly.\nReview Title: Small Bonnet !\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "DATEWORK 1PCS Professional Cosmetic Flat Contour Brush (Black)\n{'UPC': '644735906840 794168249219'}\nI like it! The handle was shorter then I thought it would be! Or I would have giving 5 stars\nI like it! The handle was shorter then I thought ...\n2PCS Portable Electric Toothbrush Travel Case, Plastic Travel Toothbrush Container Holder Suitable for Oral-B, Philips Sonicare and Other Electric Toothbrush Set (Black and White)\nHovesty\n{'Package Dimensions': '9.84 x 5.59 x 1.73 inches; 6.38 Ounces', 'UPC': '664935369078'}\nThis product doesn’t fit my WepKlin electric toothbrush, even it I remove the replacement head.\nDoesn’t Fit my Electric Toothbrush.\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nAuban\n['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\n{'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\n[[VIDEOID:79b300b7fdf9282f8b15663042deabc9]] This is not what I would call a bonnet. This is more like a skull cap that satin lined. I wouldn’t wear this to protect my hair. I don’t know what it’s used for. Not big head friendly.\nSmall Bonnet !",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Type Preference:** The user continues to prioritize professional cosmetic tools, particularly contour brushes. Additionally, they are exploring personal care products, including sleep accessories, indicating a broadening interest in enhancing beauty and self-care routines.\n\n- **Experience with Products:** The user emphasizes functionality and design across both beauty and personal care items. Their recent experience with a sleep accessory highlighted issues with fit and practicality, reinforcing their focus on effective and compatible products.\n\n- **Rating Tendencies:** The user maintains a history of generally positive ratings but has become increasingly discerning, as shown by their recent lower review score. Such feedback reflects their commitment to ensuring products meet their functional needs and expectations.\n\n- **General Attitude:** The user appreciates well-designed, functional products that align with their preferences while also providing honest feedback about challenges encountered in usage. Their recent review demonstrates a practical mindset, prioritizing both utility and comfort.\n\nOverall, the user remains engaged in both beauty and personal care sectors, seeking high-quality tools and accessories that enhance their routines, while valuing transparency in their reviews based on personal experiences and satisfaction.",
  "metrics": {
    "rouge1_f": 0.14112903225806453,
    "rouge2_f": 0.016194331983805668,
    "rougeL_f": 0.07258064516129033,
    "meteor": 0.09993437543704882,
    "bleu1": 0.11196975085629768,
    "bleu2": 0.015413772825963288,
    "bleu3": 0.0036995188657936934,
    "bleu4": 0.0018144317634524573,
    "bertscore_precision": 0.3489159345626831,
    "bertscore_recall": 0.4157537817955017,
    "bertscore_f1": 0.37941378355026245
  }
}