{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Maestee Gel Nail Polish Set - 9 Bottles-Bright Neon Nail Polish With Glossy & Matte Gel Top Coat Base Coat Soak Off UV/LED Nail Lamp 0.28oz Set-C\nReview Date: 2021/10/03\nStore: maestee\nAverage Rating: 4.5\nProduct Details: {'Brand': 'maestee', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '10.00 Fl Oz', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.73 x 3.74 x 1.34 inches; 14.07 Ounces', 'UPC': '780262904833'}\nReview Text: [[VIDEOID:50209f131a45c8d58877cc7e04baaca0]] See video!\nReview Title: Pretty, Full coverage!! Vibrant colors!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "DATEWORK 1PCS Professional Cosmetic Flat Contour Brush (Black)\n{'UPC': '644735906840 794168249219'}\nI like it! The handle was shorter then I thought it would be! Or I would have giving 5 stars\nI like it! The handle was shorter then I thought ...\n2PCS Portable Electric Toothbrush Travel Case, Plastic Travel Toothbrush Container Holder Suitable for Oral-B, Philips Sonicare and Other Electric Toothbrush Set (Black and White)\nHovesty\n{'Package Dimensions': '9.84 x 5.59 x 1.73 inches; 6.38 Ounces', 'UPC': '664935369078'}\nThis product doesn’t fit my WepKlin electric toothbrush, even it I remove the replacement head.\nDoesn’t Fit my Electric Toothbrush.\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nAuban\n['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\n{'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\n[[VIDEOID:79b300b7fdf9282f8b15663042deabc9]] This is not what I would call a bonnet. This is more like a skull cap that satin lined. I wouldn’t wear this to protect my hair. I don’t know what it’s used for. Not big head friendly.\nSmall Bonnet !\nKISSIO Eyebrow Stamp Stencil and Eyebrow Styling Gel Kit (03#Clear)\nKISSIO\n{'Brand': 'KISSIO', 'Item Form': 'Gel', 'Finish Type': 'Natural', 'Product Benefits': 'Smoothening', 'Skin Type': 'All', 'Package Dimensions': '3.07 x 1.85 x 1.06 inches; 0.35 Ounces'}\nGreat for feather brows.\nSee Pictures.\n15Pcs Nail Clips for Polygel: Nail Tips Clip for Quick Building Polygel nail forms Nail clips Kit for polygel Finger Nail Extension UV LED Builder Clamps Manicure Nail Art Tool\nTrati\n{'Size': '1 Count (Pack of 1)', 'Brand': 'Trati', 'Coverage': 'Full Well Tips', 'Item Form': 'Gel', 'Number of Pieces': '15', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.4 x 1.1 x 0.71 inches; 2.75 Ounces', 'UPC': '729993185500'}\n[[VIDEOID:3666dfe4d6fa329e9de51f59994c3e48]] Very helpful when trying to create PolyGel nails!\nWorks like a charm!\nBEYELIAN False Eyelashes with Eyeliner Glue Pen, Natural Faux Mink Fake Lashes, 20 Pairs Various Styles Wispy Fluffy Lashes Pack EY007\nBEYELIAN\n{'Brand': 'BEYELIAN', 'Material': 'Faux Mink', 'Item Dimensions LxWxH': '14.25 x 0.71 x 9.33 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Product Dimensions': '14.25 x 0.71 x 9.33 inches; 5.29 Ounces'}\n[[VIDEOID:d2c7bb98f470f938b01f5ac0d7b57952]] The eyelashes are very dramatic! Super long and not realistic at all. But maybe good for costumes.\nSuper long!\nAORAEM Mini Nail Dust Collector Portable Suction Dust Collector Machine Handheld Table Dust Sweeper with Brush for Nail Drills Acrylic Nails (Light Grey)\nAORAEM\n{'Package Dimensions': '4.02 x 3.58 x 2.8 inches; 4.66 Ounces'}\nDoesn’t really work well! No Adapter!\nBatteries not included.\nTODAYADAY’s Baby Foot Peel Mask for Dry Cracked Feet (3 Pairs) - Removes & Repairs Rough Heels - Moisturizing Feet Peeling Mask for Callus and Dead Skin\nTODAYADAY\n{'Brand': 'TODAYADAY', 'Scent': 'Fresh', 'Unit Count': '3.00 Count', 'Number of Items': '6', 'Skin Tone': 'All', 'Product Dimensions': '7.95 x 6.1 x 1.18 inches; 7.05 Ounces'}\n \nDidn’t use because the instructions are not in English.\nMaestee Gel Nail Polish Set - 9 Bottles-Bright Neon Nail Polish With Glossy & Matte Gel Top Coat Base Coat Soak Off UV/LED Nail Lamp 0.28oz Set-C\nmaestee\n{'Brand': 'maestee', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '10.00 Fl Oz', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.73 x 3.74 x 1.34 inches; 14.07 Ounces', 'UPC': '780262904833'}\n[[VIDEOID:50209f131a45c8d58877cc7e04baaca0]] See video!\nPretty, Full coverage!! Vibrant colors!!",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Type Preference:** The user continues to broaden their beauty toolkit, now placing a significant emphasis on vibrant nail care products, in addition to their focus on foot care and professional cosmetics. Their selection reflects a desire for a comprehensive beauty routine that integrates various dimensions of self-care.\n\n- **Experience with Products:** The user is discerning, favoring products that offer both practicality and aesthetic appeal. Their recent experience with a gel nail polish set highlights an appreciation for vibrant colors and full coverage, reinforcing their expectations for high performance in beauty applications.\n\n- **Rating Tendencies:** The user exhibits a critical yet positive approach to ratings, as demonstrated by their 5.0 rating for the gel nail polish set, indicating satisfaction with product quality. This showcases their tendency to reward exceptional products that deliver on their promises while maintaining their commitment to evaluating usability and functionality thoroughly.\n\n- **General Attitude:** The user remains devoted to high-quality, well-designed beauty tools, driven by an underpinning philosophy that product effectiveness is essential. They continue to seek innovations that enhance the efficacy of their beauty and foot care regimens.\n\nOverall, the user demonstrates a vibrant and engaged approach to beauty, balancing a strong interest in high-performance nail care with their critical perspective on usability and effectiveness across various product categories.",
  "metrics": {
    "rouge1_f": 0.15154749199573106,
    "rouge2_f": 0.017112299465240642,
    "rougeL_f": 0.0576307363927428,
    "meteor": 0.06469036244294449,
    "bleu1": 0.01755722085720273,
    "bleu2": 0.0029733701603354063,
    "bleu3": 0.0006068159351214335,
    "bleu4": 0.0002743959935124766,
    "bertscore_precision": 0.3433037996292114,
    "bertscore_recall": 0.43425557017326355,
    "bertscore_f1": 0.38346031308174133
  }
}