{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: KISSIO Eyebrow Stamp Stencil and Eyebrow Styling Gel Kit (03#Clear)\nReview Date: 2021/09/18\nStore: KISSIO\nAverage Rating: 4.2\nProduct Details: {'Brand': 'KISSIO', 'Item Form': 'Gel', 'Finish Type': 'Natural', 'Product Benefits': 'Smoothening', 'Skin Type': 'All', 'Package Dimensions': '3.07 x 1.85 x 1.06 inches; 0.35 Ounces'}\nReview Text: Great for feather brows.\nReview Title: See Pictures.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "DATEWORK 1PCS Professional Cosmetic Flat Contour Brush (Black)\n{'UPC': '644735906840 794168249219'}\nI like it! The handle was shorter then I thought it would be! Or I would have giving 5 stars\nI like it! The handle was shorter then I thought ...\n2PCS Portable Electric Toothbrush Travel Case, Plastic Travel Toothbrush Container Holder Suitable for Oral-B, Philips Sonicare and Other Electric Toothbrush Set (Black and White)\nHovesty\n{'Package Dimensions': '9.84 x 5.59 x 1.73 inches; 6.38 Ounces', 'UPC': '664935369078'}\nThis product doesn’t fit my WepKlin electric toothbrush, even it I remove the replacement head.\nDoesn’t Fit my Electric Toothbrush.\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nAuban\n['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\n{'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\n[[VIDEOID:79b300b7fdf9282f8b15663042deabc9]] This is not what I would call a bonnet. This is more like a skull cap that satin lined. I wouldn’t wear this to protect my hair. I don’t know what it’s used for. Not big head friendly.\nSmall Bonnet !\nKISSIO Eyebrow Stamp Stencil and Eyebrow Styling Gel Kit (03#Clear)\nKISSIO\n{'Brand': 'KISSIO', 'Item Form': 'Gel', 'Finish Type': 'Natural', 'Product Benefits': 'Smoothening', 'Skin Type': 'All', 'Package Dimensions': '3.07 x 1.85 x 1.06 inches; 0.35 Ounces'}\nGreat for feather brows.\nSee Pictures.",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Type Preference:** The user continues to favor professional cosmetic tools, especially contour brushes, while also showing interest in eyebrow styling products. Their exploration into personal care products, including sleep accessories, indicates a growing commitment to enhancing both beauty and self-care routines.\n\n- **Experience with Products:** The user values functionality and design across beauty and personal care items. Their recent positive experience with an eyebrow styling kit emphasizes a preference for products that deliver effective results. However, earlier challenges with fit and practicality in sleep accessories remain a focus for the user.\n\n- **Rating Tendencies:** The user typically provides positive ratings but has become more discerning, reflecting a commitment to high standards. Their recent review showcases both satisfaction with a product and an expectation for quality, maintaining a consistent approach to feedback based on functionality.\n\n- **General Attitude:** The user appreciates well-designed, functional products that align with their needs while ensuring honest feedback about any usage challenges. Their latest review highlights a practical mindset, emphasizing utility and aesthetic appeal in their choices.\n\nOverall, the user remains active in beauty and personal care sectors, actively seeking high-quality tools and accessories that enhance their routines while prioritizing transparency and functionality in their reviews.",
  "metrics": {
    "rouge1_f": 0.16341030195381884,
    "rouge2_f": 0.017825311942959002,
    "rougeL_f": 0.07104795737122557,
    "meteor": 0.10227422812004135,
    "bleu1": 0.10191312050385296,
    "bleu2": 0.013074605437976086,
    "bleu3": 0.00306482720039358,
    "bleu4": 0.0014853536220107314,
    "bertscore_precision": 0.3431098461151123,
    "bertscore_recall": 0.41329002380371094,
    "bertscore_f1": 0.37494421005249023
  }
}