{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Jason Goes to Hell\nReview Date: 2019/07/12\nStore: Adam Marcus  (Director),     John D. LeMay  (Actor),     Kari Keegan  (Actor)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Product Description', 'Jason Goes to Hell (DVD)', \"Jason Voorhees, the living, breathing essence of evil, is back for onefierce, final fling! Tracked down and blown to bits by a special FBItask force, everyone now assumes that he's finally dead. But everybodyassumes wrong. Jason has been reborn with the bone-chilling ability toassume the identity of anyone he touches. The terrifying truth is thathe could be anywhere, or anybody. In this shocking, blood-soaked finaleto Jason's carnage-ridden reign of terror, the horrible secret of hisunstoppable killing instinct is finally revealed. And once you know thechilling facts, you'll see him in your nightmares!\", ']]>', 'Amazon.com', \"Blow mad killer Jason Voorhees to smithereens in the opening sequence of the movie? Sorry, folks, you have to do better than that. Jason's evil spirit finds its way into a series of host bodies, thus continuing the carnage at Crystal Lake, in\", 'Jason Goes to Hell: The Final Friday', '. Naturally, part 9 is not the final', 'Friday the 13th', \"movie (no big deal: part 4, you'll recall, was titled\", 'The Final Chapter', '). Jason confronts a long-lost sister at the lake, while the usual assortment of naked teens are dispatched. This one tries to vary the formula a bit but ends up with a story line every bit as nonsensical as those that came before. The final sequence tries to put Jason away for keeps and calls upon the demons of hell for support. The last shot is an outrageous joke, which is perhaps what this franchise deserves.', '--Robert Horton', 'Set Contains:', \"The DVD contains both the R-rated and unrated versions of the picture, plus a commentary track with director Adam Marcus and screenwriter Dean Lorey, during which the two friends chortle frequently about the movie. Among the revelations: series producer Sean S. Cunningham asked them to get rid of Jason's hockey mask once and for all.\", '--Robert Horton', 'See more']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Horror', 'Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Contributor': 'Erin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven CulpErin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven Culp   See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.5 x 0.4 inches; 2.4 Ounces', 'Item model number': 'MFR794043562624#VG', 'Director': 'Adam Marcus', 'Media Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 27, 2005', 'Actors': 'John D. LeMay, Kari Keegan, Erin Gray, Allison Smith, Steven Culp', 'Subtitles': 'English', 'Producers': 'Sean S. Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Dean Lorey, Jay Hoguely', 'Number of discs': '1'}\nReview Text: Finished my Friday the 13th collection! Not by any means the best movie in the series, but I am a big horror fan and am trying to collect classic horror series.\nReview Title: My collection is complete!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Electric Horseman\nRobert Redford  (Actor),     Jane Fonda  (Actor),     Sydney Pollack  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Robert Redford plays an ex-world champion cowboy, reduced to huckstering breakfast food in a suit studded with flashing lights. Jane Fonda is a chic, sharp member of the electronic media, a TV newswoman who'll do anything to get a good story. When Redford rides out of a Las Vegas casino into the desert astride his sponsor's living symbol, a multi-million dollar racehorse, Jane is determined to discover why. She does, one step ahead of a posse of pursuing police. But by the time they reach a remote rendezvous high in the Utah mountains, she is in love with both the cowboy and his convictions.Bonus Content:\", 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\n{'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Contributor': 'Tasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry Sheehan Adair, James Novak, Will Hare, Valerie Perrine, Wilford Brimley, Sarah Harris, Sydney Pollack, Michele Heyeden, Frank Speiser, Richard Perlmutter, John Saxon, Lois Hamilton, Quinn K. RedekerTasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry She…  See more', 'Initial release date': '2003-05-06', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '1022748', 'Director': 'Sydney Pollack', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '2 hours and 2 minutes', 'Release date': 'May 6, 2003', 'Actors': 'Robert Redford, Jane Fonda, Valerie Perrine, Willie Nelson, John Saxon', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPerfect feel-good movie. Redford and Fonda have amazing chemistry. Beautiful scenery as they journey to free the horse. You won't be disappointed.\nGreat!\nChild's Play [DVD]\nCatherine Hicks  (Actor),     Chris Sarandon  (Actor),     Tom Holland  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['The \"chills come thick and fast\" (Los Angeles Times) as voodoo and terror meet within an innocent-looking doll inhabited by the soul of a serial killer who isn\\'t ready to die. From the Director of Fright Night comes a \"clever, playful\" (The New York Times) and stylish thriller with \"excellent special effects\" (Leonard Maltin) and heart-pounding suspense guaranteed to scare! After 6-year-old Andy Barclay\\'s (Alex Vincent) babysitter is violently pushed out of a window to her death, nobody believes him when he says that \"Chucky,\" his new birthday doll, did it! Untilthings start going terribly wrong dead wrong. And when an ensuing rampage of gruesome murders lead a detective (Chris Sarandon) back to the same toy, he discovers that the real terror has just begun\\'the deranged doll has plans to transfer his evil spirit into a living human beingyoung Andy!']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Contributor': 'Brad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil GiuntoliBrad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil Giuntoli  See more', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Tom Holland', 'Media Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Run time': '1 hour and 27 minutes', 'Release date': 'September 28, 1999', 'Actors': 'Catherine Hicks, Chris Sarandon, Alex Vincent, Brad Dourif, Dinah Manoff', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Don Mancini, John Lafia, Tom Holland', 'Number of discs': '1'}\nKind of confused because I ordered the movie Child's Play, but received it as part of a three part movie disc with Amityville Horror and Carrie. I guess it was ok, but I only wanted Child's Play. So, not sure what anyone else will get.\nYou get the movie, but.........\n4 Film Favorites: Nightmare on Elm Street 1-4 (A Nightmare on Elm Street, Nightmare on Elm Street 2: Freddie's Revenge, Nightmare on Elm Street 3: Dream Warriors, Nightmare on Elm Street 4: The Dream Master)\nRobert Englund  (Actor),     Johnny Depp  (Actor),     Wes Craven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Product Description', \"Titles include: A Nightmare On Elmstreet, A Nightmare On Elmstreet 2: Freddy's Revenge, A Nightmare On Elmstreet 3: Dream Warriors, A Nightmare On Elmstreet 4: The Dream Master\", 'Amazon.com', \"In the trinity of modern horror films, there's the father (Michael Myers of Halloween), the son (Jason of Friday the13th fame, a knockoff), and the unholy spirit, Freddy Krueger of the Nightmare on Elm Street films. The spectral man who haunted the nightmares of unsuspecting teenagers with deadly consequences, Freddy (as played by Robert Englund) was a truly frightening bogeyman and icon for the '80s. Unlike the hockey-masked Jason, who dispatched horny teenagers with mechanical and monotonous ease (he never talked, never took off his mask), Freddy was a truly creative and diabolical villain, with a sadistic and blackly funny personality. The hallmarks of the Nightmare on Elm Street series were imaginatively gruesome suspense pieces, set in the overactive imaginations of the teen victims. The first film of the series, Wes Craven's truly intelligent and scary film, was so hugely successful it begat not one, not two, but six more sequels, each pretty much diluting the originality and horror of its predecesor. (Horror fans will fondly remember Drew Barrymore's assertion in Scream that the first Nightmare film was great but all the rest sucked.) Still, there's fun to be had in the remaining films in the series, seeing as a number of aspiring filmmakers cut their teeth on the continuing saga of Freddy. Frank Darabont (The Shawshank Redemption) and Chuck Russell (The Mask) worked on the third installment, Dream Warriors (starring a young Patricia Arquette), and Renny Harlin (Die Hard 2) came to prominence with the ingeniously macabre fourth film, The Dream Master, coscripted by Brian Helgeland (L.A. Confidential). Craven and original star Heather Langenkamp did return for the last film, New Nightmare, which presaged the tongue-in-cheek postmodernism of the Scream films and resharpened Freddy's ability to scare. --Mark Englehart\"]\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Contributor': 'Patricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark PattonPatricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark Patton   See more', 'Initial release date': '2008-10-14', 'Language': 'English', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '5.39 x 7.48 x 0.63 inches; 3.03 Ounces', 'Item model number': 'WARD042244D', 'Director': 'Wes Craven', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Run time': '6 hours and 14 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Robert Englund, Johnny Depp, Patricia Arquette, Mark Patton, Kim Myers', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nCollecting the entire Nightmare series and this was an inexpensive way to begin.\n4 movies for one price!\n4 Film Favorites: Nightmare on Elm Street 5-8 (Freddy vs Jason, Freddy's Dead: The Final Nightmare, Nightmare on Elm Street 5: The Dream Child, Wes Craven's New Nightmare)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['4 Film Favorites: Nightmare on Elm Street 5-8 (DVD)', \"Titles include: A Nightmare On Elmstreet 5: The Dream Child, Freddy's Dead The Final Nightmare, Wes Craven's New Nightmare, Freddy Vs. Jason\", ']]>']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'NEWL1000042232DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours and 15 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nOwn the the first four in the series, now my collection is complete!\nCompleted my collection!\nJason Goes to Hell\nAdam Marcus  (Director),     John D. LeMay  (Actor),     Kari Keegan  (Actor)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Product Description', 'Jason Goes to Hell (DVD)', \"Jason Voorhees, the living, breathing essence of evil, is back for onefierce, final fling! Tracked down and blown to bits by a special FBItask force, everyone now assumes that he's finally dead. But everybodyassumes wrong. Jason has been reborn with the bone-chilling ability toassume the identity of anyone he touches. The terrifying truth is thathe could be anywhere, or anybody. In this shocking, blood-soaked finaleto Jason's carnage-ridden reign of terror, the horrible secret of hisunstoppable killing instinct is finally revealed. And once you know thechilling facts, you'll see him in your nightmares!\", ']]>', 'Amazon.com', \"Blow mad killer Jason Voorhees to smithereens in the opening sequence of the movie? Sorry, folks, you have to do better than that. Jason's evil spirit finds its way into a series of host bodies, thus continuing the carnage at Crystal Lake, in\", 'Jason Goes to Hell: The Final Friday', '. Naturally, part 9 is not the final', 'Friday the 13th', \"movie (no big deal: part 4, you'll recall, was titled\", 'The Final Chapter', '). Jason confronts a long-lost sister at the lake, while the usual assortment of naked teens are dispatched. This one tries to vary the formula a bit but ends up with a story line every bit as nonsensical as those that came before. The final sequence tries to put Jason away for keeps and calls upon the demons of hell for support. The last shot is an outrageous joke, which is perhaps what this franchise deserves.', '--Robert Horton', 'Set Contains:', \"The DVD contains both the R-rated and unrated versions of the picture, plus a commentary track with director Adam Marcus and screenwriter Dean Lorey, during which the two friends chortle frequently about the movie. Among the revelations: series producer Sean S. Cunningham asked them to get rid of Jason's hockey mask once and for all.\", '--Robert Horton', 'See more']\n{'Genre': 'Horror', 'Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Contributor': 'Erin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven CulpErin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven Culp   See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.5 x 0.4 inches; 2.4 Ounces', 'Item model number': 'MFR794043562624#VG', 'Director': 'Adam Marcus', 'Media Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 27, 2005', 'Actors': 'John D. LeMay, Kari Keegan, Erin Gray, Allison Smith, Steven Culp', 'Subtitles': 'English', 'Producers': 'Sean S. Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Dean Lorey, Jay Hoguely', 'Number of discs': '1'}\nFinished my Friday the 13th collection! Not by any means the best movie in the series, but I am a big horror fan and am trying to collect classic horror series.\nMy collection is complete!",
  "profile": "**User Summary:**\n\n- **Media Preferences:** Enjoys feel-good movies across action, adventure, and drama genres, while enthusiastically embracing horror and suspense narratives, particularly iconic and influential titles. The user is actively expanding their collection of classic horror series, indicating a strong commitment to this genre.\n- **Actor Affinity:** Prefers films featuring iconic actors like Robert Redford and Jane Fonda, alongside a growing admiration for talents within the horror genre, such as Robert Englund and Johnny Depp.\n- **Themes:** Engages with narratives that explore personal convictions, the human-animal bond, and increasingly delves into horror themes, showcasing a strong openness to darker storytelling.\n- **Emotional Engagement:** Seeks uplifting entertainment but is deeply drawn to suspenseful and horror films, consistently rating titles in this genre highly, which reflects a positive emotional engagement.\n- **Viewing Format:** Continues to favor physical media formats, particularly DVD, and is dedicated to building a comprehensive collection of horror films, with recent purchases further enriching this collection.\n- **Visual Aesthetics:** Values beautiful cinematography and scenic settings, which significantly enhance both uplifting and thrilling films.\n\nOverall, the user exhibits a refined taste for character-driven stories with strong performances that resonate emotionally and visually, while showing a heightened enthusiasm for collecting classic horror films, reinforcing their overall engagement with the genre.",
  "metrics": {
    "rouge1_f": 0.10127697049757815,
    "rouge2_f": 0.015866020273248127,
    "rougeL_f": 0.05195948921180096,
    "meteor": 0.02890197144575434,
    "bleu1": 2.0816311334443667e-05,
    "bleu2": 9.59921101632943e-06,
    "bleu3": 3.6624949691944618e-06,
    "bleu4": 9.67546494234746e-07,
    "bertscore_precision": 0.34833064675331116,
    "bertscore_recall": 0.4968010485172272,
    "bertscore_f1": 0.40952441096305847
  }
}