{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/12/09\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Roland Emmerich'], 'Producers': ['Bradley Fischer', 'Harald Kloser', 'James Vanderbilt', 'Larry Franco', 'Laeta Kalogridis', 'Roland Emmerich'], 'Starring': ['Channing Tatum', 'Jamie Foxx', 'Maggie Gyllenhaal'], 'Studio': ['Columbia Pictures']}\nReview Text: It's a fun movie. Almost like a take off of Olympus has fallen. But, with enough comedic quality to make it just campy enough to enjoy, without going overboard like 'Airplane'. All of the acting was well done. The special effects were great. The movie kind of reminded me of Independence Day. But, a little funnier in parts. Worth watching.\nReview Title: Kind of like Olympus has fallen. But campy like Independence Day.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['David Leitch'], 'Producers': ['Simon Kinberg', 'Ryan Reynolds', 'Lauren Shuler Donner'], 'Starring': ['Ryan Reynolds', 'Josh Brolin', 'Morena Baccarin'], 'Studio': ['20th Century Fox']}\nI enjoyed the first Dead Pool movie. So, had to see the sequel. It's just as good as the first. But, there was so much vulgarity in it, I felt a little let down that they had to go that far with it, to push the 'anti-hero' theme.\nA great sequel to the original Dead Pool. But, much more vulgarity.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français (France)'], 'Subtitles': ['English [CC]', 'Deutsch [UT]', 'Español (Latinoamérica)', 'Español (Latinoamérica) [CC]', 'Español (España) [CC]', 'Français [CC]', 'Italiano [CC]', 'Nederlands [CC]', 'Polski', 'Português', 'Português [SDH]', 'Svenska'], 'Directors': ['Steven Spielberg'], 'Producers': ['Adam Somner', 'Daniel Lupi', 'Chris Defaria', 'Bruce Berman', 'Donald De Line', 'Kristie Macosko Krieger', 'Steven Spielberg', 'Dan Farah'], 'Starring': ['Tye Sheridan', 'Olivia Cooke', 'Ben Mendelsohn'], 'Studio': ['WARNER BROS.']}\nI like the concept, how they integrated characters from so many of the classic video games. That is what really made the movie. Also, the movie itself was like a video game. That's fun for all you gamers. But, like they sometimes do, in Hollywood, they put all the best scenes in the trailer. So, there weren't any real great scenes left to impress you, as you watched the movie.\nThe best scenes were in the trailers, but it's still a good movie.\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Anthony Russo', 'Joe Russo'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr.', 'Chris Hemsworth', 'Mark Ruffalo'], 'Studio': ['Marvel']}\nIf you're an Avengers fan, and haven't seen this movie yet, it's a must see. I was a little lost, at first. Because I missed one or two of the movies leading up to this one. (How the hell did Thor lose his eye?) The cliffhanger at the end was both shocking and awesome. The directors did a good job. I'm fairly salivating for the next installment of the Avengers franchise!\nThe best Avengers movie yet!\n{'Content advisory': ['Nudity', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Tyler Perry'], 'Producers': ['Mark E. Swinton', 'Will Areu', 'Tyler Perry'], 'Starring': ['Tiffany Haddish', 'Tika Sumpter', 'Omari Hardwick'], 'Studio': ['Paramount Pictures']}\nI like the Madea character. I like the Madea movies. Of all the Tyler Perry movies, the comedies are the best. His dramas all fall flat on their face. His scripts are too predictable, characters too flat, story lines are like ruts on a muddy road. They follow a path, unwavering, till they get stuck... and.... die. Tiffany Haddish is great in this role. As are the other actors. They all make the movie tolerable. Some movies are larger than the actors in them. These actors are MUCH better than the movie they're in.\nIt's still a Tyler Perry movie.\nRear Window\nSuspense, Atmospheric, Compelling, Harrowing\n['A bored, injured photojournalist confined to his apartment has no choice but to busy himself with observing his neighbors. His voyeurism becomes detective work, however, when he witnesses a murder. Directed by Alfred Hitchcock.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Alfred Hitchcock'], 'Producers': ['Alfred Hitchcock'], 'Starring': ['James Stewart', 'Grace Kelly', 'Wendell Corey']}\nFirst, I didn't actually rent this video. Somehow, someone hacked my Prime account and rented it. I'm sure it was just a test, to see if they could. I have since changed my password. However, I CAN tell you that, if you haven't seen this movie before, it's one worth watching. It's one of Alfred Hitchcock's best films. And, Jimmy Stewart was perfect in the leading role. I've seen it a few times over the years and really enjoyed it. In fact, there was a remake about ten years ago. But, the first is still the best.\nJimmy Stewart and Alfred Hitchcock!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Roland Emmerich'], 'Producers': ['Bradley Fischer', 'Harald Kloser', 'James Vanderbilt', 'Larry Franco', 'Laeta Kalogridis', 'Roland Emmerich'], 'Starring': ['Channing Tatum', 'Jamie Foxx', 'Maggie Gyllenhaal'], 'Studio': ['Columbia Pictures']}\nIt's a fun movie. Almost like a take off of Olympus has fallen. But, with enough comedic quality to make it just campy enough to enjoy, without going overboard like 'Airplane'. All of the acting was well done. The special effects were great. The movie kind of reminded me of Independence Day. But, a little funnier in parts. Worth watching.\nKind of like Olympus has fallen. But campy like Independence Day.",
  "profile": "**Updated User Profile Summary:**\n\n- **Entertainment Preferences:** The user enjoys action-packed films, particularly those with comedic or anti-hero themes, and appreciates well-crafted sequels like the Avengers franchise. Their interest in suspenseful and atmospheric narratives has broadened to include classic cinema, particularly the works of Alfred Hitchcock. They value humor in films, as seen in their critiques of certain comedies, but remain critical of predictability in storytelling, favoring unique and innovative narratives.\n\n- **Content Sensitivity:** They seek engaging narratives while being sensitive to excessive vulgarity and inappropriate content. The user leans towards impactful themes without gratuitous elements and enjoys films with surprise and depth. \n\n- **Viewing Language:** Prefers English audio with audio descriptions for an inclusive viewing experience.\n\n- **Rating Behavior:** The user consistently rates media highly, averaging around 4.7, but has shown discernment in their recent ratings, reflecting their critical approach to narrative quality. Their appreciation for exceptional storytelling is evident in a recent perfect score for a classic film.\n\n- **Engagement Style:** Provides thoughtful reviews that highlight performances while critiquing direction and narrative quality. They emphasize character depth and innovative scripts, particularly in franchises and classic films, focusing on those that lead to compelling future developments. Recently, they expressed enjoyment for a film that balances humor and camp, indicating a liking for fun yet substantive cinema. \n\nOverall, the user prioritizes quality in films, valuing innovative storytelling and character dynamics while navigating content sensitivity, with a growing appreciation for classic films.",
  "metrics": {
    "rouge1_f": 0.184037558685446,
    "rouge2_f": 0.016933207902163686,
    "rougeL_f": 0.08075117370892018,
    "meteor": 0.05824521025803522,
    "bleu1": 0.010680662403780773,
    "bleu2": 0.004137078414628181,
    "bleu3": 0.0017280088794174218,
    "bleu4": 0.00047759299609768414,
    "bertscore_precision": 0.3760736584663391,
    "bertscore_recall": 0.4751075506210327,
    "bertscore_f1": 0.4198293387889862
  }
}