{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Pink Hair Brush\nReview Date: 2014/12/12\nStore: THZY\nProduct Description: ['FLAT IRON']\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 2.9 x 1.7 inches; 0.32 Ounces', 'Item model number': 'VZ-DETBR-PK', 'UPC': '609595109299', 'Manufacturer': 'THZY'}\nReview Text: Love this brush!  It really fits in your hand & feels so good on your scalp!  It does the job for detangling without ripping my hair out or breaking the ends off!  I laid the brush down & the next thing I knew, my cat was rubbing his chin on it!  A sure sign that it's a good brush!  I'm getting my granddaughter one because she uses a brush on her wet long hair.  She really needs to quit pulling & breaking her hair.  Thanks for a great product!\nReview Title: Love this brush\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Miracalis - Best Face Cream Moisturizer With Advanced Anti Aging Wrinkle Formula. Clinically Proven To Reduce Wrinkle Depth, Smooth Fine Lines & Soften Skin. Cruelty Free, Hypoallergenic\nMiracalis\n['* Face Moisturizer * Face Anti Aging * Deep Hydration Face Cream * Hydrating Anti Aging Moisturizer * Aging Cream * Hydration Cream For Face * Regenerating Day Cream * Face Moisturizing Cream * Facial Moisturizers Anti Aging * Anti Aging Facial Cream * Hydrating Moisturizer for Face * Deep Moisturizing Face Cream * Face Moisturizer Anti Aging * Moisturizing Cream Anti Aging * Peptide Face Cream * Moisturizer Facial Cream * Deep Face Moisturizer * Hydrating Facial Moisturizer * Best Face Moisturizer Anti Aging * Anti Aging Skin Care * Bare Mineral * Neck Moisturizer * Neck Cream * Skin Cream * Anti Aging Skin', 'Your Face Will Look Lovelier In Only 15 Days!', 'Reduces the depth of your facial wrinkles with daily use.', 'You will quickly look noticeably younger, healthier, and more attractive.', 'Simply apply Miracalis Anti-Aging Moisturizer Cream right after washing your face in the morning and again at night.', 'What About My Skin Type?', 'A safe, gentle, hypoallergenic formula that is tested and recommended for all 4 major skin types: Normal, Sensitive, Dry or Oily Skin', 'Your Shield Against The Signs Of Aging', \"Your skin is under daily attack - air pollution, the sun's harmful rays, germs and time itself all wear down your skin's natural barriers. The result is dry, cracked and tired looking skin.\", 'Our formula restores the two natural antioxidants (Vitamin E and Co-Enzyme Q10) that your skin needs to properly repair and maintain this barrier.', 'Your skin will look younger, be less sensitive. You will have healthier, attractive and glowing skin again.', '100% Satisfaction Guaranteed, Made in the USA']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.63 x 2.63 x 2.05 inches; 4 Ounces', 'Item model number': 'MIR-AAM001', 'UPC': '820103882309 794168056596', 'Manufacturer': 'Miracalis'}\n&#34;Great feeling cream! Cool going on. Liked the e-book on Anti-Aging tips. I'm working on my &#34;marionette&#34; aging lines starting to go down from my mouth. They actually look less noticeable. This may just be the cream to soften & MAYBE get rid of them! Keeping my fingers crossed-Thank you!&#34;\nCool going on\nPink Hair Brush\nTHZY\n['FLAT IRON']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 2.9 x 1.7 inches; 0.32 Ounces', 'Item model number': 'VZ-DETBR-PK', 'UPC': '609595109299', 'Manufacturer': 'THZY'}\nLove this brush!  It really fits in your hand & feels so good on your scalp!  It does the job for detangling without ripping my hair out or breaking the ends off!  I laid the brush down & the next thing I knew, my cat was rubbing his chin on it!  A sure sign that it's a good brush!  I'm getting my granddaughter one because she uses a brush on her wet long hair.  She really needs to quit pulling & breaking her hair.  Thanks for a great product!\nLove this brush",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest**: Anti-aging skincare products focused on facial hydration and wrinkle reduction, with an expanding interest in hair care tools.\n- **Key Attributes**: Prefers products that are hypoallergenic, cruelty-free, and clinically proven. Shows a preference for sensorial experiences in skincare and hair care.\n- **Usage Pattern**: Interested in applying face creams both morning and night for effective results, and also values ergonomic design in hair tools for comfortable use.\n- **Desired Outcomes**: Seeks visible improvements in skin appearance, such as reduced wrinkle depth and softer skin texture. Values quick results and formulations that restore the skin's natural barriers against aging, while also aiming for effective hair detangling without damage.\n- **User Experience**: Enjoyed supplementary resources like anti-aging tips and appreciates products that are gentle on the skin and hair. Engaged positively with hair care products that enhance the user experience.\n- **Feedback & Engagement**: Active feedback on product efficacy, particularly regarding specific concerns like marionette lines, and now includes a focus on effective hair brushes. Generally optimistic about achieving noticeable results from product use.\n\nOverall, the user demonstrates a commitment to anti-aging skincare and hair care tools, prioritizing hydration, efficacy, gentle formulations, ergonomic design, and ethical standards.",
  "metrics": {
    "rouge1_f": 0.2543859649122807,
    "rouge2_f": 0.04692082111436951,
    "rougeL_f": 0.11695906432748539,
    "meteor": 0.13162636205816758,
    "bleu1": 0.10764057737221118,
    "bleu2": 0.03139535563453916,
    "bleu3": 0.012191606067656622,
    "bleu4": 0.00639469117744939,
    "bertscore_precision": 0.38319888710975647,
    "bertscore_recall": 0.4448908865451813,
    "bertscore_f1": 0.41174688935279846
  }
}