{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Batman - The Motion Picture Anthology 1989-1997 [Blu-ray][Region Free] [2005]\nReview Date: 2021/12/19\nStore: Michael Keaton  (Actor),     Jack Nicholson  (Actor),     Joel Schumacher  (Director),     Tim Burton  (Director)    &                   1                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nAverage Rating: 4.7\nProduct Details: {'Format': 'Blu-ray, Import', 'Contributor': \"Kim Basinger, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Lee Batchler, Arnold Schwarzenegger, Jim Carrey, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, Daniel Waters, George Clooney, Sam Hamm, Bob Kane, Akiva Goldsman, Janet Scott Batchler, Val Kilmer, Tommy Lee Jones, Chris O'DonnellKim Basinger, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Lee Batchler, Arnold Schwarzenegger, Jim Carrey, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, Daniel Waters, George Clooney, Sam Hamm, Bob Kane, Akiva Goldsman, Janet Scott Batchler, Val…  See more\", 'Language': 'English', 'Runtime': '7 hours and 59 minutes'}\nReview Text: Great Blu Ray versions of the 80s-90s Batman movies. Worth it for Batman and Batman Returns (even if that means you have to buy Batman Forever and Batman and Robin).\nReview Title: Two great movies,, two...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Yojimbo (The Criterion Collection) [Blu-ray]\nToshir Mifune  (Actor),     Eijir Tno  (Actor),     Akira Kurosawa  (Director, Writer)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Thanks to perhaps the most indelible character in Akira Kurosawa's oeuvre, Yojimbo surpassed even Seven Samurai in popularity when it was released. The masterless samurai Sanjuro, who slyly manipulates two warring clans to his advantage.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, Black & White, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Takashi Shimura, Eijir Tno, Akira Kurosawa, Yko Tsukasa, Kamatari Fujiwara, Yosuke Natsuki, Ikio Sawamura, Hiroshi Tachikawa, Tatsuya Nakadai, Seizabur Kawazu, Ryz Kikushima, Toshir Mifune, Daisuke Kat, Isuzu YamadaTakashi Shimura, Eijir Tno, Akira Kurosawa, Yko Tsukasa, Kamatari Fujiwara, Yosuke Natsuki, Ikio Sawamura, Hiroshi Tachikawa, Tatsuya Nakadai, Seizabur Kawazu, Ryz Kikushima, Toshir Mifune, Daisuke Kat, Isuzu Yamada  See more', 'Language': 'Japanese', 'Runtime': '1 hour and 15 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '6639479', 'Director': 'Akira Kurosawa', 'Media Format': 'Blu-ray, Black & White, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 15 minutes', 'Release date': 'March 23, 2010', 'Actors': 'Toshir Mifune, Eijir Tno, Tatsuya Nakadai, Yko Tsukasa, Isuzu Yamada', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Writers': 'Akira Kurosawa, Ryz Kikushima', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy favorite Kurosawa film. Great story and acting, highly recommend.\nKurosawa at his best\nA Night to Remember (The Criterion Collection) [Blu-ray]\nKenneth More  (Actor),     Honor Blackman  (Actor),     Roy Ward Baker  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['On April 14, 1912, just before midnight, the unsinkable Titanic struck an iceberg. In less than three hours, it had plunged to the bottom of the sea, taking with it more than 1,500 of its 2,200 passengers. In his unforgettable rendering of Walter Lord’s book of the same name,', 'A Night to Remember', ', the acclaimed British director Roy Ward Baker (', 'Don’t Bother to Knock', ') depicts with sensitivity, awe, and a fine sense of tragedy the ship’s final hours. Featuring remarkably restrained performances,', 'A Night to Remember', 'is cinema’s subtlest, finest dramatization of this monumental twentieth-century catastrophe.']\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'Blu-ray', 'Contributor': 'Roy Ward Baker, Kenneth More, David McCallum, Tucker McGuire, Honor Blackman, Michael Goodliffe', 'Language': 'English', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'CRRN2133BR', 'Director': 'Roy Ward Baker', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 3 minutes', 'Release date': 'March 27, 2012', 'Actors': 'Kenneth More, Honor Blackman, Michael Goodliffe, David McCallum, Tucker McGuire', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nStill the beat film dramatization of the sinking of the RMS Titanic. Yes it doesn’t have the technical details of the final moment right (ship breaking up not confirmed until the reck was found well after this movie was made), but it’s a far better film than Titanic.\nBest Titanic Dramatization\nStar Trek Discovery - Season 3\nSonequa Martin-Green  (Actor),     Doug Jones  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Debuting in 2017, this exciting entry in the ever-popular sci-fi franchise takes place approximately 10 years before the original \"Star Trek\" series. Imprisoned for mutiny, disgraced Starfleet officer Michael Burnham (Sonequa Martin-Green) gets a chance at redemption when she\\'s recruited to join the crew of the U.S.S. Discovery on an important interstellar mission. Doug Jones, Shazad Latif, Anthony Rapp, Mary Wiseman, Jason Isaacs also star.13 episodes on 4 discs. 11 hrs. Widescreen; Soundtrack: English.']\n{'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'Subtitled', 'Contributor': 'Sonequa Martin-Green, Mary Wiseman, Anthony Rapp, Doug Jones', 'Language': 'English', 'Number Of Discs': '4', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '5.43 x 6.81 x 0.75 inches; 5.64 Ounces', 'Media Format': 'Subtitled', 'Run time': '11 hours and 7 minutes', 'Release date': 'July 20, 2021', 'Actors': 'Sonequa Martin-Green, Doug Jones, Mary Wiseman, Anthony Rapp', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nClearly the showrunners and writers got tired of having to stick with the TOS timeline since they moved Season 3 to a very different spot than Seasons 1-2. Still enjoyable with references to prior Star Trek series though.\nFun Third Season\nNeon Genesis Evangelion: The Complete Series [Blu-ray]\nHideaki ANNO  (Director, Writer),     Casey Mongillo  (Actor),     Carrie Keranen  (Actor)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['\"One of the most powerful, visually stunning, intellectually probing anime in the medium\\'s history\" – Allegra Frank, VoxIn 2015, Tokyo-3 is under attack from \"Angels,\" extraordinary beings that possess various special abilities. Multipurpose Humanoid Decisive Weapon, Evangelion is the only method to counter these Angels, and Shinji Ikari is chosen as its pilot. The battle for the fate of humankind has begun. Exactly what are the Angels? What is destined for the young pilots? And what will become of humanity?Presented on Blu-ray for the first time in North America, this groundbreaking, action-packed series from creator Hideaki ANNO has been hailed as one of the most important anime series of all time – a remarkable fusion of genres, and a powerful examination of the relationship between man and machine.The NEON GENESIS EVANGELION Standard Edition is an essential five-disc set that contains over five hours of bonus features, including animatics, TV commercials, music videos, and more.This set includes the original twenty-six episode television series, NEON GENESIS EVANGELION, as well as the films EVANGELION:DEATH (TRUE)', '2', 'and THE END OF EVANGELION.Please Note: The international re-release of NEON GENESIS EVANGELION does not contain \"FLY ME TO THE MOON.\"']\n{'Genre': 'Anime & Manga', 'Format': 'DVD', 'Contributor': 'Carrie Keranen, Casey Mongillo, Clifford Chapin, Stephanie McKeon, Ryan Bartley, Hideaki ANNO', 'Language': 'Japanese', 'Number Of Discs': '5', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5 x 0.5 inches; 5.28 Ounces', 'Director': 'Hideaki ANNO', 'Media Format': 'DVD', 'Run time': '13 hours', 'Release date': 'November 9, 2021', 'Actors': 'Casey Mongillo, Carrie Keranen, Stephanie McKeon, Ryan Bartley, Clifford Chapin', 'Studio': 'SHOUT! FACTORY', 'Writers': 'Hideaki ANNO', 'Country of Origin': 'USA', 'Number of discs': '5'}\nNeon Genesis is my favorite anime of all time. I've had a set of DVDs since I was a kid and am happy to now have the Blu Rays. The one drawback is this is the new dub done for Netflix not the original dub, so I guess I have to keep that DVD set around longer. If you want the original dub on Blu Ray you need to find the Special Edition set, which is obviously a lot more expensive. Still nice to have I just wish it had the better English dub.\nMy favorite anime\nSouth Park: The Complete Twenty-Second Season\nMatt Stone  (Actor),     Trey Parker  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Kids say the foulest-and funniest-things in Comedy Central\\'s off-the-wall, \"adults only\" animated series that quickly became a cult favorite. Join good-natured Stan Marsh, brainy Kyle Broflovski, big-boned miscreant Eric Cartman, and born-to-die Kenny McCormick as they struggle with grade-school life in the twisted town of South Park, Colorado. Voiced by series creators Trey Parker and Matt Stone, and April Stewart, Mary Kay Bergman, Isaac Hayes, Mona Marshall.10 episodes on 2 discs. 3 3/4 hrs. Widescreen; Soundtracks: English Dolby Digital 5.1, Dolby Digital stereo; Subtitles: English (SDH).']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Audio Description': 'English', 'Media Format': 'NTSC, Subtitled', 'Run time': '3 hours and 44 minutes', 'Release date': 'May 28, 2019', 'Actors': 'Matt Stone, Trey Parker', 'Subtitles': 'German, English', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAnother fun, entertaining season for South Park. I was happy also when they stopped with the ridiculously oversized DVD packaging.\nAnother fun season\nSouth Park: The Complete Twenty-Third Season\nMatt Stone  (Actor),     Trey Parker  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment\n[\"South Park returns for it's amazing 23rd season! Join Stan, Kyle, Cartman, Kenny, and Randy as they explore the wonders of the human biome, tackle the consequences of immigration, and get banned in China.\"]\n{'Genre': 'Comedy/Television, Animation', 'Format': 'Subtitled, NTSC', 'Contributor': 'Trey Parker, Matt Stone', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.21 Ounces', 'Media Format': 'Subtitled, NTSC', 'Run time': '3 hours and 40 minutes', 'Release date': 'June 23, 2020', 'Actors': 'Matt Stone, Trey Parker', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nAnother fun, entertaining season for South Park. I was happy also when they stopped with the ridiculously oversized DVD packaging.\nAnotehr entertaining season\nBatman - The Motion Picture Anthology 1989-1997 [Blu-ray][Region Free] [2005]\nMichael Keaton  (Actor),     Jack Nicholson  (Actor),     Joel Schumacher  (Director),     Tim Burton  (Director)    &                   1                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Format': 'Blu-ray, Import', 'Contributor': \"Kim Basinger, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Lee Batchler, Arnold Schwarzenegger, Jim Carrey, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, Daniel Waters, George Clooney, Sam Hamm, Bob Kane, Akiva Goldsman, Janet Scott Batchler, Val Kilmer, Tommy Lee Jones, Chris O'DonnellKim Basinger, Michael Keaton, Tim Burton, Joel Schumacher, Jack Nicholson, Lee Batchler, Arnold Schwarzenegger, Jim Carrey, Nicole Kidman, Danny DeVito, Michelle Pfeiffer, Daniel Waters, George Clooney, Sam Hamm, Bob Kane, Akiva Goldsman, Janet Scott Batchler, Val…  See more\", 'Language': 'English', 'Runtime': '7 hours and 59 minutes'}\nGreat Blu Ray versions of the 80s-90s Batman movies. Worth it for Batman and Batman Returns (even if that means you have to buy Batman Forever and Batman and Robin).\nTwo great movies,, two...",
  "profile": "**Updated User Profile Summary:**\n\n**Content Preferences:**\n- Maintains a strong affinity for classic cinema, notably Japanese film and the works of acclaimed director Akira Kurosawa, showcasing a penchant for high-quality storytelling and character development.\n- Recent engagement with a beloved anime series reflects a broadened appreciation for diverse genres, particularly those featuring intense narratives and rich character arcs, such as historical dramas, science fiction, and now, superhero films.\n- Enjoys animated comedies, evidenced by the acquisition of a recent series that balances humor with social commentary, further showcasing versatility in animated content.\n\n**Format and Quality:**\n- Prefers high-quality formats, especially Blu-ray, and demonstrates commitment to acquiring well-produced DVD releases. Values special editions and subtitled versions for enriched viewing experiences.\n\n**Rating Behavior:**\n- Consistently provides high ratings for content, often awarding 5-star evaluations. Recently, praised a collection of classic superhero films for their quality, aligning with the user's overall satisfaction with narrative progression and character exploration.\n\n**Community Engagement:**\n- Actively recommends films and shows to peers, valuing community feedback and the sharing of quality content, particularly highlighting favorites from both classic cinema and modern animated series.\n\nOverall, this user exemplifies sophisticated tastes in cinema, increasingly embracing superhero narratives, alongside a commitment to captivating storytelling across various genres, including humor with deeper themes.",
  "metrics": {
    "rouge1_f": 0.10131926121372033,
    "rouge2_f": 0.010565240359218173,
    "rougeL_f": 0.051715039577836415,
    "meteor": 0.030205731128177857,
    "bleu1": 0.00010708777572135594,
    "bleu2": 3.757305627485474e-05,
    "bleu3": 1.1284654394301989e-05,
    "bleu4": 3.4810172657285564e-06,
    "bertscore_precision": 0.35589998960494995,
    "bertscore_recall": 0.47909003496170044,
    "bertscore_f1": 0.408407598733902
  }
}