{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ombre Straight Bundles Human Hair 1B/30 Ombre Brown Brazilian Virgin Hair 3 Bundle Dark Roots Two Tones Hair Bundles 9A Grade Tangle Free Wet And Wavy Short Bundles 22 24 26 Inch\nReview Date: 2021/08/07\nStore: Glisdia\nAverage Rating: 1.0\nProduct Details: {'Brand': 'Glisdia', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '8.66 x 6.3 x 2.36 inches; 9.35 Ounces'}\nReview Text: The hair come very ugly like was used dont look New  the hair Is not Human is  synthetic hair i Loose my money is not human\nReview Title: Not Human. And Come like used\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "10A Brazilian Virgin Hair Straight Remy Human Hair Weave 4 Bundles 18 20 22 24inch 100% Unprocessed Brazilian Straight Hair Bundles Natural Black Color Straight Hair Extensions\n{'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '12 x 6.1 x 2.1 inches; 1.1 Pounds', 'UPC': '699747933483'}\nIt is not healthy, split ends and empty\nnot 10a  It's not healthy, split ends\n3 Bundles Afro Kinky Curly Weave Bundles Heat Resistant Fiber Hair Weave Color Black Synthetic Hair Extensions for Black Women(16' 18\" 20\" 1#)\nKAISI\n{'Brand': 'KAISI', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Style': 'Curly', 'Hair Type': 'Curly, Kinky'}\nGood hair\nGood\nHair Curly Wigs ,Lace Front Wigs Wave Synthetic Curly Bob Wigs Hair Replacement Wigs For Women Pre-Plucked Natural Hairline, 26 Inch\nOldPAPA\n{'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Brand': 'OldPAPA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.47 x 7.32 x 2.8 inches; 10.93 Ounces'}\ndont have lace not same like pic  look very cheap  and plastic\nnot same like pic\nOmbre Straight Bundles Human Hair 1B/30 Ombre Brown Brazilian Virgin Hair 3 Bundle Dark Roots Two Tones Hair Bundles 9A Grade Tangle Free Wet And Wavy Short Bundles 22 24 26 Inch\nGlisdia\n{'Brand': 'Glisdia', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '8.66 x 6.3 x 2.36 inches; 9.35 Ounces'}\nThe hair come very ugly like was used dont look New  the hair Is not Human is  synthetic hair i Loose my money is not human\nNot Human. And Come like used",
  "profile": "**User Summary:**\n\n- **Hair Preferences:** The user predominantly favors human hair products and straight styles for a natural look. However, they exhibit a cautious openness to curly textures, despite a recent disappointing experience with a curly wig.\n\n- **Quality Expectations:** With heightened standards for product quality, the user is particularly concerned about authenticity and durability. Their latest review highlights a serious issue with a purchase, confirming their expectation that products should not only be marketed as human hair but should also physically embody this quality.\n\n- **Detail Orientation:** The user values transparency and authenticity in product descriptions. Their critical feedback demonstrates a commitment to thoroughly examining new products and voicing concerns when discrepancies arise between marketing and actual item quality.\n\n- **Critical Reviewer:** Known for providing candid feedback, the user recently expressed strong dissatisfaction with a purchase that failed to meet their quality benchmarks. While they have recognized good quality before, their latest experience indicates an unwavering stance towards holding brands accountable.\n\n- **Length Preferences:** While the user continues to favor longer hair extensions for versatility, their recent interactions suggest a meticulous evaluation of new styles and lengths, ensuring they align with their established quality expectations.\n\nOverall, the user seeks high-quality, authentic hair products that meet their precise standards, remaining critical and discerning in their evaluations while navigating their preferences carefully.",
  "metrics": {
    "rouge1_f": 0.13173652694610777,
    "rouge2_f": 0.02004008016032064,
    "rougeL_f": 0.08782435129740518,
    "meteor": 0.06809848088004192,
    "bleu1": 0.07982081623686893,
    "bleu2": 0.004336871082801669,
    "bleu3": 0.0016446183721716984,
    "bleu4": 0.0010137067094751746,
    "bertscore_precision": 0.3425644040107727,
    "bertscore_recall": 0.3550061583518982,
    "bertscore_f1": 0.34867432713508606
  }
}