{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Synthetic Wig Long Black Curly Wig for Black Women None Lace Front Wigs Glueless Natural Color Machine Made Wigs Attached High-Density Heat Resistant （27 inches ）\nReview Date: 2021/08/21\nStore: dasaba\nProduct Description: ['? tips: our size will be smaller than usual. Please choose one size up. Enjoy your shopping! Today’s Deals ?.Save 3percent when you purchase 1,Save 5percent when you purchase 2,Save 10percent when you purchase 4. ? If you’re looking for a womens lingerie with NICE AND SOFT material. This teddies is a must-have addition to your wardrobe. We use high quality lace fabric, it is soft to the skin, durable but light weight. The satin ribbon in the middle has a silky feel and looks shiny. It will make you feel confident, comfortable, and sexy! ? Women sexy lingerie lace bralette bra and panty set.Show off your fiery femininity in this pretty bralette set, adjustable spaghetti straps.? Lace bralette bra and panty set, Sexy floral 2 pieces bra and panty set, Lace lingerie set, Sexy deep v-neck lingerie set, Daily bra for women.Lace babydoll lingerie is made of elastic lace mesh material, no-worries scratch the skin. ? Women lace babydoll dress, laungerie for woman, wedding lingerie for bride,longeray sexy for women, design with visible lace cup.']\nAverage Rating: 1.7\nProduct Details: {'Package Dimensions': '14.68 x 7.87 x 2.91 inches; 5.29 Ounces', 'UPC': '717217318186'}\nReview Text: is not same like pic  sent other very ugly\nReview Title: is not same like pic\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "10A Brazilian Virgin Hair Straight Remy Human Hair Weave 4 Bundles 18 20 22 24inch 100% Unprocessed Brazilian Straight Hair Bundles Natural Black Color Straight Hair Extensions\n{'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '12 x 6.1 x 2.1 inches; 1.1 Pounds', 'UPC': '699747933483'}\nIt is not healthy, split ends and empty\nnot 10a  It's not healthy, split ends\n3 Bundles Afro Kinky Curly Weave Bundles Heat Resistant Fiber Hair Weave Color Black Synthetic Hair Extensions for Black Women(16' 18\" 20\" 1#)\nKAISI\n{'Brand': 'KAISI', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Style': 'Curly', 'Hair Type': 'Curly, Kinky'}\nGood hair\nGood\nHair Curly Wigs ,Lace Front Wigs Wave Synthetic Curly Bob Wigs Hair Replacement Wigs For Women Pre-Plucked Natural Hairline, 26 Inch\nOldPAPA\n{'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Brand': 'OldPAPA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.47 x 7.32 x 2.8 inches; 10.93 Ounces'}\ndont have lace not same like pic  look very cheap  and plastic\nnot same like pic\nOmbre Straight Bundles Human Hair 1B/30 Ombre Brown Brazilian Virgin Hair 3 Bundle Dark Roots Two Tones Hair Bundles 9A Grade Tangle Free Wet And Wavy Short Bundles 22 24 26 Inch\nGlisdia\n{'Brand': 'Glisdia', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '8.66 x 6.3 x 2.36 inches; 9.35 Ounces'}\nThe hair come very ugly like was used dont look New  the hair Is not Human is  synthetic hair i Loose my money is not human\nNot Human. And Come like used\nSynthetic Wig Long Black Curly Wig for Black Women None Lace Front Wigs Glueless Natural Color Machine Made Wigs Attached High-Density Heat Resistant （27 inches ）\ndasaba\n['? tips: our size will be smaller than usual. Please choose one size up. Enjoy your shopping! Today’s Deals ?.Save 3percent when you purchase 1,Save 5percent when you purchase 2,Save 10percent when you purchase 4. ? If you’re looking for a womens lingerie with NICE AND SOFT material. This teddies is a must-have addition to your wardrobe. We use high quality lace fabric, it is soft to the skin, durable but light weight. The satin ribbon in the middle has a silky feel and looks shiny. It will make you feel confident, comfortable, and sexy! ? Women sexy lingerie lace bralette bra and panty set.Show off your fiery femininity in this pretty bralette set, adjustable spaghetti straps.? Lace bralette bra and panty set, Sexy floral 2 pieces bra and panty set, Lace lingerie set, Sexy deep v-neck lingerie set, Daily bra for women.Lace babydoll lingerie is made of elastic lace mesh material, no-worries scratch the skin. ? Women lace babydoll dress, laungerie for woman, wedding lingerie for bride,longeray sexy for women, design with visible lace cup.']\n{'Package Dimensions': '14.68 x 7.87 x 2.91 inches; 5.29 Ounces', 'UPC': '717217318186'}\nis not same like pic  sent other very ugly\nis not same like pic",
  "profile": "**User Summary:**\n\n- **Hair Preferences:** The user predominantly favors human hair products and straight styles for a natural look, but they have shown a cautious openness to curly textures. However, their recent experience with a synthetic curly wig has led to significant disappointment, reinforcing their preference for authenticity in hair products.\n\n- **Quality Expectations:** The user maintains elevated standards for product quality and concerns about authenticity and durability remain paramount. Their latest purchase ended in dissatisfaction, highlighting their expectation that products should match their marketing claims regarding quality.\n\n- **Detail Orientation:** The user values transparency in product descriptions and is dedicated to meticulous evaluations of new products. Their critical feedback reflects a commitment to voice concerns when discrepancies occur between advertised and actual product quality.\n\n- **Critical Reviewer:** Known for providing candid and direct feedback, the user’s latest negative experience with a faux product underlines their commitment to holding brands accountable for their claims. Previous experiences of good quality are overshadowed by recent disappointments.\n\n- **Length Preferences:** While still favoring longer hair extensions for versatility, the user is now more diligent in assessing new styles and lengths to ensure alignment with their stringent quality expectations.\n\nOverall, the user seeks high-quality, authentic hair products that adhere to their precise standards while remaining assertive and discerning in their evaluations. They are navigating their preferences with increasing caution after recent experiences.",
  "metrics": {
    "rouge1_f": 0.17379679144385027,
    "rouge2_f": 0.01876675603217158,
    "rougeL_f": 0.07486631016042782,
    "meteor": 0.07967920760604799,
    "bleu1": 0.061120807670903825,
    "bleu2": 0.010349866929778281,
    "bleu3": 0.0021120052993985677,
    "bleu4": 0.0009549217694672425,
    "bertscore_precision": 0.3290557861328125,
    "bertscore_recall": 0.36888569593429565,
    "bertscore_f1": 0.3478342294692993
  }
}