{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 180% Density Synthetic Lace Front Wigs Silky Straight Heat Resistant Fiber High Temperature Replacement Wigs L Part Straight Black Lace Front Wig for Women\nReview Date: 2021/10/21\nStore: Wonder Girl\nAverage Rating: 3.3\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'Wonder Girl', 'Package Dimensions': '14.06 x 8.5 x 4.06 inches; 11.99 Ounces'}\nReview Text: sent curly cheap not lace wig  very disappoint\nReview Title: sent not lace wig\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "10A Brazilian Virgin Hair Straight Remy Human Hair Weave 4 Bundles 18 20 22 24inch 100% Unprocessed Brazilian Straight Hair Bundles Natural Black Color Straight Hair Extensions\n{'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '12 x 6.1 x 2.1 inches; 1.1 Pounds', 'UPC': '699747933483'}\nIt is not healthy, split ends and empty\nnot 10a  It's not healthy, split ends\n3 Bundles Afro Kinky Curly Weave Bundles Heat Resistant Fiber Hair Weave Color Black Synthetic Hair Extensions for Black Women(16' 18\" 20\" 1#)\nKAISI\n{'Brand': 'KAISI', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Style': 'Curly', 'Hair Type': 'Curly, Kinky'}\nGood hair\nGood\nHair Curly Wigs ,Lace Front Wigs Wave Synthetic Curly Bob Wigs Hair Replacement Wigs For Women Pre-Plucked Natural Hairline, 26 Inch\nOldPAPA\n{'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Brand': 'OldPAPA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.47 x 7.32 x 2.8 inches; 10.93 Ounces'}\ndont have lace not same like pic  look very cheap  and plastic\nnot same like pic\nOmbre Straight Bundles Human Hair 1B/30 Ombre Brown Brazilian Virgin Hair 3 Bundle Dark Roots Two Tones Hair Bundles 9A Grade Tangle Free Wet And Wavy Short Bundles 22 24 26 Inch\nGlisdia\n{'Brand': 'Glisdia', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '8.66 x 6.3 x 2.36 inches; 9.35 Ounces'}\nThe hair come very ugly like was used dont look New  the hair Is not Human is  synthetic hair i Loose my money is not human\nNot Human. And Come like used\nSynthetic Wig Long Black Curly Wig for Black Women None Lace Front Wigs Glueless Natural Color Machine Made Wigs Attached High-Density Heat Resistant （27 inches ）\ndasaba\n['? tips: our size will be smaller than usual. Please choose one size up. Enjoy your shopping! Today’s Deals ?.Save 3percent when you purchase 1,Save 5percent when you purchase 2,Save 10percent when you purchase 4. ? If you’re looking for a womens lingerie with NICE AND SOFT material. This teddies is a must-have addition to your wardrobe. We use high quality lace fabric, it is soft to the skin, durable but light weight. The satin ribbon in the middle has a silky feel and looks shiny. It will make you feel confident, comfortable, and sexy! ? Women sexy lingerie lace bralette bra and panty set.Show off your fiery femininity in this pretty bralette set, adjustable spaghetti straps.? Lace bralette bra and panty set, Sexy floral 2 pieces bra and panty set, Lace lingerie set, Sexy deep v-neck lingerie set, Daily bra for women.Lace babydoll lingerie is made of elastic lace mesh material, no-worries scratch the skin. ? Women lace babydoll dress, laungerie for woman, wedding lingerie for bride,longeray sexy for women, design with visible lace cup.']\n{'Package Dimensions': '14.68 x 7.87 x 2.91 inches; 5.29 Ounces', 'UPC': '717217318186'}\nis not same like pic  sent other very ugly\nis not same like pic\n180% Density Synthetic Lace Front Wigs Silky Straight Heat Resistant Fiber High Temperature Replacement Wigs L Part Straight Black Lace Front Wig for Women\nWonder Girl\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'Wonder Girl', 'Package Dimensions': '14.06 x 8.5 x 4.06 inches; 11.99 Ounces'}\nsent curly cheap not lace wig  very disappoint\nsent not lace wig",
  "profile": "**User Summary:**\n\n- **Hair Preferences:** The user continues to prefer human hair products and straight styles for a natural appearance but remains warily open to curly textures. Their latest experience with a synthetic curly wig has led to frustration, reinforcing a strong preference for authentic hair products.\n\n- **Quality Expectations:** The user maintains high standards for product quality, particularly regarding authenticity and durability. Recently, they encountered significant dissatisfaction, which has heightened their scrutiny towards brands' marketing claims.\n\n- **Detail Orientation:** Transparency in product descriptions is crucial for the user, who carefully evaluates new purchases. They are increasingly critical of discrepancies between advertised and actual product quality, demonstrating a commitment to holding brands accountable.\n\n- **Critical Reviewer:** Known for their straightforward feedback, the user’s recent negative experience with a misleading product has intensified their resolve to be discerning. Previous positive experiences are now overshadowed by a focus on recent disappointments.\n\n- **Length Preferences:** While favoring longer hair extensions for versatility, the user is now more cautious when assessing new styles and lengths, ensuring they align with their stringent quality expectations.\n\nOverall, the user is dedicated to seeking out high-quality, authentic hair products that meet their precise standards, exhibiting increased vigilance in their evaluations following recent experiences.",
  "metrics": {
    "rouge1_f": 0.15656565656565655,
    "rouge2_f": 0.020253164556962022,
    "rougeL_f": 0.07070707070707072,
    "meteor": 0.06805107338291007,
    "bleu1": 0.041676873260446556,
    "bleu2": 0.00681893086604737,
    "bleu3": 0.0013757516030672952,
    "bleu4": 0.0006185481941051575,
    "bertscore_precision": 0.32728320360183716,
    "bertscore_recall": 0.3884807825088501,
    "bertscore_f1": 0.3552657961845398
  }
}