{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hair Curly Wigs ,Lace Front Wigs Wave Synthetic Curly Bob Wigs Hair Replacement Wigs For Women Pre-Plucked Natural Hairline, 26 Inch\nReview Date: 2021/07/25\nStore: OldPAPA\nAverage Rating: 2.5\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Brand': 'OldPAPA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.47 x 7.32 x 2.8 inches; 10.93 Ounces'}\nReview Text: dont have lace not same like pic  look very cheap  and plastic\nReview Title: not same like pic\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "10A Brazilian Virgin Hair Straight Remy Human Hair Weave 4 Bundles 18 20 22 24inch 100% Unprocessed Brazilian Straight Hair Bundles Natural Black Color Straight Hair Extensions\n{'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '12 x 6.1 x 2.1 inches; 1.1 Pounds', 'UPC': '699747933483'}\nIt is not healthy, split ends and empty\nnot 10a  It's not healthy, split ends\n3 Bundles Afro Kinky Curly Weave Bundles Heat Resistant Fiber Hair Weave Color Black Synthetic Hair Extensions for Black Women(16' 18\" 20\" 1#)\nKAISI\n{'Brand': 'KAISI', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Style': 'Curly', 'Hair Type': 'Curly, Kinky'}\nGood hair\nGood\nHair Curly Wigs ,Lace Front Wigs Wave Synthetic Curly Bob Wigs Hair Replacement Wigs For Women Pre-Plucked Natural Hairline, 26 Inch\nOldPAPA\n{'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Brand': 'OldPAPA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.47 x 7.32 x 2.8 inches; 10.93 Ounces'}\ndont have lace not same like pic  look very cheap  and plastic\nnot same like pic",
  "profile": "**User Summary:**\n\n- **Hair Preferences:** The user generally favors human hair products and prefers straight styles for a natural appearance. However, they have shown some openness to curly textures, as evidenced by their recent interest in various curly products, though their latest experience with a curly wig was disappointing.\n\n- **Quality Expectations:** The user's high standards regarding product quality remain a priority, with a particular focus on health and durability. Their recent review expresses dissatisfaction with a product that did not meet their expectations, highlighting issues such as lack of authenticity and quality that resembles plastic rather than human hair.\n\n- **Detail Orientation:** Transparency and authenticity in product descriptions are crucial for the user. Their negative review indicates a strong commitment to evaluating new products thoroughly and voicing concerns when items do not align with their standards.\n\n- **Critical Reviewer:** The user has a history of providing critical feedback, with their recent rating reflecting strong dissatisfaction. While they have recognized good quality in the past, their latest experience illustrates that they are unafraid to express disappointment when products fail to deliver as promised.\n\n- **Length Preferences:** Although the user continues to prefer longer hair extensions for versatility, the recent negative interaction suggests a careful approach to new styles and lengths, ensuring they meet their quality benchmarks.\n\nOverall, the user seeks high-quality, authentic products that align with their established preferences while remaining critical and discerning in their evaluations.",
  "metrics": {
    "rouge1_f": 0.1371158392434988,
    "rouge2_f": 0.023752969121140142,
    "rougeL_f": 0.07092198581560283,
    "meteor": 0.08835196538045438,
    "bleu1": 0.09688581314878894,
    "bleu2": 0.005800078218725113,
    "bleu3": 0.0022715829555389703,
    "bleu4": 0.0014228363202525333,
    "bertscore_precision": 0.34941571950912476,
    "bertscore_recall": 0.34583401679992676,
    "bertscore_f1": 0.34761562943458557
  }
}