{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Beauhair Straight Human Hair Bundles 100% Unprocessed Brazilian Straight Virgin Human Hair 4 Bundles Human Hair Extensions Natural Black Color(16 18 20 22)\nReview Date: 2022/01/19\nStore: Beauhair\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Beauhair', 'Material': 'Human Hair', 'Style': '16 18 20 22', 'Hair Type': 'Curly, Straight', 'Package Dimensions': '10.3 x 9.1 x 1.8 inches; 14.39 Ounces'}\nReview Text: the worst Hair i buy  Only 1 week and Tángle like crazy  dont buy this\nReview Title: the worst Hair i buy\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "10A Brazilian Virgin Hair Straight Remy Human Hair Weave 4 Bundles 18 20 22 24inch 100% Unprocessed Brazilian Straight Hair Bundles Natural Black Color Straight Hair Extensions\n{'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '12 x 6.1 x 2.1 inches; 1.1 Pounds', 'UPC': '699747933483'}\nIt is not healthy, split ends and empty\nnot 10a  It's not healthy, split ends\n3 Bundles Afro Kinky Curly Weave Bundles Heat Resistant Fiber Hair Weave Color Black Synthetic Hair Extensions for Black Women(16' 18\" 20\" 1#)\nKAISI\n{'Brand': 'KAISI', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Style': 'Curly', 'Hair Type': 'Curly, Kinky'}\nGood hair\nGood\nHair Curly Wigs ,Lace Front Wigs Wave Synthetic Curly Bob Wigs Hair Replacement Wigs For Women Pre-Plucked Natural Hairline, 26 Inch\nOldPAPA\n{'Material': 'Human Hair', 'Hair Type': 'Curly', 'Style': 'Curly', 'Brand': 'OldPAPA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.47 x 7.32 x 2.8 inches; 10.93 Ounces'}\ndont have lace not same like pic  look very cheap  and plastic\nnot same like pic\nOmbre Straight Bundles Human Hair 1B/30 Ombre Brown Brazilian Virgin Hair 3 Bundle Dark Roots Two Tones Hair Bundles 9A Grade Tangle Free Wet And Wavy Short Bundles 22 24 26 Inch\nGlisdia\n{'Brand': 'Glisdia', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '8.66 x 6.3 x 2.36 inches; 9.35 Ounces'}\nThe hair come very ugly like was used dont look New  the hair Is not Human is  synthetic hair i Loose my money is not human\nNot Human. And Come like used\nSynthetic Wig Long Black Curly Wig for Black Women None Lace Front Wigs Glueless Natural Color Machine Made Wigs Attached High-Density Heat Resistant （27 inches ）\ndasaba\n['? tips: our size will be smaller than usual. Please choose one size up. Enjoy your shopping! Today’s Deals ?.Save 3percent when you purchase 1,Save 5percent when you purchase 2,Save 10percent when you purchase 4. ? If you’re looking for a womens lingerie with NICE AND SOFT material. This teddies is a must-have addition to your wardrobe. We use high quality lace fabric, it is soft to the skin, durable but light weight. The satin ribbon in the middle has a silky feel and looks shiny. It will make you feel confident, comfortable, and sexy! ? Women sexy lingerie lace bralette bra and panty set.Show off your fiery femininity in this pretty bralette set, adjustable spaghetti straps.? Lace bralette bra and panty set, Sexy floral 2 pieces bra and panty set, Lace lingerie set, Sexy deep v-neck lingerie set, Daily bra for women.Lace babydoll lingerie is made of elastic lace mesh material, no-worries scratch the skin. ? Women lace babydoll dress, laungerie for woman, wedding lingerie for bride,longeray sexy for women, design with visible lace cup.']\n{'Package Dimensions': '14.68 x 7.87 x 2.91 inches; 5.29 Ounces', 'UPC': '717217318186'}\nis not same like pic  sent other very ugly\nis not same like pic\n180% Density Synthetic Lace Front Wigs Silky Straight Heat Resistant Fiber High Temperature Replacement Wigs L Part Straight Black Lace Front Wig for Women\nWonder Girl\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'Wonder Girl', 'Package Dimensions': '14.06 x 8.5 x 4.06 inches; 11.99 Ounces'}\nsent curly cheap not lace wig  very disappoint\nsent not lace wig\ndaji hair Straight Wave Ombre Human 3 Bundles P4/27 Two Tone Brazilian Virgin Extensions Double Weft Highlight 100G/Pcs Light Brown Mixed Blonde Weave (22 24 26Inch)\ndaji hair\n[\"Choose Daji Hair,Choose Rest Assured！We Are Located In Xuchang,Henan Province,China'S Factory;Global Wig Base,With More Than 15 Years Of Wig Production Experience!The Main Products Of The Factory Are Hair Bundles,Closure &Front,Hair Wigs,Heandband Wgis,Etc Hair Material:100% Unprocessed Brazilian Virgin Highlight Human Hair Ombre Bundles Material Grade: 12A Virgin Human Hair 3 Bundles. Hair Weft: Machine Double Weft Hair Advantage:Nature Look,Suit for Any Occasion Hair Color: Two Tone #P4/27(Light Brown Mixed Blonde);Suitable Dyed and Bleached to Any Colors. Hair Weight&Length: 95-100g/Bundle(3.3-3.5oz),8-26 inches (Please stretch the hair to straight and then measure). Return Policy: No Reason to Return No Time Limited (The Hair without Used or Damage, as new as you received). Warm Tips:\", 'If There Is Any Requirement, Please Feel Free To Contact Us Before You Place Orders.We Will Send the Wig In Medium Cap Size and Medium Brown Cap Color If Not Receive Change Message', \"QA: Q1:Is this 100% Human Hair? A:Yes.Testing by BURNING- Human hair will show white smoke while burning and then turn to ash; Synthetic hair will show black smoke and will be a sticky ball after burning. Q2:Hair Smell? A:100% chemical free,it may have local shampoo smell,but can be removed by cowashing with shampoo and conditioner. Q3: How long does it last? A:This hair can last for long time depending on how you maintain it.Usually my customers use for more than a year.Contact Us To Explain The Suitable Use Method For You! Q4:How Many Bundles Do I need for A Full Head? A:3 bundles is enough for the Full Head. If You Like Thicker or Need Longer Hair, It's Better to Wear one More Bundle.\"]\n{'Brand': 'daji hair', 'Material': 'Human Hair', 'Extension Length': '26 Inches', 'Hair Type': 'Straight Wave', 'Material Feature': 'Natural', 'Package Dimensions': '11.81 x 7.87 x 1.57 inches; 0.35 Ounces', 'UPC': '735209922005'}\nNot full length very empty Have Many hair short , 3 bundles look like 1 bundles\nNot full length very empty\nTanRain Wig female long wave curly all bangs synthetic wig natural realistic heat clothing party size a variety of colors available wig black women (Black mix Light Brown)\nTanRain\n{'Material': 'Human Hair', 'Item Dimensions LxWxH': '20 x 8 x 20 inches', 'Hair Type': 'Curly,Wavy', 'Style': 'Modern', 'Brand': 'TanRain', 'Product Dimensions': '20 x 8 x 20 inches; 8.47 Ounces', 'Item model number': '68', 'UPC': '619191646715'}\nNot same\nNot same\nBeauhair Straight Human Hair Bundles 100% Unprocessed Brazilian Straight Virgin Human Hair 4 Bundles Human Hair Extensions Natural Black Color(16 18 20 22)\nBeauhair\n{'Brand': 'Beauhair', 'Material': 'Human Hair', 'Style': '16 18 20 22', 'Hair Type': 'Curly, Straight', 'Package Dimensions': '10.3 x 9.1 x 1.8 inches; 14.39 Ounces'}\nthe worst Hair i buy  Only 1 week and Tángle like crazy  dont buy this\nthe worst Hair i buy",
  "profile": "**User Summary:**\n\n- **Hair Preferences:** The user maintains a strong preference for human hair products and straight styles that deliver a natural look. Their dissatisfaction with previous products has led to an increased caution regarding curly textures and claims about authenticity.\n\n- **Quality Expectations:** The user upholds high standards for product quality, particularly emphasizing authenticity and durability. Their recent negative experience with hair extensions has deepened their skepticism of brand marketing and heightened scrutiny toward misleading claims.\n\n- **Detail Orientation:** Transparency in product descriptions is crucial for the user, who now meticulously evaluates every potential purchase. They exhibit critical assessment of discrepancies between advertisements and actual product performance, reflecting a strong commitment to holding brands accountable.\n\n- **Critical Reviewer:** Following a disappointing purchase, the user approaches reviews with heightened assertiveness. Their feedback focuses on accurately communicating strict expectations, aiming to guide other consumers against misleading products.\n\n- **Length Preferences:** While still favoring longer hair extensions for versatility, the user has become more vigilant in assessing styles and lengths to ensure compliance with their rigorous quality standards. \n\nOverall, the user is dedicated to sourcing high-quality, authentic hair products that align with their precise criteria, demonstrating an amplified cautiousness and vigilance in evaluations following recent unsatisfactory experiences.",
  "metrics": {
    "rouge1_f": 0.11161387631975868,
    "rouge2_f": 0.013595166163141995,
    "rougeL_f": 0.05429864253393665,
    "meteor": 0.042513691712438115,
    "bleu1": 0.0029750551160163253,
    "bleu2": 0.00033538070087557397,
    "bleu3": 7.529955543144214e-05,
    "bleu4": 3.571505218562314e-05,
    "bertscore_precision": 0.3281853497028351,
    "bertscore_recall": 0.4187462031841278,
    "bertscore_f1": 0.3679758310317993
  }
}