{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Magnetic Silicone Wrist Strap Bracelet to Hold Metal Bobby Pins and Clips in Easy Reach\nReview Date: 2019/09/27\nStore: PERFEHAIR\nAverage Rating: 4.7\nProduct Details: {'Brand': 'PERFEHAIR', 'Hair Type': 'All', 'Color': 'Black', 'Age Range (Description)': 'Adult', 'Style': 'Bobby Pin Bracelet', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.84 x 0.59 x 2.36 inches; 2.88 Ounces', 'Item model number': 'ST002-1', 'UPC': '705586581638', 'Manufacturer': 'Perfehair'}\nReview Text: It's a really great idea, really great concept, and works very well. The slap on strap is a smart idea\nReview Title: Nice\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Sunshiny Reusable Hair Colouring Hairdressing Highlighting Dye Cap Hook Frosting Random Color\n{}\nNice professional quality product\nNice\n8oz Clear Glass Refillable Spray Bottles with Reusable Chalk Labels (2 Pack)\n{'Color': 'Clear', 'Material': 'Glass', 'Capacity': '8 Ounces', 'Number of Items': '2', 'Item Dimensions LxWxH': '5.5 x 3 x 8 inches'}\nCute glass bottles; love the super fine mist the sprayers give off and the reusable labels are a nice touch\nGreat\nMoYo Natural Labs 32 oz Refillable Bottles, Empty Travel Containers with Flip Caps, BPA Free HDPE Plastic Squeezable Toiletry/Cosmetics Bottle (Pack of 2, HDPE Translucent White)\nMoYo Natural Labs\n['MoYo Natural Labs HDPE plastic bottle 32 OZ with flip cap BPA free, made in the USA and will not leak 32 oz bottle HDPE Translucent White.MoYo Natural Labs HDPE bottles and shampoo containers are built to be re-used often, resisting rot and other chemicals. HDPE creates no harmful emissions during its production or during use.At 32 oz, these squeezable, refillable, leakproof bottles guarantee you are buying the best no leak secure flip cap that stays shut when you need it to.Made of HDPE #2 plastic that\\'s designed to last, our 32 oz industrial containers are perfect for all of your liquid toiletries, essential oil and beauty cosmetics. The benefits of HDPE EMPTY SHAMPOO BOTTLE Plastic: - HDPE bottles meet FDA guidelines with long-lasting non-toxic plastic for your empty shampoo bottle. - Feel safe and secure with reusing your bottles over a long period of time. - Large neck making it easy to fill the bottle. - Leak-proof bottle design prevents wasting any of your valuable toiletries. - Perfect for all of your toiletry or food or liquid items that you wish to store as no spill bottles in your luggage. - OUR 32 OZ CONTAINER PROMISE! If these all-purpose industrial bottles from MoYo Natural Labs become compromised or leak in the first year, we\\'ll replace your small containers, even if it is your fault. We\\'re that confident that you\\'ll love your new large 32 oz flip cap bottle and will continue to use MoYo Natural Labs empty liquid dispenser in the future. CLICK the \"Add to Cart\" button to order the MoYo Natural Labs Flip Top HDPE 32 oz food sauce bottle 32 oz container today!']\n{'Brand': 'MoYo Natural Labs', 'Material': 'Plastic', 'Color': 'Natural', 'Capacity': '2 Pounds', 'Special Feature': 'Leak Proof', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6.2 x 3.1 x 6.2 inches; 0.64 Ounces', 'Item model number': 'B01M1B2TRO', 'UPC': '634746879066', 'Manufacturer': 'MoYo Natural Labs'}\nGood quality bottles that work well for storing liquids\nGreat\nSegbeauty empty bottle 082\nSegbeauty\n{'Brand': 'Segbeauty', 'Color': 'White', 'Material': 'Pet', 'Capacity': '160 Milliliters', 'Recommended Uses For Product': 'Water,Pet', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8 x 2 x 2 inches; 3.36 Ounces', 'Item model number': 'AM-160083-A02-JPN', 'UPC': '612520575960'}\nAmazing how it has a much longer spray on one pump than a normal spray bottle. Really cool.\nGreat\nMoYo Natural Labs 32 oz Refillable Bottles, Empty Travel Containers with Toggle Caps, One Quart Travel Bottles, BPA Free PET Squeezable Toiletry/Cosmetics Bottle (Pack of 2, Clear)\nMoYo Natural Labs\n['MoYo Natural Labs commercial grade PET plastic 32 OZ CONTAINER with toggle top, BPA free, made in the USA and will not leak 32 oz bottle PET. MoYo Natural Labs PET bottles and shampoo containers are built to be re-used often, resisting rot and other chemicals. PET creates no harmful emissions during its production or during use.At 32 oz, these squeezable, refillable, leakproof bottles guarantee you are buying the best no leak secure. Made of PET #1 plastic that\\'s designed to last, our 32 oz industrial containers are perfect for all of your liquid toiletries, essential oil and beauty cosmetics. The benefits of PET EMPTY SHAMPOO BOTTLE Plastic: - PET bottles meet FDA guidelines with long-lasting non-toxic plastic for your empty shampoo 32 oz bottle. - Feel safe and secure with reusing your bottles over a long period of time. - Large neck making it easy to fill the bottle. - Leak-proof bottle design prevents wasting any of your valuable toiletries. - Perfect for all of your toiletry or food or liquid items that you wish to store as no spill bottles in your luggage. - OUR 32 OZ CONTAINER PROMISE! If these all-purpose industrial bottles from MoYo Natural Labs become compromised or leak in the first year, we\\'ll replace your small containers, even if it is your fault. We\\'re that confident that you\\'ll love your new 32 oz dripping bottle and will continue to use MoYo Natural Labs empty liquid dispenser in the future. CLICK the \"Add to Cart\" button to order the MoYo Natural Labs PET 32 oz food sauce bottle 32-ounce all-purpose container today!']\n{'Brand': 'MoYo Natural Labs', 'Material': 'Polyethylene Terephthalate', 'Capacity': '2 Pounds', 'Special Feature': 'Wide Mouth, Lightweight, Leak Proof', 'Age Range (Description)': 'Any Age Group', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.39 x 6.3 x 3.27 inches; 4.66 Ounces', 'Item model number': '32OZ-BUL-CLR-TP-PET-TG-WHT-PK2', 'UPC': '669002975077', 'Manufacturer': 'MoYo Natural Labs'}\nNice and thick bottles for so many purposes\nGreat\nMoYo Natural Labs 16 oz Travel Containers, Empty Shampoo Bottles with Flip Caps, BPA Free HDPE Plastic Squeezable Toiletry/Cosmetics Bottle (Pack of 1, HDPE Translucent White)\nMoYo Natural Labs\n['MoYo Natural Labs, commercial grade HDPE plastic 16 OZ CONTAINER BPA free and made in the USA leak proof industrial container bulk set.MoYo Natural Labs HDPE bottles and shampoo containers are built to be re-used often, resisting rot and other chemicals. HDPE creates no harmful emissions during its production or during use.At 16 oz, (473 ml) these squeezable, refillable, leakproof bottles guarantee you are buying the best no leak secure flip cap that stays shut when you need it to. Made of HDPE #2 plastic that\\'s designed to last, our 16 oz industrial containers are perfect for all of your liquid toiletries, essential oil and beauty cosmetics. The benefits of HDPE EMPTY SHAMPOO BOTTLE Plastic: - HDPE bottles meet FDA guidelines with long-lasting non-toxic plastic for your empty shampoo bottle. - Feel safe and secure with reusing your bottles over a long period of time. - Large neck making it easy to fill the bottle. - Leak-proof bottle design prevents wasting any of your valuable toiletries. - Perfect for all of your toiletry or food or liquid items that you wish to store as no spill bottles in your luggage - OUR 16 OZ CONTAINER PROMISE! If these lotion bottles from MoYo Natural Labs become compromised or leak in the first year, we\\'ll replace your small containers, even if it is your fault. We\\'re that confident that you\\'ll love your new large 16 oz flip cap bottle and will continue to use MoYo Natural Labs empty liquid dispenser in the future. CLICK the \"Add to Cart\" button to order the MoYo Natural Labs HDPE 16 oz empty shampoo and conditioner bottle 16-ounce flip cap no leak container today!']\n{'Brand': 'MoYo Natural Labs', 'Material': 'Plastic', 'Color': 'Translucent White', 'Capacity': '16 Ounces', 'Special Feature': 'Leak Proof', 'Age Range (Description)': 'Adult', 'Recommended Uses For Product': 'Water', 'Number of Items': '1', 'Reusability': 'Reusable', 'Unit Count': '16.00 Count', 'Manufacturer': 'MoYo Natural Labs', 'Part Number': 'B06Y2859BH', 'Item Weight': '0.493 ounces', 'Product Dimensions': '3.5 x 3.5 x 8.25 inches', 'Item model number': 'B06Y2859BH', 'Is Discontinued By Manufacturer': 'No', 'Size': 'Pack of 1', 'Pattern': 'Solid', 'Item Package Quantity': '1', 'Special Features': 'Leak Proof', 'Batteries Included?': 'No', 'Batteries Required?': 'No', 'Date First Available': 'April 4, 2017'}\nNice thick bottles for multi purposes\nNice\nWide Tooth Comb,Carbon Fiber Hair Comb 100% Anti static 230℃ Heat Resistant Round Teeth Bristle Salon Combs for Blowing Dry Smoothing All Hair Types,Remove Knots (Paddle Brush R93201B-new)\nVON SHARTE\n['Refreshing yourself from a comb scalp massage to start a new day！Come back to do a comb massage to ease the fatigue of the day before your sleeping.', 'Specification:', 'WEIGHT -0.11 lbDIMENSION -9.6*2.55*0.32 inch', 'Outstanding Advantage:', '● A wide spacing,Smooth rounded teeth prevent your scalp from being scratched● Heat and stress crack resistance PP material ensure it is durable and long-time life● Comfortable hand-grip, frosting humanized design that provides maximum control for a smooth finish.Helps build body while blow-drying without slipping● Prevent sebum accumulation and pore blockage. Reduce itching, split ends Grow longer & healthier hair, naturally● Easily & painlessly detangle all types of hair; fine, thick or curly, without tearing or breaking.']\n{'Brand': 'VON SHARTE', 'Shape': 'Round', 'Unit Count': '1 Count', 'Hair Type': 'All, Curly, Fine, Thick', 'Item Weight': '0.11 Pounds', 'Package Dimensions': '10.59 x 3.9 x 1.81 inches; 1.76 Ounces', 'Item model number': 'Hair comb', 'UPC': '721821325164', 'Manufacturer': 'Von Sharte'}\nNice feel to this brush, did not have any static, so far I like it very much.\nGreat\nMagnetic Silicone Wrist Strap Bracelet to Hold Metal Bobby Pins and Clips in Easy Reach\nPERFEHAIR\n{'Brand': 'PERFEHAIR', 'Hair Type': 'All', 'Color': 'Black', 'Age Range (Description)': 'Adult', 'Style': 'Bobby Pin Bracelet', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.84 x 0.59 x 2.36 inches; 2.88 Ounces', 'Item model number': 'ST002-1', 'UPC': '705586581638', 'Manufacturer': 'Perfehair'}\nIt's a really great idea, really great concept, and works very well. The slap on strap is a smart idea\nNice",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Nice",
    "text": "It's a really great idea, really great concept, and works very well. The slap on strap is a smart idea",
    "images": [],
    "asin": "B00YELWU9K",
    "parent_asin": "B0C17JPYXQ",
    "user_id": "AHC3OUTQDZFI53RTHTLV4RWH2LOA",
    "timestamp": "2019-09-27 05:04:48.148000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "All Beauty",
    "title_meta": "Magnetic Silicone Wrist Strap Bracelet to Hold Metal Bobby Pins and Clips in Easy Reach",
    "average_rating": 4.7,
    "rating_number": 1117,
    "features": [
      "1 Piece Magnetic Silicone Wrist Strap Bracelet to Hold Metal Bobby Pins, Clips and other small Accessories.",
      "Magnetic face holds metal clips and pins in place; also great for sewing pins",
      "Allows for quick & easy access when styling, making you work more efficiently and saving you time",
      "You can even use it to effortlessly pick up pins dropped on the floor or fabric",
      "Special Silicon Strap, One Size fits all wrists"
    ],
    "description": [],
    "price": 11.55,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41FHE17dI2L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41FHE17dI2L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71KKzZlCiZL._SL1374_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/418UfGD04fL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/418UfGD04fL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61SGccqXXQL._SL1296_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/414w59Uf67L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/414w59Uf67L.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61mJ0+hMblL._SL1041_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41PFM+bCP6L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41PFM+bCP6L.jpg",
        "variant": "PT03",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "This Magnetic Bobby Pins Bracelet Is Gamechanging!",
        "url": "https://www.amazon.com/vdp/04ea87a6a76c4c7691d849cbba13b386?ref=dp_vse_rvc_0",
        "user_id": "/shop/hair_by_zolotaya"
      },
      {
        "title": "Magnetic bracelet to hold your bobby pins!!",
        "url": "https://www.amazon.com/vdp/0fabc15c4a01469cb452bd15b08c69b1?ref=dp_vse_rvc_1",
        "user_id": "/shop/kortneyandkarlee"
      },
      {
        "title": "magnetic bobby pin bracelet",
        "url": "https://www.amazon.com/vdp/d9ee512d46ac444a84c777b09ea49c68?ref=dp_vse_rvc_2",
        "user_id": ""
      }
    ],
    "store": "PERFEHAIR",
    "categories": [],
    "details": {
      "Brand": "PERFEHAIR",
      "Hair Type": "All",
      "Color": "Black",
      "Age Range (Description)": "Adult",
      "Style": "Bobby Pin Bracelet",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9.84 x 0.59 x 2.36 inches; 2.88 Ounces",
      "Item model number": "ST002-1",
      "UPC": "705586581638",
      "Manufacturer": "Perfehair"
    },
    "bought_together": null
  }
}