{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/05/29\nAverage Rating: 3.2\nProduct Details: {'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Xiao Feng'], 'Producers': ['Benjamen Chen', 'Stephen J. Eads', 'Haiyang Jiang', 'Jian-Xiang Shi'], 'Starring': ['Bruce Willis', 'Ye Liu', 'Adrien Brody'], 'Studio': ['tribecashortlist']}\nReview Text: And Bruce Willis sleepwalks thru this mess for a paycheck - so much cgi is thrown at the screen it overpowers what little screen writing, drama that remains. Besides the japanese fighter zero did not make it first flight until April 1939' was not deployed to China until 1940' in very small numbers with the 12th Rengo Kōkūtai . Dog fighting scenes are wasted with over the top cgi mish mash. Best to watch this with eyes closed & fast asleep for desired effect. thumbs down.\nReview Title: air turd\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['D.J. Caruso'], 'Producers': ['Joe Roth', 'Jeff Kirschenbaum', 'Vin Diesel', 'Samantha Vincent', 'Vince Totino', 'Scott Hemming', 'Ric Kidney', 'Gloria Borders', 'Zack Roth'], 'Starring': ['Vin Diesel', 'Donnie Yen', 'Deepika Padukone']}\nkudos for re-ingniting this bag of turds & accomplishing double douche-bag pre-emptive vomit launch. Everybody justs sleepwalks thru this entire flick. And for Vin before I even cash my check on a mish mash script effectively kills any chance for another sequel for this franchise not that it matters.  This franchise deserved a better send off than this. Makes watching paint dry exciting again. And we have  cgi over kill  and cinema verde' waste of talent.\nmassive pile of turds doing a double ollie & back flip\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Français (Canada)', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Français (France)'], 'Subtitles': ['English [CC]', 'Dansk', 'Deutsch', 'Español (Latinoamérica) [CC]', 'Español (España) [CC]', 'Suomi', 'Français [CC]', 'Italiano [CC]', 'Nederlands [CC]', 'Nynorsk', 'Polski', 'Português [SDH]', 'Svenska'], 'Directors': ['Jon Turteltaub'], 'Producers': ['Gerald R. Molen', 'Wayne Wei Jiang', 'Randy Greenberg', 'Catherine Xujun Ying', 'Chantal Nong', 'Barrie M. Osborne', 'Belle Avery', 'Colin Wilson', 'Lorenzo Di Bonaventura'], 'Starring': ['Jason Statham', 'Rainn Wilson', 'Ruby Rose'], 'Studio': ['WARNER HOME VIDEO']}\nsh*t tiered cgi effects, along with lazy throw everything at the wall script leaves the cast almost sleep walking thru this aquamarine turd fest. From uninspired acting, editing and camera work  - not even biggest shark ever to grace the screen can make this made for big screen in & out over the weekend 153 plus minute waste of humanity float.<br />Do yourself a favor & watch paint dry for better entertainment value.\nabsolute turd pile\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Vizcarra'], 'Producers': ['Victor Vizcarra', 'Michael Vizcarra'], 'Starring': ['Larry Poole', 'Victor Vizcarra', 'Murphy Neal Jones']}\nThere was no chance of winning in SE Asia period. From even Pentagons own study , known as Pentagon Papers which examined the US role from 1945 -1967'  in the area the real reason for the US involvement in Vietnam was to contain China expanision . One of three fronts long-run effort to contain China (realizing that the USSR \"contains\" China on the north and northwest):<br />(a) the Japan–Korea front;<br />(b) the India–Pakistan front; and<br />(c) the Southeast Asia front.<br />The fantasy put forth by political bias in this film is the same insanity that brought the US to bomb Laos, Cambodia & expand the war into US politics that made Watergate topple the Nixon administration in it's pursiut for fatally flawed foriegn & domestic policy.\nThud Pilots in a massive steamy Dud movie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Neil Hollander', 'Rick Gordon', 'Mark H Tuttle'], 'Producers': ['Peter Maris', 'Donna K Tuttle', 'Mark H Tuttle'], 'Starring': ['Neil Armstrong']}\nFirst off Neil Armstrong is a god. Awesome narration. But this aviation series suffers major flaws , mistakes in so many areas it would take pages just to list. So for example lets look at episode 13 that centers on jets. The myth that german aviation specifically the TA -183  heavily influenced the Mig-15 . MiG-15 is merely a progression of the MiG-9 using information that was generally understood after the WWII. The MiG-9 was developed before any of the Ta-183 data was avalible and Ta-183's key feature was the high T-tail which was also its greatest short coming.  The design history of the MiG-15 is available from the Mikoyan OKB Archives. English-language secondary sources include Mikoyan OKB by Bill Gunston, Soviet Secret Projects (Fighters) by Tony Buttler and MiG-15 by Yefim Gordon. All the authors are internationally respected and authoritative sources and all have concluded that the Ta-183 and MiG-15 are not related. Incidently in Tony Buttler's book he reveals that one rejected layout for the MiG-15 had forward-swept wings.\nanother aviation series with some major flaws\n{'Subtitles': ['None available'], 'Directors': ['Various'], 'Starring': ['Christopher Lee', 'Peter Read'], 'Studio': ['HDP']}\nThe 2nd Film is a horror gem from1964  -  Dementia 13' and  is Francis Ford Coppola's first flick, his directorial debut. Yeah, that's right. The man that brought you Apocalypse Now and The Godfather worked first in horror.\nUnder rated horror gems\nThe Shepherd\nDrama, Faith and Spirituality, Easygoing, Tense\n['Exciting \"top gun\" action and conflict in the lives of the men who push the edge of danger defending our skies.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Donald W. Thompson'], 'Producers': ['Donald W. Thompson', 'Peg Courter', 'Russell S. Doughten Jr.'], 'Starring': ['Christopher Stone', 'Dee Wallace', 'Pepper Martin']}\nThe box art cover is a instant classic. A pilot in full flight suit holding a lamb.  Supersonic good clean fun with jets & explosion & stuff. Instant tear jerker. And lambs.\nnothing to do with interspecies sex\n{'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Xiao Feng'], 'Producers': ['Benjamen Chen', 'Stephen J. Eads', 'Haiyang Jiang', 'Jian-Xiang Shi'], 'Starring': ['Bruce Willis', 'Ye Liu', 'Adrien Brody'], 'Studio': ['tribecashortlist']}\nAnd Bruce Willis sleepwalks thru this mess for a paycheck - so much cgi is thrown at the screen it overpowers what little screen writing, drama that remains. Besides the japanese fighter zero did not make it first flight until April 1939' was not deployed to China until 1940' in very small numbers with the 12th Rengo Kōkūtai . Dog fighting scenes are wasted with over the top cgi mish mash. Best to watch this with eyes closed & fast asleep for desired effect. thumbs down.\nair turd",
  "profile": "**Updated User Profile Summary:**\n\n- **Overall Sentiment:** The user maintains a strongly negative stance towards poorly executed films, expressing clear disappointment with franchise oversight, low-quality storytelling, and inaccuracies in historical contexts. They continue to be discerning yet have shown an evolving openness to diverse genres, particularly in drama.\n\n- **Rating Pattern:** The user is consistently harsh with ratings for poorly crafted films, as demonstrated by their latest review. Despite this, they recently enjoyed a drama, indicating a budding appreciation for quality narratives beyond their typical horror preference.\n\n- **Content Preferences:** High-quality storytelling and character development are crucial, with the user remaining critical of clichés and carelessly produced content. They maintain an intolerance for excessive CGI that detracts from narrative depth, as noted in their recent critique.\n\n- **Themes:** The user disapproves of uninspired performances and predictable scripts while recognizing films that surprise positively. Their recent interaction reflects discontent with excessive special effects and historical inaccuracies, reinforcing their critical viewpoint.\n\n- **Community Engagement:** The user actively critiques media, advocating for nuanced storytelling and highlighting exceptions that defy expectations, all while grappling with repetitive franchise disappointments and inaccuracies in portrayals. Their engagement is often infused with a sarcastic humor, reflecting a complex relationship with film and entertainment. \n\nThis updated profile captures the user's persistent critical lens while acknowledging their gradual exploration of diverse storytelling.",
  "metrics": {
    "rouge1_f": 0.12258606213266161,
    "rouge2_f": 0.0016820857863751048,
    "rougeL_f": 0.05877413937867338,
    "meteor": 0.04500148765248438,
    "bleu1": 0.004789842436434296,
    "bleu2": 0.0006926055258647716,
    "bleu3": 0.00013408792124211058,
    "bleu4": 5.9052330760576056e-05,
    "bertscore_precision": 0.33299270272254944,
    "bertscore_recall": 0.43828296661376953,
    "bertscore_f1": 0.37845101952552795
  }
}