{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: INH Semi Permanent Hair Color Wish Bear Blue, Color Depositing Conditioner, Temporary Hair Dye, Tint Conditioning Hair Mask, Safe, Blue Hair Dye - 6oz\nReview Date: 2021/06/29\nStore: INH\nAverage Rating: 3.7\nProduct Details: {'Package Information': 'Jar', 'Brand': 'INH', 'Item Form': 'Mask', 'Hair Type': 'Straight', 'Unit Count': '6.0 Ounce', 'Product Dimensions': '3 x 3 x 2.5 inches; 8.15 Ounces', 'UPC': '810073150676'}\nReview Text: These are some fun colors from INH.  They are not for the timid.  I had used an INH semi-permanent color (pink quartz) before and knew what to expect.  This time I tried Wish Bear that is a green blue color. I have curly hair and usually just add color to a few curls around my face, but this time I was feeling crazy and did a full head application. I had mixed results with the different levels of dark and light in my hair.  I would say that the image with the different results based on your starting color are accurate.  If you have a mix of levels in your hair then you will get a mixed  look, too.  This will look best (and get you that prettiest Care Bear color) on a pre bleached platinum level hair.<br /><br />Application is easy if you prep you surfaces (old towels are great) and wear gloves during application. I followed the instructions and had washed the night before so I was applying to dry unconditioned hair. I didn't use a bowl and a brush.  I just used my fingers and was careful to section and saturate. I left it on for an hour because I know from using semi-permanent colors over the last year that I need longer than the usual 30 minutes.  On pastel shades I usually go an hour to two hours.  If you are unsure then do a strand test before you go all over crazy like I did.<br /><br />My hair felt great afterwards.  It is conditioning.  It very much reminds me of the expensive brand that starts with an O.  Would I get this particular color again? For me, probably not. I did not have light enough hair to get the Care Bear look.  I also don't think the green in the blue green works on me. Would I get this brand again? I sure would.\nReview Title: fun colors, easy application with a little prep\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Mountain Falls Advanced Formula Nail Polish Remover Pads with 96% Acetone, for Natural Nails, 10 Count\nMountain Falls\n{'Brand': 'Mountain Falls', 'Item Form': 'Pad', 'Item Weight': '0.01 Pounds', 'Unit Count': '10 Count'}\nI used one pad to take off the two layers of medium dark polish and a top coat from my toenails.  It only took one pad to do it all.  That will give me 10 uses per box since there are 10 pads total.  It seems pricey for what you get.  That is why I took it down a star.  If you are looking for convenience this worked well for me.\nconvenient, worked well\nGirzzur fashion headbands for women-(6 Pack) yoga running headbands for women nonslip of wide boho Face washing makeup cloth hair bands\nGirzzur\n{'Age Range (Description)': 'Adult', 'Material': 'Spandex', 'Fabric Type': 'Cloth,Elastic,Spandex,Nylon', 'Number of Items': '6', 'Brand': 'Girzzur', 'Package Dimensions': '11.06 x 7.68 x 2.56 inches; 4.16 Ounces', 'Item model number': 'NVSTD-01', 'UPC': '782937993012'}\nI am currently letting my gray hairs grow so I needed something to help with those awkward couple months of growth.  These headbands give me an option to hide some of the growth.  They are 4\" wide  and fairly comfortable. I can't do ponytails and clips because I get headaches.  These seem to work OK so far without a major headache.  The colors are crazy and very retro.  I think I will need a set of solid colors, too.  Not bad for the price.\ncrazy retro headbands, 4\" wide\nJARGOD 1pcs 100% Kolinsky Sable Acrylic Nails Round Nail Art Brush (size 4)\nJARGOD\n{'Brand': 'JARGOD', 'Handle Material': 'Acrylic', 'Head Material': 'Kolinsky', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.7 x 0.3 x 0.3 inches; 0.63 Ounces'}\nThis is a nice little brush.  I am not using it for nails so I cannot comment on how it works for its intended purpose. I am using it for rock painting.  It is impressing me so far.\nnice\nMainBasics Headband with Buttons for Face Masks (Gray)\nMainBasics\n{'Number of Items': '1', 'Brand': 'MainBasics', 'Unit Count': '1.00 Count', 'Package Dimensions': '9.5 x 3.5 x 0.3 inches; 0.81 Ounces', 'UPC': '790887351233'}\nI have sewn reusable masks that I wear.  I do not wear disposable masks. I think this was designed with disposables in mind.  My masks have thicker elastics band that the button just can't hold well.  I think the lighter weight disposables would do better with this headband. It was a nice idea but it did not work.  I haven't decided if I am going to snip off the buttons and try and use it as a regular headband or if I will pass this on to someone else.\ndoesn't work for me\nPurple Hair Mask for Blonde with Keratin & Jojoba Oil - Platinum & Silver Hair - Instantly Eliminate Brassiness & Yellows - Made in USA - Hair Toner - Bleached & Highlighted Hair - Sulfate Free - 8 oz\nWELLUTION\n{'Brand': 'WELLUTION', 'Item Form': 'Oil', 'Material Feature': 'Natural', 'Hair Type': 'Damaged,Dry,Color-treated', 'Product Benefits': 'Hydrating Treatment', 'Package Dimensions': '3.07 x 2.9 x 2.8 inches; 8 Ounces', 'UPC': '749715278440'}\nMy curly greying hair did not like this hair mask. My curls were without definition and dry. I also couldn't tell any difference with the purple. Oh well.\nMy curly hair did not like this\n5pcs Nail Art Liner Brushes, Lystaii Dual-ended Painting Nail Design Brush Pen Include Liner Brushes and Dotting Pen Nail Art Point Drill Drawing Brush Double Ended Dotting Tools Set 5,7,9,11,14mm\nLystaii\n{'Package Dimensions': '9.41 x 3.86 x 0.75 inches; 1.41 Ounces'}\nI use  nail tools for my kindness rock painting.  I was interested in these because they don't just have the dotting stylus on both ends like my other set.  I liked the idea of the fine lines I could paint with the brush end.  They are also cute and sparkly so that is a bonus.  You don't get any instructions but there is always the internet.  I found the brush bristles to be a little longer than a normal paint brush length so they were harder to use until I got used to them.  I bet that length is handier for nails.  I like these overall. They are priced well.\nusing these for rock painting\nAmtidy Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nAmtidy\n{'Age Range (Description)': 'Adult', 'Material': 'Polyester, Plastic', 'Fabric Type': 'Polyester', 'Brand': 'Amtidy', 'Size': 'Queen', 'UPC': '782931993803'}\nI liked these headbands.  They were not too tight or too loose.  I like that they kept their shape even though I slept in it.  I like the size of these because they cover my gray roots well. They are not super high quality but I was going for quantity and color choices.\nsolid colors are a solid choice\nMulticolors Crimped Bobby Pins, 96 Counts 2 Inches Non Slip Grip Hair Pins For Women, Safe Rubber Tips & Strong Grip Bob Pins, Bobby Pins Blonde, Black, Brown, Green\nDARONGFENG\n{'Brand': 'DARONGFENG', 'Hair Type': 'All', 'Color': 'Gray,Green,Brown', 'Age Range (Description)': 'Adult', 'Material': 'Metal, Rubber', 'Package Dimensions': '4.8 x 3.8 x 0.7 inches; 3.21 Ounces', 'Item model number': 'Hair pins-D96-4', 'UPC': '741416436082'}\nI think the advantage of this pack of bobby pins is the 4 different colors.  I think they are pretty standard other than that.  I wish instead of the greenish ones that they put gray in the pack.  These come in separate 24 pin packs so if there is a color that you don't like you can pass them on to someone else, or share them between grumpy siblings who hate to share.\nbobby pins in a variety pack\nuxosuz Beard Apron for Men Beard Catcher for Shaving Beard Apron Trimming Apron with 2pcs Suction Cups+ 1pc Brush\nuxosuz\n{'UPC': '721996979933'}\nJust know in advance you will need to provide your own suction cups to attach this to your mirror.  The included set are terrible.  The cape itself is white and thin but works fine. It is long enough for hubby to use in the bathroom with our standard depth counters.  If you have deep countertops you might have to stand right up to it to make this work.  It helps if you have a little drape to catch the hair.  You don't want to stand so far back that it is flat.  Hubby is messy so I was hoping this would help decrease the mess.  It will if I buy some better suction cups and sweet talk him into using it.\nterrible suction cups, decent cape\nAmacle Hair Bow Organizer Holder for Girls - Hair Accessories Storage Wall Hanger, Pack of 3\nAmacle\n['Specification:', 'Total length: 76 cm / 30 inch', 'Total length: 76 cm / 30 inch', 'Cloth string length: 55cm / 22 inch ( not included the hanging loop )', 'Cloth string length: 55cm / 22 inch ( not included the hanging loop )', 'Width: 25 cm / 10 inch', 'Width: 25 cm / 10 inch', 'Wood bar diameter: 1.5 cm / 0.6 inch', 'Wood bar diameter: 1.5 cm / 0.6 inch', 'Quantity: 3 pieces', 'Quantity: 3 pieces', 'Note:', 'All', 'hair clips', 'showing on the pics are', 'not included', '.']\n{'Product Dimensions': '30 x 12 x 1 inches; 12.84 Ounces', 'UPC': '743811744472', 'Manufacturer': 'Huobei(Fuzhou)E-Commerce Co.,Ltd'}\nThese three bow holders for your wall are bright and fun and perfect for your bow wearing youngsters.  They are pretty simple and you could probably make them yourselves if you are crafty.  You would probably spend as much on supplies as the price of these, though.  If you want to skip the crafting then this is for you.<br /><br />You can personalize by removing the fabric strips and mixing them and reattaching.  Later on when your bow wearing youngsters are done with these you can always use the dowels and fabric strips for other crafts.<br /><br />My only complaint is that they use the same fabric for the hanger.  It is just glued onto the dowel and it is also stretches out easily.  I would have liked this better if the hanger was more sturdy.\nsimple, crafty look hair bow holders\nCOLORGRAM Artist Formula Auto Brow Pencil 0.25g- True Beauty K-Drama Makeup, Built-in-Spoolie, Clump-Free Formula, Softly Glides, Natural Look (05 Gray Brown)\nCOLORGRAM\n{'Brand': 'COLORGRAM', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Softening'}\nThe one I received is dried out and takes a lot of swipes on my hand to get the color started  Once the color starts coming out it is very lovely but it still takes pressure to get the color to show.  I don't like using that much pressure on my brows.  It makes me nervous. I don't think I would get this one again.\ndried out\nVEGAWIWI Silk Scrunchies for Hair 100% Pure 22 Momme Mulberry Silk Scrunchies for Curly Hair 3 Pack Silk Hair Ties for Women Girls with Elastic Band ( Black, DarkGray, NavyBlue )\nVEGAWIWI\n{'Material': 'Silk', 'Item Form': 'Scrunchie', 'Brand': 'VEGAWIWI', 'Hair Type': 'Curly', 'Number of Pieces': '3', 'Package Dimensions': '9.45 x 7.52 x 0.51 inches; 3.84 Ounces', 'UPC': '710959833719'}\nThese hair scrunchies really could be silk but I have no way of knowing.  Upon arrival, this 3 pack was in a clear plastic sleeve with an insert that only said VEGAWIWI.  It had no information on the product AT ALL, no origin, no instructions, nothing.  Could they be silk? Sure.  Do I have any proof? No.  If you want to be absolutely sure, I recommend that you buy from a company or brand that has multiple silk products.  I couldn't find another product on Amazon with this name, at least not at this moment.  The sticker on the package from Amazon did say Made In China.\nare they silk?\nINH Semi Permanent Hair Color Wish Bear Blue, Color Depositing Conditioner, Temporary Hair Dye, Tint Conditioning Hair Mask, Safe, Blue Hair Dye - 6oz\nINH\n{'Package Information': 'Jar', 'Brand': 'INH', 'Item Form': 'Mask', 'Hair Type': 'Straight', 'Unit Count': '6.0 Ounce', 'Product Dimensions': '3 x 3 x 2.5 inches; 8.15 Ounces', 'UPC': '810073150676'}\nThese are some fun colors from INH.  They are not for the timid.  I had used an INH semi-permanent color (pink quartz) before and knew what to expect.  This time I tried Wish Bear that is a green blue color. I have curly hair and usually just add color to a few curls around my face, but this time I was feeling crazy and did a full head application. I had mixed results with the different levels of dark and light in my hair.  I would say that the image with the different results based on your starting color are accurate.  If you have a mix of levels in your hair then you will get a mixed  look, too.  This will look best (and get you that prettiest Care Bear color) on a pre bleached platinum level hair.<br /><br />Application is easy if you prep you surfaces (old towels are great) and wear gloves during application. I followed the instructions and had washed the night before so I was applying to dry unconditioned hair. I didn't use a bowl and a brush.  I just used my fingers and was careful to section and saturate. I left it on for an hour because I know from using semi-permanent colors over the last year that I need longer than the usual 30 minutes.  On pastel shades I usually go an hour to two hours.  If you are unsure then do a strand test before you go all over crazy like I did.<br /><br />My hair felt great afterwards.  It is conditioning.  It very much reminds me of the expensive brand that starts with an O.  Would I get this particular color again? For me, probably not. I did not have light enough hair to get the Care Bear look.  I also don't think the green in the blue green works on me. Would I get this brand again? I sure would.\nfun colors, easy application with a little prep",
  "actual_interaction": {
    "rating": 4.0,
    "title": "fun colors, easy application with a little prep",
    "text": "These are some fun colors from INH.  They are not for the timid.  I had used an INH semi-permanent color (pink quartz) before and knew what to expect.  This time I tried Wish Bear that is a green blue color. I have curly hair and usually just add color to a few curls around my face, but this time I was feeling crazy and did a full head application. I had mixed results with the different levels of dark and light in my hair.  I would say that the image with the different results based on your starting color are accurate.  If you have a mix of levels in your hair then you will get a mixed  look, too.  This will look best (and get you that prettiest Care Bear color) on a pre bleached platinum level hair.<br /><br />Application is easy if you prep you surfaces (old towels are great) and wear gloves during application. I followed the instructions and had washed the night before so I was applying to dry unconditioned hair. I didn't use a bowl and a brush.  I just used my fingers and was careful to section and saturate. I left it on for an hour because I know from using semi-permanent colors over the last year that I need longer than the usual 30 minutes.  On pastel shades I usually go an hour to two hours.  If you are unsure then do a strand test before you go all over crazy like I did.<br /><br />My hair felt great afterwards.  It is conditioning.  It very much reminds me of the expensive brand that starts with an O.  Would I get this particular color again? For me, probably not. I did not have light enough hair to get the Care Bear look.  I also don't think the green in the blue green works on me. Would I get this brand again? I sure would.",
    "images": [],
    "asin": "B095LCGY59",
    "parent_asin": "B095LCGY59",
    "user_id": "AHUIIYUMY5OXQWRECL5JEK4AITBA",
    "timestamp": "2021-06-29 13:53:56.593000",
    "helpful_vote": 7,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "INH Semi Permanent Hair Color Wish Bear Blue, Color Depositing Conditioner, Temporary Hair Dye, Tint Conditioning Hair Mask, Safe, Blue Hair Dye - 6oz",
    "average_rating": 3.7,
    "rating_number": 13,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41HrAUnv1AS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41HrAUnv1AS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61kRtAiEQ9S._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41CPK4RVi6S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41CPK4RVi6S.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71Li80ZtggS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41u37mK-rVS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41u37mK-rVS.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81CWt-4LScS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51wDZRXkEBS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51wDZRXkEBS.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/91PG7cUf8YS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41bsttCLfIS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41bsttCLfIS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81cC5vFYyPS._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "No Breakage Hair Wash Day Routine",
        "url": "https://www.amazon.com/vdp/06c837b0f1aa48d296f5c7f0bf0ef558?ref=dp_vse_rvc_0",
        "user_id": "/shop/discoveringnatural"
      },
      {
        "title": " High Porosity Masque 12p",
        "url": "https://www.amazon.com/vdp/08b0c336228b4181bd168c131cfbfe42?ref=dp_vse_rvc_1",
        "user_id": ""
      }
    ],
    "store": "INH",
    "categories": [],
    "details": {
      "Package Information": "Jar",
      "Brand": "INH",
      "Item Form": "Mask",
      "Hair Type": "Straight",
      "Unit Count": "6.0 Ounce",
      "Product Dimensions": "3 x 3 x 2.5 inches; 8.15 Ounces",
      "UPC": "810073150676"
    },
    "bought_together": null
  }
}