{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/06/03\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Keith Truesdell', 'Anson Williams', 'Gail Bradley', 'Lindsley Parsons III', 'Jason Priestley', 'Ron Underwood', 'John Schneider', 'Barry Watson'], 'Producers': ['Lindsley Parsons III', 'Hrag Gaboudian', 'Elaine Arata'], 'Studio': ['Freeform']}\nReview Text: This is not right, I am a prime member and should have gotten this for free, but it charged me. I want this refunded and I won't be doing this anymore. PERIOD! This is false advertising!\nReview Title: I was charged $1.99 for this when it should have been free because I am a Prime member. What?\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tim Gibbons', 'Genéa Gaudet', 'Adam Hirsch'], 'Producers': ['Tim Gibbons', 'Christopher Poole', 'Bill Hayes', 'Jen Stocks', 'Kirk Streb', 'Mary Wilcher', 'Maggie Kay', 'Deanie Wilcher'], 'Studio': ['TLC']}\nAfter watching all the seasons of Sisterwives, I feel I have come to love them and all that they stand for. I am \"mainstream\" LDS. It is against our beliefs to live this type of life because it is against the law. BUT, I have such respect for the Brown family and all that they stand for. They are true to the faith. I could never condemn or otherwise harrass these beautiful people. I believe in religious freedom and think the government needs to stay out of these peoples lives. They have wonderful relationships though they do have dissagreements as would any family. Those children are soooo loved and they know it. Cody is a great Dad and husband and if only more men were like him, what a better world this would be. Each and every one of these wives are amazing, kind and loving individuals. They just want peace for their family. God bless you Brown family and hang in there. I believe there will come a time when you will be allowed to practice your religion with no fear.<br /><br />I relate your situation to the persecution of the first LDS people in the early days of the restoration of the gospel. I would love to meet you one day as I'm sure I would grow as a person, just from being in the presence of each and everyone of your delightful spirits.  Hugs and love from an LDS woman.\nAmazing way of life....in a good way\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tim Gibbons', 'Genéa Gaudet', 'Adam Hirsch'], 'Producers': ['Tim Gibbons', 'Christopher Poole', 'Bill Hayes', 'Jen Stocks', 'Kirk Streb', 'Mary Wilcher', 'Maggie Kay', 'Deanie Wilcher'], 'Studio': ['TLC']}\nI am hooked on this darn show. I love watching these guys. Great kids and great parents. I can't wait until they get those houses built.\nGreat show\nCelebrity Wife Swap\nUnscripted\n['Celebrity Wife Swap features the unlikeliest of moms swapping lives, including Splash contestant and Playmate Kendra Wilkinson and reality super mom Kate Gosselin of Kate Plus Eight fame.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Pamela Bower', 'Alex Cross', 'Bruce Toms', 'Jack Isacksen', 'Michael Davies', 'Tony Yates', 'Valerie Castillo', 'Ken Snow', 'Bailey Grizzle', 'Katie Bramble']}\nLoved it! Two different worlds collide and it was very interesting to watch them handle the challenges. Love Kate and Kendra!\nlove Kendra Wilkenson and Kate Gosslin. What an interesting switch but I loved it.\n{'Subtitles': ['None available'], 'Directors': ['Adam Freeman', 'Adam Reed', 'Chad Greulach', 'Steve Paley'], 'Producers': ['Adam Freeman', 'Adam Reed', 'Stephen C. Harris', 'Gene Simmons', 'Erin Kelly Richards', 'Natalie Gecht', 'Antonia Mattia', 'Matthew E. Fitzgerald'], 'Starring': ['Shannon Tweed', 'Nick Simmons', 'Sophie Simmons'], 'Studio': ['A&E Television Networks']}\nSomeone once told me that when you have money nothing changes, theproblems just get bigger. The Simmons Tweed family are proof. VERY DOWN TO EARTH and fun loving people.\nWonderful people\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kathryn Bigelow'], 'Producers': ['Colin Wilson', 'Greg Shapiro', 'Ted Schipper', 'Mark Boal', 'Kathryn Bigelow', 'Megan Ellison'], 'Starring': ['Jessica Chastain', 'Mark Strong', 'Joel Edgerton'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nRead the book and the film followed the book very well. Really enjoyed it. Great telling of a necessary event in history.\ngreat film\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Keith Truesdell', 'Anson Williams', 'Gail Bradley', 'Lindsley Parsons III', 'Jason Priestley', 'Ron Underwood', 'John Schneider', 'Barry Watson'], 'Producers': ['Lindsley Parsons III', 'Hrag Gaboudian', 'Elaine Arata'], 'Studio': ['Freeform']}\nThis is not right, I am a prime member and should have gotten this for free, but it charged me. I want this refunded and I won't be doing this anymore. PERIOD! This is false advertising!\nI was charged $1.99 for this when it should have been free because I am a Prime member. What?",
  "profile": "**Updated User Profile Summary:**\n\n- **Religious Values:** The user identifies as \"mainstream\" LDS, advocating for religious freedom and the separation of church and state while respecting diverse lifestyles, showcasing an open-minded approach to differing beliefs.\n\n- **Empathy & Support:** They exhibit compassion towards families of varying beliefs, particularly valuing the bonds seen in familial relationships and demonstrating admiration for the qualities of children and parents.\n\n- **Family Dynamics:** Values strong family connections and nurturing parental roles. Their recent engagement with media featuring down-to-earth families illustrates a continued appreciation for authentic family interactions and positive, humorous narratives.\n\n- **Cultural Awareness:** Draws parallels between personal experiences and historical persecutions faced by LDS communities, reflecting a nuanced understanding of their faith's history and challenges.\n\n- **Desire for Connection:** Shows a yearning for personal growth through interactions with diverse lifestyles, revealing a strong inclination toward community and shared experiences.\n\n- **Positive Outlook:** Maintains an optimistic viewpoint on life, reinforced by experiences with media that showcase uplifting family themes and relatable dynamics.\n\n- **Media Consumption:** The user enjoys well-constructed narratives, particularly those reflecting historical events. This balance between entertaining and thought-provoking content enriches their understanding of significant events.\n\n- **Consumer Behavior:** Recently expressed frustration over a perceived injustice regarding billing in a media transaction, indicating a strong expectation for service quality and transparency, along with a willingness to advocate for their consumer rights.\n\nOverall, the user embodies compassion, understanding, and an open mindset toward diverse family structures and religious practices, focused on community, personal growth, and joy in familial interactions, while maintaining vigilance in their consumer experiences.",
  "metrics": {
    "rouge1_f": 0.19914346895074944,
    "rouge2_f": 0.019313304721030045,
    "rougeL_f": 0.08779443254817987,
    "meteor": 0.0739583970205122,
    "bleu1": 0.04019492722271701,
    "bleu2": 0.012615427660755246,
    "bleu3": 0.005565257782081126,
    "bleu4": 0.0028107372125151745,
    "bertscore_precision": 0.37373587489128113,
    "bertscore_recall": 0.4582020938396454,
    "bertscore_f1": 0.41168108582496643
  }
}