{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Celebrity Wife Swap\nReview Date: 2013/04/04\nCategories: Unscripted\nProduct Description: ['Celebrity Wife Swap features the unlikeliest of moms swapping lives, including Splash contestant and Playmate Kendra Wilkinson and reality super mom Kate Gosselin of Kate Plus Eight fame.']\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Pamela Bower', 'Alex Cross', 'Bruce Toms', 'Jack Isacksen', 'Michael Davies', 'Tony Yates', 'Valerie Castillo', 'Ken Snow', 'Bailey Grizzle', 'Katie Bramble']}\nReview Text: Loved it! Two different worlds collide and it was very interesting to watch them handle the challenges. Love Kate and Kendra!\nReview Title: love Kendra Wilkenson and Kate Gosslin. What an interesting switch but I loved it.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tim Gibbons', 'Genéa Gaudet', 'Adam Hirsch'], 'Producers': ['Tim Gibbons', 'Christopher Poole', 'Bill Hayes', 'Jen Stocks', 'Kirk Streb', 'Mary Wilcher', 'Maggie Kay', 'Deanie Wilcher'], 'Studio': ['TLC']}\nAfter watching all the seasons of Sisterwives, I feel I have come to love them and all that they stand for. I am \"mainstream\" LDS. It is against our beliefs to live this type of life because it is against the law. BUT, I have such respect for the Brown family and all that they stand for. They are true to the faith. I could never condemn or otherwise harrass these beautiful people. I believe in religious freedom and think the government needs to stay out of these peoples lives. They have wonderful relationships though they do have dissagreements as would any family. Those children are soooo loved and they know it. Cody is a great Dad and husband and if only more men were like him, what a better world this would be. Each and every one of these wives are amazing, kind and loving individuals. They just want peace for their family. God bless you Brown family and hang in there. I believe there will come a time when you will be allowed to practice your religion with no fear.<br /><br />I relate your situation to the persecution of the first LDS people in the early days of the restoration of the gospel. I would love to meet you one day as I'm sure I would grow as a person, just from being in the presence of each and everyone of your delightful spirits.  Hugs and love from an LDS woman.\nAmazing way of life....in a good way\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Tim Gibbons', 'Genéa Gaudet', 'Adam Hirsch'], 'Producers': ['Tim Gibbons', 'Christopher Poole', 'Bill Hayes', 'Jen Stocks', 'Kirk Streb', 'Mary Wilcher', 'Maggie Kay', 'Deanie Wilcher'], 'Studio': ['TLC']}\nI am hooked on this darn show. I love watching these guys. Great kids and great parents. I can't wait until they get those houses built.\nGreat show\nCelebrity Wife Swap\nUnscripted\n['Celebrity Wife Swap features the unlikeliest of moms swapping lives, including Splash contestant and Playmate Kendra Wilkinson and reality super mom Kate Gosselin of Kate Plus Eight fame.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Pamela Bower', 'Alex Cross', 'Bruce Toms', 'Jack Isacksen', 'Michael Davies', 'Tony Yates', 'Valerie Castillo', 'Ken Snow', 'Bailey Grizzle', 'Katie Bramble']}\nLoved it! Two different worlds collide and it was very interesting to watch them handle the challenges. Love Kate and Kendra!\nlove Kendra Wilkenson and Kate Gosslin. What an interesting switch but I loved it.",
  "profile": "**User Profile Summary:**\n\n- **Religious Values:** The user identifies as \"mainstream\" LDS, advocating for religious freedom and the separation of church and state while respecting diverse lifestyles, showcasing an open-minded approach to differing beliefs.\n\n- **Empathy & Support:** They exhibit compassion towards families with varying beliefs, highlighting admiration for familial bonds, particularly appreciating the relationships and characteristics of children and parents.\n\n- **Family Dynamics:** Values strong family connections and nurturing parental roles, evidenced by their enthusiasm for media content depicting positive family interactions and dynamics. Their recent interest in unscripted shows that explore different family lifestyles aligns with their appreciation for engaged parenting.\n\n- **Cultural Awareness:** Draws parallels between personal experiences and historical persecutions faced by LDS communities, reflecting a nuanced understanding of their faith’s history and applied challenges.\n\n- **Desire for Connection:** Shows a yearning for personal growth through interactions with diverse lifestyles, revealing a strong inclination toward community and shared experiences.\n\n- **Positive Outlook:** Their optimistic perspective on life is reinforced by their enjoyment of media showcasing humorous or uplifting family narratives, as well as their ability to appreciate the fascinating aspects of contrasting family backgrounds.\n\nOverall, the user embodies compassion, understanding, and an open mindset towards diverse family structures and religious practices, shaped by strong personal values, a desire for community, and a love for intriguing family-centered content.",
  "metrics": {
    "rouge1_f": 0.21851289833080426,
    "rouge2_f": 0.0091324200913242,
    "rougeL_f": 0.10015174506828527,
    "meteor": 0.09555489183872722,
    "bleu1": 0.09877365640037,
    "bleu2": 0.02700210477974219,
    "bleu3": 0.013228388723399029,
    "bleu4": 0.007041574149295894,
    "bertscore_precision": 0.38005805015563965,
    "bertscore_recall": 0.4541499614715576,
    "bertscore_f1": 0.4138137102127075
  }
}