{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/10/22\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes']}\nReview Text: I've been a &#34;Doctor Who&#34; fan since childhood, and I'm 60 years old now! The David Tennant reinvention of Dr. Who is one of my favorites. The portrayal is so charismatic. I never tire of watching any &#34;Doctor Who&#34; episodes featuring my favorite versions of the Doctor. &#34;The Waters of Mars&#34; is especially poignant and telling as to the Doctor's developing nature. It still hits me every time I watch it.\nReview Title: Poignant\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Torchwood\nScience Fiction, Fantasy, Suspense, Drama\n['Torchwood follows the adventures of a team of investigators led by the enigmatic Captain Jack Harkness. Set in the UK in the present day, the team uses scavenged alien technology to solve crime both alien and human.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Andy Goddard', 'Ashley Way', 'Euros Lyn', 'Colin Teague', 'Billy Gierhart', 'Guy Ferland', 'Brian Kelly', 'James Strong', 'Alice Troughton', 'Jonathan Fox Bassett'], 'Starring': ['John Barrowman', 'Eve Myles', 'Gareth David-Lloyd']}\nTorchwood: Miracle Day is edgier than season 3, not really for the very young as it contains some sexual content. The story line is fabulous. I have only gotten to episode 8, but have been engrossed in this plot. Best yet!\nLuv it!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Nankin', 'Allan Kroeker', 'Andy Wolk', 'Allan Arkush', 'Larry Shaw', 'Omar Madha', 'Scott Stewart', 'Mairzee Almas', 'Félix Enríquez Alcalá', 'Todd Slavkin'], 'Starring': ['Grant Bowler', 'Grant Bowler', 'Julie Benz'], 'Studio': ['Syfy']}\nI enjoyed watching this series and am truly disappointed that it has been discontinued. Like others have mentioned, it is like a fast-moving Western. These last episodes for me held many surprises. The biggest surprise for me is the Datak character's development. And it is bittersweet that the hero and Doc Yewll find redemption from their guilt through sacrifice and that Nolan gets to fulfill a longstanding wish to travel through space. So there is somewhat closure. Yet I feel like I did after watching &#34;Star Trek: Generations&#34;, or even another SyFy series, &#34;Continuum&#34;. The heros' s get what they hoped for, but not quite: like a wish granted by a Djin.\nBittersweet\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes']}\nI've been a &#34;Doctor Who&#34; fan since childhood, and I'm 60 years old now! The David Tennant reinvention of Dr. Who is one of my favorites. The portrayal is so charismatic. I never tire of watching any &#34;Doctor Who&#34; episodes featuring my favorite versions of the Doctor. &#34;The Waters of Mars&#34; is especially poignant and telling as to the Doctor's developing nature. It still hits me every time I watch it.\nPoignant",
  "profile": "**Updated User Profile Summary:**\n\n- **Genres Preferred:** Strong interest in science fiction, fantasy, suspense, and drama narratives, with a particular inclination towards series that blend these elements innovatively. A notable enthusiasm for classic and iconic series within these genres.\n- **Content Themes:** Enjoys intricate plots featuring character development and surprise twists. Deep appreciation for themes of redemption, sacrifice, closure, and emotionally resonant storytelling, often reflected in poignant narratives.\n- **Engagement Style:** Highly engaged, marked by a lasting investment in characters and arcs that resonate emotionally. Demonstrates a long-term loyalty to series and characters, often returning to favorites despite potential disappointments in the genre.\n- **Rating Tendencies:** Rates highly for captivating storylines with a focus on emotional depth and character richness. Recent interactions reveal a pattern of valuing heartfelt connections, especially in classic series known for their poignant moments.\n- **Viewing Context:** Prefers content that combines adventurous and thought-provoking themes, appealing to adult audiences. Enjoys narratives that evoke a bittersweet sense of closure and complex character dynamics, often revisiting beloved episodes for their emotional impact.\n- **Overall Enjoyment:** Expresses strong emotional connections to stories, often highlighting memorable portrayals that resonate deeply. The user values stories that elicit a mix of satisfaction and melancholy, enhancing their engagement with the material. \n\nThis user continues to prioritize engrossing narratives and character-driven stories, appreciating content that combines imaginative elements with relatable themes.",
  "metrics": {
    "rouge1_f": 0.23151125401929257,
    "rouge2_f": 0.025806451612903226,
    "rougeL_f": 0.09967845659163987,
    "meteor": 0.09900185396201425,
    "bleu1": 0.09942037189811416,
    "bleu2": 0.02585851024408048,
    "bleu3": 0.004221134347603252,
    "bleu4": 0.0017069403731528562,
    "bertscore_precision": 0.3731801509857178,
    "bertscore_recall": 0.4410257041454315,
    "bertscore_f1": 0.4042762219905853
  }
}