{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/07/05\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['The Paley Center for Media'], 'Producers': ['Chuck Lorre', 'Steve Molaro', 'Bill Prady'], 'Starring': ['Jim Parsons', 'Johnny Galecki', 'Kaley Cuoco']}\nReview Text: If you're a fan of &#34;The Big Bang Theory,&#34; you'll find this Q&A with the cast and creators interesting.  This was recorded during the 6th season, so there are references to several of that season's shows, as well as speculation as to the duration of the series.<br /><br />It's clear that the actors &#34;gel&#34; as well off screen as on, and some of the questions and answers provide &#34;behind the scenes&#34; information about the &#34;how&#34; and &#34;why&#34; of the set, the plots, likes, and dislikes.  Especially charming is the discussion of the Amy-Sheldon &#34;spanking&#34; scene.<br /><br />Highly recommended for TBBT fans.\nReview Title: A \"must see\" if you're a fan of TBBT ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Journey to the Center of the Earth VHS\nJames Mason  (Actor),     Pat Boone  (Actor),     Henry Levin  (Director)    &                   0                  more   Rated:    G    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Amazon.com', \"James Mason plays Professor Oliver Lindenbrook, a scientist hoping to find the world's core in this 1959 adaptation of the Jules Verne novel. He leads his unusual party on an expedition to the center of the earth, by way of a volcano in Iceland. On the way, they encounter enormous mushrooms and giant prehistoric monsters. Produced by Michael Todd with then-spectacular special effects, the story was modernized to 1950s sensibilities. Mason gives this class, while Arlene Dahl and Diane Baker are the romantic interests. And Pat Boone is more palatable than you might expect as a secondary lead. You can watch this with your children and not be bored, and they will surely love it.\", \"--Rochelle O'Gorman\"]\n{'Is Discontinued By Manufacturer': 'No', 'Language': 'English, French, Italian, Icelandic', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Director': 'Henry Levin', 'Run time': '2 hours and 12 minutes', 'Release date': 'January 2, 1996', 'Date First Available': 'November 3, 2006', 'Actors': 'James Mason, Pat Boone, Arlene Dahl, Diane Baker, Thayer David', 'Studio': '20th Century Fox', 'Producers': 'Charles Brackett', 'Writers': 'Charles Brackett, Jules Verne, Walter Reisch'}\nI first saw this on the &quot;big screen&quot; as a child, and was totally blown away by the special effects.  I'm still amazed at what they were able to do given the &quot;state of the art&quot; at the time (1959).  No, it's  not precisely the way Jules Verne wrote it, but the basics of the plot and  story are there.  James Mason is the archtypical passionate professor, and  quite good in this role.  Arlene Dahl does a fine job in what could have  been &quot;just another pretty face&quot; role.  She actually gives it some  character and &quot;spunk.&quot;  And Pat Boone works well in the student  role, once he gets past the cheesy &quot;Scottish&quot; accent.<br />This is a  great family flick -- minimal violence, nothing that would tempt other than  a &quot;G&quot; rating -- and the &quot;good guys&quot; win in the end.  Fantastic scenery, believable special effects -- a great way to spend an  afternoon!\nAs good now as it was then . . .\nBrassed Off! [DVD]\nPete Postlethwaite  (Actor),     Tara Fitzgerald  (Actor),     Mark Herman  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n[\"This delightfully entertaining comedy treat features hot screen stars Ewan McGregor (STAR WARS EPISODE 1: THE PHANTOM MENACE, MOULIN ROUGE) and sexy Tara Fitzgerald (SIRENS). It's the critically acclaimed story about two old friends -- and ex-lovers -- whose surprise reunion turns their lives ... and the lives of everyone else in town ... hilariously upside down! Also starring screen favorite Pete Postlethwaite (JURASSIC PARK: THE LOST WORLD; THE USUAL SUSPECTS) -- don't miss the fun of the laugh-filled comedy that entertained and captivated audiences everywhere!\"]\n{'Format': 'Closed-captioned, Color, DVD, Dolby, Widescreen, NTSC, Letterboxed', 'Contributor': 'Stephen Tompkinson, Sue Johnston, Mark Herman, Philip Jackson, Melanie Hill, Mary Healey, Tara Fitzgerald, Jim Carter, Peter Martin, Ewan McGregor, Lill Roughley, Peter Gunn, Pete PostlethwaiteStephen Tompkinson, Sue Johnston, Mark Herman, Philip Jackson, Melanie Hill, Mary Healey, Tara Fitzgerald, Jim Carter, Peter Martin, Ewan McGregor, Lill Roughley, Peter Gunn, Pete Postlethwaite  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'False', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Mark Herman', 'Media Format': 'Closed-captioned, Color, DVD, Dolby, Widescreen, NTSC, Letterboxed', 'Run time': '1 hour and 47 minutes', 'Release date': 'June 15, 1999', 'Actors': 'Pete Postlethwaite, Tara Fitzgerald, Ewan McGregor, Stephen Tompkinson, Jim Carter', 'Subtitles': 'English', 'Studio': 'Miramax', 'Writers': 'Mark Herman', 'Number of discs': '1'}\nSo, why do we do it?  We devote our meager free time to the pursuit of musical excellence, many of us in amateur brass bands, string orchestras, community choirs and the like -- for what purpose?<br />Because we MUST.  No  matter how dismal or depressed the rest of our lives are, there's always an  opportunity to create something beautiful, something truly magnificent, by  combining our talents with those of others.<br />The Grimley Colliery Band is  but one example of this.  Each member, all men but one newcomer, is facing  a crisis -- the closing of the coal mine into which they've poured their  sweat and energy for most of their lives, and the uncertain future to  follow.  Their director, Danny, demanding and hard-headed, has retired from  the mine, and doesn't seem to grasp the seriousness of the matter.  &quot;Music is EVERYTHING!&quot; he proclaims.  The members consider him  daft, as they struggle to balance family, the impending union/management  show-down, and finances.  It's only at a moment of crisis that they realize  the point:  Danny not only understands the situation, but he also knows  that MUSIC is the only thing that will get these proud men through the  storm together, whole and with some shred of self-respect.<br />Pete  Postlethwaite is brilliant as Danny; Tara Fitzgerald's understated  performance as Gloria, the only female member of the band, gives her  character a sense of integrity and honor that could easily have been  overlooked in favor of more &quot;marketable&quot; characteristics.  The  rest of the cast is remarkable.  Particularly notable is Stephen Tompkinson  as Phil, Danny's son, whose descent into abject depression seems to mirror  the daily descent into the black hole of the coal mine -- dark, dirty, and  dangerous.<br />I liked this movie far better than I thought I would when I  saw the cover of the DVD.  This is less a romance than an examination of  many lives made complete -- by music, by the pursuit of beauty and grace,  by focused cooperation.  It really doesn't get any better than this.\nThis movie speaks to all of us amateur musicians . . .\nP.D.Q. Bach - The Abduction of Figaro VHS\nFormat: VHS Tape\nMovies & TV, Digital VHS\n['P.D.Q Bach provides a madcap farce in this crazed pastiche on the Figaro saga. A wonderful funny performance with plenty of gags, both musical & visual. Entertaining & hilarious.']\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'February 10, 1997', 'Date First Available': 'September 29, 2006', 'Actors': 'P.  Schickele (P.D.Q. Bach)', 'Studio': 'Vai (Video Artists Inter.)'}\nYou already know going in that this will be funny.  PDQ Bach (Peter Schickele) has a long history of very clever musical satire.  I mean, who else can write music in the style of Bach, Mozart, and Handel, and call it something like &quot;Fanfare for the Common Cold,&quot; &quot;The Seasonings,&quot; &quot;Chorale Prelude On An American Hymn For The Last Sunday Before The Fourth Day Of The Seventh Month After New Year's Eve,&quot; and dedicate a piece to &quot;A nobleman, Count Pointercount&quot;?<br />At last, we have one of Schickele's major works on video, in a fully staged production by The Minnesota Opera.  The principals are quite good, and the chorus is excellent.<br />Peter Schickele clearly loves Mozart's operas.  There are numerous &quot;jokes&quot; based on Don Giovanni, Le Nozze di Figaro, Cosi fan Tutte, Abduction from the Seraglio, and The Magic Flute.<br />Like Mozart's operas, Abduction has a convoluted plot:  Susanna Susannadanna's husband, Figaro, is dying (&quot;Stay With Me&quot;).  However, before he can die, he is abducted by Captain Kadd (&quot;My Name is Captain Kadd, and I Am Very Very Very Very Very Very Bad&quot;).  Well, actually before he is abducted, Susanna is visited by Dona Donna who is searching for Donald Giovanni (&quot;Perfidy, Thy Name is Donald, Although They Call Thee Don for Short&quot;), who loved her and left her (Donna, that is, not Susanna).  There is a rescue attempted by the men (Donald and his mute companion, Schleporello), who are shipwrecked, who are then followed by the ladies who end up in the Pasha Shaboom's harem.  Well, you get the picture.<br />There are subtle and not-so-subtle parodies of specific Mozart arias (&quot;Batti, batti&quot; becomes &quot;Macho, macho, That's How All Men Are,&quot; and is followed immediately by &quot;You Can Beat Me,&quot; for example), but you don't need to know the Mozart works to appreciate the humor.  While some of the bits are perhaps a tad too broad, the clever lyrics and well-written music more than compensate.  One of the funniest bits in the entire work is the &quot;Caribbean Ballet&quot; in the style of Swan Lake, complete with pineapple headdresses in place of the usual feathers for the &quot;corps de ballet,&quot; and a &quot;Carmen Miranda&quot;-style Odile.<br />This is definitely worth seeing if you're already a fan of PDQ Bach.  It's definitely worth seeing even if you're not yet a fan.\nPDQ Bach's Operatic Masterpiece!\nSame Time Next Year VHS\nEllen Burstyn  (Actor),     Alan Alda  (Actor),     Robert Mulligan  (Director)    &                   0                  more   Rated:    PG    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['Product description', 'The best film ever about life and love in the turmoil of the mid 20th Century', 'Amazon.com', \"Bernard Slade's smart, funny, and touching play about an adulterous couple who meet one weekend a year for 26 years is nicely adapted for the screen by Robert Mulligan (\", 'To Kill a Mockingbird', ') in this 1978 film. The two-person story stars Alan Alda and Ellen Burstyn, both of whom are outstanding at conveying a rainbow of emotions over a quarter-century as life gives and takes away, and the world convulses with change. Mulligan brings taste and honesty to the film, and Alda and Burstyn give full, living performances.', '--Tom Keogh']\n{'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Package Dimensions': '7.3 x 4.5 x 1.1 inches; 7.36 Ounces', 'Director': 'Robert Mulligan', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 20, 1993', 'Date First Available': 'December 7, 2006', 'Actors': 'Ellen Burstyn, Alan Alda, Ivan Bonar, Bernie Kuby, Cosmo Sardo', 'Studio': 'Universal Studios Home Entertainment'}\nThis is one of those rare gems -- a movie based on a stage play that is true to the original.<br />The premise is simple:  a man and a woman happen to meet at a romantic Pacific coast inn in the 1950s, spend a night together, and discover that they're both married -- with children, no less!  How do they deal with it?  Well, after getting past the initial shock and guilt (she yells into a towel, he lies about his wife's name and the number of children he has), they agree to meet every year, same weekend, same place.  We, the audience, are allowed to observe every 5th meeting in the same room.<br />We see the changes in the relationship, the changes in each of the participants, the changing times.  We get to know Doris and George through these slices of time, laugh with them, cry with them, always with the question -- will they ever leave their respective partners and follow their hearts?  It's definitely a relationship based more on mutual respect and friendship, despite its extra-marital foundation.  You get the feeling that these two individuals are truly soul-mates who just happened to meet.<br />Alan Alda gives an amazing performance, beginning as a guilt-ridden rather milk-toast-ish accountant.  Without giving away the plot twists, he goes through many changes and personal crises, and still manages to stay a reasonably likable, vulnerable man.<br />Ellen Burstyn, as Doris, enters into this as a rather ditzy young wife on her way to a Catholic retreat with the nuns, who manages to grow up over the years.  It's a treat to see the changes in these characters with each change of scene.<br />Bernard Slade's original two-person play with its witty dialogue is preserved almost intact, with only one new character in the movie that isn't in the play (&quot;old Mr. Chalmers&quot;).  If anything, the movie improves the original through the music and photo montages that separate the scenes (the entre-acte song, &quot;The Last Time I Felt Like This&quot; was nominated for an Academy Award).<br />This is definitely worth seeing for the superb performances of Alda and Burstyn.\nWell written, well acted . . .\nBest in Show\nJennifer Coolidge  (Actor),     Christopher Guest  (Actor, Writer, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['A blue ribbon look at dog show participants and the pooches who love them.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Anamorphic, Widescreen', 'Contributor': \"Gordon Mark, Jennifer Coolidge, Christopher Guest, Michael McKean, Parker Posey, Eugene Levy, Jane Lynch, Fred Willard, Michael Hitchcock, Karen Murphy, Catherine O'Hara, John Michael HigginsGordon Mark, Jennifer Coolidge, Christopher Guest, Michael McKean, Parker Posey, Eugene Levy, Jane Lynch, Fred Willard, Michael Hitchcock, Karen Murphy, Catherine O'Hara, John Michael Higgins   See more\", 'Initial release date': '2005-12-13', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '85391895121', 'Director': 'Christopher Guest', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Anamorphic, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'December 13, 2005', 'Actors': 'Jennifer Coolidge, Christopher Guest, John Michael Higgins, Michael Hitchcock, Eugene Levy', 'Subtitles': 'English, French', 'Producers': 'Gordon Mark, Karen Murphy', 'Studio': 'Studio Distribution Services', 'Writers': 'Christopher Guest, Eugene Levy', 'Country of Origin': 'USA', 'Number of discs': '1'}\n... and Christopher Guest manages to find the essence of it.  I've known a few folks who are committed to the dog show lifestyle, and believe me when I say Guest actually seems to tone down some of the behavior.<br />Assembling the same cast he used in \"Waiting for Guffman,\" Guest turns 'em loose to create the scenes without much scripting, and with this group of talented improv players, it works pretty well.  Parker Posey and Michael Hitchcock as the lawyer-couple whose manic neuroses and screaming hissy fits turn their weimeraner into a total basket case (THEY think it's because their beloved Beatrice happened to see them ...) are completely over the top, but it actually works.  Eugene Levy and Catherine O'Hara are excellent as the suburban couple who make up little songs about terriers and deal with her seemingly endless string of ex-lovers.<br />As good as \"Best in Show\" is, it does resort to cliches a bit too often, and it just feels a little \"incomplete.\"  I'd like to see more careful character development (like we saw in \"Guffman\"), and a bit more story development.<br />That said, \"Best in Show\" is definitely worth a look, and a must-see for Christopher Guest fans or those involved in the dog show world.\nIt's a dog-eat-dog world out there ...\nFearless\nJeff Bridges  (Actor),     Isabella Rossellini  (Actor),     Peter Weir  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n{'Genre': 'Drama', 'Format': 'DTS Surround Sound, Full Screen, NTSC', 'Contributor': \"Spencer Vrooman, Eve Roberts, Rafael Yglesias, John de Lancie, Peter Weir, Isabella Rossellini, Daniel Cerny, Robin Pearson Rose, Tom Hulce, Deirdre O'Connell, Benicio Del Toro, John Turturro, Jeff Bridges, Rosie PerezSpencer Vrooman, Eve Roberts, Rafael Yglesias, John de Lancie, Peter Weir, Isabella Rossellini, Daniel Cerny, Robin Pearson Rose, Tom Hulce, Deirdre O'Connell, Benicio Del Toro, John Turturro, Jeff Bridges, Rosie Perez  See more\", 'Language': 'English, French', 'Runtime': '2 hours and 2 minutes'}\nA disturbing account of a man's survival and recovery from the post-traumatic effects of a plane crash, _Fearless_ will probably never be one of my &quot;favorite&quot; films.  But it certainly raises some interesting questions.<br />In brief, Jeff Bridges, in probably his best performance in any movie role to date, plays Max Klein, an architect who is intensely afraid of flying.  Max is traveling with his business partner from his home in San Francisco to a meeting in Houston.  Somewhere along the way something goes terribly wrong, and the plane crashes.  The film actually opens with Max leading some of the survivors to safety across a cornfield.<br />Through a series of flashbacks, we get a sense of Max's realization during the long descent in the plane that he's not afraid anymore.  Further, he's able to calm some of the other passengers, including a little boy who is traveling alone.<br />After the crash, Max has (somewhat predictable) trouble dealing with his family (Isabella Rosselini as his wife, Laura), with his partner's widow, the attorney involved in suing the airline (Tom Hulce), and the psychiatrist hired by the airline to counsel the survivors (John Turturro).  I mean, had he NOT had these difficulties, there wouldn't be much of a movie, would there?  His feelings of invincibility, his &quot;testing&quot; of God and fate -- all seemed almost cliche'd reactions.  That said, however, they were very well acted by Bridges.<br />The only person he *can* relate to is Carla, a young mother who also survived the crash, who is having a lot of difficulty coping with the fact that her 2-yr-old son, who she was holding in her arms at the time of the crash, did not.  Rosie Perez gives a brilliant performance as Carla -- I was absolutely amazed at how good she is in this role.  I'd only seen her in light comedies (White Men Can't Jump; It Could Happen to You), and thought she was an &quot;OK&quot; actress.  I was totally blown away by her performance, and found it the most emotionally challenging aspect of the film.  You *can't* watch her anguish and walk away unmoved by it.<br />Without giving away too much more of the plot, suffice it to say that Max is finally able to come to grips with his reaction to the aftermath of the crash.  The final scenes of the movie, in which the actual crash is replayed, are remarkable for their special effects.<br />I'm giving this movie 4 stars -- it's a good movie if you're in a particular frame of mind.  It's NOT a lightweight subject, and certainly not lightweight performances by the principals.  I thought parts of it were maybe a little *too* predictable, but all in all, worth a look.  Prepare to be &quot;WOW!&quot;ed by Rosie Perez.\nWorth seeing for the performance of Rosie Perez\nA Christmas Story\nYano Anaya  (Actor),     Peter Billingsley  (Actor),     Bob Clark  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"This delightfully funny holiday gem tells the story of Ralphie Parker (Peter Billingsly) a 1940's nine-year-old who pulls out all the stops to obtain the ultimate Christmas present.\"]\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Peter Billingsley, Bob Clark, Tedde Moore, Melinda Dillon, Colin Fox, Patty Johnson, Ward, Zack, R.D. Robb, Jim Hunter, Yano Anaya, Jeff Gillen, Helen E. Kaider, Paul Hubbard, Svoboda, David, Scott Schwartz, Dwayne McLean, Drew Hocevar, Darren McGavin, Ian Petrella, Leslie CarlsonPeter Billingsley, Bob Clark, Tedde Moore, Melinda Dillon, Colin Fox, Patty Johnson, Ward, Zack, R.D. Robb, Jim Hunter, Yano Anaya, Jeff Gillen, Helen E. Kaider, Paul Hubbard, Svoboda, David, Scott Schwartz, Dwayne McLean, Drew Hocevar, Darren McGavin, Ian Petrella, Leslie…   See more', 'Language': 'English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 1.6 Ounces', 'Director': 'Bob Clark', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'September 26, 2000', 'Actors': 'Yano Anaya, Peter Billingsley, Leslie Carlson, Melinda Dillon, Colin Fox', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nThink back to those Christmases from your childhood ... Isn't there one that stands out in your memory as the &quot;Christmas to end all Christmases&quot;?  You wanted a particular toy more than anything, more than life itself.  You did everything in your power to ensure its delivery, behaving in your most responsible mature way, making sure Santa knew about it (you had your doubts about Santa, but you wanted to hedge your bets).<br />Such is the premise for &quot;A Christmas Story.&quot;  Peter Billingsley as Ralphie gives a sterling performance, a perfect combination of childhood naivete' and more mature observation.  Darrin McGavin is wonderful as Ralphie's dad, &quot;the old man,&quot; exuding boyish joy while at the same time trying to act like a &quot;father.&quot;  The only casting choice that I questioned was Melinda Dillon as Ralphie's mother -- she does a fine job, though, and in the end is a nice match for Darrin McGavin.<br />The story is narrated by Jean Shepherd himself, in a sort of midwest-accented Tom Bodette or Garrison Keillor style.  It works beautifully, lending a sort of sepia-toned nostalgic tone to the story.<br />If you're looking for a replacement (or addition) to &quot;It's a Wonderful Life,&quot; this is a good candidate.  It's funnier (the Bumpus's worthless pack of bloodhounds almost steal the show a couple of times), and (I feel) more realistic -- something the entire family can enjoy!\nMy favorite Christmas movie . . .\nAbsolutely Fabulous: Complete DVD Collection\nJennifer Saunders  (Actor),     Joanna Lumley  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'No one would ever accuse the Ab Fab duo, Patsy (Joanna Lumley) and Edina (Jennifer Saunders), of practicing restraint and refinement. And therein lies their—er, charm. They\\'re up to their usual outrageous tricks in these 6 new episodes of the runaway British sitcom smash. And the DVD serves up 80 additional minutes of delicious nonsense, including spot-on spoofs of movies, music, midmorning TV trash, and even Madonna. Also included is the original sketch that launched the lunacy. 3 hours on 2 cassettes or 1 DVD. Also available: Absolutely Fabulous Series 1-3. The first three seasons brought together in one complete set. Each DVD includes outtakes and a photo gallery, plus a bonus disc is packed with special features. Over 9 hours on 4 DVDs or 7 cassettes. Web Extra: The sketch that the series is based on—written by Dawn French and Jennifer Saunders—is titled \"Modern Mother and Daughter.\" Joanna Lumley (Patsy) co-starred with Patrick MacNee in \"The New Avengers\", and also appeared in the James Bond film \"On Her Majesty\\'s Secret Service\".', 'Amazon.com', '\"Inside of me there\\'s a thin woman trying to get out,\" complains the ever-suffering Edina. \"Are you sure it\\'s just the one, dear?\" asks her mother.', 'When anyone raves about', 'Sex and the City', ', you need only to remind her that the Brits did it first--and better--with the creation of the brave say-anything show about sex, drugs, and the battle of the bulge.', 'Absolutely Fabulous', 'is a groundbreaking, off-the-wall comedy from the early 1990s, which began with a skit from', 'The French and Saunders Show', ', about a moral, uptight daughter and her extremely loose mother.', 'Ab Fab', \"has taken this to the extreme. Edina (Jennifer Saunders) is the queen of excess. Her clothes are outrageous, her attempts at weight loss comical, and her efforts at motherhood (her daughter, Saffron--played to perfection by Julia Sawalha--is a practical-minded, reliable teenager) are uneven at best. Eddy's best friend is Patsy, a promiscuous Ivana Trump look-alike who always has a cigarette between her lips, a drink in her hand, and a fine-looking man (or boy) in her bed. The entire show lasted for three seasons, and all are included in this set. From organizing an orgy to a brush with poverty to the death of Eddy's father, nothing--and we mean nothing--is sacred in this show. Without a doubt,\", 'Ab Fab', \"is one of the greatest television satires created, although keep in mind that it's strictly for adults.\", '--Jenny Brown', 'Set Contains:', 'Each of the first three discs in the four-disc set features a season of the show, complete with outtakes and a photo gallery (which proves slightly frustrating, as you are unable to skip around the photos--they are shown only in order). The fourth disc has the majority of the extra features:', 'How to Be Absolutely Fabulous', ', a delightful behind-the-scenes look at the show;', 'Ab Fab Moments', ', a retrospective of the entire series;', 'Modern Mother and Daughter', ', the brilliant original skit from', 'French and Saunders', 'with Dawn French in the role of Saffy; picture galleries of the stars and guest celebrities; and a map of all the places Eddy and Patsy visited on the show.', '--Jenny Brown', 'See more']\n{'Genre': 'Music Videos & Concerts', 'Format': 'Box set, Color, DVD, Full Screen, NTSC', 'Contributor': 'Joanna Lumley, Jennifer Saunders', 'Language': 'English', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 10.4 Ounces', 'Media Format': 'Box set, Color, DVD, Full Screen, NTSC', 'Run time': '11 hours and 40 minutes', 'Release date': 'March 13, 2001', 'Actors': 'Jennifer Saunders, Joanna Lumley', 'Studio': 'BBC Warner', 'Number of discs': '4'}\nI saw my first episode of Ab Fab about 8 years ago and was instantly hooked! You will never find two more self-absorbed females on the planet. The dialogue is first-rate, the characters are marvelously written. You think your family is dysfunctional? Wait 'til you meet Eddie, Patsy, Saffy, and &quot;gran&quot; (not to mention the two ex-husbands, one with an &quot;odious boyfriend&quot;)! This set brings it all together -- all 18 episodes plus extras. An Ab Fab marathon -- what a concept!\nAbsolutely the best Britcom . . .\nMaking Opera: The Creation of Verdi's La Forza del Destino VHS\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Independently Distributed, Documentary\n['WINNER OF... -The International Communication Film & Video Competition- Golden HUGO -The National Education Film & Video Festival', 'Witness two stories: the making of an opera and the opera itself. A revealing look into the world of opera, this film follows the day-to-day creative process of staging a grand opera. Rehearsals, set design, costume fittings and more culminate in one final spectacular production.']\n{'Package Dimensions': '7.4 x 4.2 x 1.1 inches; 6.4 Ounces', 'Release date': 'February 6, 1996', 'Date First Available': 'September 29, 2006', 'Studio': 'View Video', 'Country of Origin': 'USA'}\nEver wonder what it takes to create an opera production?  This production documents 21 days of rehearsal for Toronto Opera's production of Verdi's _La Forza del Destino_.  Everything is covered: chorus rehearsal, set design and construction, costume design, wig production, staging.  One of the more difficult operas to produce, _Forza_ is nonetheless a great backdrop for the documentary.  It has one of those wildly improbable plots, full of twists and unexpected turns -- just what one might expect in putting on a production of this size and complexity.  As a veteran of more than a few such productions (as a singer, both chorus and soloist), I can speak from experience that Murphy's law definitely applies!  You learn quickly to roll with the punches and to expect the unexpected.<br />John Copley's brilliant stage direction along with Maurizio Arena's sensitive musical direction are highlighted.  The singing is first-rate, and seeing the production go from the earliest sing-throughs to early staging to final run-throughs with everything in place is truly fascinating.\nGreat behind-the-scenes look!\nVideo Visits: Discovering Ireland\nRated:    Unrated    Format: DVD\nMovies & TV, Movies\n['Experience the land of ancient myth, poetry and rebellion. A country that teems with nightlife, monuments and ruins. Explore famous places that include St. Patrick\\x92s Cathedral, the Guinness Brewery, the Rock of Cashel and the \"Giant\\x92s Causeway.\" Learn how Waterford crystal and harps are crafted. Watch a horse race, see a hurling match and\\x97go ahead\\x97kiss the famous Blarney Stone! Extra Feaures: Ireland\\'s National Parks - Two of the Emerald Isle\\'s national parks - Connemara and Glenveagh - are featured. Both of them are havens for diverse wildlife and natural beauty. Enjoy visiting these marvelous preserves of forested greenery. Galway Christmas Choir - Listen to the Galway Baroque singers and the Choristers of Belfast Cathedral perform four wonderful songs of the Christmas season: \"Good King Wencestas,\" \"The Zither Carol,\" \"Silent Night,\" and \"Gaudeamus Omnes.\"']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours', 'Release date': 'February 27, 2001', 'Actors': 'Discovering Ireland', 'Studio': 'Questar', 'Number of discs': '1'}\nI was pleasantly surprised by this DVD.  The photography and editing is excellent, and the organization is logical (coverage starts in Dublin, then moves south and west, then up the west coast, etc.).  I've visited Ireland three times, and the DVD covers a lot of sites/sights I'd seen on my trips, but also contains some \"new\" material.  Now I want to go back!<br /><br />For the price this is probably the best deal if you're looking for a good overview of the sights and landscape of Ireland.  If you've never been to Ireland, it will give you a good feel for the country; and if you've already visited Ireland, you can reminisce about familiar sights and places.  Highly recommended!\nWell done!\n1941\nJohn Belushi  (Actor),     Dan Aykroyd  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', \"Spectacular is certainly the word for this utterly wild comedy epic directed by Steven Spielberg and nominated for three Academy Awards. Lavish effects sequences highlight this hilarious, all-star extravaganza set in Los Angeles just days after the attack on Pearl Harbor, when fear of a Japanese invasion threw the city into a state of Pandemonium. Screwball characters run wild on Hollywood Boulevard as manic servicemen, zealous store owners, teary-eyed girls and bickering Nazis are thrown together in this fast-rising comic souffle that even features a sendup of Spielberg's own Jaws opening.\", 'Bonus Content:', 'The Making of 1941', 'The Making of 1941', 'Deleted Scenes', 'Deleted Scenes', 'Production Photographs', 'Production Photographs', '1941 Comic Relief', '1941 Comic Relief', 'The Marketing of 1941', 'The Marketing of 1941', 'The Reviews', 'The Reviews', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"Watching this director's cut, it's finally possible to see why the studio made Spielberg mercilessly hack up this comedy: it's a screaming movie (everyone screams a lot), and screaming movies do not need character development. So all those character-development scenes hit the cutting-room floor and, surprise, they were all critical to Spielberg's pace for the humor in this film. The screaming wasn't that funny then--and it still isn't--but what is funny are the reinserted development scenes, showcasing the now-evident sense of hysteria in the Los Angeles community, post-Pearl Harbor. A bunch of certified nitwits, and a few certified lunatics, act as if Tojo Hideki's entire Imperial force is just off the mainland. Actually, one Japanese submarine is, and it helps fuel the frenzy. John Belushi is Wild Bill Kelso, an insane fighter pilot, and Dan Aykroyd plays a conciliatory tank commander. Robert Stack's performance as General Stilwell, one of the best of the film, finally makes sense. Also fun for the numerous cameos, Spielberg's inside jokes, and John Williams's great score.\", '--Keith Simanton']\n{'Genre': 'Drama, Military & War, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Special Edition, Widescreen, NTSC, Letterboxed', 'Contributor': 'Lorraine Gary, Christopher Lee, Ned Beatty, Dan Aykroyd, John Belushi, Steven Spielberg', 'Initial release date': '2010-10-05', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 5.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.64 Ounces', 'Item model number': '1020550', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Special Edition, Widescreen, NTSC, Letterboxed', 'Run time': '2 hours and 26 minutes', 'Release date': 'October 5, 2010', 'Actors': 'John Belushi, Dan Aykroyd, Lorraine Gary, Christopher Lee, Ned Beatty', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nI can't help myself -- I LOVE this movie.  I think it's one of those flicks you either love or absolutely despise.<br /><br />From the opening sequence (a hysterical send-up of the \"Jaws\" opening) to the final crazy madness, I couldn't stop laughing.  Yes, the story is ridiculous (the \"love story\" especially is kind of dumb, and the \"sex only in an airplane\" is just stupid), but from what I've heard from older family members who lived in that part of the world in 1941, the movie accurately depicts the attitudes of many folks -- the near hysteria over possible additional attacks, the civilian look-outs, etc.  OK, so maybe it's a *little* exaggerated in this movie, but it was very real at the time.<br /><br />Everyone's sense of what's funny and what isn't is different, so this will definitely not appeal to EVERYONE.  But I count it among my favorite movies -- along with \"A Letter to Three Wives,\" \"Raising Arizona,\" \"Singing in the Rain,\" and \"Joe vs the Volcano.\"\nOne of my favorite movies ... seriously!\n{'Subtitles': ['None available'], 'Directors': ['The Paley Center for Media'], 'Producers': ['Chuck Lorre', 'Steve Molaro', 'Bill Prady'], 'Starring': ['Jim Parsons', 'Johnny Galecki', 'Kaley Cuoco']}\nIf you're a fan of &#34;The Big Bang Theory,&#34; you'll find this Q&A with the cast and creators interesting.  This was recorded during the 6th season, so there are references to several of that season's shows, as well as speculation as to the duration of the series.<br /><br />It's clear that the actors &#34;gel&#34; as well off screen as on, and some of the questions and answers provide &#34;behind the scenes&#34; information about the &#34;how&#34; and &#34;why&#34; of the set, the plots, likes, and dislikes.  Especially charming is the discussion of the Amy-Sheldon &#34;spanking&#34; scene.<br /><br />Highly recommended for TBBT fans.\nA \"must see\" if you're a fan of TBBT ...",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** Enjoys classic movies, family-oriented films, and British comedies with innovative narratives. Recently emphasized a passion for nostalgic holiday films and comedic series focused on character dynamics and wit.\n\n- **Nostalgia and Humor:** Has a deep attachment to childhood cinematic experiences that blend absurdity with heartfelt moments, particularly during festive seasons. Also appreciates behind-the-scenes insights into popular shows, deepening their understanding of creative storytelling.\n\n- **Genres:** Favors adventure and fantasy narratives alongside British sitcoms with sharp dialogue and community themes. Has developed a strong interest in travel documentaries that explore cultural landscapes, enhancing their appreciation for emotional depth and character development.\n\n- **Family Orientation:** Values wholesome, multi-generational entertainment, favoring stories that combine humor with relatable family themes rooted in absurdity.\n\n- **Character Appreciation:** Prioritizes dynamic, emotionally layered characters, recognizing the power of strong performances in comedic family contexts. Shows interest in understanding character interactions and development, especially regarding beloved shows.\n\n- **Critical Perspective:** Holds a nuanced view towards adaptations and comedies, favoring authentic portrayals that intertwine themes of acceptance and humor, leveraging nostalgia and social commentary.\n\n- **Engagement with Performances:** Enthusiastic about well-crafted documentaries and insider features, driven by a desire to comprehend creative processes and storytelling techniques, particularly in relation to family viewing experiences and historical contexts reflected through humor.",
  "metrics": {
    "rouge1_f": 0.04312316236524012,
    "rouge2_f": 0.0032679738562091504,
    "rougeL_f": 0.022868343678536424,
    "meteor": 0.013516238504608818,
    "bleu1": 7.526820375738827e-13,
    "bleu2": 1.7363809020836806e-13,
    "bleu3": 5.5736483667331335e-14,
    "bleu4": 1.7773596075267285e-14,
    "bertscore_precision": 0.35774296522140503,
    "bertscore_recall": 0.5371147394180298,
    "bertscore_f1": 0.4294515550136566
  }
}