{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: A Christmas Story\nReview Date: 2001/12/06\nStore: Yano Anaya  (Actor),     Peter Billingsley  (Actor),     Bob Clark  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"This delightfully funny holiday gem tells the story of Ralphie Parker (Peter Billingsly) a 1940's nine-year-old who pulls out all the stops to obtain the ultimate Christmas present.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Peter Billingsley, Bob Clark, Tedde Moore, Melinda Dillon, Colin Fox, Patty Johnson, Ward, Zack, R.D. Robb, Jim Hunter, Yano Anaya, Jeff Gillen, Helen E. Kaider, Paul Hubbard, Svoboda, David, Scott Schwartz, Dwayne McLean, Drew Hocevar, Darren McGavin, Ian Petrella, Leslie CarlsonPeter Billingsley, Bob Clark, Tedde Moore, Melinda Dillon, Colin Fox, Patty Johnson, Ward, Zack, R.D. Robb, Jim Hunter, Yano Anaya, Jeff Gillen, Helen E. Kaider, Paul Hubbard, Svoboda, David, Scott Schwartz, Dwayne McLean, Drew Hocevar, Darren McGavin, Ian Petrella, Leslie…   See more', 'Language': 'English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 1.6 Ounces', 'Director': 'Bob Clark', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'September 26, 2000', 'Actors': 'Yano Anaya, Peter Billingsley, Leslie Carlson, Melinda Dillon, Colin Fox', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nReview Text: Think back to those Christmases from your childhood ... Isn't there one that stands out in your memory as the &quot;Christmas to end all Christmases&quot;?  You wanted a particular toy more than anything, more than life itself.  You did everything in your power to ensure its delivery, behaving in your most responsible mature way, making sure Santa knew about it (you had your doubts about Santa, but you wanted to hedge your bets).<br />Such is the premise for &quot;A Christmas Story.&quot;  Peter Billingsley as Ralphie gives a sterling performance, a perfect combination of childhood naivete' and more mature observation.  Darrin McGavin is wonderful as Ralphie's dad, &quot;the old man,&quot; exuding boyish joy while at the same time trying to act like a &quot;father.&quot;  The only casting choice that I questioned was Melinda Dillon as Ralphie's mother -- she does a fine job, though, and in the end is a nice match for Darrin McGavin.<br />The story is narrated by Jean Shepherd himself, in a sort of midwest-accented Tom Bodette or Garrison Keillor style.  It works beautifully, lending a sort of sepia-toned nostalgic tone to the story.<br />If you're looking for a replacement (or addition) to &quot;It's a Wonderful Life,&quot; this is a good candidate.  It's funnier (the Bumpus's worthless pack of bloodhounds almost steal the show a couple of times), and (I feel) more realistic -- something the entire family can enjoy!\nReview Title: My favorite Christmas movie . . .\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Journey to the Center of the Earth VHS\nJames Mason  (Actor),     Pat Boone  (Actor),     Henry Levin  (Director)    &                   0                  more   Rated:    G    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Amazon.com', \"James Mason plays Professor Oliver Lindenbrook, a scientist hoping to find the world's core in this 1959 adaptation of the Jules Verne novel. He leads his unusual party on an expedition to the center of the earth, by way of a volcano in Iceland. On the way, they encounter enormous mushrooms and giant prehistoric monsters. Produced by Michael Todd with then-spectacular special effects, the story was modernized to 1950s sensibilities. Mason gives this class, while Arlene Dahl and Diane Baker are the romantic interests. And Pat Boone is more palatable than you might expect as a secondary lead. You can watch this with your children and not be bored, and they will surely love it.\", \"--Rochelle O'Gorman\"]\n{'Is Discontinued By Manufacturer': 'No', 'Language': 'English, French, Italian, Icelandic', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Director': 'Henry Levin', 'Run time': '2 hours and 12 minutes', 'Release date': 'January 2, 1996', 'Date First Available': 'November 3, 2006', 'Actors': 'James Mason, Pat Boone, Arlene Dahl, Diane Baker, Thayer David', 'Studio': '20th Century Fox', 'Producers': 'Charles Brackett', 'Writers': 'Charles Brackett, Jules Verne, Walter Reisch'}\nI first saw this on the &quot;big screen&quot; as a child, and was totally blown away by the special effects.  I'm still amazed at what they were able to do given the &quot;state of the art&quot; at the time (1959).  No, it's  not precisely the way Jules Verne wrote it, but the basics of the plot and  story are there.  James Mason is the archtypical passionate professor, and  quite good in this role.  Arlene Dahl does a fine job in what could have  been &quot;just another pretty face&quot; role.  She actually gives it some  character and &quot;spunk.&quot;  And Pat Boone works well in the student  role, once he gets past the cheesy &quot;Scottish&quot; accent.<br />This is a  great family flick -- minimal violence, nothing that would tempt other than  a &quot;G&quot; rating -- and the &quot;good guys&quot; win in the end.  Fantastic scenery, believable special effects -- a great way to spend an  afternoon!\nAs good now as it was then . . .\nBrassed Off! [DVD]\nPete Postlethwaite  (Actor),     Tara Fitzgerald  (Actor),     Mark Herman  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n[\"This delightfully entertaining comedy treat features hot screen stars Ewan McGregor (STAR WARS EPISODE 1: THE PHANTOM MENACE, MOULIN ROUGE) and sexy Tara Fitzgerald (SIRENS). It's the critically acclaimed story about two old friends -- and ex-lovers -- whose surprise reunion turns their lives ... and the lives of everyone else in town ... hilariously upside down! Also starring screen favorite Pete Postlethwaite (JURASSIC PARK: THE LOST WORLD; THE USUAL SUSPECTS) -- don't miss the fun of the laugh-filled comedy that entertained and captivated audiences everywhere!\"]\n{'Format': 'Closed-captioned, Color, DVD, Dolby, Widescreen, NTSC, Letterboxed', 'Contributor': 'Stephen Tompkinson, Sue Johnston, Mark Herman, Philip Jackson, Melanie Hill, Mary Healey, Tara Fitzgerald, Jim Carter, Peter Martin, Ewan McGregor, Lill Roughley, Peter Gunn, Pete PostlethwaiteStephen Tompkinson, Sue Johnston, Mark Herman, Philip Jackson, Melanie Hill, Mary Healey, Tara Fitzgerald, Jim Carter, Peter Martin, Ewan McGregor, Lill Roughley, Peter Gunn, Pete Postlethwaite  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'False', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Mark Herman', 'Media Format': 'Closed-captioned, Color, DVD, Dolby, Widescreen, NTSC, Letterboxed', 'Run time': '1 hour and 47 minutes', 'Release date': 'June 15, 1999', 'Actors': 'Pete Postlethwaite, Tara Fitzgerald, Ewan McGregor, Stephen Tompkinson, Jim Carter', 'Subtitles': 'English', 'Studio': 'Miramax', 'Writers': 'Mark Herman', 'Number of discs': '1'}\nSo, why do we do it?  We devote our meager free time to the pursuit of musical excellence, many of us in amateur brass bands, string orchestras, community choirs and the like -- for what purpose?<br />Because we MUST.  No  matter how dismal or depressed the rest of our lives are, there's always an  opportunity to create something beautiful, something truly magnificent, by  combining our talents with those of others.<br />The Grimley Colliery Band is  but one example of this.  Each member, all men but one newcomer, is facing  a crisis -- the closing of the coal mine into which they've poured their  sweat and energy for most of their lives, and the uncertain future to  follow.  Their director, Danny, demanding and hard-headed, has retired from  the mine, and doesn't seem to grasp the seriousness of the matter.  &quot;Music is EVERYTHING!&quot; he proclaims.  The members consider him  daft, as they struggle to balance family, the impending union/management  show-down, and finances.  It's only at a moment of crisis that they realize  the point:  Danny not only understands the situation, but he also knows  that MUSIC is the only thing that will get these proud men through the  storm together, whole and with some shred of self-respect.<br />Pete  Postlethwaite is brilliant as Danny; Tara Fitzgerald's understated  performance as Gloria, the only female member of the band, gives her  character a sense of integrity and honor that could easily have been  overlooked in favor of more &quot;marketable&quot; characteristics.  The  rest of the cast is remarkable.  Particularly notable is Stephen Tompkinson  as Phil, Danny's son, whose descent into abject depression seems to mirror  the daily descent into the black hole of the coal mine -- dark, dirty, and  dangerous.<br />I liked this movie far better than I thought I would when I  saw the cover of the DVD.  This is less a romance than an examination of  many lives made complete -- by music, by the pursuit of beauty and grace,  by focused cooperation.  It really doesn't get any better than this.\nThis movie speaks to all of us amateur musicians . . .\nP.D.Q. Bach - The Abduction of Figaro VHS\nFormat: VHS Tape\nMovies & TV, Digital VHS\n['P.D.Q Bach provides a madcap farce in this crazed pastiche on the Figaro saga. A wonderful funny performance with plenty of gags, both musical & visual. Entertaining & hilarious.']\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'February 10, 1997', 'Date First Available': 'September 29, 2006', 'Actors': 'P.  Schickele (P.D.Q. Bach)', 'Studio': 'Vai (Video Artists Inter.)'}\nYou already know going in that this will be funny.  PDQ Bach (Peter Schickele) has a long history of very clever musical satire.  I mean, who else can write music in the style of Bach, Mozart, and Handel, and call it something like &quot;Fanfare for the Common Cold,&quot; &quot;The Seasonings,&quot; &quot;Chorale Prelude On An American Hymn For The Last Sunday Before The Fourth Day Of The Seventh Month After New Year's Eve,&quot; and dedicate a piece to &quot;A nobleman, Count Pointercount&quot;?<br />At last, we have one of Schickele's major works on video, in a fully staged production by The Minnesota Opera.  The principals are quite good, and the chorus is excellent.<br />Peter Schickele clearly loves Mozart's operas.  There are numerous &quot;jokes&quot; based on Don Giovanni, Le Nozze di Figaro, Cosi fan Tutte, Abduction from the Seraglio, and The Magic Flute.<br />Like Mozart's operas, Abduction has a convoluted plot:  Susanna Susannadanna's husband, Figaro, is dying (&quot;Stay With Me&quot;).  However, before he can die, he is abducted by Captain Kadd (&quot;My Name is Captain Kadd, and I Am Very Very Very Very Very Very Bad&quot;).  Well, actually before he is abducted, Susanna is visited by Dona Donna who is searching for Donald Giovanni (&quot;Perfidy, Thy Name is Donald, Although They Call Thee Don for Short&quot;), who loved her and left her (Donna, that is, not Susanna).  There is a rescue attempted by the men (Donald and his mute companion, Schleporello), who are shipwrecked, who are then followed by the ladies who end up in the Pasha Shaboom's harem.  Well, you get the picture.<br />There are subtle and not-so-subtle parodies of specific Mozart arias (&quot;Batti, batti&quot; becomes &quot;Macho, macho, That's How All Men Are,&quot; and is followed immediately by &quot;You Can Beat Me,&quot; for example), but you don't need to know the Mozart works to appreciate the humor.  While some of the bits are perhaps a tad too broad, the clever lyrics and well-written music more than compensate.  One of the funniest bits in the entire work is the &quot;Caribbean Ballet&quot; in the style of Swan Lake, complete with pineapple headdresses in place of the usual feathers for the &quot;corps de ballet,&quot; and a &quot;Carmen Miranda&quot;-style Odile.<br />This is definitely worth seeing if you're already a fan of PDQ Bach.  It's definitely worth seeing even if you're not yet a fan.\nPDQ Bach's Operatic Masterpiece!\nSame Time Next Year VHS\nEllen Burstyn  (Actor),     Alan Alda  (Actor),     Robert Mulligan  (Director)    &                   0                  more   Rated:    PG    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['Product description', 'The best film ever about life and love in the turmoil of the mid 20th Century', 'Amazon.com', \"Bernard Slade's smart, funny, and touching play about an adulterous couple who meet one weekend a year for 26 years is nicely adapted for the screen by Robert Mulligan (\", 'To Kill a Mockingbird', ') in this 1978 film. The two-person story stars Alan Alda and Ellen Burstyn, both of whom are outstanding at conveying a rainbow of emotions over a quarter-century as life gives and takes away, and the world convulses with change. Mulligan brings taste and honesty to the film, and Alda and Burstyn give full, living performances.', '--Tom Keogh']\n{'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Package Dimensions': '7.3 x 4.5 x 1.1 inches; 7.36 Ounces', 'Director': 'Robert Mulligan', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 20, 1993', 'Date First Available': 'December 7, 2006', 'Actors': 'Ellen Burstyn, Alan Alda, Ivan Bonar, Bernie Kuby, Cosmo Sardo', 'Studio': 'Universal Studios Home Entertainment'}\nThis is one of those rare gems -- a movie based on a stage play that is true to the original.<br />The premise is simple:  a man and a woman happen to meet at a romantic Pacific coast inn in the 1950s, spend a night together, and discover that they're both married -- with children, no less!  How do they deal with it?  Well, after getting past the initial shock and guilt (she yells into a towel, he lies about his wife's name and the number of children he has), they agree to meet every year, same weekend, same place.  We, the audience, are allowed to observe every 5th meeting in the same room.<br />We see the changes in the relationship, the changes in each of the participants, the changing times.  We get to know Doris and George through these slices of time, laugh with them, cry with them, always with the question -- will they ever leave their respective partners and follow their hearts?  It's definitely a relationship based more on mutual respect and friendship, despite its extra-marital foundation.  You get the feeling that these two individuals are truly soul-mates who just happened to meet.<br />Alan Alda gives an amazing performance, beginning as a guilt-ridden rather milk-toast-ish accountant.  Without giving away the plot twists, he goes through many changes and personal crises, and still manages to stay a reasonably likable, vulnerable man.<br />Ellen Burstyn, as Doris, enters into this as a rather ditzy young wife on her way to a Catholic retreat with the nuns, who manages to grow up over the years.  It's a treat to see the changes in these characters with each change of scene.<br />Bernard Slade's original two-person play with its witty dialogue is preserved almost intact, with only one new character in the movie that isn't in the play (&quot;old Mr. Chalmers&quot;).  If anything, the movie improves the original through the music and photo montages that separate the scenes (the entre-acte song, &quot;The Last Time I Felt Like This&quot; was nominated for an Academy Award).<br />This is definitely worth seeing for the superb performances of Alda and Burstyn.\nWell written, well acted . . .\nBest in Show\nJennifer Coolidge  (Actor),     Christopher Guest  (Actor, Writer, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['A blue ribbon look at dog show participants and the pooches who love them.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Anamorphic, Widescreen', 'Contributor': \"Gordon Mark, Jennifer Coolidge, Christopher Guest, Michael McKean, Parker Posey, Eugene Levy, Jane Lynch, Fred Willard, Michael Hitchcock, Karen Murphy, Catherine O'Hara, John Michael HigginsGordon Mark, Jennifer Coolidge, Christopher Guest, Michael McKean, Parker Posey, Eugene Levy, Jane Lynch, Fred Willard, Michael Hitchcock, Karen Murphy, Catherine O'Hara, John Michael Higgins   See more\", 'Initial release date': '2005-12-13', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '85391895121', 'Director': 'Christopher Guest', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Anamorphic, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'December 13, 2005', 'Actors': 'Jennifer Coolidge, Christopher Guest, John Michael Higgins, Michael Hitchcock, Eugene Levy', 'Subtitles': 'English, French', 'Producers': 'Gordon Mark, Karen Murphy', 'Studio': 'Studio Distribution Services', 'Writers': 'Christopher Guest, Eugene Levy', 'Country of Origin': 'USA', 'Number of discs': '1'}\n... and Christopher Guest manages to find the essence of it.  I've known a few folks who are committed to the dog show lifestyle, and believe me when I say Guest actually seems to tone down some of the behavior.<br />Assembling the same cast he used in \"Waiting for Guffman,\" Guest turns 'em loose to create the scenes without much scripting, and with this group of talented improv players, it works pretty well.  Parker Posey and Michael Hitchcock as the lawyer-couple whose manic neuroses and screaming hissy fits turn their weimeraner into a total basket case (THEY think it's because their beloved Beatrice happened to see them ...) are completely over the top, but it actually works.  Eugene Levy and Catherine O'Hara are excellent as the suburban couple who make up little songs about terriers and deal with her seemingly endless string of ex-lovers.<br />As good as \"Best in Show\" is, it does resort to cliches a bit too often, and it just feels a little \"incomplete.\"  I'd like to see more careful character development (like we saw in \"Guffman\"), and a bit more story development.<br />That said, \"Best in Show\" is definitely worth a look, and a must-see for Christopher Guest fans or those involved in the dog show world.\nIt's a dog-eat-dog world out there ...\nFearless\nJeff Bridges  (Actor),     Isabella Rossellini  (Actor),     Peter Weir  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n{'Genre': 'Drama', 'Format': 'DTS Surround Sound, Full Screen, NTSC', 'Contributor': \"Spencer Vrooman, Eve Roberts, Rafael Yglesias, John de Lancie, Peter Weir, Isabella Rossellini, Daniel Cerny, Robin Pearson Rose, Tom Hulce, Deirdre O'Connell, Benicio Del Toro, John Turturro, Jeff Bridges, Rosie PerezSpencer Vrooman, Eve Roberts, Rafael Yglesias, John de Lancie, Peter Weir, Isabella Rossellini, Daniel Cerny, Robin Pearson Rose, Tom Hulce, Deirdre O'Connell, Benicio Del Toro, John Turturro, Jeff Bridges, Rosie Perez  See more\", 'Language': 'English, French', 'Runtime': '2 hours and 2 minutes'}\nA disturbing account of a man's survival and recovery from the post-traumatic effects of a plane crash, _Fearless_ will probably never be one of my &quot;favorite&quot; films.  But it certainly raises some interesting questions.<br />In brief, Jeff Bridges, in probably his best performance in any movie role to date, plays Max Klein, an architect who is intensely afraid of flying.  Max is traveling with his business partner from his home in San Francisco to a meeting in Houston.  Somewhere along the way something goes terribly wrong, and the plane crashes.  The film actually opens with Max leading some of the survivors to safety across a cornfield.<br />Through a series of flashbacks, we get a sense of Max's realization during the long descent in the plane that he's not afraid anymore.  Further, he's able to calm some of the other passengers, including a little boy who is traveling alone.<br />After the crash, Max has (somewhat predictable) trouble dealing with his family (Isabella Rosselini as his wife, Laura), with his partner's widow, the attorney involved in suing the airline (Tom Hulce), and the psychiatrist hired by the airline to counsel the survivors (John Turturro).  I mean, had he NOT had these difficulties, there wouldn't be much of a movie, would there?  His feelings of invincibility, his &quot;testing&quot; of God and fate -- all seemed almost cliche'd reactions.  That said, however, they were very well acted by Bridges.<br />The only person he *can* relate to is Carla, a young mother who also survived the crash, who is having a lot of difficulty coping with the fact that her 2-yr-old son, who she was holding in her arms at the time of the crash, did not.  Rosie Perez gives a brilliant performance as Carla -- I was absolutely amazed at how good she is in this role.  I'd only seen her in light comedies (White Men Can't Jump; It Could Happen to You), and thought she was an &quot;OK&quot; actress.  I was totally blown away by her performance, and found it the most emotionally challenging aspect of the film.  You *can't* watch her anguish and walk away unmoved by it.<br />Without giving away too much more of the plot, suffice it to say that Max is finally able to come to grips with his reaction to the aftermath of the crash.  The final scenes of the movie, in which the actual crash is replayed, are remarkable for their special effects.<br />I'm giving this movie 4 stars -- it's a good movie if you're in a particular frame of mind.  It's NOT a lightweight subject, and certainly not lightweight performances by the principals.  I thought parts of it were maybe a little *too* predictable, but all in all, worth a look.  Prepare to be &quot;WOW!&quot;ed by Rosie Perez.\nWorth seeing for the performance of Rosie Perez\nA Christmas Story\nYano Anaya  (Actor),     Peter Billingsley  (Actor),     Bob Clark  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"This delightfully funny holiday gem tells the story of Ralphie Parker (Peter Billingsly) a 1940's nine-year-old who pulls out all the stops to obtain the ultimate Christmas present.\"]\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Peter Billingsley, Bob Clark, Tedde Moore, Melinda Dillon, Colin Fox, Patty Johnson, Ward, Zack, R.D. Robb, Jim Hunter, Yano Anaya, Jeff Gillen, Helen E. Kaider, Paul Hubbard, Svoboda, David, Scott Schwartz, Dwayne McLean, Drew Hocevar, Darren McGavin, Ian Petrella, Leslie CarlsonPeter Billingsley, Bob Clark, Tedde Moore, Melinda Dillon, Colin Fox, Patty Johnson, Ward, Zack, R.D. Robb, Jim Hunter, Yano Anaya, Jeff Gillen, Helen E. Kaider, Paul Hubbard, Svoboda, David, Scott Schwartz, Dwayne McLean, Drew Hocevar, Darren McGavin, Ian Petrella, Leslie…   See more', 'Language': 'English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 1.6 Ounces', 'Director': 'Bob Clark', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'September 26, 2000', 'Actors': 'Yano Anaya, Peter Billingsley, Leslie Carlson, Melinda Dillon, Colin Fox', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nThink back to those Christmases from your childhood ... Isn't there one that stands out in your memory as the &quot;Christmas to end all Christmases&quot;?  You wanted a particular toy more than anything, more than life itself.  You did everything in your power to ensure its delivery, behaving in your most responsible mature way, making sure Santa knew about it (you had your doubts about Santa, but you wanted to hedge your bets).<br />Such is the premise for &quot;A Christmas Story.&quot;  Peter Billingsley as Ralphie gives a sterling performance, a perfect combination of childhood naivete' and more mature observation.  Darrin McGavin is wonderful as Ralphie's dad, &quot;the old man,&quot; exuding boyish joy while at the same time trying to act like a &quot;father.&quot;  The only casting choice that I questioned was Melinda Dillon as Ralphie's mother -- she does a fine job, though, and in the end is a nice match for Darrin McGavin.<br />The story is narrated by Jean Shepherd himself, in a sort of midwest-accented Tom Bodette or Garrison Keillor style.  It works beautifully, lending a sort of sepia-toned nostalgic tone to the story.<br />If you're looking for a replacement (or addition) to &quot;It's a Wonderful Life,&quot; this is a good candidate.  It's funnier (the Bumpus's worthless pack of bloodhounds almost steal the show a couple of times), and (I feel) more realistic -- something the entire family can enjoy!\nMy favorite Christmas movie . . .",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** Enjoys classic movies and family-oriented films, particularly those with innovative special effects and critically acclaimed narratives. Recently highlighted a preference for holiday films that evoke nostalgia and celebrate childhood memories.\n\n- **Nostalgia:** Strong attachment to childhood experiences tied to classic cinema, especially films that emphasize warmth and family connections during festive seasons.\n\n- **Genres:** Favors adventure and fantasy narratives, especially literary adaptations, as well as films focusing on community and personal growth. Interest in drama continues to grow, provided they feature strong character development and emotional depth.\n\n- **Family Orientation:** Actively seeks wholesome, family-focused entertainment, appreciating films that can be enjoyed by all ages.\n\n- **Character Appreciation:** Values dynamic and emotionally complex character portrayals, particularly in lead roles. An increased appreciation for performances that enhance narrative depth, including in warmly nostalgic and humorous contexts.\n\n- **Critical Perspective:** Maintains a nuanced view on film adaptations, preferring those that honor the original story while integrating powerful performances and themes.\n\n- **Engagement with Actors and Performances:** Recently acknowledged the significance of strong performances in family films, particularly those that balance humor and heartfelt moments, enhancing the overall viewing experience for families during special occasions.",
  "metrics": {
    "rouge1_f": 0.05914116739521728,
    "rouge2_f": 0.004116285052739903,
    "rougeL_f": 0.030341990228850608,
    "meteor": 0.018074221337967974,
    "bleu1": 6.763999859410637e-09,
    "bleu2": 1.7498255449361688e-09,
    "bleu3": 2.590926920604296e-10,
    "bleu4": 9.979459379431265e-11,
    "bertscore_precision": 0.3390442728996277,
    "bertscore_recall": 0.5087449550628662,
    "bertscore_f1": 0.406910240650177
  }
}