{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: QTMY Crystal Gemstone Headbands Baroque Hair Accessories Head Band Fashion Headwear Hairbands for Women,Pink\nReview Date: 2021/02/05\nStore: QTMY\nAverage Rating: 4.3\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 5.63 x 1.02 inches; 2.82 Ounces', 'Item model number': 'ZJ', 'Department': 'womens', 'Manufacturer': 'QTMY'}\nReview Text: The Qtmy crystal gemstone head band was so sophisticated and sparkly looking. I received the pink one. It fit perfectly. The head band itself is lightweight and comfortable. The value for your money is worth it because it can bring your outfit up from casual to formal.\nReview Title: Qtmy gemstone headband\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "BJÖRN HALL Nurse Headband with Buttons for Face Mask | Elastic Swimsuit Material, Smooth & Stretchy | Ear Saver Headband with Buttons | Perfect for Nurses, Doctors & Medical Students\nBjörn Hall\n{'Package Dimensions': '5.4 x 4.9 x 0.5 inches; 0.81 Ounces'}\nLove that the bjorn hall band came in black. It’s versatile to match my work uniforms . Made of very high quality material. The only thing I wasn’t crazy about was my buttons not seeming symmetrical. Other than that this head band will last a very long time.5 stars for me.\nBjorn hall headband\n8inch Short Afro Puff Synthetic Hair Bun Chignon Hairpiece For Women Drawstring Ponytail Kinky Curly Updo Clip Hair Extensions(1B#)\nBURHAIR\n{'Material': 'Synthetic', 'Hair Type': 'Curly, Coily', 'Brand': 'BURHAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '5.8 x 5.8 x 1.5 inches; 2.4 Ounces', 'UPC': '782947259689'}\nI loved this synthetic Afro puff for a number of resins , like color, puff factor, the drawstring, the fullness of the puff. The clips inside and drawstring helps the ponytail stay. It looked so realistic. The price was very low for such a good product.\n8inch Afro puff\nRhinestone Crystal Padded Headband Bejewled Statement Wide Hairband Charm Bridal Wedding Party Headwear Hair Hoop Hair Accessorie (gold)\nJERTOCLE\n{'Color': 'Gold', 'Material': 'Pearl, Crystal Rhinestone, Cloth, Rhinestone, Crystal', 'Fabric Type': 'Velvet', 'Brand': 'JERTOCLE', 'Item Form': 'Spiral', 'Package Dimensions': '6.93 x 6.69 x 2.36 inches; 4.16 Ounces'}\n[[VIDEOID:5c8e3999465f4761272a9d07dea2b960]] This head band is very sparkly. It’s so cute. Nice and thick. It’s made well. I wore it a few times . The only downside is that some of the Rinestones came off . I calmly just Re glued them back in.  I would wear this with dressy clothes. I think pricing was neutral for this product.\nRinestone crystal padded head band\nAmbari Black Crowns for Women Tiara Vintage Style Crown Hair Piece Accessories for Bride, Wedding, Prom, Birthday, Engagement, Bridal Shower - Baroque Jewelry for Women, New Packaging\nambari\n{'Product Dimensions': '4.53 x 4.53 x 2.36 inches; 6.38 Ounces', 'UPC': '645312483587'}\nThis crown was elegant in its own right. The crown itself wasn’t that thick. But in the jewel part of the crown it has thickness. Warmth from the crown was low. I feel like the quality of this crown is awesome. The color is nice and dark. I live the mysterious look of the crown. The price point was good. I recommend this.\nAmbari black crown\nOmbre Bomb Twist Crochet Hair Burgundy Pre Looped Crochet Braids 14 Inch\nJulyQueen\n{'Brand': 'JulyQueen', 'Extension Length': '14 Inches', 'Hair Type': 'Wavy', 'Package Dimensions': '3 x 2 x 1 inches; 2.56 Ounces'}\nThe bomb crotchet twist came with 6 packages of hair . Each pack had the right amount of thickness. The ombré color was perfect , and vibrant . The ends of the hair the color was very visible.. the color I had was the burgundy ombré hair. It is enough packs to install a whol head.  Another bang for your buck item.\nOmbré bomb twist crotchet hair\nOmbre Burgundy Prelooped Bomb Twist Crochet Hair Prelooped Crochet Braids 18 Inch\nUHair\n{'Brand': 'UHair', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '12.95 x 9.41 x 3.19 inches; 2.09 Pounds'}\nI loved the length of this hair. The ombré color was perfect . It came with six packs which was enough for my whole head. The hair was pretty good. My only dislike is that the styles only last for two weeks because the hair unravels. The price point is pretty good for six packs of hair.\nOmbré burgundy pre looped hair\n31 Pieces Hair Curlers Styling Kit, Magic Hair Spiral Curls No Heat DIY Waves Rollers with Styling Hooks Alligator Hair Clips Comb for Women Girls Long Hair Most Kinds of Hairstyles (45cm)\nfenshine\n{'Item Form': 'Clip, Comb', 'Hair Type': 'Thick', 'Size': '31 Piece Set', 'Brand': 'Fenshine', 'Color': 'Yellow,Blue,Green', 'Package Dimensions': '11.77 x 8.31 x 3.94 inches; 12.35 Ounces', 'UPC': '751433851669'}\nThis curlers styling kit came with 31 pieces which I loved. It came with clips. It also came with different color curl pieces. It is easy to use. It wasn’t uncomfortable to put on at all. It protects your hair from heat.it was fairly priced I recommend this product people who want curls and waves while protecting your hair from heat.\n31 piece curlers stylers kit\nQTMY Crystal Gemstone Headbands Baroque Hair Accessories Head Band Fashion Headwear Hairbands for Women,Pink\nQTMY\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 5.63 x 1.02 inches; 2.82 Ounces', 'Item model number': 'ZJ', 'Department': 'womens', 'Manufacturer': 'QTMY'}\nThe Qtmy crystal gemstone head band was so sophisticated and sparkly looking. I received the pink one. It fit perfectly. The head band itself is lightweight and comfortable. The value for your money is worth it because it can bring your outfit up from casual to formal.\nQtmy gemstone headband",
  "profile": "**User Profile Summary:**\n\n- **Profession**: Likely in the medical field, indicated by the use of a nurse headband.\n- **Color Preference**: Favors versatile colors that complement work uniforms, with a particular attraction to vibrant shades like burgundy and pink. Recently demonstrated a strong interest in stylish hair accessories, especially those that add a sophisticated touch and can elevate outfits from casual to formal.\n- **Material Quality**: Highly values high-quality, natural materials; appreciates smooth, durable textures. Shows preference for lightweight accessories that ensure comfort throughout long working hours.\n- **Functionality**: Emphasizes practical features in accessories, favoring easy-to-use items that integrate seamlessly into daily routines while providing styling options.\n- **Attention to Detail**: Notices design elements such as color vibrancy and sophistication, favoring well-finished products that are both visually striking and functional.\n- **Fashion Versatility**: Seeking items that transition effortlessly from casual to dressy, showing a heightened appreciation for unique and elegant accessories that enhance professional and formal attire.\n- **Overall Satisfaction**: Generally a positive reviewer, often giving high ratings based on quality, usability, and aesthetic appeal, finds value in accessories that elevate her overall look.\n- **New Insights**: Showcased an appreciation for sophisticated and sparkly accessories, valuing those that enhance outfits with a stylish flair while ensuring functionality and comfort. Enjoys styling tools that offer heat-free options, combining practicality with aesthetic benefits.",
  "metrics": {
    "rouge1_f": 0.17073170731707316,
    "rouge2_f": 0.02443609022556391,
    "rougeL_f": 0.06378986866791746,
    "meteor": 0.07723326590872102,
    "bleu1": 0.023576513195064527,
    "bleu2": 0.006981152899551185,
    "bleu3": 0.003555061887497694,
    "bleu4": 0.0021351319191602637,
    "bertscore_precision": 0.37616050243377686,
    "bertscore_recall": 0.479114294052124,
    "bertscore_f1": 0.42144083976745605
  }
}