{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Nature's Oil (USP Grade) Vegetable Glycerin 99.7% (10 lbs) 1 Gallon\nReview Date: 2021/09/22\nStore: Nature's Oil\nAverage Rating: 4.7\nProduct Details: {'Brand': \"Nature's Oil\", 'Item Weight': '10.49 Pounds', 'Item Volume': '1 Gallons', 'Percentage assay': '99.7', 'Package Information': 'Bottle', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '12.5 x 11.2 x 5.6 inches; 10.49 Pounds', 'Item model number': 'SturdyHH21', 'Manufacturer': \"Nature's Oil\"}\nReview Text: I bought this for my homemade herbal tinctures.  Unfortunately,  the top was damaged and leaking.\nReview Title: Poorly designed top\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "6 Pieces Bouffant Caps with Buttons, Soft Unisex Stretch Headband Elastic Turban Headwrap with Ear Loop Holder Button (Black, Grey, Lake Blue, Royal Blue, Navy, Purple)\nGeyoga\n{'Age Range (Description)': 'Adult', 'Material': 'Cotton', 'Fabric Type': 'Elastic', 'Number of Items': '1', 'Brand': 'Geyoga', 'Package Dimensions': '12.24 x 10.2 x 1 inches; 7.05 Ounces'}\nI bought these for my son who is on the autism spectrum.  Because of his sensory issues,  he hates the ear loops on his mask that he wears to school.  These are super comfortable and the mask loops can be moved to the side buttons.  I was a little concerned that he would get hot wearing a hat all day, but they are very lightweight and breathable.\nVery comfortable\nImplantClean Dental Implant Toothbrush - for implants, bridges, fixed dentures, and gums - SOFT Bristles\nIMPLANT & PERIO CARE\n{'Brand': 'IMPLANT & PERIO CARE', 'Age Range (Description)': 'Adult', 'Item Firmness Description': 'Soft', 'Number of Items': '1', 'Unit Count': '1.00 Count'}\nIt fell apart after a few uses\nPoor quality\nHair Scrunchies for Girls Hair Ties 7PCS Candy Color Hair Accessories Luminous Hair Scrunchies Bands Soft Elastic Scrunchies Satin Soft Hair Scruchy Natural Glow Only in the Dark Night Hair Accessories for Women and Girls\nDOTKV\n{'Color': 'Yellow,Orange,Blue,Green,White,Purple', 'Material': 'Satin', 'Item Form': 'Scrunchie', 'Brand': 'DOTKV', 'Hair Type': 'All, normal', 'Package Dimensions': '6.1 x 4.33 x 1.97 inches; 1.76 Ounces', 'UPC': '194852280144'}\nI bought these for my daughter who loves cosmic bowling.  I thought these would be great for tying her hair up and would look nice under the blacklight.  They are made out of a fluffy chenille material that is super stretchy.  They look nice in regular light, but really shine under a black light.\nGlows under a blacklight\n3 Pieces Detangling Hairbrush Unicorn Plastic Massage Comb Paddle Hair Brush Unicorn Hair Detangler Brush for Women Girls Curly Straight Long Thin Soft Natural or Short Hair (Vivid Pattern)\nPatelai\n{'Brand': 'Patelai', 'Shape': 'Oblong', 'Handle Material': 'Plastic', 'Special Feature': 'Detangling, Long lasting', 'Product Benefits': 'Detangle', 'Package Dimensions': '10.4 x 4.7 x 1.8 inches; 9.59 Ounces'}\nI bought these for my daughter who loves unicorns.  She is also on the autism spectrum so she has a lot of sensory problems.  Brushing her hair can be a challenge because she hates when it pulls her hair.  These are a great idea because they are so comfortable.  The plastic bristles massage her scalp and the paddle shape smooths her hair without snagging.  Plus she loves the cool unicorn designs.\nSuper cute\nWeiwey Extra Thick Dry Wipe, 100% Cotton, Unscented Cotton Tissues for Sensitive Skin (1 PACK-80PCS)\nweiwey\n{'Brand': 'weiwey', 'Skin Type': 'Sensitive', 'Sheet Count': '80', 'Recommended Uses For Product': 'Cleansing', 'Material': 'Cotton', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.08 x 4.41 x 2.36 inches; 4.8 Ounces', 'UPC': '763347936332'}\nI bought these for a friend who does theater.  He has to wear a lot of pancake makeup that is kind of hard to remove.  These are so much better than regular makeup wipes because of the texture and strength.  He can use a dry one first off to wipe away a lot of it then another one with make up remover to clean off the rest.  Afterwards,  he can throw them out instead of trying to wash a dirty washcloth every time.\nGood for makeup removal\nkeystand 2 Pack baby wipes dispenser ,Wipes Case Fits up to 60/120 wipes,Paper towels Wipes Dispenser Baby Wipes Case,Carry-on Baby Wipe holder,Keep Wipe Fresh\nkeystand\n{'Brand': 'Keystand', 'Unit Count': '1.00 Count', 'Number of Items': '2', 'Age Range (Description)': 'Baby', 'Product Benefits': 'Clean', 'Package Dimensions': '10.28 x 6.42 x 3.27 inches; 10.23 Ounces', 'Item model number': '0'}\nI bought this for my sister who is having a baby.  Her nursery has a black and white theme which kind of makes me feel like I am inside a domino,  but this fits in great.  A full sized refill pack of diaper wipes fits in it easily so there's no guesswork about how many to put inside.  The silicone lid ensures that it is airtight and the wipes don't dry out.  I mainly bought it for the big container,  but I really like the travel one that it came with too.  It's easy to fill and has a handle little handle for carrying it.\nSuper cute\nMagnetic Eyelashes with Eyeliner Kit - 8 Pairs Invisible Magnetic False Eyelashes and Black Eyeliner of 2 Tubes Sets, Auchois 3D Reusable Natural Look Fake Eyelashes, Faux Mink Lashes Pack\nAUCHOIS\n{'Brand': 'AUCHOIS', 'Material': 'Faux Mink', 'Item Dimensions LxWxH': '9.2 x 5.7 x 0.78 inches', 'Material Feature': 'Latex Free', 'Unit Count': '1.00 Count', 'Product Dimensions': '9.2 x 5.7 x 0.78 inches; 2.4 Ounces', 'Item model number': 'BME001'}\n[[VIDEOID:cb9b4f9df532525269b6bd626cc29f60]] I have heard horror stories about people accidentally gluing their eyes shut with eyelash adhesive.  My sister wanted to try some for her wedding and I thought this would be a safer option.  It's as easy as applying eyeliner.  The magnets on the back of the lashes automatically stick to the eyeliner and stay in place until you remove them.  They seem well made and look natural.  The set includes 8 pairs of lashes, a case with a mirror,  the special eyeliner,  and even a pair of tweezers made for eyelashes.\nSo easy to use\nEarthWise Aromatics Lemon Balm - 100% Natural - 1 lb (16oz)\nEarthWise Aromatics\n['16 oz of Lemon Balm Herb']\n{'Brand': 'EarthWise Aromatics', 'Scent': 'Lemon', 'Item Form': 'Balm', 'Unit Count': '16 Ounce', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.3 x 9.72 x 2.95 inches; 15.84 Ounces', 'Manufacturer': 'EarthWise Aromatics'}\nI love lemon balm and I even grow my own.  I wanted to buy some to get me through the winter,  but this is not it.  I have no idea what it is, but it tastes like grass.  It's definitely not lemon balm.  At least I didn't spend too much on it.\nGross\nNature's Oil (USP Grade) Vegetable Glycerin 99.7% (10 lbs) 1 Gallon\nNature's Oil\n{'Brand': \"Nature's Oil\", 'Item Weight': '10.49 Pounds', 'Item Volume': '1 Gallons', 'Percentage assay': '99.7', 'Package Information': 'Bottle', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '12.5 x 11.2 x 5.6 inches; 10.49 Pounds', 'Item model number': 'SturdyHH21', 'Manufacturer': \"Nature's Oil\"}\nI bought this for my homemade herbal tinctures.  Unfortunately,  the top was damaged and leaking.\nPoorly designed top",
  "profile": "**User Profile Summary**\n\n- **Demographics:** Parent of a child on the autism spectrum.\n\n- **Key Preferences:**\n  - Prioritizes comfort and sensory-friendly products.\n  - Values lightweight and breathable materials that alleviate discomfort.\n  - Enjoys whimsical, engaging designs that provide sensory enjoyment and visual appeal.\n  - Emphasizes durability and quality for long-lasting use.\n  - Shows increasing interest in natural products for family use, reflecting a commitment to healthier options.\n\n- **Behavior Patterns:**\n  - Actively engages with products enhancing sensory experiences while managing sensitivities.\n  - Adopts a practical approach, seeking creative, functional solutions that delight visually.\n  - Remains vigilant about product reliability, often seeking safer alternatives based on past experiences.\n  - Recent interactions highlight a focus on quality and practicality, especially in relation to product packaging and usability, with a clear preference for solutions that meet sensory needs and integrate into themed environments.\n\n- **Shopping Focus:**\n  - Seeks functional, comfort-oriented items designed for managing sensory sensitivities, increasingly favoring products that combine aesthetics and practicality.\n  - Prioritizes durability and quality, with a notable emphasis on selecting items that withstand use over time.\n  - Experiences with less enjoyable items have reinforced the importance of user-friendly design and reliable packaging in selections, particularly concerning everyday applications for family use.",
  "metrics": {
    "rouge1_f": 0.1292307692307692,
    "rouge2_f": 0.015408320493066254,
    "rougeL_f": 0.06923076923076923,
    "meteor": 0.04554359664418202,
    "bleu1": 0.002998669724845129,
    "bleu2": 0.0009347065193630379,
    "bleu3": 0.000484295237841565,
    "bleu4": 0.00029343173370724966,
    "bertscore_precision": 0.3606891930103302,
    "bertscore_recall": 0.4715365171432495,
    "bertscore_f1": 0.40873077511787415
  }
}