{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Karuna Oh, Glow On Face Mask Sheet, Skincare and Beauty Facial Masks with Moisturizing and Collagen Promotion Properties for Healthy Glow, Contain Green Tea, Vitamin C and Pineapple (3 Sheets)\nReview Date: 2020/10/23\nStore: Karuna\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrate Skin,Hydrate', 'Scent': 'Pineapple', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.54 x 4.88 x 0.87 inches; 9.59 Ounces', 'Item model number': 'MSF1004 - CA', 'UPC': '857950007166'}\nReview Text: I don't normally like to use sheet masks, but I really like these. My face felt so soft and moisturized adter using them. I would buy these again I liked them so much.\nReview Title: Love these sheet masks\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Wonder4 Electric Callus Remover - Rechargeable Electric Foot File Callus Shaver Hard Skin Remover Pedicure Tools with 3 in 1 Roller Heads, for Cracked Heels Calluses and Dead Skin\nWonder4\n{'Brand': 'Wonder4', 'Is Electric': 'Yes', 'Item Form': 'Roller', 'Style': 'Modern', 'Unit Count': '11.4 Ounce'}\nThis does exactly what it's supposed to do! Easy to use, my feet are super soft afterwards. Charges quickly. Great choice!\nWorks Wonderfully!\nEasydew 2-Step Face Contour Sheet Mask - Tightening & Anti-Aging & Hydrating Korean Face Mask with DW-EGF, Hyaluronic Acid for Anti-Winkle, Reducing Fine Line & Producing Collagen (Qty 5)\nEASYDEW\n{'Brand': 'EASYDEW', 'Item Form': 'Sheet', 'Scent': 'Honey', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'Yes', 'Package Dimensions': '8.35 x 6.38 x 0.63 inches; 7.44 Ounces', 'Item model number': 'EETS1003', 'Manufacturer': 'CleveAid'}\nI am obsessed with face masks! These arrived quickly and were well packaged. They have no scent, which is a good thing. Each mask has 2 steps... 1st step is four contour pads for under eye and frown lines and 2nd step is a full sheet mask. It feels amazing on my face! It doesn't shift around at all. I leave it on for 30 minutes and then apply my nighttime moisturizer.<br /><br />Relaxing  to wear<br />My skin really felt more firm after I used it<br />Closed my pores<br /><br />Overall, I really liked this mask. I have tried probably 100 different face masks in my life and this is definitely in my TOP 5.\nSTOP and BUY THIS! GO!\nLeuxe Facial Cleansing Brush, IPX6 Waterproof Rotating Face Brush for Deep Cleansing, 3 Modes and Smart Timer\nleuxe\n{'Brand': 'leuxe', 'Power Source': 'electric', 'Product Benefits': 'Softening,Pores,Cleansing', 'Skin Type': 'All', 'Operation Mode': 'Automatic', 'Package Dimensions': '6.2 x 4 x 2.7 inches; 11.99 Ounces', 'UPC': '631517347748', 'Manufacturer': 'leuxe'}\nWhen I first began using this I definitely broke out a little more on my chin. I feel like it's because it really got deep down into my pores and brought all the breakouts to the surface. I was able to heal them at once and now my skin has maintained a clear appearance! So get past the beginning phase and you're good to go!\nI can see and feel the difference.\nDr. Denese SkinScience Essential Lipid Anti Aging Power Infusion Dry Oil - Skin Nutrients 97% Organic 100% Natural - Rejuvinating Blend with Amaranth & Resveratrol - Paraben-Free, Cruelty-Free - 2oz\nDr. Denese\n{'Brand': 'Dr. Denese', 'Item Form': 'Dr. Denese', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.57 x 3.15 x 3.07 inches; 5.61 Ounces', 'Item model number': '800166A', 'UPC': '811684022284', 'Manufacturer': 'Dr. Denese'}\nI wanted to use this for a while before I wrote a review and I absolutely love this stuff! It goes on easily and absorbs well. I feel like my skin looks smoother. I defintely recommend it!\nLOVE LOVE LOVE!\nBioken] Cera Silkway Salon Quality Hair Serum - Enriched Premium Argan Oil (1.7 fl oz)\nBioken\n{'Hair Type': 'All', 'Scent': 'Argan Oil', 'Liquid Volume': '1.7 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'Bioken', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.3 x 1.81 x 1.77 inches; 4.96 Ounces', 'UPC': '856312005529'}\nYou know when you get your hair done and you leave the salon with your hair smelling amazing the rest of the day...that's what this serum is like! It smells so good. I use it when my hair is wet or when I am just refreshing it mid day. Love it!\nSMELLS AMAZING!\nKaruna Oh, Glow On Face Mask Sheet, Skincare and Beauty Facial Masks with Moisturizing and Collagen Promotion Properties for Healthy Glow, Contain Green Tea, Vitamin C and Pineapple (3 Sheets)\nKaruna\n{'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrate Skin,Hydrate', 'Scent': 'Pineapple', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.54 x 4.88 x 0.87 inches; 9.59 Ounces', 'Item model number': 'MSF1004 - CA', 'UPC': '857950007166'}\nI don't normally like to use sheet masks, but I really like these. My face felt so soft and moisturized adter using them. I would buy these again I liked them so much.\nLove these sheet masks",
  "profile": "**User Profile Summary:**\n\n- **Overall Satisfaction:** The user is dedicated to effective personal care products, with recent interactions showcasing a strong commitment to enhancing their skin health while maintaining a focus on hair care.\n\n- **Product Type Preference:** The user demonstrates a broad interest in personal care, particularly in hair care oils and serums, alongside an appreciation for sheet masks and nourishing skin oils. Their recent acquisition of sheet masks reflects an expanding focus on hydrating and revitalizing skin.\n\n- **Functionality Focus:** They prioritize products that deliver visible results for skin hydration and nourishment, seeking out items that improve both texture and scent appeal.\n\n- **Convenience & Efficiency:** The user values ease of application; products chosen are designed for quick absorption and are integrated seamlessly into their self-care routines, enhancing their experience without requiring significant effort.\n\n- **Positive Experience:** Recent purchases indicate a trend of satisfaction with product performance, reinforcing their journey toward healthier skin, highlighted by smoothness and moisture.\n\n- **Aesthetic Appeal:** The user continues to favor visually appealing and modern personal care products, appreciating innovative design and functionality in both skincare and hair care.\n\nOverall, the user profile emphasizes an ongoing exploration of effective, stylish, and easy-to-use personal care solutions that provide visible improvements, contributing to a comprehensive self-care regimen tailored to their diverse beauty needs.",
  "metrics": {
    "rouge1_f": 0.16382978723404254,
    "rouge2_f": 0.017057569296375266,
    "rougeL_f": 0.06808510638297871,
    "meteor": 0.06781242893221781,
    "bleu1": 0.022873496238506305,
    "bleu2": 0.0042071900818317865,
    "bleu3": 0.000770967653666902,
    "bleu4": 0.0003303376480715916,
    "bertscore_precision": 0.3594595789909363,
    "bertscore_recall": 0.4591418504714966,
    "bertscore_f1": 0.40323150157928467
  }
}