{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mtmei hair 5Packs 10\" Pre-twisted Spring Twist Hair Crochet Braids 15 Strands/Pack Nubian Bomb Twist Crochet Hair Messy Fluffy Spring Twist Crochet Hair Extensions(T27)\nReview Date: 2020/07/22\nStore: Mtmei hair\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Mtmei hair', 'Material': 'Human Hair', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.02 x 7.52 x 2.76 inches; 11.99 Ounces', 'UPC': '765470972508'}\nReview Text: There are pros and cons to this hair.  This hair is very soft and very stretchy, so it can be pulled back out of your face. I love that this came with a crochet hook.  The T27 color is pretty BUT it is very frizzy, especially on the blonde ends.  It came straight out of the package frizzy, so I was very disappointed.  It looks like hair that has been in someone's hair for 2-3 weeks before I received it.  it's possible to make the 5 packs work, but I would've preferred to have 6 packs of hair included to make sure there weren't too many gaps without any colored hair, especially since my natural hair color is dark brown.  Overall the hair is just OK.  Next time I'll go for hair that is a better quality.\nReview Title: It's OK\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Mtmei hair 5Packs 10\" Pre-twisted Spring Twist Hair Crochet Braids 15 Strands/Pack Nubian Bomb Twist Crochet Hair Messy Fluffy Spring Twist Crochet Hair Extensions(T27)\nMtmei hair\n{'Brand': 'Mtmei hair', 'Material': 'Human Hair', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.02 x 7.52 x 2.76 inches; 11.99 Ounces', 'UPC': '765470972508'}\nThere are pros and cons to this hair.  This hair is very soft and very stretchy, so it can be pulled back out of your face. I love that this came with a crochet hook.  The T27 color is pretty BUT it is very frizzy, especially on the blonde ends.  It came straight out of the package frizzy, so I was very disappointed.  It looks like hair that has been in someone's hair for 2-3 weeks before I received it.  it's possible to make the 5 packs work, but I would've preferred to have 6 packs of hair included to make sure there weren't too many gaps without any colored hair, especially since my natural hair color is dark brown.  Overall the hair is just OK.  Next time I'll go for hair that is a better quality.\nIt's OK",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Engages with hair extensions, specifically pre-twisted and crochet styles.\n- **Quality Sensitivity:** Shows a preference for high-quality materials; prefers soft and stretchy options. Disappointment is expressed over frizz and perceived quality issues, indicating a strong desire for durability and appearance.\n- **Color Consideration:** Values specific shades but expects the product to match or complement natural hair color. Notable concern over the contrast of the purchased color versus personal hair color.\n- **Packaging Expectations:** Expects adequate quantity in a pack for full coverage, displaying a tendency towards thoroughness in product selections.\n- **Practicality with Tools:** Appreciates inclusion of tools (like crochet hooks) that facilitate use, highlighting a focus on ease of application.\n- **Overall Attitude:** Exhibits a balanced outlook on products with specific likes and dislikes; leans towards cautious purchasing in the future, indicating she may seek better quality alternatives.\n\nThis summary reflects a user that prioritizes quality, color compatibility, and practical use in hair extension products.",
  "metrics": {
    "rouge1_f": 0.26301369863013696,
    "rouge2_f": 0.049586776859504134,
    "rougeL_f": 0.12602739726027395,
    "meteor": 0.16155147061085492,
    "bleu1": 0.24481013273887564,
    "bleu2": 0.07695610675263032,
    "bleu3": 0.028840470095508674,
    "bleu4": 0.009940039952873379,
    "bertscore_precision": 0.43125030398368835,
    "bertscore_recall": 0.46188798546791077,
    "bertscore_f1": 0.4460436701774597
  }
}