{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bomb Twist Crochet Hair 12 Inch Pre-Looped Senegalese Spring Twist Crochet Braids Hair Curly End Synthetic Hair Extension 24Roots Short Ombre Passion Twist Braiding Hair (#1B)\nReview Date: 2020/11/02\nStore: Belle Show\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '12 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.94 x 10.39 x 3.31 inches; 13.72 Ounces'}\nReview Text: This hair is gorgeous! I love this hair.  It's beautiful.  These twists are very small so your hair pattern would have to match accordingly.  I think if you have smaller cornrows in the front and combine a 2-3 cornrows into one large cornrow in the back of the hair, this will be enough hair for one hair style.  Spacing is everything when it comes to prepackaged hairstyles.  Overall I have no complaints about this hair, and I highly recommend.\nReview Title: Beautiful!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mtmei hair 5Packs 10\" Pre-twisted Spring Twist Hair Crochet Braids 15 Strands/Pack Nubian Bomb Twist Crochet Hair Messy Fluffy Spring Twist Crochet Hair Extensions(T27)\nMtmei hair\n{'Brand': 'Mtmei hair', 'Material': 'Human Hair', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.02 x 7.52 x 2.76 inches; 11.99 Ounces', 'UPC': '765470972508'}\nThere are pros and cons to this hair.  This hair is very soft and very stretchy, so it can be pulled back out of your face. I love that this came with a crochet hook.  The T27 color is pretty BUT it is very frizzy, especially on the blonde ends.  It came straight out of the package frizzy, so I was very disappointed.  It looks like hair that has been in someone's hair for 2-3 weeks before I received it.  it's possible to make the 5 packs work, but I would've preferred to have 6 packs of hair included to make sure there weren't too many gaps without any colored hair, especially since my natural hair color is dark brown.  Overall the hair is just OK.  Next time I'll go for hair that is a better quality.\nIt's OK\nzelaxy Mask Strap Extenders, Soft Silicone Mask Holders for Relieve Ear Pain Caused by Mask (Dot)\nzelaxy\n{'Package Dimensions': '7.5 x 4.7 x 0.2 inches; 3.99 Ounces', 'Manufacturer': 'zelaxy'}\nThese Mask Strap Extenders are so comfortable! They're soft and it's easy to forget you have them on.  I love how they help keep my masks that are too large in place and snug where they need to be.  I love that there's no pressure on my ears whatsoever! These are phenomenal.  I highly recommend!\nComfortable and Necessary\nOmbre Burgundy Prelooped Bomb Twist Crochet Hair Prelooped Crochet Braids 18 Inch\nUHair\n{'Brand': 'UHair', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '12.95 x 9.41 x 3.19 inches; 2.09 Pounds'}\nI love this hair! It's GORGEOUS!!!  The color is perfect.  I love that these look neat and uniform.  The ends are curled to perfection.  There is definitely enough hair included to complete your full head without too many gaps.  The orange thing included looks more like a wrist band than a hair tie, but use it as you see fit.  This hair is phenomenal.  I highly recommend.\nLOVE!!!!\nToyotress Sierra Passion Braid Crochet Hair - 24 inch 8 Packs Jumbo Box Braids with Curly End Synthetic Braiding Hair Extensions (24 Inch, 1B)\nToyoTress\n{'Brand': 'ToyoTress', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '14.61 x 10.28 x 3.31 inches; 2.14 Pounds'}\nI was hesitant to order these because I didn't think I'd like the design of the braids, but after receiving them they are beautiful.  They look really nice when completely installed.  These are neat, and frizz free.  I prefer to wash my hair before the install to remove any smell the hair may have picked up in transit.  I cannot say enough about this hair.  Buy it now! I highly recommend!\nBeautiful!\nYsesoAi 28 Pcs Hair Curlers Spiral Curls No Heat Wave Hair Curlers Styling Kit Spiral Hair Curlers Magic Hair Rollers with 2 Pieces Styling Hooks for Most Kinds of Hairstyles (20 cm/ 7.8 inches)\nYsesoAi\n{'Hair Type': 'Curly', 'Brand': 'YsesoAi', 'Color': 'Pink, Blue, Ivory, Yellow, Green', 'Item Dimensions LxWxH': '1.5 x 1.7 x 1.1 inches', 'Unit Count': '1.00 Count', 'Product Dimensions': '1.5 x 1.7 x 1.1 inches; 6.38 Ounces', 'UPC': '745895771436'}\nMy hair is just about too long for these, so I won't be getting much use out of them.  These do not look like it would be easy to achieve spiral curls with these rollers, because they roll straight on themselves like regular rollers, and do not come looking spiral like the advertisement picture suggests! I feel mislead! I'm sure I could try to get the outcome to look spiral but I do not have high hopes.  I would suggest a different product that arrives looking just like the picture in advertisement.\nFor Short Hair Only!\nZWIFEJIANQ Silicone Back Scrubber,Exfoliating Lengthen Silicone Bath Body Brush for Men and Women,Deep Clean & Invigorate Your Skin(30 inch, Green)\nZWIFEJIANQ\n{'Package Dimensions': '7.28 x 4.65 x 2.17 inches; 7.83 Ounces', 'UPC': '781076826113'}\nI ordered this for my sister, and this is what she had to say:  She wanted it because she thought it would be exfoliating.  The bumpy side feels really nice but she was unsure of it's purpose outside of a general massage.  The scrubbing side of it also felt great, but she didn't trust that is was actually cleansing her back because the bristles are so soft.  She wishes it were longer; it doesn't stretch so she was limited in her range of motion while cleansing her back.  After using this body brush she said she still felt like she needed to follow up with a wash cloth to ensure that her body was cleansed to her liking.\nA little better than okay\n6 Packs Short Spring Twist Crochet Hair Ombre Bomb Bob Curly Spring Pre-twisted Braids Synthetic Fluffy Hair Extensions (6, T27)\nlianlian\n{'Brand': 'Lianlian', 'Material': 'Synthetic', 'Extension Length': '10 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.79 x 7.76 x 2.83 inches; 15.94 Ounces'}\nThis hair is beautiful.  The ends are frizzy straight out of the pack, but after installed the hair is beautiful!  The only off putting thing about this hair is that this hair is rough.  I would recommend washing this hair and maybe soaking this hair in fabric softener for about 15, because it is made up of synthetic fibers in order to soften up this hair a bit.  Other than that, I highly recommend this hair. Make sure you space this hair out, so that the 6 packs will complete your entire hairstyle.\nHard Hair\nBomb Twist Crochet Hair 12 Inch Pre-Looped Senegalese Spring Twist Crochet Braids Hair Curly End Synthetic Hair Extension 24Roots Short Ombre Passion Twist Braiding Hair (#1B)\nBelle Show\n{'Brand': 'Belle Show', 'Material': 'Synthetic', 'Extension Length': '12 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.94 x 10.39 x 3.31 inches; 13.72 Ounces'}\nThis hair is gorgeous! I love this hair.  It's beautiful.  These twists are very small so your hair pattern would have to match accordingly.  I think if you have smaller cornrows in the front and combine a 2-3 cornrows into one large cornrow in the back of the hair, this will be enough hair for one hair style.  Spacing is everything when it comes to prepackaged hairstyles.  Overall I have no complaints about this hair, and I highly recommend.\nBeautiful!",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** The user remains enthusiastic about hair extensions, especially vibrant and trendy styles like crochet and braids, with a continuing exploration of shorter, stylish options that allow for versatile looks. \n\n- **Quality Sensitivity:** A focus on high-quality materials persists, now amplified by a recent positive experience with a beautiful, well-made product, despite previous concerns regarding texture in some purchases.\n\n- **Color and Design Considerations:** The user appreciates colors harmonious with their natural shade and continues to exhibit an openness to diverse styles. \n\n- **Packaging Expectations:** Expectations for adequate quantities per pack remain important, as the user values sufficient coverage during installations.\n\n- **Practicality with Tools and Accessories:** The user maintains a strong appreciation for practical tools that enhance usability and comfort, with ongoing receptiveness to innovative accessories.\n\n- **Comfort and Functionality:** Combining aesthetic appeal with practical demands remains a priority, with a notable interest in selected products being easy to work with.\n\n- **Overall Attitude:** The user maintains a generally positive disposition toward products, reinforced by a recent favorable review of a new purchase, showcasing their satisfaction with the product's appearance and recommendability.\n\n- **New Insights:** The user continues to express an interest in hair care application methods, emphasizing the importance of effective washing and conditioning to achieve softness after installations, further refining their approach to hair care.",
  "metrics": {
    "rouge1_f": 0.13862815884476534,
    "rouge2_f": 0.015907447577729574,
    "rougeL_f": 0.06787003610108303,
    "meteor": 0.054509577754090585,
    "bleu1": 0.007228572696988907,
    "bleu2": 0.0018696357384023511,
    "bleu3": 0.00028937494251242044,
    "bleu4": 0.00011394375575477678,
    "bertscore_precision": 0.3688045144081116,
    "bertscore_recall": 0.4738173484802246,
    "bertscore_f1": 0.4147672653198242
  }
}